Repository: python/python-docs-fr
Catalog: faq/design.po
Languages: fr

source: Design and History FAQ
fr: FAQ histoire et design

source: Contents
fr: Sommaire

source: Why does Python use indentation for grouping of statements?
fr: Pourquoi Python utilise-t-il l'indentation pour grouper les instructions ?

source: Guido van Rossum believes that using indentation for grouping is extremely elegant and contributes a lot to the clarity of the average Python program. Most people learn to love this feature after a while.
fr: Guido van Rossum considère que l'usage de l'indentation pour regrouper les blocs d'instruction est élégant et contribue énormément à la clarté globale du programme Python. La plupart des gens finissent par aimer cette particularité au bout d'un moment.

source: Since there are no begin/end brackets there cannot be a disagreement between grouping perceived by the parser and the human reader. Occasionally C programmers will encounter a fragment of code like this::
fr: Comme il n'y a pas d'accolades de début/fin, il ne peut y avoir de différence entre le bloc perçu par l'analyseur syntaxique et le lecteur humain. Parfois les programmeurs C pourront trouver un morceau de code comme celui-ci ::

source: Only the ``x++`` statement is executed if the condition is true, but the indentation leads you to believe otherwise. Even experienced C programmers will sometimes stare at it a long time wondering why ``y`` is being decremented even for ``x > y``.
fr: Seule l'instruction ``x++`` sera exécutée si la condition est vraie, mais l'indentation pourrait vous faire penser le contraire. Mêmes des développeurs C expérimentés resteront pendant un moment à se demander pourquoi ``y`` est décrémenté même si ``x > y``.

source: Because there are no begin/end brackets, Python is much less prone to coding-style conflicts. In C there are many different ways to place the braces. If you're used to reading and writing code that uses one style, you will feel at least slightly uneasy when reading (or being required to write) another style.
fr: Comme il n'y a pas d'accolades de début/fin, Python est moins sujet aux conflits de style de code. En C, on peut placer les accolades de nombreuses façons. Si vous êtes habitués à lire et écrire selon un style particulier, vous pourriez vous sentir perturbé en lisant (ou en devant écrire) avec un autre style.

source: Many coding styles place begin/end brackets on a line by themselves. This makes programs considerably longer and wastes valuable screen space, making it harder to get a good overview of a program. Ideally, a function should fit on one screen (say, 20--30 lines). 20 lines of Python can do a lot more work than 20 lines of C. This is not solely due to the lack of begin/end brackets -- the lack of declarations and the high-level data types are also responsible -- but the indentation-based syntax certainly helps.
fr: Nombre de styles de programmation utilisent des accolades de début/fin sur une ligne à part. Cela rend les programmes beaucoup plus longs et fait perdre une bonne partie de l'espace visible sur l'écran, empêchant un peu d'avoir une vue globale du programme. Idéalement, une fonction doit être visible sur un écran (environ 20 ou 30 lignes). 20 lignes de Python peuvent faire beaucoup plus que 20 lignes de C. Ce n'est pas seulement dû à l'absence d'accolades de début/fin -- l'absence de déclarations et la présence de types de haut-niveau en sont également responsables -- mais la syntaxe basée sur l'indentation aide sûrement.

source: Why am I getting strange results with simple arithmetic operations?
fr: Pourquoi ai-je d'étranges résultats suite à de simples opérations arithmétiques ?

source: See the next question.
fr: Voir la question suivante.

source: Why are floating-point calculations so inaccurate?
fr: Pourquoi les calculs à virgules flottantes sont si imprécis ?

source: Users are often surprised by results like this::
fr: Les gens sont très souvent surpris par des résultats comme celui-ci ::

source: and think it is a bug in Python. It's not. This has little to do with Python, and much more to do with how the underlying platform handles floating-point numbers.
fr: et pensent que c'est un *bug* dans Python. Ça ne l'est pas. Ceci n'a d'ailleurs que peu à voir avec Python, mais avec la manière dont la plateforme sous-jacente gère les nombres à virgule flottante.

source: The :class:`float` type in CPython uses a C ``double`` for storage. A :class:`float` object's value is stored in binary floating-point with a fixed precision (typically 53 bits) and Python uses C operations, which in turn rely on the hardware implementation in the processor, to perform floating-point operations. This means that as far as floating-point operations are concerned, Python behaves like many popular languages including C and Java.
fr: La classe :class:`float` dans CPython utilise le type double du langage C comme stockage. La valeur d'un objet :class:`float` est stockée dans un format binaire à virgule flottante avec une précision fixe (généralement 53 bits). Python utilise des opérations qui proviennent du langage C qui à leur tour reposent sur l'implémentation au niveau du processeur afin d'effectuer des opérations en virgule flottante. Cela signifie que dans le cadre des opérations sur les nombres à virgule flottante, Python se comporte comme beaucoup de langages populaires dont C et Java.

source: Many numbers that can be written easily in decimal notation cannot be expressed exactly in binary floating-point. For example, after::
fr: Beaucoup de nombres pouvant être écrits facilement en notation décimale ne peuvent pas s'exprimer de manière exacte en binaire à virgule flottante. Par exemple, après ::

source: the value stored for ``x`` is a (very good) approximation to the decimal value ``1.2``, but is not exactly equal to it. On a typical machine, the actual stored value is::
fr: la valeur stockée pour ``x`` est une (très bonne) approximation de la valeur décimale ``1.2``, mais cette valeur n'est pas exacte. Sur une machine typique, la valeur stockée est en fait ::

source: which is exactly::
fr: qui est, exactement ::

source: The typical precision of 53 bits provides Python floats with 15--16 decimal digits of accuracy.
fr: La précision typique de 53 bits des *floats* Python permet une précision de 15--16 décimales.

source: For a fuller explanation, please see the :ref:`floating point arithmetic <tut-fp-issues>` chapter in the Python tutorial.
fr: Veuillez vous référer au chapitre sur :ref:`floating point arithmetic <tut-fp-issues>` du tutoriel python pour de plus amples informations.

source: Why are Python strings immutable?
fr: Pourquoi les chaînes de caractères Python sont-elles immuables ?

source: There are several advantages.
fr: Il y a plusieurs avantages.

source: One is performance: knowing that a string is immutable means we can allocate space for it at creation time, and the storage requirements are fixed and unchanging. This is also one of the reasons for the distinction between tuples and lists.
fr: La première concerne la performance : savoir qu'une chaîne de caractères est immuable signifie que l'allocation mémoire allouée lors de la création de cette chaîne est fixe et figée. C'est aussi l'une des raisons pour lesquelles on fait la distinction entre les *tuples* et les listes.

source: Another advantage is that strings in Python are considered as "elemental" as numbers. No amount of activity will change the value 8 to anything else, and in Python, no amount of activity will change the string "eight" to anything else.
fr: Un autre avantage est que les chaînes en Python sont considérées aussi "élémentaires" que les nombres. Aucun processus ne changera la valeur du nombre 8 en autre chose, et en Python, aucun processus changera la chaîne de caractère "huit" en autre chose.

source: Why must 'self' be used explicitly in method definitions and calls?
fr: Pourquoi "self" doit-il être explicitement utilisé dans les définitions et les appels de méthode ?

source: The idea was borrowed from Modula-3. It turns out to be very useful, for a variety of reasons.
fr: L'idée a été empruntée à Modula-3. Il s'avère être très utile, pour diverses raisons.

source: First, it's more obvious that you are using a method or instance attribute instead of a local variable. Reading ``self.x`` or ``self.meth()`` makes it absolutely clear that an instance variable or method is used even if you don't know the class definition by heart. In C++, you can sort of tell by the lack of a local variable declaration (assuming globals are rare or easily recognizable) -- but in Python, there are no local variable declarations, so you'd have to look up the class definition to be sure. Some C++ and Java coding standards call for instance attributes to have an ``m_`` prefix, so this explicitness is still useful in those languages, too.
fr: Tout d'abord, il est plus évident d'utiliser une méthode ou un attribut d'instance par exemple au lieu d'une variable locale. Lire ``self.x`` ou ``self.meth()`` est sans ambiguïté sur le fait que c'est une variable d'instance ou une méthode qui est utilisée, même si vous ne connaissez pas la définition de classe par cœur. En C++, vous pouvez les reconnaitre par l'absence d'une déclaration de variable locale (en supposant que les variables globales sont rares ou facilement reconnaissables) -- mais en Python, il n'y a pas de déclarations de variables locales, de sorte que vous devez chercher la définition de classe pour être sûr. Certaines normes de programmation C++ et Java préfixent les attributs d'instance par ``m_``. Cette syntaxe explicite est ainsi utile également pour ces langages.

source: Second, it means that no special syntax is necessary if you want to explicitly reference or call the method from a particular class. In C++, if you want to use a method from a base class which is overridden in a derived class, you have to use the ``::`` operator -- in Python you can write ``baseclass.methodname(self, <argument list>)``. This is particularly useful for :meth:`__init__` methods, and in general in cases where a derived class method wants to extend the base class method of the same name and thus has to call the base class method somehow.
fr: Ensuite, ça veut dire qu'aucune syntaxe spéciale n'est nécessaire si vous souhaitez explicitement référencer ou appeler la méthode depuis une classe en particulier. En C++, si vous utilisez la méthode d'une classe de base elle-même surchargée par une classe dérivée, vous devez utiliser l'opérateur ``::`` -- en Python vous pouvez écrire ``baseclass.methodname(self, <argument list>)``. C'est particulièrement utile pour les méthodes :meth:`__init__`, et de manière générale dans les cas où une classe dérivée veut étendre la méthode du même nom de la classe de base, devant ainsi appeler la méthode de la classe de base d'une certaine manière.

source: Finally, for instance variables it solves a syntactic problem with assignment: since local variables in Python are (by definition!) those variables to which a value is assigned in a function body (and that aren't explicitly declared global), there has to be some way to tell the interpreter that an assignment was meant to assign to an instance variable instead of to a local variable, and it should preferably be syntactic (for efficiency reasons). C++ does this through declarations, but Python doesn't have declarations and it would be a pity having to introduce them just for this purpose. Using the explicit ``self.var`` solves this nicely. Similarly, for using instance variables, having to write ``self.var`` means that references to unqualified names inside a method don't have to search the instance's directories. To put it another way, local variables and instance variables live in two different namespaces, and you need to tell Python which namespace to use.
fr: Enfin, pour des variables d'instance, ça résout un problème syntactique pour l'assignation : puisque les variables locales en Python sont (par définition !) ces variables auxquelles les valeurs sont assignées dans le corps d'une fonction (et n'étant pas déclarées explicitement globales), il doit y avoir un moyen de dire à l'interpréteur qu'une assignation est censée assigner une variable d'instance plutôt qu'une variable locale, et doit de préférence être syntactique (pour des raisons d'efficacité). C++ fait ça au travers de déclarations, mais Python n'a pas de déclarations et ça serait dommage d'avoir à les introduire juste pour cette raison. Utiliser explicitement ``self.var`` résout ça avec élégance. Pareillement, pour utiliser des variables d'instance, avoir à écrire ``self.var`` signifie que les références vers des noms non-qualifiés au sein d'une méthode n'ont pas à être cherchés dans l'annuaire d'instances. En d'autres termes, les variables locales et les variables d'instance vivent dans deux différents espaces de nommage, et vous devez dire à Python quel espace de nommage utiliser.

source: Why can't I use an assignment in an expression?
fr: Pourquoi ne puis-je pas utiliser d'assignation dans une expression ?

source: Starting in Python 3.8, you can!
fr: Depuis Python 3.8, c'est possible !

source: Assignment expressions using the walrus operator `:=` assign a variable in an expression::
fr: Les expressions d'affectation qui utilisent l'opérateur morse `:=` affectent une variable dans une expression ::

source: See :pep:`572` for more information.
fr: Voir la :pep:`572` pour plus d'informations.

source: Why does Python use methods for some functionality (e.g. list.index()) but functions for other (e.g. len(list))?
fr: Pourquoi Python utilise des méthodes pour certaines fonctionnalités (ex : ``list.index()``) mais des fonctions pour d'autres (ex : ``len(list)``) ?

source: As Guido said:
fr: Comme l'a dit Guido :

source: (a) For some operations, prefix notation just reads better than postfix -- prefix (and infix!) operations have a long tradition in mathematics which likes notations where the visuals help the mathematician thinking about a problem. Compare the easy with which we rewrite a formula like x*(a+b) into x*a + x*b to the clumsiness of doing the same thing using a raw OO notation.
fr: (a) Pour certaines opérations, la notation préfixe se lit mieux que celle suffixe -- les opérations préfixe (et infixe !) sont une longue tradition en mathématique, où on apprécie les notations qui aident visuellement le mathématicien à réfléchir sur un problème. Comparez la facilité avec laquelle nous réécrivons une formule comme x*(a+b) en x*a + x*b à la lourdeur de faire la même chose avec une notation orientée objet brute.

source: (b) When I read code that says len(x) I *know* that it is asking for the length of something. This tells me two things: the result is an integer, and the argument is some kind of container. To the contrary, when I read x.len(), I have to already know that x is some kind of container implementing an interface or inheriting from a class that has a standard len(). Witness the confusion we occasionally have when a class that is not implementing a mapping has a get() or keys() method, or something that isn't a file has a write() method.
fr: (b) Quand je lis du code qui dit ``len(x)`` *je sais* qu'il demande la longueur de quelque chose. Cela me dit deux choses : le résultat est un entier, et l'argument est une sorte de conteneur. Au contraire, quand je lis ``x.len()``, je dois déjà savoir que x est une sorte de conteneur implémentant une interface ou héritant d'une classe qui a un ``len()`` standard. Voyez la confusion qui arrive parfois quand une classe qui n'implémente pas une interface de dictionnaire a une méthode ``get()`` ou ``key()``, ou quand un objet qui n'est pas un fichier implémente une méthode ``write()``.

source: Why is join() a string method instead of a list or tuple method?
fr: Pourquoi ``join()`` est une méthode de chaîne plutôt qu'une de liste ou de tuple ?

source: Strings became much more like other standard types starting in Python 1.6, when methods were added which give the same functionality that has always been available using the functions of the string module. Most of these new methods have been widely accepted, but the one which appears to make some programmers feel uncomfortable is::
fr: Les chaînes sont devenues bien plus comme d'autres types standards à partir de Python 1.6, lorsque les méthodes ont été ajoutées fournissant ainsi les mêmes fonctionnalités que celles qui étaient déjà disponibles en utilisant les fonctions du module string. La plupart de ces nouvelles méthodes ont été largement acceptées, mais celle qui semble rendre certains programmeurs inconfortables est ::

source: which gives the result::
fr: qui donne le résultat ::

source: There are two common arguments against this usage.
fr: Il y a deux arguments fréquents contre cet usage.

source: The first runs along the lines of: "It looks really ugly using a method of a string literal (string constant)", to which the answer is that it might, but a string literal is just a fixed value. If the methods are to be allowed on names bound to strings there is no logical reason to make them unavailable on literals.
fr: Le premier se caractérise par les lignes suivantes : "C'est vraiment moche d'utiliser une méthode de chaîne littérale (chaîne constante)", à laquelle la réponse est qu'il se peut, mais une chaîne littérale est juste une valeur fixe. Si la méthode est autorisée sur des noms liés à des chaînes, il n'y a pas de raison logique à les rendre indisponibles sur des chaînes littérales.

source: The second objection is typically cast as: "I am really telling a sequence to join its members together with a string constant". Sadly, you aren't. For some reason there seems to be much less difficulty with having :meth:`~str.split` as a string method, since in that case it is easy to see that ::
fr: La deuxième objection se réfère typiquement à : "Je suis réellement en train de dire à une séquence de joindre ses membres avec une constante de chaîne". Malheureusement, vous ne l'êtes pas. Pour quelque raison, il semble être bien moins difficile d'avoir :meth:`~str.split` en tant que méthode de chaîne, puisque dans ce cas il est facile de voir que ::

source: is an instruction to a string literal to return the substrings delimited by the given separator (or, by default, arbitrary runs of white space).
fr: est une instruction à une chaîne littérale de renvoyer les sous-chaînes délimitées par le séparateur fournit (ou, par défaut, les espaces, ou groupes d'espaces).

source: :meth:`~str.join` is a string method because in using it you are telling the separator string to iterate over a sequence of strings and insert itself between adjacent elements. This method can be used with any argument which obeys the rules for sequence objects, including any new classes you might define yourself. Similar methods exist for bytes and bytearray objects.
fr: :meth:`~str.join` est une méthode de chaîne parce qu'en l'utilisant vous dites au séparateur de chaîne d'itérer une séquence de chaînes et de s'insérer entre les éléments adjacents. Cette méthode peut être utilisée avec n'importe quel argument qui obéit aux règles d'objets séquence, incluant n'importe quelles nouvelles classes que vous pourriez définir vous-même. Des méthodes similaires existent pour des objets ``bytes`` et ``bytearray``.

source: How fast are exceptions?
fr: À quel point les exceptions sont-elles rapides ?

source: A try/except block is extremely efficient if no exceptions are raised. Actually catching an exception is expensive. In versions of Python prior to 2.0 it was common to use this idiom::
fr: Un bloc ``try`` / ``except`` est extrêmement efficient tant qu'aucune exception ne sont levée. En effet, intercepter une exception s'avère coûteux. Dans les versions de précédant Python 2.0, il était courant d'utiliser cette pratique ::

source: This only made sense when you expected the dict to have the key almost all the time. If that wasn't the case, you coded it like this::
fr: Cela n'a de sens que si vous vous attendez à ce que le dictionnaire ait la clé presque tout le temps. Si ce n'était pas le cas, vous l'auriez codé comme suit ::

source: For this specific case, you could also use ``value = dict.setdefault(key, getvalue(key))``, but only if the ``getvalue()`` call is cheap enough because it is evaluated in all cases.
fr: Pour ce cas, vous pouvez également utiliser ``value = dict.setdefault(key, getvalue(key))``, mais seulement si l'appel à ``getvalue()`` est suffisamment peu coûteux car il est évalué dans tous les cas.

source: Why isn't there a switch or case statement in Python?
fr: Pourquoi n'y a-t-il pas une instruction *switch* ou une structure similaire à *switch / case* en Python ?

source: You can do this easily enough with a sequence of ``if... elif... elif... else``. There have been some proposals for switch statement syntax, but there is no consensus (yet) on whether and how to do range tests. See :pep:`275` for complete details and the current status.
fr: Vous pouvez le faire assez facilement avec une séquence de ``if... elif... elif... else``. Il y a eu quelques propositions pour la syntaxe de l'instruction ``switch``, mais il n'y a pas (encore) de consensus sur le cas des intervalles. Voir la :pep:`275` pour tous les détails et l'état actuel.

source: For cases where you need to choose from a very large number of possibilities, you can create a dictionary mapping case values to functions to call. For example::
fr: Dans les cas où vous devez choisir parmi un très grand nombre de possibilités, vous pouvez créer un dictionnaire faisant correspondre des valeurs à des fonctions à appeler. Par exemple ::

source: For calling methods on objects, you can simplify yet further by using the :func:`getattr` built-in to retrieve methods with a particular name::
fr: Pour appeler les méthodes sur des objets, vous pouvez simplifier davantage en utilisant la fonction native :func:`getattr` pour récupérer les méthodes avec un nom donné ::

source: It's suggested that you use a prefix for the method names, such as ``visit_`` in this example. Without such a prefix, if values are coming from an untrusted source, an attacker would be able to call any method on your object.
fr: Il est suggéré que vous utilisiez un préfixe pour les noms de méthodes, telles que ``visit_`` dans cet exemple. Sans ce préfixe, si les valeurs proviennent d'une source non fiable, un attaquant serait en mesure d'appeler n'importe quelle méthode sur votre objet.

source: Can't you emulate threads in the interpreter instead of relying on an OS-specific thread implementation?
fr: Est-il possible d'émuler des fils d'exécution dans l'interpréteur plutôt que se baser sur les implémentations spécifique aux OS ?

source: Answer 1: Unfortunately, the interpreter pushes at least one C stack frame for each Python stack frame. Also, extensions can call back into Python at almost random moments. Therefore, a complete threads implementation requires thread support for C.
fr: Réponse 1 : Malheureusement, l'interpréteur pousse au moins un bloc de pile C (*stack frame*) pour chaque bloc de pile de Python. Aussi, les extensions peuvent rappeler dans Python à presque n'importe quel moment. Par conséquent, une implémentation complète des fils d'exécution nécessiterai un support complet en C.

source: Answer 2: Fortunately, there is `Stackless Python <https://github.com/stackless-dev/stackless/wiki>`_, which has a completely redesigned interpreter loop that avoids the C stack.
fr: Réponse 2 : heureusement, il existe `Stackless Python <https://github.com/stackless-dev/stackless/wiki>`_, qui a complètement ré-architecturé la boucle principale de l'interpréteur afin de ne pas utiliser la pile C.

source: Why can't lambda expressions contain statements?
fr: Pourquoi les expressions lambda ne peuvent pas contenir d'instructions ?
