Repository: python/python-docs-fr
Catalog: faq/design.po
Languages: fr

source: If you want to return a new list, use the built-in :func:`sorted` function instead. This function creates a new list from a provided iterable, sorts it and returns it. For example, here's how to iterate over the keys of a dictionary in sorted order::
fr: Si vous souhaitez retourner une nouvelle liste, utilisez plutôt la fonction native :func:`sorted`. Cette fonction crée une nouvelle liste à partir d’un itérable fourni, la trie et la retourne. Par exemple, voici comment itérer sur les clefs d’un dictionnaire dans l’ordre trié ::

source: How do you specify and enforce an interface spec in Python?
fr: Comment spécifiez-vous et appliquez-vous une spécification d’interface en Python ?

source: An interface specification for a module as provided by languages such as C++ and Java describes the prototypes for the methods and functions of the module. Many feel that compile-time enforcement of interface specifications helps in the construction of large programs.
fr: Une spécification d'interface pour un module fourni par des langages tels que C++ et Java décrit les prototypes pour les méthodes et les fonctions du module. Beaucoup estiment que la vérification au moment de la compilation des spécifications d'interface aide à la construction de grands programmes.

source: Python 2.6 adds an :mod:`abc` module that lets you define Abstract Base Classes (ABCs). You can then use :func:`isinstance` and :func:`issubclass` to check whether an instance or a class implements a particular ABC. The :mod:`collections.abc` module defines a set of useful ABCs such as :class:`~collections.abc.Iterable`, :class:`~collections.abc.Container`, and :class:`~collections.abc.MutableMapping`.
fr: Python 2.6 ajoute un module :mod:`abc` qui vous permet de définir des classes de base abstraites (ABCs). Vous pouvez ensuite utiliser :func:`isinstance` et :func:`issubclass` pour vérifier si une instance ou une classe implémente une ABC particulière. Le module :mod:`collections.abc` définit un ensemble d'ABCs utiles telles que :class:`~collections.abc.Iterable`, :class:`~collections.abc.Container` et :class:`collections.abc.MutableMapping`.

source: For Python, many of the advantages of interface specifications can be obtained by an appropriate test discipline for components. There is also a tool, PyChecker, which can be used to find problems due to subclassing.
fr: Pour Python, la plupart des avantages des spécifications d'interface peuvent être obtenus par une discipline de test appropriée pour les composants. Il existe aussi un outil, PyChecker, qui peut être utilisé pour trouver des problèmes d'héritage.

source: A good test suite for a module can both provide a regression test and serve as a module interface specification and a set of examples. Many Python modules can be run as a script to provide a simple "self test." Even modules which use complex external interfaces can often be tested in isolation using trivial "stub" emulations of the external interface. The :mod:`doctest` and :mod:`unittest` modules or third-party test frameworks can be used to construct exhaustive test suites that exercise every line of code in a module.
fr: Une bonne suite de tests pour un module peut à la fois fournir un test de non régression et servir de spécification d'interface de module ainsi qu'un ensemble d'exemples. De nombreux modules Python peuvent être exécutés en tant que script pour fournir un simple « auto-test ». Même les modules qui utilisent des interfaces externes complexes peuvent souvent être testés isolément à l'aide d'émulations triviales embryonnaires de l'interface externe. Les modules :mod:`doctest` et :mod:`UnitTest` ou des frameworks de test tiers peuvent être utilisés pour construire des suites de tests exhaustives qui éprouvent chaque ligne de code dans un module.

source: An appropriate testing discipline can help build large complex applications in Python as well as having interface specifications would. In fact, it can be better because an interface specification cannot test certain properties of a program. For example, the :meth:`append` method is expected to add new elements to the end of some internal list; an interface specification cannot test that your :meth:`append` implementation will actually do this correctly, but it's trivial to check this property in a test suite.
fr: Une discipline de test appropriée peut aider à construire des applications complexes de grande taille en Python aussi bien que le feraient des spécifications d'interface. En fait, c'est peut être même mieux parce qu'une spécification d'interface ne peut pas tester certaines propriétés d'un programme. Par exemple, la méthode :meth:`Append` est censée ajouter de nouveaux éléments à la fin d'une liste « sur place » ; une spécification d'interface ne peut pas tester que votre implémentation de :meth:`append` va réellement le faire correctement, mais il est trivial de vérifier cette propriété dans une suite de tests.

source: Writing test suites is very helpful, and you might want to design your code with an eye to making it easily tested. One increasingly popular technique, test-directed development, calls for writing parts of the test suite first, before you write any of the actual code. Of course Python allows you to be sloppy and not write test cases at all.
fr: L'écriture des suites de tests est très utile, et vous voudrez peut-être concevoir votre code de manière à le rendre facilement testable. Une technique de plus en plus populaire, le développement dirigé par les tests, requiert d'écrire d'abord des éléments de la suite de tests, avant d'écrire le code réel. Bien sûr, Python vous permet d'être laxiste et de ne pas écrire de test du tout.

source: Why is there no goto?
fr: Pourquoi n'y a-t-il pas de ``goto`` en Python ?

source: You can use exceptions to provide a "structured goto" that even works across function calls. Many feel that exceptions can conveniently emulate all reasonable uses of the "go" or "goto" constructs of C, Fortran, and other languages. For example::
fr: Vous pouvez utiliser les exceptions afin de mettre en place un "``goto`` structuré" qui fonctionne même avec les appels de fonctions. Beaucoup de personnes estiment que les exceptions peuvent émuler idéalement tout utilisation raisonnable des constructions ``go`` ou ``goto`` en C, en Fortran ou autres langages de programmation. Par exemple ::

source: This doesn't allow you to jump into the middle of a loop, but that's usually considered an abuse of goto anyway. Use sparingly.
fr: Cela ne vous permet pas de sauter au milieu d'une boucle. Néanmoins, dans tous les cas cela est généralement considéré comme un abus de ``goto``. À Utiliser avec parcimonie.

source: Why can't raw strings (r-strings) end with a backslash?
fr: Pourquoi les chaînes de caractères brutes (r-strings) ne peuvent-elles pas se terminer par un *backslash* ?

source: More precisely, they can't end with an odd number of backslashes: the unpaired backslash at the end escapes the closing quote character, leaving an unterminated string.
fr: Plus précisément, elles ne peuvent pas se terminer par un nombre impair de *backslashes* : le *backslash* non appairé à la fin échappe le caractère de guillemet final, laissant une chaîne non terminée.

source: Raw strings were designed to ease creating input for processors (chiefly regular expression engines) that want to do their own backslash escape processing. Such processors consider an unmatched trailing backslash to be an error anyway, so raw strings disallow that. In return, they allow you to pass on the string quote character by escaping it with a backslash. These rules work well when r-strings are used for their intended purpose.
fr: Les chaînes brutes ont été conçues pour faciliter la création de données pour les processeurs de texte (principalement les moteurs d'expressions régulières) qui veulent faire leur propre traitement d'échappement d'*antislashes*. Ces processeurs considèrent un *antislash* de fin non-appairé comme une erreur, alors les chaînes brutes ne le permettent pas. En retour, elles vous permettent de transmettre le caractère de citation de la chaîne en l'échappant avec un *antislash*. Ces règles fonctionnent bien lorsque les chaînes brutes sont utilisées pour leur but premier.

source: If you're trying to build Windows pathnames, note that all Windows system calls accept forward slashes too::
fr: Si vous essayez de construire des chemins d'accès Windows, notez que tous les appels système Windows acceptent également les *slashes* "classiques" ::

source: If you're trying to build a pathname for a DOS command, try e.g. one of ::
fr: Si vous essayez de construire un chemin d'accès pour une commande DOS, essayez par exemple l'un de ceux-là ::

source: Why doesn't Python have a "with" statement for attribute assignments?
fr: Pourquoi la déclaration ``with`` pour les assignations d'attributs n'existe pas en Python ?

source: Python has a 'with' statement that wraps the execution of a block, calling code on the entrance and exit from the block. Some language have a construct that looks like this::
fr: Python a une instruction ``with`` qui encapsule l'exécution d'un bloc, en appelant le code sur l'entrée et la sortie du bloc. Certains langages possèdent une construction qui ressemble à ceci ::

source: In Python, such a construct would be ambiguous.
fr: En Python, une telle construction serait ambiguë.

source: Other languages, such as Object Pascal, Delphi, and C++, use static types, so it's possible to know, in an unambiguous way, what member is being assigned to. This is the main point of static typing -- the compiler *always* knows the scope of every variable at compile time.
fr: Les autres langages, tels que le Pascal, le Delphi et le C++ utilisent des types statiques, il est donc possible de savoir d'une manière claire et directe ce à quoi est attribué un membre. C'est le point principal du typage statique --le compilateur connaît *toujours* la portée de toutes les variables au moment de la compilation.

source: Python uses dynamic types. It is impossible to know in advance which attribute will be referenced at runtime. Member attributes may be added or removed from objects on the fly. This makes it impossible to know, from a simple reading, what attribute is being referenced: a local one, a global one, or a member attribute?
fr: Python utilise le typage dynamique. Il est impossible de savoir à l'avance quel attribut est utilisé comme référence lors de l'exécution. Les attributs membres peuvent être ajoutés ou retirés des objets à la volée. Il est donc impossible de savoir, d'une simple lecture, quel attribut est référencé : s'il est local, global ou un attribut membre?

source: For instance, take the following incomplete snippet::
fr: Prenons par exemple l'extrait incomplet suivant ::

source: The snippet assumes that "a" must have a member attribute called "x". However, there is nothing in Python that tells the interpreter this. What should happen if "a" is, let us say, an integer? If there is a global variable named "x", will it be used inside the with block? As you see, the dynamic nature of Python makes such choices much harder.
fr: L'extrait suppose que "a" doit avoir un attribut membre appelé "x". Néanmoins, il n'y a rien en Python qui en informe l'interpréteur. Que se passe-t-il si "a" est, disons, un entier ? Si une variable globale nommée "x" existe, sera-t-elle utilisée dans le bloc ``with`` ? Comme vous voyez, la nature dynamique du Python rend ces choix beaucoup plus difficiles.

source: The primary benefit of "with" and similar language features (reduction of code volume) can, however, easily be achieved in Python by assignment. Instead of::
fr: L'avantage principal de ``with`` et des fonctionnalités de langage similaires (réduction du volume de code) peut, cependant, être facilement réalisé en Python par assignation. Au lieu de ::

source: write this::
fr: écrivez ceci ::

source: This also has the side-effect of increasing execution speed because name bindings are resolved at run-time in Python, and the second version only needs to perform the resolution once.
fr: Cela a également pour effet secondaire d'augmenter la vitesse d'exécution car les liaisons de noms sont résolues au moment de l'exécution en Python, et la deuxième version n'a besoin d'exécuter la résolution qu'une seule fois.

source: Why are colons required for the if/while/def/class statements?
fr: Pourquoi les deux-points sont-ils nécessaires pour les déclarations ``if/while/def/class`` ?

source: The colon is required primarily to enhance readability (one of the results of the experimental ABC language). Consider this::
fr: Le deux-points est principalement nécessaires pour améliorer la lisibilité (l'un des résultats du langage expérimental ABC). Considérez ceci ::

source: Notice how the second one is slightly easier to read. Notice further how a colon sets off the example in this FAQ answer; it's a standard usage in English.
fr: Remarquez comment le deuxième est un peu plus facile à lire. Remarquez aussi comment un deux-points introduit l'exemple dans cette réponse à la FAQ ; c'est un usage standard en anglais.

source: Another minor reason is that the colon makes it easier for editors with syntax highlighting; they can look for colons to decide when indentation needs to be increased instead of having to do a more elaborate parsing of the program text.
fr: Une autre raison mineure est que les deux-points facilitent la tâche des éditeurs avec coloration syntaxique ; ils peuvent rechercher les deux-points pour décider quand l'indentation doit être augmentée au lieu d'avoir à faire une analyse plus élaborée du texte du programme.

source: Why does Python allow commas at the end of lists and tuples?
fr: Pourquoi Python permet-il les virgules à la fin des listes et des tuples ?

source: Python lets you add a trailing comma at the end of lists, tuples, and dictionaries::
fr: Python vous permet d'ajouter une virgule à la fin des listes, des tuples et des dictionnaires ::

source: There are several reasons to allow this.
fr: Il y a plusieurs raisons d'accepter cela.

source: When you have a literal value for a list, tuple, or dictionary spread across multiple lines, it's easier to add more elements because you don't have to remember to add a comma to the previous line. The lines can also be reordered without creating a syntax error.
fr: Lorsque vous avez une valeur littérale pour une liste, un tuple ou un dictionnaire réparti sur plusieurs lignes, il est plus facile d'ajouter plus d'éléments parce que vous n'avez pas besoin de vous rappeler d'ajouter une virgule à la ligne précédente. Les lignes peuvent aussi être réorganisées sans créer une erreur de syntaxe.

source: Accidentally omitting the comma can lead to errors that are hard to diagnose. For example::
fr: L'omission accidentelle de la virgule peut entraîner des erreurs difficiles à diagnostiquer, par exemple ::

source: This list looks like it has four elements, but it actually contains three: "fee", "fiefoo" and "fum". Always adding the comma avoids this source of error.
fr: Cette liste a l'air d'avoir quatre éléments, mais elle en contient en fait trois : "*fee*", "*fiefoo*" et "*fum*". Toujours ajouter la virgule permet d'éviter cette source d'erreur.

source: Allowing the trailing comma may also make programmatic code generation easier.
fr: Permettre la virgule de fin peut également faciliter la génération de code.
