Repository: python/python-docs-fr
Catalog: faq/design.po
Languages: fr

source: Python lambda expressions cannot contain statements because Python's syntactic framework can't handle statements nested inside expressions. However, in Python, this is not a serious problem. Unlike lambda forms in other languages, where they add functionality, Python lambdas are only a shorthand notation if you're too lazy to define a function.
fr: Les expressions lambda de Python ne peuvent pas contenir d'instructions parce que le cadre syntaxique de Python ne peut pas gérer les instructions imbriquées à l'intérieur d'expressions. Cependant, en Python, ce n'est pas vraiment un problème. Contrairement aux formes lambda dans d'autres langages, où elles ajoutent des fonctionnalités, les expressions lambda de Python sont seulement une notation concise si vous êtes trop paresseux pour définir une fonction.

source: Functions are already first class objects in Python, and can be declared in a local scope. Therefore the only advantage of using a lambda instead of a locally-defined function is that you don't need to invent a name for the function -- but that's just a local variable to which the function object (which is exactly the same type of object that a lambda expression yields) is assigned!
fr: Les fonctions sont déjà des objets de première classe en Python et peuvent être déclarées dans une portée locale. L'unique avantage d'utiliser une fonction lambda au lieu d'une fonction définie localement est que vous n'avez nullement besoin d'un nom pour la fonction -- Mais c'est juste une variable locale à laquelle est affecté l'objet fonction (qui est exactement le même type d'objet qui donne une expression lambda) !

source: Can Python be compiled to machine code, C or some other language?
fr: Python peut-il être compilé en code machine, en C ou dans un autre langage ?

source: `Cython <http://cython.org/>`_ compiles a modified version of Python with optional annotations into C extensions. `Nuitka <http://www.nuitka.net/>`_ is an up-and-coming compiler of Python into C++ code, aiming to support the full Python language. For compiling to Java you can consider `VOC <https://voc.readthedocs.io>`_.
fr: `Cython <http://cython.org/>`_ compile une version modifiée de Python avec des annotations optionnelles en extensions C. `Nuitka <http://www.nuitka.net/>`_ est un nouveau compilateur de Python vers C++, visant à supporter le langage Python entièrement. Pour compiler en Java, vous pouvez regarder `VOC <https://voc.readthedocs.io>`_.

source: How does Python manage memory?
fr: Comment Python gère la mémoire ?

source: The details of Python memory management depend on the implementation. The standard implementation of Python, :term:`CPython`, uses reference counting to detect inaccessible objects, and another mechanism to collect reference cycles, periodically executing a cycle detection algorithm which looks for inaccessible cycles and deletes the objects involved. The :mod:`gc` module provides functions to perform a garbage collection, obtain debugging statistics, and tune the collector's parameters.
fr: Les détails de la gestion de la mémoire en Python dépendent de l'implémentation. En effet, l'implémentation standard de Python, :term:`CPython`, utilise des compteurs de références afin de détecter des objets inaccessibles et un autre mécanisme pour collecter les références circulaires, exécutant périodiquement un algorithme de détection de cycles qui recherche les cycles inaccessibles et supprime les objets impliqués. Le module :mod:`gc` fournit des fonctions pour lancer le ramasse-miettes, d'obtenir des statistiques de débogage et ajuster ses paramètres.

source: Other implementations (such as `Jython <http://www.jython.org>`_ or `PyPy <http://www.pypy.org>`_), however, can rely on a different mechanism such as a full-blown garbage collector. This difference can cause some subtle porting problems if your Python code depends on the behavior of the reference counting implementation.
fr: Cependant, d'autres implémentations (par exemple `Jython <http://www.jython.org>`_ ou `PyPy <http://www.pypy.org>`_) peuvent compter sur un mécanisme différent comme un véritable ramasse-miette. Cette différence peut causer de subtils problèmes de portabilité si votre code Python dépend du comportement de l'implémentation du compteur de références.

source: In some Python implementations, the following code (which is fine in CPython) will probably run out of file descriptors::
fr: Dans certaines implémentations de Python, le code suivant (qui marche parfaitement avec *CPython*) aurait probablement manqué de descripteurs de fichiers ::

source: Indeed, using CPython's reference counting and destructor scheme, each new assignment to *f* closes the previous file. With a traditional GC, however, those file objects will only get collected (and closed) at varying and possibly long intervals.
fr: En effet, à l'aide du comptage de références et du destructeur d'objets de *CPython*, chaque nouvelle affectation à *f* ferme le fichier précédent. Cependant, avec un *GC* classique, ces objets seront seulement recueillies (et fermés) à intervalles variables et possiblement avec de longs intervalles.

source: If you want to write code that will work with any Python implementation, you should explicitly close the file or use the :keyword:`with` statement; this will work regardless of memory management scheme::
fr: Si vous souhaitez écrire du code qui fonctionne avec n'importe quelle implémentation de Python, vous devez explicitement fermer le fichier ou utiliser l'instruction :keyword:`with` ; ceci fonctionnera indépendamment du système de gestion de la mémoire ::

source: Why doesn't CPython use a more traditional garbage collection scheme?
fr: Pourquoi CPython n'utilise-il pas un ramasse-miette plus traditionnel ?

source: For one thing, this is not a C standard feature and hence it's not portable. (Yes, we know about the Boehm GC library. It has bits of assembler code for *most* common platforms, not for all of them, and although it is mostly transparent, it isn't completely transparent; patches are required to get Python to work with it.)
fr: D'une part, ce n'est pas une caractéristique normalisé en C et par conséquent ce n'est pas portable. (Oui, nous connaissons la bibliothèque *GC Boehm*. Elle contient du code assembleur pour la plupart des plates-formes classiques, mais pas toutes, et bien qu'elle soit le plus souvent transparent, c'est loin d'être le cas, des correctifs sont nécessaires afin que Python fonctionne correctement avec.)

source: Traditional GC also becomes a problem when Python is embedded into other applications. While in a standalone Python it's fine to replace the standard malloc() and free() with versions provided by the GC library, an application embedding Python may want to have its *own* substitute for malloc() and free(), and may not want Python's. Right now, CPython works with anything that implements malloc() and free() properly.
fr: Le *GC* classique devient également un problème lorsque Python est incorporé dans d'autres applications. Bien que dans une application Python, il ne soit pas gênant de remplacer les fonctions ``malloc()`` et ``free()` avec les versions fournies par la bibliothèque *GC*, une application incluant Python peut vouloir avoir ses propres implémentations de ``malloc()`` et ``free()`` et peut ne pas vouloir celles de Python. À l'heure actuelle, CPython fonctionne avec n'importe quelle implémentation correcte de ``malloc()`` et ``free()``.

source: Why isn't all memory freed when CPython exits?
fr: Pourquoi toute la mémoire n'est pas libérée lorsque *CPython* s'arrête ?

source: Objects referenced from the global namespaces of Python modules are not always deallocated when Python exits. This may happen if there are circular references. There are also certain bits of memory that are allocated by the C library that are impossible to free (e.g. a tool like Purify will complain about these). Python is, however, aggressive about cleaning up memory on exit and does try to destroy every single object.
fr: Les objets référencés depuis les espaces de nommage globaux des modules Python ne sont pas toujours désalloués lorsque Python s'arrête. Cela peut se produire s'il y a des références circulaires. Il y a aussi certaines parties de mémoire qui sont alloués par la bibliothèque C qui sont impossibles à libérer (par exemple un outil comme *Purify* s'en plaindra). Python est, cependant, agressif sur le nettoyage de la mémoire en quittant et cherche à détruire chaque objet.

source: If you want to force Python to delete certain things on deallocation use the :mod:`atexit` module to run a function that will force those deletions.
fr: Si vous voulez forcer Python à désallouer certains objets en quittant, utilisez le module :mod:`texit` pour exécuter une fonction qui va forcer ces destructions.

source: Why are there separate tuple and list data types?
fr: Pourquoi les *tuples* et les *list* sont deux types de données séparés ?

source: Lists and tuples, while similar in many respects, are generally used in fundamentally different ways. Tuples can be thought of as being similar to Pascal records or C structs; they're small collections of related data which may be of different types which are operated on as a group. For example, a Cartesian coordinate is appropriately represented as a tuple of two or three numbers.
fr: Les listes et les *tuples*, bien que semblable à bien des égards, sont généralement utilisés de façons fondamentalement différentes. Les *tuples* peuvent être considérés comme étant similaires aux dossiers en Pascal ou aux structures en C; Ce sont de petites collections de données associées qui peuvent être de différents types qui sont utilisées ensemble. Par exemple, un repère cartésien est correctement représenté comme un *tuple* de deux ou trois nombres.

source: Lists, on the other hand, are more like arrays in other languages. They tend to hold a varying number of objects all of which have the same type and which are operated on one-by-one. For example, ``os.listdir('.')`` returns a list of strings representing the files in the current directory. Functions which operate on this output would generally not break if you added another file or two to the directory.
fr: Les listes, ressemblent davantage à des tableaux dans d'autres langues. Elles ont tendance à contenir un nombre variable d'objets de même type manipulés individuellement. Par exemple, ``os.listdir('.')`` renvoie une liste de chaînes représentant les fichiers dans le dossier courant. Les fonctions travaillant sur cette sortie accepteraient généralement sans aucun problème que vous ajoutiez un ou deux fichiers supplémentaire dans le dossier.

source: Tuples are immutable, meaning that once a tuple has been created, you can't replace any of its elements with a new value. Lists are mutable, meaning that you can always change a list's elements. Only immutable elements can be used as dictionary keys, and hence only tuples and not lists can be used as keys.
fr: Les *tuples* sont immuables, ce qui signifie que lorsqu'un *tuple* a été créé, vous ne pouvez remplacer aucun de ses éléments par une nouvelle valeur. Les listes sont muables, ce qui signifie que vous pouvez toujours modifier les éléments d'une liste. Seuls des éléments immuables peuvent être utilisés comme clés de dictionnaires, et donc de ``tuple`` et ``list`` seul des *tuples* peuvent être utilisés comme clés.

source: How are lists implemented in CPython?
fr: Comment les listes sont-elles implémentées dans CPython ?

source: CPython's lists are really variable-length arrays, not Lisp-style linked lists. The implementation uses a contiguous array of references to other objects, and keeps a pointer to this array and the array's length in a list head structure.
fr: Les listes en CPython sont de vrais tableaux de longueur variable contrairement à des listes orientées *Lisp* (i.e des listes chaînées). L'implémentation utilise un tableau contigu de références à d'autres objets. Elle conserve également un pointeur vers ce tableau et la longueur du tableau dans une structure de tête de liste.

source: This makes indexing a list ``a[i]`` an operation whose cost is independent of the size of the list or the value of the index.
fr: Cela rend l'indexation d'une liste ``a[i]`` une opération dont le coût est indépendant de la taille de la liste ou de la valeur de l'indice.

source: When items are appended or inserted, the array of references is resized. Some cleverness is applied to improve the performance of appending items repeatedly; when the array must be grown, some extra space is allocated so the next few times don't require an actual resize.
fr: Lorsque des éléments sont ajoutés ou insérés, le tableau de références est redimensionné. Un savoir-faire ingénieux permet l'amélioration des performances lors de l'ajout fréquent d'éléments ; Lorsque le tableau doit être étendu, un certain espace supplémentaire est alloué de sorte que pour la prochaine fois, ceci ne nécessite plus un redimensionnement effectif.

source: How are dictionaries implemented in CPython?
fr: Comment les dictionnaires sont-ils implémentés dans CPython ?

source: CPython's dictionaries are implemented as resizable hash tables. Compared to B-trees, this gives better performance for lookup (the most common operation by far) under most circumstances, and the implementation is simpler.
fr: Les dictionnaires CPython sont implémentés sous forme de tables de hachage redimensionnables. Par rapport aux *B-trees*, cela donne de meilleures performances pour la recherche (l'opération la plus courante de loin) dans la plupart des circonstances, et leur implémentation est plus simple.

source: Dictionaries work by computing a hash code for each key stored in the dictionary using the :func:`hash` built-in function. The hash code varies widely depending on the key and a per-process seed; for example, "Python" could hash to -539294296 while "python", a string that differs by a single bit, could hash to 1142331976. The hash code is then used to calculate a location in an internal array where the value will be stored. Assuming that you're storing keys that all have different hash values, this means that dictionaries take constant time -- O(1), in Big-O notation -- to retrieve a key.
fr: Les dictionnaires fonctionnent en calculant un code de hachage pour chaque clé stockée dans le dictionnaire en utilisant la fonction :func:`hash`. Le code de hachage varie grandement selon la clé et du nombre de processus utilisés ; Par exemple, la chaine de caractère "Python" pourrait avoir comme code de hachage une valeur allant jusqu'à-539294296 tandis que la chaine "python",qui se distingue de la première par un seul bit, pourrait avoir comme code de hachage une valeur allant jusqu'à 1142331976. Le code de hachage est ensuite utilisé pour calculer un emplacement dans un tableau interne où la valeur est stockée. Dans l'hypothèse où vous stockez les clés qui ont toutes des valeurs de hachage différentes, cela signifie que le temps pour récupérer une clé est constant -- O(1), en notation grand O de Landau.

source: Why must dictionary keys be immutable?
fr: Pourquoi les clés du dictionnaire sont immuables ?

source: The hash table implementation of dictionaries uses a hash value calculated from the key value to find the key. If the key were a mutable object, its value could change, and thus its hash could also change. But since whoever changes the key object can't tell that it was being used as a dictionary key, it can't move the entry around in the dictionary. Then, when you try to look up the same object in the dictionary it won't be found because its hash value is different. If you tried to look up the old value it wouldn't be found either, because the value of the object found in that hash bin would be different.
fr: L'implémentation de la table de hachage des dictionnaires utilise une valeur de hachage calculée à partir de la valeur de la clé pour trouver la clé elle-même. Si la clé était un objet muable, sa valeur peut changer, et donc son hachage pourrait également changer. Mais toute personne modifiant l'objet clé ne peut pas dire qu'elle a été utilisée comme une clé de dictionnaire. Il ne peut déplacer l'entrée dans le dictionnaire. Ainsi, lorsque vous essayez de rechercher le même objet dans le dictionnaire, il ne sera pas disponible parce que sa valeur de hachage est différente. Si vous essayez de chercher l'ancienne valeur, elle serait également introuvable car la valeur de l'objet trouvé dans cet emplacement de hachage serait différente.

source: If you want a dictionary indexed with a list, simply convert the list to a tuple first; the function ``tuple(L)`` creates a tuple with the same entries as the list ``L``. Tuples are immutable and can therefore be used as dictionary keys.
fr: Si vous voulez un dictionnaire indexé avec une liste, il faut simplement convertir la liste en un *tuple* ; la fonction ``tuple(L)`` crée un *tuple* avec les mêmes entrées que la liste ``L``. Les *tuples* sont immuables et peuvent donc être utilisés comme clés du dictionnaire.

source: Some unacceptable solutions that have been proposed:
fr: Certaines solutions insatisfaisantes qui ont été proposées :

source: Hash lists by their address (object ID). This doesn't work because if you construct a new list with the same value it won't be found; e.g.::
fr: Les listes de hachage par leur adresse (*ID* de l'objet). Cela ne fonctionne pas parce que si vous créez une nouvelle liste avec la même valeur, elle ne sera pas retrouvée; par exemple ::

source: would raise a :exc:`KeyError` exception because the id of the ``[1, 2]`` used in the second line differs from that in the first line. In other words, dictionary keys should be compared using ``==``, not using :keyword:`is`.
fr: cela lèverait une exception :exc:`KeyError` car l'ID de ``[1, 2]`` utilisé dans la deuxième ligne diffère de celle de la première ligne. En d'autres termes, les clés de dictionnaire doivent être comparées à l'aide du comparateur ``==`` et non à l'aide du mot clé :keyword:`is`.

source: Make a copy when using a list as a key. This doesn't work because the list, being a mutable object, could contain a reference to itself, and then the copying code would run into an infinite loop.
fr: Faire une copie lors de l'utilisation d'une liste en tant que clé. Cela ne fonctionne pas puisque la liste, étant un objet muable, pourrait contenir une référence à elle-même ou avoir une boucle infinie au niveau du code copié.

source: Allow lists as keys but tell the user not to modify them. This would allow a class of hard-to-track bugs in programs when you forgot or modified a list by accident. It also invalidates an important invariant of dictionaries: every value in ``d.keys()`` is usable as a key of the dictionary.
fr: Autoriser les listes en tant que clés, mais indiquer à l'utilisateur de ne pas les modifier. Cela permettrait un ensemble de bogues difficiles à suivre dans les programmes lorsque vous avez oublié ou modifié une liste par accident. Cela casse également un impératif important des dictionnaires : chaque valeur de ``d.keys()`` est utilisable comme clé du dictionnaire.

source: Mark lists as read-only once they are used as a dictionary key. The problem is that it's not just the top-level object that could change its value; you could use a tuple containing a list as a key. Entering anything as a key into a dictionary would require marking all objects reachable from there as read-only -- and again, self-referential objects could cause an infinite loop.
fr: Marquer les listes comme étant en lecture seule une fois qu'elles sont utilisées comme clé de dictionnaire. Le problème est que ce n'est pas seulement l'objet de niveau supérieur qui pourrait changer sa valeur; vous pourriez utiliser un tuple contenant une liste comme clé. Utiliser n'importe quoi comme une clé dans un dictionnaire nécessiterait de marquer tous les objets accessibles à partir de là comme en lecture seule -- et encore une fois, les objets se faisant référence pourraient provoquer une boucle infinie.

source: There is a trick to get around this if you need to, but use it at your own risk: You can wrap a mutable structure inside a class instance which has both a :meth:`__eq__` and a :meth:`__hash__` method. You must then make sure that the hash value for all such wrapper objects that reside in a dictionary (or other hash based structure), remain fixed while the object is in the dictionary (or other structure). ::
fr: Il y a un truc pour contourner ceci si vous en avez besoin, mais utilisez-le à vos risques et périls. Vous pouvez encapsuler une structure mutable à l'intérieur d'une instance de classe qui a à la fois une méthode :meth:`__eq__` et :meth:`__hash__`. Vous devez ensuite vous assurer que la valeur de hachage pour tous ces objets *wrapper* qui résident dans un dictionnaire (ou une autre structure basée sur le hachage), restent fixes pendant que l'objet est dans le dictionnaire (ou une autre structure). ::

source: Note that the hash computation is complicated by the possibility that some members of the list may be unhashable and also by the possibility of arithmetic overflow.
fr: Notez que le calcul de hachage peut être compliqué car il est possible que certains membres de la liste peuvent être impossible à hacher et aussi par la possibilité de débordement arithmétique.

source: Furthermore it must always be the case that if ``o1 == o2`` (ie ``o1.__eq__(o2) is True``) then ``hash(o1) == hash(o2)`` (ie, ``o1.__hash__() == o2.__hash__()``), regardless of whether the object is in a dictionary or not. If you fail to meet these restrictions dictionaries and other hash based structures will misbehave.
fr: De plus, il faut toujours que, si ``o1 == o2`` (par exemple ``o1.__eq__(o2) vaut True``) alors ``hash(o1) == hash(o2)`` (par exemple, ``o1.__hash__() == o2.__hash__()``), que l’objet se trouve dans un dictionnaire ou pas. Si vous ne remplissez pas ces conditions, les dictionnaires et autres structures basées sur le hachage se comporteront mal.

source: In the case of ListWrapper, whenever the wrapper object is in a dictionary the wrapped list must not change to avoid anomalies. Don't do this unless you are prepared to think hard about the requirements and the consequences of not meeting them correctly. Consider yourself warned.
fr: Dans le cas de *ListWrapper*, chaque fois que l'objet *wrapper* est dans un dictionnaire, la liste encapsulée ne doit pas changer pour éviter les anomalies. Ne faites pas cela à moins que vous n’ayez pensé aux potentielles conséquences de ne pas satisfaire entièrement ces conditions. Vous avez été prévenus.

source: Why doesn't list.sort() return the sorted list?
fr: Pourquoi ``list.sort()`` ne renvoie pas la liste triée ?

source: In situations where performance matters, making a copy of the list just to sort it would be wasteful. Therefore, :meth:`list.sort` sorts the list in place. In order to remind you of that fact, it does not return the sorted list. This way, you won't be fooled into accidentally overwriting a list when you need a sorted copy but also need to keep the unsorted version around.
fr: Dans les situations où la performance est importante, faire une copie de la liste juste pour la trier serait un gaspillage. Par conséquent, :meth:`list.sort` trie la liste en place. Afin de vous le rappeler, il ne retourne pas la liste triée. De cette façon, vous ne serez pas dupés en écrasant accidentellement une liste lorsque vous avez besoin d’une copie triée, mais vous devrez également garder sous la main la version non triée.
