Repository: python/python-docs-fr
Catalog: faq/general.po
Languages: fr

source: Python in the real world
fr: Python c'est le monde réel

source: How stable is Python?
fr: Quel est le niveau de stabilité de Python ?

source: Very stable. New, stable releases have been coming out roughly every 6 to 18 months since 1991, and this seems likely to continue. As of version 3.9, Python will have a major new release every 12 months (:pep:`602`).
fr: Très stable. Les versions stables sont sorties environ tous les 6 à 18 mois depuis 1991, et il semble probable que ça continue. À partir de la version 3.9, Python aura une nouvelle version majeure tous les 12 mois (:pep:`602`).

source: The developers issue "bugfix" releases of older versions, so the stability of existing releases gradually improves. Bugfix releases, indicated by a third component of the version number (e.g. 3.5.3, 3.6.2), are managed for stability; only fixes for known problems are included in a bugfix release, and it's guaranteed that interfaces will remain the same throughout a series of bugfix releases.
fr: Les développeurs fournissent des versions correctives d'anciennes versions, ainsi la stabilité des versions existantes s'améliore. Les versions correctives, indiquées par le troisième chiffre du numéro de version (ex. 2.5.2, 2.6.2), sont gérées pour la stabilité, seules les corrections pour les problèmes connus sont inclus dans les versions correctives, et il est garanti que les interfaces resteront les mêmes tout au long de la série de versions correctives.

source: The latest stable releases can always be found on the `Python download page <https://www.python.org/downloads/>`_. There are two production-ready versions of Python: 2.x and 3.x. The recommended version is 3.x, which is supported by most widely used libraries. Although 2.x is still widely used, `it is not maintained anymore <https://www.python.org/dev/peps/pep-0373/>`_.
fr: Les dernières versions stables peuvent toujours être trouvées sur la `page de téléchargement Python <https://www.python.org/downloads/>`_. Il existe deux versions stables de Python : 2.x et 3.x, mais seule la version 3 est recommandée, c'est celle qui est compatible avec les bibliothèques les plus largement utilisées. Bien que Python 2 soit encore utilisé, `il n'est désormais plus maintenu <https://www.python.org/dev/peps/pep-0373/>`_.

source: How many people are using Python?
fr: Combien de personnes utilisent Python ?

source: There are probably millions of users, though it's difficult to obtain an exact count.
fr: Il y a probablement des millions d'utilisateurs, bien qu'il soit difficile d'en déterminer le nombre exact.

source: Python is available for free download, so there are no sales figures, and it's available from many different sites and packaged with many Linux distributions, so download statistics don't tell the whole story either.
fr: Python est disponible en téléchargement gratuit, donc il n'y a pas de chiffres de ventes, il est disponible depuis de nombreux sites différents et il est inclus avec de beaucoup de distributions Linux, donc les statistiques de téléchargement ne donnent pas la totalité non plus.

source: The comp.lang.python newsgroup is very active, but not all Python users post to the group or even read it.
fr: Le forum *comp.lang.python* est très actif, mais tous les utilisateurs de Python ne laissent pas de messages dessus ou même ne le lisent pas.

source: Have any significant projects been done in Python?
fr: Y a-t-il un nombre de projets significatif réalisés en Python ?

source: See https://www.python.org/about/success for a list of projects that use Python. Consulting the proceedings for `past Python conferences <https://www.python.org/community/workshops/>`_ will reveal contributions from many different companies and organizations.
fr: Voir https://www.python.org/about/success pour avoir une liste des projets qui utilisent Python. En consultant les comptes-rendus des `conférences Python précédentes <https://www.python.org/community/workshops/>`_ il s'avère que les contributions proviennent de nombreux organismes et entreprises divers.

source: What new developments are expected for Python in the future?
fr: Quelles sont les nouveautés en développement attendues pour Python ?

source: See https://www.python.org/dev/peps/ for the Python Enhancement Proposals (PEPs). PEPs are design documents describing a suggested new feature for Python, providing a concise technical specification and a rationale. Look for a PEP titled "Python X.Y Release Schedule", where X.Y is a version that hasn't been publicly released yet.
fr: Regardez les propositions d'amélioration de Python (« *Python Enhancement Proposals* », ou *PEP*) sur https://www.python.org/dev/peps/. Les PEP sont des documents techniques qui décrivent une nouvelle fonctionnalité qui a été suggérée pour Python, en fournissant une spécification technique concise et logique. Recherchez une PEP intitulée "Python X.Y Release Schedule", où X.Y est la version qui n'a pas encore été publiée.

source: New development is discussed on `the python-dev mailing list <https://mail.python.org/mailman/listinfo/python-dev/>`_.
fr: Le nouveau développement est discuté sur `la liste de diffusion python-dev <https://mail.python.org/mailman/listinfo/python-dev/>`_.

source: Is it reasonable to propose incompatible changes to Python?
fr: Est-il raisonnable de proposer des changements incompatibles dans Python ?

source: In general, no. There are already millions of lines of Python code around the world, so any change in the language that invalidates more than a very small fraction of existing programs has to be frowned upon. Even if you can provide a conversion program, there's still the problem of updating all documentation; many books have been written about Python, and we don't want to invalidate them all at a single stroke.
fr: En général, non. Il y a déjà des millions de lignes de code de Python tout autour du monde, donc n'importe quel changement dans le langage qui rend invalide ne serait-ce qu'une très petite fraction du code de programmes existants doit être désapprouvé. Même si vous pouvez fournir un programme de conversion, il y a toujours des problèmes de mise à jour dans toutes les documentations, beaucoup de livres ont été écrits au sujet de Python, et nous ne voulons pas les rendre invalides soudainement.

source: Providing a gradual upgrade path is necessary if a feature has to be changed. :pep:`5` describes the procedure followed for introducing backward-incompatible changes while minimizing disruption for users.
fr: En fournissant un rythme de mise à jour progressif qui est obligatoire si une fonctionnalité doit être changée.

source: Is Python a good language for beginning programmers?
fr: Existe-t-il un meilleur langage de programmation pour les programmeurs débutants ?

source: Yes.
fr: Oui.

source: It is still common to start students with a procedural and statically typed language such as Pascal, C, or a subset of C++ or Java. Students may be better served by learning Python as their first language. Python has a very simple and consistent syntax and a large standard library and, most importantly, using Python in a beginning programming course lets students concentrate on important programming skills such as problem decomposition and data type design. With Python, students can be quickly introduced to basic concepts such as loops and procedures. They can probably even work with user-defined objects in their very first course.
fr: Il reste commun pour les étudiants de commencer avec un langage procédural et à typage statique comme le Pascal, le C, ou un sous-ensemble du C++ ou Java. Les étudiants pourraient être mieux servis en apprenant Python comme premier langage. Python a une syntaxe très simple et cohérente ainsi qu'une vaste libraire standard, plus important encore, utiliser Python dans les cours d'initiation à la programmation permet aux étudiants de se concentrer sur les compétences de programmation les cruciales comme les problèmes de découpage et d'architecture. Avec Python, les étudiants peuvent rapidement aborder des concepts fondamentaux comme les boucles et les procédures. Ils peuvent même probablement travailler avec des objets définis dans leurs premiers cours.

source: For a student who has never programmed before, using a statically typed language seems unnatural. It presents additional complexity that the student must master and slows the pace of the course. The students are trying to learn to think like a computer, decompose problems, design consistent interfaces, and encapsulate data. While learning to use a statically typed language is important in the long term, it is not necessarily the best topic to address in the students' first programming course.
fr: Pour un étudiant qui n'a jamais programmé avant, utiliser un langage à typage statique peut sembler contre-nature. Cela représente une complexité additionnelle que l'étudiant doit maîtriser ce qui ralentit le cours. Les étudiants essaient d'apprendre à penser comme un ordinateur, décomposer les problèmes, établir une architecture propre, et résumer les données. Apprendre à utiliser un langage typé statiquement est important sur le long terme, ce n'est pas nécessairement la meilleure idée pour s'adresser aux étudiants durant leur tout premier cours.

source: Many other aspects of Python make it a good first language. Like Java, Python has a large standard library so that students can be assigned programming projects very early in the course that *do* something. Assignments aren't restricted to the standard four-function calculator and check balancing programs. By using the standard library, students can gain the satisfaction of working on realistic applications as they learn the fundamentals of programming. Using the standard library also teaches students about code reuse. Third-party modules such as PyGame are also helpful in extending the students' reach.
fr: De nombreux autres aspects de Python en font un bon premier langage. Comme Java, Python a une large bibliothèque standard donc les étudiants peuvent être assigner à la programmation de projets très tôt dans leur apprentissage qui *fait* quelque chose. Les missions ne sont pas restreintes aux quatre fonction standards. En utilisant la bibliothèque standard, les étudiants peuvent ressentir de la satisfaction en travaillant sur des applications réalistes alors qu'ils apprennent les fondamentaux de la programmation. Utiliser la bibliothèque standard apprend aussi aux étudiants la réutilisation de code. Les modules tiers tels que PyGame sont aussi très utiles pour étendre les compétences des étudiants.

source: Python's interactive interpreter enables students to test language features while they're programming. They can keep a window with the interpreter running while they enter their program's source in another window. If they can't remember the methods for a list, they can do something like this::
fr: L'interpréteur interactif de Python permet aux étudiants de tester les fonctionnalités du langage pendant qu'ils programment. Ils peuvent garder une fenêtre avec l'interpréteur en fonctionnement pendant qu'ils rentrent la source de leur programme dans une autre fenêtre. S'ils ne peuvent pas se souvenir des méthodes pour une liste, ils peuvent faire quelque chose comme ça ::

source: With the interpreter, documentation is never far from the student as they are programming.
fr: Avec l'interpréteur, la documentation n'est jamais loin des étudiants quand ils travaillent.

source: If you want to discuss Python's use in education, you may be interested in joining `the edu-sig mailing list <https://www.python.org/community/sigs/current/edu-sig>`_.
fr: Si vous voulez discuter de l'usage de Python dans l'éducation, vous devriez intéressé pour rejoindre `la liste de diffusion pour l'enseignement <https://www.python.org/community/sigs/current/edu-sig>`_.
