Repository: python/python-docs-fr
Catalog: faq/general.po
Languages: fr

source: General Python FAQ
fr: FAQ générale sur Python

source: Contents
fr: Sommaire

source: General Information
fr: Informations générales

source: What is Python?
fr: Qu'est-ce que Python ?

source: Python is an interpreted, interactive, object-oriented programming language. It incorporates modules, exceptions, dynamic typing, very high level dynamic data types, and classes. It supports multiple programming paradigms beyond object-oriented programming, such as procedural and functional programming. Python combines remarkable power with very clear syntax. It has interfaces to many system calls and libraries, as well as to various window systems, and is extensible in C or C++. It is also usable as an extension language for applications that need a programmable interface. Finally, Python is portable: it runs on many Unix variants including Linux and macOS, and on Windows.
fr: Python est un langage de programmation interprété, interactif et orienté objet. Il intègre des modules, des exceptions, un typage dynamique, des types de données dynamiques de très haut niveau et des classes. Il gère de multiples paradigmes de programmation au-delà de la programmation orientée objet, tels que la programmation procédurale et fonctionnelle. Python combine une puissance remarquable avec une syntaxe très claire. Il possède des interfaces avec de nombreux appels système et bibliothèques, ainsi qu'avec divers systèmes d'interfaces graphiques, et il peut être étendu avec du C ou du C++. Il est également utilisable comme langage d'extension pour les applications qui nécessitent une interface de programmation. Enfin, Python est portable : il fonctionne sur de nombreuses variantes d'Unix, y compris Linux et macOS, et sur Windows.

source: To find out more, start with :ref:`tutorial-index`. The `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_ links to other introductory tutorials and resources for learning Python.
fr: Pour en savoir plus, commencez par :ref:`tutorial-index`. Le « `Guide des Débutants pour Python <https://wiki.python.org/moin/BeginnersGuide>`_ » renvoie vers d'autres tutoriels et ressources d'initiation pour apprendre Python.

source: What is the Python Software Foundation?
fr: Qu'est ce que la Python Software Foundation ?

source: The Python Software Foundation is an independent non-profit organization that holds the copyright on Python versions 2.1 and newer. The PSF's mission is to advance open source technology related to the Python programming language and to publicize the use of Python. The PSF's home page is at https://www.python.org/psf/.
fr: La Python Software Foundation (PSF) est une organisation indépendante à but non lucratif qui détient les droits d'auteur sur les versions Python 2.1 et plus récentes. La mission de la PSF est de faire progresser les technologies ouvertes (*open source*) relatives au langage de programmation Python et de promouvoir son utilisation. Le page d'accueil de la PSF se trouve à l'adresse suivante : https://www.python.org/psf/.

source: Donations to the PSF are tax-exempt in the US. If you use Python and find it helpful, please contribute via `the PSF donation page <https://www.python.org/psf/donations/>`_.
fr: Si vous utilisez Python et que vous le trouvez utile, merci de contribuer par le biais de `la page de donation de la PSF <https://www.python.org/psf/donations/>`_.

source: Are there copyright restrictions on the use of Python?
fr: Existe-t-il des restrictions liées à la propriété intellectuelle quant à l'utilisation de Python ?

source: You can do anything you want with the source, as long as you leave the copyrights in and display those copyrights in any documentation about Python that you produce. If you honor the copyright rules, it's OK to use Python for commercial use, to sell copies of Python in source or binary form (modified or unmodified), or to sell products that incorporate Python in some form. We would still like to know about all commercial use of Python, of course.
fr: Vous pouvez faire ce que vous souhaitez avec la source, tant que vous respecterez la licence d'utilisation et que vous l'afficherez dans toute documentation que vous produirez au sujet de Python. Si vous respectez ces règles, vous pouvez utiliser Python dans un cadre commercial, vendre le code source ou la forme binaire (modifiée ou non), ou vendre des produits qui incorporent Python sous une forme quelconque. Bien entendu, nous souhaiterions avoir connaissance de tous les projets commerciaux utilisant Python.

source: See `the PSF license page <https://www.python.org/psf/license/>`_ to find further explanations and a link to the full text of the license.
fr: Voir `la page de licence d'utilisation de la PSF <https://www.python.org/psf/license/>`_ pour trouver davantage d'informations et un lien vers la version intégrale de la licence d'utilisation.

source: The Python logo is trademarked, and in certain cases permission is required to use it. Consult `the Trademark Usage Policy <https://www.python.org/psf/trademarks/>`__ for more information.
fr: Le logo de Python est une marque déposée, et dans certains cas une autorisation est nécessaire pour l'utiliser. Consultez `la politique d'utilisation de la marque <https://www.python.org/psf/trademarks/>`__ pour plus d'informations.

source: Why was Python created in the first place?
fr: Pourquoi Python a été créé ?

source: Here's a *very* brief summary of what started it all, written by Guido van Rossum:
fr: Voici un *très* bref résumé de comment tout a commencé, écrit par Guido van Rossum (puis traduit en français) :

source: I had extensive experience with implementing an interpreted language in the ABC group at CWI, and from working with this group I had learned a lot about language design. This is the origin of many Python features, including the use of indentation for statement grouping and the inclusion of very-high-level data types (although the details are all different in Python).
fr: J'avais une expérience complète avec la mise en œuvre du langage interprété ABC au sein du CWI, et en travaillant dans ce groupe j'ai appris beaucoup à propos de la conception de langage. C'est l'origine de nombreuses fonctionnalités de Python, notamment l'utilisation de l'indentation pour le groupement et l'inclusion de types de très haut niveau (bien que dans les détails ils soient tous différents dans Python).

source: I had a number of gripes about the ABC language, but also liked many of its features. It was impossible to extend the ABC language (or its implementation) to remedy my complaints -- in fact its lack of extensibility was one of its biggest problems. I had some experience with using Modula-2+ and talked with the designers of Modula-3 and read the Modula-3 report. Modula-3 is the origin of the syntax and semantics used for exceptions, and some other Python features.
fr: J'avais un certain nombre de différends avec le langage ABC, mais j'aimais aussi beaucoup de ses fonctionnalités. Il était impossible d'étendre le langage ABC (ou ses implémentations) pour remédier à mes réclamations -- en vérité le manque d'extensibilité était l'un des plus gros problème. J'avais un peu d'expérience avec l'utilisation de Modula-2+ et j'en ai parlé avec les concepteurs de Modula-3 et j'ai lu le rapport sur Modula-3. Modula-3 est à l'origine de la syntaxe et de la sémantique utilisée pour les exceptions, et quelques autres fonctionnalités en Python.

source: I was working in the Amoeba distributed operating system group at CWI. We needed a better way to do system administration than by writing either C programs or Bourne shell scripts, since Amoeba had its own system call interface which wasn't easily accessible from the Bourne shell. My experience with error handling in Amoeba made me acutely aware of the importance of exceptions as a programming language feature.
fr: Je travaillais sur un groupe de systèmes d'exploitation distribués Amoeba au CWI. Nous avions besoin d'un meilleur moyen pour gérer l'administration système qu'écrire un programme en C ou en script Bourne shell, puisque l'Amoeba avait sa propre interface d'appels système qui n'était pas facilement accessible depuis les scripts Bourne shell. Mon expérience avec le traitement des erreurs dans l'Amoeba m'a vraiment fait prendre conscience de l'importance des exceptions en tant que fonctionnalité d'un langage de programmation.

source: It occurred to me that a scripting language with a syntax like ABC but with access to the Amoeba system calls would fill the need. I realized that it would be foolish to write an Amoeba-specific language, so I decided that I needed a language that was generally extensible.
fr: Il m'est venu à l'esprit qu'un langage de script avec une syntaxe comme ABC mais avec un accès aux appels systèmes d'Amoeba remplirait les besoins. J'ai réalisé que ce serait idiot d'écrire un langage spécifique à Amoeba, donc j'ai décidé que j'avais besoin d'un langage qui serait généralement extensible.

source: During the 1989 Christmas holidays, I had a lot of time on my hand, so I decided to give it a try. During the next year, while still mostly working on it in my own time, Python was used in the Amoeba project with increasing success, and the feedback from colleagues made me add many early improvements.
fr: Pendant les vacances de Noël 1989, j'avais beaucoup de temps à disposition, donc j'ai décidé de faire un essai. Durant l'année suivante, j'ai encore beaucoup travaillé dessus sur mon propre temps. Python a été utilisé dans le projet Amoeba avec un succès croissant, et les retours de mes collègues m'ont permis d'ajouter beaucoup des premières améliorations.

source: In February 1991, after just over a year of development, I decided to post to USENET. The rest is in the ``Misc/HISTORY`` file.
fr: En Février 1991, juste après un peu plus d'un an de développement, j'ai décidé de le poster sur USENET. Le reste se trouve dans le fichier « Misc/HISTORY ».

source: What is Python good for?
fr: Pour quoi Python est-il fait ?

source: Python is a high-level general-purpose programming language that can be applied to many different classes of problems.
fr: Python est un langage de programmation haut niveau généraliste qui peut être utilisé pour pallier à différents problèmes.

source: The language comes with a large standard library that covers areas such as string processing (regular expressions, Unicode, calculating differences between files), internet protocols (HTTP, FTP, SMTP, XML-RPC, POP, IMAP, CGI programming), software engineering (unit testing, logging, profiling, parsing Python code), and operating system interfaces (system calls, filesystems, TCP/IP sockets). Look at the table of contents for :ref:`library-index` to get an idea of what's available. A wide variety of third-party extensions are also available. Consult `the Python Package Index <https://pypi.org>`_ to find packages of interest to you.
fr: Le langage vient avec une bibliothèque standard importante qui couvre des domaines tels que le traitement des chaînes de caractères (expressions régulières, Unicode, calcul de différences entre les fichiers), les protocoles Internet (HTTP, FTP, SMTP, XML-RPC, POP, IMAP, script CGI), ingénierie logicielle (tests unitaires, enregistrement, analyse de code Python), et interfaces pour systèmes d'exploitation (appels système, système de fichiers, connecteurs TCP/IP). Regardez la table des matières :ref:`library-index` pour avoir une idée de ce qui est disponible. Une grande variété de greffons tiers existent aussi. Consultez `le sommaire des paquets Python <https://pypi.org>`_ pour trouver les paquets qui pourraient vous intéresser.

source: How does the Python version numbering scheme work?
fr: Comment fonctionne le numérotage des versions de Python ?

source: Not all releases are bugfix releases. In the run-up to a new major release, a series of development releases are made, denoted as alpha, beta, or release candidate. Alphas are early releases in which interfaces aren't yet finalized; it's not unexpected to see an interface change between two alpha releases. Betas are more stable, preserving existing interfaces but possibly adding new modules, and release candidates are frozen, making no changes except as needed to fix critical bugs.
fr: Toutes les sorties ne concernent pas la correction de bogues. A l'approche de la sortie d'une nouvelle version majeure, une série de versions de développement sont créées, dénommées *alpha*, *beta*, *release candidate*. Les alphas sont des versions primaires dans lesquelles les interfaces ne sont pas encore finalisées; ce n'est pas inattendu de voir des changements d'interface entre deux versions alpha. Les *betas* sont plus stables, préservent les interfaces existantes mais peuvent ajouter de nouveaux modules, les *release candidate* sont figées, elles ne font aucun changement à l'exception de ceux nécessaires pour corriger des bogues critiques.

source: You may also find version numbers with a "+" suffix, e.g. "2.2+". These are unreleased versions, built directly from the CPython development repository. In practice, after a final minor release is made, the version is incremented to the next minor version, which becomes the "a0" version, e.g. "2.4a0".
fr: Vous pouvez aussi trouver des versions avec un signe « + » en suffixe, par exemple « 2.2+ ». Ces versions sont non distribuées, construites directement depuis le dépôt de développement de CPython. En pratique, après la sortie finale d'une version mineure, la version est augmentée à la prochaine version mineure, qui devient la version *a0*, c'est-à-dire *2.4a0*.

source: See also the documentation for :data:`sys.version`, :data:`sys.hexversion`, and :data:`sys.version_info`.
fr: Voir aussi la documentation pour for :data:`sys.version`, :data:`sys.hexversion`, et :data:`sys.version_info`.

source: How do I obtain a copy of the Python source?
fr: Comment obtenir une copie du code source de Python ?

source: The latest Python source distribution is always available from python.org, at https://www.python.org/downloads/. The latest development sources can be obtained at https://github.com/python/cpython/.
fr: La dernière version du code source déployée est toujours disponible sur python.org, à https://www.python.org/downloads/. Le code source de la dernière version en développement peut être obtenue à https://github.com/python/cpython/.

source: The source distribution is a gzipped tar file containing the complete C source, Sphinx-formatted documentation, Python library modules, example programs, and several useful pieces of freely distributable software. The source will compile and run out of the box on most UNIX platforms.
fr: Le code source est dans une archive *gzippée* au format *tar*, elle contient le code source C complet, la documentation formatée avec Sphinx, les libraires Python, des exemples de programmes, et plusieurs morceaux de code utiles distribuables librement. Le code source sera compilé et prêt à fonctionner immédiatement sur la plupart des plateformes UNIX.

source: Consult the `Getting Started section of the Python Developer's Guide <https://devguide.python.org/setup/>`__ for more information on getting the source code and compiling it.
fr: Consultez `la section Premiers pas du Guide des Développeurs Python <https://devguide.python.org/setup/>`__ pour plus d'informations sur comment obtenir le code source et le compiler.

source: How do I get documentation on Python?
fr: Comment obtenir la documentation de Python ?

source: The standard documentation for the current stable version of Python is available at https://docs.python.org/3/. PDF, plain text, and downloadable HTML versions are also available at https://docs.python.org/3/download.html.
fr: La documentation standard pour la version stable actuelle est disponible à https://docs.python.org/3/. Des versions aux formats PDF, texte et HTML sont aussi disponibles à https://docs.python.org/3/download.html.

source: I've never programmed before. Is there a Python tutorial?
fr: Je n'ai jamais programmé avant. Existe-t-il un tutoriel Python ?

source: There are numerous tutorials and books available. The standard documentation includes :ref:`tutorial-index`.
fr: Il y a de nombreux tutoriels et livres disponibles. La documentation standard inclut :ref:`tutorial-index`.

source: Consult `the Beginner's Guide <https://wiki.python.org/moin/BeginnersGuide>`_ to find information for beginning Python programmers, including lists of tutorials.
fr: Consultez le `Guide du Débutant <https://wiki.python.org/moin/BeginnersGuide>`_ afin de trouver des informations pour les développeurs Python débutants, incluant une liste de tutoriels.

source: Is there a newsgroup or mailing list devoted to Python?
fr: Y a-t-il un forum ou une liste de diffusion dédié à Python ?

source: There is a newsgroup, :newsgroup:`comp.lang.python`, and a mailing list, `python-list <https://mail.python.org/mailman/listinfo/python-list>`_. The newsgroup and mailing list are gatewayed into each other -- if you can read news it's unnecessary to subscribe to the mailing list. :newsgroup:`comp.lang.python` is high-traffic, receiving hundreds of postings every day, and Usenet readers are often more able to cope with this volume.
fr: Il y a un forum, :newsgroup:`comp.lang.python` et une liste de diffusion, `python-list <https://mail.python.org/mailman/listinfo/python-list>`_. Le forum et la liste de diffusion sont des passerelles l'un vers l'autre -- si vous pouvez lire les *news* ce n'est pas inutile de souscrire à la liste de diffusion. :newsgroup:`comp.lang.python` a beaucoup d'activité, il reçoit des centaines de messages chaque jour, et les lecteurs du réseau Usenet sont souvent plus capables de faire face à ce volume.

source: Announcements of new software releases and events can be found in comp.lang.python.announce, a low-traffic moderated list that receives about five postings per day. It's available as `the python-announce mailing list <https://mail.python.org/mailman/listinfo/python-announce-list>`_.
fr: Les annonces pour les nouvelles versions et événements peuvent êtres trouvées dans *comp.lang.python.announce*, une liste diminuée peu active qui reçoit environ 5 messages par jour. C'est disponible à `liste de diffusion des annonces Python <https://mail.python.org/mailman/listinfo/python-announce-list>`_.

source: More info about other mailing lists and newsgroups can be found at https://www.python.org/community/lists/.
fr: Plus d'informations à propos des autres listes de diffusion et forums peuvent être trouvées à https://www.python.org/community/lists/.

source: How do I get a beta test version of Python?
fr: Comment obtenir une version bêta test de Python ?

source: Alpha and beta releases are available from https://www.python.org/downloads/. All releases are announced on the comp.lang.python and comp.lang.python.announce newsgroups and on the Python home page at https://www.python.org/; an RSS feed of news is available.
fr: Les versions alpha et bêta sont disponibles depuis https://www.python.org/downloads/. Toutes les versions sont annoncées sur les *newsgroups* *comp.lang.python* et *comp.lang.python.announce* ainsi que sur la page d'accueil de Python à https://www.python.org/; un flux RSS d'actualités y est aussi disponible.

source: You can also access the development version of Python through Git. See `The Python Developer's Guide <https://devguide.python.org/>`_ for details.
fr: Vous pouvez aussi accéder aux de Python en développement grâce à Git. Voir `Le Guide du Développeur Python <https://devguide.python.org/>`_ pour plus de détails.

source: How do I submit bug reports and patches for Python?
fr: Comment soumettre un rapport de bogues ou un correctif pour Python ?

source: To report a bug or submit a patch, please use the Roundup installation at https://bugs.python.org/.
fr: Pour reporter un bogue ou soumettre un correctif, merci d'utiliser https://bugs.python.org/.

source: You must have a Roundup account to report bugs; this makes it possible for us to contact you if we have follow-up questions. It will also enable Roundup to send you updates as we act on your bug. If you had previously used SourceForge to report bugs to Python, you can obtain your Roundup password through Roundup's `password reset procedure <https://bugs.python.org/user?@template=forgotten>`_.
fr: Vous devez avoir un compte Roundup pour reporter des bogues; cela nous permet de vous contacter si nous avons des questions complémentaires. Cela permettra aussi le suivi de traitement de votre bogue. Si vous avez auparavant utilisé SourceForge pour reporter des bogues sur Python, vous pouvez obtenir un mot de passe Roundup grâce à la `procédure de réinitialisation de mot de passe de Roundup <https://bugs.python.org/user?@template=forgotten>`_.

source: For more information on how Python is developed, consult `the Python Developer's Guide <https://devguide.python.org/>`_.
fr: Pour davantage d'informations sur comment Python est développé, consultez `le Guide du Développeur Python <https://devguide.python.org/>`_.

source: Are there any published articles about Python that I can reference?
fr: Existe-t-il des articles publiés au sujet de Python auxquels je peux me référer ?

source: It's probably best to cite your favorite book about Python.
fr: C'est probablement mieux de vous référer à votre livre favori à propos de Python.

source: The very first article about Python was written in 1991 and is now quite outdated.
fr: Le tout premier article à propos de Python a été écrit en 1991 et est maintenant obsolète.

source: Guido van Rossum and Jelke de Boer, "Interactively Testing Remote Servers Using the Python Programming Language", CWI Quarterly, Volume 4, Issue 4 (December 1991), Amsterdam, pp 283--303.
fr: Guido van Rossum et Jelke de Boer, « *Interactively Testing Remote Servers Using the Python Programming Language* », CWI Quarterly, Volume 4, Issue 4 (December 1991), Amsterdam, pp 283--303.

source: Are there any books on Python?
fr: Y a-t-il des livres au sujet de Python ?

source: Yes, there are many, and more are being published. See the python.org wiki at https://wiki.python.org/moin/PythonBooks for a list.
fr: Oui, il y en a beaucoup, et d'autres sont en cours de publication. Voir le wiki python à https://wiki.python.org/moin/PythonBooks pour avoir une liste.

source: You can also search online bookstores for "Python" and filter out the Monty Python references; or perhaps search for "Python" and "language".
fr: Vous pouvez aussi chercher chez les revendeurs de livres en ligne avec le terme « Python » et éliminer les références concernant les Monty Python, ou peut-être faire une recherche avec les termes « langage » et « Python ».

source: Where in the world is www.python.org located?
fr: Où www.python.org est-il localisé dans le monde ?

source: Why is it called Python?
fr: Pourquoi le nom Python ?

source: When he began implementing Python, Guido van Rossum was also reading the published scripts from `"Monty Python's Flying Circus" <https://en.wikipedia.org/wiki/Monty_Python>`__, a BBC comedy series from the 1970s. Van Rossum thought he needed a name that was short, unique, and slightly mysterious, so he decided to call the language Python.
fr: Quand il a commencé à implémenter Python, Guido van Rossum a aussi lu le script publié par `"Monty Python's Flying Circus" <https://en.wikipedia.org/wiki/Monty_Python>`__, une série comique des années 1970 diffusée par la BBC. Van Rossum a pensé qu'il avait besoin d'un nom court, unique, et un peu mystérieux, donc il a décidé de l'appeler le langage Python.

source: Do I have to like "Monty Python's Flying Circus"?
fr: Dois-je aimer "Monty Python's Flying Circus" ?

source: No, but it helps. :)
fr: Non, mais ça peut aider. :)
