Repository: python/python-docs-fr
Catalog: faq/installed.po
Languages: fr

source: "Why is Python Installed on my Computer?" FAQ
fr: "Pourquoi Python est installé sur mon ordinateur ?" FAQ

source: What is Python?
fr: Qu'est-ce que Python ?

source: Python is a programming language. It's used for many different applications. It's used in some high schools and colleges as an introductory programming language because Python is easy to learn, but it's also used by professional software developers at places such as Google, NASA, and Lucasfilm Ltd.
fr: Python est un langage de programmation. Il est utilisé dans de nombreuses applications. Souvent utilisé dans les lycées et universités comme langage d'introduction à la programmation pour sa simplicité d'apprentissage, il est aussi utilisé par des développeurs professionnels appartenant à des grands groupes comme Google, la NASA, Lucasfilm etc.

source: If you wish to learn more about Python, start with the `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_.
fr: Si vous voulez en apprendre plus sur Python, vous pouvez commencer par le `Guide des Débutants pour Python <https://wiki.python.org/moin/BeginnersGuide>`_.

source: Why is Python installed on my machine?
fr: Pourquoi Python est installé sur ma machine ?

source: If you find Python installed on your system but don't remember installing it, there are several possible ways it could have gotten there.
fr: Si Python est installé sur votre système mais que vous ne vous rappelez pas l'avoir installé, il y a plusieurs raisons possibles à sa présence.

source: Perhaps another user on the computer wanted to learn programming and installed it; you'll have to figure out who's been using the machine and might have installed it.
fr: Peut être qu'un autre utilisateur de l'ordinateur voulait apprendre la programmation et l'a installé, dans ce cas vous allez devoir trouver qui a utilisé votre machine et aurait pu l'installer.

source: A third-party application installed on the machine might have been written in Python and included a Python installation. There are many such applications, from GUI programs to network servers and administrative scripts.
fr: Une application tierce installée sur votre machine écrite en Python installera Python. Il existe de nombreuses applications de ce type, allant de programme avec interface graphique, jusqu'aux scripts d'administration, en passant par les serveurs.

source: Some Windows machines also have Python installed. At this writing we're aware of computers from Hewlett-Packard and Compaq that include Python. Apparently some of HP/Compaq's administrative tools are written in Python.
fr: Certaines machines fonctionnant avec le système d'exploitation Windows possèdent une installation de Python. À ce jour, les ordinateurs des marques Hewlett-Packard et Compaq incluent nativement Python. Certains outils d'administration de ces marques sont écrits en Python.

source: Many Unix-compatible operating systems, such as Mac OS X and some Linux distributions, have Python installed by default; it's included in the base installation.
fr: Python est installé par défaut et à l'installation par de nombreux systèmes Unix, comme Mac OS X et certaines distributions Linux.

source: Can I delete Python?
fr: Puis-je supprimer Python ?

source: That depends on where Python came from.
fr: Cela dépend de l'origine de Python.

source: If someone installed it deliberately, you can remove it without hurting anything. On Windows, use the Add/Remove Programs icon in the Control Panel.
fr: Si Python a été installé délibérément par une personne tierce ou vous même, vous pouvez le supprimer sans causer de dommage. Sous Windows, vous pouvez simplement utiliser l'icône d'Ajout / Suppression de programmes du Panneau de configuration.

source: If Python was installed by a third-party application, you can also remove it, but that application will no longer work. You should use that application's uninstaller rather than removing Python directly.
fr: Si Python a été installé par une application tierce, Python peut être désinstallé, l'application l'ayant installé cessera alors de fonctionner. Dans ce cas, désinstallez l'application en utilisant son outil de désinstallation est plus indiqué que supprimer Python.

source: If Python came with your operating system, removing it is not recommended. If you remove it, whatever tools were written in Python will no longer run, and some of them might be important to you. Reinstalling the whole system would then be required to fix things again.
fr: Si Python a été installé avec votre système d'exploitation, le supprimer n'est pas recommandé. Si vous choisissez tout de même de le supprimer, tous les outils écrits en python cesseront alors de fonctionner, certains outils pouvant être importants. La réinstallation intégrale du système pourrait être nécessaire pour résoudre les problèmes suite à la désinstallation de Python.
