Repository: python/python-docs-fr
Catalog: faq/library.po
Languages: fr

source: Library and Extension FAQ
fr: FAQ sur la bibliothèque et les extensions

source: Contents
fr: Sommaire

source: General Library Questions
fr: Questions générales sur la bibliothèque

source: How do I find a module or application to perform task X?
fr: Comment trouver un module ou une application pour effectuer la tâche X ?

source: Check :ref:`the Library Reference <library-index>` to see if there's a relevant standard library module. (Eventually you'll learn what's in the standard library and will be able to skip this step.)
fr: Regardez si la :ref:`bibliothèque standard <library-index>` contient un module approprié (avec l'expérience, vous connaitrez le contenu de la bibliothèque standard et pourrez sauter cette étape).

source: For third-party packages, search the `Python Package Index <https://pypi.org>`_ or try `Google <https://www.google.com>`_ or another Web search engine. Searching for "Python" plus a keyword or two for your topic of interest will usually find something helpful.
fr: Pour des paquets tiers, regardez dans `l'index des paquets Python <https://pypi.org>`_ ou essayez `Google <https://www.google.com>`_ ou un autre moteur de recherche (NDT : comme le moteur français `Qwant <https://www.qwant.com>`_). Rechercher « Python » accompagné d'un ou deux mots-clés se rapportant à ce qui vous intéresse donne souvent de bons résultats.

source: Where is the math.py (socket.py, regex.py, etc.) source file?
fr: Où sont stockés les fichiers sources *math.py*, *socket.py*, *regex.py*, etc ?

source: If you can't find a source file for a module it may be a built-in or dynamically loaded module implemented in C, C++ or other compiled language. In this case you may not have the source file or it may be something like :file:`mathmodule.c`, somewhere in a C source directory (not on the Python Path).
fr: Si vous ne parvenez pas à trouver le fichier source d'un module, c'est peut-être parce que celui-ci est un module natif ou bien un module implémenté en C, C++, ou autre langage compilé, qui est chargé dynamiquement. Dans ce cas, vous ne possédez peut-être pas le fichier source ou celui-ci est en réalité stocké quelque part dans un dossier de fichiers source C (qui ne sera pas dans le chemin Python), comme par exemple :file:`mathmodule.c`.

source: There are (at least) three kinds of modules in Python:
fr: Il y a (au moins) trois types de modules dans Python :

source: modules written in Python (.py);
fr: les modules écrits en Python (*.py*) ;

source: modules written in C and dynamically loaded (.dll, .pyd, .so, .sl, etc);
fr: les modules écrits en C et chargés dynamiquement (*.dll*, *.pyd*, *.so*, *.sl*, *etc.*) ;

source: modules written in C and linked with the interpreter; to get a list of these, type::
fr: les modules écrits en C et liés à l'interpréteur ; pour obtenir leur liste, entrez ::

source: How do I make a Python script executable on Unix?
fr: Comment rendre un script Python exécutable sous Unix ?

source: You need to do two things: the script file's mode must be executable and the first line must begin with ``#!`` followed by the path of the Python interpreter.
fr: Deux conditions doivent être remplies : les droits d'accès au fichier doivent permettre son exécution et la première ligne du script doit commencer par ``#!`` suivi du chemin vers l'interpréteur Python.

source: The first is done by executing ``chmod +x scriptfile`` or perhaps ``chmod 755 scriptfile``.
fr: La première condition est remplie en exécutant ``chmod +x scriptfile`` ou ``chmod 755 scriptfile``.

source: The second can be done in a number of ways. The most straightforward way is to write ::
fr: Il y a plusieurs façons de remplir la seconde. La plus simple consiste à écrire au tout début du fichier ::

source: as the very first line of your file, using the pathname for where the Python interpreter is installed on your platform.
fr: en utilisant le chemin de l'interpréteur Python sur votre machine.

source: If you would like the script to be independent of where the Python interpreter lives, you can use the :program:`env` program. Almost all Unix variants support the following, assuming the Python interpreter is in a directory on the user's :envvar:`PATH`::
fr: Pour rendre ce script indépendant de la localisation de l'interpréteur Python, il faut utiliser le programme :program:`env`. La ligne ci-dessous fonctionne sur la quasi-totalité des dérivés de Unix, à condition que l'interpréteur Python soit dans un dossier référencé dans la variable :envvar:`PATH` de l'utilisateur ::

source: *Don't* do this for CGI scripts. The :envvar:`PATH` variable for CGI scripts is often very minimal, so you need to use the actual absolute pathname of the interpreter.
fr: Ne faites *pas* ceci pour des scripts CGI. La variable :envvar:`PATH` des scripts CGI est souvent très succincte, il faut par conséquent préciser le chemin absolu réel de l'interpréteur.

source: Occasionally, a user's environment is so full that the :program:`/usr/bin/env` program fails; or there's no env program at all. In that case, you can try the following hack (due to Alex Rezinsky):
fr: Il peut arriver que l'environnement d'un utilisateur soit si chargé que le programme :program:`/usr/bin/env` échoue ; ou que le programme *env* n'existe pas du tout. Dans ce cas, vous pouvez utiliser l'astuce suivante, élaborée par Alex Rezinsky :

source: The minor disadvantage is that this defines the script's __doc__ string. However, you can fix that by adding ::
fr: Le léger inconvénient est que cela définit la variable *__doc__* du script. Cependant, il est possible de corriger cela en ajoutant ::

source: Is there a curses/termcap package for Python?
fr: Existe-t'il un module *curse* ou *termcap* en Python ?

source: For Unix variants: The standard Python source distribution comes with a curses module in the :source:`Modules` subdirectory, though it's not compiled by default. (Note that this is not available in the Windows distribution -- there is no curses module for Windows.)
fr: Pour les dérivés d'Unix : la distribution standard de Python contient un module *curses* dans le sous-dossier :source:`Modules`, bien qu'il ne soit pas compilé par défaut. Il n'est pas disponible en Windows — le module *curses* n'existant pas en Windows.

source: The :mod:`curses` module supports basic curses features as well as many additional functions from ncurses and SYSV curses such as colour, alternative character set support, pads, and mouse support. This means the module isn't compatible with operating systems that only have BSD curses, but there don't seem to be any currently maintained OSes that fall into this category.
fr: Le module :mod:`curses` comprend les fonctionnalités de base de *curses* et beaucoup de fonctionnalités supplémentaires provenant de *ncurses* et de *SYSV curses* comme la couleur, la gestion des ensembles de caractères alternatifs, la prise en charge du pavé tactile et de la souris. Cela implique que le module n'est pas compatible avec des systèmes d'exploitation qui n'ont que le *curses* de BSD mais, de nos jours, de tels systèmes d'exploitation ne semblent plus exister ou être maintenus.

source: For Windows: use `the consolelib module <http://effbot.org/zone/console-index.htm>`_.
fr: Pour Windows : utilisez le module `consolelib <http://effbot.org/zone/console-index.htm>`_.

source: Is there an equivalent to C's onexit() in Python?
fr: Existe-t'il un équivalent à la fonction C ``onexit()`` en Python ?

source: The :mod:`atexit` module provides a register function that is similar to C's :c:func:`onexit`.
fr: Le module :mod:`atexit` fournit une fonction d'enregistrement similaire à la fonction C :c:func:`onexit`.

source: Why don't my signal handlers work?
fr: Pourquoi mes gestionnaires de signaux ne fonctionnent-t'ils pas ?

source: The most common problem is that the signal handler is declared with the wrong argument list. It is called as ::
fr: Le problème le plus courant est d'appeler le gestionnaire de signaux avec les mauvais arguments. Un gestionnaire est appelé de la façon suivante ::

source: so it should be declared with two arguments::
fr: donc il doit être déclaré avec deux paramètres ::

source: Common tasks
fr: Tâches fréquentes

source: How do I test a Python program or component?
fr: Comment tester un programme ou un composant Python ?

source: Python comes with two testing frameworks. The :mod:`doctest` module finds examples in the docstrings for a module and runs them, comparing the output with the expected output given in the docstring.
fr: Python fournit deux cadriciels de test. Le module :mod:`doctest` cherche des exemples dans les *docstrings* d'un module et les exécute. Il compare alors la sortie avec la sortie attendue, telle que définie dans la *docstring*.

source: The :mod:`unittest` module is a fancier testing framework modelled on Java and Smalltalk testing frameworks.
fr: Le module :mod:`unittest` est un cadriciel un peu plus élaboré basé sur les cadriciels de test de Java et de Smalltalk.

source: To make testing easier, you should use good modular design in your program. Your program should have almost all functionality encapsulated in either functions or class methods -- and this sometimes has the surprising and delightful effect of making the program run faster (because local variable accesses are faster than global accesses). Furthermore the program should avoid depending on mutating global variables, since this makes testing much more difficult to do.
fr: Pour rendre le test plus aisé, il est nécessaire de bien découper le code d'un programme. Votre programme doit avoir la quasi-totalité des fonctionnalités dans des fonctions ou des classes — et ceci a parfois l'avantage aussi plaisant qu'inattendu de rendre le programme plus rapide, les accès aux variables locales étant en effet plus rapides que les accès aux variables globales. De plus le programme doit éviter au maximum de manipuler des variables globales, car ceci rend le test beaucoup plus difficile.

source: The "global main logic" of your program may be as simple as ::
fr: La « logique générale » d'un programme devrait être aussi simple que ::

source: at the bottom of the main module of your program.
fr: à la fin du module principal du programme.

source: Once your program is organized as a tractable collection of functions and class behaviours you should write test functions that exercise the behaviours. A test suite that automates a sequence of tests can be associated with each module. This sounds like a lot of work, but since Python is so terse and flexible it's surprisingly easy. You can make coding much more pleasant and fun by writing your test functions in parallel with the "production code", since this makes it easy to find bugs and even design flaws earlier.
fr: Une fois que la logique du programme est implémentée par un ensemble de fonctions et de comportements de classes, il faut écrire des fonctions de test qui vont éprouver cette logique. À chaque module, il est possible d'associer une suite de tests qui joue de manière automatique un ensemble de tests. Au premier abord, il semble qu'il faille fournir un effort conséquent, mais comme Python est un langage concis et flexible, c'est surprenamment aisé. Écrire simultanément le code « de production » et les fonctions de test associées rend le développement plus agréable et plus amusant, car ceci permet de trouver des bogues, voire des défauts de conception, plus facilement.

source: "Support modules" that are not intended to be the main module of a program may include a self-test of the module. ::
fr: Les « modules auxiliaires » qui n'ont pas vocation à être le module principal du programme peuvent inclure un test pour se vérifier eux-mêmes. ::

source: Even programs that interact with complex external interfaces may be tested when the external interfaces are unavailable by using "fake" interfaces implemented in Python.
fr: Les programmes qui interagissent avec des interfaces externes complexes peuvent être testés même quand ces interfaces ne sont pas disponibles, en utilisant des interfaces « simulacres » implémentées en Python.

source: How do I create documentation from doc strings?
fr: Comment générer la documentation à partir des *docstrings* ?

source: The :mod:`pydoc` module can create HTML from the doc strings in your Python source code. An alternative for creating API documentation purely from docstrings is `epydoc <http://epydoc.sourceforge.net/>`_. `Sphinx <http://sphinx-doc.org>`_ can also include docstring content.
fr: Le module :mod:`pydoc` peut générer du HTML à partir des *docstrings* du code source Python. Il est aussi possible de documenter une API uniquement à partir des *docstrings* à l'aide de `epydoc <http://epydoc.sourceforge.net/>`_. `Sphinx <http://sphinx-doc.org>`_ peut également inclure du contenu provenant de *docstrings*.

source: How do I get a single keypress at a time?
fr: Comment détecter qu'une touche est pressée ?

source: For Unix variants there are several solutions. It's straightforward to do this using curses, but curses is a fairly large module to learn.
fr: Pour les dérivés d'Unix, plusieurs solutions s'offrent à vous. C'est facile en utilisant le module *curses*, mais *curses* est un module assez conséquent à apprendre.

source: Threads
fr: Fils d'exécution

source: How do I program using threads?
fr: Comment programmer avec des fils d'exécution ?

source: Be sure to use the :mod:`threading` module and not the :mod:`_thread` module. The :mod:`threading` module builds convenient abstractions on top of the low-level primitives provided by the :mod:`_thread` module.
fr: Veillez à bien utiliser le module :mod:`threading` et non le module :mod:`_thread`. Le module :mod:`threading` fournit une abstraction plus facile à manipuler que les primitives de bas-niveau du module :mod:`_thread`.

source: Aahz has a set of slides from his threading tutorial that are helpful; see http://www.pythoncraft.com/OSCON2001/.
fr: Un ensemble de diapositives issues du didacticiel de Aahz sur les fils d'exécution est disponible à http://www.pythoncraft.com/OSCON2001/.

source: None of my threads seem to run: why?
fr: Aucun de mes fils ne semble s'exécuter : pourquoi ?

source: As soon as the main thread exits, all threads are killed. Your main thread is running too quickly, giving the threads no time to do any work.
fr: Dès que le fil d'exécution principal se termine, tous les fils sont tués. Le fil principal s'exécute trop rapidement, sans laisser le temps aux autres fils de faire quoi que ce soit.

source: A simple fix is to add a sleep to the end of the program that's long enough for all the threads to finish::
fr: Une correction simple consiste à ajouter un temps d'attente suffisamment long à la fin du programme pour que tous les fils puissent se terminer ::

source: But now (on many platforms) the threads don't run in parallel, but appear to run sequentially, one at a time! The reason is that the OS thread scheduler doesn't start a new thread until the previous thread is blocked.
fr: Mais à présent, sur beaucoup de plates-formes, les fils ne s'exécutent pas en parallèle, mais semblent s'exécuter de manière séquentielle, l'un après l'autre ! En réalité, l'ordonnanceur de fils du système d'exploitation ne démarre pas de nouveau fil avant que le précédent ne soit bloqué.

source: A simple fix is to add a tiny sleep to the start of the run function::
fr: Une correction simple consiste à ajouter un petit temps d'attente au début de la fonction ::

source: Instead of trying to guess a good delay value for :func:`time.sleep`, it's better to use some kind of semaphore mechanism. One idea is to use the :mod:`queue` module to create a queue object, let each thread append a token to the queue when it finishes, and let the main thread read as many tokens from the queue as there are threads.
fr: Au lieu d'essayer de trouver une bonne valeur d'attente pour la fonction :func:`time.sleep`, il vaut mieux utiliser un mécanisme basé sur les sémaphores. Une solution consiste à utiliser le module :mod:`queue` pour créer un objet file, faire en sorte que chaque fil ajoute un jeton à la file quand il se termine, et que le fil principal retire autant de jetons de la file qu'il y a de fils.

source: How do I parcel out work among a bunch of worker threads?
fr: Comment découper et répartir une tâche au sein d'un ensemble de fils d'exécutions ?

source: The easiest way is to use the new :mod:`concurrent.futures` module, especially the :mod:`~concurrent.futures.ThreadPoolExecutor` class.
fr: La manière la plus simple est d'utiliser le nouveau module :mod:`concurrent.futures`, en particulier la classe :mod:`~concurrent.futures.ThreadPoolExecutor`.

source: Or, if you want fine control over the dispatching algorithm, you can write your own logic manually. Use the :mod:`queue` module to create a queue containing a list of jobs. The :class:`~queue.Queue` class maintains a list of objects and has a ``.put(obj)`` method that adds items to the queue and a ``.get()`` method to return them. The class will take care of the locking necessary to ensure that each job is handed out exactly once.
fr: Ou bien, si vous désirez contrôler plus finement l'algorithme de distribution, vous pouvez écrire votre propre logique « à la main ». Utilisez le module :mod:`queue` pour créer une file de tâches ; la classe :class:`~queue.Queue` gère une liste d'objets et a une méthode ``.put(objet)`` pour ajouter un élément à la file, et une méthode ``.get()`` pour les récupérer. La classe s'occupe de gérer les verrous pour que chaque tâche soit exécutée une et une seule fois.

source: Here's a trivial example::
fr: Voici un exemple trivial ::

source: When run, this will produce the following output:
fr: Quand celui-ci est exécuté, il produit la sortie suivante :

source: Consult the module's documentation for more details; the :class:`~queue.Queue` class provides a featureful interface.
fr: Consultez la documentation du module pour plus de détails ; la classe :class:`~queue.Queue` fournit une interface pleine de fonctionnalités.

source: What kinds of global value mutation are thread-safe?
fr: Quels types de mutations sur des variables globales sont compatibles avec les programmes à fils d'exécution multiples ? sécurisé ?

source: A :term:`global interpreter lock` (GIL) is used internally to ensure that only one thread runs in the Python VM at a time. In general, Python offers to switch among threads only between bytecode instructions; how frequently it switches can be set via :func:`sys.setswitchinterval`. Each bytecode instruction and therefore all the C implementation code reached from each instruction is therefore atomic from the point of view of a Python program.
fr: Le :term:`verrou global de l'interpréteur <global interpreter lock>` (GIL pour *global interpreter lock*) est utilisé en interne pour s'assurer que la machine virtuelle Python (MVP) n'exécute qu'un seul fil à la fois. De manière générale, Python ne change de fil qu'entre les instructions du code intermédiaire ; :func:`sys.setswitchinterval` permet de contrôler la fréquence de bascule entre les fils. Chaque instruction du code intermédiaire, et, par conséquent, tout le code C appelé par cette instruction est donc atomique du point de vue d'un programme Python.

source: In theory, this means an exact accounting requires an exact understanding of the PVM bytecode implementation. In practice, it means that operations on shared variables of built-in data types (ints, lists, dicts, etc) that "look atomic" really are.
fr: En théorie, cela veut dire qu'un décompte exact nécessite une connaissance parfaite de l'implémentation de la MVP. En pratique, cela veut dire que les opérations sur des variables partagées de type natif (les entier, les listes, les dictionnaires etc.) qui « semblent atomiques » le sont réellement.

source: For example, the following operations are all atomic (L, L1, L2 are lists, D, D1, D2 are dicts, x, y are objects, i, j are ints)::
fr: Par exemple, les opérations suivantes sont toutes atomiques (*L*, *L1* et *L2* sont des listes, *D*, *D1* et *D2* sont des dictionnaires, *x* et *y* sont des objets, *i* et *j* des entiers) ::

source: These aren't::
fr: Les suivantes ne le sont pas ::

source: Operations that replace other objects may invoke those other objects' :meth:`__del__` method when their reference count reaches zero, and that can affect things. This is especially true for the mass updates to dictionaries and lists. When in doubt, use a mutex!
fr: Les opérations qui remplacent d'autres objets peuvent invoquer la méthode :meth:`__del__` de ces objets quand leur compteur de référence passe à zéro, et cela peut avoir de l'impact. C'est tout particulièrement vrai pour les des changements massifs sur des dictionnaires ou des listes. En cas de doute, il vaut mieux utiliser un mutex.

source: Can't we get rid of the Global Interpreter Lock?
fr: Pourquoi ne pas se débarrasser du verrou global de l'interpréteur ?

source: The :term:`global interpreter lock` (GIL) is often seen as a hindrance to Python's deployment on high-end multiprocessor server machines, because a multi-threaded Python program effectively only uses one CPU, due to the insistence that (almost) all Python code can only run while the GIL is held.
fr: Le :term:`verrou global de l'interpréteur <global interpreter lock>` (GIL) est souvent vu comme un obstacle au déploiement de code Python sur des serveurs puissants avec de nombreux processeurs, car un programme Python à fils d'exécutions multiples n'utilise en réalité qu'un seul processeur. Presque tout le code Python ne peut en effet être exécuté qu'avec le GIL acquis.

source: Back in the days of Python 1.5, Greg Stein actually implemented a comprehensive patch set (the "free threading" patches) that removed the GIL and replaced it with fine-grained locking. Adam Olsen recently did a similar experiment in his `python-safethread <https://code.google.com/archive/p/python-safethread>`_ project. Unfortunately, both experiments exhibited a sharp drop in single-thread performance (at least 30% slower), due to the amount of fine-grained locking necessary to compensate for the removal of the GIL.
fr: À l'époque de Python 1.5, Greg Stein a bien implémenté un ensemble complet de correctifs (les correctifs « fils d'exécution libres ») qui remplaçaient le GIL par des verrous plus granulaires. Adam Olsen a conduit une expérience similaire dans son projet `python-safethread <https://code.google.com/archive/p/python-safethread>`_. Malheureusement, ces deux tentatives ont induit une baisse significative (d'au moins 30%) des performances du code à un seul fil d'exécution, à cause de la quantité de verrouillage plus granulaire nécessaire pour contrebalancer la suppression du GIL.

source: This doesn't mean that you can't make good use of Python on multi-CPU machines! You just have to be creative with dividing the work up between multiple *processes* rather than multiple *threads*. The :class:`~concurrent.futures.ProcessPoolExecutor` class in the new :mod:`concurrent.futures` module provides an easy way of doing so; the :mod:`multiprocessing` module provides a lower-level API in case you want more control over dispatching of tasks.
fr: Cela ne signifie pas qu'il est impossible de tirer profit de Python sur des machines à plusieurs cœurs ! Il faut seulement être malin et diviser le travail à faire entre plusieurs *processus* plutôt qu'entre plusieurs *fils d'exécution*. La classe :class:`~concurrent.futures.ProcessPoolExecutor` du nouveau module :mod:`concurrent.futures` permet de faire cela facilement ; le module :mod:`multiprocessing` fournit une API de plus bas-niveau pour un meilleur contrôle sur la distribution des tâches.
