Repository: python/python-docs-fr
Catalog: faq/library.po
Languages: fr

source: Judicious use of C extensions will also help; if you use a C extension to perform a time-consuming task, the extension can release the GIL while the thread of execution is in the C code and allow other threads to get some work done. Some standard library modules such as :mod:`zlib` and :mod:`hashlib` already do this.
fr: Des extensions C appropriées peuvent aussi aider ; en utilisant une extension C pour effectuer une tâche longue, l'extension peut relâcher le GIL pendant que le fil est en train d'exécuter ce code et laisser les autres fils travailler. Des modules de la bibliothèque standard comme :mod:`zlib` ou :mod:`hashlib` utilisent cette technique.

source: It has been suggested that the GIL should be a per-interpreter-state lock rather than truly global; interpreters then wouldn't be able to share objects. Unfortunately, this isn't likely to happen either. It would be a tremendous amount of work, because many object implementations currently have global state. For example, small integers and short strings are cached; these caches would have to be moved to the interpreter state. Other object types have their own free list; these free lists would have to be moved to the interpreter state. And so on.
fr: On a déjà proposé de restreindre le GIL par interpréteur, et non plus d'être complétement global ; les interpréteurs ne seraient plus en mesure de partager des objets. Malheureusement, cela n'a pas beaucoup de chance non plus d'arriver. Cela nécessiterait un travail considérable, car la façon dont beaucoup d'objets sont implémentés rend leur état global. Par exemple, les entiers et les chaînes de caractères courts sont mis en cache ; ces caches devraient être déplacés au niveau de l'interpréteur. D'autres objets ont leur propre liste de suppression, ces listes devraient être déplacées au niveau de l'interpréteur et ainsi de suite.

source: And I doubt that it can even be done in finite time, because the same problem exists for 3rd party extensions. It is likely that 3rd party extensions are being written at a faster rate than you can convert them to store all their global state in the interpreter state.
fr: C'est une tâche sans fin, car les extensions tierces ont le même problème, et il est probable que les extensions tierces soient développées plus vite qu'il ne soit possible de les corriger pour les faire stocker leur état au niveau de l'interpréteur et non plus au niveau global.

source: And finally, once you have multiple interpreters not sharing any state, what have you gained over running each interpreter in a separate process?
fr: Et enfin, quel intérêt y-a t'il à avoir plusieurs interpréteurs qui ne partagent pas d'état, par rapport à faire tourner chaque interpréteur dans un processus différent ?

source: Input and Output
fr: Les entrées/sorties

source: How do I delete a file? (And other file questions...)
fr: Comment supprimer un fichier ? (et autres questions sur les fichiers…)

source: Use ``os.remove(filename)`` or ``os.unlink(filename)``; for documentation, see the :mod:`os` module. The two functions are identical; :func:`~os.unlink` is simply the name of the Unix system call for this function.
fr: Utilisez ``os.remove(filename)`` ou ``os.unlink(filename)`` ; pour la documentation, référez-vous au module :mod:`os`. Ces deux fonctions sont identiques, :func:`~os.unlink` n'est tout simplement que le nom de l'appel système à cette fonction sous Unix.

source: To remove a directory, use :func:`os.rmdir`; use :func:`os.mkdir` to create one. ``os.makedirs(path)`` will create any intermediate directories in ``path`` that don't exist. ``os.removedirs(path)`` will remove intermediate directories as long as they're empty; if you want to delete an entire directory tree and its contents, use :func:`shutil.rmtree`.
fr: Utilisez :func:`os.rmdir` pour supprimer un dossier et :func:`os.mkdir` pour en créer un nouveau. ``os.makedirs(chemin)`` crée les dossiers intermédiaires de ``chemin`` qui n'existent pas et ``os.removedirs(chemin)`` supprime les dossiers intermédiaires si ceux-ci sont vides. Pour supprimer une arborescence et tout son contenu, utilisez :func:`shutil.rmtree`.

source: To rename a file, use ``os.rename(old_path, new_path)``.
fr: ``os.rename(ancien_chemin, nouveau_chemin)`` permet de renommer un fichier.

source: To truncate a file, open it using ``f = open(filename, "rb+")``, and use ``f.truncate(offset)``; offset defaults to the current seek position. There's also ``os.ftruncate(fd, offset)`` for files opened with :func:`os.open`, where *fd* is the file descriptor (a small integer).
fr: Pour supprimer le contenu d'un fichier, ouvrez celui-ci avec ``f = open(nom_du_fichier, "rb+")``, puis exécutez ``f.truncate(décalage)`` où *décalage* est par défaut la position actuelle de la tête de lecture. Il existe aussi ``os.ftruncate(df, décalage)`` pour les fichiers ouverts avec :func:`os.open`, où *df* est le descripteur de fichier (un entier court).

source: The :mod:`shutil` module also contains a number of functions to work on files including :func:`~shutil.copyfile`, :func:`~shutil.copytree`, and :func:`~shutil.rmtree`.
fr: Le module :mod:`shutil` propose aussi un grand nombre de fonctions pour effectuer des opérations sur des fichiers comme :func:`~shutil.copyfile`, :func:`~shutil.copytree` et :func:`~shutil.rmtree`.

source: How do I copy a file?
fr: Comment copier un fichier ?

source: The :mod:`shutil` module contains a :func:`~shutil.copyfile` function. Note that on MacOS 9 it doesn't copy the resource fork and Finder info.
fr: Le module :mod:`shutil` fournit la fonction :func:`~shutil.copyfile`. Sous MacOS 9, celle-ci ne copie pas le clonage de ressources ni les informations du chercheur.

source: How do I read (or write) binary data?
fr: Comment lire (ou écrire) des données binaires ?

source: To read or write complex binary data formats, it's best to use the :mod:`struct` module. It allows you to take a string containing binary data (usually numbers) and convert it to Python objects; and vice versa.
fr: Pour lire ou écrire des formats de données complexes en binaire, il est recommandé d'utiliser le module :mod:`struct`. Celui-ci permet de convertir une chaîne de caractères qui contient des données binaires, souvent des nombres, en objets Python, et vice-versa.

source: For example, the following code reads two 2-byte integers and one 4-byte integer in big-endian format from a file::
fr: Par exemple, le code suivant lit, depuis un fichier, deux entiers codés sur 2 octets et un entier codé sur 4 octets, en format gros-boutiste ::

source: The '>' in the format string forces big-endian data; the letter 'h' reads one "short integer" (2 bytes), and 'l' reads one "long integer" (4 bytes) from the string.
fr: « > » dans la chaîne de formatage indique que la donnée doit être lue en mode gros-boutiste, la lettre « h » indique un entier court (2 octets) et la lettre « l » indique un entier long (4 octets).

source: For data that is more regular (e.g. a homogeneous list of ints or floats), you can also use the :mod:`array` module.
fr: Pour une donnée plus régulière (p. ex. une liste homogène d'entiers ou de nombres à virgule flottante), il est possible d'utiliser le module :mod:`array`.

source: To read and write binary data, it is mandatory to open the file in binary mode (here, passing ``"rb"`` to :func:`open`). If you use ``"r"`` instead (the default), the file will be open in text mode and ``f.read()`` will return :class:`str` objects rather than :class:`bytes` objects.
fr: Pour lire et écrire de la donnée binaire, il est obligatoire d'ouvrir le fichier en mode binaire également (ici, en passant ``"rb"`` à :func:`open`). En utilisant ``"r"`` (valeur par défaut), le fichier est ouvert en mode textuel et ``f.read()`` renvoie des objets :class:`str` au lieu d'objets :class:`bytes`.

source: I can't seem to use os.read() on a pipe created with os.popen(); why?
fr: Il me semble impossible d'utiliser ``os.read()`` sur un tube créé avec ``os.popen()`` ; pourquoi ?

source: :func:`os.read` is a low-level function which takes a file descriptor, a small integer representing the opened file. :func:`os.popen` creates a high-level file object, the same type returned by the built-in :func:`open` function. Thus, to read *n* bytes from a pipe *p* created with :func:`os.popen`, you need to use ``p.read(n)``.
fr: :func:`os.read` est une fonction de bas niveau qui prend en paramètre un descripteur de fichier — un entier court qui représente le fichier ouvert. :func:`os.popen` crée un objet fichier de haut niveau, du même type que celui renvoyé par la fonction native :func:`open`. Par conséquent, pour lire *n* octets d'un tube *p* créé avec :func:`os.popen`, il faut utiliser ``p.read(n)``.

source: How do I access the serial (RS232) port?
fr: Comment accéder au port de transmission en série (RS-232) ?

source: For Win32, POSIX (Linux, BSD, etc.), Jython:
fr: Pour Win32, POSIX (Linux, BSD, etc.) et Jython :

source: For Unix, see a Usenet post by Mitch Chapman:
fr: Pour Unix, référez-vous à une publication sur Usenet de Mitch Chapman :

source: Why doesn't closing sys.stdout (stdin, stderr) really close it?
fr: Pourquoi fermer *sys.stdout*, *sys.stdin*, *sys.stderr* ne les ferme pas réellement ?

source: Python :term:`file objects <file object>` are a high-level layer of abstraction on low-level C file descriptors.
fr: Les :term:`objets fichiers <file object>` en Python sont des abstractions de haut niveau sur les descripteurs de fichier C de bas niveau.

source: For most file objects you create in Python via the built-in :func:`open` function, ``f.close()`` marks the Python file object as being closed from Python's point of view, and also arranges to close the underlying C file descriptor. This also happens automatically in ``f``'s destructor, when ``f`` becomes garbage.
fr: Pour la plupart des objets fichiers créés en Python avec la fonction native :func:`open`, ``f.close()`` marque le fichier comme fermé du point de vue de Python et ferme aussi le descripteur C sous-jacent. Le même mécanisme est enclenché automatiquement dans le destructeur de ``f``, lorsque ``f`` est recyclé.

source: But stdin, stdout and stderr are treated specially by Python, because of the special status also given to them by C. Running ``sys.stdout.close()`` marks the Python-level file object as being closed, but does *not* close the associated C file descriptor.
fr: Mais *stdin*, *stdout* et *stderr* ont droit à un traitement spécial en Python, car leur statut en C est lui-aussi spécial. Exécuter ``sys.stdout.close()`` marque l'objet fichier comme fermé du point de vue de Python, mais le descripteur de fichier C associé n'est *pas* fermé.

source: To close the underlying C file descriptor for one of these three, you should first be sure that's what you really want to do (e.g., you may confuse extension modules trying to do I/O). If it is, use :func:`os.close`::
fr: Pour fermer le descripteur de fichier sous-jacent C de l'une de ces trois sorties, demandez-vous avant tout si vous êtes sûr de vous (cela peut, par exemple, perturber le bon fonctionnement de modules qui font des opérations d'entrée-sortie). Si c'est le cas, utilisez :func:`os.close` ::

source: Or you can use the numeric constants 0, 1 and 2, respectively.
fr: Il est aussi possible de fermer respectivement les constantes numériques 0, 1 ou 2.

source: Network/Internet Programming
fr: Programmation réseau et Internet

source: What WWW tools are there for Python?
fr: Quels sont les outils Python dédiés à la Toile ?

source: See the chapters titled :ref:`internet` and :ref:`netdata` in the Library Reference Manual. Python has many modules that will help you build server-side and client-side web systems.
fr: Référez-vous aux chapitres intitulés :ref:`internet` et :ref:`netdata` dans le manuel de référence de la bibliothèque. Python a de nombreux modules pour construire des applications de Toile côté client comme côté serveur.

source: A summary of available frameworks is maintained by Paul Boddie at https://wiki.python.org/moin/WebProgramming\ .
fr: Un résumé des cadriciels disponibles est maintenu par Paul Boddie à l'adresse https://wiki.python.org/moin/WebProgramming\ .

source: Cameron Laird maintains a useful set of pages about Python web technologies at http://phaseit.net/claird/comp.lang.python/web_python.
fr: Cameron Laird maintient un ensemble intéressant d'articles sur les technologies Python dédiées à la Toile à l'adresse http://phaseit.net/claird/comp.lang.python/web_python.

source: How can I mimic CGI form submission (METHOD=POST)?
fr: Comment reproduire un envoi de formulaire CGI (``METHOD=POST``) ?

source: I would like to retrieve web pages that are the result of POSTing a form. Is there existing code that would let me do this easily?
fr: J'aimerais récupérer la page de retour d'un envoi de formulaire sur la Toile. Existe-t'il déjà du code qui pourrait m'aider à le faire facilement ?

source: Yes. Here's a simple example that uses urllib.request::
fr: Oui. Voici un exemple simple d'utilisation de *urllib.request* ::

source: Note that in general for percent-encoded POST operations, query strings must be quoted using :func:`urllib.parse.urlencode`. For example, to send ``name=Guy Steele, Jr.``::
fr: Remarquez qu'en général, la chaîne de caractères d'une requête POST encodée avec des des signes « % » doit être mise entre guillemets à l'aide de :func:`urllib.parse.urlencode`. Par exemple pour envoyer ``name=Guy Steele, Jr.`` ::

source: :ref:`urllib-howto` for extensive examples.
fr: :ref:`urllib-howto` pour des exemples complets.

source: What module should I use to help with generating HTML?
fr: Quel module utiliser pour générer du HTML ?

source: You can find a collection of useful links on the `Web Programming wiki page <https://wiki.python.org/moin/WebProgramming>`_.
fr: La `page wiki de la programmation Toile <https://wiki.python.org/moin/WebProgramming>`_ (en anglais) répertorie un ensemble de liens pertinents.

source: How do I send mail from a Python script?
fr: Comment envoyer un courriel avec un script Python ?

source: Use the standard library module :mod:`smtplib`.
fr: Utilisez le module :mod:`smtplib` de la bibliothèque standard.

source: Here's a very simple interactive mail sender that uses it. This method will work on any host that supports an SMTP listener. ::
fr: Voici un exemple très simple d'un envoyeur de courriel qui l'utilise. Cette méthode fonctionne sur tous les serveurs qui implémentent SMTP. ::

source: A Unix-only alternative uses sendmail. The location of the sendmail program varies between systems; sometimes it is ``/usr/lib/sendmail``, sometimes ``/usr/sbin/sendmail``. The sendmail manual page will help you out. Here's some sample code::
fr: Sous Unix, il est possible d'utiliser *sendmail*. La localisation de l'exécutable *sendmail* dépend du système ; cela peut-être ``/usr/lib/sendmail`` ou ``/usr/sbin/sendmail``, la page de manuel de *sendmail* peut vous aider. Par exemple ::

source: How do I avoid blocking in the connect() method of a socket?
fr: Comment éviter de bloquer dans la méthode ``connect()`` d'un connecteur réseau ?

source: The :mod:`select` module is commonly used to help with asynchronous I/O on sockets.
fr: Le module :mod:`select` est fréquemment utilisé pour effectuer des entrées-sorties asynchrones sur des connecteurs réseaux.

source: To prevent the TCP connect from blocking, you can set the socket to non-blocking mode. Then when you do the ``connect()``, you will either connect immediately (unlikely) or get an exception that contains the error number as ``.errno``. ``errno.EINPROGRESS`` indicates that the connection is in progress, but hasn't finished yet. Different OSes will return different values, so you're going to have to check what's returned on your system.
fr: Pour empêcher une connexion TCP de se bloquer, il est possible de mettre le connecteur en mode lecture seule. Avec cela, au moment du ``connect()``, la connexion pourra être immédiate (peu probable) ou bien vous obtiendrez une exception qui contient le numéro d'erreur dans ``.errno``. ``errno.EINPROGRESS`` indique que la connexion est en cours, mais qu'elle n'a pas encore aboutie. La valeur dépend du système d'exploitation, donc renseignez-vous sur la valeur utilisée par votre système.

source: You can use the ``connect_ex()`` method to avoid creating an exception. It will just return the errno value. To poll, you can call ``connect_ex()`` again later -- ``0`` or ``errno.EISCONN`` indicate that you're connected -- or you can pass this socket to select to check if it's writable.
fr: ``connect_ex()`` permet d'éviter la création de l'exception, et de ne renvoyer que la valeur de *errno*. Pour vérifier l'état de la connexion, utilisez encore une fois ``connect_ex()`` — ``0`` ou ``errno.EISCONN`` indiquent que la connexion est active — ou passez le connecteur en argument de ``select()`` pour vérifier si le connecteur est prêt à recevoir des entrées.

source: The :mod:`asyncore` module presents a framework-like approach to the problem of writing non-blocking networking code. The third-party `Twisted <https://twistedmatrix.com/trac/>`_ library is a popular and feature-rich alternative.
fr: Le module :mod:`asyncore` propose une approche en cadriciel pour écrire du code réseau non-bloquant. La bibliothèque tierce `Twisted <https://twistedmatrix.com/trac/>`_ en est une alternative plébiscitée, avec un grand nombre de fonctionnalités.

source: Databases
fr: Bases de données

source: Are there any interfaces to database packages in Python?
fr: Existe-t'il des modules Python pour s'interfacer avec des bases de données ?

source: Yes.
fr: Oui.

source: Interfaces to disk-based hashes such as :mod:`DBM <dbm.ndbm>` and :mod:`GDBM <dbm.gnu>` are also included with standard Python. There is also the :mod:`sqlite3` module, which provides a lightweight disk-based relational database.
fr: La distribution standard de Python fournit aussi des interfaces à des bases de données comme :mod:`DBM <dbm.ndbm>` ou :mod:`GDBM <dbm.gnu>`. Il existe aussi le module :mod:`sqlite3` qui implémente une base de données relationelle légère sur disque.

source: Support for most relational databases is available. See the `DatabaseProgramming wiki page <https://wiki.python.org/moin/DatabaseProgramming>`_ for details.
fr: La gestion de la plupart des bases de données relationnelles est assurée. Voir la page wiki `DatabaseProgramming <https://wiki.python.org/moin/DatabaseProgramming>`_ pour plus de détails.

source: How do you implement persistent objects in Python?
fr: Comment implémenter la persistance d'objets en Python ?

source: The :mod:`pickle` library module solves this in a very general way (though you still can't store things like open files, sockets or windows), and the :mod:`shelve` library module uses pickle and (g)dbm to create persistent mappings containing arbitrary Python objects.
fr: Le module :mod:`pickle` répond à cela de manière large (bien qu'il ne soit pas possible de stocker des fichiers ouverts, des connecteurs ou des fenêtres par exemple), et le module :mod:`shelve` de la bibliothèque utilise *pickle* et *(g)dbm* pour créer des liens persistants vers des objets Python.

source: Mathematics and Numerics
fr: Mathématiques et calcul numérique

source: How do I generate random numbers in Python?
fr: Comment générer des nombres aléatoires en Python ?

source: The standard module :mod:`random` implements a random number generator. Usage is simple::
fr: Le module :mod:`random` de la bibliothèque standard comprend un générateur de nombres aléatoires. Son utilisation est simple ::

source: This returns a random floating point number in the range [0, 1).
fr: Le code précédent renvoie un nombre à virgule flottante aléatoire dans l'intervalle [0, 1[.

source: There are also many other specialized generators in this module, such as:
fr: Ce module fournit beaucoup d'autres générateurs spécialisés comme :

source: ``randrange(a, b)`` chooses an integer in the range [a, b).
fr: ``randrange(a, b)`` génère un entier dans l'intervalle [a, b[.

source: ``uniform(a, b)`` chooses a floating point number in the range [a, b).
fr: ``uniform(a, b)`` génère un nombre à virgule flottante aléatoire dans l'intervalle [a, b[.

source: ``normalvariate(mean, sdev)`` samples the normal (Gaussian) distribution.
fr: ``normalvariate(mean, sdev)`` simule la loi normale (Gaussienne).

source: Some higher-level functions operate on sequences directly, such as:
fr: Des fonctions de haut niveau opèrent directement sur des séquences comme :

source: ``choice(S)`` chooses random element from a given sequence
fr: ``choice(S)`` sélectionne au hasard un élément d'une séquence donnée

source: ``shuffle(L)`` shuffles a list in-place, i.e. permutes it randomly
fr: ``shuffle(L)`` mélange une liste en-place, c.-à-d. lui applique une permutation aléatoire

source: There's also a ``Random`` class you can instantiate to create independent multiple random number generators.
fr: Il existe aussi une classe ``Random`` qu'il est possible d'instancier pour créer des générateurs aléatoires indépendants.
