Repository: python/python-docs-fr
Catalog: faq/programming.po
Languages: fr

source: Only move imports into a local scope, such as inside a function definition, if it's necessary to solve a problem such as avoiding a circular import or are trying to reduce the initialization time of a module. This technique is especially helpful if many of the imports are unnecessary depending on how the program executes. You may also want to move imports into a function if the modules are only ever used in that function. Note that loading a module the first time may be expensive because of the one time initialization of the module, but loading a module multiple times is virtually free, costing only a couple of dictionary lookups. Even if the module name has gone out of scope, the module is probably available in :data:`sys.modules`.
fr: Les imports ne devraient être déplacés dans un espace local, comme dans la définition d'une fonction, que si cela est nécessaire pour résoudre un problème comme éviter des dépendances circulaires ou réduire le temps d'initialisation d'un module. Cette technique est particulièrement utile si la majorité des imports est superflue selon le flux d'exécution du programme. Il est également pertinent de déplacer des importations dans une fonction si le module n'est utilisé qu'au sein de cette fonction. Le premier chargement d'un module peut être coûteux à cause du coût fixe d'initialisation d'un module, mais charger un module plusieurs fois est quasiment gratuit, cela ne coûte que quelques indirections dans un dictionnaire. Même si le nom du module est sorti du contexte courant, le module est probablement disponible dans :data:`sys.modules`.

source: Why are default values shared between objects?
fr: Pourquoi les arguments par défaut sont-ils partagés entre les objets ?

source: This type of bug commonly bites neophyte programmers. Consider this function::
fr: C'est un problème que rencontrent souvent les programmeurs débutants. Examinons la fonction suivante ::

source: The first time you call this function, ``mydict`` contains a single item. The second time, ``mydict`` contains two items because when ``foo()`` begins executing, ``mydict`` starts out with an item already in it.
fr: Au premier appel de cette fonction, ``mydict`` ne contient qu'un seul élément. Au second appel, ``mydict`` contient deux éléments car quand ``foo()`` commence son exécution, ``mydict`` contient déjà un élément.

source: It is often expected that a function call creates new objects for default values. This is not what happens. Default values are created exactly once, when the function is defined. If that object is changed, like the dictionary in this example, subsequent calls to the function will refer to this changed object.
fr: On est souvent amené à croire qu'un appel de fonction créé des nouveaux objets pour les valeurs par défaut. Ce n'est pas le cas. Les valeurs par défaut ne sont créées qu'une et une seule fois, au moment où la fonction est définie. Si l'objet est modifié, comme le dictionnaire dans cet exemple, les appels suivants à cette fonction font référence à l'objet ainsi modifié.

source: By definition, immutable objects such as numbers, strings, tuples, and ``None``, are safe from change. Changes to mutable objects such as dictionaries, lists, and class instances can lead to confusion.
fr: Par définition, les objets immuables comme les nombres, les chaînes de caractères, les n-uplets et ``None`` ne sont pas modifiés. Les changements sur des objets muables comme les dictionnaires, les listes et les instances de classe peuvent porter à confusion.

source: Because of this feature, it is good programming practice to not use mutable objects as default values. Instead, use ``None`` as the default value and inside the function, check if the parameter is ``None`` and create a new list/dictionary/whatever if it is. For example, don't write::
fr: En raison de cette fonctionnalité, il vaut mieux ne pas utiliser d'objets muables comme valeurs par défaut. Il vaut mieux utiliser ``None`` comme valeur par défaut et, à l'intérieur de la fonction, vérifier si le paramètre est à ``None`` et créer une nouvelle liste, dictionnaire ou autre, le cas échéant. Par exemple, il ne faut pas écrire ::

source: but::
fr: mais plutôt ::

source: This feature can be useful. When you have a function that's time-consuming to compute, a common technique is to cache the parameters and the resulting value of each call to the function, and return the cached value if the same value is requested again. This is called "memoizing", and can be implemented like this::
fr: Cette fonctionnalité a une utilité. Il est courant de mettre en cache les paramètres et la valeur de retour de chacun des appels d'une fonction coûteuse à exécuter, et de renvoyer la valeur stockée en cache si le même appel est ré-effectué. C'est la technique dite de « mémoïsation », qui s'implémente de la manière suivante ::

source: You could use a global variable containing a dictionary instead of the default value; it's a matter of taste.
fr: Il est possible d'utiliser une variable globale contenant un dictionnaire à la place de la valeur par défaut ; ce n'est qu'une question de goût.

source: How can I pass optional or keyword parameters from one function to another?
fr: Comment passer des paramètres optionnels ou nommés d'une fonction à l'autre ?

source: Collect the arguments using the ``*`` and ``**`` specifiers in the function's parameter list; this gives you the positional arguments as a tuple and the keyword arguments as a dictionary. You can then pass these arguments when calling another function by using ``*`` and ``**``::
fr: Il faut récupérer les arguments en utilisant les sélecteurs ``*`` et ``**`` dans la liste des paramètres de la fonction ; ceci donne les arguments positionnels sous la forme d'un n-uplet et les arguments nommés sous forme de dictionnaire. Ces arguments peuvent être passés à une autre fonction en utilisant ``*`` et ``**`` ::

source: What is the difference between arguments and parameters?
fr: Quelle est la différence entre les arguments et les paramètres ?

source: :term:`Parameters <parameter>` are defined by the names that appear in a function definition, whereas :term:`arguments <argument>` are the values actually passed to a function when calling it. Parameters define what types of arguments a function can accept. For example, given the function definition::
fr: Les :term:`paramètres <parameter>` sont les noms qui apparaissent dans une définition de fonction, alors que les :term:`arguments <argument>` sont les valeurs qui sont réellement passées à une fonction lors de l'appel de celle-ci. Les paramètres définissent les types des arguments qu'une fonction accepte. Ainsi, avec la définition de fonction suivante ::

source: *foo*, *bar* and *kwargs* are parameters of ``func``. However, when calling ``func``, for example::
fr: *foo*, *bar* et *kwargs* sont des paramètres de ``func``. Mais à l'appel de ``func`` avec, par exemple ::

source: the values ``42``, ``314``, and ``somevar`` are arguments.
fr: les valeurs ``42``, ``314``, et ``somevar`` sont des arguments.

source: Why did changing list 'y' also change list 'x'?
fr: Pourquoi modifier la liste 'y' modifie aussi la liste 'x' ?

source: If you wrote code like::
fr: Si vous avez écrit du code comme ::

source: you might be wondering why appending an element to ``y`` changed ``x`` too.
fr: vous vous demandez peut-être pourquoi l'ajout d'un élément à ``y`` a aussi changé ``x``.

source: There are two factors that produce this result:
fr: Il y a deux raisons qui conduisent à ce comportement :

source: Variables are simply names that refer to objects. Doing ``y = x`` doesn't create a copy of the list -- it creates a new variable ``y`` that refers to the same object ``x`` refers to. This means that there is only one object (the list), and both ``x`` and ``y`` refer to it.
fr: Les variables ne sont que des noms qui font référence à des objets. La ligne ``y = x`` ne crée pas une copie de la liste — elle crée une nouvelle variable ``y`` qui pointe sur le même objet que ``x``. Ceci signifie qu'il n'existe qu'un seul objet (la liste) auquel ``x`` et ``y`` font référence.

source: Lists are :term:`mutable`, which means that you can change their content.
fr: Les listes sont des :term:`muable`, ce qui signifie que leur contenu peut être modifié.

source: After the call to :meth:`~list.append`, the content of the mutable object has changed from ``[]`` to ``[10]``. Since both the variables refer to the same object, using either name accesses the modified value ``[10]``.
fr: Après l'appel de :meth:`~list.append`, le contenu de l'objet muable est passé de ``[]`` à ``[10]``. Vu que les deux variables font référence au même objet, il est possible d'accéder à la valeur modifiée ``[10]`` avec chacun des noms.

source: If we instead assign an immutable object to ``x``::
fr: Si au contraire, on affecte un objet immuable à ``x`` ::

source: we can see that in this case ``x`` and ``y`` are not equal anymore. This is because integers are :term:`immutable`, and when we do ``x = x + 1`` we are not mutating the int ``5`` by incrementing its value; instead, we are creating a new object (the int ``6``) and assigning it to ``x`` (that is, changing which object ``x`` refers to). After this assignment we have two objects (the ints ``6`` and ``5``) and two variables that refer to them (``x`` now refers to ``6`` but ``y`` still refers to ``5``).
fr: on observe que ``x`` et ``y`` ne sont ici plus égales. Les entiers sont des immuables (:term:`immutable`), et ``x = x + 1`` ne change pas l'entier ``5`` en incrémentant sa valeur. Au contraire, un nouvel objet est créé (l'entier ``6``) et affecté à ``x`` (c'est à dire qu'on change l'objet auquel fait référence ``x``). Après cette affectation on a deux objets (les entiers ``6`` et ``5``) et deux variables qui font référence à ces deux objets (``x`` fait désormais référence à ``6`` mais ``y`` fait toujours référence à ``5``).

source: Some operations (for example ``y.append(10)`` and ``y.sort()``) mutate the object, whereas superficially similar operations (for example ``y = y + [10]`` and ``sorted(y)``) create a new object. In general in Python (and in all cases in the standard library) a method that mutates an object will return ``None`` to help avoid getting the two types of operations confused. So if you mistakenly write ``y.sort()`` thinking it will give you a sorted copy of ``y``, you'll instead end up with ``None``, which will likely cause your program to generate an easily diagnosed error.
fr: Certaines opérations (par exemple, ``y.append(10)`` et ``y.sort()``) modifient l'objet, alors que des opérations identiques en apparence (par exemple ``y = y + [10]`` et ``sorted(y)``) créent un nouvel objet. En général, en Python, une méthode qui modifie un objet renvoie ``None`` (c'est même systématique dans la bibliothèque standard) pour éviter la confusion entre les deux opérations. Donc écrire par erreur ``y.sort()`` en pensant obtenir une copie triée de ``y`` donne ``None``, ce qui conduit très souvent le programme à générer une erreur facile à diagnostiquer.

source: However, there is one class of operations where the same operation sometimes has different behaviors with different types: the augmented assignment operators. For example, ``+=`` mutates lists but not tuples or ints (``a_list += [1, 2, 3]`` is equivalent to ``a_list.extend([1, 2, 3])`` and mutates ``a_list``, whereas ``some_tuple += (1, 2, 3)`` and ``some_int += 1`` create new objects).
fr: Il existe cependant une classe d'opérations qui se comporte différemment selon le type : les opérateurs d'affectation incrémentaux. Par exemple, ``+=`` modifie les listes mais pas les n-uplets ni les entiers (``a_list += [1, 2, 3]`` équivaut à ``a_list.extend([1, 2, 3])`` et modifie ``a_list``, alors que ``some_tuple += (1, 2, 3)`` et ``some_int += 1`` créent de nouveaux objets).

source: In other words:
fr: En d'autres termes :

source: If we have a mutable object (:class:`list`, :class:`dict`, :class:`set`, etc.), we can use some specific operations to mutate it and all the variables that refer to it will see the change.
fr: Il est possible d'appliquer des opérations qui modifient un objet muable (:class:`list`, :class:`dict`, :class:`set`, etc.) et toutes les variables qui y font référence verront le changement.

source: If we have an immutable object (:class:`str`, :class:`int`, :class:`tuple`, etc.), all the variables that refer to it will always see the same value, but operations that transform that value into a new value always return a new object.
fr: Toutes les variables qui font référence à un objet immuable (:class:`str`, :class:`int`, :class:`tuple`, etc.) renvoient la même valeur, mais les opérations qui transforment cette valeur en une nouvelle valeur renvoient toujours un nouvel objet.

source: If you want to know if two variables refer to the same object or not, you can use the :keyword:`is` operator, or the built-in function :func:`id`.
fr: L'opérateur :keyword:`is` ou la fonction native :func:`id` permettent de savoir si deux variables font référence au même objet.

source: How do I write a function with output parameters (call by reference)?
fr: Comment écrire une fonction qui modifie ses paramètres ? (passage par référence)

source: Remember that arguments are passed by assignment in Python. Since assignment just creates references to objects, there's no alias between an argument name in the caller and callee, and so no call-by-reference per se. You can achieve the desired effect in a number of ways.
fr: En Python, les arguments sont passés comme des affectations de variables. Vu qu'une affectation crée des références à des objets, il n'y a pas de lien entre un argument dans l'appel de la fonction et sa définition, et donc pas de passage par référence en soi. Il y a cependant plusieurs façons d'en émuler un.

source: By returning a tuple of the results::
fr: En renvoyant un n-uplet de résultats ::

source: This is almost always the clearest solution.
fr: C'est presque toujours la meilleure solution.

source: By using global variables. This isn't thread-safe, and is not recommended.
fr: En utilisant des variables globales. Cette approche ne fonctionne pas dans des contextes à plusieurs fils d'exécution (elle n'est pas *thread-safe*), et n'est donc pas recommandée.

source: By passing a mutable (changeable in-place) object::
fr: En passant un objet muable (modifiable sur place) ::

source: By passing in a dictionary that gets mutated::
fr: En passant un dictionnaire, qui sera modifié ::

source: Or bundle up values in a class instance::
fr: Ou regrouper les valeurs dans une instance de classe ::

source: There's almost never a good reason to get this complicated.
fr: Faire quelque chose d'aussi compliqué est rarement une bonne idée.

source: Your best choice is to return a tuple containing the multiple results.
fr: La meilleure option reste de renvoyer un n-uplet contenant les différents résultats.

source: How do you make a higher order function in Python?
fr: Comment construire une fonction d'ordre supérieur en Python ?

source: You have two choices: you can use nested scopes or you can use callable objects. For example, suppose you wanted to define ``linear(a,b)`` which returns a function ``f(x)`` that computes the value ``a*x+b``. Using nested scopes::
fr: Deux possibilités : on peut utiliser des portées imbriquées ou bien des objets appelables. Par exemple, supposons que l'on souhaite définir ``linear(a, b)`` qui renvoie une fonction ``f(x)`` qui calcule la valeur ``a*x+b``. En utilisant les portées imbriquées ::

source: Or using a callable object::
fr: Ou en utilisant un objet appelable ::

source: In both cases, ::
fr: Dans les deux cas ::

source: gives a callable object where ``taxes(10e6) == 0.3 * 10e6 + 2``.
fr: donne un objet appelable où ``taxes(10e6) == 0.3 * 10e6 + 2``.

source: The callable object approach has the disadvantage that it is a bit slower and results in slightly longer code. However, note that a collection of callables can share their signature via inheritance::
fr: L'approche par objet appelable a le désavantage d'être légèrement plus lente et de produire un code légèrement plus long. Cependant, il faut noter qu'une collection d'objet appelables peuvent partager leurs signatures par héritage ::

source: Object can encapsulate state for several methods::
fr: Les objets peuvent encapsuler un état pour plusieurs méthodes ::

source: Here ``inc()``, ``dec()`` and ``reset()`` act like functions which share the same counting variable.
fr: Ici ``inc()``, ``dec()`` et ``reset()`` agissent comme des fonctions partageant une même variable compteur.

source: How do I copy an object in Python?
fr: Comment copier un objet en Python ?

source: In general, try :func:`copy.copy` or :func:`copy.deepcopy` for the general case. Not all objects can be copied, but most can.
fr: En général, essayez :func:`copy.copy` ou :func:`copy.deepcopy`. Tous les objets ne peuvent pas être copiés, mais la plupart le peuvent.

source: Some objects can be copied more easily. Dictionaries have a :meth:`~dict.copy` method::
fr: Certains objets peuvent être copiés plus facilement que d'autres. Les dictionnaires ont une méthode :meth:`~dict.copy` ::

source: Sequences can be copied by slicing::
fr: Les séquences peuvent être copiées via la syntaxe des tranches ::

source: How can I find the methods or attributes of an object?
fr: Comment récupérer les méthodes ou les attributs d'un objet ?

source: For an instance x of a user-defined class, ``dir(x)`` returns an alphabetized list of the names containing the instance attributes and methods and attributes defined by its class.
fr: Pour une instance x d'une classe définie par un utilisateur, ``dir(x)`` renvoie une liste alphabétique des noms contenants les attributs de l'instance, et les attributs et méthodes définies par sa classe.

source: How can my code discover the name of an object?
fr: Comment un code peut-il obtenir le nom d'un objet ?

source: Generally speaking, it can't, because objects don't really have names. Essentially, assignment always binds a name to a value; the same is true of ``def`` and ``class`` statements, but in that case the value is a callable. Consider the following code::
fr: C'est impossible en général, parce qu'un objet n'a pas de nom à proprement parler. Schématiquement, l'affectation fait correspondre un nom à une valeur ; c'est vrai aussi pour les instructions ``def`` et ``class``, à la différence près que, dans ce cas, la valeur est un appelable. Par exemple, dans le code suivant ::

source: Arguably the class has a name: even though it is bound to two names and invoked through the name B the created instance is still reported as an instance of class A. However, it is impossible to say whether the instance's name is a or b, since both names are bound to the same value.
fr: Affirmer que la classe a un nom est discutable. Bien qu'elle soit liée à deux noms, et qu'elle soit appelée via le nom B, l'instance créée déclare tout de même être une instance de la classe A. De même, il est impossible de dire si le nom de l'instance est a ou b, les deux noms étant attachés à la même valeur.

source: Generally speaking it should not be necessary for your code to "know the names" of particular values. Unless you are deliberately writing introspective programs, this is usually an indication that a change of approach might be beneficial.
fr: De façon générale, une application ne devrait pas avoir besoin de « connaître le nom » d'une valeur particulière. À moins d'être délibérément en train d'écrire un programme introspectif, c'est souvent l'indication qu'un changement d'approche serait bénéfique.

source: In comp.lang.python, Fredrik Lundh once gave an excellent analogy in answer to this question:
fr: Sur *comp.lang.python*, Fredrik Lundh a donné un jour une excellente analogie pour répondre à cette question :

source: The same way as you get the name of that cat you found on your porch: the cat (object) itself cannot tell you its name, and it doesn't really care -- so the only way to find out what it's called is to ask all your neighbours (namespaces) if it's their cat (object)...
fr: C'est pareil que trouver le nom du chat qui traîne devant votre porte : le chat (objet) ne peut pas vous dire lui-même son nom, et il s'en moque un peu ­– alors le meilleur moyen de savoir comment il s'appelle est de demander à tous vos voisins (espaces de nommage) si c'est leur chat (objet)…

source: ....and don't be surprised if you'll find that it's known by many names, or no name at all!
fr: …et ne soyez pas surpris si vous découvrez qu'il est connu sous plusieurs noms, ou s'il n'a pas de nom du tout !

source: What's up with the comma operator's precedence?
fr: Qu'en est-il de la précédence de l'opérateur virgule ?

source: Comma is not an operator in Python. Consider this session::
fr: La virgule n'est pas un opérateur en Python. Observez le code suivant ::

source: Since the comma is not an operator, but a separator between expressions the above is evaluated as if you had entered::
fr: Comme la virgule n'est pas un opérateur, mais un séparateur entre deux expressions, l'expression ci-dessus est évaluée de la même façon que si vous aviez écrit ::

source: not::
fr: et non ::

source: The same is true of the various assignment operators (``=``, ``+=`` etc). They are not truly operators but syntactic delimiters in assignment statements.
fr: Ceci est vrai pour tous les opérateurs d'affectation (``=``, ``+=`` etc). Ce ne sont pas vraiment des opérateurs mais plutôt des délimiteurs syntaxiques dans les instructions d'affectation.

source: Is there an equivalent of C's "?:" ternary operator?
fr: Existe-t-il un équivalent à l'opérateur ternaire "?:" du C ?

source: Yes, there is. The syntax is as follows::
fr: Oui. Sa syntaxe est la suivante ::

source: Before this syntax was introduced in Python 2.5, a common idiom was to use logical operators::
fr: Avant l'introduction de cette syntaxe dans Python 2.5, il était courant d'utiliser les opérateurs de logique ::

source: However, this idiom is unsafe, as it can give wrong results when *on_true* has a false boolean value. Therefore, it is always better to use the ``... if ... else ...`` form.
fr: Cet idiome est dangereux, car il donne un résultat erroné quand *on_true* a la valeur booléenne fausse. Il faut donc toujours utiliser la forme ``... if ... else ...``.

source: Is it possible to write obfuscated one-liners in Python?
fr: Est-il possible d'écrire des programmes obscurcis (*obfuscated*) d'une ligne en Python ?

source: Yes. Usually this is done by nesting :keyword:`lambda` within :keyword:`!lambda`. See the following three examples, due to Ulf Bartelt::
fr: Oui. C'est souvent le cas en imbriquant des :keyword:`lambda` dans des :keyword:`!lambda`. Par exemple les trois morceaux de code suivants, créés par Ulf Bartelt ::

source: Don't try this at home, kids!
fr: Les enfants, ne faites pas ça chez vous !

source: What does the slash(/) in the parameter list of a function mean?
fr: Que signifie la barre oblique (/) dans la liste des paramètres d'une fonction ?
