Repository: python/python-docs-fr
Catalog: faq/programming.po
Languages: fr

source: Programming FAQ
fr: FAQ de programmation

source: Contents
fr: Sommaire

source: General Questions
fr: Questions générales

source: Is there a source code level debugger with breakpoints, single-stepping, etc.?
fr: Existe-t-il un débogueur de code source avec points d'arrêts, exécution pas-à-pas, etc. ?

source: Yes.
fr: Oui.

source: Several debuggers for Python are described below, and the built-in function :func:`breakpoint` allows you to drop into any of them.
fr: Plusieurs débogueurs sont décrits ci-dessous et la fonction native :func:`breakpoint` permet d'utiliser n'importe lequel d'entre eux.

source: The pdb module is a simple but adequate console-mode debugger for Python. It is part of the standard Python library, and is :mod:`documented in the Library Reference Manual <pdb>`. You can also write your own debugger by using the code for pdb as an example.
fr: Le module ``pdb`` est un débogueur console simple, mais parfaitement adapté à Python. Il fait partie de la bibliothèque standard de Python, sa documentation se trouve dans le :mod:`manuel de référence <pdb>`. Vous pouvez vous inspirer du code de ``pdb`` pour écrire votre propre débogueur.

source: The IDLE interactive development environment, which is part of the standard Python distribution (normally available as Tools/scripts/idle), includes a graphical debugger.
fr: L'environnement de développement interactif IDLE, qui est fourni avec la distribution standard de Python (normalement disponible dans ``Tools/scripts/idle``) contient un débogueur graphique.

source: PythonWin is a Python IDE that includes a GUI debugger based on pdb. The Pythonwin debugger colors breakpoints and has quite a few cool features such as debugging non-Pythonwin programs. Pythonwin is available as part of the `Python for Windows Extensions <https://sourceforge.net/projects/pywin32/>`__ project and as a part of the ActivePython distribution (see https://www.activestate.com/activepython\ ).
fr: *PythonWin* est un environnement de développement intégré (EDI) Python qui embarque un débogueur graphique basé sur ``pdb``. Le débogueur *PythonWin* colore les points d'arrêts et possède quelques fonctionnalités sympathiques, comme la possibilité de déboguer des programmes développés sans *PythonWin*. *PythonWin* est disponible dans le projet `Extensions Python pour Windows <https://sourceforge.net/projects/pywin32/>`__ et fait partie de la distribution ActivePython (voir https://www.activestate.com/activepython\ ).

source: `Boa Constructor <http://boa-constructor.sourceforge.net/>`_ is an IDE and GUI builder that uses wxWidgets. It offers visual frame creation and manipulation, an object inspector, many views on the source like object browsers, inheritance hierarchies, doc string generated html documentation, an advanced debugger, integrated help, and Zope support.
fr: `Boa Constructor <http://boa-constructor.sourceforge.net/>`_ est un EDI et un constructeur d'interface homme-machine basé sur *wxWidgets*. Il propose la création et la manipulation de fenêtres, un inspecteur d'objets, de nombreuses façons de visualiser des sources comme un navigateur d'objets, les hiérarchies d'héritage, la documentation html générée par les docstrings, un débogueur avancé, une aide intégrée et la prise en charge de Zope.

source: `Eric <http://eric-ide.python-projects.org/>`_ is an IDE built on PyQt and the Scintilla editing component.
fr: `Eric <http://eric-ide.python-projects.org/>`_ est un EDI basé sur PyQt et l'outil d'édition Scintilla.

source: Pydb is a version of the standard Python debugger pdb, modified for use with DDD (Data Display Debugger), a popular graphical debugger front end. Pydb can be found at http://bashdb.sourceforge.net/pydb/ and DDD can be found at https://www.gnu.org/software/ddd.
fr: Pydb est une version du débogueur standard Python pdb, modifié pour être utilisé avec DDD (Data Display Debugger), un célèbre débogueur graphique. Pydb est disponible sur http://bashdb.sourceforge.net/pydb/ et DDD est disponible sur https://www.gnu.org/software/ddd.

source: There are a number of commercial Python IDEs that include graphical debuggers. They include:
fr: Il existe de nombreux EDI Python propriétaires qui embarquent un débogueur graphique. Notamment :

source: Is there a tool to help find bugs or perform static analysis?
fr: Existe-t-il des outils pour aider à trouver des bogues ou faire de l'analyse statique de code ?

source: PyChecker is a static analysis tool that finds bugs in Python source code and warns about code complexity and style. You can get PyChecker from http://pychecker.sourceforge.net/.
fr: *PyChecker* est un outil d'analyse statique qui trouve les bogues dans le code source Python et émet des avertissements relatifs à la complexité et au style du code. *PyChecker* est disponible sur http://pychecker.sourceforge.net/.

source: `Pylint <https://www.pylint.org/>`_ is another tool that checks if a module satisfies a coding standard, and also makes it possible to write plug-ins to add a custom feature. In addition to the bug checking that PyChecker performs, Pylint offers some additional features such as checking line length, whether variable names are well-formed according to your coding standard, whether declared interfaces are fully implemented, and more. https://docs.pylint.org/ provides a full list of Pylint's features.
fr: Pylint <https://www.pylint.org/>`_ est un autre outil qui vérifie si un module satisfait aux normes de développement, et qui permet en plus d'écrire des greffons pour ajouter des fonctionnalités personnalisées. En plus de la vérification des bogues effectuée par PyChecker, Pylint effectue quelques vérifications supplémentaires comme la longueur des lignes, les conventions de nommage des variables, que les interfaces déclarées sont implémentées en totalité, et plus encore. https://docs.pylint.org/ fournit la liste complète des fonctionnalités de Pylint.

source: Static type checkers such as `Mypy <http://mypy-lang.org/>`_, `Pyre <https://pyre-check.org/>`_, and `Pytype <https://github.com/google/pytype>`_ can check type hints in Python source code.
fr: Les vérificateurs statiques de typage comme `Mypy <http://mypy-lang.org/>`_, `Pyre <https://pyre-check.org/>`_, et `Pytype <https://github.com/google/pytype>`_ peuvent vérifier les indications de type dans du code source Python.

source: How can I create a stand-alone binary from a Python script?
fr: Comment créer un binaire autonome à partir d'un script Python ?

source: You don't need the ability to compile Python to C code if all you want is a stand-alone program that users can download and run without having to install the Python distribution first. There are a number of tools that determine the set of modules required by a program and bind these modules together with a Python binary to produce a single executable.
fr: Pour créer un programme autonome, c'est-à-dire un programme que n'importe qui peut télécharger et exécuter sans avoir à installer une distribution Python au préalable, il n'est pas nécessaire de compiler du code Python en code C. Il existe en effet plusieurs outils qui déterminent les modules requis par un programme et lient ces modules avec un binaire Python pour produire un seul exécutable.

source: One is to use the freeze tool, which is included in the Python source tree as ``Tools/freeze``. It converts Python byte code to C arrays; a C compiler you can embed all your modules into a new program, which is then linked with the standard Python modules.
fr: Un de ces outils est freeze, qui se trouve dans ``Tools/freeze`` de l'arborescence des sources de Python. Il convertit le code intermédiaire (*bytecode*) Python en tableaux C ; un compilateur C permet d'intégrer tous vos modules dans un nouveau programme, qui est ensuite lié aux modules standards Python.

source: It works by scanning your source recursively for import statements (in both forms) and looking for the modules in the standard Python path as well as in the source directory (for built-in modules). It then turns the bytecode for modules written in Python into C code (array initializers that can be turned into code objects using the marshal module) and creates a custom-made config file that only contains those built-in modules which are actually used in the program. It then compiles the generated C code and links it with the rest of the Python interpreter to form a self-contained binary which acts exactly like your script.
fr: Il fonctionne en cherchant de manière récursive les instructions d'import (sous les deux formes) dans le code source et en recherchant ces modules dans le chemin Python standard ainsi que dans le répertoire source (pour les modules natifs). Il transforme ensuite le code intermédiaire des modules écrits en Python en code C (des tableaux pré-remplis qui peuvent être transformés en objets code à l'aide du module *marshal*) et crée un fichier de configuration personnalisé qui contient uniquement les modules natifs qui sont réellement utilisés dans le programme. Il compile ensuite le code C généré et le lie au reste de l'interpréteur Python pour former un binaire autonome qui fait exactement la même chose que le script.

source: Obviously, freeze requires a C compiler. There are several other utilities which don't. One is Thomas Heller's py2exe (Windows only) at
fr: Bien évidemment, freeze nécessite un compilateur C. Il existe d'autres outils qui peuvent s'en passer. Un de ceux-ci est py2exe de Thomas Heller (pour Windows uniquement) disponible sur

source: Another tool is Anthony Tuininga's `cx_Freeze <https://anthony-tuininga.github.io/cx_Freeze/>`_.
fr: Un autre de ces outils est `cx_Freeze <https://anthony-tuininga.github.io/cx_Freeze/>`_ d'Anthony Tuininga.

source: Are there coding standards or a style guide for Python programs?
fr: Existe-t-il des normes de développement ou un guide de style pour écrire des programmes Python ?

source: Yes. The coding style required for standard library modules is documented as :pep:`8`.
fr: Oui. Le style de développement que les modules de la bibliothèque standard doivent obligatoirement respecter est documenté dans la :pep:`8`.

source: Core Language
fr: Fondamentaux

source: Why am I getting an UnboundLocalError when the variable has a value?
fr: Pourquoi une UnboundLocalError est levée alors qu'une variable a une valeur ?

source: It can be a surprise to get the UnboundLocalError in previously working code when it is modified by adding an assignment statement somewhere in the body of a function.
fr: Il est parfois surprenant d'obtenir une UnboundLocalError dans du code jusqu'à présent correct, quand celui-ci est modifié en ajoutant une instruction d'affectation quelque part dans le corps d'une fonction.

source: This code:
fr: Le code suivant :

source: works, but this code:
fr: fonctionne, mais le suivant :

source: results in an UnboundLocalError:
fr: lève une UnboundLocalError :

source: This is because when you make an assignment to a variable in a scope, that variable becomes local to that scope and shadows any similarly named variable in the outer scope. Since the last statement in foo assigns a new value to ``x``, the compiler recognizes it as a local variable. Consequently when the earlier ``print(x)`` attempts to print the uninitialized local variable and an error results.
fr: Cela est dû au fait que, quand une variable est affectée dans un contexte, cette variable devient locale à ce contexte et remplace toute variable du même nom du contexte appelant. Vu que la dernière instruction dans *foo* affecte une nouvelle valeur à ``x``, le compilateur la traite comme une nouvelle variable. Par conséquent, quand le ``print(x)`` essaye d'afficher la variable non initialisée, une erreur se produit.

source: In the example above you can access the outer scope variable by declaring it global:
fr: Dans l'exemple ci-dessus, la variable du contexte appelant reste accessible en la déclarant globale :

source: This explicit declaration is required in order to remind you that (unlike the superficially analogous situation with class and instance variables) you are actually modifying the value of the variable in the outer scope:
fr: Cette déclaration explicite est obligatoire pour se rappeler que (contrairement au cas à peu près similaire avec des variables de classe et d'instance), c'est la valeur de la variable du contexte appelant qui est modifiée :

source: You can do a similar thing in a nested scope using the :keyword:`nonlocal` keyword:
fr: Une alternative dans un contexte imbriqué consiste à utiliser le mot-clé :keyword:`nonlocal` :

source: What are the rules for local and global variables in Python?
fr: Quelles sont les règles pour les variables locales et globales en Python ?

source: In Python, variables that are only referenced inside a function are implicitly global. If a variable is assigned a value anywhere within the function's body, it's assumed to be a local unless explicitly declared as global.
fr: En Python, si une variable n'est pas modifiée dans une fonction mais seulement lue, elle est implicitement considérée comme globale. Si une valeur lui est affectée, elle est considérée locale (sauf si elle est explicitement déclarée globale).

source: Though a bit surprising at first, a moment's consideration explains this. On one hand, requiring :keyword:`global` for assigned variables provides a bar against unintended side-effects. On the other hand, if ``global`` was required for all global references, you'd be using ``global`` all the time. You'd have to declare as global every reference to a built-in function or to a component of an imported module. This clutter would defeat the usefulness of the ``global`` declaration for identifying side-effects.
fr: Bien que surprenant au premier abord, ce choix s'explique facilement. D'une part, exiger :keyword:`global` pour des variables affectées est une protection contre des effets de bord inattendus. D'autre part, si ``global`` était obligatoire pour toutes les références à des objets globaux, il faudrait mettre ``global`` partout, car il faudrait dans ce cas déclarer globale chaque référence à une fonction native ou à un composant d'un module importé. Le codé serait alors truffé de déclarations ``global``, ce qui nuirait à leur raison d'être : identifier les effets de bords.

source: Why do lambdas defined in a loop with different values all return the same result?
fr: Pourquoi des expressions lambda définies dans une boucle avec des valeurs différentes retournent-elles le même résultat ?

source: Assume you use a for loop to define a few different lambdas (or even plain functions), e.g.::
fr: Supposons que l'on utilise une boucle itérative pour définir des expressions lambda (voire même des fonctions) différentes, par exemple ::

source: This gives you a list that contains 5 lambdas that calculate ``x**2``. You might expect that, when called, they would return, respectively, ``0``, ``1``, ``4``, ``9``, and ``16``. However, when you actually try you will see that they all return ``16``::
fr: Le code précédent crée une liste de 5 expressions lambda qui calculent chacune ``x**2``. En les exécutant, on pourrait s'attendre à obtenir ``0``, ``1``, ``4``, ``9`` et ``16``. Elles renvoient en réalité toutes ``16`` ::

source: This happens because ``x`` is not local to the lambdas, but is defined in the outer scope, and it is accessed when the lambda is called --- not when it is defined. At the end of the loop, the value of ``x`` is ``4``, so all the functions now return ``4**2``, i.e. ``16``. You can also verify this by changing the value of ``x`` and see how the results of the lambdas change::
fr: Ceci s'explique par le fait que ``x`` n'est pas une variable locale aux expressions, mais est définie dans le contexte appelant. Elle est lue à l'appel de l'expression lambda – et non au moment où cette expression est définie. À la fin de la boucle, ``x`` vaut ``4``, donc toutes les fonctions renvoient ``4*2``, c.-à-d. ``16``. Ceci se vérifie également en changeant la valeur de ``x`` et en constatant que les résultats sont modifiés ::

source: In order to avoid this, you need to save the values in variables local to the lambdas, so that they don't rely on the value of the global ``x``::
fr: Pour éviter ce phénomène, les valeurs doivent être stockées dans des variables locales aux expressions lambda pour que celles-ci ne se basent plus sur la variable globale ``x`` ::

source: Here, ``n=x`` creates a new variable ``n`` local to the lambda and computed when the lambda is defined so that it has the same value that ``x`` had at that point in the loop. This means that the value of ``n`` will be ``0`` in the first lambda, ``1`` in the second, ``2`` in the third, and so on. Therefore each lambda will now return the correct result::
fr: Dans ce code, ``n=x`` crée une nouvelle variable ``n``, locale à l'expression. Cette variable est évaluée quand l'expression est définie donc ``n`` a la même valeur que ``x`` à ce moment. La valeur de ``n`` est donc ``0`` dans la première lambda, ``1`` dans la deuxième, ``2`` dans la troisième et ainsi de suite. Chaque expression lambda renvoie donc le résultat correct ::

source: Note that this behaviour is not peculiar to lambdas, but applies to regular functions too.
fr: Ce comportement n'est pas propre aux expressions lambda, mais s'applique aussi aux fonctions normales.

source: How do I share global variables across modules?
fr: Comment partager des variables globales entre modules ?

source: The canonical way to share information across modules within a single program is to create a special module (often called config or cfg). Just import the config module in all modules of your application; the module then becomes available as a global name. Because there is only one instance of each module, any changes made to the module object get reflected everywhere. For example:
fr: La manière standard de partager des informations entre modules d'un même programme est de créer un module spécial (souvent appelé *config* ou *cfg*) et de l'importer dans tous les modules de l'application ; le module devient accessible depuis l'espace de nommage global. Vu qu'il n'y a qu'une instance de chaque module, tout changement dans l'instance est propagé partout. Par exemple :

source: Note that using a module is also the basis for implementing the Singleton design pattern, for the same reason.
fr: Pour les mêmes raisons, l'utilisation d'un module est aussi à la base de l'implémentation du patron de conception singleton.

source: What are the "best practices" for using import in a module?
fr: Quelles sont les « bonnes pratiques » pour utiliser import dans un module ?

source: In general, don't use ``from modulename import *``. Doing so clutters the importer's namespace, and makes it much harder for linters to detect undefined names.
fr: De manière générale, il ne faut pas faire ``from modulename import *``. Ceci encombre l'espace de nommage de l'importateur et rend la détection de noms non-définis beaucoup plus ardue pour les analyseurs de code.

source: Import modules at the top of a file. Doing so makes it clear what other modules your code requires and avoids questions of whether the module name is in scope. Using one import per line makes it easy to add and delete module imports, but using multiple imports per line uses less screen space.
fr: Les modules doivent être importés au début d'un fichier. Ceci permet d'afficher clairement de quels modules le code à besoin et évite de se demander si le module est dans le contexte. Faire un seul `import` par ligne rend l'ajout et la suppression d'une importation de module plus aisé, mais importer plusieurs modules sur une même ligne prend moins d'espace.

source: It's good practice if you import modules in the following order:
fr: Il est recommandé d'importer les modules dans l'ordre suivant :

source: standard library modules -- e.g. ``sys``, ``os``, ``getopt``, ``re``
fr: les modules de la bibliothèque standard — e.g. ``sys``, ``os``, ``getopt``, ``re``

source: third-party library modules (anything installed in Python's site-packages directory) -- e.g. mx.DateTime, ZODB, PIL.Image, etc.
fr: les modules externes (tout ce qui est installé dans le dossier *site-packages* de Python) — e.g. *mx.DateTime, ZODB, PIL.Image*, etc.

source: locally-developed modules
fr: les modules développés en local

source: It is sometimes necessary to move imports to a function or class to avoid problems with circular imports. Gordon McMillan says:
fr: Il est parfois nécessaire de déplacer des importations dans une fonction ou une classe pour éviter les problèmes d'importations circulaires. Comme le souligne Gordon McMillan :

source: Circular imports are fine where both modules use the "import <module>" form of import. They fail when the 2nd module wants to grab a name out of the first ("from module import name") and the import is at the top level. That's because names in the 1st are not yet available, because the first module is busy importing the 2nd.
fr: Il n'y a aucun souci à faire des importations circulaires tant que les deux modules utilisent la forme ``import <module>``. Ça ne pose problème que si le second module cherche à récupérer un nom du premier module (*"from module import name"*) et que l'importation est dans l'espace de nommage du fichier. Les noms du premier module ne sont en effet pas encore disponibles car le premier module est occupé à importer le second.

source: In this case, if the second module is only used in one function, then the import can easily be moved into that function. By the time the import is called, the first module will have finished initializing, and the second module can do its import.
fr: Dans ce cas, si le second module n'est utilisé que dans une fonction, l'importation peut facilement être déplacée dans cette fonction. Au moment où l'importation sera appelée, le premier module aura fini de s'initialiser et le second pourra faire son importation.

source: It may also be necessary to move imports out of the top level of code if some of the modules are platform-specific. In that case, it may not even be possible to import all of the modules at the top of the file. In this case, importing the correct modules in the corresponding platform-specific code is a good option.
fr: Il peut parfois être nécessaire de déplacer des importations de modules hors de l'espace de plus haut niveau du code si certains de ces modules dépendent de la machine utilisée. Dans ce cas de figure, il est parfois impossible d'importer tous les modules au début du fichier. Dans ce cas, il est recommandé d'importer les modules adéquats dans le code spécifique à la machine.
