Repository: python/python-docs-fr
Catalog: faq/programming.po
Languages: fr

source: However, a far more straightforward way to get the effect of a static method is via a simple module-level function::
fr: Cependant, d'une manière beaucoup plus simple pour obtenir l'effet d'une méthode statique se fait par une simple fonction au niveau du module ::

source: If your code is structured so as to define one class (or tightly related class hierarchy) per module, this supplies the desired encapsulation.
fr: Si votre code est structuré de manière à définir une classe (ou bien la hiérarchie des classes connexes) par module, ceci fournira l'encapsulation souhaitée.

source: How can I overload constructors (or methods) in Python?
fr: Comment surcharger les constructeurs (ou méthodes) en Python ?

source: This answer actually applies to all methods, but the question usually comes up first in the context of constructors.
fr: Cette réponse s'applique en fait à toutes les méthodes, mais la question se pose généralement dans le contexte des constructeurs.

source: In C++ you'd write
fr: En C++, on écrirait

source: In Python you have to write a single constructor that catches all cases using default arguments. For example::
fr: En Python, vous devez écrire un constructeur unique qui considère tous les cas en utilisant des arguments par défaut. Par exemple ::

source: This is not entirely equivalent, but close enough in practice.
fr: Ce n'est pas tout à fait équivalent, mais suffisamment proche dans la pratique.

source: You could also try a variable-length argument list, e.g. ::
fr: Vous pouvez aussi utiliser une liste d'arguments de longueur variable, par exemple ::

source: The same approach works for all method definitions.
fr: La même approche fonctionne pour toutes les définitions de méthode.

source: I try to use __spam and I get an error about _SomeClassName__spam.
fr: J'essaie d'utiliser ``__spam`` et j'obtiens une erreur à propos de ``_SomeClassName__spam``.

source: Variable names with double leading underscores are "mangled" to provide a simple but effective way to define class private variables. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with any leading underscores stripped.
fr: Les noms de variables commençant avec deux tirets bas sont « déformés », c'est un moyen simple mais efficace de définir des variables privées à une classe. Tout identifiant de la forme ``__spam`` (commençant par au moins deux tirets bas et se terminant par au plus un tiret bas) est textuellement remplacé par ``_classname__spam``, où ``classname`` est le nom de la classe en cours sans les éventuels tirets bas du début.

source: This doesn't guarantee privacy: an outside user can still deliberately access the "_classname__spam" attribute, and private values are visible in the object's ``__dict__``. Many Python programmers never bother to use private variable names at all.
fr: Cela ne garantit aucune protection : un utilisateur extérieur peut encore délibérément accéder à l'attribut ``_classname__spam`` et les valeurs privées sont visibles dans l'objet ``__dict__``. De nombreux programmeurs Python ne prennent jamais la peine d'utiliser des noms de variable privés.

source: My class defines __del__ but it is not called when I delete the object.
fr: Ma classe définit ``__del__`` mais elle n'est pas appelée lorsque je supprime l'objet.

source: There are several possible reasons for this.
fr: Il y a plusieurs explications possibles.

source: The del statement does not necessarily call :meth:`__del__` -- it simply decrements the object's reference count, and if this reaches zero :meth:`__del__` is called.
fr: La commande *del* n'appelle pas forcément :meth:`__del__` — elle décrémente simplement le compteur de références de l'objet et, si celui-ci arrive à zéro, :meth:`__del__` est appelée.

source: If your data structures contain circular links (e.g. a tree where each child has a parent reference and each parent has a list of children) the reference counts will never go back to zero. Once in a while Python runs an algorithm to detect such cycles, but the garbage collector might run some time after the last reference to your data structure vanishes, so your :meth:`__del__` method may be called at an inconvenient and random time. This is inconvenient if you're trying to reproduce a problem. Worse, the order in which object's :meth:`__del__` methods are executed is arbitrary. You can run :func:`gc.collect` to force a collection, but there *are* pathological cases where objects will never be collected.
fr: Si la structure de données contient des références circulaires (e.g. un arbre dans lequel chaque fils référence son père, et chaque père garde une liste de ses fils), le compteur de références n'arrivera jamais à zéro. Python exécute périodiquement un algorithme pour détecter ce genre de cycles, mais il peut se passer un certain temps entre le moment où la structure est référencée pour la dernière fois et l'appel du ramasse-miettes, donc la méthode :meth:`__del__` peut être appelée à un moment aléatoire et pas opportun. C'est gênant pour essayer reproduire un problème. Pire, l'ordre dans lequel les méthodes :meth:`__del__` des objets sont appelées est arbitraire. Il est possible de forcer l'appel du ramasse-miettes avec la fonction :func:`gc.collect`, mais il existe certains cas où les objets ne seront jamais nettoyés.

source: Despite the cycle collector, it's still a good idea to define an explicit ``close()`` method on objects to be called whenever you're done with them. The ``close()`` method can then remove attributes that refer to subobjects. Don't call :meth:`__del__` directly -- :meth:`__del__` should call ``close()`` and ``close()`` should make sure that it can be called more than once for the same object.
fr: Bien que le ramasse-miette de cycles existe, il est tout de même recommandé de définir une méthode ``close()`` explicite sur des objets, et de l'appeler quand leur cycle de vie s'achève. Cette méthode ``close()`` peut alors supprimer les attributs qui référencent des sous-objets. Il vaut mieux ne pas appeler la méthode :meth:`__del__` directement, mais la méthode :meth:`__del__` devrait appeler la méthode ``close()`` et ``close()`` doit pouvoir être appelée plusieurs fois sur le même objet.

source: Another way to avoid cyclical references is to use the :mod:`weakref` module, which allows you to point to objects without incrementing their reference count. Tree data structures, for instance, should use weak references for their parent and sibling references (if they need them!).
fr: Une alternative pour éviter les références cycliques consiste à utiliser le module :mod:`weakref`, qui permet de faire référence à des objets sans incrémenter leur compteur de références. Par exemple, les structures d'arbres devraient utiliser des références faibles entre pères et fils (si nécessaire !).

source: Finally, if your :meth:`__del__` method raises an exception, a warning message is printed to :data:`sys.stderr`.
fr: Enfin, si la méthode :meth:`__del__` lève une exception, un message d'avertissement s'affiche dans :data:`sys.stderr`.

source: How do I get a list of all instances of a given class?
fr: Comment obtenir toutes les instances d'une classe ?

source: Python does not keep track of all instances of a class (or of a built-in type). You can program the class's constructor to keep track of all instances by keeping a list of weak references to each instance.
fr: Python ne tient pas de registre de toutes les instances d'une classe (ni de n'importe quel type natif). Il est cependant possible de programmer le constructeur de la classe de façon à tenir un tel registre, en maintenant une liste de références faibles vers chaque instance.

source: Why does the result of ``id()`` appear to be not unique?
fr: Pourquoi le résultat de ``id()`` peut-il être le même pour deux objets différents ?

source: The :func:`id` builtin returns an integer that is guaranteed to be unique during the lifetime of the object. Since in CPython, this is the object's memory address, it happens frequently that after an object is deleted from memory, the next freshly created object is allocated at the same position in memory. This is illustrated by this example:
fr: La fonction native :func:`id` renvoie un entier dont l'unicité est garantie durant toute la vie de l'objet. Vu qu'en CPython cet entier est en réalité l'adresse mémoire de l'objet, il est fréquent qu'un nouvel objet soit alloué à une adresse mémoire identique à celle d'un objet venant d'être supprimé. Comme l'illustre le code suivant :

source: The two ids belong to different integer objects that are created before, and deleted immediately after execution of the ``id()`` call. To be sure that objects whose id you want to examine are still alive, create another reference to the object:
fr: Les deux identifiants appartiennent à des objets entiers créés juste avant l'appel à ``id()`` et détruits immédiatement après. Pour s'assurer que les objets dont on veut examiner les identifiants sont toujours en vie, créons une nouvelle référence à l'objet :

source: How do I create a .pyc file?
fr: Comment créer des fichiers ``.pyc`` ?

source: When a module is imported for the first time (or when the source file has changed since the current compiled file was created) a ``.pyc`` file containing the compiled code should be created in a ``__pycache__`` subdirectory of the directory containing the ``.py`` file. The ``.pyc`` file will have a filename that starts with the same name as the ``.py`` file, and ends with ``.pyc``, with a middle component that depends on the particular ``python`` binary that created it. (See :pep:`3147` for details.)
fr: Quand un module est importé pour la première fois (ou si le fichier source a été modifié depuis la création du fichier compilé), un fichier ``.pyc`` contenant le code précompilé est créé dans un sous-dossier ``__pycache__`` du dossier contentant le fichier ``.py``. Le nom du fichier ``.pyc`` est identique au fichier ``.py`` et se termine par ``.pyc``, avec une partie centrale qui dépend du binaire ``python`` qui l'a créé (voir la :pep:`3147` pour de plus amples précisions).

source: One reason that a ``.pyc`` file may not be created is a permissions problem with the directory containing the source file, meaning that the ``__pycache__`` subdirectory cannot be created. This can happen, for example, if you develop as one user but run as another, such as if you are testing with a web server.
fr: Une des raisons pour lesquelles un fichier ``.pyc`` peut ne pas être créé est un problème de droits sur le dossier qui contient le fichier source, ce qui veut dire qu'il est impossible de créer le sous-dossier ``__pycache__``. Ceci peut arriver, par exemple, si vous développez en tant qu'un certain utilisateur, mais que le code est exécuté en tant qu'un autre utilisateur, par exemple pour tester un serveur Web.

source: Unless the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable is set, creation of a .pyc file is automatic if you're importing a module and Python has the ability (permissions, free space, etc...) to create a ``__pycache__`` subdirectory and write the compiled module to that subdirectory.
fr: La création du fichier ``.pyc`` est automatique durant l'import d'un module si Python est capable (en termes de droits, d'espace disque, etc) de créer un sous-dossier ``__pycache__`` et d'écrire le module ainsi compilé dans ce sous-répertoire, à moins que la variable d'environnement :envvar:`PYTHONDONTWRITEBYTECODE` soit définie.

source: Running Python on a top level script is not considered an import and no ``.pyc`` will be created. For example, if you have a top-level module ``foo.py`` that imports another module ``xyz.py``, when you run ``foo`` (by typing ``python foo.py`` as a shell command), a ``.pyc`` will be created for ``xyz`` because ``xyz`` is imported, but no ``.pyc`` file will be created for ``foo`` since ``foo.py`` isn't being imported.
fr: Exécuter du Python dans un script de plus haut niveau n'est pas considéré comme un import et le fichier ``.pyc`` n'est pas créé. Par exemple, si un module de plus haut niveau ``foo.py`` importe un autre module ``xyz.py``, alors à l'exécution de ``foo`` (en tapant ``python foo.py`` dans la console), un fichier ``.pyc`` est créé pour ``xyz`` mais pas pour ``foo`` car ``foo.py`` n'est pas importé.

source: If you need to create a ``.pyc`` file for ``foo`` -- that is, to create a ``.pyc`` file for a module that is not imported -- you can, using the :mod:`py_compile` and :mod:`compileall` modules.
fr: Pour créer un fichier ``.pyc`` pour ``foo`` — c'est-à-dire créer un fichier ``.pyc`` pour un module qui n'est pas importé — il existe les modules :mod:`py_compile` et :mod:`compileall`.

source: The :mod:`py_compile` module can manually compile any module. One way is to use the ``compile()`` function in that module interactively::
fr: Le module :mod:`py_compile` peut compiler n'importe quel module manuellement. Il est ainsi possible d'appeler la fonction ``compile()`` de manière interactive ::

source: This will write the ``.pyc`` to a ``__pycache__`` subdirectory in the same location as ``foo.py`` (or you can override that with the optional parameter ``cfile``).
fr: Ces lignes écrivent le ``.pyc`` dans un sous-dossier ``__pycache__`` à côté de ``foo.py`` (le paramètre optionnel ``cfile`` permet de changer ce comportement).

source: You can also automatically compile all files in a directory or directories using the :mod:`compileall` module. You can do it from the shell prompt by running ``compileall.py`` and providing the path of a directory containing Python files to compile::
fr: Tous les fichiers d'un ou plusieurs dossiers peuvent aussi être compilés avec le module :mod:`compileall`. C'est possible depuis l'invite de commande en exécutant ``compileall.py`` avec le chemin du dossier contenant les fichiers Python à compiler ::

source: How do I find the current module name?
fr: Comment obtenir le nom du module actuel ?

source: A module can find out its own module name by looking at the predefined global variable ``__name__``. If this has the value ``'__main__'``, the program is running as a script. Many modules that are usually used by importing them also provide a command-line interface or a self-test, and only execute this code after checking ``__name__``::
fr: Un module peut déterminer son propre nom en examinant la variable globale prédéfinie ``__name__``. Si celle-ci vaut ``'__main__'``, c'est que le programme est exécuté comme un script. Beaucoup de modules qui doivent normalement être importés pour pouvoir être utilisés fournissent aussi une interface en ligne de commande ou un test automatique. Ils n'exécutent cette portion du code qu'après avoir vérifié la valeur de ``__name__`` ::

source: How can I have modules that mutually import each other?
fr: Comment avoir des modules qui s'importent mutuellement ?

source: Suppose you have the following modules:
fr: Considérons les modules suivants :

source: The problem is that the interpreter will perform the following steps:
fr: Le problème réside dans les étapes que l'interpréteur va réaliser :

source: main imports foo
fr: *main* importe *foo*

source: Empty globals for foo are created
fr: Les variables globales (vides) de *foo* sont créées

source: foo is compiled and starts executing
fr: *foo* est compilé et commence à s'exécuter

source: foo imports bar
fr: *foo* importe *bar*

source: Empty globals for bar are created
fr: Les variables globales (vides) de *bar* sont créées

source: bar is compiled and starts executing
fr: *bar* est compilé et commence à s'exécuter

source: bar imports foo (which is a no-op since there already is a module named foo)
fr: *bar* importe *foo* (en réalité, rien ne passe car il y a déjà un module appelé *foo*)

source: The last step fails, because Python isn't done with interpreting ``foo`` yet and the global symbol dictionary for ``foo`` is still empty.
fr: La dernière étape échoue car Python n'a pas fini d'interpréter ``foo`` et le dictionnaire global des symboles de ``foo`` est encore vide.

source: The same thing happens when you use ``import foo``, and then try to access ``foo.foo_var`` in global code.
fr: Le même phénomène arrive quand on utilise ``import foo``, et qu'on essaye ensuite d'accéder à ``foo.foo_var`` dans le code global.

source: There are (at least) three possible workarounds for this problem.
fr: Il y a (au moins) trois façons de contourner ce problème.

source: Guido van Rossum recommends avoiding all uses of ``from <module> import ...``, and placing all code inside functions. Initializations of global variables and class variables should use constants or built-in functions only. This means everything from an imported module is referenced as ``<module>.<name>``.
fr: Guido van Rossum déconseille d'utiliser ``from <module> import ...`` et de mettre tout le code dans des fonctions. L'initialisation des variables globales et des variables de classe ne doit utiliser que des constantes ou des fonctions natives. Ceci implique que tout ce qui est fourni par un module soit référencé par ``<module>.<nom>``.

source: Jim Roskind suggests performing steps in the following order in each module:
fr: Jim Roskind recommande d'effectuer les étapes suivantes dans cet ordre dans chaque module :

source: exports (globals, functions, and classes that don't need imported base classes)
fr: les exportations (variables globales, fonctions et les classes qui ne nécessitent d'importer des classes de base)

source: ``import`` statements
fr: les instructions ``import``

source: active code (including globals that are initialized from imported values).
fr: le code (avec les variables globales qui sont initialisées à partir de valeurs importées).

source: van Rossum doesn't like this approach much because the imports appear in a strange place, but it does work.
fr: van Rossum désapprouve cette approche car les importations se trouvent à un endroit bizarre, mais cela fonctionne.

source: Matthias Urlichs recommends restructuring your code so that the recursive import is not necessary in the first place.
fr: Matthias Urlichs conseille de restructurer le code pour éviter les importations récursives.

source: These solutions are not mutually exclusive.
fr: Ces solutions peuvent être combinées.

source: __import__('x.y.z') returns <module 'x'>; how do I get z?
fr: ``__import__('x.y.z')`` renvoie ``<module 'x'>`` ; comment accéder à ``z`` ?

source: Consider using the convenience function :func:`~importlib.import_module` from :mod:`importlib` instead::
fr: Utilisez plutôt la fonction :func:`~importlib.import_module` de :mod:`importlib` ::

source: When I edit an imported module and reimport it, the changes don't show up. Why does this happen?
fr: Quand j'édite un module et que je le réimporte, je ne vois pas les changements. Pourquoi ?

source: For reasons of efficiency as well as consistency, Python only reads the module file on the first time a module is imported. If it didn't, in a program consisting of many modules where each one imports the same basic module, the basic module would be parsed and re-parsed many times. To force re-reading of a changed module, do this::
fr: Pour des raisons de performance et de cohérence, Python ne lit le fichier d'un module que la première fois où celui-ci est importé. Si ce n'était pas le cas, dans un programme composé d'un très grand nombre de modules qui importent tous le même module de base, ce module de base serait analysé et ré-analysé un très grand nombre de fois. Pour forcer la relecture d'un module, il faut faire ::

source: Warning: this technique is not 100% fool-proof. In particular, modules containing statements like ::
fr: Attention, cette technique ne marche pas systématiquement. En particulier, les modules qui contiennent des instructions comme ::

source: will continue to work with the old version of the imported objects. If the module contains class definitions, existing class instances will *not* be updated to use the new class definition. This can result in the following paradoxical behaviour::
fr: continuent de fonctionner avec l'ancienne version des objets importés. Si le module contient une définition de classe, les instances déjà existantes de celle-ci ne sont *pas* mises à jour avec la nouvelle définition de la classe. Ceci peut conduire au comportement paradoxal suivant ::

source: The nature of the problem is made clear if you print out the "identity" of the class objects::
fr: La nature du problème apparaît clairement en affichant « l'identité » des objets de la classe ::
