Repository: python/python-docs-fr
Catalog: faq/programming.po
Languages: fr

source: A slash in the argument list of a function denotes that the parameters prior to it are positional-only. Positional-only parameters are the ones without an externally-usable name. Upon calling a function that accepts positional-only parameters, arguments are mapped to parameters based solely on their position. For example, :func:`divmod` is a function that accepts positional-only parameters. Its documentation looks like this::
fr: Une barre oblique dans la liste des arguments d'une fonction indique que les paramètres la précédant sont uniquement positionnels. Les paramètres uniquement positionnels ne peuvent pas être référencés par leur nom depuis l'extérieur. Lors de l'appel d'une fonction qui accepte des paramètres uniquement positionnels, les arguments sont affectés aux paramètres en fonction de leur position. Par exemple, la fonction :func:`divmod` n'accepte que des paramètres uniquement positionnels. Sa documentation est la suivante ::

source: The slash at the end of the parameter list means that both parameters are positional-only. Thus, calling :func:`divmod` with keyword arguments would lead to an error::
fr: La barre oblique à la fin de la liste des paramètres signifie que les trois paramètres sont uniquement positionnels. Et donc, appeler :func:`divmod` avec des arguments nommés provoque une erreur ::

source: Numbers and strings
fr: Nombres et chaînes de caractères

source: How do I specify hexadecimal and octal integers?
fr: Comment écrire des entiers hexadécimaux ou octaux ?

source: To specify an octal digit, precede the octal value with a zero, and then a lower or uppercase "o". For example, to set the variable "a" to the octal value "10" (8 in decimal), type::
fr: Pour écrire un entier octal, faites précéder la valeur octale par un zéro, puis un "o" majuscule ou minuscule. Par exemple pour affecter la valeur octale "10" (8 en décimal) à la variable "a", tapez ::

source: Hexadecimal is just as easy. Simply precede the hexadecimal number with a zero, and then a lower or uppercase "x". Hexadecimal digits can be specified in lower or uppercase. For example, in the Python interpreter::
fr: L'hexadécimal est tout aussi simple, faites précéder le nombre hexadécimal par un zéro, puis un "x" majuscule ou minuscule. Les nombres hexadécimaux peuvent être écrits en majuscules ou en minuscules. Par exemple, dans l'interpréteur Python ::

source: Why does -22 // 10 return -3?
fr: Pourquoi ``-22 // 10`` donne-t-il ``-3`` ?

source: It's primarily driven by the desire that ``i % j`` have the same sign as ``j``. If you want that, and also want::
fr: Cela est principalement dû à la volonté que ``i % j`` ait le même signe que j. Si vous voulez en plus que ::

source: then integer division has to return the floor. C also requires that identity to hold, and then compilers that truncate ``i // j`` need to make ``i % j`` have the same sign as ``i``.
fr: alors la division entière doit renvoyer l'entier inférieur. Le C impose également que cette égalité soit vérifiée, et donc les compilateurs qui tronquent ``i // j`` ont besoin que ``i % j`` ait le même signe que ``i``.

source: There are few real use cases for ``i % j`` when ``j`` is negative. When ``j`` is positive, there are many, and in virtually all of them it's more useful for ``i % j`` to be ``>= 0``. If the clock says 10 now, what did it say 200 hours ago? ``-190 % 12 == 2`` is useful; ``-190 % 12 == -10`` is a bug waiting to bite.
fr: Il y a peu de cas d'utilisation réels pour ``i % j`` quand ``j`` est négatif. Quand ``j`` est positif, il y en a beaucoup, et dans pratiquement tous, il est plus utile que ``i % j`` soit ``>=0``. Si l'horloge affiche 10 h maintenant, qu'affichait-elle il y a 200 heures ? ``-190 % 12 == 2`` est utile ; ``-190 % 12 == -10`` est un bogue en puissance.

source: How do I convert a string to a number?
fr: Comment convertir une chaîne de caractères en nombre ?

source: For integers, use the built-in :func:`int` type constructor, e.g. ``int('144') == 144``. Similarly, :func:`float` converts to floating-point, e.g. ``float('144') == 144.0``.
fr: Pour les entiers, utilisez le constructeur natif de :func:`int`, par exemple ``int('144') == 144``. De façon similaire, :func:`float` donne la valeur flottante, par exemple ``float('144') == 144.0``.

source: By default, these interpret the number as decimal, so that ``int('0144') == 144`` and ``int('0x144')`` raises :exc:`ValueError`. ``int(string, base)`` takes the base to convert from as a second optional argument, so ``int('0x144', 16) == 324``. If the base is specified as 0, the number is interpreted using Python's rules: a leading '0o' indicates octal, and '0x' indicates a hex number.
fr: Par défaut, ces fonctions interprètent les nombres comme des décimaux, de telle façon que ``int('0144') == 144`` et ``int('0x144')`` lève une :exc:`ValueError`. Le second argument (optionnel) de ``int(string, base)`` est la base dans laquelle convertir, donc ``int('0x144', 16) == 324``. Si la base donnée est 0, le nombre est interprété selon les règles Python : un préfixe ``0o`` indique de l'octal et ``0x`` indique de l'hexadécimal.

source: Do not use the built-in function :func:`eval` if all you need is to convert strings to numbers. :func:`eval` will be significantly slower and it presents a security risk: someone could pass you a Python expression that might have unwanted side effects. For example, someone could pass ``__import__('os').system("rm -rf $HOME")`` which would erase your home directory.
fr: N'utilisez pas la fonction native :func:`eval` pour convertir des chaînes de caractères en nombres. :func:`eval` est beaucoup plus lente et pose des problèmes de sécurité : quelqu'un pourrait vous envoyer une expression Python pouvant avoir des effets de bord indésirables. Par exemple, quelqu'un pourrait passer ``__import__('os').system("rm -rf $HOME")`` ce qui effacerait votre répertoire personnel.

source: :func:`eval` also has the effect of interpreting numbers as Python expressions, so that e.g. ``eval('09')`` gives a syntax error because Python does not allow leading '0' in a decimal number (except '0').
fr: :func:`eval` a aussi pour effet d'interpréter les nombres comme des expressions Python. Ainsi ``eval('09')`` produit une erreur de syntaxe, parce que Python ne permet pas les '0' en tête d'un nombre décimal (à l'exception du nombre '0').

source: How do I convert a number to a string?
fr: Comment convertir un nombre en chaîne de caractères ?

source: To convert, e.g., the number 144 to the string '144', use the built-in type constructor :func:`str`. If you want a hexadecimal or octal representation, use the built-in functions :func:`hex` or :func:`oct`. For fancy formatting, see the :ref:`f-strings` and :ref:`formatstrings` sections, e.g. ``"{:04d}".format(144)`` yields ``'0144'`` and ``"{:.3f}".format(1.0/3.0)`` yields ``'0.333'``.
fr: Pour transformer, par exemple, le nombre 144 en la chaîne de caractères '144', il faut utiliser la fonction native :func:`str`. Pour obtenir la représentation hexadécimale ou octale, il faut utiliser les fonctions natives :func:`hex` ou :func:`oct`. Pour des représentations non-conventionnelles, se référer aux sections :ref:`f-strings` et :ref:`formatstrings`, e.g. ``"{:04d}".format(144)`` produit ``'0144'`` et ``"{:.3f}".format(1.0/3.0)`` produit ``'0.333'``.

source: How do I modify a string in place?
fr: Comment modifier une chaîne de caractères « sur place » ?

source: You can't, because strings are immutable. In most situations, you should simply construct a new string from the various parts you want to assemble it from. However, if you need an object with the ability to modify in-place unicode data, try using an :class:`io.StringIO` object or the :mod:`array` module::
fr: C'est impossible car les chaînes de caractères sont immuables. Dans la plupart des cas, il faut tout simplement construire une nouvelle chaîne à partir des morceaux de l'ancienne. Si toutefois vous avez besoin d'un objet capable de modifier de la donnée Unicode « sur place », essayez d'utiliser un objet :class:`io.StringIO` ou le module :mod:`array` ::

source: How do I use strings to call functions/methods?
fr: Comment utiliser des chaînes de caractères pour appeler des fonctions/méthodes ?

source: There are various techniques.
fr: Il y a plusieurs façons de faire.

source: The best is to use a dictionary that maps strings to functions. The primary advantage of this technique is that the strings do not need to match the names of the functions. This is also the primary technique used to emulate a case construct::
fr: La meilleure est d'utiliser un dictionnaire qui fait correspondre les chaînes de caractères à des fonctions. Le principal avantage de cette technique est que les chaînes n'ont pas besoin d'être égales aux noms de fonctions. C'est aussi la façon principale d'imiter la construction "case" ::

source: Use the built-in function :func:`getattr`::
fr: Utiliser la fonction :func:`getattr` ::

source: Note that :func:`getattr` works on any object, including classes, class instances, modules, and so on.
fr: Notez que :func:`getattr` marche sur n'importe quel objet, ceci inclut les classes, les instances de classes, les modules et ainsi de suite.

source: This is used in several places in the standard library, like this::
fr: Ceci est utilisé à plusieurs reprises dans la bibliothèque standard, de cette façon ::

source: Use :func:`locals` or :func:`eval` to resolve the function name::
fr: Utilisez :func:`locals` ou :func:`eval` pour résoudre le nom de la fonction ::

source: Note: Using :func:`eval` is slow and dangerous. If you don't have absolute control over the contents of the string, someone could pass a string that resulted in an arbitrary function being executed.
fr: Note : utiliser :func:`eval` est lent est dangereux. Si vous n'avez pas un contrôle absolu sur le contenu de la chaîne de caractères, quelqu'un pourrait passer une chaîne de caractères pouvant appeler n'importe quelle fonction.

source: Is there an equivalent to Perl's chomp() for removing trailing newlines from strings?
fr: Existe-t-il un équivalent à la fonction ``chomp()`` de Perl, pour retirer les caractères de fin de ligne d'une chaîne de caractères ?

source: You can use ``S.rstrip("\r\n")`` to remove all occurrences of any line terminator from the end of the string ``S`` without removing other trailing whitespace. If the string ``S`` represents more than one line, with several empty lines at the end, the line terminators for all the blank lines will be removed::
fr: Vous pouvez utiliser ``S.rstrip("\r\n")`` pour retirer toutes les occurrences de tout marqueur de fin de ligne à la fin d'une chaîne de caractère ``S``, sans en enlever aucune espace. Si la chaîne ``S`` représente plus d'une ligne, avec plusieurs lignes vides, les marqueurs de fin de ligne de chaque ligne vide seront retirés ::

source: Since this is typically only desired when reading text one line at a time, using ``S.rstrip()`` this way works well.
fr: Vu que cela ne sert presque qu'à lire un texte ligne à ligne, utiliser ``S.rstrip()`` de cette manière fonctionne correctement.

source: Is there a scanf() or sscanf() equivalent?
fr: Existe-t-il un équivalent à ``scanf()`` ou ``sscanf()`` ?

source: Not as such.
fr: Pas exactement.

source: For simple input parsing, the easiest approach is usually to split the line into whitespace-delimited words using the :meth:`~str.split` method of string objects and then convert decimal strings to numeric values using :func:`int` or :func:`float`. ``split()`` supports an optional "sep" parameter which is useful if the line uses something other than whitespace as a separator.
fr: Pour une simple analyse de chaîne, l'approche la plus simple est généralement de découper la ligne en mots délimités par des espaces, en utilisant la méthode :meth:`~str.split` des objets chaîne de caractères, et ensuite de convertir les chaînes de décimaux en valeurs numériques en utilisant la fonction :func:`int` ou :func:`float`. ``split()`` possède un paramètre optionnel "sep" qui est utile si la ligne utilise autre chose que des espaces comme séparateurs.

source: For more complicated input parsing, regular expressions are more powerful than C's :c:func:`sscanf` and better suited for the task.
fr: Pour des analyses plus compliquées, les expressions rationnelles sont plus puissantes que la fonction :c:func:`sscanf` de C et mieux adaptées à la tâche.

source: What does 'UnicodeDecodeError' or 'UnicodeEncodeError' error mean?
fr: Que signifient les erreurs ``UnicodeDecodeError`` ou ``UnicodeEncodeError`` ?

source: See the :ref:`unicode-howto`.
fr: Voir :ref:`unicode-howto`.

source: Performance
fr: Performances

source: My program is too slow. How do I speed it up?
fr: Mon programme est trop lent. Comment l'accélérer ?

source: That's a tough one, in general. First, here are a list of things to remember before diving further:
fr: Question difficile en général. Il faut garder en tête les points suivants avant d'aller plus loin :

source: Performance characteristics vary across Python implementations. This FAQ focuses on :term:`CPython`.
fr: Les performances varient en fonction des implémentations de Python. Cette FAQ ne traite que de :term:`CPython`.

source: Behaviour can vary across operating systems, especially when talking about I/O or multi-threading.
fr: Les comportements peuvent différer d'un système d'exploitation à l'autre, tout particulièrement quand il s'agit d'entrée/sortie ou de fils d'exécution multiples.

source: You should always find the hot spots in your program *before* attempting to optimize any code (see the :mod:`profile` module).
fr: Il faut toujours essayer de trouver où sont les points de contention d'un programme *avant* d'essayer d'optimiser du code (voir le module :mod:`profile`).

source: Writing benchmark scripts will allow you to iterate quickly when searching for improvements (see the :mod:`timeit` module).
fr: Écrire des scripts d'évaluation de performances permet de progresser rapidement dans la recherche d'améliorations (voir le module :mod:`timeit`).

source: It is highly recommended to have good code coverage (through unit testing or any other technique) before potentially introducing regressions hidden in sophisticated optimizations.
fr: Il est très fortement recommandé d'avoir une bonne couverture de code (avec des tests unitaires ou autre) avant d'ajouter des erreurs dans des optimisations sophistiquées.

source: That being said, there are many tricks to speed up Python code. Here are some general principles which go a long way towards reaching acceptable performance levels:
fr: Ceci étant dit, il y a beaucoup d'astuces pour accélérer du code Python. Voici quelques principes généraux qui peuvent aider à atteindre des niveaux de performance satisfaisants :

source: Making your algorithms faster (or changing to faster ones) can yield much larger benefits than trying to sprinkle micro-optimization tricks all over your code.
fr: Améliorer les algorithmes (ou en changer pour des plus performants) peut produire de bien meilleurs résultats que d'optimiser ça et là de petites portions du code.

source: Use the right data structures. Study documentation for the :ref:`bltin-types` and the :mod:`collections` module.
fr: Utiliser les structures de données adaptées. Se référer à la documentation des :ref:`bltin-types` et du module :mod:`collections`.

source: When the standard library provides a primitive for doing something, it is likely (although not guaranteed) to be faster than any alternative you may come up with. This is doubly true for primitives written in C, such as builtins and some extension types. For example, be sure to use either the :meth:`list.sort` built-in method or the related :func:`sorted` function to do sorting (and see the :ref:`sortinghowto` for examples of moderately advanced usage).
fr: Quand la bibliothèque standard fournit une implémentation pour quelque chose, il y a de fortes chances (même si ce n'est pas systématique) que cette implémentation soit plus rapide que la votre. C'est d'autant plus vrai pour les routines écrites en C, comme les routines natives et certaines extensions de types. Par exemple, il faut utiliser la méthode native :meth:`list.sort` ou la fonction :func:`sorted` similaire pour classer (et se référer à la section :ref:`sortinghowto` pour des exemples d'utilisation courante).

source: Abstractions tend to create indirections and force the interpreter to work more. If the levels of indirection outweigh the amount of useful work done, your program will be slower. You should avoid excessive abstraction, especially under the form of tiny functions or methods (which are also often detrimental to readability).
fr: Les abstractions ont tendance à créer des indirections et obligent l'interpréteur à faire plus d'efforts. Si le niveau d'indirection dépasse la quantité de travail effectif, le programme sera ralenti. Il faut toujours éviter trop d'indirections, en particulier sous la forme de fonctions ou méthodes trop petites (qui nuisent aussi souvent à la clarté du code).

source: If you have reached the limit of what pure Python can allow, there are tools to take you further away. For example, `Cython <http://cython.org>`_ can compile a slightly modified version of Python code into a C extension, and can be used on many different platforms. Cython can take advantage of compilation (and optional type annotations) to make your code significantly faster than when interpreted. If you are confident in your C programming skills, you can also :ref:`write a C extension module <extending-index>` yourself.
fr: Si vous atteignez les limites de ce que du Python « pur » permet de faire, il y a des outils qui permettent d'aller plus loin. Par exemple, `Cython <http://cython.org>`_ peut compiler une version légèrement modifiée de code Python en une extension C et est disponible sur de nombreuses plate-formes. Cython peut bénéficier de la compilation (et de l'annotation, optionnelle, des types) pour rendre votre code beaucoup plus rapide que s'il était interprété. Si vous avez confiance en vos capacités de programmation en C, vous pouvez aussi :ref:`écrire un module d'extension en C<extending-index>` vous-même.

source: The wiki page devoted to `performance tips <https://wiki.python.org/moin/PythonSpeed/PerformanceTips>`_.
fr: La page wiki dédiée aux `astuces de performance <https://wiki.python.org/moin/PythonSpeed/PerformanceTips>`_.

source: What is the most efficient way to concatenate many strings together?
fr: Quelle est la manière la plus efficace de concaténer un grand nombre de chaînes de caractères ?

source: :class:`str` and :class:`bytes` objects are immutable, therefore concatenating many strings together is inefficient as each concatenation creates a new object. In the general case, the total runtime cost is quadratic in the total string length.
fr: Les objets :class:`str` et :class:`bytes` sont immuables, par conséquent concaténer un grand nombre de chaînes de caractères entre elles n'est pas très efficace car chaque concaténation crée un nouvel objet. Dans le cas général, la complexité est quadratique par rapport à la taille totale de la chaîne.

source: To accumulate many :class:`str` objects, the recommended idiom is to place them into a list and call :meth:`str.join` at the end::
fr: Pour mettre bout-à-bout un grand nombre d'objets :class:`str`, la technique recommandée consiste à toutes les mettre dans une liste et appeler la méthode :meth:`str.join` à la fin ::

source: (another reasonably efficient idiom is to use :class:`io.StringIO`)
fr: (une autre technique relativement efficace consiste à utiliser :class:`io.StringIO`)

source: To accumulate many :class:`bytes` objects, the recommended idiom is to extend a :class:`bytearray` object using in-place concatenation (the ``+=`` operator)::
fr: Pour concaténer un grand nombre d'objets :class:`bytes`, la technique recommandée consiste à étendre un objet :class:`bytearray` en utilisant la concaténation en-place (l'opérateur ``+=``) ::

source: Sequences (Tuples/Lists)
fr: Séquences (n-uplets / listes)

source: How do I convert between tuples and lists?
fr: Comment convertir les listes en n-uplets et inversement ?

source: The type constructor ``tuple(seq)`` converts any sequence (actually, any iterable) into a tuple with the same items in the same order.
fr: Le constructeur de type ``tuple(seq)`` convertit toute séquence (plus précisément, tout itérable) en un n-uplet avec les mêmes éléments dans le même ordre.

source: For example, ``tuple([1, 2, 3])`` yields ``(1, 2, 3)`` and ``tuple('abc')`` yields ``('a', 'b', 'c')``. If the argument is a tuple, it does not make a copy but returns the same object, so it is cheap to call :func:`tuple` when you aren't sure that an object is already a tuple.
fr: Par exemple ``tuple([1, 2, 3])`` renvoie ``(1, 2, 3)`` et ``tuple('abc')`` renvoie ``('a', 'b', 'c')``. Si l'argument est un n-uplet, cela ne crée pas de copie, mais renvoie le même objet, ce qui fait de :func:`tuple` une fonction économique à appeler quand vous ne savez pas si votre objet est déjà un n-uplet.

source: The type constructor ``list(seq)`` converts any sequence or iterable into a list with the same items in the same order. For example, ``list((1, 2, 3))`` yields ``[1, 2, 3]`` and ``list('abc')`` yields ``['a', 'b', 'c']``. If the argument is a list, it makes a copy just like ``seq[:]`` would.
fr: Le constructeur de type ``list(seq)`` convertit toute séquence ou itérable en liste contenant les mêmes éléments dans le même ordre. Par exemple, ``list((1,2,3))`` renvoie ``[1,2,3]`` et ``list('abc')`` renvoie ``['a','b','c']``. Si l'argument est une liste, il renvoie une copie, de la même façon que ``seq[:]``.

source: What's a negative index?
fr: Qu'est-ce qu'un index négatif ?

source: Python sequences are indexed with positive numbers and negative numbers. For positive numbers 0 is the first index 1 is the second index and so forth. For negative indices -1 is the last index and -2 is the penultimate (next to last) index and so forth. Think of ``seq[-n]`` as the same as ``seq[len(seq)-n]``.
fr: Les séquences Python sont indexées avec des nombres positifs aussi bien que négatifs. Pour les nombres positifs, 0 est le premier indice, 1 est le deuxième, et ainsi de suite. Pour les indices négatifs, ``-1`` est le dernier index, ``-2`` est le pénultième (avant-dernier), et ainsi de suite. On peut aussi dire que ``seq[-n]`` est équivalent à ``seq[len(seq)-n]``.

source: Using negative indices can be very convenient. For example ``S[:-1]`` is all of the string except for its last character, which is useful for removing the trailing newline from a string.
fr: Utiliser des indices négatifs peut être très pratique. Par exemple ``S[:-1]`` représente la chaîne tout entière à l'exception du dernier caractère, ce qui est pratique pour retirer un caractère de fin de ligne à la fin d'une chaîne.

source: How do I iterate over a sequence in reverse order?
fr: Comment itérer à rebours sur une séquence ?

source: Use the :func:`reversed` built-in function, which is new in Python 2.4::
fr: Utilisez la fonction native :func:`reversed`, qui a été introduite en Python 2.4 ::

source: This won't touch your original sequence, but build a new copy with reversed order to iterate over.
fr: Cela ne modifie pas la séquence initiale, mais construit à la place une copie en ordre inverse pour itérer dessus.

source: With Python 2.3, you can use an extended slice syntax::
fr: Avec Python 2.3 vous pouvez utiliser la syntaxe étendue de tranches ::

source: How do you remove duplicates from a list?
fr: Comment retirer les doublons d'une liste ?
