Repository: python/python-docs-fr
Catalog: faq/programming.po
Languages: fr

source: See the Python Cookbook for a long discussion of many ways to do this:
fr: Lisez le « livre de recettes » Python pour trouver une longue discussion sur les nombreuses approches possibles :

source: If you don't mind reordering the list, sort it and then scan from the end of the list, deleting duplicates as you go::
fr: Si changer l'ordre de la liste ne vous dérange pas, commencez par ordonner celle-ci, puis parcourez-la d'un bout à l'autre, en supprimant les doublons trouvés en chemin ::

source: If all elements of the list may be used as set keys (i.e. they are all :term:`hashable`) this is often faster ::
fr: Si tous les éléments de la liste peuvent être utilisés comme des clés de dictionnaire (c'est à dire, qu'elles sont toutes :term:`hachables <hashable>`) ceci est souvent plus rapide ::

source: This converts the list into a set, thereby removing duplicates, and then back into a list.
fr: Ceci convertit la liste en un ensemble, ce qui supprime automatiquement les doublons, puis la transforme à nouveau en liste.

source: How do you make an array in Python?
fr: Comment construire un tableau en Python ?

source: Use a list::
fr: Utilisez une liste ::

source: Lists are equivalent to C or Pascal arrays in their time complexity; the primary difference is that a Python list can contain objects of many different types.
fr: Les listes ont un coût équivalent à celui des tableaux C ou Pascal ; la principale différence est qu'une liste Python peut contenir des objets de différents types.

source: The ``array`` module also provides methods for creating arrays of fixed types with compact representations, but they are slower to index than lists. Also note that the Numeric extensions and others define array-like structures with various characteristics as well.
fr: Le module ``array`` fournit des méthodes pour créer des tableaux de types fixes dans une représentation compacte, mais ils sont plus lents à indexer que les listes. Notez aussi que l'extension ``Numeric`` (et d'autres) fournissent différentes structures de type tableaux, avec des caractéristiques différentes.

source: To get Lisp-style linked lists, you can emulate cons cells using tuples::
fr: Pour obtenir des listes chaînées à la sauce Lisp, vous pouvez émuler les *cons cells* en utilisant des n-uplets ::

source: If mutability is desired, you could use lists instead of tuples. Here the analogue of lisp car is ``lisp_list[0]`` and the analogue of cdr is ``lisp_list[1]``. Only do this if you're sure you really need to, because it's usually a lot slower than using Python lists.
fr: Si vous voulez pouvoir modifier les éléments, utilisez une liste plutôt qu'un tuple. Ici la version équivalente du *car* de Lisp est ``lisp_list[0]`` et l'équivalent de *cdr* est ``lisp_list[1]``. Ne faites ceci que si vous êtes réellement sûr d'en avoir besoin, cette méthode est en général bien plus lente que les listes Python.

source: How do I create a multidimensional list?
fr: Comment créer une liste à plusieurs dimensions ?

source: You probably tried to make a multidimensional array like this::
fr: Vous avez probablement essayé de créer une liste à plusieurs dimensions de cette façon ::

source: This looks correct if you print it:
fr: Elle semble correcte si on l'affiche :

source: But when you assign a value, it shows up in multiple places:
fr: Mais quand vous affectez une valeur, celle-ci apparaît à plusieurs endroits ::

source: The reason is that replicating a list with ``*`` doesn't create copies, it only creates references to the existing objects. The ``*3`` creates a list containing 3 references to the same list of length two. Changes to one row will show in all rows, which is almost certainly not what you want.
fr: Dupliquer une liste en utilisant ``*`` ne crée en réalité pas de copie mais seulement des références aux objets existants. Le ``*3`` crée une liste contenant trois références à la même liste de longueur deux. Un changement dans une colonne apparaîtra donc dans toutes les colonnes, ce qui n'est très probablement pas ce que vous souhaitiez.

source: The suggested approach is to create a list of the desired length first and then fill in each element with a newly created list::
fr: L'approche suggérée est d'abord de créer une liste de la longueur désirée, puis de remplir tous les éléments avec une nouvelle chaîne ::

source: This generates a list containing 3 different lists of length two. You can also use a list comprehension::
fr: Cela génère une liste contenant elle-même trois listes distinctes, de longueur deux. Vous pouvez aussi utiliser la syntaxe des listes en compréhension ::

source: Or, you can use an extension that provides a matrix datatype; `NumPy <http://www.numpy.org/>`_ is the best known.
fr: Vous pouvez aussi utiliser une extension qui fournit un type matriciel natif ; `NumPy <http://www.numpy.org/>`_ est la plus répandue.

source: How do I apply a method to a sequence of objects?
fr: Comment appliquer une méthode à une séquence d'objets ?

source: Use a list comprehension::
fr: Utilisez une liste en compréhension ::

source: Why does a_tuple[i] += ['item'] raise an exception when the addition works?
fr: Pourquoi ``a_tuple[i] += ['item']`` lève-t-il une exception alors que l'addition fonctionne ?

source: This is because of a combination of the fact that augmented assignment operators are *assignment* operators, and the difference between mutable and immutable objects in Python.
fr: Ceci est dû à la combinaison de deux facteurs : le fait que les opérateurs d'affectation incrémentaux sont des opérateurs d'*affectation* et à la différence entre les objets muables et immuables en Python.

source: This discussion applies in general when augmented assignment operators are applied to elements of a tuple that point to mutable objects, but we'll use a ``list`` and ``+=`` as our exemplar.
fr: Cette discussion est valable, en général, quand des opérateurs d'affectation incrémentale sont appliqués aux éléments d'un n-uplet qui pointe sur des objets muables, mais on prendra ``list`` et ``+=`` comme exemple.

source: If you wrote::
fr: Si vous écrivez ::

source: The reason for the exception should be immediately clear: ``1`` is added to the object ``a_tuple[0]`` points to (``1``), producing the result object, ``2``, but when we attempt to assign the result of the computation, ``2``, to element ``0`` of the tuple, we get an error because we can't change what an element of a tuple points to.
fr: La cause de l'exception est claire : ``1`` est ajouté à l'objet ``a_tuple[0]`` qui pointe sur (``1``), ce qui produit l'objet résultant ``2``, mais, lorsque l'on tente d'affecter le résultat du calcul, ``2``, à l'élément ``0`` du n-uplet, on obtient une erreur car il est impossible de modifier la cible sur laquelle pointe un élément d'un n-uplet.

source: Under the covers, what this augmented assignment statement is doing is approximately this::
fr: Sous le capot, une instruction d'affectation incrémentale fait à peu près ceci ::

source: It is the assignment part of the operation that produces the error, since a tuple is immutable.
fr: C'est la partie de l'affectation de l'opération qui génère l'erreur, vu qu'un n-uplet est immuable.

source: When you write something like::
fr: Quand vous écrivez un code du style ::

source: The exception is a bit more surprising, and even more surprising is the fact that even though there was an error, the append worked::
fr: L'exception est un peu plus surprenante et, chose encore plus étrange, malgré l'erreur, l'ajout a fonctionné ::

source: To see why this happens, you need to know that (a) if an object implements an ``__iadd__`` magic method, it gets called when the ``+=`` augmented assignment is executed, and its return value is what gets used in the assignment statement; and (b) for lists, ``__iadd__`` is equivalent to calling ``extend`` on the list and returning the list. That's why we say that for lists, ``+=`` is a "shorthand" for ``list.extend``::
fr: Pour comprendre ce qui se passe, il faut savoir que, premièrement, si un objet implémente la méthode magique c, celle-ci est appelée quand l'affectation incrémentale ``+=`` est exécutée et sa valeur de retour est utilisée dans l'instruction d'affectation ; et que, deuxièmement, pour les listes, ``__iadd__`` équivaut à appeler ``extend`` sur la liste et à renvoyer celle-ci. C'est pour cette raison que l'on dit que pour les listes, ``+=`` est un "raccourci" pour ``list.extend`` ::

source: This is equivalent to::
fr: C’est équivalent à ::

source: The object pointed to by a_list has been mutated, and the pointer to the mutated object is assigned back to ``a_list``. The end result of the assignment is a no-op, since it is a pointer to the same object that ``a_list`` was previously pointing to, but the assignment still happens.
fr: L'objet sur lequel pointe ``a_list`` a été modifié et le pointeur vers l'objet modifié est réaffecté à ``a_list``. *In fine*, l'affectation ne change rien, puisque c'est un pointeur vers le même objet que sur lequel pointait ``a_list``, mais l'affectation a tout de même lieu.

source: Thus, in our tuple example what is happening is equivalent to::
fr: Donc, dans notre exemple avec un n-uplet, il se passe quelque chose équivalent à ::

source: The ``__iadd__`` succeeds, and thus the list is extended, but even though ``result`` points to the same object that ``a_tuple[0]`` already points to, that final assignment still results in an error, because tuples are immutable.
fr: L'appel à ``__iadd__`` réussit et la liste est étendue, mais bien que ``result`` pointe sur le même objet que ``a_tuple[0]``, l'affectation finale échoue car les n-uplets ne sont pas muables.

source: I want to do a complicated sort: can you do a Schwartzian Transform in Python?
fr: Je souhaite faire un classement compliqué : peut on faire une transformation de Schwartz en Python ?

source: The technique, attributed to Randal Schwartz of the Perl community, sorts the elements of a list by a metric which maps each element to its "sort value". In Python, use the ``key`` argument for the :meth:`list.sort` method::
fr: Cette technique, attribuée à Randal Schwartz de la communauté Perl, ordonne les éléments d'une liste à l'aide une transformation qui fait correspondre chaque élément à sa "valeur de tri". En Python, ceci est géré par l'argument ``key`` de la méthode :meth:`list.sort` ::

source: How can I sort one list by values from another list?
fr: Comment ordonner une liste en fonction des valeurs d'une autre liste ?

source: Merge them into an iterator of tuples, sort the resulting list, and then pick out the element you want. ::
fr: Fusionnez-les dans un itérateur de n-uplets, ordonnez la liste obtenue, puis choisissez l'élément que vous voulez ::

source: An alternative for the last step is::
fr: Vous pouvez remplacer la dernière étape par ::

source: If you find this more legible, you might prefer to use this instead of the final list comprehension. However, it is almost twice as slow for long lists. Why? First, the ``append()`` operation has to reallocate memory, and while it uses some tricks to avoid doing that each time, it still has to do it occasionally, and that costs quite a bit. Second, the expression "result.append" requires an extra attribute lookup, and third, there's a speed reduction from having to make all those function calls.
fr: Si cela vous semble plus lisible, vous pouvez utiliser cette forme plutôt qu'une liste en compréhension. Toutefois, ce code est presque deux fois plus lent pour une liste de grande taille. Pourquoi ? Tout d'abord, parce que ``append()`` doit ré-allouer de la mémoire et, même si elle utilise quelques astuces pour éviter d'effectuer la ré-allocation à chaque appel, elle doit tout de même le faire de temps en temps, ce qui coûte assez cher. Deuxièmement, parce que l'expression ``result.append`` fait un accès supplémentaire à un attribut et, enfin, parce que tous ces appels de fonctions réduisent la vitesse d'exécution.

source: Objects
fr: Objets

source: What is a class?
fr: Qu'est-ce qu'une classe ?

source: A class is the particular object type created by executing a class statement. Class objects are used as templates to create instance objects, which embody both the data (attributes) and code (methods) specific to a datatype.
fr: Une classe est le type d'objet particulier créé par l'exécution d'une déclaration de classe. Les objets de classe sont utilisés comme modèles pour créer des objets, qui incarnent à la fois les données (attributs) et le code (méthodes) spécifiques à un type de données.

source: A class can be based on one or more other classes, called its base class(es). It then inherits the attributes and methods of its base classes. This allows an object model to be successively refined by inheritance. You might have a generic ``Mailbox`` class that provides basic accessor methods for a mailbox, and subclasses such as ``MboxMailbox``, ``MaildirMailbox``, ``OutlookMailbox`` that handle various specific mailbox formats.
fr: Une classe peut être fondée sur une ou plusieurs autres classes, appelée sa (ou ses) classe(s) de base. Elle hérite alors des attributs et des méthodes de ses classes de base. Cela permet à un modèle d'objet d'être successivement raffiné par héritage. Vous pourriez avoir une classe générique ``Mailbox``, qui fournit des méthodes d'accès de base pour une boîte aux lettres, et des sous-classes telles que ``MboxMailbox``, ``MaildirMailbox``, ``OutlookMailbox`` qui gèrent les plusieurs formats spécifiques de boîtes aux lettres.

source: What is a method?
fr: Qu'est-ce qu'une méthode ?

source: A method is a function on some object ``x`` that you normally call as ``x.name(arguments...)``. Methods are defined as functions inside the class definition::
fr: Une méthode est une fonction sur un objet ``x`` qu'on appelle de manière générale sous la forme ``x.name(arguments…)``. Les méthodes sont définies comme des fonctions à l'intérieur de la définition de classe ::

source: What is self?
fr: Qu'est-ce que self ?

source: Self is merely a conventional name for the first argument of a method. A method defined as ``meth(self, a, b, c)`` should be called as ``x.meth(a, b, c)`` for some instance ``x`` of the class in which the definition occurs; the called method will think it is called as ``meth(x, a, b, c)``.
fr: Par convention, le premier argument d'une méthode est appelé self. Une méthode ``meth(self, a, b, c)`` doit être appelée sous la forme ``x.meth(a, b, c)`` où ``x`` est une instance de la classe dans laquelle cette méthode est définie ; tout se passe comme si la méthode était appelée comme ``meth(x, a, b, c)``.

source: See also :ref:`why-self`.
fr: Voir aussi :ref:`why-self`.

source: How do I check if an object is an instance of a given class or of a subclass of it?
fr: Comment vérifier si un objet est une instance d'une classe donnée ou d'une sous-classe de celle-ci ?

source: Use the built-in function ``isinstance(obj, cls)``. You can check if an object is an instance of any of a number of classes by providing a tuple instead of a single class, e.g. ``isinstance(obj, (class1, class2, ...))``, and can also check whether an object is one of Python's built-in types, e.g. ``isinstance(obj, str)`` or ``isinstance(obj, (int, float, complex))``.
fr: Utilisez la fonction native ``isinstance(obj, cls)``. Vous pouvez vérifier qu'un objet est une instance de plusieurs classes à la fois en fournissant un n-uplet à la place d'une seule classe, par exemple, ``isinstance(obj, (class1, class2, ...))``. Vous pouvez également vérifier qu'un objet est l'un des types natifs de Python, par exemple ``isinstance(obj, str)`` ou ``isinstance(obj, (int, float, complex))``.

source: Note that most programs do not use :func:`isinstance` on user-defined classes very often. If you are developing the classes yourself, a more proper object-oriented style is to define methods on the classes that encapsulate a particular behaviour, instead of checking the object's class and doing a different thing based on what class it is. For example, if you have a function that does something::
fr: Notez que la plupart des programmes n'utilisent que rarement :func:`isInstance` sur les classes définies par l'utilisateur. Si vous développez vous-même des classes, une approche plus orientée-objet consiste définir des méthodes sur les classes qui sont porteuses d'un comportement particulier, plutôt que de vérifier la classe de l'objet et de faire un traitement ad-hoc. Par exemple, si vous avez une fonction qui fait quelque chose ::

source: A better approach is to define a ``search()`` method on all the classes and just call it::
fr: Une meilleure approche est de définir une méthode ``search()`` dans toutes les classes et qu'il suffit d'appeler de la manière suivante ::

source: What is delegation?
fr: Qu'est-ce que la délégation ?

source: Delegation is an object oriented technique (also called a design pattern). Let's say you have an object ``x`` and want to change the behaviour of just one of its methods. You can create a new class that provides a new implementation of the method you're interested in changing and delegates all other methods to the corresponding method of ``x``.
fr: La délégation est une technique orientée objet (aussi appelée « patron de conception). Prenons un objet ``x`` dont on souhaite modifier le comportement d'une seule de ses méthodes. On peut créer une nouvelle classe qui fournit une nouvelle implémentation de la méthode qui nous intéresse dans l'évolution et qui délègue toute autre méthode à la méthode correspondante de ``x``.

source: Python programmers can easily implement delegation. For example, the following class implements a class that behaves like a file but converts all written data to uppercase::
fr: Les programmeurs Python peuvent facilement mettre en œuvre la délégation. Par exemple, la classe suivante implémente une classe qui se comporte comme un fichier, mais convertit toutes les données écrites en majuscules ::

source: Here the ``UpperOut`` class redefines the ``write()`` method to convert the argument string to uppercase before calling the underlying ``self.__outfile.write()`` method. All other methods are delegated to the underlying ``self.__outfile`` object. The delegation is accomplished via the ``__getattr__`` method; consult :ref:`the language reference <attribute-access>` for more information about controlling attribute access.
fr: Ici, la classe ``UpperOut`` redéfinit la méthode ``write()`` pour convertir la chaîne d'argument en majuscules avant d'appeler la méthode sous-jacentes ``self.__outfile.write()``. Toutes les autres méthodes sont déléguées à l'objet sous-jacent ``self.__outfile``. La délégation se fait par la méthode ``__getattr__``, consulter :ref:`the language reference <attribute-access>` pour plus d'informations sur le contrôle d'accès d'attribut.

source: Note that for more general cases delegation can get trickier. When attributes must be set as well as retrieved, the class must define a :meth:`__setattr__` method too, and it must do so carefully. The basic implementation of :meth:`__setattr__` is roughly equivalent to the following::
fr: Notez que pour une utilisation plus générale de la délégation, les choses peuvent se compliquer. Lorsque les attributs doivent être définis aussi bien que récupérés, la classe doit définir une méthode :meth:`__setattr__` aussi, et il doit le faire avec soin. La mise en œuvre basique de la méthode :meth:`__setattr__` est à peu près équivalent à ce qui suit ::

source: Most :meth:`__setattr__` implementations must modify ``self.__dict__`` to store local state for self without causing an infinite recursion.
fr: La plupart des implémentations de :meth:`__setattr__` doivent modifier ``self.__dict__`` pour stocker l'état local de self sans provoquer une récursion infinie.

source: How do I call a method defined in a base class from a derived class that overrides it?
fr: Comment appeler une méthode définie dans une classe de base depuis une classe dérivée qui la surcharge ?

source: Use the built-in :func:`super` function::
fr: Utilisez la fonction native :func:`super` ::

source: For version prior to 3.0, you may be using classic classes: For a class definition such as ``class Derived(Base): ...`` you can call method ``meth()`` defined in ``Base`` (or one of ``Base``'s base classes) as ``Base.meth(self, arguments...)``. Here, ``Base.meth`` is an unbound method, so you need to provide the ``self`` argument.
fr: Pour les versions antérieures à 3.0, vous pouvez utiliser des classes classiques : pour une définition de classe comme ``class Derived(Base): ...`` vous pouvez appeler la méthode ``meth()`` définie dans ``Base`` (ou l'une des classes de base de ``Base``) en faisant ``Base.meth(self, arguments...)``. Ici, ``Base.meth`` est une méthode non liée, il faut donc fournir l'argument ``self``.

source: How can I organize my code to make it easier to change the base class?
fr: Comment organiser un code pour permettre de changer la classe de base plus facilement ?

source: You could define an alias for the base class, assign the real base class to it before your class definition, and use the alias throughout your class. Then all you have to change is the value assigned to the alias. Incidentally, this trick is also handy if you want to decide dynamically (e.g. depending on availability of resources) which base class to use. Example::
fr: Vous pouvez définir un alias pour la classe de base, lui attribuer la classe de base réelle avant la définition de classe, et utiliser l'alias au long de votre classe. Ensuite, tout ce que vous devez changer est la valeur attribuée à l'alias. Accessoirement, cette astuce est également utile si vous voulez déterminer dynamiquement (par exemple en fonction de la disponibilité des ressources) la classe de base à utiliser. Exemple ::

source: How do I create static class data and static class methods?
fr: Comment créer des données statiques de classe et des méthodes statiques de classe ?

source: Both static data and static methods (in the sense of C++ or Java) are supported in Python.
fr: Les données statiques et les méthodes statiques (au sens C++ ou Java) sont prises en charge en Python.

source: For static data, simply define a class attribute. To assign a new value to the attribute, you have to explicitly use the class name in the assignment::
fr: Pour les données statiques, il suffit de définir un attribut de classe. Pour attribuer une nouvelle valeur à l'attribut, vous devez explicitement utiliser le nom de classe dans l'affectation ::

source: ``c.count`` also refers to ``C.count`` for any ``c`` such that ``isinstance(c, C)`` holds, unless overridden by ``c`` itself or by some class on the base-class search path from ``c.__class__`` back to ``C``.
fr: ``c.count`` se réfère également à ``C.count`` pour tout ``c`` tel que ``isInstance (c, C)`` est vrai, sauf remplacement par ``c`` lui-même ou par une classe sur le chemin de recherche de classe de base de ``c.__class__`` jusqu'à ``C``.

source: Caution: within a method of C, an assignment like ``self.count = 42`` creates a new and unrelated instance named "count" in ``self``'s own dict. Rebinding of a class-static data name must always specify the class whether inside a method or not::
fr: Attention : dans une méthode de C, une affectation comme ``self.count = 42`` crée une nouvelle instance sans rapport avec le nom ``count`` dans le dictionnaire de données de ``self``. La redéfinition d'une donnée statique de classe doit toujours spécifier la classe, que l'on soit à l'intérieur d'une méthode ou non ::

source: Static methods are possible::
fr: Il est possible d'utiliser des méthodes statiques ::
