Repository: python/python-docs-fr
Catalog: whatsnew/3.9.po
Languages: fr

source: The :c:func:`PyModule_AddType` function is added to help adding a type to a module. (Contributed by Dong-hee Na in :issue:`40024`.)
fr: La fonction :c:func:`PyModule_AddType` est ajoutée pour faciliter l'ajout d'un type à un module (contribution de *Dong-hee Na* dans :issue:`40024`).

source: Added the functions :c:func:`PyObject_GC_IsTracked` and :c:func:`PyObject_GC_IsFinalized` to the public API to allow to query if Python objects are being currently tracked or have been already finalized by the garbage collector respectively. (Contributed by Pablo Galindo Salgado in :issue:`40241`.)
fr: Ajout des fonctions :c:func:`PyObject_GC_IsTracked` et :c:func:`PyObject_GC_IsFinalized` à l'API publique qui déterminent respectivement si les objets Python sont présentement suivis ou ont été finalisés par le ramasse-miettes (contribution de *Pablo Galindo Salgado* dans :issue:`40241`).

source: Added :c:func:`_PyObject_FunctionStr` to get a user-friendly string representation of a function-like object. (Patch by Jeroen Demeyer in :issue:`37645`.)
fr: Ajout de :c:func:`_PyObject_FunctionStr` pour récupérer une chaîne conviviale représentant un objet fonction-compatible. (Rustine par *Jeroen Demeyer* dans :issue:`37645`.)

source: Added :c:func:`PyObject_CallOneArg` for calling an object with one positional argument (Patch by Jeroen Demeyer in :issue:`37483`.)
fr: Ajout de :c:func:`PyObject_CallOneArg` pour appeler un objet avec un argument positionnel. (Rustine par *Jeroen Demeyer* dans :issue:`37483`.)

source: ``PyInterpreterState.eval_frame`` (:pep:`523`) now requires a new mandatory *tstate* parameter (``PyThreadState*``). (Contributed by Victor Stinner in :issue:`38500`.)
fr: ``PyInterpreterState.eval_frame`` (:pep:`523`) nécessite maintenant un nouveau paramètre obligatoire *tstate* (``PyThreadState*``) (contribution de *Victor Stinner* dans :issue:`38500`).

source: Extension modules: :c:member:`~PyModuleDef.m_traverse`, :c:member:`~PyModuleDef.m_clear` and :c:member:`~PyModuleDef.m_free` functions of :c:type:`PyModuleDef` are no longer called if the module state was requested but is not allocated yet. This is the case immediately after the module is created and before the module is executed (:c:data:`Py_mod_exec` function). More precisely, these functions are not called if :c:member:`~PyModuleDef.m_size` is greater than 0 and the module state (as returned by :c:func:`PyModule_GetState`) is ``NULL``.
fr: Modules d'extension : les fonctions :c:member:`~PyModuleDef.m_traverse`, :c:member:`~PyModuleDef.m_clear` et :c:member:`~PyModuleDef.m_free` de :c:type:`PyModuleDef` ne sont plus appelées si l'état du module est demandé mais qu'il n'a pas encore été alloué. C'est le cas immédiatement après que le module a été créé et avant que le module soit exécuté (fonction :c:data:`Py_mod_exec`). Plus précisément, ces fonctions ne sont pas appelées si :c:member:`~PyModuleDef.m_size` est plus grand que 0 et que l'état du module (tel que renvoyé par :c:func:`PyModule_GetState`) est ``NULL``.

source: Extension modules without module state (``m_size <= 0``) are not affected.
fr: Les modules d'extensions sans état de module (``m_size <= 0``) ne sont pas affectés.

source: If :c:func:`Py_AddPendingCall` is called in a subinterpreter, the function is now scheduled to be called from the subinterpreter, rather than being called from the main interpreter. Each subinterpreter now has its own list of scheduled calls. (Contributed by Victor Stinner in :issue:`39984`.)
fr: Si :c:func:`Py_AddPendingCall` est appelée dans un sous-interpréteur, la fonction est planifiée pour appel dans le sous-interpréteur, plutôt que dans l'interpréteur principal. Chaque sous interpréteur a maintenant sa propre liste d'appels planifiés (contribution de *Victor Stinner* dans :issue:`39984`).

source: The Windows registry is no longer used to initialize :data:`sys.path` when the ``-E`` option is used (if :c:member:`PyConfig.use_environment` is set to ``0``). This is significant when embedding Python on Windows. (Contributed by Zackery Spytz in :issue:`8901`.)
fr: Le registre de Windows n'est plus utilisé pour initialiser :data:`sys.path` quand l'option ``-E`` est utilisée (si :c:member:`PyConfig.use_environment` est affecté à ``0``). Ceci est pertinent quand Python est embarqué sur Windows (contribution de *Zackery Spytz* dans :issue:`8901`).

source: The global variable :c:data:`PyStructSequence_UnnamedField` is now a constant and refers to a constant string. (Contributed by Serhiy Storchaka in :issue:`38650`.)
fr: La variable globale :c:data:`PyStructSequence_UnnamedField` est maintenant une constante et fait référence à une chaîne constante (contribution de *Serhiy Storchaka* dans :issue:`38650`).

source: The :c:type:`PyGC_Head` structure is now opaque. It is only defined in the internal C API (``pycore_gc.h``). (Contributed by Victor Stinner in :issue:`40241`.)
fr: La structure :c:type:`PyGC_Head` est maintenant opaque. Elle est définie uniquement dans l'API C interne (``pycore_gc.h``) (contribution de *Victor Stinner* dans :issue:`40241`).

source: The ``Py_UNICODE_COPY``, ``Py_UNICODE_FILL``, ``PyUnicode_WSTR_LENGTH``, :c:func:`PyUnicode_FromUnicode`, :c:func:`PyUnicode_AsUnicode`, ``_PyUnicode_AsUnicode``, and :c:func:`PyUnicode_AsUnicodeAndSize` are marked as deprecated in C. They have been deprecated by :pep:`393` since Python 3.3. (Contributed by Inada Naoki in :issue:`36346`.)
fr: ``Py_UNICODE_COPY``, ``Py_UNICODE_FILL``, ``PyUnicode_WSTR_LENGTH``, :c:func:`PyUnicode_FromUnicode`, :c:func:`PyUnicode_AsUnicode`, ``_PyUnicode_AsUnicode``, et :c:func:`PyUnicode_AsUnicodeAndSize` sont étiquetées comme obsolètes en C. Elles avaient été déclarées obsolètes par :pep:`393` depuis Python 3.3 (contribution de *Inada Naoki* dans :issue:`36346`).

source: The :c:func:`Py_FatalError` function is replaced with a macro which logs automatically the name of the current function, unless the ``Py_LIMITED_API`` macro is defined. (Contributed by Victor Stinner in :issue:`39882`.)
fr: La fonction :c:func:`Py_FatalError` est remplacée par une macro qui ajoute automatiquement une entrée au journal avec le nom de la fonction courante, sauf si la macro ``Py_LIMITED_API`` est définie (contribution de *Victor Stinner* dans :issue:`39882`).

source: The vectorcall protocol now requires that the caller passes only strings as keyword names. (See :issue:`37540` for more information.)
fr: Le protocole *vectorcall* requiert maintenant que l'appelant ne passe que des chaînes pour les noms des arguments nommés. (Voir :issue:`37540` pour plus d'informations.)

source: Implementation details of a number of macros and functions are now hidden:
fr: Les détails d'implémentation de certaines macros et fonctions sont maintenant cachés :

source: :c:func:`PyObject_IS_GC` macro was converted to a function.
fr: la macro :c:func:`PyObject_IS_GC` a été convertie en fonction ;

source: The :c:func:`PyObject_NEW` macro becomes an alias to the :c:func:`PyObject_New` macro, and the :c:func:`PyObject_NEW_VAR` macro becomes an alias to the :c:func:`PyObject_NewVar` macro. They no longer access directly the :c:member:`PyTypeObject.tp_basicsize` member.
fr: La macro :c:func:`PyObject_NEW` devient un alias pour la macro :c:func:`PyObject_New`, et la macro :c:func:`PyObject_NEW_VAR` devient un alias pour la macro :c:func:`PyObject_NewVar`. Elles n'ont plus accès directement au membre :c:member:`PyTypeObject.tp_basicsize` ;

source: :c:func:`PyObject_GET_WEAKREFS_LISTPTR` macro was converted to a function: the macro accessed directly the :c:member:`PyTypeObject.tp_weaklistoffset` member.
fr: La macro :c:func:`PyObject_GET_WEAKREFS_LISTPTR` a été convertie en fonction : la macro accédait directement au membre :c:member:`PyTypeObject.tp_weaklistoffset` ;

source: :c:func:`PyObject_CheckBuffer` macro was converted to a function: the macro accessed directly the :c:member:`PyTypeObject.tp_as_buffer` member.
fr: La macro :c:func:`PyObject_CheckBuffer` a été convertie en fonction : la macro accédait directement au membre :c:member:`PyTypeObject.tp_as_buffer` ;

source: :c:func:`PyIndex_Check` is now always declared as an opaque function to hide implementation details: removed the ``PyIndex_Check()`` macro. The macro accessed directly the :c:member:`PyTypeObject.tp_as_number` member.
fr: :c:func:`PyIndex_Check` est maintenant toujours déclarée comme une fonction opaque pour cacher ses détails d'implémentation : retrait de la macro ``PyIndex_Check()``. La macro accédait directement au membre :c:member:`PyTypeObject.tp_as_number`.

source: (See :issue:`40170` for more details.)
fr: (Voir :issue:`40170` pour plus de détails.)

source: Excluded ``PyFPE_START_PROTECT()`` and ``PyFPE_END_PROTECT()`` macros of ``pyfpe.h`` from the limited C API. (Contributed by Victor Stinner in :issue:`38835`.)
fr: Exclusion des macros ``PyFPE_START_PROTECT()`` et ``PyFPE_END_PROTECT()`` de l'API C limité (contribution de *Victor Stinner* dans :issue:`38835`).

source: The ``tp_print`` slot of :ref:`PyTypeObject <type-structs>` has been removed. It was used for printing objects to files in Python 2.7 and before. Since Python 3.0, it has been ignored and unused. (Contributed by Jeroen Demeyer in :issue:`36974`.)
fr: Le champ ``tp_print`` de :ref:`PyTypeObject <type-structs>` a été retiré. Il était utilisé pour écrire des objets dans des fichiers dans Python 2.7 et dans les versions précédentes. Depuis Python 3.0, il était ignoré et inutilisé (contribution de *Jeroen Demeyer* dans :issue:`36974`).

source: Excluded the following functions from the limited C API:
fr: Exclusion des fonctions suivantes de l'API C limité :

source: ``PyThreadState_DeleteCurrent()`` (Contributed by Joannah Nanjekye in :issue:`37878`.)
fr: ``PyThreadState_DeleteCurrent()`` (contribution de *Joannah Nanjekye* dans :issue:`37878`) ;

source: The trashcan mechanism which never worked in the limited C API.
fr: Le mécanisme *trashcan* qui n'a jamais fonctionné dans l'API C limité ;

source: Moved following functions and definitions to the internal C API:
fr: Migration des fonctions et définitions suivantes vers l'API C interne :

source: ``_Py_AddToAllObjects()`` (specific to ``Py_TRACE_REFS`` build)
fr: ``_Py_AddToAllObjects()`` (spécifique aux compilations ``Py_TRACE_REFS``).

source: Removed ``_PyRuntime.getframe`` hook and removed ``_PyThreadState_GetFrame`` macro which was an alias to ``_PyRuntime.getframe``. They were only exposed by the internal C API. Removed also ``PyThreadFrameGetter`` type. (Contributed by Victor Stinner in :issue:`39946`.)
fr: Retrait de la fonction de rappel ``_PyRuntime.getframe`` et de la macro ``_PyThreadState_GetFrame`` qui était un alias pour ``_PyRuntime.getframe``. Elles étaient exposées uniquement dans l'API C interne. Retrait aussi du type ``PyThreadFrameGetter`` (contribution de *Victor Stinner* dans :issue:`39946`).

source: Removed the following functions from the C API. Call :c:func:`PyGC_Collect` explicitly to clear all free lists. (Contributed by Inada Naoki and Victor Stinner in :issue:`37340`, :issue:`38896` and :issue:`40428`.)
fr: Retrait des fonctions suivantes de l'API C. Appelez :c:func:`PyGC_Collect` explicitement pour vider toutes les *free lists* (contribution de *Inada Naoki* et *Victor Stinner* dans :issue:`37340`, :issue:`38896` et :issue:`40428`) :

source: ``PyMethod_ClearFreeList()`` and ``PyCFunction_ClearFreeList()``: the free lists of bound method objects have been removed.
fr: ``PyMethod_ClearFreeList()`` et ``PyCFunction_ClearFreeList()`` : les *free lists* des objets méthode liées ont été retirées ;

source: ``PySet_ClearFreeList()``: the set free list has been removed in Python 3.4.
fr: ``PySet_ClearFreeList()`` : la *free list* des objets *sets* a été retirée dans Python 3.4 ;

source: ``PyUnicode_ClearFreeList()``: the Unicode free list has been removed in Python 3.3.
fr: ``PyUnicode_ClearFreeList()`` : la *free list* des objets Unicode a été retirée dans Python 3.3.

source: Removed ``_PyUnicode_ClearStaticStrings()`` function. (Contributed by Victor Stinner in :issue:`39465`.)
fr: Retrait de la fonction ``_PyUnicode_ClearStaticStrings()`` (contribution de *Victor Stinner* dans :issue:`39465`).

source: Removed ``Py_UNICODE_MATCH``. It has been deprecated by :pep:`393`, and broken since Python 3.3. The :c:func:`PyUnicode_Tailmatch` function can be used instead. (Contributed by Inada Naoki in :issue:`36346`.)
fr: Retrait de ``Py_UNICODE_MATCH``. Elle était devenue obsolète par :pep:`393`, non-fonctionnelle depuis Python 3.3. La fonction :c:func:`PyUnicode_Tailmatch` peut être utilisée à sa place (contribution de *Inada Naoki* dans :issue:`36346`).

source: Cleaned header files of interfaces defined but with no implementation. The public API symbols being removed are: ``_PyBytes_InsertThousandsGroupingLocale``, ``_PyBytes_InsertThousandsGrouping``, ``_Py_InitializeFromArgs``, ``_Py_InitializeFromWideArgs``, ``_PyFloat_Repr``, ``_PyFloat_Digits``, ``_PyFloat_DigitsInit``, ``PyFrame_ExtendStack``, ``_PyAIterWrapper_Type``, ``PyNullImporter_Type``, ``PyCmpWrapper_Type``, ``PySortWrapper_Type``, ``PyNoArgsFunction``. (Contributed by Pablo Galindo Salgado in :issue:`39372`.)
fr: Nettoyage dans les fichiers d'en-têtes d'interfaces déclarées pour lesquelles il n'y avait pas d'implémentation. Les symboles retirés de l'API publique sont : ``_PyBytes_InsertThousandsGroupingLocale``, ``_PyBytes_InsertThousandsGrouping``, ``_Py_InitializeFromArgs``, ``_Py_InitializeFromWideArgs``, ``_PyFloat_Repr``, ``_PyFloat_Digits``, ``_PyFloat_DigitsInit``, ``PyFrame_ExtendStack``, ``_PyAIterWrapper_Type``, ``PyNullImporter_Type``, ``PyCmpWrapper_Type``, ``PySortWrapper_Type``, ``PyNoArgsFunction`` (contribution de *Pablo Galindo Salgado* dans :issue:`39372`).

source: Notable changes in Python 3.9.1
fr: Changements importants dans Python 3.9.1

source: The behavior of :class:`typing.Literal` was changed to conform with :pep:`586` and to match the behavior of static type checkers specified in the PEP.
fr: Le comportement de :class:`typing.Literal` a été changé pour être conforme avec :pep:`586` et pour avoir le comportement des vérificateurs de types statique spécifiés dans le PEP :

source: ``Literal`` now de-duplicates parameters.
fr: ``Literal`` de-duplique maintenant les paramètres ;

source: Equality comparisons between ``Literal`` objects are now order independent.
fr: Les comparaisons d'égalité entre les objets ``Literal`` sont maintenant indépendantes de l'ordre ;

source: ``Literal`` comparisons now respect types. For example, ``Literal[0] == Literal[False]`` previously evaluated to ``True``. It is now ``False``. To support this change, the internally used type cache now supports differentiating types.
fr: Les comparaisons des ``Literal`` respectent maintenant les types. Par exemple, ``Literal[0] == Literal[False]`` évaluait précédemment à ``True``. C'est maintenant ``False``. Pour gérer ce changement, le cache interne des types utilisés peut maintenant différentier les types ;

source: ``Literal`` objects will now raise a :exc:`TypeError` exception during equality comparisons if any of their parameters are not :term:`hashable`. Note that declaring ``Literal`` with mutable parameters will not throw an error::
fr: Les objets ``Literal`` lèvent maintenant une exception :exc:`TypeError` lors des comparaisons d'égalités si n'importe quel de leurs paramètres n'est pas :term:`immuable <immutable>`. Prenez-note que déclarer un ``Literal`` avec un paramètre muable ne lève pas une erreur ::

source: (Contributed by Yurii Karabas in :issue:`42345`.)
fr: (Contribution de *Yurii Karabas* dans :issue:`42345`.)

source: macOS 11.0 (Big Sur) and Apple Silicon Mac support
fr: Prise en charge de *macOS* 11.0 (Big Sur) et de Mac sur processeur Apple

source: As of 3.9.1, Python now fully supports building and running on macOS 11.0 (Big Sur) and on Apple Silicon Macs (based on the ``ARM64`` architecture). A new universal build variant, ``universal2``, is now available to natively support both ``ARM64`` and ``Intel 64`` in one set of executables. Binaries can also now be built on current versions of macOS to be deployed on a range of older macOS versions (tested to 10.9) while making some newer OS functions and options conditionally available based on the operating system version in use at runtime ("weaklinking").
fr: Depuis la version 3.9.1, Python est maintenant totalement compatible (compilation et lancement) sur macOS 11.0 (*Big Sur*) et sur les Macs Apple Silicon (basés sur l'architecture ``ARM64``). Un nouveau variant de *build*, ``universal2``, est maintenant disponible et supporte nativement les plateformes ``ARM64`` et ``Intel 64`` en un seul jeu d'exécutables. Les binaires peuvent aussi être compilés sur les versions actuelles de macOS pour ensuite être déployés sur des versions antérieures (testé jusqu'à 10.9), tout en rendant de nouvelles fonctionnalités du système d'exploitation disponibles en fonction de la version du système utilisée à l'exécution ("*weaklinking*").

source: (Contributed by Ronald Oussoren and Lawrence D'Anna in :issue:`41100`.)
fr: (contribution de *Ronald Oussoren* et *Lawrence D'Anna* dans :issue:`41100`).

source: Notable changes in Python 3.9.2
fr: Changements importants dans Python 3.9.2

source: Earlier Python versions allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`cgi.parse` and :func:`cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
fr: Les versions précédentes de Python acceptaient à la fois ``;`` et ``&`` comme séparateurs des paramètres de requête dans :func:`urllib.parse.parse_qs` et :func:`urllib.parse.parse_qsl`. Pour des raisons de sécurité, et pour être conforme aux nouvelles recommandations du W3C, ceci a été changé pour ne permettre qu'une seule clé de séparation, avec ``&`` par défaut. Ce changement affecte aussi :func:`cgi.parse` et :func:`cgi.parse_multipart` puisqu'elles utilisent les fonctions affectées à l'interne. Pour plus de détails, voir leur documentation respective (contribution de *Adam Goldschmidt*, *Senthil Kumaran* et *Ken Jin* dans :issue:`42967`).
