Repository: python/python-docs-fr
Catalog: whatsnew/3.9.po
Languages: fr

source: Added :class:`asyncio.PidfdChildWatcher`, a Linux-specific child watcher implementation that polls process file descriptors. (:issue:`38692`)
fr: Ajout de :class:`asyncio.PidfdChildWatcher`, un surveillant de processus enfants spécifique à Linux qui interroge le descripteur de ficher du processus. (:issue:`38692`)

source: :mod:`asyncio` now raises :exc:`TyperError` when calling incompatible methods with an :class:`ssl.SSLSocket` socket. (Contributed by Ido Michael in :issue:`37404`.)
fr: :mod:`asyncio` lève maintenant une :exc:`TyperError` lors d'un appel à des méthodes incompatibles avec un socket :class:`ssl.SSLSocket`. (Contribué par Ido Michael dans :issue:`37404`.)

source: Added new possibility to use hardlinks for duplicated ``.pyc`` files: *hardlink_dupes* parameter and --hardlink-dupes command line option. (Contributed by Lumír 'Frenzy' Balhar in :issue:`40495`.)
fr: Ajout de la possibilité d'utiliser des liens physiques pour les fichiers ``.pyc`` dupliqués : paramètre *hardlink_dupes* et option de ligne de commande ``--hardlink-dupes`` (contribution de *Lumír 'Frenzy' Balhar* dans :issue:`40495`).

source: Added new options for path manipulation in resulting ``.pyc`` files: *stripdir*, *prependdir*, *limit_sl_dest* parameters and -s, -p, -e command line options. Added the possibility to specify the option for an optimization level multiple times. (Contributed by Lumír 'Frenzy' Balhar in :issue:`38112`.)
fr: Ajout d'options pour manipuler les chemins des fichiers ``.pyc`` résultants : paramètres *stripdir*, *prependdir*, *limit_sl_dest* et options de la ligne de commande ``-s``, ``-p``, ``-e``. Ajout de la possibilité de spécifier l'option pour un niveau d'optimisation plus d'une fois (contribution de *Lumír 'Frenzy' Balhar* dans :issue:`38112`).

source: Added a new *cancel_futures* parameter to :meth:`concurrent.futures.Executor.shutdown` that cancels all pending futures which have not started running, instead of waiting for them to complete before shutting down the executor. (Contributed by Kyle Stanley in :issue:`39349`.)
fr: Ajout du nouveau paramètre *cancel_futures* à :meth:`concurrent.futures.Executor.shutdown` qui annule tous les futurs en attente qui n'ont pas commencé leur exécution, plutôt que d'attendre qu'ils aient complété avant d'arrêter l'exécuteur (contribution *Kyle Stanley* dans :issue:`39349`).

source: Added :func:`curses.get_escdelay`, :func:`curses.set_escdelay`, :func:`curses.get_tabsize`, and :func:`curses.set_tabsize` functions. (Contributed by Anthony Sottile in :issue:`38312`.)
fr: Ajout des fonctions :func:`curses.get_escdelay`, :func:`curses.set_escdelay`, :func:`curses.get_tabsize`, et :func:`curses.set_tabsize` (contribution d'*Anthony Sottile* dans :issue:`38312`).

source: The :meth:`~datetime.date.isocalendar()` of :class:`datetime.date` and :meth:`~datetime.datetime.isocalendar()` of :class:`datetime.datetime` methods now returns a :func:`~collections.namedtuple` instead of a :class:`tuple`. (Contributed by Dong-hee Na in :issue:`24416`.)
fr: La méthode :meth:`~datetime.date.isocalendar()` de :class:`datetime.date` et la méthode :meth:`~datetime.datetime.isocalendar()` de :class:`datetime.datetime` renvoient maintenant un :func:`~collections.namedtuple` plutôt qu'un :class:`tuple` (contribution de *Dong-hee Na* dans :issue:`24416`).

source: The :command:`upload` command now creates SHA2-256 and Blake2b-256 hash digests. It skips MD5 on platforms that block MD5 digest. (Contributed by Christian Heimes in :issue:`40698`.)
fr: La commande :command:`upload` crée maintenant des condensats SHA2-256 et Blake2b-256. Elle ne produit pas MD5 sur les plateformes qui bloquent les condensats MD5 (contribution de *Christian Heimes* dans :issue:`40698`).

source: Added constants :data:`~fcntl.F_OFD_GETLK`, :data:`~fcntl.F_OFD_SETLK` and :data:`~fcntl.F_OFD_SETLKW`. (Contributed by Dong-hee Na in :issue:`38602`.)
fr: Ajout des constantes :data:`~fcntl.F_OFD_GETLK`, :data:`~fcntl.F_OFD_SETLK` et :data:`~fcntl.F_OFD_SETLKW` (contribution de *Dong-hee Na* dans :issue:`38602`).

source: :class:`~ftplib.FTP` and :class:`~ftplib.FTP_TLS` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Dong-hee Na in :issue:`39259`.)
fr: Afin d'empêcher la création de *socket* non-bloquant, les classes :class:`~ftplib.FTP` et :class:`~ftplib.FTP_TLS` lèvent maintenant :class:`ValueError` quand zéro est passé à *timeout* dans leur constructeur (contribution de *Dong-hee Na* dans :issue:`39259`).

source: When the garbage collector makes a collection in which some objects resurrect (they are reachable from outside the isolated cycles after the finalizers have been executed), do not block the collection of all objects that are still unreachable. (Contributed by Pablo Galindo and Tim Peters in :issue:`38379`.)
fr: Quand le ramasse-miettes fait un ramassage pour lequel certains objets sont ressuscités (ils sont atteignables à partir de l'extérieur des cycles isolés après que les *finaliseurs* soient exécutés), le ramassage des objets qui sont toujours inatteignables n'est pas suspendu (contribution de *Pablo Galindo* et *Tim Peters* dans :issue:`38379`).

source: Added a new function :func:`gc.is_finalized` to check if an object has been finalized by the garbage collector. (Contributed by Pablo Galindo in :issue:`39322`.)
fr: Ajout de la fonction :func:`gc.is_finalized` pour vérifier si un objet a été finalisé par le ramasse-miettes (contribution de *Pablo Galindo* dans :issue:`39322`).

source: The :mod:`hashlib` module can now use SHA3 hashes and SHAKE XOF from OpenSSL when available. (Contributed by Christian Heimes in :issue:`37630`.)
fr: Le module :mod:`hashlib` peut maintenant utiliser les algorithmes de hachage SHA3 et SHAKE XOF de *OpenSSL* quand ils sont disponibles (contribution de *Christian Heimes* dans :issue:`37630`).

source: Builtin hash modules can now be disabled with ``./configure --without-builtin-hashlib-hashes`` or selectively enabled with e.g. ``./configure --with-builtin-hashlib-hashes=sha3,blake2`` to force use of OpenSSL based implementation. (Contributed by Christian Heimes in :issue:`40479`)
fr: Les modules de hachage natifs peuvent être désactivés avec ``./configure --without-builtin-hashlib-hashes`` ou activés sélectivement avec par exemple ``./configure --with-builtin-hashlib-hashes=sha3,blake2`` pour forcer l'utilisation de l’implémentation *OpenSSL* (contribution de *Christian Heimes* dans :issue:`40479`).

source: HTTP status codes ``103 EARLY_HINTS``, ``418 IM_A_TEAPOT`` and ``425 TOO_EARLY`` are added to :class:`http.HTTPStatus`. (Contributed by Dong-hee Na in :issue:`39509` and Ross Rhodes in :issue:`39507`.)
fr: Les codes d'état HTTP ``103 EARLY_HINTS``, ``418 IM_A_TEAPOT`` et ``425 TOO_EARLY`` ont été ajoutés à :class:`http.HTTPStatus` (contribution de *Dong-hee Na* dans :issue:`39509` et Ross Rhodes dans :issue:`39507`).

source: IDLE and idlelib
fr: *IDLE* et *idlelib*

source: Added option to toggle cursor blink off. (Contributed by Zackery Spytz in :issue:`4603`.)
fr: Ajout d'une option pour désactiver le clignotement du curseur (contribution de *Zackery Spytz* dans :issue:`4603`).

source: Escape key now closes IDLE completion windows. (Contributed by Johnny Najera in :issue:`38944`.)
fr: La fenêtre de complétion de IDLE est maintenant fermée par la touche d'échappement (contribution de *Johnny Najera* dans :issue:`38944`).

source: Added keywords to module name completion list. (Contributed by Terry J. Reedy in :issue:`37765`.)
fr: Ajout de mots clés à la liste de complétion de noms de modules (contribution de *Terry J. Reedy* dans :issue:`37765`).

source: Make IDLE invoke :func:`sys.excepthook` (when started without '-n'). User hooks were previously ignored. (Contributed by Ken Hilton in :issue:`43008`.)
fr: IDLE invoque maintenant :func:`sys.excepthook` (lorsque lancé sans ``'-n'``). Auparavant, les fonctions de rappel définies par l'utilisateur étaient ignorées (contribution par *Ken Hilton* dans :issue:`43008`).

source: The changes above have been backported to 3.8 maintenance releases.
fr: Les changements ci-haut ont été rétro-portés dans la version de maintenance de 3.8.

source: Apply syntax highlighting to ``.pyi`` files. (Contributed by Alex Waygood and Terry Jan Reedy in :issue:`45447`.)
fr: Applique la coloration syntaxique aux fichiers ``.pyi`` (contribution d'*Alex Waygood* et de *Terry Jan Reedy* dans :issue:`45447`).

source: :class:`~imaplib.IMAP4` and :class:`~imaplib.IMAP4_SSL` now have an optional *timeout* parameter for their constructors. Also, the :meth:`~imaplib.IMAP4.open` method now has an optional *timeout* parameter with this change. The overridden methods of :class:`~imaplib.IMAP4_SSL` and :class:`~imaplib.IMAP4_stream` were applied to this change. (Contributed by Dong-hee Na in :issue:`38615`.)
fr: :class:`~imaplib.IMAP4` et :class:`~imaplib.IMAP4_SSL` ont maintenant un paramètre optionnel *timeout* dans leur constructeur. De plus, la méthode :meth:`~imaplib.IMAP4.open` a maintenant un paramètre optionnel *timeout* avec ce changement. Les méthodes surchargées de :class:`~imaplib.IMAP4_SSL` et :class:`~imaplib.IMAP4_stream` appliquent ce changement (contribution de *Dong-hee Na* dans :issue:`38615`).

source: :meth:`imaplib.IMAP4.unselect` is added. :meth:`imaplib.IMAP4.unselect` frees server's resources associated with the selected mailbox and returns the server to the authenticated state. This command performs the same actions as :meth:`imaplib.IMAP4.close`, except that no messages are permanently removed from the currently selected mailbox. (Contributed by Dong-hee Na in :issue:`40375`.)
fr: Ajout de :meth:`imaplib.IMAP4.unselect`. :meth:`imaplib.IMAP4.unselect` libère les ressources du serveur associées à la boîte de courriel sélectionnée et remet le serveur à l'état *autenticated*. Cette commande exécute les mêmes actions que :meth:`imaplib.IMAP4.close`, mais aucun message n'est retiré de façon permanente de la boîte courriel sélectionnée (contribution de *Dong-hee Na* dans :issue:`40375`).

source: To improve consistency with import statements, :func:`importlib.util.resolve_name` now raises :exc:`ImportError` instead of :exc:`ValueError` for invalid relative import attempts. (Contributed by Ngalim Siregar in :issue:`37444`.)
fr: Pour plus de cohérence avec les instructions d'import, :func:`importlib.util.resolve_name` lève maintenant :exc:`ImportError` plutôt que :exc:`ValueError` pour les tentatives d'import relatifs invalides (contribution de *Ngalim Siregar* dans :issue:`37444`).

source: Import loaders which publish immutable module objects can now publish immutable packages in addition to individual modules. (Contributed by Dino Viehland in :issue:`39336`.)
fr: Les chargeurs d'importation qui publient des objets modules immuables peuvent maintenant aussi publier des paquets immuables en plus des modules individuels (contribution de *Dino Viehland* dans :issue:`39336`).

source: Added :func:`importlib.resources.files` function with support for subdirectories in package data, matching backport in ``importlib_resources`` version 1.5. (Contributed by Jason R. Coombs in :issue:`39791`.)
fr: Ajout de la fonction :func:`importlib.resources.files` qui prend en charge les sous-répertoires dans les données du paquet. Aussi rétro-porté pour les version précédentes de Python dans ``importlib_resources`` version 1.5 (contribution de *Jason R. Coombs* dans :issue:`39791`).

source: Refreshed ``importlib.metadata`` from ``importlib_metadata`` version 1.6.1.
fr: Mise à jour de ``importlib.metadata`` à partir de ``importlib_metadata`` version 1.6.1.

source: :attr:`inspect.BoundArguments.arguments` is changed from ``OrderedDict`` to regular dict. (Contributed by Inada Naoki in :issue:`36350` and :issue:`39775`.)
fr: :attr:`inspect.BoundArguments.arguments`, qui était un ``OrderedDict``, devient un ``dict`` natif régulier (contribution de *Inada Naoki* dans :issue:`36350` et :issue:`39775`).

source: :mod:`ipaddress` now supports IPv6 Scoped Addresses (IPv6 address with suffix ``%<scope_id>``).
fr: :mod:`ipaddress` prend désormais en charge les IPv6 avec une portée spécifiée (adresses IPv6 avec un suffixe ``%<scope_id>``).

source: Scoped IPv6 addresses can be parsed using :class:`ipaddress.IPv6Address`. If present, scope zone ID is available through the :attr:`~ipaddress.IPv6Address.scope_id` attribute. (Contributed by Oleksandr Pavliuk in :issue:`34788`.)
fr: Les adresses IPv6 avec une portée spécifiée peuvent être analysées avec :class:`ipaddress.IPv6Address`. S'il est présent, l'indice de la zone de la portée est disponible dans l'attribut :attr:`~ipaddress.IPv6Address.scope_id` (contribution de *Oleksandr Pavliuk* dans :issue:`34788`).

source: Starting with Python 3.9.5 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. (Contributed by Christian Heimes in :issue:`36384`).
fr: À partir de Python 3.9.5, le module :mod:`ipaddress` n'accepte plus aucun zéro en tête des chaînes de caractères IPv4. (Contribué par Christian Heimes dans :issue:`36384`).

source: Expanded the :func:`math.gcd` function to handle multiple arguments. Formerly, it only supported two arguments. (Contributed by Serhiy Storchaka in :issue:`39648`.)
fr: Extension de la fonction :func:`math.gcd` pour gérer les arguments multiples. Préalablement, elle ne gérait que deux arguments (contribution de *Serhiy Storchaka* dans :issue:`39648`).

source: Added :func:`math.lcm`: return the least common multiple of specified arguments. (Contributed by Mark Dickinson, Ananthakrishnan and Serhiy Storchaka in :issue:`39479` and :issue:`39648`.)
fr: Ajout de :func:`math.lcm` : renvoie le plus petit commun multiple des arguments spécifiés (contribution de *Mark Dickinson*, *Ananthakrishnan* et *Serhiy Storchaka* dans :issue:`39479` et :issue:`39648`).

source: Added :func:`math.nextafter`: return the next floating-point value after *x* towards *y*. (Contributed by Victor Stinner in :issue:`39288`.)
fr: Ajout de :func:`math.nextafter` : renvoie la prochaine valeur à point flottant après *x* en direction de *y* (contribution de *Victor Stinner* dans :issue:`39288`).

source: Added :func:`math.ulp`: return the value of the least significant bit of a float. (Contributed by Victor Stinner in :issue:`39310`.)
fr: Ajout de :func:`math.ulp` : renvoie la valeur du bit le moins significatif d'un *float* (contribution de *Victor Stinner* dans :issue:`39310`).

source: The :class:`multiprocessing.SimpleQueue` class has a new :meth:`~multiprocessing.SimpleQueue.close` method to explicitly close the queue. (Contributed by Victor Stinner in :issue:`30966`.)
fr: La classe :class:`multiprocessing.SimpleQueue` a une nouvelle méthode :meth:`~multiprocessing.SimpleQueue.close` pour fermer la queue de façon explicite (contribution de *Victor Stinner* dans :issue:`30966`).

source: :class:`~nntplib.NNTP` and :class:`~nntplib.NNTP_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Dong-hee Na in :issue:`39259`.)
fr: Afin d'empêcher la création d'interfaces de connexion (*sockets*) non-bloquantes, les classes :class:`~nntplib.NNTP` et :class:`~nntplib.NNTP_SSL` lèvent maintenant :class:`ValueError` si la valeur passée à *timeout* dans leur constructeur est zéro (contribution de *Dong-hee Na* dans :issue:`39259`).

source: Added :data:`~os.CLD_KILLED` and :data:`~os.CLD_STOPPED` for :attr:`si_code`. (Contributed by Dong-hee Na in :issue:`38493`.)
fr: Ajout de :data:`~os.CLD_KILLED` et :data:`~os.CLD_STOPPED` pour :attr:`si_code` (contribution de *Dong-hee Na* dans :issue:`38493`).

source: Exposed the Linux-specific :func:`os.pidfd_open` (:issue:`38692`) and :data:`os.P_PIDFD` (:issue:`38713`) for process management with file descriptors.
fr: Sur Linux, exposition de :func:`os.pidfd_open` (:issue:`38692`) et de :data:`os.P_PIDFD` (:issue:`38713`) pour la gestion de processus avec des descripteurs de fichiers.

source: The :func:`os.unsetenv` function is now also available on Windows. (Contributed by Victor Stinner in :issue:`39413`.)
fr: La fonction :func:`os.unsetenv` est maintenant aussi disponible sur Windows (contribution de *Victor Stinner* dans :issue:`39413`).

source: The :func:`os.putenv` and :func:`os.unsetenv` functions are now always available. (Contributed by Victor Stinner in :issue:`39395`.)
fr: Les fonctions :func:`os.putenv` et :func:`os.unsetenv` sont maintenant toujours disponibles (contribution de *Victor Stinner* dans :issue:`39395`).

source: Added :func:`os.waitstatus_to_exitcode` function: convert a wait status to an exit code. (Contributed by Victor Stinner in :issue:`40094`.)
fr: Ajout de la fonction :func:`os.waitstatus_to_exitcode` : convertit la valeur de retour de ``wait()`` en code de sortie (contribution de *Victor Stinner* dans :issue:`40094`).

source: Added :meth:`pathlib.Path.readlink()` which acts similarly to :func:`os.readlink`. (Contributed by Girts Folkmanis in :issue:`30618`)
fr: Ajout de :meth:`pathlib.Path.readlink()` qui a un comportement similaire à :func:`os.readlink` (contribution de *Girts Folkmanis* dans :issue:`30618`).

source: On Windows now :class:`~pdb.Pdb` supports ``~/.pdbrc``. (Contributed by Tim Hopper and Dan Lidral-Porter in :issue:`20523`.)
fr: Sur Windows, :class:`~pdb.Pdb` gère maintenant ``~/.pdbrc`` (contribution de *Tim Hopper* et *Dan Lidral-Porter* dans :issue:`20523`).

source: :class:`~poplib.POP3` and :class:`~poplib.POP3_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Dong-hee Na in :issue:`39259`.)
fr: Afin de prévenir la création d'une interface de connexion (*socket*) non-bloquante, :class:`~poplib.POP3` et :class:`~poplib.POP3_SSL` lèvent maintenant une :class:`ValueError` si la valeur passée à *timeout* dans leur constructeur est zéro (contribution de *Dong-hee Na* dans :issue:`39259`).

source: :mod:`pprint` can now pretty-print :class:`types.SimpleNamespace`. (Contributed by Carl Bordum Hansen in :issue:`37376`.)
fr: :mod:`pprint` peut maintenant faire l'affichage formaté de :class:`types.SimpleNamespace` (contribution de *Carl Bordum Hansen* dans :issue:`37376`).

source: The documentation string is now shown not only for class, function, method etc, but for any object that has its own ``__doc__`` attribute. (Contributed by Serhiy Storchaka in :issue:`40257`.)
fr: La chaîne de documentation est maintenant affichée non seulement pour les classes, fonctions, méthodes, etc., mais aussi pour tout objet qui a son propre attribut ``__doc__`` (contribution de *Serhiy Storchaka* dans :issue:`40257`).

source: Added a new :attr:`random.Random.randbytes` method: generate random bytes. (Contributed by Victor Stinner in :issue:`40286`.)
fr: Ajout de la méthode :attr:`random.Random.randbytes` : génère des octets aléatoires (contribution de *Victor Stinner* dans :issue:`40286`).

source: Exposed the Linux-specific :func:`signal.pidfd_send_signal` for sending to signals to a process using a file descriptor instead of a pid. (:issue:`38712`)
fr: Sur Linux, exposition de :func:`signal.pidfd_send_signal` pour envoyer des signaux à un processus en utilisant un descripteur de fichier plutôt qu'un identifiant de processus (*pid*). (:issue:`38712`)

source: :class:`~smtplib.SMTP` and :class:`~smtplib.SMTP_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Dong-hee Na in :issue:`39259`.)
fr: Afin d'éviter la création d'une interface de connexion (*socket*) non-bloquante, :class:`~smtplib.SMTP` et :class:`~smtplib.SMTP_SSL` lèvent maintenant une :class:`ValueError` si la valeur de *timeout* passée à leur constructeur est zéro (contribution de *Dong-hee Na* dans :issue:`39259`).

source: :class:`~smtplib.LMTP` constructor now has an optional *timeout* parameter. (Contributed by Dong-hee Na in :issue:`39329`.)
fr: Le constructeur de :class:`~smtplib.LMTP` a maintenant un paramètre *timeout* optionnel (contribution de *Dong-hee Na* dans :issue:`39329`).

source: The :mod:`socket` module now exports the :data:`~socket.CAN_RAW_JOIN_FILTERS` constant on Linux 4.1 and greater. (Contributed by Stefan Tatschner and Zackery Spytz in :issue:`25780`.)
fr: Le module :mod:`socket` exporte maintenant la constante :data:`~socket.CAN_RAW_JOIN_FILTERS` à partir de Linux 4.1 (contribution de *Stefan Tatschner* et *Zackery Spytz* dans :issue:`25780`).

source: The socket module now supports the :data:`~socket.CAN_J1939` protocol on platforms that support it. (Contributed by Karl Ding in :issue:`40291`.)
fr: Le module ``socket`` prend maintenant en charge le protocole :data:`~socket.CAN_J1939` sur les plateformes où il est disponible (contribution de *Karl Ding* dans :issue:`40291`).

source: The socket module now has the :func:`socket.send_fds` and :func:`socket.recv_fds` functions. (Contributed by Joannah Nanjekye, Shinya Okano and Victor Stinner in :issue:`28724`.)
fr: Le module ``socket`` possède maintenant les fonctions :func:`socket.send_fds` et :func:`socket.recv_fds` (contribution de *Joannah Nanjekye*, *Shinya Okano* et *Victor Stinner* dans :issue:`28724`).

source: On AIX, :func:`~time.thread_time` is now implemented with ``thread_cputime()`` which has nanosecond resolution, rather than ``clock_gettime(CLOCK_THREAD_CPUTIME_ID)`` which has a resolution of 10 ms. (Contributed by Batuhan Taskaya in :issue:`40192`)
fr: Sur AIX, :func:`~time.thread_time` est maintenant implémenté par ``thread_cputime()`` qui a une résolution à la nanoseconde près plutôt que ``clock_gettime(CLOCK_THREAD_CPUTIME_ID)`` qui a une résolution de 10 ms (contribution de *Batuhan Taskaya* dans :issue:`40192`).

source: Added a new :attr:`sys.platlibdir` attribute: name of the platform-specific library directory. It is used to build the path of standard library and the paths of installed extension modules. It is equal to ``"lib"`` on most platforms. On Fedora and SuSE, it is equal to ``"lib64"`` on 64-bit platforms. (Contributed by Jan Matějek, Matěj Cepl, Charalampos Stratakis and Victor Stinner in :issue:`1294959`.)
fr: Ajout du nouvel attribut :attr:`sys.platlibdir` : répertoire des bibliothèques spécifiques à la plateforme. Il est utilisé pour construire le chemin de la bibliothèque standard et les chemins des modules d'extension installés. Il est égal à ``"lib"`` sur la plupart des plateformes. Sur *Fedora* et *SuSE*, il est égal à ``"lib64"`` sur les plateformes 64-bit (contribution de *Jan Matějek*, *Matěj Cepl*, *Charalampos Stratakis* et *Victor Stinner* dans :issue:`1294959`).

source: Previously, :attr:`sys.stderr` was block-buffered when non-interactive. Now ``stderr`` defaults to always being line-buffered. (Contributed by Jendrik Seipp in :issue:`13601`.)
fr: Préalablement, :attr:`sys.stderr` avait un tampon par blocs quand il n'était pas interactif. Maintenant ``stderr`` a toujours par défaut un tampon par lignes (contribution de *Jendrik Seipp* dans :issue:`13601`).

source: Added :func:`tracemalloc.reset_peak` to set the peak size of traced memory blocks to the current size, to measure the peak of specific pieces of code. (Contributed by Huon Wilson in :issue:`40630`.)
fr: Ajout de :func:`tracemalloc.reset_peak` qui affecte la taille d'apogée (la plus grande taille atteinte) du bloc mémoire tracé à la taille courante, pour mesurer la taille d'apogée de parties de code spécifiques (contribution de *Huon Wilson* dans :issue:`40630`).
