Repository: python/python-docs-fr
Catalog: whatsnew/3.9.po
Languages: fr

source: :pep:`593` introduced an :data:`typing.Annotated` type to decorate existing types with context-specific metadata and new ``include_extras`` parameter to :func:`typing.get_type_hints` to access the metadata at runtime. (Contributed by Till Varoquaux and Konstantin Kashin.)
fr: :pep:`593` ajoute le type :data:`typing.Annotated` pour décorer les types existants avec des métadonnées spécifiques au contexte et le nouveau paramètre ``include_extras`` à :func:`typing.get_type_hints` pour récupérer les métadonnées à l'exécution (contribution de *Till Varoquaux* et *Konstantin Kashin*).

source: The Unicode database has been updated to version 13.0.0. (:issue:`39926`).
fr: La base de donnée Unicode a été mise à jour à la version 13.0.0. (:issue:`39926`).

source: The activation scripts provided by :mod:`venv` now all specify their prompt customization consistently by always using the value specified by ``__VENV_PROMPT__``. Previously some scripts unconditionally used ``__VENV_PROMPT__``, others only if it happened to be set (which was the default case), and one used ``__VENV_NAME__`` instead. (Contributed by Brett Cannon in :issue:`37663`.)
fr: Tous les scripts d'activations fournis par :mod:`venv` spécifient maintenant la personnalisation de l'invite de façon cohérente en utilisant toujours la valeur spécifiée dans ``__VENV_PROMPT__``. Précédemment certains scripts utilisaient toujours ``__VENV_PROMPT__``, d'autres seulement quand la variable était affectée, et un utilisait plutôt ``__VENV_NAME__`` (contribution de *Brett Cannon* dans :issue:`37663`).

source: White space characters within attributes are now preserved when serializing :mod:`xml.etree.ElementTree` to XML file. EOLNs are no longer normalized to "\n". This is the result of discussion about how to interpret section 2.11 of XML spec. (Contributed by Mefistotelis in :issue:`39011`.)
fr: Les caractères d'espacement à l'intérieur des attributs sont maintenant préservés lors de la sérialisation d':mod:`xml.etree.ElementTree` en fichier XML. Les fin de lignes ne sont plus normalisées par "\n". Ceci est le résultat d'une discussion sur comment interpréter la section 2.11 de la spécification XML (contribution de *Mefistotelis* dans :issue:`39011`).

source: Optimizations
fr: Optimisations

source: Optimized the idiom for assignment a temporary variable in comprehensions. Now ``for y in [expr]`` in comprehensions is as fast as a simple assignment ``y = expr``. For example:
fr: L'affectation d'une variable temporaire dans les compréhensions est optimisée. Maintenant ``for y in [expr]`` dans les compréhensions est aussi rapide qu'une affectation simple ``y = expr``. Par exemple :

source: Unlike the ``:=`` operator this idiom does not leak a variable to the outer scope.
fr: Contrairement à l'opérateur ``:=``, cet idiome ne laisse pas déborder une variable dans la portée externe.

source: (Contributed by Serhiy Storchaka in :issue:`32856`.)
fr: (contribution de *Serhiy Storchaka* dans :issue:`32856`).

source: Optimized signal handling in multithreaded applications. If a thread different than the main thread gets a signal, the bytecode evaluation loop is no longer interrupted at each bytecode instruction to check for pending signals which cannot be handled. Only the main thread of the main interpreter can handle signals.
fr: Optimisation de la gestion des signaux dans les applications avec plus d'un fil d'exécution (*multithreaded applications*). Si un fil d'exécution autre que le fil principal reçoit un signal, la boucle d'évaluation du code intermédiaire (*bytecode*) n'est plus interrompue à chaque instruction intermédiaire pour vérifier s'il y a des signaux en attente qui ne peuvent être gérés. Seul le fil principal de l'interpréteur principal peut gérer les signaux.

source: Previously, the bytecode evaluation loop was interrupted at each instruction until the main thread handles signals. (Contributed by Victor Stinner in :issue:`40010`.)
fr: Précédemment, la boucle d'évaluation du code intermédiaire était interrompue à chaque instruction jusqu'à ce que le fil principal gère les signaux (contribution de *Victor Stinner* dans :issue:`40010`).

source: Optimized the :mod:`subprocess` module on FreeBSD using ``closefrom()``. (Contributed by Ed Maste, Conrad Meyer, Kyle Evans, Kubilay Kocak and Victor Stinner in :issue:`38061`.)
fr: Optimisation du module :mod:`subprocess` sur FreeBSD en utilisant ``closefrom()`` (contribution de *Ed Maste*, *Conrad Meyer*, *Kyle Evans*, *Kubilay Kocak* et *Victor Stinner* dans :issue:`38061`).

source: A number of Python builtins (:class:`range`, :class:`tuple`, :class:`set`, :class:`frozenset`, :class:`list`, :class:`dict`) are now sped up by using :pep:`590` vectorcall protocol. (Contributed by Dong-hee Na, Mark Shannon, Jeroen Demeyer and Petr Viktorin in :issue:`37207`.)
fr: Certaines fonctions et classes natives (:class:`range`, :class:`tuple`, :class:`set`, :class:`frozenset`, :class:`list`, :class:`dict`) sont maintenant plus rapides grâce à l'utilisation du protocole de vectorisation de :pep:`590` (contribution de *Dong-hee Na*, *Mark Shannon*, *Jeroen Demeyer* et *Petr Viktorin* dans :issue:`37207`).

source: Optimized :func:`~set.difference_update` for the case when the other set is much larger than the base set. (Suggested by Evgeny Kapun with code contributed by Michele Orrù in :issue:`8425`.)
fr: Optimisation de :func:`~set.difference_update` pour le cas où l'autre *set* est beaucoup plus grand que celui de base. (Suggestion par *Evgeny Kapun* et codage contribué par *Michele Orrù* dans :issue:`8425`.)

source: Python's small object allocator (``obmalloc.c``) now allows (no more than) one empty arena to remain available for immediate reuse, without returning it to the OS. This prevents thrashing in simple loops where an arena could be created and destroyed anew on each iteration. (Contributed by Tim Peters in :issue:`37257`.)
fr: L'allocateur de petits objets de Python (``obmalloc.c``) alloue maintenant (au plus) un aréna vide qui reste disponible pour réutilisation immédiate, sans le renvoyer au système d'exploitation. Ceci prévient l'emballement (*thrashing*) dans les boucles simples où un aréna pourrait être créé puis détruit à nouveau à chaque itération (contribution de *Tim Peters* dans :issue:`37257`).

source: :term:`floor division` of float operation now has a better performance. Also the message of :exc:`ZeroDivisionError` for this operation is updated. (Contributed by Dong-hee Na in :issue:`39434`.)
fr: L'opération de :term:`division entière <floor division>` d'un *float* est plus performante. De plus, le message de :exc:`ZeroDivisionError` pour cette opération a été mis à jour (contribution de *Dong-hee Na* dans :issue:`39434`).

source: Decoding short ASCII strings with UTF-8 and ascii codecs is now about 15% faster. (Contributed by Inada Naoki in :issue:`37348`.)
fr: Le décodage de courtes chaînes ASCII avec les codecs *UTF-8* et *ascii* est maintenant 15 % plus rapide (contribution de *Inada Naoki* dans :issue:`37348`).

source: Here's a summary of performance improvements from Python 3.4 through Python 3.9:
fr: Voici un résumé des améliorations de performance de Python 3.4 à Python 3.9 :

source: These results were generated from the variable access benchmark script at: ``Tools/scripts/var_access_benchmark.py``. The benchmark script displays timings in nanoseconds. The benchmarks were measured on an `Intel® Core™ i7-4960HQ processor <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ running the macOS 64-bit builds found at `python.org <https://www.python.org/downloads/mac-osx/>`_.
fr: Ces résultats ont été obtenus avec le script de test de performance des accès aux variables : ``Tools/scripts/var_access_benchmark.py``. Le script de test de performances affiche le chronométrage en nanosecondes. Les tests ont été effectués sur un processeur `Intel® Core™ i7-4960HQ <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ roulant la compilation *macOS* 64-bit disponible sur `python.org <https://www.python.org/downloads/mac-osx/>`_.

source: Deprecated
fr: Obsolescence

source: The distutils ``bdist_msi`` command is now deprecated, use ``bdist_wheel`` (wheel packages) instead. (Contributed by Hugo van Kemenade in :issue:`39586`.)
fr: La commande de *distutils* ``bdist_msi`` est maintenant obsolète, utilisez plutôt ``bdist_wheel`` (paquet *wheel*) (contribution de *Hugo van Kemenade* dans :issue:`39586`).

source: Currently :func:`math.factorial` accepts :class:`float` instances with non-negative integer values (like ``5.0``). It raises a :exc:`ValueError` for non-integral and negative floats. It is now deprecated. In future Python versions it will raise a :exc:`TypeError` for all floats. (Contributed by Serhiy Storchaka in :issue:`37315`.)
fr: Présentement, :func:`math.factorial` accepte des instances de :class:`float` qui sont des entiers non-négatifs (comme ``5.0``). Elle lève une :exc:`ValueError` pour les *floats* non-entiers et négatifs. Ceci est maintenant obsolète. Les versions futures de Python vont lever une :exc:`TypeError` pour tous les *floats* (contribution de *Serhiy Storchaka* dans :issue:`37315`).

source: The :mod:`parser` and :mod:`symbol` modules are deprecated and will be removed in future versions of Python. For the majority of use cases, users can leverage the Abstract Syntax Tree (AST) generation and compilation stage, using the :mod:`ast` module.
fr: Les modules :mod:`parser` et :mod:`symbol` sont obsolètes et seront retirés des versions futures de Python. Pour la majorité des cas d'utilisation, les utilisateurs peuvent tirer profit des stades de génération et de compilation d'un arbre de syntaxe abstraite, en utilisant le module :mod:`ast`.

source: The Public C API functions :c:func:`PyParser_SimpleParseStringFlags`, :c:func:`PyParser_SimpleParseStringFlagsFilename`, :c:func:`PyParser_SimpleParseFileFlags` and :c:func:`PyNode_Compile` are deprecated and will be removed in Python 3.10 together with the old parser.
fr: Les fonctions :c:func:`PyParser_SimpleParseStringFlags`, :c:func:`PyParser_SimpleParseStringFlagsFilename`, :c:func:`PyParser_SimpleParseFileFlags` et :c:func:`PyNode_Compile` de l'API C Publique sont obsolètes et seront retirées de Python 3.10 en même temps que l'ancien analyseur.

source: Using :data:`NotImplemented` in a boolean context has been deprecated, as it is almost exclusively the result of incorrect rich comparator implementations. It will be made a :exc:`TypeError` in a future version of Python. (Contributed by Josh Rosenberg in :issue:`35712`.)
fr: L'utilisation de :data:`NotImplemented` dans un contexte booléen est devenu obsolète, puisque c'est presque toujours le résultat d'une implémentation incorrecte des opérateurs de comparaison avancés. Ceci va devenir une :exc:`TypeError` dans les versions futures de Python (contribution de *Josh Rosenberg* dans :issue:`35712`).

source: The :mod:`random` module currently accepts any hashable type as a possible seed value. Unfortunately, some of those types are not guaranteed to have a deterministic hash value. After Python 3.9, the module will restrict its seeds to :const:`None`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, and :class:`bytearray`.
fr: Le module :mod:`random` accepte présentement n'importe quel hachable comme valeur d'ensemencement. Malheureusement, certains de ces types ne garantissent pas une valeur de hachage déterministe. Après Python 3.9, le module va restreindre l'ensemencement à :const:`None`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes` et :class:`bytearray`.

source: Opening the :class:`~gzip.GzipFile` file for writing without specifying the *mode* argument is deprecated. In future Python versions it will always be opened for reading by default. Specify the *mode* argument for opening it for writing and silencing a warning. (Contributed by Serhiy Storchaka in :issue:`28286`.)
fr: Ouvrir un fichier :class:`~gzip.GzipFile` en écriture sans spécifier l'argument *mode* est obsolète. Dans les futures versions de Python, il sera toujours ouvert en lecture par défaut. Spécifiez l'argument *mode* pour l'ouvrir en écriture et supprimer l'avertissement (contribution de *Serhiy Storchaka* dans :issue:`28286`).

source: Deprecated the ``split()`` method of :class:`_tkinter.TkappType` in favour of the ``splitlist()`` method which has more consistent and predicable behavior. (Contributed by Serhiy Storchaka in :issue:`38371`.)
fr: La méthode ``split()`` de :class:`_tkinter.TkappType` est obsolète. La méthode ``splitlist()`` est plus favorable, car elle a un comportement plus cohérent et prévisible (contribution de *Serhiy Storchaka* dans :issue:`38371`).

source: The explicit passing of coroutine objects to :func:`asyncio.wait` has been deprecated and will be removed in version 3.11. (Contributed by Yury Selivanov and Kyle Stanley in :issue:`34790`.)
fr: Le passage explicite d'objets coroutine à :func:`asyncio.wait` est devenu obsolète et sera retiré dans la version 3.11. (Contribution de *Yury Selivanov* et *Kyle Stanley* dans :issue:`34790`.)

source: binhex4 and hexbin4 standards are now deprecated. The :mod:`binhex` module and the following :mod:`binascii` functions are now deprecated:
fr: Les standards *binhex4* et *hexbin4* sont maintenant obsolètes. Le module :mod:`binhex` et les fonctions suivantes du module :mod:`binascii` sont maintenant obsolètes :

source: (Contributed by Victor Stinner in :issue:`39353`.)
fr: (contribution de *Victor Stinner* dans :issue:`39353`).

source: :mod:`ast` classes ``slice``, ``Index`` and ``ExtSlice`` are considered deprecated and will be removed in future Python versions. ``value`` itself should be used instead of ``Index(value)``. ``Tuple(slices, Load())`` should be used instead of ``ExtSlice(slices)``. (Contributed by Serhiy Storchaka in :issue:`34822`.)
fr: Les classes ``slice``, ``Index`` et ``ExtSlice`` du module :mod:`ast` sont considérées obsolètes et seront retirées des versions futures de Python. ``value`` doit être utilisé à la place de ``Index(value)``. ``Tuple(slices, Load())`` doit être utilisé plutôt que ``ExtSlice(slices)`` (contribution de *Serhiy Storchaka* dans :issue:`34822`).

source: :mod:`ast` classes ``Suite``, ``Param``, ``AugLoad`` and ``AugStore`` are considered deprecated and will be removed in future Python versions. They were not generated by the parser and not accepted by the code generator in Python 3. (Contributed by Batuhan Taskaya in :issue:`39639` and :issue:`39969` and Serhiy Storchaka in :issue:`39988`.)
fr: Les classes ``Suite``, ``Param``, ``AugLoad`` et ``AugStore`` du module :mod:`ast` sont considérées obsolètes et seront retirées des versions futures de Python. Elles n'étaient pas produites par l'analyseur et n'étaient pas acceptées par le générateur de code dans Python 3 (contribution de *Batuhan Taskaya* dans :issue:`39639` et :issue:`39969` et *Serhiy Storchaka* dans :issue:`39988`).

source: The :c:func:`PyEval_InitThreads` and :c:func:`PyEval_ThreadsInitialized` functions are now deprecated and will be removed in Python 3.11. Calling :c:func:`PyEval_InitThreads` now does nothing. The :term:`GIL` is initialized by :c:func:`Py_Initialize()` since Python 3.7. (Contributed by Victor Stinner in :issue:`39877`.)
fr: Les fonctions :c:func:`PyEval_InitThreads` et :c:func:`PyEval_ThreadsInitialized` sont maintenant obsolètes et seront retirées de Python 3.11. Maintenant, l'appel de :c:func:`PyEval_InitThreads` ne fait rien du tout. Le :term:`GIL` est initialisé par :c:func:`Py_Initialize()` depuis Python 3.7 (contribution de *Victor Stinner* dans :issue:`39877`).

source: Passing ``None`` as the first argument to the :func:`shlex.split` function has been deprecated. (Contributed by Zackery Spytz in :issue:`33262`.)
fr: Passer ``None`` comme premier argument à la fonction :func:`shlex.split` a été rendu obsolète (contribution de *Zackery Spytz* dans :issue:`33262`).

source: :func:`smtpd.MailmanProxy` is now deprecated as it is unusable without an external module, ``mailman``. (Contributed by Samuel Colvin in :issue:`35800`.)
fr: :func:`smtpd.MailmanProxy` est maintenant obsolète puisqu'elle n'est pas utilisable sans le module externe ``mailman`` (contribution de *Samuel Colvin* dans :issue:`35800`).

source: The :mod:`lib2to3` module now emits a :exc:`PendingDeprecationWarning`. Python 3.9 switched to a PEG parser (see :pep:`617`), and Python 3.10 may include new language syntax that is not parsable by lib2to3's LL(1) parser. The ``lib2to3`` module may be removed from the standard library in a future Python version. Consider third-party alternatives such as `LibCST`_ or `parso`_. (Contributed by Carl Meyer in :issue:`40360`.)
fr: Le module :mod:`lib2to3` émet maintenant un :exc:`PendingDeprecationWarning`. Python 3.9 est passé à un analyseur *PEG* (voir :pep:`617`), et Python 3.10 peut inclure des changements à la syntaxe qui ne sont pas analysables par l'analyseur *LL(1)* de ``lib2to3``. Le module ``lib2to3`` peut être retiré de la bibliothèque standard dans une version future de Python. Considérez une alternative tierce telle que `LibCST`_ ou `parso`_ (contribution de *Carl Meyer* dans :issue:`40360`).

source: The *random* parameter of :func:`random.shuffle` has been deprecated. (Contributed by Raymond Hettinger in :issue:`40465`)
fr: Le paramètre *random* de :func:`random.shuffle` est maintenant obsolète (contribution de *Raymond Hettinger* dans :issue:`40465`).

source: Removed
fr: Retraits

source: The erroneous version at :data:`unittest.mock.__version__` has been removed.
fr: La version erronée dans :data:`unittest.mock.__version__` a été retirée.

source: :class:`nntplib.NNTP`: ``xpath()`` and ``xgtitle()`` methods have been removed. These methods are deprecated since Python 3.3. Generally, these extensions are not supported or not enabled by NNTP server administrators. For ``xgtitle()``, please use :meth:`nntplib.NNTP.descriptions` or :meth:`nntplib.NNTP.description` instead. (Contributed by Dong-hee Na in :issue:`39366`.)
fr: Les méthodes de :class:`nntplib.NNTP` : ``xpath()`` et ``xgtitle()`` ont été retirées. Ces méthodes sont obsolètes depuis Python 3.3. En général, ces extensions ne sont pas prises en charge ou ne sont pas activées par les administrateurs de serveurs *NNTP*. Pour ``xgtitle()`` veuillez plutôt utiliser :meth:`nntplib.NNTP.descriptions` ou :meth:`nntplib.NNTP.description` (contribution de *Dong-hee Na* dans :issue:`39366`).

source: :class:`array.array`: ``tostring()`` and ``fromstring()`` methods have been removed. They were aliases to ``tobytes()`` and ``frombytes()``, deprecated since Python 3.2. (Contributed by Victor Stinner in :issue:`38916`.)
fr: Les méthodes de :class:`array.array` : ``tostring()`` et ``fromstring()`` ont été retirées. Elles étaient des alias de ``tobytes()`` et ``frombytes()``, obsolètes depuis Python 3.2 (contribution de *Victor Stinner* dans :issue:`38916`).

source: The undocumented ``sys.callstats()`` function has been removed. Since Python 3.7, it was deprecated and always returned :const:`None`. It required a special build option ``CALL_PROFILE`` which was already removed in Python 3.7. (Contributed by Victor Stinner in :issue:`37414`.)
fr: La fonction non-documentée ``sys.callstats()`` a été retirée. Depuis Python 3.7, elle était obsolète et retournait toujours :const:`None`. Elle dépendait de l'option de construction ``CALL_PROFILE`` qui avait déjà été retirée dans Python 3.7 (contribution de *Victor Stinner* dans :issue:`37414`).

source: The ``sys.getcheckinterval()`` and ``sys.setcheckinterval()`` functions have been removed. They were deprecated since Python 3.2. Use :func:`sys.getswitchinterval` and :func:`sys.setswitchinterval` instead. (Contributed by Victor Stinner in :issue:`37392`.)
fr: Les fonctions ``sys.getcheckinterval()`` et ``sys.setcheckinterval()`` ont été retirées. Elle étaient obsolètes depuis Python 3.2. Utilisez plutôt :func:`sys.getswitchinterval` et :func:`sys.setswitchinterval` (contribution de *Victor Stinner* dans :issue:`37392`).

source: The C function ``PyImport_Cleanup()`` has been removed. It was documented as: "Empty the module table. For internal use only." (Contributed by Victor Stinner in :issue:`36710`.)
fr: La fonction C ``PyImport_Cleanup()`` a été retirée. Elle était documentée comme "Vide la table des modules. Pour usage interne seulement." (contribution de *Victor Stinner* dans :issue:`36710`).

source: ``_dummy_thread`` and ``dummy_threading`` modules have been removed. These modules were deprecated since Python 3.7 which requires threading support. (Contributed by Victor Stinner in :issue:`37312`.)
fr: Les modules ``_dummy_thread`` et ``dummy_threading`` ont été retirés. Ces modules étaient obsolètes depuis Python 3.7 qui a besoin de la gestion de fils d'exécution multiples (contribution de *Victor Stinner* dans :issue:`37312`).

source: ``aifc.openfp()`` alias to ``aifc.open()``, ``sunau.openfp()`` alias to ``sunau.open()``, and ``wave.openfp()`` alias to :func:`wave.open()` have been removed. They were deprecated since Python 3.7. (Contributed by Victor Stinner in :issue:`37320`.)
fr: L'alias ``aifc.openfp()`` de ``aifc.open()``, l'alias ``sunau.openfp()`` de ``sunau.open()`` et l'alias ``wave.openfp()`` de :func:`wave.open()` ont été retirés. Ils étaient obsolètes depuis Python 3.7 (contribution de *Victor Stinner* dans :issue:`37320`).

source: The :meth:`~threading.Thread.isAlive()` method of :class:`threading.Thread` has been removed. It was deprecated since Python 3.8. Use :meth:`~threading.Thread.is_alive()` instead. (Contributed by Dong-hee Na in :issue:`37804`.)
fr: La méthode :meth:`~threading.Thread.isAlive()` de la classe :class:`threading.Thread` a été retirée. Elle était obsolète depuis Python 3.8. Utilisez plutôt :meth:`~threading.Thread.is_alive()` (contribution de *Dong-hee Na* dans :issue:`37804`).

source: Methods ``getchildren()`` and ``getiterator()`` of classes :class:`~xml.etree.ElementTree.ElementTree` and :class:`~xml.etree.ElementTree.Element` in the :mod:`~xml.etree.ElementTree` module have been removed. They were deprecated in Python 3.2. Use ``iter(x)`` or ``list(x)`` instead of ``x.getchildren()`` and ``x.iter()`` or ``list(x.iter())`` instead of ``x.getiterator()``. (Contributed by Serhiy Storchaka in :issue:`36543`.)
fr: Les méthodes ``getchildren()`` et ``getiterator()`` des classes :class:`~xml.etree.ElementTree.ElementTree` et :class:`~xml.etree.ElementTree.Element` dans le module :mod:`~xml.etree.ElementTree` ont été retirées. Elle avaient été déclarées obsolètes dans Python 3.2. Utilisez ``iter(x)`` ou ``list(x)`` plutôt que ``x.getchildren()`` et ``x.iter()`` ou ``list(x.iter())`` plutôt que ``x.getiterator()`` (contribution de *Serhiy Storchaka* dans :issue:`36543`).

source: The old :mod:`plistlib` API has been removed, it was deprecated since Python 3.4. Use the :func:`~plistlib.load`, :func:`~plistlib.loads`, :func:`~plistlib.dump`, and :func:`~plistlib.dumps` functions. Additionally, the *use_builtin_types* parameter was removed, standard :class:`bytes` objects are always used instead. (Contributed by Jon Janzen in :issue:`36409`.)
fr: L'ancienne API :mod:`plistlib` a été retirée, elle était obsolète depuis Python 3.4. Utilisez les fonctions :func:`~plistlib.load`, :func:`~plistlib.loads`, :func:`~plistlib.dump` et :func:`~plistlib.dumps`. De plus, le paramètre *use_builtin_types* a été retiré, les objets :class:`bytes` natifs sont toujours utilisés.
