Repository: python/python-docs-fr
Catalog: whatsnew/3.9.po
Languages: fr

source: What's New In Python 3.9
fr: Les nouveautés de Python 3.9

source: Editor
fr: Éditeur

source: For full details, see the :ref:`changelog <changelog>`.
fr: Pour plus de détails, voir le :ref:`changelog <changelog>`.

source: :pep:`596` - Python 3.9 Release Schedule
fr: :pep:`596` – Calendrier de sortie de Python 3.9

source: Summary -- Release highlights
fr: Résumé – Points marquants de cette version

source: New syntax features:
fr: Nouvelles fonctionnalités de syntaxe :

source: :pep:`584`, union operators added to ``dict``;
fr: :pep:`584`, ajout de l'opérateur d'union à ``dict`` ;

source: :pep:`585`, type hinting generics in standard collections;
fr: :pep:`585`, indications des types paramétrables dans les collections natives ;

source: :pep:`614`, relaxed grammar restrictions on decorators.
fr: :pep:`614`, restrictions grammaticales assouplies pour les décorateurs.

source: New built-in features:
fr: Nouvelles fonctionnalités natives :

source: :pep:`616`, string methods to remove prefixes and suffixes.
fr: :pep:`616`, méthodes sur les chaînes pour enlever des préfixes et des suffixes.

source: New features in the standard library:
fr: Nouvelles fonctionnalités dans la bibliothèque standard :

source: :pep:`593`, flexible function and variable annotations;
fr: :pep:`593`, annotations flexibles pour les fonctions et les variables ;

source: :func:`os.pidfd_open` added that allows process management without races and signals.
fr: ajout de :func:`os.pidfd_open` qui permet la gestion de processus sans concurrence critique et sans signaux.

source: Interpreter improvements:
fr: Améliorations de l'interpréteur :

source: :pep:`573`, fast access to module state from methods of C extension types;
fr: :pep:`573`, accès rapide à l'état des modules à partir des méthodes des types dans les extensions C ;

source: :pep:`617`, CPython now uses a new parser based on PEG;
fr: :pep:`617`, CPython utilise maintenant un analyseur lexical *PEG* (*Parsing Expression Grammar*) ;

source: a number of Python builtins (range, tuple, set, frozenset, list, dict) are now sped up using :pep:`590` vectorcall;
fr: certains types Python natifs (*range*, *tuple*, *set*, *frozenset*, *list*, *dict*) sont maintenant plus rapides grâce aux appels *vectorcall* (:pep:`590`) ;

source: garbage collection does not block on resurrected objects;
fr: le ramasse-miettes ne bloque pas sur les objets ressuscités ;

source: a number of Python modules (:mod:`_abc`, :mod:`audioop`, :mod:`_bz2`, :mod:`_codecs`, :mod:`_contextvars`, :mod:`_crypt`, :mod:`_functools`, :mod:`_json`, :mod:`_locale`, :mod:`math`, :mod:`operator`, :mod:`resource`, :mod:`time`, :mod:`_weakref`) now use multiphase initialization as defined by PEP 489;
fr: certains modules Python (:mod:`_abc`, :mod:`audioop`, :mod:`_bz2`, :mod:`_codecs`, :mod:`_contextvars`, :mod:`_crypt`, :mod:`_functools`, :mod:`_json`, :mod:`_locale`, :mod:`math`, :mod:`operator`, :mod:`resource`, :mod:`time`, :mod:`_weakref`) utilisent maintenant l'initialisation multi-phase telle que définie dans PEP 489 ;

source: a number of standard library modules (:mod:`audioop`, :mod:`ast`, :mod:`grp`, :mod:`_hashlib`, :mod:`pwd`, :mod:`_posixsubprocess`, :mod:`random`, :mod:`select`, :mod:`struct`, :mod:`termios`, :mod:`zlib`) are now using the stable ABI defined by PEP 384.
fr: certains modules de la bibliothèque standard (:mod:`audioop`, :mod:`ast`, :mod:`grp`, :mod:`_hashlib`, :mod:`pwd`, :mod:`_posixsubprocess`, :mod:`random`, :mod:`select`, :mod:`struct`, :mod:`termios`, :mod:`zlib`) utilisent maintenant l'*ABI* (*Application Binary Interface*) stable définie dans PEP 384.

source: New library modules:
fr: Nouveaux modules de la bibliothèque :

source: :pep:`615`, the IANA Time Zone Database is now present in the standard library in the :mod:`zoneinfo` module;
fr: :pep:`615`, la base de données des fuseaux horaires de l'IANA est maintenant incluse dans le module :mod:`zoneinfo` de la bibliothèque standard ;

source: an implementation of a topological sort of a graph is now provided in the new :mod:`graphlib` module.
fr: une implémentation du tri topologique d'un graphe est maintenant disponible dans le nouveau module :mod:`graphlib`.

source: Release process changes:
fr: Changements aux procédures de publication :

source: :pep:`602`, CPython adopts an annual release cycle.
fr: :pep:`602`, CPython adopte un cycle annuel de publications.

source: You should check for DeprecationWarning in your code
fr: Vous devez vérifier la présence de ``DeprecationWarning`` dans votre code

source: When Python 2.7 was still supported, a lot of functionality in Python 3 was kept for backward compatibility with Python 2.7. With the end of Python 2 support, these backward compatibility layers have been removed, or will be removed soon. Most of them emitted a :exc:`DeprecationWarning` warning for several years. For example, using ``collections.Mapping`` instead of ``collections.abc.Mapping`` emits a :exc:`DeprecationWarning` since Python 3.3, released in 2012.
fr: Quand Python 2.7 était encore pris en charge, plusieurs fonctionnalités dans Python 3 étaient gardées pour la rétro-compatibilité avec Python 2.7. Avec la fin de la prise en charge de Python 2, ces couches de rétro-compatibilité ont été retirées ou le seront bientôt. La plupart d'entre elles émettaient un avertissement :exc:`DeprecationWarning` depuis plusieurs années. Par exemple, utiliser ``collections.Mapping`` plutôt que ``collections.abc.Mapping`` émettait un :exc:`DeprecationWarning` depuis Python 3.3, publié en 2012.

source: Test your application with the :option:`-W` ``default`` command-line option to see :exc:`DeprecationWarning` and :exc:`PendingDeprecationWarning`, or even with :option:`-W` ``error`` to treat them as errors. :ref:`Warnings Filter <warning-filter>` can be used to ignore warnings from third-party code.
fr: Testez votre application avec l'option de ligne de commande :option:`-W` ``default`` pour voir les :exc:`DeprecationWarning` et les :exc:`PendingDeprecationWarning`, ou même avec :option:`-W` ``error`` pour les traiter comme des erreurs. :ref:`Le filtre des avertissements <warning-filter>` peut être utilisé pour ignorer les avertissements provenant de code de tierces parties.

source: Python 3.9 is the last version providing those Python 2 backward compatibility layers, to give more time to Python projects maintainers to organize the removal of the Python 2 support and add support for Python 3.9.
fr: Python 3.9 est la dernière version qui fournit ces couches de rétro compatibilité avec Python 2, afin de donner plus de temps aux mainteneurs de projets Python pour organiser l'arrêt de la prise en charge de Python 2 et pour assurer celle de Python 3.9.

source: Aliases to :ref:`Abstract Base Classes <collections-abstract-base-classes>` in the :mod:`collections` module, like ``collections.Mapping`` alias to :class:`collections.abc.Mapping`, are kept for one last release for backward compatibility. They will be removed from Python 3.10.
fr: Les alias vers :ref:`Abstract Base Classes <collections-abstract-base-classes>` dans le module :mod:`collections`, comme l'alias ``collections.Mapping`` vers :class:`collections.abc.Mapping`, sont conservés pour une dernière version au titre de la rétrocompatibilité. Ils seront supprimés de Python 3.10.

source: More generally, try to run your tests in the :ref:`Python Development Mode <devmode>` which helps to prepare your code to make it compatible with the next Python version.
fr: Plus généralement, essayez d'exécuter vos tests dans le :ref:`Python Development Mode <devmode>` qui aide à préparer votre code pour le rendre compatible avec la prochaine version de Python.

source: Note: a number of pre-existing deprecations were removed in this version of Python as well. Consult the :ref:`removed-in-python-39` section.
fr: Note : certaines déclarations d’obsolescence pré-existantes ont été retirées de cette version de Python. Voir la section :ref:`removed-in-python-39`.

source: New Features
fr: Nouvelles fonctionnalités

source: Dictionary Merge & Update Operators
fr: Opérateurs de fusion et de mise à jour de dictionnaires

source: Merge (``|``) and update (``|=``) operators have been added to the built-in :class:`dict` class. Those complement the existing ``dict.update`` and ``{**d1, **d2}`` methods of merging dictionaries.
fr: Ajout des opérateurs de fusion (``|``) et de mise-à-jour (``|=``) à la classe native :class:`dict`. Ils viennent compléter les méthodes existantes ``dict.update`` et ``{**d1, **d2}`` pour fusionner des dictionnaires.

source: Example::
fr: Exemple ::

source: See :pep:`584` for a full description. (Contributed by Brandt Bucher in :issue:`36144`.)
fr: Voir :pep:`584` pour une description complète (contribution de *Brandt Bucher* dans :issue:`36144`).

source: New String Methods to Remove Prefixes and Suffixes
fr: Nouvelles méthodes sur les chaînes pour retirer des préfixes et des suffixes

source: :meth:`str.removeprefix(prefix)<str.removeprefix>` and :meth:`str.removesuffix(suffix)<str.removesuffix>` have been added to easily remove an unneeded prefix or a suffix from a string. Corresponding ``bytes``, ``bytearray``, and ``collections.UserString`` methods have also been added. See :pep:`616` for a full description. (Contributed by Dennis Sweeney in :issue:`39939`.)
fr: :meth:`str.removeprefix(préfixe)<str.removeprefix>` et :meth:`str.removesuffix(suffixe)<str.removesuffix>` ont été ajoutées pour supprimer facilement un préfixe ou un suffixe inutile d'une chaîne. Les méthodes correspondantes de ``bytes``, ``bytearray`` et ``collections.UserString`` ont également été ajoutées. Voir :pep:`616` pour une description complète (contribution de *Dennis Sweeney* dans :issue:`39939`).

source: Type Hinting Generics in Standard Collections
fr: Indication des types paramétrables dans les collections natives

source: In type annotations you can now use built-in collection types such as ``list`` and ``dict`` as generic types instead of importing the corresponding capitalized types (e.g. ``List`` or ``Dict``) from ``typing``. Some other types in the standard library are also now generic, for example ``queue.Queue``.
fr: Dans les annotations de type, vous pouvez maintenant utiliser les types de collection natifs tels que ``list`` et ``dict`` comme types génériques au lieu d'importer les types en majuscules correspondants (par exemple ``List`` ou ``Dict``) à partir de ``typing``. D'autres types de la bibliothèque standard sont maintenant génériques, par exemple ``queue.Queue``.

source: Example:
fr: Exemple :

source: See :pep:`585` for more details. (Contributed by Guido van Rossum, Ethan Smith, and Batuhan Taşkaya in :issue:`39481`.)
fr: Voir :pep:`585` pour plus de détails (contribution de *Guido van Rossum*, *Ethan Smith* et *Batuhan Taşkaya* dans :issue:`39481`).

source: New Parser
fr: Nouvel analyseur syntaxique

source: Python 3.9 uses a new parser, based on `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_ instead of `LL(1) <https://en.wikipedia.org/wiki/LL_parser>`_. The new parser's performance is roughly comparable to that of the old parser, but the PEG formalism is more flexible than LL(1) when it comes to designing new language features. We'll start using this flexibility in Python 3.10 and later.
fr: Python 3.9 utilise un nouvel analyseur syntaxique, basé sur `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_ au lieu de `LL(1) <https://fr.wikipedia.org/wiki/Analyse_LL>`_. Les performances du nouvel analyseur sont à peu près comparables à celles de l'ancien, mais le formalisme *PEG* est plus souple que *LL(1)* lorsqu'il s'agit de concevoir des nouvelles fonctionnalités du langage. Nous commencerons à utiliser cette flexibilité dans Python 3.10 et les versions suivantes.

source: The :mod:`ast` module uses the new parser and produces the same AST as the old parser.
fr: Le module :mod:`ast` utilise le nouvel analyseur syntaxique et produit le même AST que l'ancien analyseur.

source: In Python 3.10, the old parser will be deleted and so will all functionality that depends on it (primarily the :mod:`parser` module, which has long been deprecated). In Python 3.9 *only*, you can switch back to the LL(1) parser using a command line switch (``-X oldparser``) or an environment variable (``PYTHONOLDPARSER=1``).
fr: Dans Python 3.10, l'ancien analyseur sera supprimé ainsi que toutes les fonctionnalités qui en dépendent (principalement le module :mod:`parser`, qui est obsolète depuis longtemps). En Python 3.9 *seulement*, vous pouvez revenir à l'analyseur *LL(1)* en utilisant une option en ligne de commande (``-X oldparser``) ou une variable d'environnement (``PYTHONOLDPARSER=1``).

source: See :pep:`617` for more details. (Contributed by Guido van Rossum, Pablo Galindo and Lysandros Nikolaou in :issue:`40334`.)
fr: Voir :pep:`617` pour plus de détails (contribution de *Guido van Rossum*, *Pablo Galindo* et *Lysandros Nikolaou* dans :issue:`40334`).

source: Other Language Changes
fr: Autres changements au langage

source: :func:`__import__` now raises :exc:`ImportError` instead of :exc:`ValueError`, which used to occur when a relative import went past its top-level package. (Contributed by Ngalim Siregar in :issue:`37444`.)
fr: :func:`__import__` lève maintenant :exc:`ImportError` plutôt que :exc:`ValueError`, ce qui se produisait lorsqu’un import relatif remontait plus loin que le répertoire racine du paquet (contribution de *Ngalim Siregar* dans :issue:`37444`).

source: Python now gets the absolute path of the script filename specified on the command line (ex: ``python3 script.py``): the ``__file__`` attribute of the :mod:`__main__` module became an absolute path, rather than a relative path. These paths now remain valid after the current directory is changed by :func:`os.chdir`. As a side effect, the traceback also displays the absolute path for :mod:`__main__` module frames in this case. (Contributed by Victor Stinner in :issue:`20443`.)
fr: Python récupère maintenant le chemin absolu du nom de fichier du script spécifié sur la ligne de commande (ex. : ``python3 script.py``) : l'attribut ``__file__`` du module :mod:`__main__` est devenu un chemin absolu, plutôt qu'un chemin relatif. Ces nouveaux chemins restent valides même après que le répertoire courant est changé par :func:`os.chdir`. En conséquence, les traces d'appels affichent le chemin absolu pour les cadres du module :mod:`__main__` dans ce cas (contribution de *Victor Stinner* dans :issue:`20443`).

source: In the :ref:`Python Development Mode <devmode>` and in :ref:`debug build <debug-build>`, the *encoding* and *errors* arguments are now checked for string encoding and decoding operations. Examples: :func:`open`, :meth:`str.encode` and :meth:`bytes.decode`.
fr: Dans le :ref:`mode de développement de Python <devmode>` et dans les :ref:`compilations en mode débogage <debug-build>`, les arguments *encoding* et *errors* sont maintenant vérifiés pour les opérations d'encodage et de décodage de chaînes. Exemples : :func:`open`, :meth:`str.encode` et :meth:`bytes.decode`.

source: By default, for best performance, the *errors* argument is only checked at the first encoding/decoding error and the *encoding* argument is sometimes ignored for empty strings. (Contributed by Victor Stinner in :issue:`37388`.)
fr: Par défaut, afin d'améliorer les performances, l'argument *errors* n'est consulté qu'au moment de la première erreur d'encodage-décodage et l'argument *encoding* est parfois ignoré pour les chaînes vides (contribution de *Victor Stinner* dans :issue:`37388`).

source: ``"".replace("", s, n)`` now returns ``s`` instead of an empty string for all non-zero ``n``. It is now consistent with ``"".replace("", s)``. There are similar changes for :class:`bytes` and :class:`bytearray` objects. (Contributed by Serhiy Storchaka in :issue:`28029`.)
fr: ``"".replace("", s, n)`` renvoie maintenant ``s`` plutôt qu'une chaîne vide pour toute valeur non-nulles de ``n``. Ce comportement est maintenant cohérent avec ``"".replace("", s)``. Les instances de :class:`bytes` et :class:`bytearray` ont le même comportement (contribution de *Serhiy Storchaka* dans :issue:`28029`).

source: Any valid expression can now be used as a :term:`decorator`. Previously, the grammar was much more restrictive. See :pep:`614` for details. (Contributed by Brandt Bucher in :issue:`39702`.)
fr: Toute expression valide peut maintenant être utilisée comme décorateur (voir :term:`decorator`). Préalablement, la grammaire était beaucoup plus contraignante. Voir :pep:`614` pour les détails (contributions de *Brandt Bucher* dans :issue:`39702`).

source: Improved help for the :mod:`typing` module. Docstrings are now shown for all special forms and special generic aliases (like ``Union`` and ``List``). Using :func:`help` with generic alias like ``List[int]`` will show the help for the correspondent concrete type (``list`` in this case). (Contributed by Serhiy Storchaka in :issue:`40257`.)
fr: Aide améliorée pour le module :mod:`typing`. La documentation est maintenant visible pour toutes les formes spéciales et les alias générique spéciaux (comme ``Union`` et ``List``). Utiliser :func:`help` sur un alias générique comme ``List[int]`` montre l'aide correspondant au type réel (``list`` dans ce cas). (Contribution de Serhiy Storchaka dans :issue:`40257`).

source: Parallel running of :meth:`~agen.aclose` / :meth:`~agen.asend` / :meth:`~agen.athrow` is now prohibited, and ``ag_running`` now reflects the actual running status of the async generator. (Contributed by Yury Selivanov in :issue:`30773`.)
fr: L'exécution parallèle de :meth:`~agen.aclose` / :meth:`~agen.asend` / :meth:`~agen.athrow` est maintenant interdite, et ``ag_running`` reflète maintenant le statut réel du générateur asynchrone. (Contribué par Yury Selivanov dans :issue:`30773`.)

source: Unexpected errors in calling the ``__iter__`` method are no longer masked by ``TypeError`` in the :keyword:`in` operator and functions :func:`~operator.contains`, :func:`~operator.indexOf` and :func:`~operator.countOf` of the :mod:`operator` module. (Contributed by Serhiy Storchaka in :issue:`40824`.)
fr: Les erreurs inattendues lors d'un appel de la méthode ``__iter__`` ne sont plus masquées par ``TypeError`` dans l'opérateur :keyword:`in` et les fonctions :func:`~operator.contains`, :func:`~operator.indexOf` et :func:`~operator.countOf` du module :mod:`operator`. (Contribué par Serhiy Storchaka dans :issue:`40824`.)

source: Unparenthesized lambda expressions can no longer be the expression part in an ``if`` clause in comprehensions and generator expressions. See :issue:`41848` and :issue:`43755` for details.
fr: Les expressions lambda sans parenthèses ne peuvent plus être la partie expression dans une clause ``if`` dans les compréhensions de liste et les expressions de générateur. Voir :issue:`41848` et :issue:`43755` pour plus de détails.

source: New Modules
fr: Nouveaux modules

source: The :mod:`zoneinfo` module brings support for the IANA time zone database to the standard library. It adds :class:`zoneinfo.ZoneInfo`, a concrete :class:`datetime.tzinfo` implementation backed by the system's time zone data.
fr: Le module :mod:`zoneinfo` ajoute la prise en charge de la base de donnée des fuseaux horaires de l'IANA dans la bibliothèque standard. Il ajoute :class:`zoneinfo.ZoneInfo`, une implémentation concrète de :class:`datetime.tzinfo` à partir des données de fuseaux horaires du système.

source: As a fall-back source of data for platforms that don't ship the IANA database, the |tzdata|_ module was released as a first-party package -- distributed via PyPI and maintained by the CPython core team.
fr: Comme option de rabat pour les plateformes qui n'incluent pas la base de donnée de l'IANA, le module quasi-natif |tzdata|_ été publié –– il est distribué sur PyPI et maintenu par l'équipe principale de CPython.

source: :pep:`615` -- Support for the IANA Time Zone Database in the Standard Library
fr: :pep:`615` — Prise en charge de la base de donnée des fuseaux horaires de l'IANA dans la bibliothèque standard

source: PEP written and implemented by Paul Ganssle
fr: PEP écrit et implémenté par *Paul Ganssle*

source: A new module, :mod:`graphlib`, was added that contains the :class:`graphlib.TopologicalSorter` class to offer functionality to perform topological sorting of graphs. (Contributed by Pablo Galindo, Tim Peters and Larry Hastings in :issue:`17005`.)
fr: Un nouveau module, :mod:`graphlib`, a été ajouté. Il contient la classe :class:`graphlib.TopologicalSorter` qui offre des fonctionnalités pour faire le tri topologique de graphes (contribution de *Pablo Galindo*, *Tim Peters* et *Larry Hastings* dans :issue:`17005`).

source: Improved Modules
fr: Modules améliorés

source: Added the *indent* option to :func:`~ast.dump` which allows it to produce a multiline indented output. (Contributed by Serhiy Storchaka in :issue:`37995`.)
fr: Ajout de l'option *indent* à :func:`~ast.dump` qui permet de produire une sortie multi-ligne indentée (contribution de *Serhiy Storchaka* dans :issue:`37995`).

source: Added :func:`ast.unparse` as a function in the :mod:`ast` module that can be used to unparse an :class:`ast.AST` object and produce a string with code that would produce an equivalent :class:`ast.AST` object when parsed. (Contributed by Pablo Galindo and Batuhan Taskaya in :issue:`38870`.)
fr: Ajout de la fonction :func:`ast.unparse` au module :mod:`ast` pour renverser l'analyse syntaxique d'un objet :class:`ast.AST` et produire une chaîne de code qui produirait un :class:`ast.AST` équivalent lorsqu'il est analysé (contribution de *Pablo Galindo* et *Batuhan Taskaya* dans :issue:`38870`).

source: Added docstrings to AST nodes that contains the ASDL signature used to construct that node. (Contributed by Batuhan Taskaya in :issue:`39638`.)
fr: Ajout de chaînes de documentation aux nœuds AST qui contiennent les signatures *ASDL* utilisées pour construire ce nœud (contribution de *Batuhan Taskaya* dans :issue:`39638`).

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
fr: En raison de problèmes de sécurité importants, le paramètre *reuse_address* de :meth:`asyncio.loop.create_datagram_endpoint` n'est plus supporté. C'est à cause du comportement de l'option socket ``SO_REUSEADDR`` en UDP. Pour plus de détails, voir la documentation de ``loop.create_datagram_endpoint()``. (Contribué par Kyle Stanley, Antoine Pitrou, et Yury Selivanov dans :issue:`37228`.)

source: Added a new :term:`coroutine` :meth:`~asyncio.loop.shutdown_default_executor` that schedules a shutdown for the default executor that waits on the :class:`~concurrent.futures.ThreadPoolExecutor` to finish closing. Also, :func:`asyncio.run` has been updated to use the new :term:`coroutine`. (Contributed by Kyle Stanley in :issue:`34037`.)
fr: Ajout d'une nouvelle :term:`coroutine` :meth:`~asyncio.loop.shutdown_default_executor` qui programme une extinction de l'exécuteur par défaut qui attend que :class:`~concurrent.futures.ThreadPoolExecutor` se termine. Aussi, :func:`asyncio.run` à été mis à jour pour utiliser la nouvelle :term:`coroutine`. (Contribué par Kyle Stanley dans :issue:`34037`.)
