Repository: python/python-docs-fr
Catalog: whatsnew/3.9.po
Languages: fr

source: The C function ``PyGen_NeedsFinalizing`` has been removed. It was not documented, tested, or used anywhere within CPython after the implementation of :pep:`442`. Patch by Joannah Nanjekye. (Contributed by Joannah Nanjekye in :issue:`15088`)
fr: La fonction C ``PyGen_NeedsFinalizing`` a été retirée. Elle n'était pas documentée, testée ou utilisée où que ce soit dans CPython après l'implémentation de :pep:`442` (contribution de *Joannah Nanjekye* dans :issue:`15088`).

source: ``base64.encodestring()`` and ``base64.decodestring()``, aliases deprecated since Python 3.1, have been removed: use :func:`base64.encodebytes` and :func:`base64.decodebytes` instead. (Contributed by Victor Stinner in :issue:`39351`.)
fr: ``base64.encodestring()`` et ``base64.decodestring()``, des alias obsolètes depuis Python 3.1, ont été retirées : utilisez plutôt :func:`base64.encodebytes` et :func:`base64.decodebytes` (contribution de *Victor Stinner* dans :issue:`39351`).

source: ``fractions.gcd()`` function has been removed, it was deprecated since Python 3.5 (:issue:`22486`): use :func:`math.gcd` instead. (Contributed by Victor Stinner in :issue:`39350`.)
fr: La fonction ``fractions.gcd()`` a été retirée, elle était obsolète depuis Python 3.5 (:issue:`22486`) : utilisez plutôt :func:`math.gcd` (contribution de *Victor Stinner* dans :issue:`39350`).

source: The *buffering* parameter of :class:`bz2.BZ2File` has been removed. Since Python 3.0, it was ignored and using it emitted a :exc:`DeprecationWarning`. Pass an open file object to control how the file is opened. (Contributed by Victor Stinner in :issue:`39357`.)
fr: Le paramètre *buffering* de la classe :class:`bz2.BZ2File` a été retiré. Depuis Python 3.0, il était ignoré et son utilisation levait un :exc:`DeprecationWarning`. Passez un objet fichier déjà ouvert pour déterminer comment le fichier sera ouvert (contribution de *Victor Stinner* dans :issue:`39357`).

source: The *encoding* parameter of :func:`json.loads` has been removed. As of Python 3.1, it was deprecated and ignored; using it has emitted a :exc:`DeprecationWarning` since Python 3.8. (Contributed by Inada Naoki in :issue:`39377`)
fr: Le paramètre *encoding* de :func:`json.loads` a été retiré. À partir de Python 3.1, il était obsolète et ignoré ; son utilisation levait un :exc:`DeprecationWarning` depuis Python 3.8 (contribution de *Inada Naoki* dans :issue:`39377`).

source: ``with (await asyncio.lock):`` and ``with (yield from asyncio.lock):`` statements are not longer supported, use ``async with lock`` instead. The same is correct for ``asyncio.Condition`` and ``asyncio.Semaphore``. (Contributed by Andrew Svetlov in :issue:`34793`.)
fr: Les instructions ``with (await asyncio.lock):`` et ``with (yield from asyncio.lock):`` ne sont plus prises en charge, utilisez plutôt ``async with lock``. De même pour ``asyncio.Condition`` et ``asyncio.Semaphore`` (contribution de *Andrew Svetlov* dans :issue:`34793`).

source: The :func:`sys.getcounts` function, the ``-X showalloccount`` command line option and the ``show_alloc_count`` field of the C structure :c:type:`PyConfig` have been removed. They required a special Python build by defining ``COUNT_ALLOCS`` macro. (Contributed by Victor Stinner in :issue:`39489`.)
fr: La fonction :func:`sys.getcounts`, l'option de ligne de commande ``-X showalloccount`` et le champ ``show_alloc_count`` de la structure C :c:type:`PyConfig` ont été retirés. Ils dépendaient d'une compilation spéciale de Python en définissant la macro ``COUNT_ALLOCS`` (contribution de *Victor Stinner* dans :issue:`39489`).

source: The ``_field_types`` attribute of the :class:`typing.NamedTuple` class has been removed. It was deprecated since Python 3.8. Use the ``__annotations__`` attribute instead. (Contributed by Serhiy Storchaka in :issue:`40182`.)
fr: L'attribut ``_field_types`` de la classe :class:`typing.NamedTuple` a été retiré. Il était obsolète depuis Python 3.8. Utilisez plutôt l'attribut ``__annotations__`` (contribution de *Serhiy Storchaka* dans :issue:`40182`).

source: The :meth:`symtable.SymbolTable.has_exec` method has been removed. It was deprecated since 2006, and only returning ``False`` when it's called. (Contributed by Batuhan Taskaya in :issue:`40208`)
fr: La méthode :meth:`symtable.SymbolTable.has_exec` a été retirée. Elle était obsolète depuis 2006 et ne renvoyait que ``False`` lorsqu'elle était appelée (contribution de *Batuhan Taskaya* dans :issue:`40208`).

source: The :meth:`asyncio.Task.current_task` and :meth:`asyncio.Task.all_tasks` have been removed. They were deprecated since Python 3.7 and you can use :func:`asyncio.current_task` and :func:`asyncio.all_tasks` instead. (Contributed by Rémi Lapeyre in :issue:`40967`)
fr: Les méthodes :meth:`asyncio.Task.current_task` et :meth:`asyncio.Task.all_tasks` ont été retirées. Elles étaient obsolètes depuis Python 3.7. Utilisez plutôt :func:`asyncio.current_task` et :func:`asyncio.all_tasks` (contribution de *Rémi Lapeyre* dans :issue:`40967`).

source: The ``unescape()`` method in the :class:`html.parser.HTMLParser` class has been removed (it was deprecated since Python 3.4). :func:`html.unescape` should be used for converting character references to the corresponding unicode characters.
fr: La méthode ``unescape()`` de la classe :class:`html.parser.HTMLParser` a été retirée (elle était obsolète depuis Python 3.4). :func:`html.unescape` doit être utilisée pour convertir les références de caractère en leurs caractères Unicode correspondants.

source: Porting to Python 3.9
fr: Portage vers Python 3.9

source: This section lists previously described changes and other bugfixes that may require changes to your code.
fr: Cette section liste les changements mentionnés préalablement et d'autres améliorations qui peuvent demander des changements à votre code.

source: Changes in the Python API
fr: Changements dans l'API Python

source: :func:`__import__` and :func:`importlib.util.resolve_name` now raise :exc:`ImportError` where it previously raised :exc:`ValueError`. Callers catching the specific exception type and supporting both Python 3.9 and earlier versions will need to catch both using ``except (ImportError, ValueError):``.
fr: :func:`__import__` et :func:`importlib.util.resolve_name` lèvent maintenant :exc:`ImportError` où elles levaient précédemment :exc:`ValueError`. Les appelants qui attrapent les types spécifiques d'exceptions et qui prennent à la fois en charge Python 3.9 et des versions précédentes doivent attraper les deux types avec ``except (ImportError, ValueError):``.

source: The :mod:`venv` activation scripts no longer special-case when ``__VENV_PROMPT__`` is set to ``""``.
fr: Il n'y a plus de traitement spécial dans les scriptes d'activation de :mod:`venv` quand ``__VENV_PROMPT__`` est mis à ``""``.

source: The :meth:`select.epoll.unregister` method no longer ignores the :data:`~errno.EBADF` error. (Contributed by Victor Stinner in :issue:`39239`.)
fr: La méthode :meth:`select.epoll.unregister` n'ignore plus l'erreur :data:`~errno.EBADF` (contribution de *Victor Stinner* dans :issue:`39239`).

source: The *compresslevel* parameter of :class:`bz2.BZ2File` became keyword-only, since the *buffering* parameter has been removed. (Contributed by Victor Stinner in :issue:`39357`.)
fr: Le paramètre *compresslevel* de :class:`bz2.BZ2File` est devenu exclusivement nommé (*keyword-only*) puisque le paramètre *buffering* a été retiré (contribution de *Victor Stinner* in :issue:`39357`).

source: Simplified AST for subscription. Simple indices will be represented by their value, extended slices will be represented as tuples. ``Index(value)`` will return a ``value`` itself, ``ExtSlice(slices)`` will return ``Tuple(slices, Load())``. (Contributed by Serhiy Storchaka in :issue:`34822`.)
fr: Simplification de l'*AST* pour les souscriptions. Les indexations simples seront représentées par leur valeur, les tranches étendues seront représentées par des n-uplets. ``Index(value)`` va renvoyer ``value`` elle-même, ``ExtSlice(slices)`` va renvoyer ``Tuple(slices, Load())`` (contribution de *Serhiy Storchaka* dans :issue:`34822`).

source: The :mod:`importlib` module now ignores the :envvar:`PYTHONCASEOK` environment variable when the :option:`-E` or :option:`-I` command line options are being used.
fr: Le module :mod:`importlib` ignore maintenant la variable d’environnement :envvar:`PYTHONCASEOK` quand les options de ligne de commande :option:`-E` ou :option:`-I` sont utilisées.

source: The *encoding* parameter has been added to the classes :class:`ftplib.FTP` and :class:`ftplib.FTP_TLS` as a keyword-only parameter, and the default encoding is changed from Latin-1 to UTF-8 to follow :rfc:`2640`.
fr: Le paramètre *encoding* a été ajouté aux classes :class:`ftplib.FTP` et :class:`ftplib.FTP_TLS` en paramètre exclusivement nommé et l'encodage par défaut est passé de *Latin-1* à *UTF-8* en conformité à :rfc:`2640`.

source: :meth:`asyncio.loop.shutdown_default_executor` has been added to :class:`~asyncio.AbstractEventLoop`, meaning alternative event loops that inherit from it should have this method defined. (Contributed by Kyle Stanley in :issue:`34037`.)
fr: :meth:`asyncio.loop.shutdown_default_executor` a été ajouté à :class:`~asyncio.AbstractEventLoop`, donc les boucles d'événements alternatives qui héritent de celle-ci devraient définir cette méthode (contribution de *Kyle Stanley* dans :issue:`34037`).

source: The constant values of future flags in the :mod:`__future__` module is updated in order to prevent collision with compiler flags. Previously ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` was clashing with ``CO_FUTURE_DIVISION``. (Contributed by Batuhan Taskaya in :issue:`39562`)
fr: Les valeurs constantes des drapeaux futurs du module :mod:`__future__` sont mises à jour pour éviter les collisions avec les drapeaux du compilateur. Précédemment, ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` était en collision avec ``CO_FUTURE_DIVISION`` (contribution de *Batuhan Taskaya* dans :issue:`39562`).

source: ``array('u')`` now uses ``wchar_t`` as C type instead of ``Py_UNICODE``. This change doesn't affect to its behavior because ``Py_UNICODE`` is alias of ``wchar_t`` since Python 3.3. (Contributed by Inada Naoki in :issue:`34538`.)
fr: ``array('u')`` utilise maintenant le type C ``wchar_t`` plutôt que ``Py_UNICODE``. Ceci ne change pas son comportement puisque ``Py_UNICODE`` est un alias de ``wchar_t`` depuis Python 3.3 (contribution de *Inada Naoki* dans :issue:`34538`).

source: The :func:`logging.getLogger` API now returns the root logger when passed the name ``'root'``, whereas previously it returned a non-root logger named ``'root'``. This could affect cases where user code explicitly wants a non-root logger named ``'root'``, or instantiates a logger using ``logging.getLogger(__name__)`` in some top-level module called ``'root.py'``. (Contributed by Vinay Sajip in :issue:`37742`.)
fr: L'API :func:`logging.getLogger` renvoie maintenant le journaliseur racine quand on lui passe le nom ``'root'``, alors que préalablement il renvoyait un journaliseur non-racine appelé ``'root'``. Ceci peut affecter les cas où le code de l'utilisateur veut explicitement un journaliseur non-racine appelé ``'root'``, ou instancie un journaliseur avec ``logging.getLogger(__name__)`` dans un module de niveau principal appelé ``'root.py'`` (contribution de *Vinay Sajip* dans :issue:`37742`).

source: Division handling of :class:`~pathlib.PurePath` now returns ``NotImplemented`` instead of raising a :exc:`TypeError` when passed something other than an instance of ``str`` or :class:`~pathlib.PurePath`. This allows creating compatible classes that don't inherit from those mentioned types. (Contributed by Roger Aiudi in :issue:`34775`).
fr: La gestion de la division de :class:`~pathlib.PurePath` renvoie maintenant ``NotImplemented`` plutôt que de lever une :exc:`TypeError` lorsqu'on passe une valeur autre qu'une instance de ``str`` ou :class:`~pathlib.PurePath`. Ceci permet la création de classes compatibles qui n'héritent pas de ces types (contribution de *Roger Aiudi* dans :issue:`34775`.)

source: Changes in the C API
fr: Changements dans l'API C

source: Instances of :ref:`heap-allocated types <heap-types>` (such as those created with :c:func:`PyType_FromSpec` and similar APIs) hold a reference to their type object since Python 3.8. As indicated in the "Changes in the C API" of Python 3.8, for the vast majority of cases, there should be no side effect but for types that have a custom :c:member:`~PyTypeObject.tp_traverse` function, ensure that all custom ``tp_traverse`` functions of heap-allocated types visit the object's type.
fr: Les instances de :ref:`types alloués sur le tas <heap-types>` (tels que ceux créés avec :c:func:`PyType_FromSpec` et les APIs similaires) gardent une référence à leur objet type depuis Python 3.8. Tel qu'indiqué dans "Changements à l'API C" de Python 3.8, pour la grande majorité des cas, il ne devrait pas y avoir d'effets secondaires sauf pour les types qui ont une fonction :c:member:`~PyTypeObject.tp_traverse` personnalisée. Assurez-vous que toutes les fonctions ``tp_traverse`` personnalisées des types alloués sur le tas visitent le type de l'objet.

source: If your traverse function delegates to ``tp_traverse`` of its base class (or another type), ensure that ``Py_TYPE(self)`` is visited only once. Note that only :ref:`heap type <heap-types>` are expected to visit the type in ``tp_traverse``.
fr: Si votre fonction de traversée délègue à la ``tp_traverse`` de sa classe de base (ou d'un autre type), assurez-vous que ``Py_TYPE(self)`` ne soit visité qu'une seule fois. Prenez note que seuls les :ref:`types du tas <heap-types>` doivent visiter leur type dans ``tp_traverse``.

source: For example, if your ``tp_traverse`` function includes:
fr: Par exemple, si votre fonction ``tp_traverse`` inclut :

source: then add:
fr: alors ajoutez :

source: (See :issue:`35810` and :issue:`40217` for more information.)
fr: (Voir :issue:`35810` et :issue:`40217` pour plus d'information.)

source: The functions ``PyEval_CallObject``, ``PyEval_CallFunction``, ``PyEval_CallMethod`` and ``PyEval_CallObjectWithKeywords`` are deprecated. Use :c:func:`PyObject_Call` and its variants instead. (See more details in :issue:`29548`.)
fr: Les fonctions ``PyEval_CallObject``, ``PyEval_CallFunction``, ``PyEval_CallMethod`` et ``PyEval_CallObjectWithKeywords`` sont obsolètes. Utilisez plutôt :c:func:`PyObject_Call` et ses variantes. (Pour plus de détails, voir :issue:`29548`.)

source: CPython bytecode changes
fr: Changements au code intermédiaire CPython

source: The :opcode:`LOAD_ASSERTION_ERROR` opcode was added for handling the :keyword:`assert` statement. Previously, the assert statement would not work correctly if the :exc:`AssertionError` exception was being shadowed. (Contributed by Zackery Spytz in :issue:`34880`.)
fr: Le code d'opération :opcode:`LOAD_ASSERTION_ERROR` a été ajouté pour gérer l'instruction :keyword:`assert`. Précédemment, l'instruction ``assert`` ne fonctionnait pas correctement si l'exception :exc:`AssertionError` était masquée (contribution de *Zackery Spytz* dans :issue:`34880`).

source: The :opcode:`COMPARE_OP` opcode was split into four distinct instructions:
fr: Le code d'opération :opcode:`COMPARE_OP` a été séparé en quatre instructions distinctes :

source: ``COMPARE_OP`` for rich comparisons
fr: ``COMPARE_OP`` pour les comparaisons avancées ;

source: ``IS_OP`` for 'is' and 'is not' tests
fr: ``IS_OP`` pour les tests *is* et *is not* ;

source: ``CONTAINS_OP`` for 'in' and 'not in' tests
fr: ``CONTAINS_OP`` pour les tests *in* et *not in* ;

source: ``JUMP_IF_NOT_EXC_MATCH`` for checking exceptions in 'try-except' statements.
fr: ``JUMP_IF_NOT_EXC_MATCH`` pour vérifier les exceptions dans les instructions ``try-except``.

source: (Contributed by Mark Shannon in :issue:`39156`.)
fr: (contribution de *Mark Shannon* dans :issue:`39156`).

source: Build Changes
fr: Changements à la compilation

source: Added ``--with-platlibdir`` option to the ``configure`` script: name of the platform-specific library directory, stored in the new :attr:`sys.platlibdir` attribute. See :attr:`sys.platlibdir` attribute for more information. (Contributed by Jan Matějek, Matěj Cepl, Charalampos Stratakis and Victor Stinner in :issue:`1294959`.)
fr: Ajout de l'option ``--with-platlibdir`` au script ``configure`` : nom de répertoire des bibliothèques spécifique à la plateforme, stocké dans le nouvel attribut :attr:`sys.platlibdir`. Voir l'attribut :attr:`sys.platlibdir` pour plus d'informations (contribution de *Jan Matějek*, *Matěj Cepl*, *Charalampos Stratakis* et *Victor Stinner* dans :issue:`1294959`).

source: The ``COUNT_ALLOCS`` special build macro has been removed. (Contributed by Victor Stinner in :issue:`39489`.)
fr: La macro spéciale de compilation ``COUNT_ALLOCS`` a été retirée (contribution de *Victor Stinner* dans :issue:`39489`).

source: On non-Windows platforms, the :c:func:`setenv` and :c:func:`unsetenv` functions are now required to build Python. (Contributed by Victor Stinner in :issue:`39395`.)
fr: Sur les plateformes non-Windows, les fonctions :c:func:`setenv` et :c:func:`unsetenv` sont maintenant nécessaires à la compilation de Python (contribution de *Victor Stinner* dans :issue:`39395`).

source: On non-Windows platforms, creating ``bdist_wininst`` installers is now officially unsupported. (See :issue:`10945` for more details.)
fr: Sur les plateformes non-Windows, la création d'installateurs ``bdist_wininst`` n'est maintenant officiellement plus pris en charge. (Voir :issue:`10945` pour plus de détails.)

source: Python can now be built for Windows 10 ARM64. (Contributed by Steve Dower in :issue:`33125`.)
fr: Python peut maintenant être compilé pour *Windows 10 ARM64* (contribution de *Steve Dower* dans :issue:`33125`).

source: Some individual tests are now skipped when ``--pgo`` is used. The tests in question increased the PGO task time significantly and likely didn't help improve optimization of the final executable. This speeds up the task by a factor of about 15x. Running the full unit test suite is slow. This change may result in a slightly less optimized build since not as many code branches will be executed. If you are willing to wait for the much slower build, the old behavior can be restored using ``./configure [..] PROFILE_TASK="-m test --pgo-extended"``. We make no guarantees as to which PGO task set produces a faster build. Users who care should run their own relevant benchmarks as results can depend on the environment, workload, and compiler tool chain. (See :issue:`36044` and :issue:`37707` for more details.)
fr: Certains tests individuels sont maintenant ignorés lorsque ``--pgo`` est utilisé. Les tests en question augmentaient la durée de la tâche *PGO* de manière significative et n'optimisaient probablement pas l'exécutable final. Cela accélère la tâche par un facteur d'environ 15 fois. Le fait de lancer la suite de tests est lent. Ce changement va peut être avoir pour conséquence des exécutables compilés un peu moins optimisés car moins de branches de code seront exécutées. Si vous souhaitez attendre avec une compilation plus lente, l'ancienne manière de fonctionner peut être obtenue avec ``./configure [..] PROFILE_TASK="-m test --pgo-extended"``. Nous ne garantissons pas quel set de tâches PGO produira une compilation plus rapide. Les utilisateurs qui s'y intéressent devraient exécuter leurs propres *benchmarks*, car les résultats peuvent dépendre de l'environnement, de la charge de travail et de la chaîne d'outils du compilateur. (Voir :issue:`36044` et :issue:`37707` pour plus de détails.)

source: C API Changes
fr: Changements à l'API C

source: :pep:`573`: Added :c:func:`PyType_FromModuleAndSpec` to associate a module with a class; :c:func:`PyType_GetModule` and :c:func:`PyType_GetModuleState` to retrieve the module and its state; and :c:data:`PyCMethod` and :c:data:`METH_METHOD` to allow a method to access the class it was defined in. (Contributed by Marcel Plch and Petr Viktorin in :issue:`38787`.)
fr: :pep:`573` : Ajout de :c:func:`PyType_FromModuleAndSpec` pour associer un module à une classe ; :c:func:`PyType_GetModule` et :c:func:`PyType_GetModuleState` pour récupérer le module et son état ; et :c:data:`PyCMethod` et :c:data:`METH_METHOD` pour permettre à une méthode de récupérer la classe dans laquelle elle a été définie (contribution de *Marcel Plch* et *Petr Viktorin* dans :issue:`38787`).

source: Added :c:func:`PyFrame_GetCode` function: get a frame code. Added :c:func:`PyFrame_GetBack` function: get the frame next outer frame. (Contributed by Victor Stinner in :issue:`40421`.)
fr: Ajout de la fonction :c:func:`PyFrame_GetCode` : récupérer le code d'un cadre. Ajout de la fonction :c:func:`PyFrame_GetBack` : récupérer le prochain cadre englobant (contribution de *Victor Stinner* dans :issue:`40421`).

source: Added :c:func:`PyFrame_GetLineNumber` to the limited C API. (Contributed by Victor Stinner in :issue:`40421`.)
fr: Ajout de :c:func:`PyFrame_GetLineNumber` à l'API C limité (contribution de *Victor Stinner* dans :issue:`40421`).

source: Added :c:func:`PyThreadState_GetInterpreter` and :c:func:`PyInterpreterState_Get` functions to get the interpreter. Added :c:func:`PyThreadState_GetFrame` function to get the current frame of a Python thread state. Added :c:func:`PyThreadState_GetID` function: get the unique identifier of a Python thread state. (Contributed by Victor Stinner in :issue:`39947`.)
fr: Ajout des fonctions :c:func:`PyThreadState_GetInterpreter` et :c:func:`PyInterpreterState_Get` pour récupérer l'interpréteur. Ajout de la fonction :c:func:`PyThreadState_GetFrame` pour récupérer le cadre de l'état d'un fil d'exécution Python. Ajout de la fonction :c:func:`PyThreadState_GetID` : récupérer l'identifiant unique de l'état d'un fil d'exécution Python (contribution de *Victor Stinner* dans :issue:`39947`).

source: Added a new public :c:func:`PyObject_CallNoArgs` function to the C API, which calls a callable Python object without any arguments. It is the most efficient way to call a callable Python object without any argument. (Contributed by Victor Stinner in :issue:`37194`.)
fr: Ajout de la nouvelle fonction publique :c:func:`PyObject_CallNoArgs` à l'API C, qui appelle un objet Python appelable sans aucun argument. C'est la façon la plus efficace d'appeler un objet Python appelable sans aucun argument (contribution de *Victor Stinner* dans :issue:`37194`).

source: Changes in the limited C API (if ``Py_LIMITED_API`` macro is defined):
fr: Changements dans l'API C limité (si la macro ``Py_LIMITED_API`` est définie) :

source: Provide :c:func:`Py_EnterRecursiveCall` and :c:func:`Py_LeaveRecursiveCall` as regular functions for the limited API. Previously, there were defined as macros, but these macros didn't compile with the limited C API which cannot access ``PyThreadState.recursion_depth`` field (the structure is opaque in the limited C API).
fr: Fournit :c:func:`Py_EnterRecursiveCall` et :c:func:`Py_LeaveRecursiveCall` comme fonctions régulières pour l'API limité. Précédemment, elles étaient définies en tant que macros, mais ces macros n'étaient pas compilées avec l'API C limité qui ne peut pas accéder au champ ``PyThreadState.recursion_depth`` (la structure est opaque à l'API C limité) ;

source: ``PyObject_INIT()`` and ``PyObject_INIT_VAR()`` become regular "opaque" function to hide implementation details.
fr: ``PyObject_INIT()`` et ``PyObject_INIT_VAR()`` deviennent des fonctions "opaques" régulières pour cacher les détails d'implémentation

source: (Contributed by Victor Stinner in :issue:`38644` and :issue:`39542`.)
fr: (contribution de *Victor Stinner* dans :issue:`38644` et :issue:`39542`).
