Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-23703 <https://bugs.python.org/issue23703>`__: Fix a regression in urljoin() introduced in 901e4e52b20a. Patch by Demian Brecht.
fr: `bpo-23703 <https://bugs.python.org/23703>`__: Fix a regression in urljoin() introduced in 901e4e52b20a. Patch by Demian Brecht.

source: `bpo-4254 <https://bugs.python.org/issue4254>`__: Adds _curses.update_lines_cols(). Patch by Arnon Yaari
fr: `bpo-4254 <https://bugs.python.org/4254>`__: Adds _curses.update_lines_cols(). Patch by Arnon Yaari

source: `bpo-19933 <https://bugs.python.org/issue19933>`__: Provide default argument for ndigits in round. Patch by Vajrasky Kok.
fr: `bpo-19933 <https://bugs.python.org/19933>`__: Provide default argument for ndigits in round. Patch by Vajrasky Kok.

source: `bpo-23193 <https://bugs.python.org/issue23193>`__: Add a numeric_owner parameter to tarfile.TarFile.extract and tarfile.TarFile.extractall. Patch by Michael Vogt and Eric Smith.
fr: `bpo-23193 <https://bugs.python.org/23193>`__: Add a numeric_owner parameter to tarfile.TarFile.extract and tarfile.TarFile.extractall. Patch by Michael Vogt and Eric Smith.

source: `bpo-23342 <https://bugs.python.org/issue23342>`__: Add a subprocess.run() function than returns a CalledProcess instance for a more consistent API than the existing call* functions.
fr: `bpo-23342 <https://bugs.python.org/23342>`__: Add a subprocess.run() function than returns a CalledProcess instance for a more consistent API than the existing call* functions.

source: `bpo-21217 <https://bugs.python.org/issue21217>`__: inspect.getsourcelines() now tries to compute the start and end lines from the code object, fixing an issue when a lambda function is used as decorator argument. Patch by Thomas Ballinger and Allison Kaptur.
fr: `bpo-21217 <https://bugs.python.org/21217>`__: inspect.getsourcelines() now tries to compute the start and end lines from the code object, fixing an issue when a lambda function is used as decorator argument. Patch by Thomas Ballinger and Allison Kaptur.

source: `bpo-24521 <https://bugs.python.org/issue24521>`__: Fix possible integer overflows in the pickle module.
fr: `bpo-24521 <https://bugs.python.org/24521>`__: Fix possible integer overflows in the pickle module.

source: `bpo-22931 <https://bugs.python.org/issue22931>`__: Allow '[' and ']' in cookie values.
fr: `bpo-22931 <https://bugs.python.org/22931>`__: Allow '[' and ']' in cookie values.

source: `bpo-23811 <https://bugs.python.org/issue23811>`__: Add missing newline to the PyCompileError error message. Patch by Alex Shkop.
fr: `bpo-23811 <https://bugs.python.org/23811>`__: Add missing newline to the PyCompileError error message. Patch by Alex Shkop.

source: `bpo-21116 <https://bugs.python.org/issue21116>`__: Avoid blowing memory when allocating a multiprocessing shared array that's larger than 50% of the available RAM. Patch by Médéric Boquien.
fr: `bpo-21116 <https://bugs.python.org/21116>`__: Avoid blowing memory when allocating a multiprocessing shared array that's larger than 50% of the available RAM. Patch by Médéric Boquien.

source: `bpo-22982 <https://bugs.python.org/issue22982>`__: Improve BOM handling when seeking to multiple positions of a writable text file.
fr: `bpo-22982 <https://bugs.python.org/22982>`__: Improve BOM handling when seeking to multiple positions of a writable text file.

source: `bpo-23464 <https://bugs.python.org/issue23464>`__: Removed deprecated asyncio JoinableQueue.
fr: `bpo-23464 <https://bugs.python.org/23464>`__: Removed deprecated asyncio JoinableQueue.

source: `bpo-23529 <https://bugs.python.org/issue23529>`__: Limit the size of decompressed data when reading from GzipFile, BZ2File or LZMAFile. This defeats denial of service attacks using compressed bombs (i.e. compressed payloads which decompress to a huge size). Patch by Martin Panter and Nikolaus Rath.
fr: `bpo-23529 <https://bugs.python.org/23529>`__: Limit the size of decompressed data when reading from GzipFile, BZ2File or LZMAFile. This defeats denial of service attacks using compressed bombs (i.e. compressed payloads which decompress to a huge size). Patch by Martin Panter and Nikolaus Rath.

source: `bpo-21859 <https://bugs.python.org/issue21859>`__: Added Python implementation of io.FileIO.
fr: `bpo-21859 <https://bugs.python.org/21859>`__: Added Python implementation of io.FileIO.

source: `bpo-23865 <https://bugs.python.org/issue23865>`__: close() methods in multiple modules now are idempotent and more robust at shutdown. If they need to release multiple resources, all are released even if errors occur.
fr: `bpo-23865 <https://bugs.python.org/23865>`__: close() methods in multiple modules now are idempotent and more robust at shutdown. If they need to release multiple resources, all are released even if errors occur.

source: `bpo-23400 <https://bugs.python.org/issue23400>`__: Raise same exception on both Python 2 and 3 if sem_open is not available. Patch by Davin Potts.
fr: `bpo-23400 <https://bugs.python.org/23400>`__: Raise same exception on both Python 2 and 3 if sem_open is not available. Patch by Davin Potts.

source: `bpo-10838 <https://bugs.python.org/issue10838>`__: The subprocess now module includes SubprocessError and TimeoutError in its list of exported names for the users wild enough to use ``from subprocess import *``.
fr: `bpo-10838 <https://bugs.python.org/10838>`__: The subprocess now module includes SubprocessError and TimeoutError in its list of exported names for the users wild enough to use ``from subprocess import *``.

source: `bpo-23411 <https://bugs.python.org/issue23411>`__: Added DefragResult, ParseResult, SplitResult, DefragResultBytes, ParseResultBytes, and SplitResultBytes to urllib.parse.__all__. Patch by Martin Panter.
fr: `bpo-23411 <https://bugs.python.org/23411>`__: Added DefragResult, ParseResult, SplitResult, DefragResultBytes, ParseResultBytes, and SplitResultBytes to urllib.parse.__all__. Patch by Martin Panter.

source: `bpo-23881 <https://bugs.python.org/issue23881>`__: urllib.request.ftpwrapper constructor now closes the socket if the FTP connection failed to fix a ResourceWarning.
fr: `bpo-23881 <https://bugs.python.org/23881>`__: urllib.request.ftpwrapper constructor now closes the socket if the FTP connection failed to fix a ResourceWarning.

source: `bpo-23853 <https://bugs.python.org/issue23853>`__: :meth:`socket.socket.sendall` does no more reset the socket timeout each time data is sent successfully. The socket timeout is now the maximum total duration to send all data.
fr: `bpo-23853 <https://bugs.python.org/23853>`__: :meth:`socket.socket.sendall` does no more reset the socket timeout each time data is sent successfully. The socket timeout is now the maximum total duration to send all data.

source: `bpo-22721 <https://bugs.python.org/issue22721>`__: An order of multiline pprint output of set or dict containing orderable and non-orderable elements no longer depends on iteration order of set or dict.
fr: `bpo-22721 <https://bugs.python.org/22721>`__: An order of multiline pprint output of set or dict containing orderable and non-orderable elements no longer depends on iteration order of set or dict.

source: `bpo-15133 <https://bugs.python.org/issue15133>`__: _tkinter.tkapp.getboolean() now supports Tcl_Obj and always returns bool. tkinter.BooleanVar now validates input values (accepted bool, int, str, and Tcl_Obj). tkinter.BooleanVar.get() now always returns bool.
fr: `bpo-15133 <https://bugs.python.org/15133>`__: _tkinter.tkapp.getboolean() now supports Tcl_Obj and always returns bool. tkinter.BooleanVar now validates input values (accepted bool, int, str, and Tcl_Obj). tkinter.BooleanVar.get() now always returns bool.

source: `bpo-10590 <https://bugs.python.org/issue10590>`__: xml.sax.parseString() now supports string argument.
fr: `bpo-10590 <https://bugs.python.org/10590>`__: xml.sax.parseString() now supports string argument.

source: `bpo-23338 <https://bugs.python.org/issue23338>`__: Fixed formatting ctypes error messages on Cygwin. Patch by Makoto Kato.
fr: `bpo-23338 <https://bugs.python.org/23338>`__: Fixed formatting ctypes error messages on Cygwin. Patch by Makoto Kato.

source: `bpo-15582 <https://bugs.python.org/issue15582>`__: inspect.getdoc() now follows inheritance chains.
fr: `bpo-15582 <https://bugs.python.org/15582>`__: inspect.getdoc() now follows inheritance chains.

source: `bpo-2175 <https://bugs.python.org/issue2175>`__: SAX parsers now support a character stream of InputSource object.
fr: `bpo-2175 <https://bugs.python.org/2175>`__: SAX parsers now support a character stream of InputSource object.

source: `bpo-16840 <https://bugs.python.org/issue16840>`__: Tkinter now supports 64-bit integers added in Tcl 8.4 and arbitrary precision integers added in Tcl 8.5.
fr: `bpo-16840 <https://bugs.python.org/16840>`__: Tkinter now supports 64-bit integers added in Tcl 8.4 and arbitrary precision integers added in Tcl 8.5.

source: `bpo-23834 <https://bugs.python.org/issue23834>`__: Fix socket.sendto(), use the C Py_ssize_t type to store the result of sendto() instead of the C int type.
fr: `bpo-23834 <https://bugs.python.org/23834>`__: Fix socket.sendto(), use the C Py_ssize_t type to store the result of sendto() instead of the C int type.

source: `bpo-23618 <https://bugs.python.org/issue23618>`__: :meth:`socket.socket.connect` now waits until the connection completes instead of raising :exc:`InterruptedError` if the connection is interrupted by signals, signal handlers don't raise an exception and the socket is blocking or has a timeout. :meth:`socket.socket.connect` still raise :exc:`InterruptedError` for non-blocking sockets.
fr: `bpo-23618 <https://bugs.python.org/23618>`__: :meth:`socket.socket.connect` now waits until the connection completes instead of raising :exc:`InterruptedError` if the connection is interrupted by signals, signal handlers don't raise an exception and the socket is blocking or has a timeout. :meth:`socket.socket.connect` still raise :exc:`InterruptedError` for non-blocking sockets.

source: `bpo-21526 <https://bugs.python.org/issue21526>`__: Tkinter now supports new boolean type in Tcl 8.5.
fr: `bpo-21526 <https://bugs.python.org/21526>`__: Tkinter now supports new boolean type in Tcl 8.5.

source: `bpo-23836 <https://bugs.python.org/issue23836>`__: Fix the faulthandler module to handle reentrant calls to its signal handlers.
fr: `bpo-23836 <https://bugs.python.org/23836>`__: Fix the faulthandler module to handle reentrant calls to its signal handlers.

source: `bpo-23838 <https://bugs.python.org/issue23838>`__: linecache now clears the cache and returns an empty result on MemoryError.
fr: `bpo-23838 <https://bugs.python.org/23838>`__: linecache now clears the cache and returns an empty result on MemoryError.

source: `bpo-10395 <https://bugs.python.org/issue10395>`__: Added os.path.commonpath(). Implemented in posixpath and ntpath. Based on patch by Rafik Draoui.
fr: `bpo-10395 <https://bugs.python.org/10395>`__: Added os.path.commonpath(). Implemented in posixpath and ntpath. Based on patch by Rafik Draoui.

source: `bpo-23611 <https://bugs.python.org/issue23611>`__: Serializing more "lookupable" objects (such as unbound methods or nested classes) now are supported with pickle protocols < 4.
fr: `bpo-23611 <https://bugs.python.org/23611>`__: Serializing more "lookupable" objects (such as unbound methods or nested classes) now are supported with pickle protocols < 4.

source: `bpo-13583 <https://bugs.python.org/issue13583>`__: sqlite3.Row now supports slice indexing.
fr: `bpo-13583 <https://bugs.python.org/13583>`__: sqlite3.Row now supports slice indexing.

source: `bpo-18473 <https://bugs.python.org/issue18473>`__: Fixed 2to3 and 3to2 compatible pickle mappings. Fixed ambigious reverse mappings. Added many new mappings. Import mapping is no longer applied to modules already mapped with full name mapping.
fr: `bpo-18473 <https://bugs.python.org/18473>`__: Fixed 2to3 and 3to2 compatible pickle mappings. Fixed ambigious reverse mappings. Added many new mappings. Import mapping is no longer applied to modules already mapped with full name mapping.

source: `bpo-23485 <https://bugs.python.org/issue23485>`__: select.select() is now retried automatically with the recomputed timeout when interrupted by a signal, except if the signal handler raises an exception. This change is part of the PEP 475.
fr: `bpo-23485 <https://bugs.python.org/23485>`__: select.select() is now retried automatically with the recomputed timeout when interrupted by a signal, except if the signal handler raises an exception. This change is part of the PEP 475.

source: `bpo-23752 <https://bugs.python.org/issue23752>`__: When built from an existing file descriptor, io.FileIO() now only calls fstat() once. Before fstat() was called twice, which was not necessary.
fr: `bpo-23752 <https://bugs.python.org/23752>`__: When built from an existing file descriptor, io.FileIO() now only calls fstat() once. Before fstat() was called twice, which was not necessary.

source: `bpo-23704 <https://bugs.python.org/issue23704>`__: collections.deque() objects now support __add__, __mul__, and __imul__().
fr: `bpo-23704 <https://bugs.python.org/23704>`__: collections.deque() objects now support __add__, __mul__, and __imul__().

source: `bpo-23171 <https://bugs.python.org/issue23171>`__: csv.Writer.writerow() now supports arbitrary iterables.
fr: `bpo-23171 <https://bugs.python.org/23171>`__: csv.Writer.writerow() now supports arbitrary iterables.

source: `bpo-23745 <https://bugs.python.org/issue23745>`__: The new email header parser now handles duplicate MIME parameter names without error, similar to how get_param behaves.
fr: `bpo-23745 <https://bugs.python.org/23745>`__: The new email header parser now handles duplicate MIME parameter names without error, similar to how get_param behaves.

source: `bpo-22117 <https://bugs.python.org/issue22117>`__: Fix os.utime(), it now rounds the timestamp towards minus infinity (-inf) instead of rounding towards zero.
fr: `bpo-22117 <https://bugs.python.org/22117>`__: Fix os.utime(), it now rounds the timestamp towards minus infinity (-inf) instead of rounding towards zero.

source: `bpo-23310 <https://bugs.python.org/issue23310>`__: Fix MagicMock's initializer to work with __methods__, just like configure_mock(). Patch by Kasia Jachim.
fr: `bpo-23310 <https://bugs.python.org/23310>`__: Fix MagicMock's initializer to work with __methods__, just like configure_mock(). Patch by Kasia Jachim.

source: `bpo-23817 <https://bugs.python.org/issue23817>`__: FreeBSD now uses "1.0" in the SOVERSION as other operating systems, instead of just "1".
fr: `bpo-23817 <https://bugs.python.org/23817>`__: FreeBSD now uses "1.0" in the SOVERSION as other operating systems, instead of just "1".

source: `bpo-23501 <https://bugs.python.org/issue23501>`__: Argument Clinic now generates code into separate files by default.
fr: `bpo-23501 <https://bugs.python.org/23501>`__: Argument Clinic now generates code into separate files by default.

source: `bpo-23799 <https://bugs.python.org/issue23799>`__: Added test.support.start_threads() for running and cleaning up multiple threads.
fr: `bpo-23799 <https://bugs.python.org/23799>`__: Added test.support.start_threads() for running and cleaning up multiple threads.

source: `bpo-22390 <https://bugs.python.org/issue22390>`__: test.regrtest now emits a warning if temporary files or directories are left after running a test.
fr: `bpo-22390 <https://bugs.python.org/22390>`__: test.regrtest now emits a warning if temporary files or directories are left after running a test.

source: `bpo-18128 <https://bugs.python.org/issue18128>`__: pygettext now uses standard +NNNN format in the POT-Creation-Date header.
fr: `bpo-18128 <https://bugs.python.org/18128>`__: pygettext now uses standard +NNNN format in the POT-Creation-Date header.

source: `bpo-23935 <https://bugs.python.org/issue23935>`__: Argument Clinic's understanding of format units accepting bytes, bytearrays, and buffers is now consistent with both the documentation and the implementation.
fr: `bpo-23935 <https://bugs.python.org/23935>`__: Argument Clinic's understanding of format units accepting bytes, bytearrays, and buffers is now consistent with both the documentation and the implementation.

source: `bpo-23944 <https://bugs.python.org/issue23944>`__: Argument Clinic now wraps long impl prototypes at column 78.
fr: `bpo-23944 <https://bugs.python.org/23944>`__: Argument Clinic now wraps long impl prototypes at column 78.

source: `bpo-20586 <https://bugs.python.org/issue20586>`__: Argument Clinic now ensures that functions without docstrings have signatures.
fr: `bpo-20586 <https://bugs.python.org/20586>`__: Argument Clinic now ensures that functions without docstrings have signatures.

source: `bpo-23492 <https://bugs.python.org/issue23492>`__: Argument Clinic now generates argument parsing code with PyArg_Parse instead of PyArg_ParseTuple if possible.
fr: `bpo-23492 <https://bugs.python.org/23492>`__: Argument Clinic now generates argument parsing code with PyArg_Parse instead of PyArg_ParseTuple if possible.

source: `bpo-23500 <https://bugs.python.org/issue23500>`__: Argument Clinic is now smarter about generating the "#ifndef" (empty) definition of the methoddef macro: it's only generated once, even if Argument Clinic processes the same symbol multiple times, and it's emitted at the end of all processing rather than immediately after the first use.
fr: `bpo-23500 <https://bugs.python.org/23500>`__: Argument Clinic is now smarter about generating the "#ifndef" (empty) definition of the methoddef macro: it's only generated once, even if Argument Clinic processes the same symbol multiple times, and it's emitted at the end of all processing rather than immediately after the first use.

source: `bpo-23998 <https://bugs.python.org/issue23998>`__: PyImport_ReInitLock() now checks for lock allocation error
fr: `bpo-23998 <https://bugs.python.org/23998>`__: PyImport_ReInitLock() now checks for lock allocation error

source: `bpo-23573 <https://bugs.python.org/issue23573>`__: Increased performance of string search operations (str.find, str.index, str.count, the in operator, str.split, str.partition) with arguments of different kinds (UCS1, UCS2, UCS4).
fr: `bpo-23573 <https://bugs.python.org/23573>`__: Increased performance of string search operations (str.find, str.index, str.count, the in operator, str.split, str.partition) with arguments of different kinds (UCS1, UCS2, UCS4).

source: `bpo-23753 <https://bugs.python.org/issue23753>`__: Python doesn't support anymore platforms without stat() or fstat(), these functions are always required.
fr: `bpo-23753 <https://bugs.python.org/23753>`__: Python doesn't support anymore platforms without stat() or fstat(), these functions are always required.

source: `bpo-23681 <https://bugs.python.org/issue23681>`__: The -b option now affects comparisons of bytes with int.
fr: `bpo-23681 <https://bugs.python.org/23681>`__: The -b option now affects comparisons of bytes with int.

source: `bpo-23632 <https://bugs.python.org/issue23632>`__: Memoryviews now allow tuple indexing (including for multi-dimensional memoryviews).
fr: `bpo-23632 <https://bugs.python.org/23632>`__: Memoryviews now allow tuple indexing (including for multi-dimensional memoryviews).

source: `bpo-23192 <https://bugs.python.org/issue23192>`__: Fixed generator lambdas. Patch by Bruno Cauet.
fr: `bpo-23192 <https://bugs.python.org/23192>`__: Fixed generator lambdas. Patch by Bruno Cauet.

source: `bpo-23629 <https://bugs.python.org/issue23629>`__: Fix the default __sizeof__ implementation for variable-sized objects.
fr: `bpo-23629 <https://bugs.python.org/23629>`__: Fix the default __sizeof__ implementation for variable-sized objects.

source: `bpo-14260 <https://bugs.python.org/issue14260>`__: The groupindex attribute of regular expression pattern object now is non-modifiable mapping.
fr: `bpo-14260 <https://bugs.python.org/14260>`__: The groupindex attribute of regular expression pattern object now is non-modifiable mapping.

source: `bpo-23792 <https://bugs.python.org/issue23792>`__: Ignore KeyboardInterrupt when the pydoc pager is active. This mimics the behavior of the standard unix pagers, and prevents pipepager from shutting down while the pager itself is still running.
fr: `bpo-23792 <https://bugs.python.org/23792>`__: Ignore KeyboardInterrupt when the pydoc pager is active. This mimics the behavior of the standard unix pagers, and prevents pipepager from shutting down while the pager itself is still running.

source: `bpo-23775 <https://bugs.python.org/issue23775>`__: pprint() of OrderedDict now outputs the same representation as repr().
fr: `bpo-23775 <https://bugs.python.org/23775>`__: pprint() of OrderedDict now outputs the same representation as repr().

source: `bpo-23765 <https://bugs.python.org/issue23765>`__: Removed IsBadStringPtr calls in ctypes
fr: `bpo-23765 <https://bugs.python.org/23765>`__: Removed IsBadStringPtr calls in ctypes

source: `bpo-22364 <https://bugs.python.org/issue22364>`__: Improved some re error messages using regex for hints.
fr: `bpo-22364 <https://bugs.python.org/22364>`__: Improved some re error messages using regex for hints.

source: `bpo-23742 <https://bugs.python.org/issue23742>`__: ntpath.expandvars() no longer loses unbalanced single quotes.
fr: `bpo-23742 <https://bugs.python.org/23742>`__: ntpath.expandvars() no longer loses unbalanced single quotes.

source: `bpo-21717 <https://bugs.python.org/issue21717>`__: The zipfile.ZipFile.open function now supports 'x' (exclusive creation) mode.
fr: `bpo-21717 <https://bugs.python.org/21717>`__: The zipfile.ZipFile.open function now supports 'x' (exclusive creation) mode.

source: `bpo-21802 <https://bugs.python.org/issue21802>`__: The reader in BufferedRWPair now is closed even when closing writer failed in BufferedRWPair.close().
fr: `bpo-21802 <https://bugs.python.org/21802>`__: The reader in BufferedRWPair now is closed even when closing writer failed in BufferedRWPair.close().

source: `bpo-23622 <https://bugs.python.org/issue23622>`__: Unknown escapes in regular expressions that consist of ``'\'`` and ASCII letter now raise a deprecation warning and will be forbidden in Python 3.6.
fr: `bpo-23622 <https://bugs.python.org/23622>`__: Unknown escapes in regular expressions that consist of ``'\'`` and an ASCII letter now raise a deprecation warning and will be forbidden in Python 3.6.

source: `bpo-23671 <https://bugs.python.org/issue23671>`__: string.Template now allows specifying the "self" parameter as a keyword argument. string.Formatter now allows specifying the "self" and the "format_string" parameters as keyword arguments.
fr: `bpo-23671 <https://bugs.python.org/23671>`__: string.Template now allows specifying the "self" parameter as a keyword argument. string.Formatter now allows specifying the "self" and the "format_string" parameters as keyword arguments.

source: `bpo-23502 <https://bugs.python.org/issue23502>`__: The pprint module now supports mapping proxies.
fr: `bpo-23502 <https://bugs.python.org/23502>`__: The pprint module now supports mapping proxies.

source: `bpo-17530 <https://bugs.python.org/issue17530>`__: pprint now wraps long bytes objects and bytearrays.
fr: `bpo-17530 <https://bugs.python.org/17530>`__: pprint now wraps long bytes objects and bytearrays.

source: `bpo-22687 <https://bugs.python.org/issue22687>`__: Fixed some corner cases in breaking words in tetxtwrap. Got rid of quadratic complexity in breaking long words.
fr: `bpo-22687 <https://bugs.python.org/22687>`__: Fixed some corner cases in breaking words in tetxtwrap. Got rid of quadratic complexity in breaking long words.
