Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-28399 <https://bugs.python.org/issue28399>`__: Remove UNIX socket from FS before binding. Patch by Коренберг Марк.
fr: `bpo-28399 <https://bugs.python.org/28399>`__: Remove UNIX socket from FS before binding. Patch by Коренберг Марк.

source: `bpo-27972 <https://bugs.python.org/issue27972>`__: Prohibit Tasks to await on themselves.
fr: `bpo-27972 <https://bugs.python.org/27972>`__: Prohibit Tasks to await on themselves.

source: `bpo-28402 <https://bugs.python.org/issue28402>`__: Adds signed catalog files for stdlib on Windows.
fr: `bpo-28402 <https://bugs.python.org/28402>`__: Adds signed catalog files for stdlib on Windows.

source: `bpo-28333 <https://bugs.python.org/issue28333>`__: Enables Unicode for ps1/ps2 and input() prompts. (Patch by Eryk Sun)
fr: `bpo-28333 <https://bugs.python.org/28333>`__: Enables Unicode for ps1/ps2 and input() prompts. (Patch by Eryk Sun)

source: `bpo-28251 <https://bugs.python.org/issue28251>`__: Improvements to help manuals on Windows.
fr: `bpo-28251 <https://bugs.python.org/28251>`__: Improvements to help manuals on Windows.

source: `bpo-28110 <https://bugs.python.org/issue28110>`__: launcher.msi has different product codes between 32-bit and 64-bit
fr: `bpo-28110 <https://bugs.python.org/28110>`__: launcher.msi has different product codes between 32-bit and 64-bit

source: `bpo-28161 <https://bugs.python.org/issue28161>`__: Opening CON for write access fails
fr: `bpo-28161 <https://bugs.python.org/28161>`__: Opening CON for write access fails

source: `bpo-28162 <https://bugs.python.org/issue28162>`__: WindowsConsoleIO readall() fails if first line starts with Ctrl+Z
fr: `bpo-28162 <https://bugs.python.org/28162>`__: WindowsConsoleIO readall() fails if first line starts with Ctrl+Z

source: `bpo-28163 <https://bugs.python.org/issue28163>`__: WindowsConsoleIO fileno() passes wrong flags to _open_osfhandle
fr: `bpo-28163 <https://bugs.python.org/28163>`__: WindowsConsoleIO fileno() passes wrong flags to _open_osfhandle

source: `bpo-28164 <https://bugs.python.org/issue28164>`__: _PyIO_get_console_type fails for various paths
fr: `bpo-28164 <https://bugs.python.org/28164>`__: _PyIO_get_console_type fails for various paths

source: `bpo-28137 <https://bugs.python.org/issue28137>`__: Renames Windows path file to ._pth
fr: `bpo-28137 <https://bugs.python.org/28137>`__: Renames Windows path file to ._pth

source: `bpo-28138 <https://bugs.python.org/issue28138>`__: Windows ._pth file should allow import site
fr: `bpo-28138 <https://bugs.python.org/28138>`__: Windows ._pth file should allow import site

source: `bpo-28258 <https://bugs.python.org/issue28258>`__: Fixed build with Estonian locale (python-config and distclean targets in Makefile). Patch by Arfrever Frehtes Taifersar Arahesis.
fr: `bpo-28258 <https://bugs.python.org/28258>`__: Fixed build with Estonian locale (python-config and distclean targets in Makefile). Patch by Arfrever Frehtes Taifersar Arahesis.

source: `bpo-26661 <https://bugs.python.org/issue26661>`__: setup.py now detects system libffi with multiarch wrapper.
fr: `bpo-26661 <https://bugs.python.org/26661>`__: setup.py now detects system libffi with multiarch wrapper.

source: `bpo-15819 <https://bugs.python.org/issue15819>`__: Remove redundant include search directory option for building outside the source tree.
fr: `bpo-15819 <https://bugs.python.org/15819>`__: Remove redundant include search directory option for building outside the source tree.

source: `bpo-28217 <https://bugs.python.org/issue28217>`__: Adds _testconsole module to test console input.
fr: `bpo-28217 <https://bugs.python.org/28217>`__: Adds _testconsole module to test console input.

source: `bpo-23722 <https://bugs.python.org/issue23722>`__: The __class__ cell used by zero-argument super() is now initialized from type.__new__ rather than __build_class__, so class methods relying on that will now work correctly when called from metaclass methods during class creation. Patch by Martin Teichmann.
fr: `bpo-23722 <https://bugs.python.org/23722>`__: The __class__ cell used by zero-argument super() is now initialized from type.__new__ rather than __build_class__, so class methods relying on that will now work correctly when called from metaclass methods during class creation. Patch by Martin Teichmann.

source: `bpo-25221 <https://bugs.python.org/issue25221>`__: Fix corrupted result from PyLong_FromLong(0) when Python is compiled with NSMALLPOSINTS = 0.
fr: `bpo-25221 <https://bugs.python.org/25221>`__: Fix corrupted result from PyLong_FromLong(0) when Python is compiled with NSMALLPOSINTS = 0.

source: `bpo-27080 <https://bugs.python.org/issue27080>`__: Implement formatting support for PEP 515. Initial patch by Chris Angelico.
fr: `bpo-27080 <https://bugs.python.org/27080>`__: Implement formatting support for PEP 515. Initial patch by Chris Angelico.

source: `bpo-27199 <https://bugs.python.org/issue27199>`__: In tarfile, expose copyfileobj bufsize to improve throughput. Patch by Jason Fried.
fr: `bpo-27199 <https://bugs.python.org/27199>`__: In tarfile, expose copyfileobj bufsize to improve throughput. Patch by Jason Fried.

source: `bpo-27948 <https://bugs.python.org/issue27948>`__: In f-strings, only allow backslashes inside the braces (where the expressions are). This is a breaking change from the 3.6 alpha releases, where backslashes are allowed anywhere in an f-string. Also, require that expressions inside f-strings be enclosed within literal braces, and not escapes like f'\x7b"hi"\x7d'.
fr: `bpo-27948 <https://bugs.python.org/27948>`__: In f-strings, only allow backslashes inside the braces (where the expressions are). This is a breaking change from the 3.6 alpha releases, where backslashes are allowed anywhere in an f-string. Also, require that expressions inside f-strings be enclosed within literal braces, and not escapes like f'\x7b"hi"\x7d'.

source: `bpo-28046 <https://bugs.python.org/issue28046>`__: Remove platform-specific directories from sys.path.
fr: `bpo-28046 <https://bugs.python.org/28046>`__: Remove platform-specific directories from sys.path.

source: `bpo-28071 <https://bugs.python.org/issue28071>`__: Add early-out for differencing from an empty set.
fr: `bpo-28071 <https://bugs.python.org/28071>`__: Add early-out for differencing from an empty set.

source: `bpo-25758 <https://bugs.python.org/issue25758>`__: Prevents zipimport from unnecessarily encoding a filename (patch by Eryk Sun)
fr: `bpo-25758 <https://bugs.python.org/25758>`__: Prevents zipimport from unnecessarily encoding a filename (patch by Eryk Sun)

source: `bpo-25856 <https://bugs.python.org/issue25856>`__: The __module__ attribute of extension classes and functions now is interned. This leads to more compact pickle data with protocol 4.
fr: `bpo-25856 <https://bugs.python.org/25856>`__: The __module__ attribute of extension classes and functions now is interned. This leads to more compact pickle data with protocol 4.

source: `bpo-27213 <https://bugs.python.org/issue27213>`__: Rework CALL_FUNCTION* opcodes to produce shorter and more efficient bytecode. Patch by Demur Rumed, design by Serhiy Storchaka, reviewed by Serhiy Storchaka and Victor Stinner.
fr: `bpo-27213 <https://bugs.python.org/27213>`__: Rework CALL_FUNCTION* opcodes to produce shorter and more efficient bytecode. Patch by Demur Rumed, design by Serhiy Storchaka, reviewed by Serhiy Storchaka and Victor Stinner.

source: `bpo-26331 <https://bugs.python.org/issue26331>`__: Implement tokenizing support for PEP 515. Patch by Georg Brandl.
fr: `bpo-26331 <https://bugs.python.org/26331>`__: Implement tokenizing support for PEP 515. Patch by Georg Brandl.

source: `bpo-27999 <https://bugs.python.org/issue27999>`__: Make "global after use" a SyntaxError, and ditto for nonlocal. Patch by Ivan Levkivskyi.
fr: `bpo-27999 <https://bugs.python.org/27999>`__: Make "global after use" a SyntaxError, and ditto for nonlocal. Patch by Ivan Levkivskyi.

source: `bpo-28003 <https://bugs.python.org/issue28003>`__: Implement PEP 525 -- Asynchronous Generators.
fr: `bpo-28003 <https://bugs.python.org/28003>`__: Implement PEP 525 -- Asynchronous Generators.

source: `bpo-27985 <https://bugs.python.org/issue27985>`__: Implement PEP 526 -- Syntax for Variable Annotations. Patch by Ivan Levkivskyi.
fr: `bpo-27985 <https://bugs.python.org/27985>`__: Implement PEP 526 -- Syntax for Variable Annotations. Patch by Ivan Levkivskyi.

source: `bpo-26058 <https://bugs.python.org/issue26058>`__: Add a new private version to the builtin dict type, incremented at each dictionary creation and at each dictionary change. Implementation of the PEP 509.
fr: `bpo-26058 <https://bugs.python.org/26058>`__: Add a new private version to the builtin dict type, incremented at each dictionary creation and at each dictionary change. Implementation of the PEP 509.

source: `bpo-27364 <https://bugs.python.org/issue27364>`__: A backslash-character pair that is not a valid escape sequence now generates a DeprecationWarning. Patch by Emanuel Barry.
fr: `bpo-27364 <https://bugs.python.org/27364>`__: A backslash-character pair that is not a valid escape sequence now generates a DeprecationWarning. Patch by Emanuel Barry.

source: `bpo-27350 <https://bugs.python.org/issue27350>`__: `dict` implementation is changed like PyPy. It is more compact and preserves insertion order. (Concept developed by Raymond Hettinger and patch by Inada Naoki.)
fr: `bpo-27350 <https://bugs.python.org/27350>`__: `dict` implementation is changed like PyPy. It is more compact and preserves insertion order. (Concept developed by Raymond Hettinger and patch by Inada Naoki.)

source: `bpo-27911 <https://bugs.python.org/issue27911>`__: Remove unnecessary error checks in ``exec_builtin_or_dynamic()``.
fr: `bpo-27911 <https://bugs.python.org/27911>`__: Remove unnecessary error checks in ``exec_builtin_or_dynamic()``.

source: `bpo-27078 <https://bugs.python.org/issue27078>`__: Added BUILD_STRING opcode. Optimized f-strings evaluation.
fr: `bpo-27078 <https://bugs.python.org/27078>`__: Added BUILD_STRING opcode. Optimized f-strings evaluation.

source: `bpo-17884 <https://bugs.python.org/issue17884>`__: Python now requires systems with inttypes.h and stdint.h
fr: `bpo-17884 <https://bugs.python.org/17884>`__: Python now requires systems with inttypes.h and stdint.h

source: `bpo-27961 <https://bugs.python.org/issue27961>`__: Require platforms to support ``long long``. Python hasn't compiled without ``long long`` for years, so this is basically a formality.
fr: `bpo-27961 <https://bugs.python.org/27961>`__: Require platforms to support ``long long``. Python hasn't compiled without ``long long`` for years, so this is basically a formality.

source: `bpo-27355 <https://bugs.python.org/issue27355>`__: Removed support for Windows CE. It was never finished, and Windows CE is no longer a relevant platform for Python.
fr: `bpo-27355 <https://bugs.python.org/27355>`__: Removed support for Windows CE. It was never finished, and Windows CE is no longer a relevant platform for Python.

source: `bpo-27870 <https://bugs.python.org/issue27870>`__: A left shift of zero by a large integer no longer attempts to allocate large amounts of memory.
fr: `bpo-27870 <https://bugs.python.org/27870>`__: A left shift of zero by a large integer no longer attempts to allocate large amounts of memory.

source: `bpo-25402 <https://bugs.python.org/issue25402>`__: In int-to-decimal-string conversion, improve the estimate of the intermediate memory required, and remove an unnecessarily strict overflow check. Patch by Serhiy Storchaka.
fr: `bpo-25402 <https://bugs.python.org/25402>`__: In int-to-decimal-string conversion, improve the estimate of the intermediate memory required, and remove an unnecessarily strict overflow check. Patch by Serhiy Storchaka.

source: `bpo-27214 <https://bugs.python.org/issue27214>`__: In long_invert, be more careful about modifying object returned by long_add, and remove an unnecessary check for small longs. Thanks Oren Milman for analysis and patch.
fr: `bpo-27214 <https://bugs.python.org/27214>`__: In long_invert, be more careful about modifying object returned by long_add, and remove an unnecessary check for small longs. Thanks Oren Milman for analysis and patch.

source: `bpo-27506 <https://bugs.python.org/issue27506>`__: Support passing the bytes/bytearray.translate() "delete" argument by keyword.
fr: `bpo-27506 <https://bugs.python.org/27506>`__: Support passing the bytes/bytearray.translate() "delete" argument by keyword.

source: `bpo-27812 <https://bugs.python.org/issue27812>`__: Properly clear out a generator's frame's backreference to the generator to prevent crashes in frame.clear().
fr: `bpo-27812 <https://bugs.python.org/27812>`__: Properly clear out a generator's frame's backreference to the generator to prevent crashes in frame.clear().

source: `bpo-27811 <https://bugs.python.org/issue27811>`__: Fix a crash when a coroutine that has not been awaited is finalized with warnings-as-errors enabled.
fr: `bpo-27811 <https://bugs.python.org/27811>`__: Fix a crash when a coroutine that has not been awaited is finalized with warnings-as-errors enabled.

source: `bpo-27587 <https://bugs.python.org/issue27587>`__: Fix another issue found by PVS-Studio: Null pointer check after use of 'def' in _PyState_AddModule(). Initial patch by Christian Heimes.
fr: `bpo-27587 <https://bugs.python.org/27587>`__: Fix another issue found by PVS-Studio: Null pointer check after use of 'def' in _PyState_AddModule(). Initial patch by Christian Heimes.

source: `bpo-27792 <https://bugs.python.org/issue27792>`__: The modulo operation applied to ``bool`` and other ``int`` subclasses now always returns an ``int``. Previously the return type depended on the input values. Patch by Xiang Zhang.
fr: `bpo-27792 <https://bugs.python.org/27792>`__: The modulo operation applied to ``bool`` and other ``int`` subclasses now always returns an ``int``. Previously the return type depended on the input values. Patch by Xiang Zhang.

source: `bpo-26984 <https://bugs.python.org/issue26984>`__: int() now always returns an instance of exact int.
fr: `bpo-26984 <https://bugs.python.org/26984>`__: int() now always returns an instance of exact int.

source: `bpo-25604 <https://bugs.python.org/issue25604>`__: Fix a minor bug in integer true division; this bug could potentially have caused off-by-one-ulp results on platforms with unreliable ldexp implementations.
fr: `bpo-25604 <https://bugs.python.org/25604>`__: Fix a minor bug in integer true division; this bug could potentially have caused off-by-one-ulp results on platforms with unreliable ldexp implementations.

source: `bpo-24254 <https://bugs.python.org/issue24254>`__: Make class definition namespace ordered by default.
fr: `bpo-24254 <https://bugs.python.org/24254>`__: Make class definition namespace ordered by default.

source: `bpo-27662 <https://bugs.python.org/issue27662>`__: Fix an overflow check in ``List_New``: the original code was checking against ``Py_SIZE_MAX`` instead of the correct upper bound of ``Py_SSIZE_T_MAX``. Patch by Xiang Zhang.
fr: `bpo-27662 <https://bugs.python.org/27662>`__: Fix an overflow check in ``List_New``: the original code was checking against ``Py_SIZE_MAX`` instead of the correct upper bound of ``Py_SSIZE_T_MAX``. Patch by Xiang Zhang.

source: `bpo-27782 <https://bugs.python.org/issue27782>`__: Multi-phase extension module import now correctly allows the ``m_methods`` field to be used to add module level functions to instances of non-module types returned from ``Py_create_mod``. Patch by Xiang Zhang.
fr: `bpo-27782 <https://bugs.python.org/27782>`__: Multi-phase extension module import now correctly allows the ``m_methods`` field to be used to add module level functions to instances of non-module types returned from ``Py_create_mod``. Patch by Xiang Zhang.

source: `bpo-27936 <https://bugs.python.org/issue27936>`__: The round() function accepted a second None argument for some types but not for others. Fixed the inconsistency by accepting None for all numeric types.
fr: `bpo-27936 <https://bugs.python.org/27936>`__: The round() function accepted a second None argument for some types but not for others. Fixed the inconsistency by accepting None for all numeric types.

source: `bpo-27487 <https://bugs.python.org/issue27487>`__: Warn if a submodule argument to "python -m" or runpy.run_module() is found in sys.modules after parent packages are imported, but before the submodule is executed.
fr: `bpo-27487 <https://bugs.python.org/27487>`__: Warn if a submodule argument to "python -m" or runpy.run_module() is found in sys.modules after parent packages are imported, but before the submodule is executed.

source: `bpo-27157 <https://bugs.python.org/issue27157>`__: Make only type() itself accept the one-argument form. Patch by Eryk Sun and Emanuel Barry.
fr: `bpo-27157 <https://bugs.python.org/27157>`__: Make only type() itself accept the one-argument form. Patch by Eryk Sun and Emanuel Barry.

source: `bpo-27558 <https://bugs.python.org/issue27558>`__: Fix a SystemError in the implementation of "raise" statement. In a brand new thread, raise a RuntimeError since there is no active exception to reraise. Patch written by Xiang Zhang.
fr: `bpo-27558 <https://bugs.python.org/27558>`__: Fix a SystemError in the implementation of "raise" statement. In a brand new thread, raise a RuntimeError since there is no active exception to reraise. Patch written by Xiang Zhang.

source: `bpo-28008 <https://bugs.python.org/issue28008>`__: Implement PEP 530 -- asynchronous comprehensions.
fr: `bpo-28008 <https://bugs.python.org/28008>`__: Implement PEP 530 -- asynchronous comprehensions.

source: `bpo-28037 <https://bugs.python.org/issue28037>`__: Use sqlite3_get_autocommit() instead of setting Connection->inTransaction manually.
fr: `bpo-28037 <https://bugs.python.org/28037>`__: Use sqlite3_get_autocommit() instead of setting Connection->inTransaction manually.

source: `bpo-25283 <https://bugs.python.org/issue25283>`__: Attributes tm_gmtoff and tm_zone are now available on all platforms in the return values of time.localtime() and time.gmtime().
fr: `bpo-25283 <https://bugs.python.org/25283>`__: Attributes tm_gmtoff and tm_zone are now available on all platforms in the return values of time.localtime() and time.gmtime().

source: `bpo-24454 <https://bugs.python.org/issue24454>`__: Regular expression match object groups are now accessible using __getitem__. "mo[x]" is equivalent to "mo.group(x)".
fr: `bpo-24454 <https://bugs.python.org/24454>`__: Regular expression match object groups are now accessible using __getitem__. "mo[x]" is equivalent to "mo.group(x)".

source: `bpo-10740 <https://bugs.python.org/issue10740>`__: sqlite3 no longer implicitly commit an open transaction before DDL statements.
fr: `bpo-10740 <https://bugs.python.org/10740>`__: sqlite3 no longer implicitly commit an open transaction before DDL statements.

source: `bpo-17941 <https://bugs.python.org/issue17941>`__: Add a *module* parameter to collections.namedtuple().
fr: `bpo-17941 <https://bugs.python.org/17941>`__: Add a *module* parameter to collections.namedtuple().

source: `bpo-22493 <https://bugs.python.org/issue22493>`__: Inline flags now should be used only at the start of the regular expression. Deprecation warning is emitted if uses them in the middle of the regular expression.
fr: `bpo-22493 <https://bugs.python.org/22493>`__: Inline flags now should be used only at the start of the regular expression. Deprecation warning is emitted if uses them in the middle of the regular expression.

source: `bpo-26885 <https://bugs.python.org/issue26885>`__: xmlrpc now supports unmarshalling additional data types used by Apache XML-RPC implementation for numerics and None.
fr: `bpo-26885 <https://bugs.python.org/26885>`__: xmlrpc now supports unmarshalling additional data types used by Apache XML-RPC implementation for numerics and None.

source: `bpo-28070 <https://bugs.python.org/issue28070>`__: Fixed parsing inline verbose flag in regular expressions.
fr: `bpo-28070 <https://bugs.python.org/28070>`__: Fixed parsing inline verbose flag in regular expressions.

source: `bpo-19500 <https://bugs.python.org/issue19500>`__: Add client-side SSL session resumption to the ssl module.
fr: `bpo-19500 <https://bugs.python.org/19500>`__: Add client-side SSL session resumption to the ssl module.

source: `bpo-28022 <https://bugs.python.org/issue28022>`__: Deprecate ssl-related arguments in favor of SSLContext. The deprecation include manual creation of SSLSocket and certfile/keyfile (or similar) in ftplib, httplib, imaplib, smtplib, poplib and urllib.
fr: `bpo-28022 <https://bugs.python.org/28022>`__: Deprecate ssl-related arguments in favor of SSLContext. The deprecation include manual creation of SSLSocket and certfile/keyfile (or similar) in ftplib, httplib, imaplib, smtplib, poplib and urllib.

source: `bpo-28043 <https://bugs.python.org/issue28043>`__: SSLContext has improved default settings: OP_NO_SSLv2, OP_NO_SSLv3, OP_NO_COMPRESSION, OP_CIPHER_SERVER_PREFERENCE, OP_SINGLE_DH_USE, OP_SINGLE_ECDH_USE and HIGH ciphers without MD5.
fr: `bpo-28043 <https://bugs.python.org/28043>`__: SSLContext has improved default settings: OP_NO_SSLv2, OP_NO_SSLv3, OP_NO_COMPRESSION, OP_CIPHER_SERVER_PREFERENCE, OP_SINGLE_DH_USE, OP_SINGLE_ECDH_USE and HIGH ciphers without MD5.

source: `bpo-24693 <https://bugs.python.org/issue24693>`__: Changed some RuntimeError's in the zipfile module to more appropriate types. Improved some error messages and debugging output.
fr: `bpo-24693 <https://bugs.python.org/24693>`__: Changed some RuntimeError's in the zipfile module to more appropriate types. Improved some error messages and debugging output.

source: `bpo-17909 <https://bugs.python.org/issue17909>`__: ``json.load`` and ``json.loads`` now support binary input encoded as UTF-8, UTF-16 or UTF-32. Patch by Serhiy Storchaka.
fr: `bpo-17909 <https://bugs.python.org/17909>`__: ``json.load`` and ``json.loads`` now support binary input encoded as UTF-8, UTF-16 or UTF-32. Patch by Serhiy Storchaka.

source: `bpo-27137 <https://bugs.python.org/issue27137>`__: the pure Python fallback implementation of ``functools.partial`` now matches the behaviour of its accelerated C counterpart for subclassing, pickling and text representation purposes. Patch by Emanuel Barry and Serhiy Storchaka.
fr: `bpo-27137 <https://bugs.python.org/27137>`__: the pure Python fallback implementation of ``functools.partial`` now matches the behaviour of its accelerated C counterpart for subclassing, pickling and text representation purposes. Patch by Emanuel Barry and Serhiy Storchaka.

source: `bpo-1703178 <https://bugs.python.org/issue1703178>`__: Fix the ability to pass the --link-objects option to the distutils build_ext command.
fr: `bpo-1703178 <https://bugs.python.org/1703178>`__: Fix the ability to pass the --link-objects option to the distutils build_ext command.

source: `bpo-28019 <https://bugs.python.org/issue28019>`__: itertools.count() no longer rounds non-integer step in range between 1.0 and 2.0 to 1.
fr: `bpo-28019 <https://bugs.python.org/28019>`__: itertools.count() no longer rounds non-integer step in range between 1.0 and 2.0 to 1.

source: `bpo-18401 <https://bugs.python.org/issue18401>`__: Pdb now supports the 'readrc' keyword argument to control whether .pdbrc files should be read. Patch by Martin Matusiak and Sam Kimbrel.
fr: `bpo-18401 <https://bugs.python.org/18401>`__: Pdb now supports the 'readrc' keyword argument to control whether .pdbrc files should be read. Patch by Martin Matusiak and Sam Kimbrel.
