Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-4727 <https://bugs.python.org/issue4727>`__: The copy module now uses pickle protocol 4 (PEP 3154) and supports copying of instances of classes whose __new__ method takes keyword-only arguments.
fr: `bpo-4727 <https://bugs.python.org/4727>`__: The copy module now uses pickle protocol 4 (PEP 3154) and supports copying of instances of classes whose __new__ method takes keyword-only arguments.

source: `bpo-23491 <https://bugs.python.org/issue23491>`__: Added a zipapp module to support creating executable zip file archives of Python code. Registered ".pyz" and ".pyzw" extensions on Windows for these archives (PEP 441).
fr: `bpo-23491 <https://bugs.python.org/23491>`__: Added a zipapp module to support creating executable zip file archives of Python code. Registered ".pyz" and ".pyzw" extensions on Windows for these archives (PEP 441).

source: `bpo-23657 <https://bugs.python.org/issue23657>`__: Avoid explicit checks for str in zipapp, adding support for pathlib.Path objects as arguments.
fr: `bpo-23657 <https://bugs.python.org/23657>`__: Avoid explicit checks for str in zipapp, adding support for pathlib.Path objects as arguments.

source: `bpo-23688 <https://bugs.python.org/issue23688>`__: Added support of arbitrary bytes-like objects and avoided unnecessary copying of memoryview in gzip.GzipFile.write(). Original patch by Wolfgang Maier.
fr: `bpo-23688 <https://bugs.python.org/23688>`__: Added support of arbitrary bytes-like objects and avoided unnecessary copying of memoryview in gzip.GzipFile.write(). Original patch by Wolfgang Maier.

source: `bpo-23252 <https://bugs.python.org/issue23252>`__: Added support for writing ZIP files to unseekable streams.
fr: `bpo-23252 <https://bugs.python.org/23252>`__: Added support for writing ZIP files to unseekable streams.

source: `bpo-23647 <https://bugs.python.org/issue23647>`__: Increase impalib's MAXLINE to accommodate modern mailbox sizes.
fr: `bpo-23647 <https://bugs.python.org/23647>`__: Increase impalib's MAXLINE to accommodate modern mailbox sizes.

source: `bpo-23539 <https://bugs.python.org/issue23539>`__: If body is None, http.client.HTTPConnection.request now sets Content-Length to 0 for PUT, POST, and PATCH headers to avoid 411 errors from some web servers.
fr: `bpo-23539 <https://bugs.python.org/23539>`__: If body is None, http.client.HTTPConnection.request now sets Content-Length to 0 for PUT, POST, and PATCH headers to avoid 411 errors from some web servers.

source: `bpo-22351 <https://bugs.python.org/issue22351>`__: The nntplib.NNTP constructor no longer leaves the connection and socket open until the garbage collector cleans them up. Patch by Martin Panter.
fr: `bpo-22351 <https://bugs.python.org/22351>`__: The nntplib.NNTP constructor no longer leaves the connection and socket open until the garbage collector cleans them up. Patch by Martin Panter.

source: `bpo-23704 <https://bugs.python.org/issue23704>`__: collections.deque() objects now support methods for index(), insert(), and copy(). This allows deques to be registered as a MutableSequence and it improves their substitutability for lists.
fr: `bpo-23704 <https://bugs.python.org/23704>`__: collections.deque() objects now support methods for index(), insert(), and copy(). This allows deques to be registered as a MutableSequence and it improves their substitutability for lists.

source: `bpo-23715 <https://bugs.python.org/issue23715>`__: :func:`signal.sigwaitinfo` and :func:`signal.sigtimedwait` are now retried when interrupted by a signal not in the *sigset* parameter, if the signal handler does not raise an exception. signal.sigtimedwait() recomputes the timeout with a monotonic clock when it is retried.
fr: `bpo-23715 <https://bugs.python.org/23715>`__: :func:`signal.sigwaitinfo` and :func:`signal.sigtimedwait` are now retried when interrupted by a signal not in the *sigset* parameter, if the signal handler does not raise an exception. signal.sigtimedwait() recomputes the timeout with a monotonic clock when it is retried.

source: `bpo-23001 <https://bugs.python.org/issue23001>`__: Few functions in modules mmap, ossaudiodev, socket, ssl, and codecs, that accepted only read-only bytes-like object now accept writable bytes-like object too.
fr: `bpo-23001 <https://bugs.python.org/23001>`__: Few functions in modules mmap, ossaudiodev, socket, ssl, and codecs, that accepted only read-only bytes-like object now accept writable bytes-like object too.

source: `bpo-23646 <https://bugs.python.org/issue23646>`__: If time.sleep() is interrupted by a signal, the sleep is now retried with the recomputed delay, except if the signal handler raises an exception (PEP 475).
fr: `bpo-23646 <https://bugs.python.org/23646>`__: If time.sleep() is interrupted by a signal, the sleep is now retried with the recomputed delay, except if the signal handler raises an exception (PEP 475).

source: `bpo-23136 <https://bugs.python.org/issue23136>`__: _strptime now uniformly handles all days in week 0, including Dec 30 of previous year. Based on patch by Jim Carroll.
fr: `bpo-23136 <https://bugs.python.org/23136>`__: _strptime now uniformly handles all days in week 0, including Dec 30 of previous year. Based on patch by Jim Carroll.

source: `bpo-23700 <https://bugs.python.org/issue23700>`__: Iterator of NamedTemporaryFile now keeps a reference to NamedTemporaryFile instance. Patch by Bohuslav Kabrda.
fr: `bpo-23700 <https://bugs.python.org/23700>`__: Iterator of NamedTemporaryFile now keeps a reference to NamedTemporaryFile instance. Patch by Bohuslav Kabrda.

source: `bpo-22903 <https://bugs.python.org/issue22903>`__: The fake test case created by unittest.loader when it fails importing a test module is now picklable.
fr: `bpo-22903 <https://bugs.python.org/22903>`__: The fake test case created by unittest.loader when it fails importing a test module is now picklable.

source: `bpo-22181 <https://bugs.python.org/issue22181>`__: On Linux, os.urandom() now uses the new getrandom() syscall if available, syscall introduced in the Linux kernel 3.17. It is more reliable and more secure, because it avoids the need of a file descriptor and waits until the kernel has enough entropy.
fr: `bpo-22181 <https://bugs.python.org/22181>`__: On Linux, os.urandom() now uses the new getrandom() syscall if available, syscall introduced in the Linux kernel 3.17. It is more reliable and more secure, because it avoids the need of a file descriptor and waits until the kernel has enough entropy.

source: `bpo-2211 <https://bugs.python.org/issue2211>`__: Updated the implementation of the http.cookies.Morsel class. Setting attributes key, value and coded_value directly now is deprecated. update() and setdefault() now transform and check keys. Comparing for equality now takes into account attributes key, value and coded_value. copy() now returns a Morsel, not a dict. repr() now contains all attributes. Optimized checking keys and quoting values. Added new tests. Original patch by Demian Brecht.
fr: `bpo-2211 <https://bugs.python.org/2211>`__: Updated the implementation of the http.cookies.Morsel class. Setting attributes key, value and coded_value directly now is deprecated. update() and setdefault() now transform and check keys. Comparing for equality now takes into account attributes key, value and coded_value. copy() now returns a Morsel, not a dict. repr() now contains all attributes. Optimized checking keys and quoting values. Added new tests. Original patch by Demian Brecht.

source: `bpo-18983 <https://bugs.python.org/issue18983>`__: Allow selection of output units in timeit. Patch by Julian Gindi.
fr: `bpo-18983 <https://bugs.python.org/18983>`__: Allow selection of output units in timeit. Patch by Julian Gindi.

source: `bpo-23631 <https://bugs.python.org/issue23631>`__: Fix traceback.format_list when a traceback has been mutated.
fr: `bpo-23631 <https://bugs.python.org/23631>`__: Fix traceback.format_list when a traceback has been mutated.

source: `bpo-23568 <https://bugs.python.org/issue23568>`__: Add rdivmod support to MagicMock() objects. Patch by Håkan Lövdahl.
fr: `bpo-23568 <https://bugs.python.org/23568>`__: Add rdivmod support to MagicMock() objects. Patch by Håkan Lövdahl.

source: `bpo-2052 <https://bugs.python.org/issue2052>`__: Add charset parameter to HtmlDiff.make_file().
fr: `bpo-2052 <https://bugs.python.org/2052>`__: Add charset parameter to HtmlDiff.make_file().

source: `bpo-23668 <https://bugs.python.org/issue23668>`__: Support os.truncate and os.ftruncate on Windows.
fr: `bpo-23668 <https://bugs.python.org/23668>`__: Support os.truncate and os.ftruncate on Windows.

source: `bpo-23138 <https://bugs.python.org/issue23138>`__: Fixed parsing cookies with absent keys or values in cookiejar. Patch by Demian Brecht.
fr: `bpo-23138 <https://bugs.python.org/23138>`__: Fixed parsing cookies with absent keys or values in cookiejar. Patch by Demian Brecht.

source: `bpo-23051 <https://bugs.python.org/issue23051>`__: multiprocessing.Pool methods imap() and imap_unordered() now handle exceptions raised by an iterator. Patch by Alon Diamant and Davin Potts.
fr: `bpo-23051 <https://bugs.python.org/23051>`__: multiprocessing.Pool methods imap() and imap_unordered() now handle exceptions raised by an iterator. Patch by Alon Diamant and Davin Potts.

source: `bpo-23581 <https://bugs.python.org/issue23581>`__: Add matmul support to MagicMock. Patch by Håkan Lövdahl.
fr: `bpo-23581 <https://bugs.python.org/23581>`__: Add matmul support to MagicMock. Patch by Håkan Lövdahl.

source: `bpo-23566 <https://bugs.python.org/issue23566>`__: enable(), register(), dump_traceback() and dump_traceback_later() functions of faulthandler now accept file descriptors. Patch by Wei Wu.
fr: `bpo-23566 <https://bugs.python.org/23566>`__: enable(), register(), dump_traceback() and dump_traceback_later() functions of faulthandler now accept file descriptors. Patch by Wei Wu.

source: `bpo-22928 <https://bugs.python.org/issue22928>`__: Disabled HTTP header injections in http.client. Original patch by Demian Brecht.
fr: `bpo-22928 <https://bugs.python.org/22928>`__: Disabled HTTP header injections in http.client. Original patch by Demian Brecht.

source: `bpo-23615 <https://bugs.python.org/issue23615>`__: Modules bz2, tarfile and tokenize now can be reloaded with imp.reload(). Patch by Thomas Kluyver.
fr: `bpo-23615 <https://bugs.python.org/23615>`__: Modules bz2, tarfile and tokenize now can be reloaded with imp.reload(). Patch by Thomas Kluyver.

source: `bpo-23605 <https://bugs.python.org/issue23605>`__: os.walk() now calls os.scandir() instead of os.listdir(). The usage of os.scandir() reduces the number of calls to os.stat(). Initial patch written by Ben Hoyt.
fr: `bpo-23605 <https://bugs.python.org/23605>`__: os.walk() now calls os.scandir() instead of os.listdir(). The usage of os.scandir() reduces the number of calls to os.stat(). Initial patch written by Ben Hoyt.

source: `bpo-23585 <https://bugs.python.org/issue23585>`__: make patchcheck will ensure the interpreter is built.
fr: `bpo-23585 <https://bugs.python.org/23585>`__: make patchcheck will ensure the interpreter is built.

source: `bpo-23583 <https://bugs.python.org/issue23583>`__: Added tests for standard IO streams in IDLE.
fr: `bpo-23583 <https://bugs.python.org/23583>`__: Added tests for standard IO streams in IDLE.

source: `bpo-22289 <https://bugs.python.org/issue22289>`__: Prevent test_urllib2net failures due to ftp connection timeout.
fr: `bpo-22289 <https://bugs.python.org/22289>`__: Prevent test_urllib2net failures due to ftp connection timeout.

source: `bpo-22826 <https://bugs.python.org/issue22826>`__: The result of open() in Tools/freeze/bkfile.py is now better compatible with regular files (in particular it now supports the context management protocol).
fr: `bpo-22826 <https://bugs.python.org/22826>`__: The result of open() in Tools/freeze/bkfile.py is now better compatible with regular files (in particular it now supports the context management protocol).

source: `bpo-23571 <https://bugs.python.org/issue23571>`__: PyObject_Call() and PyCFunction_Call() now raise a SystemError if a function returns a result and raises an exception. The SystemError is chained to the previous exception.
fr: `bpo-23571 <https://bugs.python.org/23571>`__: PyObject_Call() and PyCFunction_Call() now raise a SystemError if a function returns a result and raises an exception. The SystemError is chained to the previous exception.

source: `bpo-22524 <https://bugs.python.org/issue22524>`__: New os.scandir() function, part of the PEP 471: "os.scandir() function -- a better and faster directory iterator". Patch written by Ben Hoyt.
fr: `bpo-22524 <https://bugs.python.org/22524>`__: New os.scandir() function, part of the PEP 471: "os.scandir() function -- a better and faster directory iterator". Patch written by Ben Hoyt.

source: `bpo-23103 <https://bugs.python.org/issue23103>`__: Reduced the memory consumption of IPv4Address and IPv6Address.
fr: `bpo-23103 <https://bugs.python.org/23103>`__: Reduced the memory consumption of IPv4Address and IPv6Address.

source: `bpo-21793 <https://bugs.python.org/issue21793>`__: BaseHTTPRequestHandler again logs response code as numeric, not as stringified enum. Patch by Demian Brecht.
fr: `bpo-21793 <https://bugs.python.org/21793>`__: BaseHTTPRequestHandler again logs response code as numeric, not as stringified enum. Patch by Demian Brecht.

source: `bpo-23476 <https://bugs.python.org/issue23476>`__: In the ssl module, enable OpenSSL's X509_V_FLAG_TRUSTED_FIRST flag on certificate stores when it is available.
fr: `bpo-23476 <https://bugs.python.org/23476>`__: In the ssl module, enable OpenSSL's X509_V_FLAG_TRUSTED_FIRST flag on certificate stores when it is available.

source: `bpo-23576 <https://bugs.python.org/issue23576>`__: Avoid stalling in SSL reads when EOF has been reached in the SSL layer but the underlying connection hasn't been closed.
fr: `bpo-23576 <https://bugs.python.org/23576>`__: Avoid stalling in SSL reads when EOF has been reached in the SSL layer but the underlying connection hasn't been closed.

source: `bpo-23504 <https://bugs.python.org/issue23504>`__: Added an __all__ to the types module.
fr: `bpo-23504 <https://bugs.python.org/23504>`__: Added an __all__ to the types module.

source: `bpo-23563 <https://bugs.python.org/issue23563>`__: Optimized utility functions in urllib.parse.
fr: `bpo-23563 <https://bugs.python.org/23563>`__: Optimized utility functions in urllib.parse.

source: `bpo-7830 <https://bugs.python.org/issue7830>`__: Flatten nested functools.partial.
fr: `bpo-7830 <https://bugs.python.org/7830>`__: Flatten nested functools.partial.

source: `bpo-20204 <https://bugs.python.org/issue20204>`__: Added the __module__ attribute to _tkinter classes.
fr: `bpo-20204 <https://bugs.python.org/20204>`__: Added the __module__ attribute to _tkinter classes.

source: `bpo-19980 <https://bugs.python.org/issue19980>`__: Improved help() for non-recognized strings. help('') now shows the help on str. help('help') now shows the help on help(). Original patch by Mark Lawrence.
fr: `bpo-19980 <https://bugs.python.org/19980>`__: Improved help() for non-recognized strings. help('') now shows the help on str. help('help') now shows the help on help(). Original patch by Mark Lawrence.

source: `bpo-23521 <https://bugs.python.org/issue23521>`__: Corrected pure python implementation of timedelta division.
fr: `bpo-23521 <https://bugs.python.org/23521>`__: Corrected pure python implementation of timedelta division.

source: `bpo-21619 <https://bugs.python.org/issue21619>`__: Popen objects no longer leave a zombie after exit in the with statement if the pipe was broken. Patch by Martin Panter.
fr: `bpo-21619 <https://bugs.python.org/21619>`__: Popen objects no longer leave a zombie after exit in the with statement if the pipe was broken. Patch by Martin Panter.

source: `bpo-22936 <https://bugs.python.org/issue22936>`__: Make it possible to show local variables in tracebacks for both the traceback module and unittest.
fr: `bpo-22936 <https://bugs.python.org/22936>`__: Make it possible to show local variables in tracebacks for both the traceback module and unittest.

source: `bpo-15955 <https://bugs.python.org/issue15955>`__: Add an option to limit the output size in bz2.decompress(). Patch by Nikolaus Rath.
fr: `bpo-15955 <https://bugs.python.org/15955>`__: Add an option to limit the output size in bz2.decompress(). Patch by Nikolaus Rath.

source: `bpo-6639 <https://bugs.python.org/issue6639>`__: Module-level turtle functions no longer raise TclError after closing the window.
fr: `bpo-6639 <https://bugs.python.org/6639>`__: Module-level turtle functions no longer raise TclError after closing the window.

source: `bpo-23215 <https://bugs.python.org/issue23215>`__: Multibyte codecs with custom error handlers that ignores errors consumed too much memory and raised SystemError or MemoryError. Original patch by Aleksi Torhamo.
fr: `bpo-23215 <https://bugs.python.org/23215>`__: Multibyte codecs with custom error handlers that ignores errors consumed too much memory and raised SystemError or MemoryError. Original patch by Aleksi Torhamo.

source: `bpo-5700 <https://bugs.python.org/issue5700>`__: io.FileIO() called flush() after closing the file. flush() was not called in close() if closefd=False.
fr: `bpo-5700 <https://bugs.python.org/5700>`__: io.FileIO() called flush() after closing the file. flush() was not called in close() if closefd=False.

source: `bpo-23374 <https://bugs.python.org/issue23374>`__: Fixed pydoc failure with non-ASCII files when stdout encoding differs from file system encoding (e.g. on Mac OS).
fr: `bpo-23374 <https://bugs.python.org/23374>`__: Fixed pydoc failure with non-ASCII files when stdout encoding differs from file system encoding (e.g. on Mac OS).

source: `bpo-23481 <https://bugs.python.org/issue23481>`__: Remove RC4 from the SSL module's default cipher list.
fr: `bpo-23481 <https://bugs.python.org/23481>`__: Remove RC4 from the SSL module's default cipher list.

source: `bpo-21548 <https://bugs.python.org/issue21548>`__: Fix pydoc.synopsis() and pydoc.apropos() on modules with empty docstrings.
fr: `bpo-21548 <https://bugs.python.org/21548>`__: Fix pydoc.synopsis() and pydoc.apropos() on modules with empty docstrings.

source: `bpo-22885 <https://bugs.python.org/issue22885>`__: Fixed arbitrary code execution vulnerability in the dbm.dumb module. Original patch by Claudiu Popa.
fr: `bpo-22885 <https://bugs.python.org/22885>`__: Fixed arbitrary code execution vulnerability in the dbm.dumb module. Original patch by Claudiu Popa.

source: `bpo-23239 <https://bugs.python.org/issue23239>`__: ssl.match_hostname() now supports matching of IP addresses.
fr: `bpo-23239 <https://bugs.python.org/23239>`__: ssl.match_hostname() now supports matching of IP addresses.

source: `bpo-23146 <https://bugs.python.org/issue23146>`__: Fix mishandling of absolute Windows paths with forward slashes in pathlib.
fr: `bpo-23146 <https://bugs.python.org/23146>`__: Fix mishandling of absolute Windows paths with forward slashes in pathlib.

source: `bpo-23096 <https://bugs.python.org/issue23096>`__: Pickle representation of floats with protocol 0 now is the same for both Python and C implementations.
fr: `bpo-23096 <https://bugs.python.org/23096>`__: Pickle representation of floats with protocol 0 now is the same for both Python and C implementations.

source: `bpo-19105 <https://bugs.python.org/issue19105>`__: pprint now more efficiently uses free space at the right.
fr: `bpo-19105 <https://bugs.python.org/19105>`__: pprint now more efficiently uses free space at the right.

source: `bpo-14910 <https://bugs.python.org/issue14910>`__: Add allow_abbrev parameter to argparse.ArgumentParser. Patch by Jonathan Paugh, Steven Bethard, paul j3 and Daniel Eriksson.
fr: `bpo-14910 <https://bugs.python.org/14910>`__: Add allow_abbrev parameter to argparse.ArgumentParser. Patch by Jonathan Paugh, Steven Bethard, paul j3 and Daniel Eriksson.

source: `bpo-21717 <https://bugs.python.org/issue21717>`__: tarfile.open() now supports 'x' (exclusive creation) mode.
fr: `bpo-21717 <https://bugs.python.org/21717>`__: tarfile.open() now supports 'x' (exclusive creation) mode.

source: `bpo-23344 <https://bugs.python.org/issue23344>`__: marshal.dumps() is now 20-25% faster on average.
fr: `bpo-23344 <https://bugs.python.org/23344>`__: marshal.dumps() is now 20-25% faster on average.

source: `bpo-20416 <https://bugs.python.org/issue20416>`__: marshal.dumps() with protocols 3 and 4 is now 40-50% faster on average.
fr: `bpo-20416 <https://bugs.python.org/20416>`__: marshal.dumps() with protocols 3 and 4 is now 40-50% faster on average.

source: `bpo-23421 <https://bugs.python.org/issue23421>`__: Fixed compression in tarfile CLI. Patch by wdv4758h.
fr: `bpo-23421 <https://bugs.python.org/23421>`__: Fixed compression in tarfile CLI. Patch by wdv4758h.

source: `bpo-23367 <https://bugs.python.org/issue23367>`__: Fix possible overflows in the unicodedata module.
fr: `bpo-23367 <https://bugs.python.org/23367>`__: Fix possible overflows in the unicodedata module.

source: `bpo-23361 <https://bugs.python.org/issue23361>`__: Fix possible overflow in Windows subprocess creation code.
fr: `bpo-23361 <https://bugs.python.org/23361>`__: Fix possible overflow in Windows subprocess creation code.

source: `bpo-19705 <https://bugs.python.org/issue19705>`__: turtledemo now has a visual sorting algorithm demo. Original patch from Jason Yeo.
fr: `bpo-19705 <https://bugs.python.org/19705>`__: turtledemo now has a visual sorting algorithm demo. Original patch from Jason Yeo.

source: `bpo-23801 <https://bugs.python.org/issue23801>`__: Fix issue where cgi.FieldStorage did not always ignore the entire preamble to a multipart body.
fr: `bpo-23801 <https://bugs.python.org/23801>`__: Fix issue where cgi.FieldStorage did not always ignore the entire preamble to a multipart body.

source: `bpo-23445 <https://bugs.python.org/issue23445>`__: pydebug builds now use "gcc -Og" where possible, to make the resulting executable faster.
fr: `bpo-23445 <https://bugs.python.org/23445>`__: pydebug builds now use "gcc -Og" where possible, to make the resulting executable faster.

source: `bpo-23686 <https://bugs.python.org/issue23686>`__: Update OS X 10.5 installer build to use OpenSSL 1.0.2a.
fr: `bpo-23686 <https://bugs.python.org/23686>`__: Update OS X 10.5 installer build to use OpenSSL 1.0.2a.

source: `bpo-20204 <https://bugs.python.org/issue20204>`__: Deprecation warning is now raised for builtin types without the __module__ attribute.
fr: `bpo-20204 <https://bugs.python.org/20204>`__: Deprecation warning is now raised for builtin types without the __module__ attribute.

source: `bpo-23465 <https://bugs.python.org/issue23465>`__: Implement PEP 486 - Make the Python Launcher aware of virtual environments. Patch by Paul Moore.
fr: `bpo-23465 <https://bugs.python.org/23465>`__: Implement PEP 486 - Make the Python Launcher aware of virtual environments. Patch by Paul Moore.

source: `bpo-23437 <https://bugs.python.org/issue23437>`__: Make user scripts directory versioned on Windows. Patch by Paul Moore.
fr: `bpo-23437 <https://bugs.python.org/23437>`__: Make user scripts directory versioned on Windows. Patch by Paul Moore.

source: `bpo-23285 <https://bugs.python.org/issue23285>`__: PEP 475 - EINTR handling.
fr: `bpo-23285 <https://bugs.python.org/23285>`__: PEP 475 - EINTR handling.

source: `bpo-22735 <https://bugs.python.org/issue22735>`__: Fix many edge cases (including crashes) involving custom mro() implementations.
fr: `bpo-22735 <https://bugs.python.org/22735>`__: Fix many edge cases (including crashes) involving custom mro() implementations.
