Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-24619 <https://bugs.python.org/issue24619>`__: New approach for tokenizing async/await. As a consequence, it is now possible to have one-line 'async def foo(): await ..' functions.
fr: `bpo-24619 <https://bugs.python.org/24619>`__: New approach for tokenizing async/await. As a consequence, it is now possible to have one-line 'async def foo(): await ..' functions.

source: `bpo-24687 <https://bugs.python.org/issue24687>`__: Plug refleak on SyntaxError in function parameters annotations.
fr: `bpo-24687 <https://bugs.python.org/24687>`__: Plug refleak on SyntaxError in function parameters annotations.

source: `bpo-15944 <https://bugs.python.org/issue15944>`__: memoryview: Allow arbitrary formats when casting to bytes. Patch by Martin Panter.
fr: `bpo-15944 <https://bugs.python.org/15944>`__: memoryview: Allow arbitrary formats when casting to bytes. Patch by Martin Panter.

source: `bpo-23441 <https://bugs.python.org/issue23441>`__: rcompleter now prints a tab character instead of displaying possible completions for an empty word. Initial patch by Martin Sekera.
fr: `bpo-23441 <https://bugs.python.org/23441>`__: rcompleter now prints a tab character instead of displaying possible completions for an empty word. Initial patch by Martin Sekera.

source: `bpo-24683 <https://bugs.python.org/issue24683>`__: Fixed crashes in _json functions called with arguments of inappropriate type.
fr: `bpo-24683 <https://bugs.python.org/24683>`__: Fixed crashes in _json functions called with arguments of inappropriate type.

source: `bpo-21697 <https://bugs.python.org/issue21697>`__: shutil.copytree() now correctly handles symbolic links that point to directories. Patch by Eduardo Seabra and Thomas Kluyver.
fr: `bpo-21697 <https://bugs.python.org/21697>`__: shutil.copytree() now correctly handles symbolic links that point to directories. Patch by Eduardo Seabra and Thomas Kluyver.

source: `bpo-14373 <https://bugs.python.org/issue14373>`__: Fixed segmentation fault when gc.collect() is called during constructing lru_cache (C implementation).
fr: `bpo-14373 <https://bugs.python.org/14373>`__: Fixed segmentation fault when gc.collect() is called during constructing lru_cache (C implementation).

source: `bpo-24695 <https://bugs.python.org/issue24695>`__: Fix a regression in traceback.print_exception(). If exc_traceback is None we shouldn't print a traceback header like described in the documentation.
fr: `bpo-24695 <https://bugs.python.org/24695>`__: Fix a regression in traceback.print_exception(). If exc_traceback is None we shouldn't print a traceback header like described in the documentation.

source: `bpo-24620 <https://bugs.python.org/issue24620>`__: Random.setstate() now validates the value of state last element.
fr: `bpo-24620 <https://bugs.python.org/24620>`__: Random.setstate() now validates the value of state last element.

source: `bpo-22485 <https://bugs.python.org/issue22485>`__: Fixed an issue that caused `inspect.getsource` to return incorrect results on nested functions.
fr: `bpo-22485 <https://bugs.python.org/22485>`__: Fixed an issue that caused `inspect.getsource` to return incorrect results on nested functions.

source: `bpo-22153 <https://bugs.python.org/issue22153>`__: Improve unittest docs. Patch from Martin Panter and evilzero.
fr: `bpo-22153 <https://bugs.python.org/22153>`__: Improve unittest docs. Patch from Martin Panter and evilzero.

source: `bpo-24580 <https://bugs.python.org/issue24580>`__: Symbolic group references to open group in re patterns now are explicitly forbidden as well as numeric group references.
fr: `bpo-24580 <https://bugs.python.org/24580>`__: Symbolic group references to open group in re patterns now are explicitly forbidden as well as numeric group references.

source: `bpo-24206 <https://bugs.python.org/issue24206>`__: Fixed __eq__ and __ne__ methods of inspect classes.
fr: `bpo-24206 <https://bugs.python.org/24206>`__: Fixed __eq__ and __ne__ methods of inspect classes.

source: `bpo-24631 <https://bugs.python.org/issue24631>`__: Fixed regression in the timeit module with multiline setup.
fr: `bpo-24631 <https://bugs.python.org/24631>`__: Fixed regression in the timeit module with multiline setup.

source: `bpo-24608 <https://bugs.python.org/issue24608>`__: chunk.Chunk.read() now always returns bytes, not str.
fr: `bpo-24608 <https://bugs.python.org/24608>`__: chunk.Chunk.read() now always returns bytes, not str.

source: `bpo-18684 <https://bugs.python.org/issue18684>`__: Fixed reading out of the buffer in the re module.
fr: `bpo-18684 <https://bugs.python.org/18684>`__: Fixed reading out of the buffer in the re module.

source: `bpo-24259 <https://bugs.python.org/issue24259>`__: tarfile now raises a ReadError if an archive is truncated inside a data segment.
fr: `bpo-24259 <https://bugs.python.org/24259>`__: tarfile now raises a ReadError if an archive is truncated inside a data segment.

source: `bpo-15014 <https://bugs.python.org/issue15014>`__: SMTP.auth() and SMTP.login() now support RFC 4954's optional initial-response argument to the SMTP AUTH command.
fr: `bpo-15014 <https://bugs.python.org/15014>`__: SMTP.auth() and SMTP.login() now support RFC 4954's optional initial-response argument to the SMTP AUTH command.

source: `bpo-24669 <https://bugs.python.org/issue24669>`__: Fix inspect.getsource() for 'async def' functions. Patch by Kai Groner.
fr: `bpo-24669 <https://bugs.python.org/24669>`__: Fix inspect.getsource() for 'async def' functions. Patch by Kai Groner.

source: `bpo-24688 <https://bugs.python.org/issue24688>`__: ast.get_docstring() for 'async def' functions.
fr: `bpo-24688 <https://bugs.python.org/24688>`__: ast.get_docstring() for 'async def' functions.

source: `bpo-24603 <https://bugs.python.org/issue24603>`__: Update Windows builds and OS X 10.5 installer to use OpenSSL 1.0.2d.
fr: `bpo-24603 <https://bugs.python.org/24603>`__: Update Windows builds and OS X 10.5 installer to use OpenSSL 1.0.2d.

source: Release date: 2015-07-05
fr: Date de sortie : 2015-07-05

source: `bpo-24467 <https://bugs.python.org/issue24467>`__: Fixed possible buffer over-read in bytearray. The bytearray object now always allocates place for trailing null byte and it's buffer now is always null-terminated.
fr: `bpo-24467 <https://bugs.python.org/24467>`__: Fixed possible buffer over-read in bytearray. The bytearray object now always allocates place for trailing null byte and it's buffer now is always null-terminated.

source: `bpo-24345 <https://bugs.python.org/issue24345>`__: Add Py_tp_finalize slot for the stable ABI.
fr: `bpo-24345 <https://bugs.python.org/24345>`__: Add Py_tp_finalize slot for the stable ABI.

source: `bpo-24400 <https://bugs.python.org/issue24400>`__: Introduce a distinct type for PEP 492 coroutines; add types.CoroutineType, inspect.getcoroutinestate, inspect.getcoroutinelocals; coroutines no longer use CO_GENERATOR flag; sys.set_coroutine_wrapper works only for 'async def' coroutines; inspect.iscoroutine no longer uses collections.abc.Coroutine, it's intended to test for pure 'async def' coroutines only; add new opcode: GET_YIELD_FROM_ITER; fix generators wrapper used in types.coroutine to be instance of collections.abc.Generator; collections.abc.Awaitable and collections.abc.Coroutine can no longer be used to detect generator-based coroutines--use inspect.isawaitable instead.
fr: `bpo-24400 <https://bugs.python.org/24400>`__: Introduce a distinct type for PEP 492 coroutines; add types.CoroutineType, inspect.getcoroutinestate, inspect.getcoroutinelocals; coroutines no longer use CO_GENERATOR flag; sys.set_coroutine_wrapper works only for 'async def' coroutines; inspect.iscoroutine no longer uses collections.abc.Coroutine, it's intended to test for pure 'async def' coroutines only; add new opcode: GET_YIELD_FROM_ITER; fix generators wrapper used in types.coroutine to be instance of collections.abc.Generator; collections.abc.Awaitable and collections.abc.Coroutine can no longer be used to detect generator-based coroutines--use inspect.isawaitable instead.

source: `bpo-24450 <https://bugs.python.org/issue24450>`__: Add gi_yieldfrom to generators and cr_await to coroutines. Contributed by Benno Leslie and Yury Selivanov.
fr: `bpo-24450 <https://bugs.python.org/24450>`__: Add gi_yieldfrom to generators and cr_await to coroutines. Contributed by Benno Leslie and Yury Selivanov.

source: `bpo-19235 <https://bugs.python.org/issue19235>`__: Add new RecursionError exception. Patch by Georg Brandl.
fr: `bpo-19235 <https://bugs.python.org/19235>`__: Add new RecursionError exception. Patch by Georg Brandl.

source: `bpo-21750 <https://bugs.python.org/issue21750>`__: mock_open.read_data can now be read from each instance, as it could in Python 3.3.
fr: `bpo-21750 <https://bugs.python.org/21750>`__: mock_open.read_data can now be read from each instance, as it could in Python 3.3.

source: `bpo-24552 <https://bugs.python.org/issue24552>`__: Fix use after free in an error case of the _pickle module.
fr: `bpo-24552 <https://bugs.python.org/24552>`__: Fix use after free in an error case of the _pickle module.

source: `bpo-24514 <https://bugs.python.org/issue24514>`__: tarfile now tolerates number fields consisting of only whitespace.
fr: `bpo-24514 <https://bugs.python.org/24514>`__: tarfile now tolerates number fields consisting of only whitespace.

source: `bpo-19176 <https://bugs.python.org/issue19176>`__: Fixed doctype() related bugs in C implementation of ElementTree. A deprecation warning no longer issued by XMLParser subclass with default doctype() method. Direct call of doctype() now issues a warning. Parser's doctype() now is not called if target's doctype() is called. Based on patch by Martin Panter.
fr: `bpo-19176 <https://bugs.python.org/19176>`__: Fixed doctype() related bugs in C implementation of ElementTree. A deprecation warning no longer issued by XMLParser subclass with default doctype() method. Direct call of doctype() now issues a warning. Parser's doctype() now is not called if target's doctype() is called. Based on patch by Martin Panter.

source: `bpo-20387 <https://bugs.python.org/issue20387>`__: Restore semantic round-trip correctness in tokenize/untokenize for tab-indented blocks.
fr: `bpo-20387 <https://bugs.python.org/20387>`__: Restore semantic round-trip correctness in tokenize/untokenize for tab-indented blocks.

source: `bpo-24456 <https://bugs.python.org/issue24456>`__: Fixed possible buffer over-read in adpcm2lin() and lin2adpcm() functions of the audioop module.
fr: `bpo-24456 <https://bugs.python.org/24456>`__: Fixed possible buffer over-read in adpcm2lin() and lin2adpcm() functions of the audioop module.

source: `bpo-24336 <https://bugs.python.org/issue24336>`__: The contextmanager decorator now works with functions with keyword arguments called "func" and "self". Patch by Martin Panter.
fr: `bpo-24336 <https://bugs.python.org/24336>`__: The contextmanager decorator now works with functions with keyword arguments called "func" and "self". Patch by Martin Panter.

source: `bpo-24522 <https://bugs.python.org/issue24522>`__: Fix possible integer overflow in json accelerator module.
fr: `bpo-24522 <https://bugs.python.org/24522>`__: Fix possible integer overflow in json accelerator module.

source: `bpo-24489 <https://bugs.python.org/issue24489>`__: ensure a previously set C errno doesn't disturb cmath.polar().
fr: `bpo-24489 <https://bugs.python.org/24489>`__: ensure a previously set C errno doesn't disturb cmath.polar().

source: `bpo-24408 <https://bugs.python.org/issue24408>`__: Fixed AttributeError in measure() and metrics() methods of tkinter.Font.
fr: `bpo-24408 <https://bugs.python.org/24408>`__: Fixed AttributeError in measure() and metrics() methods of tkinter.Font.

source: `bpo-14373 <https://bugs.python.org/issue14373>`__: C implementation of functools.lru_cache() now can be used with methods.
fr: `bpo-14373 <https://bugs.python.org/14373>`__: C implementation of functools.lru_cache() now can be used with methods.

source: `bpo-24347 <https://bugs.python.org/issue24347>`__: Set KeyError if PyDict_GetItemWithError returns NULL.
fr: `bpo-24347 <https://bugs.python.org/24347>`__: Set KeyError if PyDict_GetItemWithError returns NULL.

source: `bpo-24348 <https://bugs.python.org/issue24348>`__: Drop superfluous incref/decref.
fr: `bpo-24348 <https://bugs.python.org/24348>`__: Drop superfluous incref/decref.

source: `bpo-24359 <https://bugs.python.org/issue24359>`__: Check for changed OrderedDict size during iteration.
fr: `bpo-24359 <https://bugs.python.org/24359>`__: Check for changed OrderedDict size during iteration.

source: `bpo-24368 <https://bugs.python.org/issue24368>`__: Support keyword arguments in OrderedDict methods.
fr: `bpo-24368 <https://bugs.python.org/24368>`__: Support keyword arguments in OrderedDict methods.

source: `bpo-24362 <https://bugs.python.org/issue24362>`__: Simplify the C OrderedDict fast nodes resize logic.
fr: `bpo-24362 <https://bugs.python.org/24362>`__: Simplify the C OrderedDict fast nodes resize logic.

source: `bpo-24377 <https://bugs.python.org/issue24377>`__: Fix a ref leak in OrderedDict.__repr__.
fr: `bpo-24377 <https://bugs.python.org/24377>`__: Fix a ref leak in OrderedDict.__repr__.

source: `bpo-24369 <https://bugs.python.org/issue24369>`__: Defend against key-changes during iteration.
fr: `bpo-24369 <https://bugs.python.org/24369>`__: Defend against key-changes during iteration.

source: `bpo-24373 <https://bugs.python.org/issue24373>`__: _testmultiphase and xxlimited now use tp_traverse and tp_finalize to avoid reference leaks encountered when combining tp_dealloc with PyType_FromSpec (see `bpo-16690 <https://bugs.python.org/issue16690>`__ for details)
fr: `bpo-24373 <https://bugs.python.org/24373>`__: _testmultiphase and xxlimited now use tp_traverse and tp_finalize to avoid reference leaks encountered when combining tp_dealloc with PyType_FromSpec (see `issue #16690 <https://bugs.python.org/16690>`__ for details)

source: `bpo-24458 <https://bugs.python.org/issue24458>`__: Update documentation to cover multi-phase initialization for extension modules (PEP 489). Patch by Petr Viktorin.
fr: `bpo-24458 <https://bugs.python.org/24458>`__: Update documentation to cover multi-phase initialization for extension modules (PEP 489). Patch by Petr Viktorin.

source: `bpo-24351 <https://bugs.python.org/issue24351>`__: Clarify what is meant by "identifier" in the context of string.Template instances.
fr: `bpo-24351 <https://bugs.python.org/24351>`__: Clarify what is meant by "identifier" in the context of string.Template instances.

source: `bpo-24432 <https://bugs.python.org/issue24432>`__: Update Windows builds and OS X 10.5 installer to use OpenSSL 1.0.2c.
fr: `bpo-24432 <https://bugs.python.org/24432>`__: Update Windows builds and OS X 10.5 installer to use OpenSSL 1.0.2c.

source: `bpo-24284 <https://bugs.python.org/issue24284>`__: The startswith and endswith methods of the str class no longer return True when finding the empty string and the indexes are completely out of range.
fr: `bpo-24284 <https://bugs.python.org/24284>`__: The startswith and endswith methods of the str class no longer return True when finding the empty string and the indexes are completely out of range.

source: `bpo-24115 <https://bugs.python.org/issue24115>`__: Update uses of PyObject_IsTrue(), PyObject_Not(), PyObject_IsInstance(), PyObject_RichCompareBool() and _PyDict_Contains() to check for and handle errors correctly.
fr: `bpo-24115 <https://bugs.python.org/24115>`__: Update uses of PyObject_IsTrue(), PyObject_Not(), PyObject_IsInstance(), PyObject_RichCompareBool() and _PyDict_Contains() to check for and handle errors correctly.

source: `bpo-24328 <https://bugs.python.org/issue24328>`__: Fix importing one character extension modules.
fr: `bpo-24328 <https://bugs.python.org/24328>`__: Fix importing one character extension modules.

source: `bpo-11205 <https://bugs.python.org/issue11205>`__: In dictionary displays, evaluate the key before the value.
fr: `bpo-11205 <https://bugs.python.org/11205>`__: In dictionary displays, evaluate the key before the value.

source: `bpo-24285 <https://bugs.python.org/issue24285>`__: Fixed regression that prevented importing extension modules from inside packages. Patch by Petr Viktorin.
fr: `bpo-24285 <https://bugs.python.org/24285>`__: Fixed regression that prevented importing extension modules from inside packages. Patch by Petr Viktorin.

source: `bpo-23247 <https://bugs.python.org/issue23247>`__: Fix a crash in the StreamWriter.reset() of CJK codecs.
fr: `bpo-23247 <https://bugs.python.org/23247>`__: Fix a crash in the StreamWriter.reset() of CJK codecs.

source: `bpo-24270 <https://bugs.python.org/issue24270>`__: Add math.isclose() and cmath.isclose() functions as per PEP 485. Contributed by Chris Barker and Tal Einat.
fr: `bpo-24270 <https://bugs.python.org/24270>`__: Add math.isclose() and cmath.isclose() functions as per PEP 485. Contributed by Chris Barker and Tal Einat.

source: `bpo-5633 <https://bugs.python.org/issue5633>`__: Fixed timeit when the statement is a string and the setup is not.
fr: `bpo-5633 <https://bugs.python.org/5633>`__: Fixed timeit when the statement is a string and the setup is not.

source: `bpo-24326 <https://bugs.python.org/issue24326>`__: Fixed audioop.ratecv() with non-default weightB argument. Original patch by David Moore.
fr: `bpo-24326 <https://bugs.python.org/24326>`__: Fixed audioop.ratecv() with non-default weightB argument. Original patch by David Moore.

source: `bpo-16991 <https://bugs.python.org/issue16991>`__: Add a C implementation of OrderedDict.
fr: `bpo-16991 <https://bugs.python.org/16991>`__: Add a C implementation of OrderedDict.

source: `bpo-23934 <https://bugs.python.org/issue23934>`__: Fix inspect.signature to fail correctly for builtin types lacking signature information. Initial patch by James Powell.
fr: `bpo-23934 <https://bugs.python.org/23934>`__: Fix inspect.signature to fail correctly for builtin types lacking signature information. Initial patch by James Powell.

source: `bpo-24276 <https://bugs.python.org/issue24276>`__: Fixed optimization of property descriptor getter.
fr: `bpo-24276 <https://bugs.python.org/24276>`__: Fixed optimization of property descriptor getter.

source: `bpo-24268 <https://bugs.python.org/issue24268>`__: PEP 489: Multi-phase extension module initialization. Patch by Petr Viktorin.
fr: `bpo-24268 <https://bugs.python.org/24268>`__: PEP 489: Multi-phase extension module initialization. Patch by Petr Viktorin.

source: `bpo-23955 <https://bugs.python.org/issue23955>`__: Add pyvenv.cfg option to suppress registry/environment lookup for generating sys.path on Windows.
fr: `bpo-23955 <https://bugs.python.org/23955>`__: Add pyvenv.cfg option to suppress registry/environment lookup for generating sys.path on Windows.

source: `bpo-24257 <https://bugs.python.org/issue24257>`__: Fixed system error in the comparison of faked types.SimpleNamespace.
fr: `bpo-24257 <https://bugs.python.org/24257>`__: Fixed system error in the comparison of faked types.SimpleNamespace.

source: `bpo-22939 <https://bugs.python.org/issue22939>`__: Fixed integer overflow in iterator object. Patch by Clement Rouault.
fr: `bpo-22939 <https://bugs.python.org/22939>`__: Fixed integer overflow in iterator object. Patch by Clement Rouault.

source: `bpo-23985 <https://bugs.python.org/issue23985>`__: Fix a possible buffer overrun when deleting a slice from the front of a bytearray and then appending some other bytes data.
fr: `bpo-23985 <https://bugs.python.org/23985>`__: Fix a possible buffer overrun when deleting a slice from the front of a bytearray and then appending some other bytes data.

source: `bpo-24102 <https://bugs.python.org/issue24102>`__: Fixed exception type checking in standard error handlers.
fr: `bpo-24102 <https://bugs.python.org/24102>`__: Fixed exception type checking in standard error handlers.

source: `bpo-15027 <https://bugs.python.org/issue15027>`__: The UTF-32 encoder is now 3x to 7x faster.
fr: `bpo-15027 <https://bugs.python.org/15027>`__: The UTF-32 encoder is now 3x to 7x faster.

source: `bpo-23290 <https://bugs.python.org/issue23290>`__: Optimize set_merge() for cases where the target is empty. (Contributed by Serhiy Storchaka.)
fr: `bpo-23290 <https://bugs.python.org/23290>`__: Optimize set_merge() for cases where the target is empty. (Contributed by Serhiy Storchaka.)

source: `bpo-2292 <https://bugs.python.org/issue2292>`__: PEP 448: Additional Unpacking Generalizations.
fr: `bpo-2292 <https://bugs.python.org/2292>`__: PEP 448: Additional Unpacking Generalizations.

source: `bpo-24096 <https://bugs.python.org/issue24096>`__: Make warnings.warn_explicit more robust against mutation of the warnings.filters list.
fr: `bpo-24096 <https://bugs.python.org/24096>`__: Make warnings.warn_explicit more robust against mutation of the warnings.filters list.

source: `bpo-23996 <https://bugs.python.org/issue23996>`__: Avoid a crash when a delegated generator raises an unnormalized StopIteration exception. Patch by Stefan Behnel.
fr: `bpo-23996 <https://bugs.python.org/23996>`__: Avoid a crash when a delegated generator raises an unnormalized StopIteration exception. Patch by Stefan Behnel.

source: `bpo-23910 <https://bugs.python.org/issue23910>`__: Optimize property() getter calls. Patch by Joe Jevnik.
fr: `bpo-23910 <https://bugs.python.org/23910>`__: Optimize property() getter calls. Patch by Joe Jevnik.

source: `bpo-23911 <https://bugs.python.org/issue23911>`__: Move path-based importlib bootstrap code to a separate frozen module.
fr: `bpo-23911 <https://bugs.python.org/23911>`__: Move path-based importlib bootstrap code to a separate frozen module.

source: `bpo-24192 <https://bugs.python.org/issue24192>`__: Fix namespace package imports.
fr: `bpo-24192 <https://bugs.python.org/24192>`__: Fix namespace package imports.

source: `bpo-24022 <https://bugs.python.org/issue24022>`__: Fix tokenizer crash when processing undecodable source code.
fr: `bpo-24022 <https://bugs.python.org/24022>`__: Fix tokenizer crash when processing undecodable source code.

source: `bpo-9951 <https://bugs.python.org/issue9951>`__: Added a hex() method to bytes, bytearray, and memoryview.
fr: `bpo-9951 <https://bugs.python.org/9951>`__: Added a hex() method to bytes, bytearray, and memoryview.

source: `bpo-22906 <https://bugs.python.org/issue22906>`__: PEP 479: Change StopIteration handling inside generators.
fr: `bpo-22906 <https://bugs.python.org/22906>`__: PEP 479: Change StopIteration handling inside generators.

source: `bpo-24017 <https://bugs.python.org/issue24017>`__: PEP 492: Coroutines with async and await syntax.
fr: `bpo-24017 <https://bugs.python.org/24017>`__: PEP 492: Coroutines with async and await syntax.

source: `bpo-14373 <https://bugs.python.org/issue14373>`__: Added C implementation of functools.lru_cache(). Based on patches by Matt Joiner and Alexey Kachayev.
fr: `bpo-14373 <https://bugs.python.org/14373>`__: Added C implementation of functools.lru_cache(). Based on patches by Matt Joiner and Alexey Kachayev.

source: `bpo-24230 <https://bugs.python.org/issue24230>`__: The tempfile module now accepts bytes for prefix, suffix and dir parameters and returns bytes in such situations (matching the os module APIs).
fr: `bpo-24230 <https://bugs.python.org/24230>`__: The tempfile module now accepts bytes for prefix, suffix and dir parameters and returns bytes in such situations (matching the os module APIs).
