Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-14285 <https://bugs.python.org/issue14285>`__: When executing a package with the "python -m package" option, and package initialization fails, a proper traceback is now reported. The "runpy" module now lets exceptions from package initialization pass back to the caller, rather than raising ImportError.
fr: `bpo-14285 <https://bugs.python.org/14285>`__: When executing a package with the "python -m package" option, and package initialization fails, a proper traceback is now reported. The "runpy" module now lets exceptions from package initialization pass back to the caller, rather than raising ImportError.

source: `bpo-19771 <https://bugs.python.org/issue19771>`__: Also in runpy and the "-m" option, omit the irrelevant message ". . . is a package and cannot be directly executed" if the package could not even be initialized (e.g. due to a bad ``*.pyc`` file).
fr: `bpo-19771 <https://bugs.python.org/19771>`__: Also in runpy and the "-m" option, omit the irrelevant message ". . . is a package and cannot be directly executed" if the package could not even be initialized (e.g. due to a bad ``*.pyc`` file).

source: `bpo-25177 <https://bugs.python.org/issue25177>`__: Fixed problem with the mean of very small and very large numbers. As a side effect, statistics.mean and statistics.variance should be significantly faster.
fr: `bpo-25177 <https://bugs.python.org/25177>`__: Fixed problem with the mean of very small and very large numbers. As a side effect, statistics.mean and statistics.variance should be significantly faster.

source: `bpo-25718 <https://bugs.python.org/issue25718>`__: Fixed copying object with state with boolean value is false.
fr: `bpo-25718 <https://bugs.python.org/25718>`__: Fixed copying object with state with boolean value is false.

source: `bpo-10131 <https://bugs.python.org/issue10131>`__: Fixed deep copying of minidom documents. Based on patch by Marian Ganisin.
fr: `bpo-10131 <https://bugs.python.org/10131>`__: Fixed deep copying of minidom documents. Based on patch by Marian Ganisin.

source: `bpo-7990 <https://bugs.python.org/issue7990>`__: dir() on ElementTree.Element now lists properties: "tag", "text", "tail" and "attrib". Original patch by Santoso Wijaya.
fr: `bpo-7990 <https://bugs.python.org/7990>`__: dir() on ElementTree.Element now lists properties: "tag", "text", "tail" and "attrib". Original patch by Santoso Wijaya.

source: `bpo-25725 <https://bugs.python.org/issue25725>`__: Fixed a reference leak in pickle.loads() when unpickling invalid data including tuple instructions.
fr: `bpo-25725 <https://bugs.python.org/25725>`__: Fixed a reference leak in pickle.loads() when unpickling invalid data including tuple instructions.

source: `bpo-25663 <https://bugs.python.org/issue25663>`__: In the Readline completer, avoid listing duplicate global names, and search the global namespace before searching builtins.
fr: `bpo-25663 <https://bugs.python.org/25663>`__: In the Readline completer, avoid listing duplicate global names, and search the global namespace before searching builtins.

source: `bpo-25688 <https://bugs.python.org/issue25688>`__: Fixed file leak in ElementTree.iterparse() raising an error.
fr: `bpo-25688 <https://bugs.python.org/25688>`__: Fixed file leak in ElementTree.iterparse() raising an error.

source: `bpo-23914 <https://bugs.python.org/issue23914>`__: Fixed SystemError raised by unpickler on broken pickle data.
fr: `bpo-23914 <https://bugs.python.org/23914>`__: Fixed SystemError raised by unpickler on broken pickle data.

source: `bpo-25691 <https://bugs.python.org/issue25691>`__: Fixed crash on deleting ElementTree.Element attributes.
fr: `bpo-25691 <https://bugs.python.org/25691>`__: Fixed crash on deleting ElementTree.Element attributes.

source: `bpo-25624 <https://bugs.python.org/issue25624>`__: ZipFile now always writes a ZIP_STORED header for directory entries. Patch by Dingyuan Wang.
fr: `bpo-25624 <https://bugs.python.org/25624>`__: ZipFile now always writes a ZIP_STORED header for directory entries. Patch by Dingyuan Wang.

source: `bpo-25626 <https://bugs.python.org/issue25626>`__: Change three zlib functions to accept sizes that fit in Py_ssize_t, but internally cap those sizes to UINT_MAX. This resolves a regression in 3.5 where GzipFile.read() failed to read chunks larger than 2 or 4 GiB. The change affects the zlib.Decompress.decompress() max_length parameter, the zlib.decompress() bufsize parameter, and the zlib.Decompress.flush() length parameter.
fr: `bpo-25626 <https://bugs.python.org/25626>`__: Change three zlib functions to accept sizes that fit in Py_ssize_t, but internally cap those sizes to UINT_MAX. This resolves a regression in 3.5 where GzipFile.read() failed to read chunks larger than 2 or 4 GiB. The change affects the zlib.Decompress.decompress() max_length parameter, the zlib.decompress() bufsize parameter, and the zlib.Decompress.flush() length parameter.

source: `bpo-25583 <https://bugs.python.org/issue25583>`__: Avoid incorrect errors raised by os.makedirs(exist_ok=True) when the OS gives priority to errors such as EACCES over EEXIST.
fr: `bpo-25583 <https://bugs.python.org/25583>`__: Avoid incorrect errors raised by os.makedirs(exist_ok=True) when the OS gives priority to errors such as EACCES over EEXIST.

source: `bpo-25593 <https://bugs.python.org/issue25593>`__: Change semantics of EventLoop.stop() in asyncio.
fr: `bpo-25593 <https://bugs.python.org/25593>`__: Change semantics of EventLoop.stop() in asyncio.

source: `bpo-6973 <https://bugs.python.org/issue6973>`__: When we know a subprocess.Popen process has died, do not allow the send_signal(), terminate(), or kill() methods to do anything as they could potentially signal a different process.
fr: `bpo-6973 <https://bugs.python.org/6973>`__: When we know a subprocess.Popen process has died, do not allow the send_signal(), terminate(), or kill() methods to do anything as they could potentially signal a different process.

source: `bpo-23883 <https://bugs.python.org/issue23883>`__: Added missing APIs to __all__ to match the documented APIs for the following modules: calendar, csv, enum, fileinput, ftplib, logging, optparse, tarfile, threading and wave. Also added a test.support.check__all__() helper. Patches by Jacek Kołodziej, Mauro S. M. Rodrigues and Joel Taddei.
fr: `bpo-23883 <https://bugs.python.org/23883>`__: Added missing APIs to __all__ to match the documented APIs for the following modules: calendar, csv, enum, fileinput, ftplib, logging, optparse, tarfile, threading and wave. Also added a test.support.check__all__() helper. Patches by Jacek Kołodziej, Mauro S. M. Rodrigues and Joel Taddei.

source: `bpo-25590 <https://bugs.python.org/issue25590>`__: In the Readline completer, only call getattr() once per attribute. Also complete names of attributes such as properties and slots which are listed by dir() but not yet created on an instance.
fr: `bpo-25590 <https://bugs.python.org/25590>`__: In the Readline completer, only call getattr() once per attribute. Also complete names of attributes such as properties and slots which are listed by dir() but not yet created on an instance.

source: `bpo-25498 <https://bugs.python.org/issue25498>`__: Fix a crash when garbage-collecting ctypes objects created by wrapping a memoryview. This was a regression made in 3.5a1. Based on patch by Eryksun.
fr: `bpo-25498 <https://bugs.python.org/25498>`__: Fix a crash when garbage-collecting ctypes objects created by wrapping a memoryview. This was a regression made in 3.5a1. Based on patch by Eryksun.

source: `bpo-25584 <https://bugs.python.org/issue25584>`__: Added "escape" to the __all__ list in the glob module.
fr: `bpo-25584 <https://bugs.python.org/25584>`__: Added "escape" to the __all__ list in the glob module.

source: `bpo-25584 <https://bugs.python.org/issue25584>`__: Fixed recursive glob() with patterns starting with '\*\*'.
fr: `bpo-25584 <https://bugs.python.org/25584>`__: Fixed recursive glob() with patterns starting with '\*\*'.

source: `bpo-25446 <https://bugs.python.org/issue25446>`__: Fix regression in smtplib's AUTH LOGIN support.
fr: `bpo-25446 <https://bugs.python.org/25446>`__: Fix regression in smtplib's AUTH LOGIN support.

source: `bpo-18010 <https://bugs.python.org/issue18010>`__: Fix the pydoc web server's module search function to handle exceptions from importing packages.
fr: `bpo-18010 <https://bugs.python.org/18010>`__: Fix the pydoc web server's module search function to handle exceptions from importing packages.

source: `bpo-25554 <https://bugs.python.org/issue25554>`__: Got rid of circular references in regular expression parsing.
fr: `bpo-25554 <https://bugs.python.org/25554>`__: Got rid of circular references in regular expression parsing.

source: `bpo-18973 <https://bugs.python.org/issue18973>`__: Command-line interface of the calendar module now uses argparse instead of optparse.
fr: `bpo-18973 <https://bugs.python.org/18973>`__: Command-line interface of the calendar module now uses argparse instead of optparse.

source: `bpo-25510 <https://bugs.python.org/issue25510>`__: fileinput.FileInput.readline() now returns b'' instead of '' at the end if the FileInput was opened with binary mode. Patch by Ryosuke Ito.
fr: `bpo-25510 <https://bugs.python.org/25510>`__: fileinput.FileInput.readline() now returns b'' instead of '' at the end if the FileInput was opened with binary mode. Patch by Ryosuke Ito.

source: `bpo-25503 <https://bugs.python.org/issue25503>`__: Fixed inspect.getdoc() for inherited docstrings of properties. Original patch by John Mark Vandenberg.
fr: `bpo-25503 <https://bugs.python.org/25503>`__: Fixed inspect.getdoc() for inherited docstrings of properties. Original patch by John Mark Vandenberg.

source: `bpo-25515 <https://bugs.python.org/issue25515>`__: Always use os.urandom as a source of randomness in uuid.uuid4.
fr: `bpo-25515 <https://bugs.python.org/25515>`__: Always use os.urandom as a source of randomness in uuid.uuid4.

source: `bpo-21827 <https://bugs.python.org/issue21827>`__: Fixed textwrap.dedent() for the case when largest common whitespace is a substring of smallest leading whitespace. Based on patch by Robert Li.
fr: `bpo-21827 <https://bugs.python.org/21827>`__: Fixed textwrap.dedent() for the case when largest common whitespace is a substring of smallest leading whitespace. Based on patch by Robert Li.

source: `bpo-25447 <https://bugs.python.org/issue25447>`__: The lru_cache() wrapper objects now can be copied and pickled (by returning the original object unchanged).
fr: `bpo-25447 <https://bugs.python.org/25447>`__: The lru_cache() wrapper objects now can be copied and pickled (by returning the original object unchanged).

source: `bpo-25390 <https://bugs.python.org/issue25390>`__: typing: Don't crash on Union[str, Pattern].
fr: `bpo-25390 <https://bugs.python.org/25390>`__: typing: Don't crash on Union[str, Pattern].

source: `bpo-25441 <https://bugs.python.org/issue25441>`__: asyncio: Raise error from drain() when socket is closed.
fr: `bpo-25441 <https://bugs.python.org/25441>`__: asyncio: Raise error from drain() when socket is closed.

source: `bpo-25410 <https://bugs.python.org/issue25410>`__: Cleaned up and fixed minor bugs in C implementation of OrderedDict.
fr: `bpo-25410 <https://bugs.python.org/25410>`__: Cleaned up and fixed minor bugs in C implementation of OrderedDict.

source: `bpo-25411 <https://bugs.python.org/issue25411>`__: Improved Unicode support in SMTPHandler through better use of the email package. Thanks to user simon04 for the patch.
fr: `bpo-25411 <https://bugs.python.org/25411>`__: Improved Unicode support in SMTPHandler through better use of the email package. Thanks to user simon04 for the patch.

source: `bpo-25407 <https://bugs.python.org/issue25407>`__: Remove mentions of the formatter module being removed in Python 3.6.
fr: `bpo-25407 <https://bugs.python.org/25407>`__: Remove mentions of the formatter module being removed in Python 3.6.

source: `bpo-25406 <https://bugs.python.org/issue25406>`__: Fixed a bug in C implementation of OrderedDict.move_to_end() that caused segmentation fault or hang in iterating after moving several items to the start of ordered dict.
fr: `bpo-25406 <https://bugs.python.org/25406>`__: Fixed a bug in C implementation of OrderedDict.move_to_end() that caused segmentation fault or hang in iterating after moving several items to the start of ordered dict.

source: `bpo-25382 <https://bugs.python.org/issue25382>`__: pickletools.dis() now outputs implicit memo index for the MEMOIZE opcode.
fr: `bpo-25382 <https://bugs.python.org/25382>`__: pickletools.dis() now outputs implicit memo index for the MEMOIZE opcode.

source: `bpo-25357 <https://bugs.python.org/issue25357>`__: Add an optional newline paramer to binascii.b2a_base64(). base64.b64encode() uses it to avoid a memory copy.
fr: `bpo-25357 <https://bugs.python.org/25357>`__: Add an optional newline paramer to binascii.b2a_base64(). base64.b64encode() uses it to avoid a memory copy.

source: `bpo-24164 <https://bugs.python.org/issue24164>`__: Objects that need calling ``__new__`` with keyword arguments, can now be pickled using pickle protocols older than protocol version 4.
fr: `bpo-24164 <https://bugs.python.org/24164>`__: Objects that need calling ``__new__`` with keyword arguments, can now be pickled using pickle protocols older than protocol version 4.

source: `bpo-25364 <https://bugs.python.org/issue25364>`__: zipfile now works in threads disabled builds.
fr: `bpo-25364 <https://bugs.python.org/25364>`__: zipfile now works in threads disabled builds.

source: `bpo-25328 <https://bugs.python.org/issue25328>`__: smtpd's SMTPChannel now correctly raises a ValueError if both decode_data and enable_SMTPUTF8 are set to true.
fr: `bpo-25328 <https://bugs.python.org/25328>`__: smtpd's SMTPChannel now correctly raises a ValueError if both decode_data and enable_SMTPUTF8 are set to true.

source: `bpo-16099 <https://bugs.python.org/issue16099>`__: RobotFileParser now supports Crawl-delay and Request-rate extensions. Patch by Nikolay Bogoychev.
fr: `bpo-16099 <https://bugs.python.org/16099>`__: RobotFileParser now supports Crawl-delay and Request-rate extensions. Patch by Nikolay Bogoychev.

source: `bpo-25316 <https://bugs.python.org/issue25316>`__: distutils raises OSError instead of DistutilsPlatformError when MSVC is not installed.
fr: `bpo-25316 <https://bugs.python.org/25316>`__: distutils raises OSError instead of DistutilsPlatformError when MSVC is not installed.

source: `bpo-25380 <https://bugs.python.org/issue25380>`__: Fixed protocol for the STACK_GLOBAL opcode in pickletools.opcodes.
fr: `bpo-25380 <https://bugs.python.org/25380>`__: Fixed protocol for the STACK_GLOBAL opcode in pickletools.opcodes.

source: `bpo-23972 <https://bugs.python.org/issue23972>`__: Updates asyncio datagram create method allowing reuseport and reuseaddr socket options to be set prior to binding the socket. Mirroring the existing asyncio create_server method the reuseaddr option for datagram sockets defaults to True if the O/S is 'posix' (except if the platform is Cygwin). Patch by Chris Laws.
fr: `bpo-23972 <https://bugs.python.org/23972>`__: Updates asyncio datagram create method allowing reuseport and reuseaddr socket options to be set prior to binding the socket. Mirroring the existing asyncio create_server method the reuseaddr option for datagram sockets defaults to True if the O/S is 'posix' (except if the platform is Cygwin). Patch by Chris Laws.

source: `bpo-25304 <https://bugs.python.org/issue25304>`__: Add asyncio.run_coroutine_threadsafe(). This lets you submit a coroutine to a loop from another thread, returning a concurrent.futures.Future. By Vincent Michel.
fr: `bpo-25304 <https://bugs.python.org/25304>`__: Add asyncio.run_coroutine_threadsafe(). This lets you submit a coroutine to a loop from another thread, returning a concurrent.futures.Future. By Vincent Michel.

source: `bpo-25232 <https://bugs.python.org/issue25232>`__: Fix CGIRequestHandler to split the query from the URL at the first question mark (?) rather than the last. Patch from Xiang Zhang.
fr: `bpo-25232 <https://bugs.python.org/25232>`__: Fix CGIRequestHandler to split the query from the URL at the first question mark (?) rather than the last. Patch from Xiang Zhang.

source: `bpo-24657 <https://bugs.python.org/issue24657>`__: Prevent CGIRequestHandler from collapsing slashes in the query part of the URL as if it were a path. Patch from Xiang Zhang.
fr: `bpo-24657 <https://bugs.python.org/24657>`__: Prevent CGIRequestHandler from collapsing slashes in the query part of the URL as if it were a path. Patch from Xiang Zhang.

source: `bpo-25287 <https://bugs.python.org/issue25287>`__: Don't add crypt.METHOD_CRYPT to crypt.methods if it's not supported. Check if it is supported, it may not be supported on OpenBSD for example.
fr: `bpo-25287 <https://bugs.python.org/25287>`__: Don't add crypt.METHOD_CRYPT to crypt.methods if it's not supported. Check if it is supported, it may not be supported on OpenBSD for example.

source: `bpo-23600 <https://bugs.python.org/issue23600>`__: Default implementation of tzinfo.fromutc() was returning wrong results in some cases.
fr: `bpo-23600 <https://bugs.python.org/23600>`__: Default implementation of tzinfo.fromutc() was returning wrong results in some cases.

source: `bpo-25203 <https://bugs.python.org/issue25203>`__: Failed readline.set_completer_delims() no longer left the module in inconsistent state.
fr: `bpo-25203 <https://bugs.python.org/25203>`__: Failed readline.set_completer_delims() no longer left the module in inconsistent state.

source: `bpo-25011 <https://bugs.python.org/issue25011>`__: rlcompleter now omits private and special attribute names unless the prefix starts with underscores.
fr: `bpo-25011 <https://bugs.python.org/25011>`__: rlcompleter now omits private and special attribute names unless the prefix starts with underscores.

source: `bpo-25209 <https://bugs.python.org/issue25209>`__: rlcompleter now can add a space or a colon after completed keyword.
fr: `bpo-25209 <https://bugs.python.org/25209>`__: rlcompleter now can add a space or a colon after completed keyword.

source: `bpo-22241 <https://bugs.python.org/issue22241>`__: timezone.utc name is now plain 'UTC', not 'UTC-00:00'.
fr: `bpo-22241 <https://bugs.python.org/22241>`__: timezone.utc name is now plain 'UTC', not 'UTC-00:00'.

source: `bpo-23517 <https://bugs.python.org/issue23517>`__: fromtimestamp() and utcfromtimestamp() methods of datetime.datetime now round microseconds to nearest with ties going to nearest even integer (ROUND_HALF_EVEN), as round(float), instead of rounding towards -Infinity (ROUND_FLOOR).
fr: `bpo-23517 <https://bugs.python.org/23517>`__: fromtimestamp() and utcfromtimestamp() methods of datetime.datetime now round microseconds to nearest with ties going to nearest even integer (ROUND_HALF_EVEN), as round(float), instead of rounding towards -Infinity (ROUND_FLOOR).

source: `bpo-23552 <https://bugs.python.org/issue23552>`__: Timeit now warns when there is substantial (4x) variance between best and worst times. Patch from Serhiy Storchaka.
fr: `bpo-23552 <https://bugs.python.org/23552>`__: Timeit now warns when there is substantial (4x) variance between best and worst times. Patch from Serhiy Storchaka.

source: `bpo-24633 <https://bugs.python.org/issue24633>`__: site-packages/README -> README.txt.
fr: `bpo-24633 <https://bugs.python.org/24633>`__: site-packages/README -> README.txt.

source: `bpo-24879 <https://bugs.python.org/issue24879>`__: help() and pydoc can now list named tuple fields in the order they were defined rather than alphabetically. The ordering is determined by the _fields attribute if present.
fr: `bpo-24879 <https://bugs.python.org/24879>`__: help() and pydoc can now list named tuple fields in the order they were defined rather than alphabetically. The ordering is determined by the _fields attribute if present.

source: `bpo-24874 <https://bugs.python.org/issue24874>`__: Improve speed of itertools.cycle() and make its pickle more compact.
fr: `bpo-24874 <https://bugs.python.org/24874>`__: Improve speed of itertools.cycle() and make its pickle more compact.

source: `bpo-20059 <https://bugs.python.org/issue20059>`__: urllib.parse raises ValueError on all invalid ports. Patch by Martin Panter.
fr: `bpo-20059 <https://bugs.python.org/20059>`__: urllib.parse raises ValueError on all invalid ports. Patch by Martin Panter.

source: `bpo-24360 <https://bugs.python.org/issue24360>`__: Improve __repr__ of argparse.Namespace() for invalid identifiers. Patch by Matthias Bussonnier.
fr: `bpo-24360 <https://bugs.python.org/24360>`__: Improve __repr__ of argparse.Namespace() for invalid identifiers. Patch by Matthias Bussonnier.

source: `bpo-23426 <https://bugs.python.org/issue23426>`__: run_setup was broken in distutils. Patch from Alexander Belopolsky.
fr: `bpo-23426 <https://bugs.python.org/23426>`__: run_setup was broken in distutils. Patch from Alexander Belopolsky.

source: `bpo-13938 <https://bugs.python.org/issue13938>`__: 2to3 converts StringTypes to a tuple. Patch from Mark Hammond.
fr: `bpo-13938 <https://bugs.python.org/13938>`__: 2to3 converts StringTypes to a tuple. Patch from Mark Hammond.

source: `bpo-2091 <https://bugs.python.org/issue2091>`__: open() accepted a 'U' mode string containing '+', but 'U' can only be used with 'r'. Patch from Jeff Balogh and John O'Connor.
fr: `bpo-2091 <https://bugs.python.org/2091>`__: open() accepted a 'U' mode string containing '+', but 'U' can only be used with 'r'. Patch from Jeff Balogh and John O'Connor.

source: `bpo-8585 <https://bugs.python.org/issue8585>`__: improved tests for zipimporter2. Patch from Mark Lawrence.
fr: `bpo-8585 <https://bugs.python.org/8585>`__: improved tests for zipimporter2. Patch from Mark Lawrence.

source: `bpo-18622 <https://bugs.python.org/issue18622>`__: unittest.mock.mock_open().reset_mock would recurse infinitely. Patch from Nicola Palumbo and Laurent De Buyst.
fr: `bpo-18622 <https://bugs.python.org/18622>`__: unittest.mock.mock_open().reset_mock would recurse infinitely. Patch from Nicola Palumbo and Laurent De Buyst.

source: `bpo-24426 <https://bugs.python.org/issue24426>`__: Fast searching optimization in regular expressions now works for patterns that starts with capturing groups. Fast searching optimization now can't be disabled at compile time.
fr: `bpo-24426 <https://bugs.python.org/24426>`__: Fast searching optimization in regular expressions now works for patterns that starts with capturing groups. Fast searching optimization now can't be disabled at compile time.

source: `bpo-23661 <https://bugs.python.org/issue23661>`__: unittest.mock side_effects can now be exceptions again. This was a regression vs Python 3.4. Patch from Ignacio Rossi
fr: `bpo-23661 <https://bugs.python.org/23661>`__: unittest.mock side_effects can now be exceptions again. This was a regression vs Python 3.4. Patch from Ignacio Rossi

source: `bpo-13248 <https://bugs.python.org/issue13248>`__: Remove deprecated inspect.getmoduleinfo function.
fr: `bpo-13248 <https://bugs.python.org/13248>`__: Remove deprecated inspect.getmoduleinfo function.

source: `bpo-25578 <https://bugs.python.org/issue25578>`__: Fix (another) memory leak in SSLSocket.getpeercer().
fr: `bpo-25578 <https://bugs.python.org/25578>`__: Fix (another) memory leak in SSLSocket.getpeercer().

source: `bpo-25530 <https://bugs.python.org/issue25530>`__: Disable the vulnerable SSLv3 protocol by default when creating ssl.SSLContext.
fr: `bpo-25530 <https://bugs.python.org/25530>`__: Disable the vulnerable SSLv3 protocol by default when creating ssl.SSLContext.
