Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-22821 <https://bugs.python.org/issue22821>`__: Fixed fcntl() with integer argument on 64-bit big-endian platforms.
fr: `bpo-22821 <https://bugs.python.org/22821>`__: Fixed fcntl() with integer argument on 64-bit big-endian platforms.

source: `bpo-21650 <https://bugs.python.org/issue21650>`__: Add an `--sort-keys` option to json.tool CLI.
fr: `bpo-21650 <https://bugs.python.org/21650>`__: Add an `--sort-keys` option to json.tool CLI.

source: `bpo-22824 <https://bugs.python.org/issue22824>`__: Updated reprlib output format for sets to use set literals. Patch contributed by Berker Peksag.
fr: `bpo-22824 <https://bugs.python.org/22824>`__: Updated reprlib output format for sets to use set literals. Patch contributed by Berker Peksag.

source: `bpo-22824 <https://bugs.python.org/issue22824>`__: Updated reprlib output format for arrays to display empty arrays without an unnecessary empty list. Suggested by Serhiy Storchaka.
fr: `bpo-22824 <https://bugs.python.org/22824>`__: Updated reprlib output format for arrays to display empty arrays without an unnecessary empty list. Suggested by Serhiy Storchaka.

source: `bpo-22406 <https://bugs.python.org/issue22406>`__: Fixed the uu_codec codec incorrectly ported to 3.x. Based on patch by Martin Panter.
fr: `bpo-22406 <https://bugs.python.org/22406>`__: Fixed the uu_codec codec incorrectly ported to 3.x. Based on patch by Martin Panter.

source: `bpo-17293 <https://bugs.python.org/issue17293>`__: uuid.getnode() now determines MAC address on AIX using netstat. Based on patch by Aivars Kalvāns.
fr: `bpo-17293 <https://bugs.python.org/17293>`__: uuid.getnode() now determines MAC address on AIX using netstat. Based on patch by Aivars Kalv�?ns.

source: `bpo-22769 <https://bugs.python.org/issue22769>`__: Fixed ttk.Treeview.tag_has() when called without arguments.
fr: `bpo-22769 <https://bugs.python.org/22769>`__: Fixed ttk.Treeview.tag_has() when called without arguments.

source: `bpo-22417 <https://bugs.python.org/issue22417>`__: Verify certificates by default in httplib (PEP 476).
fr: `bpo-22417 <https://bugs.python.org/22417>`__: Verify certificates by default in httplib (PEP 476).

source: `bpo-22775 <https://bugs.python.org/issue22775>`__: Fixed unpickling of http.cookies.SimpleCookie with protocol 2 and above. Patch by Tim Graham.
fr: `bpo-22775 <https://bugs.python.org/22775>`__: Fixed unpickling of http.cookies.SimpleCookie with protocol 2 and above. Patch by Tim Graham.

source: `bpo-22776 <https://bugs.python.org/issue22776>`__: Brought excluded code into the scope of a try block in SysLogHandler.emit().
fr: `bpo-22776 <https://bugs.python.org/22776>`__: Brought excluded code into the scope of a try block in SysLogHandler.emit().

source: `bpo-22665 <https://bugs.python.org/issue22665>`__: Add missing get_terminal_size and SameFileError to shutil.__all__.
fr: `bpo-22665 <https://bugs.python.org/22665>`__: Add missing get_terminal_size and SameFileError to shutil.__all__.

source: `bpo-6623 <https://bugs.python.org/issue6623>`__: Remove deprecated Netrc class in the ftplib module. Patch by Matt Chaput.
fr: `bpo-6623 <https://bugs.python.org/6623>`__: Remove deprecated Netrc class in the ftplib module. Patch by Matt Chaput.

source: `bpo-17381 <https://bugs.python.org/issue17381>`__: Fixed handling of case-insensitive ranges in regular expressions.
fr: `bpo-17381 <https://bugs.python.org/17381>`__: Fixed handling of case-insensitive ranges in regular expressions.

source: `bpo-22410 <https://bugs.python.org/issue22410>`__: Module level functions in the re module now cache compiled locale-dependent regular expressions taking into account the locale.
fr: `bpo-22410 <https://bugs.python.org/22410>`__: Module level functions in the re module now cache compiled locale-dependent regular expressions taking into account the locale.

source: `bpo-22759 <https://bugs.python.org/issue22759>`__: Query methods on pathlib.Path() (exists(), is_dir(), etc.) now return False when the underlying stat call raises NotADirectoryError.
fr: `bpo-22759 <https://bugs.python.org/22759>`__: Query methods on pathlib.Path() (exists(), is_dir(), etc.) now return False when the underlying stat call raises NotADirectoryError.

source: `bpo-8876 <https://bugs.python.org/issue8876>`__: distutils now falls back to copying files when hard linking doesn't work. This allows use with special filesystems such as VirtualBox shared folders.
fr: `bpo-8876 <https://bugs.python.org/8876>`__: distutils now falls back to copying files when hard linking doesn't work. This allows use with special filesystems such as VirtualBox shared folders.

source: `bpo-22217 <https://bugs.python.org/issue22217>`__: Implemented reprs of classes in the zipfile module.
fr: `bpo-22217 <https://bugs.python.org/22217>`__: Implemented reprs of classes in the zipfile module.

source: `bpo-22457 <https://bugs.python.org/issue22457>`__: Honour load_tests in the start_dir of discovery.
fr: `bpo-22457 <https://bugs.python.org/22457>`__: Honour load_tests in the start_dir of discovery.

source: `bpo-18216 <https://bugs.python.org/issue18216>`__: gettext now raises an error when a .mo file has an unsupported major version number. Patch by Aaron Hill.
fr: `bpo-18216 <https://bugs.python.org/18216>`__: gettext now raises an error when a .mo file has an unsupported major version number. Patch by Aaron Hill.

source: `bpo-13918 <https://bugs.python.org/issue13918>`__: Provide a locale.delocalize() function which can remove locale-specific number formatting from a string representing a number, without then converting it to a specific type. Patch by Cédric Krier.
fr: `bpo-13918 <https://bugs.python.org/13918>`__: Provide a locale.delocalize() function which can remove locale-specific number formatting from a string representing a number, without then converting it to a specific type. Patch by Cédric Krier.

source: `bpo-22676 <https://bugs.python.org/issue22676>`__: Make the pickling of global objects which don't have a __module__ attribute less slow.
fr: `bpo-22676 <https://bugs.python.org/22676>`__: Make the pickling of global objects which don't have a __module__ attribute less slow.

source: `bpo-18853 <https://bugs.python.org/issue18853>`__: Fixed ResourceWarning in shlex.__nain__.
fr: `bpo-18853 <https://bugs.python.org/18853>`__: Fixed ResourceWarning in shlex.__nain__.

source: `bpo-9351 <https://bugs.python.org/issue9351>`__: Defaults set with set_defaults on an argparse subparser are no longer ignored when also set on the parent parser.
fr: `bpo-9351 <https://bugs.python.org/9351>`__: Defaults set with set_defaults on an argparse subparser are no longer ignored when also set on the parent parser.

source: `bpo-7559 <https://bugs.python.org/issue7559>`__: unittest test loading ImportErrors are reported as import errors with their import exception rather than as attribute errors after the import has already failed.
fr: `bpo-7559 <https://bugs.python.org/7559>`__: unittest test loading ImportErrors are reported as import errors with their import exception rather than as attribute errors after the import has already failed.

source: `bpo-19746 <https://bugs.python.org/issue19746>`__: Make it possible to examine the errors from unittest discovery without executing the test suite. The new `errors` attribute on TestLoader exposes these non-fatal errors encountered during discovery.
fr: `bpo-19746 <https://bugs.python.org/19746>`__: Make it possible to examine the errors from unittest discovery without executing the test suite. The new `errors` attribute on TestLoader exposes these non-fatal errors encountered during discovery.

source: `bpo-21991 <https://bugs.python.org/issue21991>`__: Make email.headerregistry's header 'params' attributes be read-only (MappingProxyType). Previously the dictionary was modifiable but a new one was created on each access of the attribute.
fr: `bpo-21991 <https://bugs.python.org/21991>`__: Make email.headerregistry's header 'params' attributes be read-only (MappingProxyType). Previously the dictionary was modifiable but a new one was created on each access of the attribute.

source: `bpo-22638 <https://bugs.python.org/issue22638>`__: SSLv3 is now disabled throughout the standard library. It can still be enabled by instantiating a SSLContext manually.
fr: `bpo-22638 <https://bugs.python.org/22638>`__: SSLv3 is now disabled throughout the standard library. It can still be enabled by instantiating a SSLContext manually.

source: `bpo-22641 <https://bugs.python.org/issue22641>`__: In asyncio, the default SSL context for client connections is now created using ssl.create_default_context(), for stronger security.
fr: `bpo-22641 <https://bugs.python.org/22641>`__: In asyncio, the default SSL context for client connections is now created using ssl.create_default_context(), for stronger security.

source: `bpo-17401 <https://bugs.python.org/issue17401>`__: Include closefd in io.FileIO repr.
fr: `bpo-17401 <https://bugs.python.org/17401>`__: Include closefd in io.FileIO repr.

source: `bpo-21338 <https://bugs.python.org/issue21338>`__: Add silent mode for compileall. quiet parameters of compile_{dir, file, path} functions now have a multilevel value. Also, -q option of the CLI now have a multilevel value. Patch by Thomas Kluyver.
fr: `bpo-21338 <https://bugs.python.org/21338>`__: Add silent mode for compileall. quiet parameters of compile_{dir, file, path} functions now have a multilevel value. Also, -q option of the CLI now have a multilevel value. Patch by Thomas Kluyver.

source: `bpo-20152 <https://bugs.python.org/issue20152>`__: Convert the array and cmath modules to Argument Clinic.
fr: `bpo-20152 <https://bugs.python.org/20152>`__: Convert the array and cmath modules to Argument Clinic.

source: `bpo-18643 <https://bugs.python.org/issue18643>`__: Add socket.socketpair() on Windows.
fr: `bpo-18643 <https://bugs.python.org/18643>`__: Add socket.socketpair() on Windows.

source: `bpo-22435 <https://bugs.python.org/issue22435>`__: Fix a file descriptor leak when socketserver bind fails.
fr: `bpo-22435 <https://bugs.python.org/22435>`__: Fix a file descriptor leak when socketserver bind fails.

source: `bpo-13096 <https://bugs.python.org/issue13096>`__: Fixed segfault in CTypes POINTER handling of large values.
fr: `bpo-13096 <https://bugs.python.org/13096>`__: Fixed segfault in CTypes POINTER handling of large values.

source: `bpo-11694 <https://bugs.python.org/issue11694>`__: Raise ConversionError in xdrlib as documented. Patch by Filip Gruszczyński and Claudiu Popa.
fr: `bpo-11694 <https://bugs.python.org/11694>`__: Raise ConversionError in xdrlib as documented. Patch by Filip Gruszczyński and Claudiu Popa.

source: `bpo-19380 <https://bugs.python.org/issue19380>`__: Optimized parsing of regular expressions.
fr: `bpo-19380 <https://bugs.python.org/19380>`__: Optimized parsing of regular expressions.

source: `bpo-1519638 <https://bugs.python.org/issue1519638>`__: Now unmatched groups are replaced with empty strings in re.sub() and re.subn().
fr: `bpo-1519638 <https://bugs.python.org/1519638>`__: Now unmatched groups are replaced with empty strings in re.sub() and re.subn().

source: `bpo-18615 <https://bugs.python.org/issue18615>`__: sndhdr.what/whathdr now return a namedtuple.
fr: `bpo-18615 <https://bugs.python.org/18615>`__: sndhdr.what/whathdr now return a namedtuple.

source: `bpo-22462 <https://bugs.python.org/issue22462>`__: Fix pyexpat's creation of a dummy frame to make it appear in exception tracebacks.
fr: `bpo-22462 <https://bugs.python.org/22462>`__: Fix pyexpat's creation of a dummy frame to make it appear in exception tracebacks.

source: `bpo-21965 <https://bugs.python.org/issue21965>`__: Add support for in-memory SSL to the ssl module. Patch by Geert Jansen.
fr: `bpo-21965 <https://bugs.python.org/21965>`__: Add support for in-memory SSL to the ssl module. Patch by Geert Jansen.

source: `bpo-21173 <https://bugs.python.org/issue21173>`__: Fix len() on a WeakKeyDictionary when .clear() was called with an iterator alive.
fr: `bpo-21173 <https://bugs.python.org/21173>`__: Fix len() on a WeakKeyDictionary when .clear() was called with an iterator alive.

source: `bpo-11866 <https://bugs.python.org/issue11866>`__: Eliminated race condition in the computation of names for new threads.
fr: `bpo-11866 <https://bugs.python.org/11866>`__: Eliminated race condition in the computation of names for new threads.

source: `bpo-21905 <https://bugs.python.org/issue21905>`__: Avoid RuntimeError in pickle.whichmodule() when sys.modules is mutated while iterating. Patch by Olivier Grisel.
fr: `bpo-21905 <https://bugs.python.org/21905>`__: Avoid RuntimeError in pickle.whichmodule() when sys.modules is mutated while iterating. Patch by Olivier Grisel.

source: `bpo-11271 <https://bugs.python.org/issue11271>`__: concurrent.futures.Executor.map() now takes a *chunksize* argument to allow batching of tasks in child processes and improve performance of ProcessPoolExecutor. Patch by Dan O'Reilly.
fr: `bpo-11271 <https://bugs.python.org/11271>`__: concurrent.futures.Executor.map() now takes a *chunksize* argument to allow batching of tasks in child processes and improve performance of ProcessPoolExecutor. Patch by Dan O'Reilly.

source: `bpo-21883 <https://bugs.python.org/issue21883>`__: os.path.join() and os.path.relpath() now raise a TypeError with more helpful error message for unsupported or mismatched types of arguments.
fr: `bpo-21883 <https://bugs.python.org/21883>`__: os.path.join() and os.path.relpath() now raise a TypeError with more helpful error message for unsupported or mismatched types of arguments.

source: `bpo-22219 <https://bugs.python.org/issue22219>`__: The zipfile module CLI now adds entries for directories (including empty directories) in ZIP file.
fr: `bpo-22219 <https://bugs.python.org/22219>`__: The zipfile module CLI now adds entries for directories (including empty directories) in ZIP file.

source: `bpo-22449 <https://bugs.python.org/issue22449>`__: In the ssl.SSLContext.load_default_certs, consult the environmental variables SSL_CERT_DIR and SSL_CERT_FILE on Windows.
fr: `bpo-22449 <https://bugs.python.org/22449>`__: In the ssl.SSLContext.load_default_certs, consult the environmental variables SSL_CERT_DIR and SSL_CERT_FILE on Windows.

source: `bpo-22508 <https://bugs.python.org/issue22508>`__: The email.__version__ variable has been removed; the email code is no longer shipped separately from the stdlib, and __version__ hasn't been updated in several releases.
fr: `bpo-22508 <https://bugs.python.org/22508>`__: The email.__version__ variable has been removed; the email code is no longer shipped separately from the stdlib, and __version__ hasn't been updated in several releases.

source: `bpo-20076 <https://bugs.python.org/issue20076>`__: Added non derived UTF-8 aliases to locale aliases table.
fr: `bpo-20076 <https://bugs.python.org/20076>`__: Added non derived UTF-8 aliases to locale aliases table.

source: `bpo-20079 <https://bugs.python.org/issue20079>`__: Added locales supported in glibc 2.18 to locale alias table.
fr: `bpo-20079 <https://bugs.python.org/20079>`__: Added locales supported in glibc 2.18 to locale alias table.

source: `bpo-20218 <https://bugs.python.org/issue20218>`__: Added convenience methods read_text/write_text and read_bytes/ write_bytes to pathlib.Path objects.
fr: `bpo-20218 <https://bugs.python.org/20218>`__: Added convenience methods read_text/write_text and read_bytes/ write_bytes to pathlib.Path objects.

source: `bpo-22396 <https://bugs.python.org/issue22396>`__: On 32-bit AIX platform, don't expose os.posix_fadvise() nor os.posix_fallocate() because their prototypes in system headers are wrong.
fr: `bpo-22396 <https://bugs.python.org/22396>`__: On 32-bit AIX platform, don't expose os.posix_fadvise() nor os.posix_fallocate() because their prototypes in system headers are wrong.

source: `bpo-22517 <https://bugs.python.org/issue22517>`__: When an io.BufferedRWPair object is deallocated, clear its weakrefs.
fr: `bpo-22517 <https://bugs.python.org/22517>`__: When an io.BufferedRWPair object is deallocated, clear its weakrefs.

source: `bpo-22437 <https://bugs.python.org/issue22437>`__: Number of capturing groups in regular expression is no longer limited by 100.
fr: `bpo-22437 <https://bugs.python.org/22437>`__: Number of capturing groups in regular expression is no longer limited by 100.

source: `bpo-17442 <https://bugs.python.org/issue17442>`__: InteractiveInterpreter now displays the full chained traceback in its showtraceback method, to match the built in interactive interpreter.
fr: `bpo-17442 <https://bugs.python.org/17442>`__: InteractiveInterpreter now displays the full chained traceback in its showtraceback method, to match the built in interactive interpreter.

source: `bpo-23392 <https://bugs.python.org/issue23392>`__: Added tests for marshal C API that works with FILE*.
fr: `bpo-23392 <https://bugs.python.org/23392>`__: Added tests for marshal C API that works with FILE*.

source: `bpo-10510 <https://bugs.python.org/issue10510>`__: distutils register and upload methods now use HTML standards compliant CRLF line endings.
fr: `bpo-10510 <https://bugs.python.org/10510>`__: distutils register and upload methods now use HTML standards compliant CRLF line endings.

source: `bpo-9850 <https://bugs.python.org/issue9850>`__: Fixed macpath.join() for empty first component. Patch by Oleg Oshmyan.
fr: `bpo-9850 <https://bugs.python.org/9850>`__: Fixed macpath.join() for empty first component. Patch by Oleg Oshmyan.

source: `bpo-5309 <https://bugs.python.org/issue5309>`__: distutils' build and build_ext commands now accept a ``-j`` option to enable parallel building of extension modules.
fr: `bpo-5309 <https://bugs.python.org/5309>`__: distutils' build and build_ext commands now accept a ``-j`` option to enable parallel building of extension modules.

source: `bpo-22448 <https://bugs.python.org/issue22448>`__: Improve canceled timer handles cleanup to prevent unbound memory usage. Patch by Joshua Moore-Oliva.
fr: `bpo-22448 <https://bugs.python.org/22448>`__: Improve canceled timer handles cleanup to prevent unbound memory usage. Patch by Joshua Moore-Oliva.

source: `bpo-22427 <https://bugs.python.org/issue22427>`__: TemporaryDirectory no longer attempts to clean up twice when used in the with statement in generator.
fr: `bpo-22427 <https://bugs.python.org/22427>`__: TemporaryDirectory no longer attempts to clean up twice when used in the with statement in generator.

source: `bpo-22362 <https://bugs.python.org/issue22362>`__: Forbidden ambiguous octal escapes out of range 0-0o377 in regular expressions.
fr: `bpo-22362 <https://bugs.python.org/22362>`__: Forbidden ambiguous octal escapes out of range 0-0o377 in regular expressions.

source: `bpo-20912 <https://bugs.python.org/issue20912>`__: Now directories added to ZIP file have correct Unix and MS-DOS directory attributes.
fr: `bpo-20912 <https://bugs.python.org/20912>`__: Now directories added to ZIP file have correct Unix and MS-DOS directory attributes.

source: `bpo-21866 <https://bugs.python.org/issue21866>`__: ZipFile.close() no longer writes ZIP64 central directory records if allowZip64 is false.
fr: `bpo-21866 <https://bugs.python.org/21866>`__: ZipFile.close() no longer writes ZIP64 central directory records if allowZip64 is false.

source: `bpo-22278 <https://bugs.python.org/issue22278>`__: Fix urljoin problem with relative urls, a regression observed after changes to issue22118 were submitted.
fr: `bpo-22278 <https://bugs.python.org/22278>`__: Fix urljoin problem with relative urls, a regression observed after changes to issue22118 were submitted.

source: `bpo-22415 <https://bugs.python.org/issue22415>`__: Fixed debugging output of the GROUPREF_EXISTS opcode in the re module. Removed trailing spaces in debugging output.
fr: `bpo-22415 <https://bugs.python.org/22415>`__: Fixed debugging output of the GROUPREF_EXISTS opcode in the re module. Removed trailing spaces in debugging output.

source: `bpo-22423 <https://bugs.python.org/issue22423>`__: Unhandled exception in thread no longer causes unhandled AttributeError when sys.stderr is None.
fr: `bpo-22423 <https://bugs.python.org/22423>`__: Unhandled exception in thread no longer causes unhandled AttributeError when sys.stderr is None.

source: `bpo-21332 <https://bugs.python.org/issue21332>`__: Ensure that ``bufsize=1`` in subprocess.Popen() selects line buffering, rather than block buffering. Patch by Akira Li.
fr: `bpo-21332 <https://bugs.python.org/21332>`__: Ensure that ``bufsize=1`` in subprocess.Popen() selects line buffering, rather than block buffering. Patch by Akira Li.

source: `bpo-21091 <https://bugs.python.org/issue21091>`__: Fix API bug: email.message.EmailMessage.is_attachment is now a method.
fr: `bpo-21091 <https://bugs.python.org/21091>`__: Fix API bug: email.message.EmailMessage.is_attachment is now a method.

source: `bpo-21079 <https://bugs.python.org/issue21079>`__: Fix email.message.EmailMessage.is_attachment to return the correct result when the header has parameters as well as a value.
fr: `bpo-21079 <https://bugs.python.org/21079>`__: Fix email.message.EmailMessage.is_attachment to return the correct result when the header has parameters as well as a value.

source: `bpo-22247 <https://bugs.python.org/issue22247>`__: Add NNTPError to nntplib.__all__.
fr: `bpo-22247 <https://bugs.python.org/22247>`__: Add NNTPError to nntplib.__all__.

source: `bpo-22366 <https://bugs.python.org/issue22366>`__: urllib.request.urlopen will accept a context object (SSLContext) as an argument which will then be used for HTTPS connection. Patch by Alex Gaynor.
fr: `bpo-22366 <https://bugs.python.org/22366>`__: urllib.request.urlopen will accept a context object (SSLContext) as an argument which will then be used for HTTPS connection. Patch by Alex Gaynor.

source: `bpo-4180 <https://bugs.python.org/issue4180>`__: The warnings registries are now reset when the filters are modified.
fr: `bpo-4180 <https://bugs.python.org/4180>`__: The warnings registries are now reset when the filters are modified.

source: `bpo-22419 <https://bugs.python.org/issue22419>`__: Limit the length of incoming HTTP request in wsgiref server to 65536 bytes and send a 414 error code for higher lengths. Patch contributed by Devin Cook.
fr: `bpo-22419 <https://bugs.python.org/22419>`__: Limit the length of incoming HTTP request in wsgiref server to 65536 bytes and send a 414 error code for higher lengths. Patch contributed by Devin Cook.

source: `bpo-20537 <https://bugs.python.org/issue20537>`__: logging methods now accept an exception instance as well as a Boolean value or exception tuple. Thanks to Yury Selivanov for the patch.
fr: `bpo-20537 <https://bugs.python.org/20537>`__: logging methods now accept an exception instance as well as a Boolean value or exception tuple. Thanks to Yury Selivanov for the patch.

source: `bpo-22384 <https://bugs.python.org/issue22384>`__: An exception in Tkinter callback no longer crashes the program when it is run with pythonw.exe.
fr: `bpo-22384 <https://bugs.python.org/22384>`__: An exception in Tkinter callback no longer crashes the program when it is run with pythonw.exe.

source: `bpo-22168 <https://bugs.python.org/issue22168>`__: Prevent turtle AttributeError with non-default Canvas on OS X.
fr: `bpo-22168 <https://bugs.python.org/22168>`__: Prevent turtle AttributeError with non-default Canvas on OS X.
