Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-16180 <https://bugs.python.org/issue16180>`__: Exit pdb if file has syntax error, instead of trapping user in an infinite loop. Patch by Xavier de Gaye.
fr: `bpo-16180 <https://bugs.python.org/16180>`__: Exit pdb if file has syntax error, instead of trapping user in an infinite loop. Patch by Xavier de Gaye.

source: `bpo-24891 <https://bugs.python.org/issue24891>`__: Fix a race condition at Python startup if the file descriptor of stdin (0), stdout (1) or stderr (2) is closed while Python is creating sys.stdin, sys.stdout and sys.stderr objects. These attributes are now set to None if the creation of the object failed, instead of raising an OSError exception. Initial patch written by Marco Paolini.
fr: `bpo-24891 <https://bugs.python.org/24891>`__: Fix a race condition at Python startup if the file descriptor of stdin (0), stdout (1) or stderr (2) is closed while Python is creating sys.stdin, sys.stdout and sys.stderr objects. These attributes are now set to None if the creation of the object failed, instead of raising an OSError exception. Initial patch written by Marco Paolini.

source: `bpo-24992 <https://bugs.python.org/issue24992>`__: Fix error handling and a race condition (related to garbage collection) in collections.OrderedDict constructor.
fr: `bpo-24992 <https://bugs.python.org/24992>`__: Fix error handling and a race condition (related to garbage collection) in collections.OrderedDict constructor.

source: `bpo-24881 <https://bugs.python.org/issue24881>`__: Fixed setting binary mode in Python implementation of FileIO on Windows and Cygwin. Patch from Akira Li.
fr: `bpo-24881 <https://bugs.python.org/24881>`__: Fixed setting binary mode in Python implementation of FileIO on Windows and Cygwin. Patch from Akira Li.

source: `bpo-21112 <https://bugs.python.org/issue21112>`__: Fix regression in unittest.expectedFailure on subclasses. Patch from Berker Peksag.
fr: `bpo-21112 <https://bugs.python.org/21112>`__: Fix regression in unittest.expectedFailure on subclasses. Patch from Berker Peksag.

source: `bpo-24764 <https://bugs.python.org/issue24764>`__: cgi.FieldStorage.read_multi() now ignores the Content-Length header in part headers. Patch written by Peter Landry and reviewed by Pierre Quentel.
fr: `bpo-24764 <https://bugs.python.org/24764>`__: cgi.FieldStorage.read_multi() now ignores the Content-Length header in part headers. Patch written by Peter Landry and reviewed by Pierre Quentel.

source: `bpo-24913 <https://bugs.python.org/issue24913>`__: Fix overrun error in deque.index(). Found by John Leitch and Bryce Darling.
fr: `bpo-24913 <https://bugs.python.org/24913>`__: Fix overrun error in deque.index(). Found by John Leitch and Bryce Darling.

source: `bpo-24774 <https://bugs.python.org/issue24774>`__: Fix docstring in http.server.test. Patch from Chiu-Hsiang Hsu.
fr: `bpo-24774 <https://bugs.python.org/24774>`__: Fix docstring in http.server.test. Patch from Chiu-Hsiang Hsu.

source: `bpo-21159 <https://bugs.python.org/issue21159>`__: Improve message in configparser.InterpolationMissingOptionError. Patch from Łukasz Langa.
fr: `bpo-21159 <https://bugs.python.org/21159>`__: Improve message in configparser.InterpolationMissingOptionError. Patch from �?ukasz Langa.

source: `bpo-20362 <https://bugs.python.org/issue20362>`__: Honour TestCase.longMessage correctly in assertRegex. Patch from Ilia Kurenkov.
fr: `bpo-20362 <https://bugs.python.org/20362>`__: Honour TestCase.longMessage correctly in assertRegex. Patch from Ilia Kurenkov.

source: `bpo-23572 <https://bugs.python.org/issue23572>`__: Fixed functools.singledispatch on classes with falsy metaclasses. Patch by Ethan Furman.
fr: `bpo-23572 <https://bugs.python.org/23572>`__: Fixed functools.singledispatch on classes with falsy metaclasses. Patch by Ethan Furman.

source: `bpo-16893 <https://bugs.python.org/issue16893>`__: Replace help.txt with help.html for Idle doc display. The new idlelib/help.html is rstripped Doc/build/html/library/idle.html. It looks better than help.txt and will better document Idle as released. The tkinter html viewer that works for this file was written by Mark Roseman. The now unused EditorWindow.HelpDialog class and helt.txt file are deprecated.
fr: `bpo-16893 <https://bugs.python.org/16893>`__: Replace help.txt with help.html for Idle doc display. The new idlelib/help.html is rstripped Doc/build/html/library/idle.html. It looks better than help.txt and will better document Idle as released. The tkinter html viewer that works for this file was written by Mark Roseman. The now unused EditorWindow.HelpDialog class and helt.txt file are deprecated.

source: `bpo-12067 <https://bugs.python.org/issue12067>`__: Rewrite Comparisons section in the Expressions chapter of the language reference. Some of the details of comparing mixed types were incorrect or ambiguous. NotImplemented is only relevant at a lower level than the Expressions chapter. Added details of comparing range() objects, and default behaviour and consistency suggestions for user-defined classes. Patch from Andy Maier.
fr: `bpo-12067 <https://bugs.python.org/12067>`__: Rewrite Comparisons section in the Expressions chapter of the language reference. Some of the details of comparing mixed types were incorrect or ambiguous. NotImplemented is only relevant at a lower level than the Expressions chapter. Added details of comparing range() objects, and default behaviour and consistency suggestions for user-defined classes. Patch from Andy Maier.

source: `bpo-23725 <https://bugs.python.org/issue23725>`__: Overhaul tempfile docs. Note deprecated status of mktemp. Patch from Zbigniew Jędrzejewski-Szmek.
fr: `bpo-23725 <https://bugs.python.org/23725>`__: Overhaul tempfile docs. Note deprecated status of mktemp. Patch from Zbigniew Jędrzejewski-Szmek.

source: `bpo-24808 <https://bugs.python.org/issue24808>`__: Update the types of some PyTypeObject fields. Patch by Joseph Weston.
fr: `bpo-24808 <https://bugs.python.org/24808>`__: Update the types of some PyTypeObject fields. Patch by Joseph Weston.

source: `bpo-22812 <https://bugs.python.org/issue22812>`__: Fix unittest discovery examples. Patch from Pam McA'Nulty.
fr: `bpo-22812 <https://bugs.python.org/22812>`__: Fix unittest discovery examples. Patch from Pam McA'Nulty.

source: `bpo-25099 <https://bugs.python.org/issue25099>`__: Make test_compileall not fail when an entry on sys.path cannot be written to (commonly seen in administrative installs on Windows).
fr: `bpo-25099 <https://bugs.python.org/25099>`__: Make test_compileall not fail when an entry on sys.path cannot be written to (commonly seen in administrative installs on Windows).

source: `bpo-23919 <https://bugs.python.org/issue23919>`__: Prevents assert dialogs appearing in the test suite.
fr: `bpo-23919 <https://bugs.python.org/23919>`__: Prevents assert dialogs appearing in the test suite.

source: `bpo-24915 <https://bugs.python.org/issue24915>`__: Add LLVM support for PGO builds and use the test suite to generate the profile data. Initial patch by Alecsandru Patrascu of Intel.
fr: `bpo-24915 <https://bugs.python.org/24915>`__: Add LLVM support for PGO builds and use the test suite to generate the profile data. Initial patch by Alecsandru Patrascu of Intel.

source: `bpo-24910 <https://bugs.python.org/issue24910>`__: Windows MSIs now have unique display names.
fr: `bpo-24910 <https://bugs.python.org/24910>`__: Windows MSIs now have unique display names.

source: `bpo-25450 <https://bugs.python.org/issue25450>`__: Updates shortcuts to start Python in installation directory.
fr: `bpo-25450 <https://bugs.python.org/25450>`__: Updates shortcuts to start Python in installation directory.

source: `bpo-25164 <https://bugs.python.org/issue25164>`__: Changes default all-users install directory to match per-user directory.
fr: `bpo-25164 <https://bugs.python.org/25164>`__: Changes default all-users install directory to match per-user directory.

source: `bpo-25143 <https://bugs.python.org/issue25143>`__: Improves installer error messages for unsupported platforms.
fr: `bpo-25143 <https://bugs.python.org/25143>`__: Improves installer error messages for unsupported platforms.

source: `bpo-25163 <https://bugs.python.org/issue25163>`__: Display correct directory in installer when using non-default settings.
fr: `bpo-25163 <https://bugs.python.org/25163>`__: Display correct directory in installer when using non-default settings.

source: `bpo-25361 <https://bugs.python.org/issue25361>`__: Disables use of SSE2 instructions in Windows 32-bit build
fr: `bpo-25361 <https://bugs.python.org/25361>`__: Disables use of SSE2 instructions in Windows 32-bit build

source: `bpo-25089 <https://bugs.python.org/issue25089>`__: Adds logging to installer for case where launcher is not selected on upgrade.
fr: `bpo-25089 <https://bugs.python.org/25089>`__: Adds logging to installer for case where launcher is not selected on upgrade.

source: `bpo-25165 <https://bugs.python.org/issue25165>`__: Windows uninstallation should not remove launcher if other versions remain
fr: `bpo-25165 <https://bugs.python.org/25165>`__: Windows uninstallation should not remove launcher if other versions remain

source: `bpo-25112 <https://bugs.python.org/issue25112>`__: py.exe launcher is missing icons
fr: `bpo-25112 <https://bugs.python.org/25112>`__: py.exe launcher is missing icons

source: `bpo-25102 <https://bugs.python.org/issue25102>`__: Windows installer does not precompile for -O or -OO.
fr: `bpo-25102 <https://bugs.python.org/25102>`__: Windows installer does not precompile for -O or -OO.

source: `bpo-25081 <https://bugs.python.org/issue25081>`__: Makes Back button in installer go back to upgrade page when upgrading.
fr: `bpo-25081 <https://bugs.python.org/25081>`__: Makes Back button in installer go back to upgrade page when upgrading.

source: `bpo-25091 <https://bugs.python.org/issue25091>`__: Increases font size of the installer.
fr: `bpo-25091 <https://bugs.python.org/25091>`__: Increases font size of the installer.

source: `bpo-25126 <https://bugs.python.org/issue25126>`__: Clarifies that the non-web installer will download some components.
fr: `bpo-25126 <https://bugs.python.org/25126>`__: Clarifies that the non-web installer will download some components.

source: `bpo-25213 <https://bugs.python.org/issue25213>`__: Restores requestedExecutionLevel to manifest to disable UAC virtualization.
fr: `bpo-25213 <https://bugs.python.org/25213>`__: Restores requestedExecutionLevel to manifest to disable UAC virtualization.

source: `bpo-25071 <https://bugs.python.org/issue25071>`__: Windows installer should not require TargetDir parameter when installing quietly.
fr: `bpo-25071 <https://bugs.python.org/25071>`__: Windows installer should not require TargetDir parameter when installing quietly.

source: Release date: 2015-09-09
fr: Date de sortie : 2015-09-09

source: `bpo-25029 <https://bugs.python.org/issue25029>`__: Fixes MemoryError in test_strptime.
fr: `bpo-25029 <https://bugs.python.org/25029>`__: Fixes MemoryError in test_strptime.

source: `bpo-25027 <https://bugs.python.org/issue25027>`__: Reverts partial-static build options and adds vcruntime140.dll to Windows installation.
fr: `bpo-25027 <https://bugs.python.org/25027>`__: Reverts partial-static build options and adds vcruntime140.dll to Windows installation.

source: Release date: 2015-09-07
fr: Date de sortie : 2015-09-07

source: `bpo-24305 <https://bugs.python.org/issue24305>`__: Prevent import subsystem stack frames from being counted by the warnings.warn(stacklevel=) parameter.
fr: `bpo-24305 <https://bugs.python.org/24305>`__: Prevent import subsystem stack frames from being counted by the warnings.warn(stacklevel=) parameter.

source: `bpo-24912 <https://bugs.python.org/issue24912>`__: Prevent __class__ assignment to immutable built-in objects.
fr: `bpo-24912 <https://bugs.python.org/24912>`__: Prevent __class__ assignment to immutable built-in objects.

source: `bpo-24975 <https://bugs.python.org/issue24975>`__: Fix AST compilation for PEP 448 syntax.
fr: `bpo-24975 <https://bugs.python.org/24975>`__: Fix AST compilation for PEP 448 syntax.

source: `bpo-24917 <https://bugs.python.org/issue24917>`__: time_strftime() buffer over-read.
fr: `bpo-24917 <https://bugs.python.org/24917>`__: time_strftime() buffer over-read.

source: `bpo-24748 <https://bugs.python.org/issue24748>`__: To resolve a compatibility problem found with py2exe and pywin32, imp.load_dynamic() once again ignores previously loaded modules to support Python modules replacing themselves with extension modules. Patch by Petr Viktorin.
fr: `bpo-24748 <https://bugs.python.org/24748>`__: To resolve a compatibility problem found with py2exe and pywin32, imp.load_dynamic() once again ignores previously loaded modules to support Python modules replacing themselves with extension modules. Patch by Petr Viktorin.

source: `bpo-24635 <https://bugs.python.org/issue24635>`__: Fixed a bug in typing.py where isinstance([], typing.Iterable) would return True once, then False on subsequent calls.
fr: `bpo-24635 <https://bugs.python.org/24635>`__: Fixed a bug in typing.py where isinstance([], typing.Iterable) would return True once, then False on subsequent calls.

source: `bpo-24989 <https://bugs.python.org/issue24989>`__: Fixed buffer overread in BytesIO.readline() if a position is set beyond size. Based on patch by John Leitch.
fr: `bpo-24989 <https://bugs.python.org/24989>`__: Fixed buffer overread in BytesIO.readline() if a position is set beyond size. Based on patch by John Leitch.

source: `bpo-24769 <https://bugs.python.org/issue24769>`__: Interpreter now starts properly when dynamic loading is disabled. Patch by Petr Viktorin.
fr: `bpo-24769 <https://bugs.python.org/24769>`__: Interpreter now starts properly when dynamic loading is disabled. Patch by Petr Viktorin.

source: `bpo-21167 <https://bugs.python.org/issue21167>`__: NAN operations are now handled correctly when python is compiled with ICC even if -fp-model strict is not specified.
fr: `bpo-21167 <https://bugs.python.org/21167>`__: NAN operations are now handled correctly when python is compiled with ICC even if -fp-model strict is not specified.

source: `bpo-24492 <https://bugs.python.org/issue24492>`__: A "package" lacking a __name__ attribute when trying to perform a ``from .. import ...`` statement will trigger an ImportError instead of an AttributeError.
fr: `bpo-24492 <https://bugs.python.org/24492>`__: A "package" lacking a __name__ attribute when trying to perform a ``from .. import ...`` statement will trigger an ImportError instead of an AttributeError.

source: `bpo-24847 <https://bugs.python.org/issue24847>`__: Removes vcruntime140.dll dependency from Tcl/Tk.
fr: `bpo-24847 <https://bugs.python.org/24847>`__: Removes vcruntime140.dll dependency from Tcl/Tk.

source: `bpo-24839 <https://bugs.python.org/issue24839>`__: platform._syscmd_ver raises DeprecationWarning
fr: `bpo-24839 <https://bugs.python.org/24839>`__: platform._syscmd_ver raises DeprecationWarning

source: `bpo-24867 <https://bugs.python.org/issue24867>`__: Fix Task.get_stack() for 'async def' coroutines
fr: `bpo-24867 <https://bugs.python.org/24867>`__: Fix Task.get_stack() for 'async def' coroutines

source: `bpo-24667 <https://bugs.python.org/issue24667>`__: Resize odict in all cases that the underlying dict resizes.
fr: `bpo-24667 <https://bugs.python.org/24667>`__: Resize odict in all cases that the underlying dict resizes.

source: `bpo-24824 <https://bugs.python.org/issue24824>`__: Signatures of codecs.encode() and codecs.decode() now are compatible with pydoc.
fr: `bpo-24824 <https://bugs.python.org/24824>`__: Signatures of codecs.encode() and codecs.decode() now are compatible with pydoc.

source: `bpo-24634 <https://bugs.python.org/issue24634>`__: Importing uuid should not try to load libc on Windows
fr: `bpo-24634 <https://bugs.python.org/24634>`__: Importing uuid should not try to load libc on Windows

source: `bpo-24798 <https://bugs.python.org/issue24798>`__: _msvccompiler.py doesn't properly support manifests
fr: `bpo-24798 <https://bugs.python.org/24798>`__: _msvccompiler.py doesn't properly support manifests

source: `bpo-4395 <https://bugs.python.org/issue4395>`__: Better testing and documentation of binary operators. Patch by Martin Panter.
fr: `bpo-4395 <https://bugs.python.org/4395>`__: Better testing and documentation of binary operators. Patch by Martin Panter.

source: `bpo-23973 <https://bugs.python.org/issue23973>`__: Update typing.py from GitHub repo.
fr: `bpo-23973 <https://bugs.python.org/23973>`__: Update typing.py from GitHub repo.

source: `bpo-23004 <https://bugs.python.org/issue23004>`__: mock_open() now reads binary data correctly when the type of read_data is bytes. Initial patch by Aaron Hill.
fr: `bpo-23004 <https://bugs.python.org/23004>`__: mock_open() now reads binary data correctly when the type of read_data is bytes. Initial patch by Aaron Hill.

source: `bpo-23888 <https://bugs.python.org/issue23888>`__: Handle fractional time in cookie expiry. Patch by ssh.
fr: `bpo-23888 <https://bugs.python.org/23888>`__: Handle fractional time in cookie expiry. Patch by ssh.

source: `bpo-23652 <https://bugs.python.org/issue23652>`__: Make it possible to compile the select module against the libc headers from the Linux Standard Base, which do not include some EPOLL macros. Patch by Matt Frank.
fr: `bpo-23652 <https://bugs.python.org/23652>`__: Make it possible to compile the select module against the libc headers from the Linux Standard Base, which do not include some EPOLL macros. Patch by Matt Frank.

source: `bpo-22932 <https://bugs.python.org/issue22932>`__: Fix timezones in email.utils.formatdate. Patch from Dmitry Shachnev.
fr: `bpo-22932 <https://bugs.python.org/22932>`__: Fix timezones in email.utils.formatdate. Patch from Dmitry Shachnev.

source: `bpo-23779 <https://bugs.python.org/issue23779>`__: imaplib raises TypeError if authenticator tries to abort. Patch from Craig Holmquist.
fr: `bpo-23779 <https://bugs.python.org/23779>`__: imaplib raises TypeError if authenticator tries to abort. Patch from Craig Holmquist.

source: `bpo-23319 <https://bugs.python.org/issue23319>`__: Fix ctypes.BigEndianStructure, swap correctly bytes. Patch written by Matthieu Gautier.
fr: `bpo-23319 <https://bugs.python.org/23319>`__: Fix ctypes.BigEndianStructure, swap correctly bytes. Patch written by Matthieu Gautier.

source: `bpo-23254 <https://bugs.python.org/issue23254>`__: Document how to close the TCPServer listening socket. Patch from Martin Panter.
fr: `bpo-23254 <https://bugs.python.org/23254>`__: Document how to close the TCPServer listening socket. Patch from Martin Panter.

source: `bpo-19450 <https://bugs.python.org/issue19450>`__: Update Windows and OS X installer builds to use SQLite 3.8.11.
fr: `bpo-19450 <https://bugs.python.org/19450>`__: Update Windows and OS X installer builds to use SQLite 3.8.11.

source: `bpo-17527 <https://bugs.python.org/issue17527>`__: Add PATCH to wsgiref.validator. Patch from Luca Sbardella.
fr: `bpo-17527 <https://bugs.python.org/17527>`__: Add PATCH to wsgiref.validator. Patch from Luca Sbardella.

source: `bpo-24791 <https://bugs.python.org/issue24791>`__: Fix grammar regression for call syntax: 'g(\*a or b)'.
fr: `bpo-24791 <https://bugs.python.org/24791>`__: Fix grammar regression for call syntax: 'g(\*a or b)'.

source: `bpo-23672 <https://bugs.python.org/issue23672>`__: Allow Idle to edit and run files with astral chars in name. Patch by Mohd Sanad Zaki Rizvi.
fr: `bpo-23672 <https://bugs.python.org/23672>`__: Allow Idle to edit and run files with astral chars in name. Patch by Mohd Sanad Zaki Rizvi.

source: `bpo-24745 <https://bugs.python.org/issue24745>`__: Idle editor default font. Switch from Courier to platform-sensitive TkFixedFont. This should not affect current customized font selections. If there is a problem, edit $HOME/.idlerc/config-main.cfg and remove 'fontxxx' entries from [Editor Window]. Patch by Mark Roseman.
fr: `bpo-24745 <https://bugs.python.org/24745>`__: Idle editor default font. Switch from Courier to platform-sensitive TkFixedFont. This should not affect current customized font selections. If there is a problem, edit $HOME/.idlerc/config-main.cfg and remove 'fontxxx' entries from [Editor Window]. Patch by Mark Roseman.

source: `bpo-21192 <https://bugs.python.org/issue21192>`__: Idle editor. When a file is run, put its name in the restart bar. Do not print false prompts. Original patch by Adnan Umer.
fr: `bpo-21192 <https://bugs.python.org/21192>`__: Idle editor. When a file is run, put its name in the restart bar. Do not print false prompts. Original patch by Adnan Umer.

source: `bpo-13884 <https://bugs.python.org/issue13884>`__: Idle menus. Remove tearoff lines. Patch by Roger Serwy.
fr: `bpo-13884 <https://bugs.python.org/13884>`__: Idle menus. Remove tearoff lines. Patch by Roger Serwy.

source: `bpo-24129 <https://bugs.python.org/issue24129>`__: Clarify the reference documentation for name resolution. This includes removing the assumption that readers will be familiar with the name resolution scheme Python used prior to the introduction of lexical scoping for function namespaces. Patch by Ivan Levkivskyi.
fr: `bpo-24129 <https://bugs.python.org/24129>`__: Clarify the reference documentation for name resolution. This includes removing the assumption that readers will be familiar with the name resolution scheme Python used prior to the introduction of lexical scoping for function namespaces. Patch by Ivan Levkivskyi.

source: `bpo-20769 <https://bugs.python.org/issue20769>`__: Improve reload() docs. Patch by Dorian Pula.
fr: `bpo-20769 <https://bugs.python.org/20769>`__: Improve reload() docs. Patch by Dorian Pula.

source: `bpo-23589 <https://bugs.python.org/issue23589>`__: Remove duplicate sentence from the FAQ. Patch by Yongzhi Pan.
fr: `bpo-23589 <https://bugs.python.org/23589>`__: Remove duplicate sentence from the FAQ. Patch by Yongzhi Pan.

source: `bpo-24729 <https://bugs.python.org/issue24729>`__: Correct IO tutorial to match implementation regarding encoding parameter to open function.
fr: `bpo-24729 <https://bugs.python.org/24729>`__: Correct IO tutorial to match implementation regarding encoding parameter to open function.

source: `bpo-24751 <https://bugs.python.org/issue24751>`__: When running regrtest with the ``-w`` command line option, a test run is no longer marked as a failure if all tests succeed when re-run.
fr: `bpo-24751 <https://bugs.python.org/24751>`__: When running regrtest with the ``-w`` command line option, a test run is no longer marked as a failure if all tests succeed when re-run.

source: `bpo-23573 <https://bugs.python.org/issue23573>`__: Restored optimization of bytes.rfind() and bytearray.rfind() for single-byte argument on Linux.
fr: `bpo-23573 <https://bugs.python.org/23573>`__: Restored optimization of bytes.rfind() and bytearray.rfind() for single-byte argument on Linux.

source: `bpo-24569 <https://bugs.python.org/issue24569>`__: Make PEP 448 dictionary evaluation more consistent.
fr: `bpo-24569 <https://bugs.python.org/24569>`__: Make PEP 448 dictionary evaluation more consistent.

source: `bpo-24583 <https://bugs.python.org/issue24583>`__: Fix crash when set is mutated while being updated.
fr: `bpo-24583 <https://bugs.python.org/24583>`__: Fix crash when set is mutated while being updated.

source: `bpo-24407 <https://bugs.python.org/issue24407>`__: Fix crash when dict is mutated while being updated.
fr: `bpo-24407 <https://bugs.python.org/24407>`__: Fix crash when dict is mutated while being updated.
