Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-21147 <https://bugs.python.org/issue21147>`__: sqlite3 now raises an exception if the request contains a null character instead of truncating it. Based on patch by Victor Stinner.
fr: `bpo-21147 <https://bugs.python.org/21147>`__: sqlite3 now raises an exception if the request contains a null character instead of truncating it. Based on patch by Victor Stinner.

source: `bpo-13968 <https://bugs.python.org/issue13968>`__: The glob module now supports recursive search in subdirectories using the "**" pattern.
fr: `bpo-13968 <https://bugs.python.org/13968>`__: The glob module now supports recursive search in subdirectories using the "**" pattern.

source: `bpo-21951 <https://bugs.python.org/issue21951>`__: Fixed a crash in Tkinter on AIX when called Tcl command with empty string or tuple argument.
fr: `bpo-21951 <https://bugs.python.org/21951>`__: Fixed a crash in Tkinter on AIX when called Tcl command with empty string or tuple argument.

source: `bpo-21951 <https://bugs.python.org/issue21951>`__: Tkinter now most likely raises MemoryError instead of crash if the memory allocation fails.
fr: `bpo-21951 <https://bugs.python.org/21951>`__: Tkinter now most likely raises MemoryError instead of crash if the memory allocation fails.

source: `bpo-22338 <https://bugs.python.org/issue22338>`__: Fix a crash in the json module on memory allocation failure.
fr: `bpo-22338 <https://bugs.python.org/22338>`__: Fix a crash in the json module on memory allocation failure.

source: `bpo-12410 <https://bugs.python.org/issue12410>`__: imaplib.IMAP4 now supports the context management protocol. Original patch by Tarek Ziadé.
fr: `bpo-12410 <https://bugs.python.org/12410>`__: imaplib.IMAP4 now supports the context management protocol. Original patch by Tarek Ziadé.

source: `bpo-21270 <https://bugs.python.org/issue21270>`__: We now override tuple methods in mock.call objects so that they can be used as normal call attributes.
fr: `bpo-21270 <https://bugs.python.org/21270>`__: We now override tuple methods in mock.call objects so that they can be used as normal call attributes.

source: `bpo-16662 <https://bugs.python.org/issue16662>`__: load_tests() is now unconditionally run when it is present in a package's __init__.py. TestLoader.loadTestsFromModule() still accepts use_load_tests, but it is deprecated and ignored. A new keyword-only attribute `pattern` is added and documented. Patch given by Robert Collins, tweaked by Barry Warsaw.
fr: `bpo-16662 <https://bugs.python.org/16662>`__: load_tests() is now unconditionally run when it is present in a package's __init__.py. TestLoader.loadTestsFromModule() still accepts use_load_tests, but it is deprecated and ignored. A new keyword-only attribute `pattern` is added and documented. Patch given by Robert Collins, tweaked by Barry Warsaw.

source: `bpo-22226 <https://bugs.python.org/issue22226>`__: First letter no longer is stripped from the "status" key in the result of Treeview.heading().
fr: `bpo-22226 <https://bugs.python.org/22226>`__: First letter no longer is stripped from the "status" key in the result of Treeview.heading().

source: `bpo-19524 <https://bugs.python.org/issue19524>`__: Fixed resource leak in the HTTP connection when an invalid response is received. Patch by Martin Panter.
fr: `bpo-19524 <https://bugs.python.org/19524>`__: Fixed resource leak in the HTTP connection when an invalid response is received. Patch by Martin Panter.

source: `bpo-20421 <https://bugs.python.org/issue20421>`__: Add a .version() method to SSL sockets exposing the actual protocol version in use.
fr: `bpo-20421 <https://bugs.python.org/20421>`__: Add a .version() method to SSL sockets exposing the actual protocol version in use.

source: `bpo-19546 <https://bugs.python.org/issue19546>`__: configparser exceptions no longer expose implementation details. Chained KeyErrors are removed, which leads to cleaner tracebacks. Patch by Claudiu Popa.
fr: `bpo-19546 <https://bugs.python.org/19546>`__: configparser exceptions no longer expose implementation details. Chained KeyErrors are removed, which leads to cleaner tracebacks. Patch by Claudiu Popa.

source: `bpo-22051 <https://bugs.python.org/issue22051>`__: turtledemo no longer reloads examples to re-run them. Initialization of variables and gui setup should be done in main(), which is called each time a demo is run, but not on import.
fr: `bpo-22051 <https://bugs.python.org/22051>`__: turtledemo no longer reloads examples to re-run them. Initialization of variables and gui setup should be done in main(), which is called each time a demo is run, but not on import.

source: `bpo-21933 <https://bugs.python.org/issue21933>`__: Turtledemo users can change the code font size with a menu selection or control(command) '-' or '+' or control-mousewheel. Original patch by Lita Cho.
fr: `bpo-21933 <https://bugs.python.org/21933>`__: Turtledemo users can change the code font size with a menu selection or control(command) '-' or '+' or control-mousewheel. Original patch by Lita Cho.

source: `bpo-21597 <https://bugs.python.org/issue21597>`__: The separator between the turtledemo text pane and the drawing canvas can now be grabbed and dragged with a mouse. The code text pane can be widened to easily view or copy the full width of the text. The canvas can be widened on small screens. Original patches by Jan Kanis and Lita Cho.
fr: `bpo-21597 <https://bugs.python.org/21597>`__: The separator between the turtledemo text pane and the drawing canvas can now be grabbed and dragged with a mouse. The code text pane can be widened to easily view or copy the full width of the text. The canvas can be widened on small screens. Original patches by Jan Kanis and Lita Cho.

source: `bpo-18132 <https://bugs.python.org/issue18132>`__: Turtledemo buttons no longer disappear when the window is shrunk. Original patches by Jan Kanis and Lita Cho.
fr: `bpo-18132 <https://bugs.python.org/18132>`__: Turtledemo buttons no longer disappear when the window is shrunk. Original patches by Jan Kanis and Lita Cho.

source: `bpo-22043 <https://bugs.python.org/issue22043>`__: time.monotonic() is now always available. ``threading.Lock.acquire()``, ``threading.RLock.acquire()`` and socket operations now use a monotonic clock, instead of the system clock, when a timeout is used.
fr: `bpo-22043 <https://bugs.python.org/22043>`__: time.monotonic() is now always available. ``threading.Lock.acquire()``, ``threading.RLock.acquire()`` and socket operations now use a monotonic clock, instead of the system clock, when a timeout is used.

source: `bpo-21527 <https://bugs.python.org/issue21527>`__: Add a default number of workers to ThreadPoolExecutor equal to 5 times the number of CPUs. Patch by Claudiu Popa.
fr: `bpo-21527 <https://bugs.python.org/21527>`__: Add a default number of workers to ThreadPoolExecutor equal to 5 times the number of CPUs. Patch by Claudiu Popa.

source: `bpo-22216 <https://bugs.python.org/issue22216>`__: smtplib now resets its state more completely after a quit. The most obvious consequence of the previous behavior was a STARTTLS failure during a connect/starttls/quit/connect/starttls sequence.
fr: `bpo-22216 <https://bugs.python.org/22216>`__: smtplib now resets its state more completely after a quit. The most obvious consequence of the previous behavior was a STARTTLS failure during a connect/starttls/quit/connect/starttls sequence.

source: `bpo-22098 <https://bugs.python.org/issue22098>`__: ctypes' BigEndianStructure and LittleEndianStructure now define an empty __slots__ so that subclasses don't always get an instance dict. Patch by Claudiu Popa.
fr: `bpo-22098 <https://bugs.python.org/22098>`__: ctypes' BigEndianStructure and LittleEndianStructure now define an empty __slots__ so that subclasses don't always get an instance dict. Patch by Claudiu Popa.

source: `bpo-22185 <https://bugs.python.org/issue22185>`__: Fix an occasional RuntimeError in threading.Condition.wait() caused by mutation of the waiters queue without holding the lock. Patch by Doug Zongker.
fr: `bpo-22185 <https://bugs.python.org/22185>`__: Fix an occasional RuntimeError in threading.Condition.wait() caused by mutation of the waiters queue without holding the lock. Patch by Doug Zongker.

source: `bpo-22287 <https://bugs.python.org/issue22287>`__: On UNIX, _PyTime_gettimeofday() now uses clock_gettime(CLOCK_REALTIME) if available. As a side effect, Python now depends on the librt library on Solaris and on Linux (only with glibc older than 2.17).
fr: `bpo-22287 <https://bugs.python.org/22287>`__: On UNIX, _PyTime_gettimeofday() now uses clock_gettime(CLOCK_REALTIME) if available. As a side effect, Python now depends on the librt library on Solaris and on Linux (only with glibc older than 2.17).

source: `bpo-22182 <https://bugs.python.org/issue22182>`__: Use e.args to unpack exceptions correctly in distutils.file_util.move_file. Patch by Claudiu Popa.
fr: `bpo-22182 <https://bugs.python.org/22182>`__: Use e.args to unpack exceptions correctly in distutils.file_util.move_file. Patch by Claudiu Popa.

source: `bpo-22042 <https://bugs.python.org/issue22042>`__: signal.set_wakeup_fd(fd) now raises an exception if the file descriptor is in blocking mode.
fr: `bpo-22042 <https://bugs.python.org/22042>`__: signal.set_wakeup_fd(fd) now raises an exception if the file descriptor is in blocking mode.

source: `bpo-16808 <https://bugs.python.org/issue16808>`__: inspect.stack() now returns a named tuple instead of a tuple. Patch by Daniel Shahaf.
fr: `bpo-16808 <https://bugs.python.org/16808>`__: inspect.stack() now returns a named tuple instead of a tuple. Patch by Daniel Shahaf.

source: `bpo-22236 <https://bugs.python.org/issue22236>`__: Fixed Tkinter images copying operations in NoDefaultRoot mode.
fr: `bpo-22236 <https://bugs.python.org/22236>`__: Fixed Tkinter images copying operations in NoDefaultRoot mode.

source: `bpo-2527 <https://bugs.python.org/issue2527>`__: Add a *globals* argument to timeit functions, in order to override the globals namespace in which the timed code is executed. Patch by Ben Roberts.
fr: `bpo-2527 <https://bugs.python.org/2527>`__: Add a *globals* argument to timeit functions, in order to override the globals namespace in which the timed code is executed. Patch by Ben Roberts.

source: `bpo-22118 <https://bugs.python.org/issue22118>`__: Switch urllib.parse to use RFC 3986 semantics for the resolution of relative URLs, rather than RFCs 1808 and 2396. Patch by Demian Brecht.
fr: `bpo-22118 <https://bugs.python.org/22118>`__: Switch urllib.parse to use RFC 3986 semantics for the resolution of relative URLs, rather than RFCs 1808 and 2396. Patch by Demian Brecht.

source: `bpo-21549 <https://bugs.python.org/issue21549>`__: Added the "members" parameter to TarFile.list().
fr: `bpo-21549 <https://bugs.python.org/21549>`__: Added the "members" parameter to TarFile.list().

source: `bpo-19628 <https://bugs.python.org/issue19628>`__: Allow compileall recursion depth to be specified with a -r option.
fr: `bpo-19628 <https://bugs.python.org/19628>`__: Allow compileall recursion depth to be specified with a -r option.

source: `bpo-15696 <https://bugs.python.org/issue15696>`__: Add a __sizeof__ implementation for mmap objects on Windows.
fr: `bpo-15696 <https://bugs.python.org/15696>`__: Add a __sizeof__ implementation for mmap objects on Windows.

source: `bpo-22068 <https://bugs.python.org/issue22068>`__: Avoided reference loops with Variables and Fonts in Tkinter.
fr: `bpo-22068 <https://bugs.python.org/22068>`__: Avoided reference loops with Variables and Fonts in Tkinter.

source: `bpo-22165 <https://bugs.python.org/issue22165>`__: SimpleHTTPRequestHandler now supports undecodable file names.
fr: `bpo-22165 <https://bugs.python.org/22165>`__: SimpleHTTPRequestHandler now supports undecodable file names.

source: `bpo-15381 <https://bugs.python.org/issue15381>`__: Optimized line reading in io.BytesIO.
fr: `bpo-15381 <https://bugs.python.org/15381>`__: Optimized line reading in io.BytesIO.

source: `bpo-8797 <https://bugs.python.org/issue8797>`__: Raise HTTPError on failed Basic Authentication immediately. Initial patch by Sam Bull.
fr: `bpo-8797 <https://bugs.python.org/8797>`__: Raise HTTPError on failed Basic Authentication immediately. Initial patch by Sam Bull.

source: `bpo-20729 <https://bugs.python.org/issue20729>`__: Restored the use of lazy iterkeys()/itervalues()/iteritems() in the mailbox module.
fr: `bpo-20729 <https://bugs.python.org/20729>`__: Restored the use of lazy iterkeys()/itervalues()/iteritems() in the mailbox module.

source: `bpo-21448 <https://bugs.python.org/issue21448>`__: Changed FeedParser feed() to avoid O(N**2) behavior when parsing long line. Original patch by Raymond Hettinger.
fr: `bpo-21448 <https://bugs.python.org/21448>`__: Changed FeedParser feed() to avoid O(N**2) behavior when parsing long line. Original patch by Raymond Hettinger.

source: `bpo-22184 <https://bugs.python.org/issue22184>`__: The functools LRU Cache decorator factory now gives an earlier and clearer error message when the user forgets the required parameters.
fr: `bpo-22184 <https://bugs.python.org/22184>`__: The functools LRU Cache decorator factory now gives an earlier and clearer error message when the user forgets the required parameters.

source: `bpo-17923 <https://bugs.python.org/issue17923>`__: glob() patterns ending with a slash no longer match non-dirs on AIX. Based on patch by Delhallt.
fr: `bpo-17923 <https://bugs.python.org/17923>`__: glob() patterns ending with a slash no longer match non-dirs on AIX. Based on patch by Delhallt.

source: `bpo-21725 <https://bugs.python.org/issue21725>`__: Added support for RFC 6531 (SMTPUTF8) in smtpd.
fr: `bpo-21725 <https://bugs.python.org/21725>`__: Added support for RFC 6531 (SMTPUTF8) in smtpd.

source: `bpo-22176 <https://bugs.python.org/issue22176>`__: Update the ctypes module's libffi to v3.1. This release adds support for the Linux AArch64 and POWERPC ELF ABIv2 little endian architectures.
fr: `bpo-22176 <https://bugs.python.org/22176>`__: Update the ctypes module's libffi to v3.1. This release adds support for the Linux AArch64 and POWERPC ELF ABIv2 little endian architectures.

source: `bpo-5411 <https://bugs.python.org/issue5411>`__: Added support for the "xztar" format in the shutil module.
fr: `bpo-5411 <https://bugs.python.org/5411>`__: Added support for the "xztar" format in the shutil module.

source: `bpo-21121 <https://bugs.python.org/issue21121>`__: Don't force 3rd party C extensions to be built with -Werror=declaration-after-statement.
fr: `bpo-21121 <https://bugs.python.org/21121>`__: Don't force 3rd party C extensions to be built with -Werror=declaration-after-statement.

source: `bpo-21975 <https://bugs.python.org/issue21975>`__: Fixed crash when using uninitialized sqlite3.Row (in particular when unpickling pickled sqlite3.Row). sqlite3.Row is now initialized in the __new__() method.
fr: `bpo-21975 <https://bugs.python.org/21975>`__: Fixed crash when using uninitialized sqlite3.Row (in particular when unpickling pickled sqlite3.Row). sqlite3.Row is now initialized in the __new__() method.

source: `bpo-20170 <https://bugs.python.org/issue20170>`__: Convert posixmodule to use Argument Clinic.
fr: `bpo-20170 <https://bugs.python.org/20170>`__: Convert posixmodule to use Argument Clinic.

source: `bpo-21539 <https://bugs.python.org/issue21539>`__: Add an *exists_ok* argument to `Pathlib.mkdir()` to mimic `mkdir -p` and `os.makedirs()` functionality. When true, ignore FileExistsErrors. Patch by Berker Peksag.
fr: `bpo-21539 <https://bugs.python.org/21539>`__: Add an *exists_ok* argument to `Pathlib.mkdir()` to mimic `mkdir -p` and `os.makedirs()` functionality. When true, ignore FileExistsErrors. Patch by Berker Peksag.

source: `bpo-22127 <https://bugs.python.org/issue22127>`__: Bypass IDNA for pure-ASCII host names in the socket module (in particular for numeric IPs).
fr: `bpo-22127 <https://bugs.python.org/22127>`__: Bypass IDNA for pure-ASCII host names in the socket module (in particular for numeric IPs).

source: `bpo-21047 <https://bugs.python.org/issue21047>`__: set the default value for the *convert_charrefs* argument of HTMLParser to True. Patch by Berker Peksag.
fr: `bpo-21047 <https://bugs.python.org/21047>`__: set the default value for the *convert_charrefs* argument of HTMLParser to True. Patch by Berker Peksag.

source: `bpo-15114 <https://bugs.python.org/issue15114>`__: the strict mode and argument of HTMLParser, HTMLParser.error, and the HTMLParserError exception have been removed.
fr: `bpo-15114 <https://bugs.python.org/15114>`__: the strict mode and argument of HTMLParser, HTMLParser.error, and the HTMLParserError exception have been removed.

source: `bpo-22085 <https://bugs.python.org/issue22085>`__: Dropped support of Tk 8.3 in Tkinter.
fr: `bpo-22085 <https://bugs.python.org/22085>`__: Dropped support of Tk 8.3 in Tkinter.

source: `bpo-21580 <https://bugs.python.org/issue21580>`__: Now Tkinter correctly handles bytes arguments passed to Tk. In particular this allows initializing images from binary data.
fr: `bpo-21580 <https://bugs.python.org/21580>`__: Now Tkinter correctly handles bytes arguments passed to Tk. In particular this allows initializing images from binary data.

source: `bpo-22003 <https://bugs.python.org/issue22003>`__: When initialized from a bytes object, io.BytesIO() now defers making a copy until it is mutated, improving performance and memory use on some use cases. Patch by David Wilson.
fr: `bpo-22003 <https://bugs.python.org/22003>`__: When initialized from a bytes object, io.BytesIO() now defers making a copy until it is mutated, improving performance and memory use on some use cases. Patch by David Wilson.

source: `bpo-22018 <https://bugs.python.org/issue22018>`__: On Windows, signal.set_wakeup_fd() now also supports sockets. A side effect is that Python depends to the WinSock library.
fr: `bpo-22018 <https://bugs.python.org/22018>`__: On Windows, signal.set_wakeup_fd() now also supports sockets. A side effect is that Python depends to the WinSock library.

source: `bpo-22054 <https://bugs.python.org/issue22054>`__: Add os.get_blocking() and os.set_blocking() functions to get and set the blocking mode of a file descriptor (False if the O_NONBLOCK flag is set, True otherwise). These functions are not available on Windows.
fr: `bpo-22054 <https://bugs.python.org/22054>`__: Add os.get_blocking() and os.set_blocking() functions to get and set the blocking mode of a file descriptor (False if the O_NONBLOCK flag is set, True otherwise). These functions are not available on Windows.

source: `bpo-17172 <https://bugs.python.org/issue17172>`__: Make turtledemo start as active on OS X even when run with subprocess. Patch by Lita Cho.
fr: `bpo-17172 <https://bugs.python.org/17172>`__: Make turtledemo start as active on OS X even when run with subprocess. Patch by Lita Cho.

source: `bpo-21704 <https://bugs.python.org/issue21704>`__: Fix build error for _multiprocessing when semaphores are not available. Patch by Arfrever Frehtes Taifersar Arahesis.
fr: `bpo-21704 <https://bugs.python.org/21704>`__: Fix build error for _multiprocessing when semaphores are not available. Patch by Arfrever Frehtes Taifersar Arahesis.

source: `bpo-20173 <https://bugs.python.org/issue20173>`__: Convert sha1, sha256, sha512 and md5 to ArgumentClinic. Patch by Vajrasky Kok.
fr: `bpo-20173 <https://bugs.python.org/20173>`__: Convert sha1, sha256, sha512 and md5 to ArgumentClinic. Patch by Vajrasky Kok.

source: `bpo-22033 <https://bugs.python.org/issue22033>`__: Reprs of most Python implemened classes now contain actual class name instead of hardcoded one.
fr: `bpo-22033 <https://bugs.python.org/22033>`__: Reprs of most Python implemened classes now contain actual class name instead of hardcoded one.

source: `bpo-21947 <https://bugs.python.org/issue21947>`__: The dis module can now disassemble generator-iterator objects based on their gi_code attribute. Patch by Clement Rouault.
fr: `bpo-21947 <https://bugs.python.org/21947>`__: The dis module can now disassemble generator-iterator objects based on their gi_code attribute. Patch by Clement Rouault.

source: `bpo-16133 <https://bugs.python.org/issue16133>`__: The asynchat.async_chat.handle_read() method now ignores BlockingIOError exceptions.
fr: `bpo-16133 <https://bugs.python.org/16133>`__: The asynchat.async_chat.handle_read() method now ignores BlockingIOError exceptions.

source: `bpo-22044 <https://bugs.python.org/issue22044>`__: Fixed premature DECREF in call_tzinfo_method. Patch by Tom Flanagan.
fr: `bpo-22044 <https://bugs.python.org/22044>`__: Fixed premature DECREF in call_tzinfo_method. Patch by Tom Flanagan.

source: `bpo-19884 <https://bugs.python.org/issue19884>`__: readline: Disable the meta modifier key if stdout is not a terminal to not write the ANSI sequence ``"\033[1034h"`` into stdout. This sequence is used on some terminal (ex: TERM=xterm-256color") to enable support of 8 bit characters.
fr: `bpo-19884 <https://bugs.python.org/19884>`__: readline: Disable the meta modifier key if stdout is not a terminal to not write the ANSI sequence ``"\033[1034h"`` into stdout. This sequence is used on some terminal (ex: TERM=xterm-256color") to enable support of 8 bit characters.

source: `bpo-4350 <https://bugs.python.org/issue4350>`__: Removed a number of out-of-dated and non-working for a long time Tkinter methods.
fr: `bpo-4350 <https://bugs.python.org/4350>`__: Removed a number of out-of-dated and non-working for a long time Tkinter methods.

source: `bpo-6167 <https://bugs.python.org/issue6167>`__: Scrollbar.activate() now returns the name of active element if the argument is not specified. Scrollbar.set() now always accepts only 2 arguments.
fr: `bpo-6167 <https://bugs.python.org/6167>`__: Scrollbar.activate() now returns the name of active element if the argument is not specified. Scrollbar.set() now always accepts only 2 arguments.

source: `bpo-15275 <https://bugs.python.org/issue15275>`__: Clean up and speed up the ntpath module.
fr: `bpo-15275 <https://bugs.python.org/15275>`__: Clean up and speed up the ntpath module.

source: `bpo-21888 <https://bugs.python.org/issue21888>`__: plistlib's load() and loads() now work if the fmt parameter is specified.
fr: `bpo-21888 <https://bugs.python.org/21888>`__: plistlib's load() and loads() now work if the fmt parameter is specified.

source: `bpo-22032 <https://bugs.python.org/issue22032>`__: __qualname__ instead of __name__ is now always used to format fully qualified class names of Python implemented classes.
fr: `bpo-22032 <https://bugs.python.org/22032>`__: __qualname__ instead of __name__ is now always used to format fully qualified class names of Python implemented classes.

source: `bpo-22031 <https://bugs.python.org/issue22031>`__: Reprs now always use hexadecimal format with the "0x" prefix when contain an id in form " at 0x...".
fr: `bpo-22031 <https://bugs.python.org/22031>`__: Reprs now always use hexadecimal format with the "0x" prefix when contain an id in form " at 0x...".

source: `bpo-22018 <https://bugs.python.org/issue22018>`__: signal.set_wakeup_fd() now raises an OSError instead of a ValueError on ``fstat()`` failure.
fr: `bpo-22018 <https://bugs.python.org/22018>`__: signal.set_wakeup_fd() now raises an OSError instead of a ValueError on ``fstat()`` failure.

source: `bpo-21044 <https://bugs.python.org/issue21044>`__: tarfile.open() now handles fileobj with an integer 'name' attribute. Based on patch by Antoine Pietri.
fr: `bpo-21044 <https://bugs.python.org/21044>`__: tarfile.open() now handles fileobj with an integer 'name' attribute. Based on patch by Antoine Pietri.
