Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-21966 <https://bugs.python.org/issue21966>`__: Respect -q command-line option when code module is ran.
fr: `bpo-21966 <https://bugs.python.org/21966>`__: Respect -q command-line option when code module is ran.

source: `bpo-19076 <https://bugs.python.org/issue19076>`__: Don't pass the redundant 'file' argument to self.error().
fr: `bpo-19076 <https://bugs.python.org/19076>`__: Don't pass the redundant 'file' argument to self.error().

source: `bpo-16382 <https://bugs.python.org/issue16382>`__: Improve exception message of warnings.warn() for bad category. Initial patch by Phil Elson.
fr: `bpo-16382 <https://bugs.python.org/16382>`__: Improve exception message of warnings.warn() for bad category. Initial patch by Phil Elson.

source: `bpo-21932 <https://bugs.python.org/issue21932>`__: os.read() now uses a :c:func:`Py_ssize_t` type instead of :c:type:`int` for the size to support reading more than 2 GB at once. On Windows, the size is truncted to INT_MAX. As any call to os.read(), the OS may read less bytes than the number of requested bytes.
fr: `bpo-21932 <https://bugs.python.org/21932>`__: os.read() now uses a :c:func:`Py_ssize_t` type instead of :c:type:`int` for the size to support reading more than 2 GB at once. On Windows, the size is truncted to INT_MAX. As any call to os.read(), the OS may read less bytes than the number of requested bytes.

source: `bpo-21942 <https://bugs.python.org/issue21942>`__: Fixed source file viewing in pydoc's server mode on Windows.
fr: `bpo-21942 <https://bugs.python.org/21942>`__: Fixed source file viewing in pydoc's server mode on Windows.

source: `bpo-11259 <https://bugs.python.org/issue11259>`__: asynchat.async_chat().set_terminator() now raises a ValueError if the number of received bytes is negative.
fr: `bpo-11259 <https://bugs.python.org/11259>`__: asynchat.async_chat().set_terminator() now raises a ValueError if the number of received bytes is negative.

source: `bpo-12523 <https://bugs.python.org/issue12523>`__: asynchat.async_chat.push() now raises a TypeError if it doesn't get a bytes string
fr: `bpo-12523 <https://bugs.python.org/12523>`__: asynchat.async_chat.push() now raises a TypeError if it doesn't get a bytes string

source: `bpo-21707 <https://bugs.python.org/issue21707>`__: Add missing kwonlyargcount argument to ModuleFinder.replace_paths_in_code().
fr: `bpo-21707 <https://bugs.python.org/21707>`__: Add missing kwonlyargcount argument to ModuleFinder.replace_paths_in_code().

source: `bpo-20639 <https://bugs.python.org/issue20639>`__: calling Path.with_suffix('') allows removing the suffix again. Patch by July Tikhonov.
fr: `bpo-20639 <https://bugs.python.org/20639>`__: calling Path.with_suffix('') allows removing the suffix again. Patch by July Tikhonov.

source: `bpo-21714 <https://bugs.python.org/issue21714>`__: Disallow the construction of invalid paths using Path.with_name(). Original patch by Antony Lee.
fr: `bpo-21714 <https://bugs.python.org/21714>`__: Disallow the construction of invalid paths using Path.with_name(). Original patch by Antony Lee.

source: `bpo-15014 <https://bugs.python.org/issue15014>`__: Added 'auth' method to smtplib to make implementing auth mechanisms simpler, and used it internally in the login method.
fr: `bpo-15014 <https://bugs.python.org/15014>`__: Added 'auth' method to smtplib to make implementing auth mechanisms simpler, and used it internally in the login method.

source: `bpo-21151 <https://bugs.python.org/issue21151>`__: Fixed a segfault in the winreg module when ``None`` is passed as a ``REG_BINARY`` value to SetValueEx. Patch by John Ehresman.
fr: `bpo-21151 <https://bugs.python.org/21151>`__: Fixed a segfault in the winreg module when ``None`` is passed as a ``REG_BINARY`` value to SetValueEx. Patch by John Ehresman.

source: `bpo-21090 <https://bugs.python.org/issue21090>`__: io.FileIO.readall() does not ignore I/O errors anymore. Before, it ignored I/O errors if at least the first C call read() succeed.
fr: `bpo-21090 <https://bugs.python.org/21090>`__: io.FileIO.readall() does not ignore I/O errors anymore. Before, it ignored I/O errors if at least the first C call read() succeed.

source: `bpo-5800 <https://bugs.python.org/issue5800>`__: headers parameter of wsgiref.headers.Headers is now optional. Initial patch by Pablo Torres Navarrete and SilentGhost.
fr: `bpo-5800 <https://bugs.python.org/5800>`__: headers parameter of wsgiref.headers.Headers is now optional. Initial patch by Pablo Torres Navarrete and SilentGhost.

source: `bpo-21781 <https://bugs.python.org/issue21781>`__: ssl.RAND_add() now supports strings longer than 2 GB.
fr: `bpo-21781 <https://bugs.python.org/21781>`__: ssl.RAND_add() now supports strings longer than 2 GB.

source: `bpo-21679 <https://bugs.python.org/issue21679>`__: Prevent extraneous fstat() calls during open(). Patch by Bohuslav Kabrda.
fr: `bpo-21679 <https://bugs.python.org/21679>`__: Prevent extraneous fstat() calls during open(). Patch by Bohuslav Kabrda.

source: `bpo-21863 <https://bugs.python.org/issue21863>`__: cProfile now displays the module name of C extension functions, in addition to their own name.
fr: `bpo-21863 <https://bugs.python.org/21863>`__: cProfile now displays the module name of C extension functions, in addition to their own name.

source: `bpo-11453 <https://bugs.python.org/issue11453>`__: asyncore: emit a ResourceWarning when an unclosed file_wrapper object is destroyed. The destructor now closes the file if needed. The close() method can now be called twice: the second call does nothing.
fr: `bpo-11453 <https://bugs.python.org/11453>`__: asyncore: emit a ResourceWarning when an unclosed file_wrapper object is destroyed. The destructor now closes the file if needed. The close() method can now be called twice: the second call does nothing.

source: `bpo-21858 <https://bugs.python.org/issue21858>`__: Better handling of Python exceptions in the sqlite3 module.
fr: `bpo-21858 <https://bugs.python.org/21858>`__: Better handling of Python exceptions in the sqlite3 module.

source: `bpo-21476 <https://bugs.python.org/issue21476>`__: Make sure the email.parser.BytesParser TextIOWrapper is discarded after parsing, so the input file isn't unexpectedly closed.
fr: `bpo-21476 <https://bugs.python.org/21476>`__: Make sure the email.parser.BytesParser TextIOWrapper is discarded after parsing, so the input file isn't unexpectedly closed.

source: `bpo-20295 <https://bugs.python.org/issue20295>`__: imghdr now recognizes OpenEXR format images.
fr: `bpo-20295 <https://bugs.python.org/20295>`__: imghdr now recognizes OpenEXR format images.

source: `bpo-21729 <https://bugs.python.org/issue21729>`__: Used the "with" statement in the dbm.dumb module to ensure files closing. Patch by Claudiu Popa.
fr: `bpo-21729 <https://bugs.python.org/21729>`__: Used the "with" statement in the dbm.dumb module to ensure files closing. Patch by Claudiu Popa.

source: `bpo-21491 <https://bugs.python.org/issue21491>`__: socketserver: Fix a race condition in child processes reaping.
fr: `bpo-21491 <https://bugs.python.org/21491>`__: socketserver: Fix a race condition in child processes reaping.

source: `bpo-21719 <https://bugs.python.org/issue21719>`__: Added the ``st_file_attributes`` field to os.stat_result on Windows.
fr: `bpo-21719 <https://bugs.python.org/21719>`__: Added the ``st_file_attributes`` field to os.stat_result on Windows.

source: `bpo-21832 <https://bugs.python.org/issue21832>`__: Require named tuple inputs to be exact strings.
fr: `bpo-21832 <https://bugs.python.org/21832>`__: Require named tuple inputs to be exact strings.

source: `bpo-21722 <https://bugs.python.org/issue21722>`__: The distutils "upload" command now exits with a non-zero return code when uploading fails. Patch by Martin Dengler.
fr: `bpo-21722 <https://bugs.python.org/21722>`__: The distutils "upload" command now exits with a non-zero return code when uploading fails. Patch by Martin Dengler.

source: `bpo-21723 <https://bugs.python.org/issue21723>`__: asyncio.Queue: support any type of number (ex: float) for the maximum size. Patch written by Vajrasky Kok.
fr: `bpo-21723 <https://bugs.python.org/21723>`__: asyncio.Queue: support any type of number (ex: float) for the maximum size. Patch written by Vajrasky Kok.

source: `bpo-21711 <https://bugs.python.org/issue21711>`__: support for "site-python" directories has now been removed from the site module (it was deprecated in 3.4).
fr: `bpo-21711 <https://bugs.python.org/21711>`__: support for "site-python" directories has now been removed from the site module (it was deprecated in 3.4).

source: `bpo-17552 <https://bugs.python.org/issue17552>`__: new socket.sendfile() method allowing a file to be sent over a socket by using high-performance os.sendfile() on UNIX. Patch by Giampaolo Rodola'.
fr: `bpo-17552 <https://bugs.python.org/17552>`__: new socket.sendfile() method allowing a file to be sent over a socket by using high-performance os.sendfile() on UNIX. Patch by Giampaolo Rodola'.

source: `bpo-18039 <https://bugs.python.org/issue18039>`__: dbm.dump.open() now always creates a new database when the flag has the value 'n'. Patch by Claudiu Popa.
fr: `bpo-18039 <https://bugs.python.org/18039>`__: dbm.dump.open() now always creates a new database when the flag has the value 'n'. Patch by Claudiu Popa.

source: `bpo-21326 <https://bugs.python.org/issue21326>`__: Add a new is_closed() method to asyncio.BaseEventLoop. run_forever() and run_until_complete() methods of asyncio.BaseEventLoop now raise an exception if the event loop was closed.
fr: `bpo-21326 <https://bugs.python.org/21326>`__: Add a new is_closed() method to asyncio.BaseEventLoop. run_forever() and run_until_complete() methods of asyncio.BaseEventLoop now raise an exception if the event loop was closed.

source: `bpo-21766 <https://bugs.python.org/issue21766>`__: Prevent a security hole in CGIHTTPServer by URL unquoting paths before checking for a CGI script at that path.
fr: `bpo-21766 <https://bugs.python.org/21766>`__: Prevent a security hole in CGIHTTPServer by URL unquoting paths before checking for a CGI script at that path.

source: `bpo-21310 <https://bugs.python.org/issue21310>`__: Fixed possible resource leak in failed open().
fr: `bpo-21310 <https://bugs.python.org/21310>`__: Fixed possible resource leak in failed open().

source: `bpo-21256 <https://bugs.python.org/issue21256>`__: Printout of keyword args should be in deterministic order in a mock function call. This will help to write better doctests.
fr: `bpo-21256 <https://bugs.python.org/21256>`__: Printout of keyword args should be in deterministic order in a mock function call. This will help to write better doctests.

source: `bpo-21677 <https://bugs.python.org/issue21677>`__: Fixed chaining nonnormalized exceptions in io close() methods.
fr: `bpo-21677 <https://bugs.python.org/21677>`__: Fixed chaining nonnormalized exceptions in io close() methods.

source: `bpo-11709 <https://bugs.python.org/issue11709>`__: Fix the pydoc.help function to not fail when sys.stdin is not a valid file.
fr: `bpo-11709 <https://bugs.python.org/11709>`__: Fix the pydoc.help function to not fail when sys.stdin is not a valid file.

source: `bpo-21515 <https://bugs.python.org/issue21515>`__: tempfile.TemporaryFile now uses os.O_TMPFILE flag is available.
fr: `bpo-21515 <https://bugs.python.org/21515>`__: tempfile.TemporaryFile now uses os.O_TMPFILE flag is available.

source: `bpo-13223 <https://bugs.python.org/issue13223>`__: Fix pydoc.writedoc so that the HTML documentation for methods that use 'self' in the example code is generated correctly.
fr: `bpo-13223 <https://bugs.python.org/13223>`__: Fix pydoc.writedoc so that the HTML documentation for methods that use 'self' in the example code is generated correctly.

source: `bpo-21463 <https://bugs.python.org/issue21463>`__: In urllib.request, fix pruning of the FTP cache.
fr: `bpo-21463 <https://bugs.python.org/21463>`__: In urllib.request, fix pruning of the FTP cache.

source: `bpo-21618 <https://bugs.python.org/issue21618>`__: The subprocess module could fail to close open fds that were inherited by the calling process and already higher than POSIX resource limits would otherwise allow. On systems with a functioning /proc/self/fd or /dev/fd interface the max is now ignored and all fds are closed.
fr: `bpo-21618 <https://bugs.python.org/21618>`__: The subprocess module could fail to close open fds that were inherited by the calling process and already higher than POSIX resource limits would otherwise allow. On systems with a functioning /proc/self/fd or /dev/fd interface the max is now ignored and all fds are closed.

source: `bpo-20383 <https://bugs.python.org/issue20383>`__: Introduce importlib.util.module_from_spec() as the preferred way to create a new module.
fr: `bpo-20383 <https://bugs.python.org/20383>`__: Introduce importlib.util.module_from_spec() as the preferred way to create a new module.

source: `bpo-21552 <https://bugs.python.org/issue21552>`__: Fixed possible integer overflow of too long string lengths in the tkinter module on 64-bit platforms.
fr: `bpo-21552 <https://bugs.python.org/21552>`__: Fixed possible integer overflow of too long string lengths in the tkinter module on 64-bit platforms.

source: `bpo-14315 <https://bugs.python.org/issue14315>`__: The zipfile module now ignores extra fields in the central directory that are too short to be parsed instead of letting a struct.unpack error bubble up as this "bad data" appears in many real world zip files in the wild and is ignored by other zip tools.
fr: `bpo-14315 <https://bugs.python.org/14315>`__: The zipfile module now ignores extra fields in the central directory that are too short to be parsed instead of letting a struct.unpack error bubble up as this "bad data" appears in many real world zip files in the wild and is ignored by other zip tools.

source: `bpo-13742 <https://bugs.python.org/issue13742>`__: Added "key" and "reverse" parameters to heapq.merge(). (First draft of patch contributed by Simon Sapin.)
fr: `bpo-13742 <https://bugs.python.org/13742>`__: Added "key" and "reverse" parameters to heapq.merge(). (First draft of patch contributed by Simon Sapin.)

source: `bpo-21402 <https://bugs.python.org/issue21402>`__: tkinter.ttk now works when default root window is not set.
fr: `bpo-21402 <https://bugs.python.org/21402>`__: tkinter.ttk now works when default root window is not set.

source: `bpo-3015 <https://bugs.python.org/issue3015>`__: _tkinter.create() now creates tkapp object with wantobject=1 by default.
fr: `bpo-3015 <https://bugs.python.org/3015>`__: _tkinter.create() now creates tkapp object with wantobject=1 by default.

source: `bpo-10203 <https://bugs.python.org/issue10203>`__: sqlite3.Row now truly supports sequence protocol. In particular it supports reverse() and negative indices. Original patch by Claudiu Popa.
fr: `bpo-10203 <https://bugs.python.org/10203>`__: sqlite3.Row now truly supports sequence protocol. In particular it supports reverse() and negative indices. Original patch by Claudiu Popa.

source: `bpo-18807 <https://bugs.python.org/issue18807>`__: If copying (no symlinks) specified for a venv, then the python interpreter aliases (python, python3) are now created by copying rather than symlinking.
fr: `bpo-18807 <https://bugs.python.org/18807>`__: If copying (no symlinks) specified for a venv, then the python interpreter aliases (python, python3) are now created by copying rather than symlinking.

source: `bpo-20197 <https://bugs.python.org/issue20197>`__: Added support for the WebP image type in the imghdr module. Patch by Fabrice Aneche and Claudiu Popa.
fr: `bpo-20197 <https://bugs.python.org/20197>`__: Added support for the WebP image type in the imghdr module. Patch by Fabrice Aneche and Claudiu Popa.

source: `bpo-21513 <https://bugs.python.org/issue21513>`__: Speedup some properties of IP addresses (IPv4Address, IPv6Address) such as .is_private or .is_multicast.
fr: `bpo-21513 <https://bugs.python.org/21513>`__: Speedup some properties of IP addresses (IPv4Address, IPv6Address) such as .is_private or .is_multicast.

source: `bpo-21137 <https://bugs.python.org/issue21137>`__: Improve the repr for threading.Lock() and its variants by showing the "locked" or "unlocked" status. Patch by Berker Peksag.
fr: `bpo-21137 <https://bugs.python.org/21137>`__: Improve the repr for threading.Lock() and its variants by showing the "locked" or "unlocked" status. Patch by Berker Peksag.

source: `bpo-21538 <https://bugs.python.org/issue21538>`__: The plistlib module now supports loading of binary plist files when reference or offset size is not a power of two.
fr: `bpo-21538 <https://bugs.python.org/21538>`__: The plistlib module now supports loading of binary plist files when reference or offset size is not a power of two.

source: `bpo-21455 <https://bugs.python.org/issue21455>`__: Add a default backlog to socket.listen().
fr: `bpo-21455 <https://bugs.python.org/21455>`__: Add a default backlog to socket.listen().

source: `bpo-21525 <https://bugs.python.org/issue21525>`__: Most Tkinter methods which accepted tuples now accept lists too.
fr: `bpo-21525 <https://bugs.python.org/21525>`__: Most Tkinter methods which accepted tuples now accept lists too.

source: `bpo-22166 <https://bugs.python.org/issue22166>`__: With the assistance of a new internal _codecs._forget_codec helping function, test_codecs now clears the encoding caches to avoid the appearance of a reference leak
fr: `bpo-22166 <https://bugs.python.org/22166>`__: With the assistance of a new internal _codecs._forget_codec helping function, test_codecs now clears the encoding caches to avoid the appearance of a reference leak

source: `bpo-22236 <https://bugs.python.org/issue22236>`__: Tkinter tests now don't reuse default root window. New root window is created for every test class.
fr: `bpo-22236 <https://bugs.python.org/22236>`__: Tkinter tests now don't reuse default root window. New root window is created for every test class.

source: `bpo-10744 <https://bugs.python.org/issue10744>`__: Fix PEP 3118 format strings on ctypes objects with a nontrivial shape.
fr: `bpo-10744 <https://bugs.python.org/10744>`__: Fix PEP 3118 format strings on ctypes objects with a nontrivial shape.

source: `bpo-20826 <https://bugs.python.org/issue20826>`__: Optimize ipaddress.collapse_addresses().
fr: `bpo-20826 <https://bugs.python.org/20826>`__: Optimize ipaddress.collapse_addresses().

source: `bpo-21487 <https://bugs.python.org/issue21487>`__: Optimize ipaddress.summarize_address_range() and ipaddress.{IPv4Network,IPv6Network}.subnets().
fr: `bpo-21487 <https://bugs.python.org/21487>`__: Optimize ipaddress.summarize_address_range() and ipaddress.{IPv4Network,IPv6Network}.subnets().

source: `bpo-21486 <https://bugs.python.org/issue21486>`__: Optimize parsing of netmasks in ipaddress.IPv4Network and ipaddress.IPv6Network.
fr: `bpo-21486 <https://bugs.python.org/21486>`__: Optimize parsing of netmasks in ipaddress.IPv4Network and ipaddress.IPv6Network.

source: `bpo-13916 <https://bugs.python.org/issue13916>`__: Disallowed the surrogatepass error handler for non UTF-\* encodings.
fr: `bpo-13916 <https://bugs.python.org/13916>`__: Disallowed the surrogatepass error handler for non UTF-\* encodings.

source: `bpo-20998 <https://bugs.python.org/issue20998>`__: Fixed re.fullmatch() of repeated single character pattern with ignore case. Original patch by Matthew Barnett.
fr: `bpo-20998 <https://bugs.python.org/20998>`__: Fixed re.fullmatch() of repeated single character pattern with ignore case. Original patch by Matthew Barnett.

source: `bpo-21075 <https://bugs.python.org/issue21075>`__: fileinput.FileInput now reads bytes from standard stream if binary mode is specified. Patch by Sam Kimbrel.
fr: `bpo-21075 <https://bugs.python.org/21075>`__: fileinput.FileInput now reads bytes from standard stream if binary mode is specified. Patch by Sam Kimbrel.

source: `bpo-19775 <https://bugs.python.org/issue19775>`__: Add a samefile() method to pathlib Path objects. Initial patch by Vajrasky Kok.
fr: `bpo-19775 <https://bugs.python.org/19775>`__: Add a samefile() method to pathlib Path objects. Initial patch by Vajrasky Kok.

source: `bpo-21226 <https://bugs.python.org/issue21226>`__: Set up modules properly in PyImport_ExecCodeModuleObject (and friends).
fr: `bpo-21226 <https://bugs.python.org/21226>`__: Set up modules properly in PyImport_ExecCodeModuleObject (and friends).

source: `bpo-21398 <https://bugs.python.org/issue21398>`__: Fix a unicode error in the pydoc pager when the documentation contains characters not encodable to the stdout encoding.
fr: `bpo-21398 <https://bugs.python.org/21398>`__: Fix a unicode error in the pydoc pager when the documentation contains characters not encodable to the stdout encoding.

source: `bpo-16531 <https://bugs.python.org/issue16531>`__: ipaddress.IPv4Network and ipaddress.IPv6Network now accept an (address, netmask) tuple argument, so as to easily construct network objects from existing addresses.
fr: `bpo-16531 <https://bugs.python.org/16531>`__: ipaddress.IPv4Network and ipaddress.IPv6Network now accept an (address, netmask) tuple argument, so as to easily construct network objects from existing addresses.

source: `bpo-21156 <https://bugs.python.org/issue21156>`__: importlib.abc.InspectLoader.source_to_code() is now a staticmethod.
fr: `bpo-21156 <https://bugs.python.org/21156>`__: importlib.abc.InspectLoader.source_to_code() is now a staticmethod.

source: `bpo-21424 <https://bugs.python.org/issue21424>`__: Simplified and optimized heaqp.nlargest() and nmsmallest() to make fewer tuple comparisons.
fr: `bpo-21424 <https://bugs.python.org/21424>`__: Simplified and optimized heaqp.nlargest() and nmsmallest() to make fewer tuple comparisons.

source: `bpo-21396 <https://bugs.python.org/issue21396>`__: Fix TextIOWrapper(..., write_through=True) to not force a flush() on the underlying binary stream. Patch by akira.
fr: `bpo-21396 <https://bugs.python.org/21396>`__: Fix TextIOWrapper(..., write_through=True) to not force a flush() on the underlying binary stream. Patch by akira.

source: `bpo-18314 <https://bugs.python.org/issue18314>`__: Unlink now removes junctions on Windows. Patch by Kim Gräsman
fr: `bpo-18314 <https://bugs.python.org/18314>`__: Unlink now removes junctions on Windows. Patch by Kim Gräsman

source: `bpo-21088 <https://bugs.python.org/issue21088>`__: Bugfix for curses.window.addch() regression in 3.4.0. In porting to Argument Clinic, the first two arguments were reversed.
fr: `bpo-21088 <https://bugs.python.org/21088>`__: Bugfix for curses.window.addch() regression in 3.4.0. In porting to Argument Clinic, the first two arguments were reversed.

source: `bpo-21407 <https://bugs.python.org/issue21407>`__: _decimal: The module now supports function signatures.
fr: `bpo-21407 <https://bugs.python.org/21407>`__: _decimal: The module now supports function signatures.

source: `bpo-10650 <https://bugs.python.org/issue10650>`__: Remove the non-standard 'watchexp' parameter from the Decimal.quantize() method in the Python version. It had never been present in the C version.
fr: `bpo-10650 <https://bugs.python.org/10650>`__: Remove the non-standard 'watchexp' parameter from the Decimal.quantize() method in the Python version. It had never been present in the C version.

source: `bpo-21469 <https://bugs.python.org/issue21469>`__: Reduced the risk of false positives in robotparser by checking to make sure that robots.txt has been read or does not exist prior to returning True in can_fetch().
fr: `bpo-21469 <https://bugs.python.org/21469>`__: Reduced the risk of false positives in robotparser by checking to make sure that robots.txt has been read or does not exist prior to returning True in can_fetch().
