Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-22896 <https://bugs.python.org/issue22896>`__: Avoid using PyObject_AsCharBuffer(), PyObject_AsReadBuffer() and PyObject_AsWriteBuffer().
fr: `bpo-22896 <https://bugs.python.org/22896>`__: Avoid using PyObject_AsCharBuffer(), PyObject_AsReadBuffer() and PyObject_AsWriteBuffer().

source: `bpo-21295 <https://bugs.python.org/issue21295>`__: Revert some changes (`bpo-16795 <https://bugs.python.org/issue16795>`__) to AST line numbers and column offsets that constituted a regression.
fr: `bpo-21295 <https://bugs.python.org/21295>`__: Revert some changes (`issue #16795 <https://bugs.python.org/16795>`__) to AST line numbers and column offsets that constituted a regression.

source: `bpo-22986 <https://bugs.python.org/issue22986>`__: Allow changing an object's __class__ between a dynamic type and static type in some cases.
fr: `bpo-22986 <https://bugs.python.org/22986>`__: Allow changing an object's __class__ between a dynamic type and static type in some cases.

source: `bpo-15859 <https://bugs.python.org/issue15859>`__: PyUnicode_EncodeFSDefault(), PyUnicode_EncodeMBCS() and PyUnicode_EncodeCodePage() now raise an exception if the object is not a Unicode object. For PyUnicode_EncodeFSDefault(), it was already the case on platforms other than Windows. Patch written by Campbell Barton.
fr: `bpo-15859 <https://bugs.python.org/15859>`__: PyUnicode_EncodeFSDefault(), PyUnicode_EncodeMBCS() and PyUnicode_EncodeCodePage() now raise an exception if the object is not a Unicode object. For PyUnicode_EncodeFSDefault(), it was already the case on platforms other than Windows. Patch written by Campbell Barton.

source: `bpo-21408 <https://bugs.python.org/issue21408>`__: The default __ne__() now returns NotImplemented if __eq__() returned NotImplemented. Original patch by Martin Panter.
fr: `bpo-21408 <https://bugs.python.org/21408>`__: The default __ne__() now returns NotImplemented if __eq__() returned NotImplemented. Original patch by Martin Panter.

source: `bpo-23321 <https://bugs.python.org/issue23321>`__: Fixed a crash in str.decode() when error handler returned replacment string longer than mailformed input data.
fr: `bpo-23321 <https://bugs.python.org/23321>`__: Fixed a crash in str.decode() when error handler returned replacment string longer than mailformed input data.

source: `bpo-22286 <https://bugs.python.org/issue22286>`__: The "backslashreplace" error handlers now works with decoding and translating.
fr: `bpo-22286 <https://bugs.python.org/22286>`__: The "backslashreplace" error handlers now works with decoding and translating.

source: `bpo-23253 <https://bugs.python.org/issue23253>`__: Delay-load ShellExecute[AW] in os.startfile for reduced startup overhead on Windows.
fr: `bpo-23253 <https://bugs.python.org/23253>`__: Delay-load ShellExecute[AW] in os.startfile for reduced startup overhead on Windows.

source: `bpo-22038 <https://bugs.python.org/issue22038>`__: pyatomic.h now uses stdatomic.h or GCC built-in functions for atomic memory access if available. Patch written by Vitor de Lima and Gustavo Temple.
fr: `bpo-22038 <https://bugs.python.org/22038>`__: pyatomic.h now uses stdatomic.h or GCC built-in functions for atomic memory access if available. Patch written by Vitor de Lima and Gustavo Temple.

source: `bpo-20284 <https://bugs.python.org/issue20284>`__: %-interpolation (aka printf) formatting added for bytes and bytearray.
fr: `bpo-20284 <https://bugs.python.org/20284>`__: %-interpolation (aka printf) formatting added for bytes and bytearray.

source: `bpo-23048 <https://bugs.python.org/issue23048>`__: Fix jumping out of an infinite while loop in the pdb.
fr: `bpo-23048 <https://bugs.python.org/23048>`__: Fix jumping out of an infinite while loop in the pdb.

source: `bpo-20335 <https://bugs.python.org/issue20335>`__: bytes constructor now raises TypeError when encoding or errors is specified with non-string argument. Based on patch by Renaud Blanch.
fr: `bpo-20335 <https://bugs.python.org/20335>`__: bytes constructor now raises TypeError when encoding or errors is specified with non-string argument. Based on patch by Renaud Blanch.

source: `bpo-22834 <https://bugs.python.org/issue22834>`__: If the current working directory ends up being set to a non-existent directory then import will no longer raise FileNotFoundError.
fr: `bpo-22834 <https://bugs.python.org/22834>`__: If the current working directory ends up being set to a non-existent directory then import will no longer raise FileNotFoundError.

source: `bpo-22869 <https://bugs.python.org/issue22869>`__: Move the interpreter startup & shutdown code to a new dedicated pylifecycle.c module
fr: `bpo-22869 <https://bugs.python.org/22869>`__: Move the interpreter startup & shutdown code to a new dedicated pylifecycle.c module

source: `bpo-22847 <https://bugs.python.org/issue22847>`__: Improve method cache efficiency.
fr: `bpo-22847 <https://bugs.python.org/22847>`__: Improve method cache efficiency.

source: `bpo-22335 <https://bugs.python.org/issue22335>`__: Fix crash when trying to enlarge a bytearray to 0x7fffffff bytes on a 32-bit platform.
fr: `bpo-22335 <https://bugs.python.org/22335>`__: Fix crash when trying to enlarge a bytearray to 0x7fffffff bytes on a 32-bit platform.

source: `bpo-22653 <https://bugs.python.org/issue22653>`__: Fix an assertion failure in debug mode when doing a reentrant dict insertion in debug mode.
fr: `bpo-22653 <https://bugs.python.org/22653>`__: Fix an assertion failure in debug mode when doing a reentrant dict insertion in debug mode.

source: `bpo-22643 <https://bugs.python.org/issue22643>`__: Fix integer overflow in Unicode case operations (upper, lower, title, swapcase, casefold).
fr: `bpo-22643 <https://bugs.python.org/22643>`__: Fix integer overflow in Unicode case operations (upper, lower, title, swapcase, casefold).

source: `bpo-17636 <https://bugs.python.org/issue17636>`__: Circular imports involving relative imports are now supported.
fr: `bpo-17636 <https://bugs.python.org/17636>`__: Circular imports involving relative imports are now supported.

source: `bpo-22604 <https://bugs.python.org/issue22604>`__: Fix assertion error in debug mode when dividing a complex number by (nan+0j).
fr: `bpo-22604 <https://bugs.python.org/22604>`__: Fix assertion error in debug mode when dividing a complex number by (nan+0j).

source: `bpo-21052 <https://bugs.python.org/issue21052>`__: Do not raise ImportWarning when sys.path_hooks or sys.meta_path are set to None.
fr: `bpo-21052 <https://bugs.python.org/21052>`__: Do not raise ImportWarning when sys.path_hooks or sys.meta_path are set to None.

source: `bpo-16518 <https://bugs.python.org/issue16518>`__: Use 'bytes-like object required' in error messages that previously used the far more cryptic "'x' does not support the buffer protocol.
fr: `bpo-16518 <https://bugs.python.org/16518>`__: Use 'bytes-like object required' in error messages that previously used the far more cryptic "'x' does not support the buffer protocol.

source: `bpo-22470 <https://bugs.python.org/issue22470>`__: Fixed integer overflow issues in "backslashreplace", "xmlcharrefreplace", and "surrogatepass" error handlers.
fr: `bpo-22470 <https://bugs.python.org/22470>`__: Fixed integer overflow issues in "backslashreplace", "xmlcharrefreplace", and "surrogatepass" error handlers.

source: `bpo-22540 <https://bugs.python.org/issue22540>`__: speed up `PyObject_IsInstance` and `PyObject_IsSubclass` in the common case that the second argument has metaclass `type`.
fr: `bpo-22540 <https://bugs.python.org/22540>`__: speed up `PyObject_IsInstance` and `PyObject_IsSubclass` in the common case that the second argument has metaclass `type`.

source: `bpo-18711 <https://bugs.python.org/issue18711>`__: Add a new `PyErr_FormatV` function, similar to `PyErr_Format` but accepting a `va_list` argument.
fr: `bpo-18711 <https://bugs.python.org/18711>`__: Add a new `PyErr_FormatV` function, similar to `PyErr_Format` but accepting a `va_list` argument.

source: `bpo-22520 <https://bugs.python.org/issue22520>`__: Fix overflow checking when generating the repr of a unicode object.
fr: `bpo-22520 <https://bugs.python.org/22520>`__: Fix overflow checking when generating the repr of a unicode object.

source: `bpo-22519 <https://bugs.python.org/issue22519>`__: Fix overflow checking in PyBytes_Repr.
fr: `bpo-22519 <https://bugs.python.org/22519>`__: Fix overflow checking in PyBytes_Repr.

source: `bpo-22518 <https://bugs.python.org/issue22518>`__: Fix integer overflow issues in latin-1 encoding.
fr: `bpo-22518 <https://bugs.python.org/22518>`__: Fix integer overflow issues in latin-1 encoding.

source: `bpo-16324 <https://bugs.python.org/issue16324>`__: _charset parameter of MIMEText now also accepts email.charset.Charset instances. Initial patch by Claude Paroz.
fr: `bpo-16324 <https://bugs.python.org/16324>`__: _charset parameter of MIMEText now also accepts email.charset.Charset instances. Initial patch by Claude Paroz.

source: `bpo-1764286 <https://bugs.python.org/issue1764286>`__: Fix inspect.getsource() to support decorated functions. Patch by Claudiu Popa.
fr: `bpo-1764286 <https://bugs.python.org/1764286>`__: Fix inspect.getsource() to support decorated functions. Patch by Claudiu Popa.

source: `bpo-18554 <https://bugs.python.org/issue18554>`__: os.__all__ includes posix functions.
fr: `bpo-18554 <https://bugs.python.org/18554>`__: os.__all__ includes posix functions.

source: `bpo-21391 <https://bugs.python.org/issue21391>`__: Use os.path.abspath in the shutil module.
fr: `bpo-21391 <https://bugs.python.org/21391>`__: Use os.path.abspath in the shutil module.

source: `bpo-11471 <https://bugs.python.org/issue11471>`__: avoid generating a JUMP_FORWARD instruction at the end of an if-block if there is no else-clause. Original patch by Eugene Toder.
fr: `bpo-11471 <https://bugs.python.org/11471>`__: avoid generating a JUMP_FORWARD instruction at the end of an if-block if there is no else-clause. Original patch by Eugene Toder.

source: `bpo-22215 <https://bugs.python.org/issue22215>`__: Now ValueError is raised instead of TypeError when str or bytes argument contains not permitted null character or byte.
fr: `bpo-22215 <https://bugs.python.org/22215>`__: Now ValueError is raised instead of TypeError when str or bytes argument contains not permitted null character or byte.

source: `bpo-22258 <https://bugs.python.org/issue22258>`__: Fix the internal function set_inheritable() on Illumos. This platform exposes the function ``ioctl(FIOCLEX)``, but calling it fails with errno is ENOTTY: "Inappropriate ioctl for device". set_inheritable() now falls back to the slower ``fcntl()`` (``F_GETFD`` and then ``F_SETFD``).
fr: `bpo-22258 <https://bugs.python.org/22258>`__: Fix the internal function set_inheritable() on Illumos. This platform exposes the function ``ioctl(FIOCLEX)``, but calling it fails with errno is ENOTTY: "Inappropriate ioctl for device". set_inheritable() now falls back to the slower ``fcntl()`` (``F_GETFD`` and then ``F_SETFD``).

source: `bpo-21389 <https://bugs.python.org/issue21389>`__: Displaying the __qualname__ of the underlying function in the repr of a bound method.
fr: `bpo-21389 <https://bugs.python.org/21389>`__: Displaying the __qualname__ of the underlying function in the repr of a bound method.

source: `bpo-22206 <https://bugs.python.org/issue22206>`__: Using pthread, PyThread_create_key() now sets errno to ENOMEM and returns -1 (error) on integer overflow.
fr: `bpo-22206 <https://bugs.python.org/22206>`__: Using pthread, PyThread_create_key() now sets errno to ENOMEM and returns -1 (error) on integer overflow.

source: `bpo-20184 <https://bugs.python.org/issue20184>`__: Argument Clinic based signature introspection added for 30 of the builtin functions.
fr: `bpo-20184 <https://bugs.python.org/20184>`__: Argument Clinic based signature introspection added for 30 of the builtin functions.

source: `bpo-22116 <https://bugs.python.org/issue22116>`__: C functions and methods (of the 'builtin_function_or_method' type) can now be weakref'ed. Patch by Wei Wu.
fr: `bpo-22116 <https://bugs.python.org/22116>`__: C functions and methods (of the 'builtin_function_or_method' type) can now be weakref'ed. Patch by Wei Wu.

source: `bpo-22077 <https://bugs.python.org/issue22077>`__: Improve index error messages for bytearrays, bytes, lists, and tuples by adding 'or slices'. Added ', not <typename>' for bytearrays. Original patch by Claudiu Popa.
fr: `bpo-22077 <https://bugs.python.org/22077>`__: Improve index error messages for bytearrays, bytes, lists, and tuples by adding 'or slices'. Added ', not <typename>' for bytearrays. Original patch by Claudiu Popa.

source: `bpo-20179 <https://bugs.python.org/issue20179>`__: Apply Argument Clinic to bytes and bytearray. Patch by Tal Einat.
fr: `bpo-20179 <https://bugs.python.org/20179>`__: Apply Argument Clinic to bytes and bytearray. Patch by Tal Einat.

source: `bpo-22082 <https://bugs.python.org/issue22082>`__: Clear interned strings in slotdefs.
fr: `bpo-22082 <https://bugs.python.org/22082>`__: Clear interned strings in slotdefs.

source: `bpo-21897 <https://bugs.python.org/issue21897>`__: Fix a crash with the f_locals attribute with closure variables when frame.clear() has been called.
fr: `bpo-21897 <https://bugs.python.org/21897>`__: Fix a crash with the f_locals attribute with closure variables when frame.clear() has been called.

source: `bpo-21205 <https://bugs.python.org/issue21205>`__: Add a new ``__qualname__`` attribute to generator, the qualified name, and use it in the representation of a generator (``repr(gen)``). The default name of the generator (``__name__`` attribute) is now get from the function instead of the code. Use ``gen.gi_code.co_name`` to get the name of the code.
fr: `bpo-21205 <https://bugs.python.org/21205>`__: Add a new ``__qualname__`` attribute to generator, the qualified name, and use it in the representation of a generator (``repr(gen)``). The default name of the generator (``__name__`` attribute) is now get from the function instead of the code. Use ``gen.gi_code.co_name`` to get the name of the code.

source: `bpo-21669 <https://bugs.python.org/issue21669>`__: With the aid of heuristics in SyntaxError.__init__, the parser now attempts to generate more meaningful (or at least more search engine friendly) error messages when "exec" and "print" are used as statements.
fr: `bpo-21669 <https://bugs.python.org/21669>`__: With the aid of heuristics in SyntaxError.__init__, the parser now attempts to generate more meaningful (or at least more search engine friendly) error messages when "exec" and "print" are used as statements.

source: `bpo-21642 <https://bugs.python.org/issue21642>`__: In the conditional if-else expression, allow an integer written with no space between itself and the ``else`` keyword (e.g. ``True if 42else False``) to be valid syntax.
fr: `bpo-21642 <https://bugs.python.org/21642>`__: In the conditional if-else expression, allow an integer written with no space between itself and the ``else`` keyword (e.g. ``True if 42else False``) to be valid syntax.

source: `bpo-21523 <https://bugs.python.org/issue21523>`__: Fix over-pessimistic computation of the stack effect of some opcodes in the compiler. This also fixes a quadratic compilation time issue noticeable when compiling code with a large number of "and" and "or" operators.
fr: `bpo-21523 <https://bugs.python.org/21523>`__: Fix over-pessimistic computation of the stack effect of some opcodes in the compiler. This also fixes a quadratic compilation time issue noticeable when compiling code with a large number of "and" and "or" operators.

source: `bpo-21418 <https://bugs.python.org/issue21418>`__: Fix a crash in the builtin function super() when called without argument and without current frame (ex: embedded Python).
fr: `bpo-21418 <https://bugs.python.org/21418>`__: Fix a crash in the builtin function super() when called without argument and without current frame (ex: embedded Python).

source: `bpo-21425 <https://bugs.python.org/issue21425>`__: Fix flushing of standard streams in the interactive interpreter.
fr: `bpo-21425 <https://bugs.python.org/21425>`__: Fix flushing of standard streams in the interactive interpreter.

source: `bpo-21435 <https://bugs.python.org/issue21435>`__: In rare cases, when running finalizers on objects in cyclic trash a bad pointer dereference could occur due to a subtle flaw in internal iteration logic.
fr: `bpo-21435 <https://bugs.python.org/21435>`__: In rare cases, when running finalizers on objects in cyclic trash a bad pointer dereference could occur due to a subtle flaw in internal iteration logic.

source: `bpo-21377 <https://bugs.python.org/issue21377>`__: PyBytes_Concat() now tries to concatenate in-place when the first argument has a reference count of 1. Patch by Nikolaus Rath.
fr: `bpo-21377 <https://bugs.python.org/21377>`__: PyBytes_Concat() now tries to concatenate in-place when the first argument has a reference count of 1. Patch by Nikolaus Rath.

source: `bpo-20355 <https://bugs.python.org/issue20355>`__: -W command line options now have higher priority than the PYTHONWARNINGS environment variable. Patch by Arfrever.
fr: `bpo-20355 <https://bugs.python.org/20355>`__: -W command line options now have higher priority than the PYTHONWARNINGS environment variable. Patch by Arfrever.

source: `bpo-21274 <https://bugs.python.org/issue21274>`__: Define PATH_MAX for GNU/Hurd in Python/pythonrun.c.
fr: `bpo-21274 <https://bugs.python.org/21274>`__: Define PATH_MAX for GNU/Hurd in Python/pythonrun.c.

source: `bpo-20904 <https://bugs.python.org/issue20904>`__: Support setting FPU precision on m68k.
fr: `bpo-20904 <https://bugs.python.org/20904>`__: Support setting FPU precision on m68k.

source: `bpo-21209 <https://bugs.python.org/issue21209>`__: Fix sending tuples to custom generator objects with the yield from syntax.
fr: `bpo-21209 <https://bugs.python.org/21209>`__: Fix sending tuples to custom generator objects with the yield from syntax.

source: `bpo-21193 <https://bugs.python.org/issue21193>`__: pow(a, b, c) now raises ValueError rather than TypeError when b is negative. Patch by Josh Rosenberg.
fr: `bpo-21193 <https://bugs.python.org/21193>`__: pow(a, b, c) now raises ValueError rather than TypeError when b is negative. Patch by Josh Rosenberg.

source: `bpo-21134 <https://bugs.python.org/issue21134>`__: Fix segfault when str is called on an uninitialized UnicodeEncodeError, UnicodeDecodeError, or UnicodeTranslateError object.
fr: `bpo-21134 <https://bugs.python.org/21134>`__: Fix segfault when str is called on an uninitialized UnicodeEncodeError, UnicodeDecodeError, or UnicodeTranslateError object.

source: `bpo-19537 <https://bugs.python.org/issue19537>`__: Fix PyUnicode_DATA() alignment under m68k. Patch by Andreas Schwab.
fr: `bpo-19537 <https://bugs.python.org/19537>`__: Fix PyUnicode_DATA() alignment under m68k. Patch by Andreas Schwab.

source: `bpo-20929 <https://bugs.python.org/issue20929>`__: Add a type cast to avoid shifting a negative number.
fr: `bpo-20929 <https://bugs.python.org/20929>`__: Add a type cast to avoid shifting a negative number.

source: `bpo-20731 <https://bugs.python.org/issue20731>`__: Properly position in source code files even if they are opened in text mode. Patch by Serhiy Storchaka.
fr: `bpo-20731 <https://bugs.python.org/20731>`__: Properly position in source code files even if they are opened in text mode. Patch by Serhiy Storchaka.

source: `bpo-20637 <https://bugs.python.org/issue20637>`__: Key-sharing now also works for instance dictionaries of subclasses. Patch by Peter Ingebretson.
fr: `bpo-20637 <https://bugs.python.org/20637>`__: Key-sharing now also works for instance dictionaries of subclasses. Patch by Peter Ingebretson.

source: `bpo-8297 <https://bugs.python.org/issue8297>`__: Attributes missing from modules now include the module name in the error text. Original patch by ysj.ray.
fr: `bpo-8297 <https://bugs.python.org/8297>`__: Attributes missing from modules now include the module name in the error text. Original patch by ysj.ray.

source: `bpo-19995 <https://bugs.python.org/issue19995>`__: %c, %o, %x, and %X now raise TypeError on non-integer input.
fr: `bpo-19995 <https://bugs.python.org/19995>`__: %c, %o, %x, and %X now raise TypeError on non-integer input.

source: `bpo-19655 <https://bugs.python.org/issue19655>`__: The ASDL parser - used by the build process to generate code for managing the Python AST in C - was rewritten. The new parser is self contained and does not require to carry long the spark.py parser-generator library; spark.py was removed from the source base.
fr: `bpo-19655 <https://bugs.python.org/19655>`__: The ASDL parser - used by the build process to generate code for managing the Python AST in C - was rewritten. The new parser is self contained and does not require to carry long the spark.py parser-generator library; spark.py was removed from the source base.

source: `bpo-12546 <https://bugs.python.org/issue12546>`__: Allow ``\x00`` to be used as a fill character when using str, int, float, and complex __format__ methods.
fr: `bpo-12546 <https://bugs.python.org/12546>`__: Allow ``\x00`` to be used as a fill character when using str, int, float, and complex __format__ methods.

source: `bpo-20480 <https://bugs.python.org/issue20480>`__: Add ipaddress.reverse_pointer. Patch by Leon Weber.
fr: `bpo-20480 <https://bugs.python.org/20480>`__: Add ipaddress.reverse_pointer. Patch by Leon Weber.

source: `bpo-13598 <https://bugs.python.org/issue13598>`__: Modify string.Formatter to support auto-numbering of replacement fields. It now matches the behavior of str.format() in this regard. Patches by Phil Elson and Ramchandra Apte.
fr: `bpo-13598 <https://bugs.python.org/13598>`__: Modify string.Formatter to support auto-numbering of replacement fields. It now matches the behavior of str.format() in this regard. Patches by Phil Elson and Ramchandra Apte.

source: `bpo-8931 <https://bugs.python.org/issue8931>`__: Make alternate formatting ('#') for type 'c' raise an exception. In versions prior to 3.5, '#' with 'c' had no effect. Now specifying it is an error. Patch by Torsten Landschoff.
fr: `bpo-8931 <https://bugs.python.org/8931>`__: Make alternate formatting ('#') for type 'c' raise an exception. In versions prior to 3.5, '#' with 'c' had no effect. Now specifying it is an error. Patch by Torsten Landschoff.

source: `bpo-23165 <https://bugs.python.org/issue23165>`__: Perform overflow checks before allocating memory in the _Py_char2wchar function.
fr: `bpo-23165 <https://bugs.python.org/23165>`__: Perform overflow checks before allocating memory in the _Py_char2wchar function.

source: `bpo-23399 <https://bugs.python.org/issue23399>`__: pyvenv creates relative symlinks where possible.
fr: `bpo-23399 <https://bugs.python.org/23399>`__: pyvenv creates relative symlinks where possible.

source: `bpo-20289 <https://bugs.python.org/issue20289>`__: cgi.FieldStorage() now supports the context management protocol.
fr: `bpo-20289 <https://bugs.python.org/20289>`__: cgi.FieldStorage() now supports the context management protocol.

source: `bpo-13128 <https://bugs.python.org/issue13128>`__: Print response headers for CONNECT requests when debuglevel > 0. Patch by Demian Brecht.
fr: `bpo-13128 <https://bugs.python.org/13128>`__: Print response headers for CONNECT requests when debuglevel > 0. Patch by Demian Brecht.

source: `bpo-15381 <https://bugs.python.org/issue15381>`__: Optimized io.BytesIO to make less allocations and copyings.
fr: `bpo-15381 <https://bugs.python.org/15381>`__: Optimized io.BytesIO to make less allocations and copyings.
