Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-19414 <https://bugs.python.org/issue19414>`__: Have the OrderedDict mark deleted links as unusable. This gives an early failure if the link is deleted during iteration.
fr: `bpo-19414 <https://bugs.python.org/19414>`__: Have the OrderedDict mark deleted links as unusable. This gives an early failure if the link is deleted during iteration.

source: `bpo-21421 <https://bugs.python.org/issue21421>`__: Add __slots__ to the MappingViews ABC. Patch by Josh Rosenberg.
fr: `bpo-21421 <https://bugs.python.org/21421>`__: Add __slots__ to the MappingViews ABC. Patch by Josh Rosenberg.

source: `bpo-21101 <https://bugs.python.org/issue21101>`__: Eliminate double hashing in the C speed-up code for collections.Counter().
fr: `bpo-21101 <https://bugs.python.org/21101>`__: Eliminate double hashing in the C speed-up code for collections.Counter().

source: `bpo-21321 <https://bugs.python.org/issue21321>`__: itertools.islice() now releases the reference to the source iterator when the slice is exhausted. Patch by Anton Afanasyev.
fr: `bpo-21321 <https://bugs.python.org/21321>`__: itertools.islice() now releases the reference to the source iterator when the slice is exhausted. Patch by Anton Afanasyev.

source: `bpo-21057 <https://bugs.python.org/issue21057>`__: TextIOWrapper now allows the underlying binary stream's read() or read1() method to return an arbitrary bytes-like object (such as a memoryview). Patch by Nikolaus Rath.
fr: `bpo-21057 <https://bugs.python.org/21057>`__: TextIOWrapper now allows the underlying binary stream's read() or read1() method to return an arbitrary bytes-like object (such as a memoryview). Patch by Nikolaus Rath.

source: `bpo-20951 <https://bugs.python.org/issue20951>`__: SSLSocket.send() now raises either SSLWantReadError or SSLWantWriteError on a non-blocking socket if the operation would block. Previously, it would return 0. Patch by Nikolaus Rath.
fr: `bpo-20951 <https://bugs.python.org/20951>`__: SSLSocket.send() now raises either SSLWantReadError or SSLWantWriteError on a non-blocking socket if the operation would block. Previously, it would return 0. Patch by Nikolaus Rath.

source: `bpo-13248 <https://bugs.python.org/issue13248>`__: removed previously deprecated asyncore.dispatcher __getattr__ cheap inheritance hack.
fr: `bpo-13248 <https://bugs.python.org/13248>`__: removed previously deprecated asyncore.dispatcher __getattr__ cheap inheritance hack.

source: `bpo-9815 <https://bugs.python.org/issue9815>`__: assertRaises now tries to clear references to local variables in the exception's traceback.
fr: `bpo-9815 <https://bugs.python.org/9815>`__: assertRaises now tries to clear references to local variables in the exception's traceback.

source: `bpo-19940 <https://bugs.python.org/issue19940>`__: ssl.cert_time_to_seconds() now interprets the given time string in the UTC timezone (as specified in RFC 5280), not the local timezone.
fr: `bpo-19940 <https://bugs.python.org/19940>`__: ssl.cert_time_to_seconds() now interprets the given time string in the UTC timezone (as specified in RFC 5280), not the local timezone.

source: `bpo-13204 <https://bugs.python.org/issue13204>`__: Calling sys.flags.__new__ would crash the interpreter, now it raises a TypeError.
fr: `bpo-13204 <https://bugs.python.org/13204>`__: Calling sys.flags.__new__ would crash the interpreter, now it raises a TypeError.

source: `bpo-19385 <https://bugs.python.org/issue19385>`__: Make operations on a closed dbm.dumb database always raise the same exception.
fr: `bpo-19385 <https://bugs.python.org/19385>`__: Make operations on a closed dbm.dumb database always raise the same exception.

source: `bpo-21207 <https://bugs.python.org/issue21207>`__: Detect when the os.urandom cached fd has been closed or replaced, and open it anew.
fr: `bpo-21207 <https://bugs.python.org/21207>`__: Detect when the os.urandom cached fd has been closed or replaced, and open it anew.

source: `bpo-21291 <https://bugs.python.org/issue21291>`__: subprocess's Popen.wait() is now thread safe so that multiple threads may be calling wait() or poll() on a Popen instance at the same time without losing the Popen.returncode value.
fr: `bpo-21291 <https://bugs.python.org/21291>`__: subprocess's Popen.wait() is now thread safe so that multiple threads may be calling wait() or poll() on a Popen instance at the same time without losing the Popen.returncode value.

source: `bpo-21127 <https://bugs.python.org/issue21127>`__: Path objects can now be instantiated from str subclass instances (such as ``numpy.str_``).
fr: `bpo-21127 <https://bugs.python.org/21127>`__: Path objects can now be instantiated from str subclass instances (such as ``numpy.str_``).

source: `bpo-15002 <https://bugs.python.org/issue15002>`__: urllib.response object to use _TemporaryFileWrapper (and _TemporaryFileCloser) facility. Provides a better way to handle file descriptor close. Patch contributed by Christian Theune.
fr: `bpo-15002 <https://bugs.python.org/15002>`__: urllib.response object to use _TemporaryFileWrapper (and _TemporaryFileCloser) facility. Provides a better way to handle file descriptor close. Patch contributed by Christian Theune.

source: `bpo-12220 <https://bugs.python.org/issue12220>`__: mindom now raises a custom ValueError indicating it doesn't support spaces in URIs instead of letting a 'split' ValueError bubble up.
fr: `bpo-12220 <https://bugs.python.org/12220>`__: mindom now raises a custom ValueError indicating it doesn't support spaces in URIs instead of letting a 'split' ValueError bubble up.

source: `bpo-21068 <https://bugs.python.org/issue21068>`__: The ssl.PROTOCOL* constants are now enum members.
fr: `bpo-21068 <https://bugs.python.org/21068>`__: The ssl.PROTOCOL* constants are now enum members.

source: `bpo-21276 <https://bugs.python.org/issue21276>`__: posixmodule: Don't define USE_XATTRS on KFreeBSD and the Hurd.
fr: `bpo-21276 <https://bugs.python.org/21276>`__: posixmodule: Don't define USE_XATTRS on KFreeBSD and the Hurd.

source: `bpo-21262 <https://bugs.python.org/issue21262>`__: New method assert_not_called for Mock. It raises AssertionError if the mock has been called.
fr: `bpo-21262 <https://bugs.python.org/21262>`__: New method assert_not_called for Mock. It raises AssertionError if the mock has been called.

source: `bpo-21238 <https://bugs.python.org/issue21238>`__: New keyword argument `unsafe` to Mock. It raises `AttributeError` incase of an attribute startswith assert or assret.
fr: `bpo-21238 <https://bugs.python.org/21238>`__: New keyword argument `unsafe` to Mock. It raises `AttributeError` incase of an attribute startswith assert or assret.

source: `bpo-20896 <https://bugs.python.org/issue20896>`__: ssl.get_server_certificate() now uses PROTOCOL_SSLv23, not PROTOCOL_SSLv3, for maximum compatibility.
fr: `bpo-20896 <https://bugs.python.org/20896>`__: ssl.get_server_certificate() now uses PROTOCOL_SSLv23, not PROTOCOL_SSLv3, for maximum compatibility.

source: `bpo-21239 <https://bugs.python.org/issue21239>`__: patch.stopall() didn't work deterministically when the same name was patched more than once.
fr: `bpo-21239 <https://bugs.python.org/21239>`__: patch.stopall() didn't work deterministically when the same name was patched more than once.

source: `bpo-21203 <https://bugs.python.org/issue21203>`__: Updated fileConfig and dictConfig to remove inconsistencies. Thanks to Jure Koren for the patch.
fr: `bpo-21203 <https://bugs.python.org/21203>`__: Updated fileConfig and dictConfig to remove inconsistencies. Thanks to Jure Koren for the patch.

source: `bpo-21222 <https://bugs.python.org/issue21222>`__: Passing name keyword argument to mock.create_autospec now works.
fr: `bpo-21222 <https://bugs.python.org/21222>`__: Passing name keyword argument to mock.create_autospec now works.

source: `bpo-21197 <https://bugs.python.org/issue21197>`__: Add lib64 -> lib symlink in venvs on 64-bit non-OS X POSIX.
fr: `bpo-21197 <https://bugs.python.org/21197>`__: Add lib64 -> lib symlink in venvs on 64-bit non-OS X POSIX.

source: `bpo-17498 <https://bugs.python.org/issue17498>`__: Some SMTP servers disconnect after certain errors, violating strict RFC conformance. Instead of losing the error code when we issue the subsequent RSET, smtplib now returns the error code and defers raising the SMTPServerDisconnected error until the next command is issued.
fr: `bpo-17498 <https://bugs.python.org/17498>`__: Some SMTP servers disconnect after certain errors, violating strict RFC conformance. Instead of losing the error code when we issue the subsequent RSET, smtplib now returns the error code and defers raising the SMTPServerDisconnected error until the next command is issued.

source: `bpo-17826 <https://bugs.python.org/issue17826>`__: setting an iterable side_effect on a mock function created by create_autospec now works. Patch by Kushal Das.
fr: `bpo-17826 <https://bugs.python.org/17826>`__: setting an iterable side_effect on a mock function created by create_autospec now works. Patch by Kushal Das.

source: `bpo-7776 <https://bugs.python.org/issue7776>`__: Fix ``Host:`` header and reconnection when using http.client.HTTPConnection.set_tunnel(). Patch by Nikolaus Rath.
fr: `bpo-7776 <https://bugs.python.org/7776>`__: Fix ``Host:`` header and reconnection when using http.client.HTTPConnection.set_tunnel(). Patch by Nikolaus Rath.

source: `bpo-20968 <https://bugs.python.org/issue20968>`__: unittest.mock.MagicMock now supports division. Patch by Johannes Baiter.
fr: `bpo-20968 <https://bugs.python.org/20968>`__: unittest.mock.MagicMock now supports division. Patch by Johannes Baiter.

source: `bpo-21529 <https://bugs.python.org/issue21529>`__ (CVE-2014-4616): Fix arbitrary memory access in JSONDecoder.raw_decode with a negative second parameter. Bug reported by Guido Vranken.
fr: `bpo-21529 <https://bugs.python.org/21529>`__ (CVE-2014-4616): Fix arbitrary memory access in JSONDecoder.raw_decode with a negative second parameter. Bug reported by Guido Vranken.

source: `bpo-21169 <https://bugs.python.org/issue21169>`__: getpass now handles non-ascii characters that the input stream encoding cannot encode by re-encoding using the replace error handler.
fr: `bpo-21169 <https://bugs.python.org/21169>`__: getpass now handles non-ascii characters that the input stream encoding cannot encode by re-encoding using the replace error handler.

source: `bpo-21171 <https://bugs.python.org/issue21171>`__: Fixed undocumented filter API of the rot13 codec. Patch by Berker Peksag.
fr: `bpo-21171 <https://bugs.python.org/21171>`__: Fixed undocumented filter API of the rot13 codec. Patch by Berker Peksag.

source: `bpo-20539 <https://bugs.python.org/issue20539>`__: Improved math.factorial error message for large positive inputs and changed exception type (OverflowError -> ValueError) for large negative inputs.
fr: `bpo-20539 <https://bugs.python.org/20539>`__: Improved math.factorial error message for large positive inputs and changed exception type (OverflowError -> ValueError) for large negative inputs.

source: `bpo-21172 <https://bugs.python.org/issue21172>`__: isinstance check relaxed from dict to collections.Mapping.
fr: `bpo-21172 <https://bugs.python.org/21172>`__: isinstance check relaxed from dict to collections.Mapping.

source: `bpo-21155 <https://bugs.python.org/issue21155>`__: asyncio.EventLoop.create_unix_server() now raises a ValueError if path and sock are specified at the same time.
fr: `bpo-21155 <https://bugs.python.org/21155>`__: asyncio.EventLoop.create_unix_server() now raises a ValueError if path and sock are specified at the same time.

source: `bpo-21136 <https://bugs.python.org/issue21136>`__: Avoid unnecessary normalization of Fractions resulting from power and other operations. Patch by Raymond Hettinger.
fr: `bpo-21136 <https://bugs.python.org/21136>`__: Avoid unnecessary normalization of Fractions resulting from power and other operations. Patch by Raymond Hettinger.

source: `bpo-17621 <https://bugs.python.org/issue17621>`__: Introduce importlib.util.LazyLoader.
fr: `bpo-17621 <https://bugs.python.org/17621>`__: Introduce importlib.util.LazyLoader.

source: `bpo-21076 <https://bugs.python.org/issue21076>`__: signal module constants were turned into enums. Patch by Giampaolo Rodola'.
fr: `bpo-21076 <https://bugs.python.org/21076>`__: signal module constants were turned into enums. Patch by Giampaolo Rodola'.

source: `bpo-20636 <https://bugs.python.org/issue20636>`__: Improved the repr of Tkinter widgets.
fr: `bpo-20636 <https://bugs.python.org/20636>`__: Improved the repr of Tkinter widgets.

source: `bpo-19505 <https://bugs.python.org/issue19505>`__: The items, keys, and values views of OrderedDict now support reverse iteration using reversed().
fr: `bpo-19505 <https://bugs.python.org/19505>`__: The items, keys, and values views of OrderedDict now support reverse iteration using reversed().

source: `bpo-21149 <https://bugs.python.org/issue21149>`__: Improved thread-safety in logging cleanup during interpreter shutdown. Thanks to Devin Jeanpierre for the patch.
fr: `bpo-21149 <https://bugs.python.org/21149>`__: Improved thread-safety in logging cleanup during interpreter shutdown. Thanks to Devin Jeanpierre for the patch.

source: `bpo-21058 <https://bugs.python.org/issue21058>`__: Fix a leak of file descriptor in :func:`tempfile.NamedTemporaryFile`, close the file descriptor if :func:`io.open` fails
fr: `bpo-21058 <https://bugs.python.org/21058>`__: Fix a leak of file descriptor in :func:`tempfile.NamedTemporaryFile`, close the file descriptor if :func:`io.open` fails

source: `bpo-21200 <https://bugs.python.org/issue21200>`__: Return None from pkgutil.get_loader() when __spec__ is missing.
fr: `bpo-21200 <https://bugs.python.org/21200>`__: Return None from pkgutil.get_loader() when __spec__ is missing.

source: `bpo-21013 <https://bugs.python.org/issue21013>`__: Enhance ssl.create_default_context() when used for server side sockets to provide better security by default.
fr: `bpo-21013 <https://bugs.python.org/21013>`__: Enhance ssl.create_default_context() when used for server side sockets to provide better security by default.

source: `bpo-20145 <https://bugs.python.org/issue20145>`__: `assertRaisesRegex` and `assertWarnsRegex` now raise a TypeError if the second argument is not a string or compiled regex.
fr: `bpo-20145 <https://bugs.python.org/20145>`__: `assertRaisesRegex` and `assertWarnsRegex` now raise a TypeError if the second argument is not a string or compiled regex.

source: `bpo-20633 <https://bugs.python.org/issue20633>`__: Replace relative import by absolute import.
fr: `bpo-20633 <https://bugs.python.org/20633>`__: Replace relative import by absolute import.

source: `bpo-20980 <https://bugs.python.org/issue20980>`__: Stop wrapping exception when using ThreadPool.
fr: `bpo-20980 <https://bugs.python.org/20980>`__: Stop wrapping exception when using ThreadPool.

source: `bpo-21082 <https://bugs.python.org/issue21082>`__: In os.makedirs, do not set the process-wide umask. Note this changes behavior of makedirs when exist_ok=True.
fr: `bpo-21082 <https://bugs.python.org/21082>`__: In os.makedirs, do not set the process-wide umask. Note this changes behavior of makedirs when exist_ok=True.

source: `bpo-20990 <https://bugs.python.org/issue20990>`__: Fix issues found by pyflakes for multiprocessing.
fr: `bpo-20990 <https://bugs.python.org/20990>`__: Fix issues found by pyflakes for multiprocessing.

source: `bpo-21015 <https://bugs.python.org/issue21015>`__: SSL contexts will now automatically select an elliptic curve for ECDH key exchange on OpenSSL 1.0.2 and later, and otherwise default to "prime256v1".
fr: `bpo-21015 <https://bugs.python.org/21015>`__: SSL contexts will now automatically select an elliptic curve for ECDH key exchange on OpenSSL 1.0.2 and later, and otherwise default to "prime256v1".

source: `bpo-21000 <https://bugs.python.org/issue21000>`__: Improve the command-line interface of json.tool.
fr: `bpo-21000 <https://bugs.python.org/21000>`__: Improve the command-line interface of json.tool.

source: `bpo-20995 <https://bugs.python.org/issue20995>`__: Enhance default ciphers used by the ssl module to enable better security and prioritize perfect forward secrecy.
fr: `bpo-20995 <https://bugs.python.org/20995>`__: Enhance default ciphers used by the ssl module to enable better security and prioritize perfect forward secrecy.

source: `bpo-20884 <https://bugs.python.org/issue20884>`__: Don't assume that __file__ is defined on importlib.__init__.
fr: `bpo-20884 <https://bugs.python.org/20884>`__: Don't assume that __file__ is defined on importlib.__init__.

source: `bpo-21499 <https://bugs.python.org/issue21499>`__: Ignore __builtins__ in several test_importlib.test_api tests.
fr: `bpo-21499 <https://bugs.python.org/21499>`__: Ignore __builtins__ in several test_importlib.test_api tests.

source: `bpo-20627 <https://bugs.python.org/issue20627>`__: xmlrpc.client.ServerProxy is now a context manager.
fr: `bpo-20627 <https://bugs.python.org/20627>`__: xmlrpc.client.ServerProxy is now a context manager.

source: `bpo-19165 <https://bugs.python.org/issue19165>`__: The formatter module now raises DeprecationWarning instead of PendingDeprecationWarning.
fr: `bpo-19165 <https://bugs.python.org/19165>`__: The formatter module now raises DeprecationWarning instead of PendingDeprecationWarning.

source: `bpo-13936 <https://bugs.python.org/issue13936>`__: Remove the ability of datetime.time instances to be considered false in boolean contexts.
fr: `bpo-13936 <https://bugs.python.org/13936>`__: Remove the ability of datetime.time instances to be considered false in boolean contexts.

source: `bpo-18931 <https://bugs.python.org/issue18931>`__: selectors module now supports /dev/poll on Solaris. Patch by Giampaolo Rodola'.
fr: `bpo-18931 <https://bugs.python.org/18931>`__: selectors module now supports /dev/poll on Solaris. Patch by Giampaolo Rodola'.

source: `bpo-19977 <https://bugs.python.org/issue19977>`__: When the ``LC_TYPE`` locale is the POSIX locale (``C`` locale), :py:data:`sys.stdin` and :py:data:`sys.stdout` are now using the ``surrogateescape`` error handler, instead of the ``strict`` error handler.
fr: `bpo-19977 <https://bugs.python.org/19977>`__: When the ``LC_TYPE`` locale is the POSIX locale (``C`` locale), :py:data:`sys.stdin` and :py:data:`sys.stdout` are now using the ``surrogateescape`` error handler, instead of the ``strict`` error handler.

source: `bpo-20574 <https://bugs.python.org/issue20574>`__: Implement incremental decoder for cp65001 code (Windows code page 65001, Microsoft UTF-8).
fr: `bpo-20574 <https://bugs.python.org/20574>`__: Implement incremental decoder for cp65001 code (Windows code page 65001, Microsoft UTF-8).

source: `bpo-20879 <https://bugs.python.org/issue20879>`__: Delay the initialization of encoding and decoding tables for base32, ascii85 and base85 codecs in the base64 module, and delay the initialization of the unquote_to_bytes() table of the urllib.parse module, to not waste memory if these modules are not used.
fr: `bpo-20879 <https://bugs.python.org/20879>`__: Delay the initialization of encoding and decoding tables for base32, ascii85 and base85 codecs in the base64 module, and delay the initialization of the unquote_to_bytes() table of the urllib.parse module, to not waste memory if these modules are not used.

source: `bpo-19157 <https://bugs.python.org/issue19157>`__: Include the broadcast address in the usuable hosts for IPv6 in ipaddress.
fr: `bpo-19157 <https://bugs.python.org/19157>`__: Include the broadcast address in the usuable hosts for IPv6 in ipaddress.

source: `bpo-11599 <https://bugs.python.org/issue11599>`__: When an external command (e.g. compiler) fails, distutils now prints out the whole command line (instead of just the command name) if the environment variable DISTUTILS_DEBUG is set.
fr: `bpo-11599 <https://bugs.python.org/11599>`__: When an external command (e.g. compiler) fails, distutils now prints out the whole command line (instead of just the command name) if the environment variable DISTUTILS_DEBUG is set.

source: `bpo-4931 <https://bugs.python.org/issue4931>`__: distutils should not produce unhelpful "error: None" messages anymore. distutils.util.grok_environment_error is kept but doc-deprecated.
fr: `bpo-4931 <https://bugs.python.org/4931>`__: distutils should not produce unhelpful "error: None" messages anymore. distutils.util.grok_environment_error is kept but doc-deprecated.

source: `bpo-20875 <https://bugs.python.org/issue20875>`__: Prevent possible gzip "'read' is not defined" NameError. Patch by Claudiu Popa.
fr: `bpo-20875 <https://bugs.python.org/20875>`__: Prevent possible gzip "'read' is not defined" NameError. Patch by Claudiu Popa.

source: `bpo-11558 <https://bugs.python.org/issue11558>`__: ``email.message.Message.attach`` now returns a more useful error message if ``attach`` is called on a message for which ``is_multipart`` is False.
fr: `bpo-11558 <https://bugs.python.org/11558>`__: ``email.message.Message.attach`` now returns a more useful error message if ``attach`` is called on a message for which ``is_multipart`` is False.

source: `bpo-20283 <https://bugs.python.org/issue20283>`__: RE pattern methods now accept the string keyword parameters as documented. The pattern and source keyword parameters are left as deprecated aliases.
fr: `bpo-20283 <https://bugs.python.org/20283>`__: RE pattern methods now accept the string keyword parameters as documented. The pattern and source keyword parameters are left as deprecated aliases.

source: `bpo-20778 <https://bugs.python.org/issue20778>`__: Fix modulefinder to work with bytecode-only modules.
fr: `bpo-20778 <https://bugs.python.org/20778>`__: Fix modulefinder to work with bytecode-only modules.

source: `bpo-20791 <https://bugs.python.org/issue20791>`__: copy.copy() now doesn't make a copy when the input is a bytes object. Initial patch by Peter Otten.
fr: `bpo-20791 <https://bugs.python.org/20791>`__: copy.copy() now doesn't make a copy when the input is a bytes object. Initial patch by Peter Otten.

source: `bpo-19748 <https://bugs.python.org/issue19748>`__: On AIX, time.mktime() now raises an OverflowError for year outsize range [1902; 2037].
fr: `bpo-19748 <https://bugs.python.org/19748>`__: On AIX, time.mktime() now raises an OverflowError for year outsize range [1902; 2037].

source: `bpo-19573 <https://bugs.python.org/issue19573>`__: inspect.signature: Use enum for parameter kind constants.
fr: `bpo-19573 <https://bugs.python.org/19573>`__: inspect.signature: Use enum for parameter kind constants.

source: `bpo-20726 <https://bugs.python.org/issue20726>`__: inspect.signature: Make Signature and Parameter picklable.
fr: `bpo-20726 <https://bugs.python.org/20726>`__: inspect.signature: Make Signature and Parameter picklable.

source: `bpo-17373 <https://bugs.python.org/issue17373>`__: Add inspect.Signature.from_callable method.
fr: `bpo-17373 <https://bugs.python.org/17373>`__: Add inspect.Signature.from_callable method.

source: `bpo-20378 <https://bugs.python.org/issue20378>`__: Improve repr of inspect.Signature and inspect.Parameter.
fr: `bpo-20378 <https://bugs.python.org/20378>`__: Improve repr of inspect.Signature and inspect.Parameter.

source: `bpo-20816 <https://bugs.python.org/issue20816>`__: Fix inspect.getcallargs() to raise correct TypeError for missing keyword-only arguments. Patch by Jeremiah Lowin.
fr: `bpo-20816 <https://bugs.python.org/20816>`__: Fix inspect.getcallargs() to raise correct TypeError for missing keyword-only arguments. Patch by Jeremiah Lowin.
