Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-25144 <https://bugs.python.org/issue25144>`__: Ensures TargetDir is set before continuing with custom install.
fr: `bpo-25144 <https://bugs.python.org/25144>`__: Ensures TargetDir is set before continuing with custom install.

source: `bpo-1602 <https://bugs.python.org/issue1602>`__: Windows console doesn't input or print Unicode (PEP 528)
fr: `bpo-1602 <https://bugs.python.org/1602>`__: Windows console doesn't input or print Unicode (PEP 528)

source: `bpo-27781 <https://bugs.python.org/issue27781>`__: Change file system encoding on Windows to UTF-8 (PEP 529)
fr: `bpo-27781 <https://bugs.python.org/27781>`__: Change file system encoding on Windows to UTF-8 (PEP 529)

source: `bpo-27731 <https://bugs.python.org/issue27731>`__: Opt-out of MAX_PATH on Windows 10
fr: `bpo-27731 <https://bugs.python.org/27731>`__: Opt-out of MAX_PATH on Windows 10

source: `bpo-6135 <https://bugs.python.org/issue6135>`__: Adds encoding and errors parameters to subprocess.
fr: `bpo-6135 <https://bugs.python.org/6135>`__: Adds encoding and errors parameters to subprocess.

source: `bpo-27959 <https://bugs.python.org/issue27959>`__: Adds oem encoding, alias ansi to mbcs, move aliasmbcs to codec lookup.
fr: `bpo-27959 <https://bugs.python.org/27959>`__: Adds oem encoding, alias ansi to mbcs, move aliasmbcs to codec lookup.

source: `bpo-27982 <https://bugs.python.org/issue27982>`__: The functions of the winsound module now accept keyword arguments.
fr: `bpo-27982 <https://bugs.python.org/27982>`__: The functions of the winsound module now accept keyword arguments.

source: `bpo-20366 <https://bugs.python.org/issue20366>`__: Build full text search support into SQLite on Windows.
fr: `bpo-20366 <https://bugs.python.org/20366>`__: Build full text search support into SQLite on Windows.

source: `bpo-27756 <https://bugs.python.org/issue27756>`__: Adds new icons for Python files and processes on Windows. Designs by Cherry Wang.
fr: `bpo-27756 <https://bugs.python.org/27756>`__: Adds new icons for Python files and processes on Windows. Designs by Cherry Wang.

source: `bpo-27883 <https://bugs.python.org/issue27883>`__: Update sqlite to 3.14.1.0 on Windows.
fr: `bpo-27883 <https://bugs.python.org/27883>`__: Update sqlite to 3.14.1.0 on Windows.

source: `bpo-27704 <https://bugs.python.org/issue27704>`__: Optimized creating bytes and bytearray from byte-like objects and iterables. Speed up to 3 times for short objects. Original patch by Naoki Inada.
fr: `bpo-27704 <https://bugs.python.org/27704>`__: Optimized creating bytes and bytearray from byte-like objects and iterables. Speed up to 3 times for short objects. Original patch by Naoki Inada.

source: `bpo-26823 <https://bugs.python.org/issue26823>`__: Large sections of repeated lines in tracebacks are now abbreviated as "[Previous line repeated {count} more times]" by the builtin traceback rendering. Patch by Emanuel Barry.
fr: `bpo-26823 <https://bugs.python.org/26823>`__: Large sections of repeated lines in tracebacks are now abbreviated as "[Previous line repeated {count} more times]" by the builtin traceback rendering. Patch by Emanuel Barry.

source: `bpo-27574 <https://bugs.python.org/issue27574>`__: Decreased an overhead of parsing keyword arguments in functions implemented with using Argument Clinic.
fr: `bpo-27574 <https://bugs.python.org/27574>`__: Decreased an overhead of parsing keyword arguments in functions implemented with using Argument Clinic.

source: `bpo-22557 <https://bugs.python.org/issue22557>`__: Now importing already imported modules is up to 2.5 times faster.
fr: `bpo-22557 <https://bugs.python.org/22557>`__: Now importing already imported modules is up to 2.5 times faster.

source: `bpo-17596 <https://bugs.python.org/issue17596>`__: Include <wincrypt.h> to help with Min GW building.
fr: `bpo-17596 <https://bugs.python.org/17596>`__: Include <wincrypt.h> to help with Min GW building.

source: `bpo-17599 <https://bugs.python.org/issue17599>`__: On Windows, rename the privately defined REPARSE_DATA_BUFFER structure to avoid conflicting with the definition from Min GW.
fr: `bpo-17599 <https://bugs.python.org/17599>`__: On Windows, rename the privately defined REPARSE_DATA_BUFFER structure to avoid conflicting with the definition from Min GW.

source: `bpo-27507 <https://bugs.python.org/issue27507>`__: Add integer overflow check in bytearray.extend(). Patch by Xiang Zhang.
fr: `bpo-27507 <https://bugs.python.org/27507>`__: Add integer overflow check in bytearray.extend(). Patch by Xiang Zhang.

source: `bpo-27581 <https://bugs.python.org/issue27581>`__: Don't rely on wrapping for overflow check in PySequence_Tuple(). Patch by Xiang Zhang.
fr: `bpo-27581 <https://bugs.python.org/27581>`__: Don't rely on wrapping for overflow check in PySequence_Tuple(). Patch by Xiang Zhang.

source: `bpo-1621 <https://bugs.python.org/issue1621>`__: Avoid signed integer overflow in list and tuple operations. Patch by Xiang Zhang.
fr: `bpo-1621 <https://bugs.python.org/1621>`__: Avoid signed integer overflow in list and tuple operations. Patch by Xiang Zhang.

source: `bpo-27419 <https://bugs.python.org/issue27419>`__: Standard __import__() no longer look up "__import__" in globals or builtins for importing submodules or "from import". Fixed a crash if raise a warning about unabling to resolve package from __spec__ or __package__.
fr: `bpo-27419 <https://bugs.python.org/27419>`__: Standard __import__() no longer look up "__import__" in globals or builtins for importing submodules or "from import". Fixed a crash if raise a warning about unabling to resolve package from __spec__ or __package__.

source: `bpo-27083 <https://bugs.python.org/issue27083>`__: Respect the PYTHONCASEOK environment variable under Windows.
fr: `bpo-27083 <https://bugs.python.org/27083>`__: Respect the PYTHONCASEOK environment variable under Windows.

source: `bpo-27514 <https://bugs.python.org/issue27514>`__: Make having too many statically nested blocks a SyntaxError instead of SystemError.
fr: `bpo-27514 <https://bugs.python.org/27514>`__: Make having too many statically nested blocks a SyntaxError instead of SystemError.

source: `bpo-27366 <https://bugs.python.org/issue27366>`__: Implemented PEP 487 (Simpler customization of class creation). Upon subclassing, the __init_subclass__ classmethod is called on the base class. Descriptors are initialized with __set_name__ after class creation.
fr: `bpo-27366 <https://bugs.python.org/27366>`__: Implemented PEP 487 (Simpler customization of class creation). Upon subclassing, the __init_subclass__ classmethod is called on the base class. Descriptors are initialized with __set_name__ after class creation.

source: `bpo-26027 <https://bugs.python.org/issue26027>`__, #27524: Add PEP 519/__fspath__() support to the os and os.path modules. Includes code from Jelle Zijlstra.
fr: `bpo-26027 <https://bugs.python.org/26027>`__, #27524: Add PEP 519/__fspath__() support to the os and os.path modules. Includes code from Jelle Zijlstra.

source: `bpo-27598 <https://bugs.python.org/issue27598>`__: Add Collections to collections.abc. Patch by Ivan Levkivskyi, docs by Neil Girdhar.
fr: `bpo-27598 <https://bugs.python.org/27598>`__: Add Collections to collections.abc. Patch by Ivan Levkivskyi, docs by Neil Girdhar.

source: `bpo-25958 <https://bugs.python.org/issue25958>`__: Support "anti-registration" of special methods from various ABCs, like __hash__, __iter__ or __len__. All these (and several more) can be set to None in an implementation class and the behavior will be as if the method is not defined at all. (Previously, this mechanism existed only for __hash__, to make mutable classes unhashable.) Code contributed by Andrew Barnert and Ivan Levkivskyi.
fr: `bpo-25958 <https://bugs.python.org/25958>`__: Support "anti-registration" of special methods from various ABCs, like __hash__, __iter__ or __len__. All these (and several more) can be set to None in an implementation class and the behavior will be as if the method is not defined at all. (Previously, this mechanism existed only for __hash__, to make mutable classes unhashable.) Code contributed by Andrew Barnert and Ivan Levkivskyi.

source: `bpo-16764 <https://bugs.python.org/issue16764>`__: Support keyword arguments to zlib.decompress(). Patch by Xiang Zhang.
fr: `bpo-16764 <https://bugs.python.org/16764>`__: Support keyword arguments to zlib.decompress(). Patch by Xiang Zhang.

source: `bpo-27736 <https://bugs.python.org/issue27736>`__: Prevent segfault after interpreter re-initialization due to ref count problem introduced in code for `bpo-27038 <https://bugs.python.org/issue27038>`__ in 3.6.0a3. Patch by Xiang Zhang.
fr: `bpo-27736 <https://bugs.python.org/27736>`__: Prevent segfault after interpreter re-initialization due to ref count problem introduced in code for `Issue #27038 <https://bugs.python.org/27038>`__ in 3.6.0a3. Patch by Xiang Zhang.

source: `bpo-25628 <https://bugs.python.org/issue25628>`__: The *verbose* and *rename* parameters for collections.namedtuple are now keyword-only.
fr: `bpo-25628 <https://bugs.python.org/25628>`__: The *verbose* and *rename* parameters for collections.namedtuple are now keyword-only.

source: `bpo-12345 <https://bugs.python.org/issue12345>`__: Add mathematical constant tau to math and cmath. See also PEP 628.
fr: `bpo-12345 <https://bugs.python.org/12345>`__: Add mathematical constant tau to math and cmath. See also PEP 628.

source: `bpo-26823 <https://bugs.python.org/issue26823>`__: traceback.StackSummary.format now abbreviates large sections of repeated lines as "[Previous line repeated {count} more times]" (this change then further affects other traceback display operations in the module). Patch by Emanuel Barry.
fr: `bpo-26823 <https://bugs.python.org/26823>`__: traceback.StackSummary.format now abbreviates large sections of repeated lines as "[Previous line repeated {count} more times]" (this change then further affects other traceback display operations in the module). Patch by Emanuel Barry.

source: `bpo-27664 <https://bugs.python.org/issue27664>`__: Add to concurrent.futures.thread.ThreadPoolExecutor() the ability to specify a thread name prefix.
fr: `bpo-27664 <https://bugs.python.org/27664>`__: Add to concurrent.futures.thread.ThreadPoolExecutor() the ability to specify a thread name prefix.

source: `bpo-27181 <https://bugs.python.org/issue27181>`__: Add geometric_mean and harmonic_mean to statistics module.
fr: `bpo-27181 <https://bugs.python.org/27181>`__: Add geometric_mean and harmonic_mean to statistics module.

source: `bpo-27573 <https://bugs.python.org/issue27573>`__: code.interact now prints an message when exiting.
fr: `bpo-27573 <https://bugs.python.org/27573>`__: code.interact now prints an message when exiting.

source: `bpo-6422 <https://bugs.python.org/issue6422>`__: Add autorange method to timeit.Timer objects.
fr: `bpo-6422 <https://bugs.python.org/6422>`__: Add autorange method to timeit.Timer objects.

source: `bpo-27773 <https://bugs.python.org/issue27773>`__: Correct some memory management errors server_hostname in _ssl.wrap_socket().
fr: `bpo-27773 <https://bugs.python.org/27773>`__: Correct some memory management errors server_hostname in _ssl.wrap_socket().

source: `bpo-26750 <https://bugs.python.org/issue26750>`__: unittest.mock.create_autospec() now works properly for subclasses of property() and other data descriptors. Removes the never publicly used, never documented unittest.mock.DescriptorTypes tuple.
fr: `bpo-26750 <https://bugs.python.org/26750>`__: unittest.mock.create_autospec() now works properly for subclasses of property() and other data descriptors. Removes the never publicly used, never documented unittest.mock.DescriptorTypes tuple.

source: `bpo-26754 <https://bugs.python.org/issue26754>`__: Undocumented support of general bytes-like objects as path in compile() and similar functions is now deprecated.
fr: `bpo-26754 <https://bugs.python.org/26754>`__: Undocumented support of general bytes-like objects as path in compile() and similar functions is now deprecated.

source: `bpo-26800 <https://bugs.python.org/issue26800>`__: Undocumented support of general bytes-like objects as paths in os functions is now deprecated.
fr: `bpo-26800 <https://bugs.python.org/26800>`__: Undocumented support of general bytes-like objects as paths in os functions is now deprecated.

source: `bpo-26981 <https://bugs.python.org/issue26981>`__: Add _order_ compatibility shim to enum.Enum for Python 2/3 code bases.
fr: `bpo-26981 <https://bugs.python.org/26981>`__: Add _order_ compatibility shim to enum.Enum for Python 2/3 code bases.

source: `bpo-27661 <https://bugs.python.org/issue27661>`__: Added tzinfo keyword argument to datetime.combine.
fr: `bpo-27661 <https://bugs.python.org/27661>`__: Added tzinfo keyword argument to datetime.combine.

source: `bpo-27783 <https://bugs.python.org/issue27783>`__: Fix possible usage of uninitialized memory in operator.methodcaller.
fr: `bpo-27783 <https://bugs.python.org/27783>`__: Fix possible usage of uninitialized memory in operator.methodcaller.

source: `bpo-27774 <https://bugs.python.org/issue27774>`__: Fix possible Py_DECREF on unowned object in _sre.
fr: `bpo-27774 <https://bugs.python.org/27774>`__: Fix possible Py_DECREF on unowned object in _sre.

source: `bpo-27760 <https://bugs.python.org/issue27760>`__: Fix possible integer overflow in binascii.b2a_qp.
fr: `bpo-27760 <https://bugs.python.org/27760>`__: Fix possible integer overflow in binascii.b2a_qp.

source: `bpo-27758 <https://bugs.python.org/issue27758>`__: Fix possible integer overflow in the _csv module for large record lengths.
fr: `bpo-27758 <https://bugs.python.org/27758>`__: Fix possible integer overflow in the _csv module for large record lengths.

source: `bpo-27568 <https://bugs.python.org/issue27568>`__: Prevent HTTPoxy attack (CVE-2016-1000110). Ignore the HTTP_PROXY variable when REQUEST_METHOD environment is set, which indicates that the script is in CGI mode.
fr: `bpo-27568 <https://bugs.python.org/27568>`__: Prevent HTTPoxy attack (CVE-2016-1000110). Ignore the HTTP_PROXY variable when REQUEST_METHOD environment is set, which indicates that the script is in CGI mode.

source: `bpo-7063 <https://bugs.python.org/issue7063>`__: Remove dead code from the "array" module's slice handling. Patch by Chuck.
fr: `bpo-7063 <https://bugs.python.org/7063>`__: Remove dead code from the "array" module's slice handling. Patch by Chuck.

source: `bpo-27656 <https://bugs.python.org/issue27656>`__: Do not assume sched.h defines any SCHED_* constants.
fr: `bpo-27656 <https://bugs.python.org/27656>`__: Do not assume sched.h defines any SCHED_* constants.

source: `bpo-27130 <https://bugs.python.org/issue27130>`__: In the "zlib" module, fix handling of large buffers (typically 4 GiB) when compressing and decompressing. Previously, inputs were limited to 4 GiB, and compression and decompression operations did not properly handle results of 4 GiB.
fr: `bpo-27130 <https://bugs.python.org/27130>`__: In the "zlib" module, fix handling of large buffers (typically 4 GiB) when compressing and decompressing. Previously, inputs were limited to 4 GiB, and compression and decompression operations did not properly handle results of 4 GiB.

source: `bpo-24773 <https://bugs.python.org/issue24773>`__: Implemented PEP 495 (Local Time Disambiguation).
fr: `bpo-24773 <https://bugs.python.org/24773>`__: Implemented PEP 495 (Local Time Disambiguation).

source: `bpo-27567 <https://bugs.python.org/issue27567>`__: Expose the EPOLLRDHUP and POLLRDHUP constants in the select module.
fr: `bpo-27567 <https://bugs.python.org/27567>`__: Expose the EPOLLRDHUP and POLLRDHUP constants in the select module.

source: `bpo-1621 <https://bugs.python.org/issue1621>`__: Avoid signed int negation overflow in the "audioop" module.
fr: `bpo-1621 <https://bugs.python.org/1621>`__: Avoid signed int negation overflow in the "audioop" module.

source: `bpo-27533 <https://bugs.python.org/issue27533>`__: Release GIL in nt._isdir
fr: `bpo-27533 <https://bugs.python.org/27533>`__: Release GIL in nt._isdir

source: `bpo-17711 <https://bugs.python.org/issue17711>`__: Fixed unpickling by the persistent ID with protocol 0. Original patch by Alexandre Vassalotti.
fr: `bpo-17711 <https://bugs.python.org/17711>`__: Fixed unpickling by the persistent ID with protocol 0. Original patch by Alexandre Vassalotti.

source: `bpo-27522 <https://bugs.python.org/issue27522>`__: Avoid an unintentional reference cycle in email.feedparser.
fr: `bpo-27522 <https://bugs.python.org/27522>`__: Avoid an unintentional reference cycle in email.feedparser.

source: `bpo-27512 <https://bugs.python.org/issue27512>`__: Fix a segfault when os.fspath() called an __fspath__() method that raised an exception. Patch by Xiang Zhang.
fr: `bpo-27512 <https://bugs.python.org/27512>`__: Fix a segfault when os.fspath() called an __fspath__() method that raised an exception. Patch by Xiang Zhang.

source: `bpo-27714 <https://bugs.python.org/issue27714>`__: text_textview and test_autocomplete now pass when re-run in the same process. This occurs when test_idle fails when run with the -w option but without -jn. Fix warning from test_config.
fr: `bpo-27714 <https://bugs.python.org/27714>`__: text_textview and test_autocomplete now pass when re-run in the same process. This occurs when test_idle fails when run with the -w option but without -jn. Fix warning from test_config.

source: `bpo-27621 <https://bugs.python.org/issue27621>`__: Put query response validation error messages in the query box itself instead of in a separate massagebox. Redo tests to match. Add Mac OSX refinements. Original patch by Mark Roseman.
fr: `bpo-27621 <https://bugs.python.org/27621>`__: Put query response validation error messages in the query box itself instead of in a separate massagebox. Redo tests to match. Add Mac OSX refinements. Original patch by Mark Roseman.

source: `bpo-27620 <https://bugs.python.org/issue27620>`__: Escape key now closes Query box as cancelled.
fr: `bpo-27620 <https://bugs.python.org/27620>`__: Escape key now closes Query box as cancelled.

source: `bpo-27609 <https://bugs.python.org/issue27609>`__: IDLE: tab after initial whitespace should tab, not autocomplete. This fixes problem with writing docstrings at least twice indented.
fr: `bpo-27609 <https://bugs.python.org/27609>`__: IDLE: tab after initial whitespace should tab, not autocomplete. This fixes problem with writing docstrings at least twice indented.

source: `bpo-27609 <https://bugs.python.org/issue27609>`__: Explicitly return None when there are also non-None returns. In a few cases, reverse a condition and eliminate a return.
fr: `bpo-27609 <https://bugs.python.org/27609>`__: Explicitly return None when there are also non-None returns. In a few cases, reverse a condition and eliminate a return.

source: `bpo-25507 <https://bugs.python.org/issue25507>`__: IDLE no longer runs buggy code because of its tkinter imports. Users must include the same imports required to run directly in Python.
fr: `bpo-25507 <https://bugs.python.org/25507>`__: IDLE no longer runs buggy code because of its tkinter imports. Users must include the same imports required to run directly in Python.

source: `bpo-27173 <https://bugs.python.org/issue27173>`__: Add 'IDLE Modern Unix' to the built-in key sets. Make the default key set depend on the platform. Add tests for the changes to the config module.
fr: `bpo-27173 <https://bugs.python.org/27173>`__: Add 'IDLE Modern Unix' to the built-in key sets. Make the default key set depend on the platform. Add tests for the changes to the config module.

source: `bpo-27452 <https://bugs.python.org/issue27452>`__: add line counter and crc to IDLE configHandler test dump.
fr: `bpo-27452 <https://bugs.python.org/27452>`__: add line counter and crc to IDLE configHandler test dump.

source: `bpo-25805 <https://bugs.python.org/issue25805>`__: Skip a test in test_pkgutil as needed that doesn't work when ``__name__ == __main__``. Patch by SilentGhost.
fr: `bpo-25805 <https://bugs.python.org/25805>`__: Skip a test in test_pkgutil as needed that doesn't work when ``__name__ == __main__``. Patch by SilentGhost.

source: `bpo-27472 <https://bugs.python.org/issue27472>`__: Add test.support.unix_shell as the path to the default shell.
fr: `bpo-27472 <https://bugs.python.org/27472>`__: Add test.support.unix_shell as the path to the default shell.

source: `bpo-27369 <https://bugs.python.org/issue27369>`__: In test_pyexpat, avoid testing an error message detail that changed in Expat 2.2.0.
fr: `bpo-27369 <https://bugs.python.org/27369>`__: In test_pyexpat, avoid testing an error message detail that changed in Expat 2.2.0.

source: `bpo-27594 <https://bugs.python.org/issue27594>`__: Prevent assertion error when running test_ast with coverage enabled: ensure code object has a valid first line number. Patch suggested by Ivan Levkivskyi.
fr: `bpo-27594 <https://bugs.python.org/27594>`__: Prevent assertion error when running test_ast with coverage enabled: ensure code object has a valid first line number. Patch suggested by Ivan Levkivskyi.

source: `bpo-27647 <https://bugs.python.org/issue27647>`__: Update bundled Tcl/Tk to 8.6.6.
fr: `bpo-27647 <https://bugs.python.org/27647>`__: Update bundled Tcl/Tk to 8.6.6.

source: `bpo-27610 <https://bugs.python.org/issue27610>`__: Adds PEP 514 metadata to Windows installer
fr: `bpo-27610 <https://bugs.python.org/27610>`__: Adds PEP 514 metadata to Windows installer

source: `bpo-27469 <https://bugs.python.org/issue27469>`__: Adds a shell extension to the launcher so that drag and drop works correctly.
fr: `bpo-27469 <https://bugs.python.org/27469>`__: Adds a shell extension to the launcher so that drag and drop works correctly.

source: `bpo-27309 <https://bugs.python.org/issue27309>`__: Enables proper Windows styles in python[w].exe manifest.
fr: `bpo-27309 <https://bugs.python.org/27309>`__: Enables proper Windows styles in python[w].exe manifest.

source: `bpo-27713 <https://bugs.python.org/issue27713>`__: Suppress spurious build warnings when updating importlib's bootstrap files. Patch by Xiang Zhang
fr: `bpo-27713 <https://bugs.python.org/27713>`__: Suppress spurious build warnings when updating importlib's bootstrap files. Patch by Xiang Zhang

source: `bpo-25825 <https://bugs.python.org/issue25825>`__: Correct the references to Modules/python.exp, which is required on AIX. The references were accidentally changed in 3.5.0a1.
fr: `bpo-25825 <https://bugs.python.org/25825>`__: Correct the references to Modules/python.exp, which is required on AIX. The references were accidentally changed in 3.5.0a1.

source: `bpo-27453 <https://bugs.python.org/issue27453>`__: CPP invocation in configure must use CPPFLAGS. Patch by Chi Hsuan Yen.
fr: `bpo-27453 <https://bugs.python.org/27453>`__: CPP invocation in configure must use CPPFLAGS. Patch by Chi Hsuan Yen.

source: `bpo-27641 <https://bugs.python.org/issue27641>`__: The configure script now inserts comments into the makefile to prevent the pgen and _freeze_importlib executables from being cross- compiled.
fr: `bpo-27641 <https://bugs.python.org/27641>`__: The configure script now inserts comments into the makefile to prevent the pgen and _freeze_importlib executables from being cross- compiled.

source: `bpo-26662 <https://bugs.python.org/issue26662>`__: Set PYTHON_FOR_GEN in configure as the Python program to be used for file generation during the build.
fr: `bpo-26662 <https://bugs.python.org/26662>`__: Set PYTHON_FOR_GEN in configure as the Python program to be used for file generation during the build.
