Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-26569 <https://bugs.python.org/issue26569>`__: Fix :func:`pyclbr.readmodule` and :func:`pyclbr.readmodule_ex` to support importing packages.
fr: `bpo-26569 <https://bugs.python.org/26569>`__: Fix :func:`pyclbr.readmodule` and :func:`pyclbr.readmodule_ex` to support importing packages.

source: `bpo-26499 <https://bugs.python.org/issue26499>`__: Account for remaining Content-Length in HTTPResponse.readline() and read1(). Based on patch by Silent Ghost. Also document that HTTPResponse now supports these methods.
fr: `bpo-26499 <https://bugs.python.org/26499>`__: Account for remaining Content-Length in HTTPResponse.readline() and read1(). Based on patch by Silent Ghost. Also document that HTTPResponse now supports these methods.

source: `bpo-25320 <https://bugs.python.org/issue25320>`__: Handle sockets in directories unittest discovery is scanning. Patch from Victor van den Elzen.
fr: `bpo-25320 <https://bugs.python.org/25320>`__: Handle sockets in directories unittest discovery is scanning. Patch from Victor van den Elzen.

source: `bpo-16181 <https://bugs.python.org/issue16181>`__: cookiejar.http2time() now returns None if year is higher than datetime.MAXYEAR.
fr: `bpo-16181 <https://bugs.python.org/16181>`__: cookiejar.http2time() now returns None if year is higher than datetime.MAXYEAR.

source: `bpo-26513 <https://bugs.python.org/issue26513>`__: Fixes platform module detection of Windows Server
fr: `bpo-26513 <https://bugs.python.org/26513>`__: Fixes platform module detection of Windows Server

source: `bpo-23718 <https://bugs.python.org/issue23718>`__: Fixed parsing time in week 0 before Jan 1. Original patch by Tamás Bence Gedai.
fr: `bpo-23718 <https://bugs.python.org/23718>`__: Fixed parsing time in week 0 before Jan 1. Original patch by Tamás Bence Gedai.

source: `bpo-26323 <https://bugs.python.org/issue26323>`__: Add Mock.assert_called() and Mock.assert_called_once() methods to unittest.mock. Patch written by Amit Saha.
fr: `bpo-26323 <https://bugs.python.org/26323>`__: Add Mock.assert_called() and Mock.assert_called_once() methods to unittest.mock. Patch written by Amit Saha.

source: `bpo-20589 <https://bugs.python.org/issue20589>`__: Invoking Path.owner() and Path.group() on Windows now raise NotImplementedError instead of ImportError.
fr: `bpo-20589 <https://bugs.python.org/20589>`__: Invoking Path.owner() and Path.group() on Windows now raise NotImplementedError instead of ImportError.

source: `bpo-26177 <https://bugs.python.org/issue26177>`__: Fixed the keys() method for Canvas and Scrollbar widgets.
fr: `bpo-26177 <https://bugs.python.org/26177>`__: Fixed the keys() method for Canvas and Scrollbar widgets.

source: `bpo-15068 <https://bugs.python.org/issue15068>`__: Got rid of excessive buffering in fileinput. The bufsize parameter is now deprecated and ignored.
fr: `bpo-15068 <https://bugs.python.org/15068>`__: Got rid of excessive buffering in fileinput. The bufsize parameter is now deprecated and ignored.

source: `bpo-19475 <https://bugs.python.org/issue19475>`__: Added an optional argument timespec to the datetime isoformat() method to choose the precision of the time component.
fr: `bpo-19475 <https://bugs.python.org/19475>`__: Added an optional argument timespec to the datetime isoformat() method to choose the precision of the time component.

source: `bpo-2202 <https://bugs.python.org/issue2202>`__: Fix UnboundLocalError in AbstractDigestAuthHandler.get_algorithm_impls. Initial patch by Mathieu Dupuy.
fr: `bpo-2202 <https://bugs.python.org/2202>`__: Fix UnboundLocalError in AbstractDigestAuthHandler.get_algorithm_impls. Initial patch by Mathieu Dupuy.

source: `bpo-26167 <https://bugs.python.org/issue26167>`__: Minimized overhead in copy.copy() and copy.deepcopy(). Optimized copying and deepcopying bytearrays, NotImplemented, slices, short lists, tuples, dicts, sets.
fr: `bpo-26167 <https://bugs.python.org/26167>`__: Minimized overhead in copy.copy() and copy.deepcopy(). Optimized copying and deepcopying bytearrays, NotImplemented, slices, short lists, tuples, dicts, sets.

source: `bpo-25718 <https://bugs.python.org/issue25718>`__: Fixed pickling and copying the accumulate() iterator with total is None.
fr: `bpo-25718 <https://bugs.python.org/25718>`__: Fixed pickling and copying the accumulate() iterator with total is None.

source: `bpo-26475 <https://bugs.python.org/issue26475>`__: Fixed debugging output for regular expressions with the (?x) flag.
fr: `bpo-26475 <https://bugs.python.org/26475>`__: Fixed debugging output for regular expressions with the (?x) flag.

source: `bpo-26482 <https://bugs.python.org/issue26482>`__: Allowed pickling recursive dequeues.
fr: `bpo-26482 <https://bugs.python.org/26482>`__: Allowed pickling recursive dequeues.

source: `bpo-26335 <https://bugs.python.org/issue26335>`__: Make mmap.write() return the number of bytes written like other write methods. Patch by Jakub Stasiak.
fr: `bpo-26335 <https://bugs.python.org/26335>`__: Make mmap.write() return the number of bytes written like other write methods. Patch by Jakub Stasiak.

source: `bpo-26457 <https://bugs.python.org/issue26457>`__: Fixed the subnets() methods in IP network classes for the case when resulting prefix length is equal to maximal prefix length. Based on patch by Xiang Zhang.
fr: `bpo-26457 <https://bugs.python.org/26457>`__: Fixed the subnets() methods in IP network classes for the case when resulting prefix length is equal to maximal prefix length. Based on patch by Xiang Zhang.

source: `bpo-26385 <https://bugs.python.org/issue26385>`__: Remove the file if the internal open() call in NamedTemporaryFile() fails. Patch by Silent Ghost.
fr: `bpo-26385 <https://bugs.python.org/26385>`__: Remove the file if the internal open() call in NamedTemporaryFile() fails. Patch by Silent Ghost.

source: `bpo-26402 <https://bugs.python.org/issue26402>`__: Fix XML-RPC client to retry when the server shuts down a persistent connection. This was a regression related to the new http.client.RemoteDisconnected exception in 3.5.0a4.
fr: `bpo-26402 <https://bugs.python.org/26402>`__: Fix XML-RPC client to retry when the server shuts down a persistent connection. This was a regression related to the new http.client.RemoteDisconnected exception in 3.5.0a4.

source: `bpo-25913 <https://bugs.python.org/issue25913>`__: Leading ``<~`` is optional now in base64.a85decode() with adobe=True. Patch by Swati Jaiswal.
fr: `bpo-25913 <https://bugs.python.org/25913>`__: Leading ``<~`` is optional now in base64.a85decode() with adobe=True. Patch by Swati Jaiswal.

source: `bpo-26186 <https://bugs.python.org/issue26186>`__: Remove an invalid type check in importlib.util.LazyLoader.
fr: `bpo-26186 <https://bugs.python.org/26186>`__: Remove an invalid type check in importlib.util.LazyLoader.

source: `bpo-26367 <https://bugs.python.org/issue26367>`__: importlib.__import__() raises ImportError like builtins.__import__() when ``level`` is specified but without an accompanying package specified.
fr: `bpo-26367 <https://bugs.python.org/26367>`__: importlib.__import__() raises ImportError like builtins.__import__() when ``level`` is specified but without an accompanying package specified.

source: `bpo-26309 <https://bugs.python.org/issue26309>`__: In the "socketserver" module, shut down the request (closing the connected socket) when verify_request() returns false. Patch by Aviv Palivoda.
fr: `bpo-26309 <https://bugs.python.org/26309>`__: In the "socketserver" module, shut down the request (closing the connected socket) when verify_request() returns false. Patch by Aviv Palivoda.

source: `bpo-23430 <https://bugs.python.org/issue23430>`__: Change the socketserver module to only catch exceptions raised from a request handler that are derived from Exception (instead of BaseException). Therefore SystemExit and KeyboardInterrupt no longer trigger the handle_error() method, and will now to stop a single-threaded server.
fr: `bpo-23430 <https://bugs.python.org/23430>`__: Change the socketserver module to only catch exceptions raised from a request handler that are derived from Exception (instead of BaseException). Therefore SystemExit and KeyboardInterrupt no longer trigger the handle_error() method, and will now to stop a single-threaded server.

source: `bpo-25995 <https://bugs.python.org/issue25995>`__: os.walk() no longer uses FDs proportional to the tree depth.
fr: `bpo-25995 <https://bugs.python.org/25995>`__: os.walk() no longer uses FDs proportional to the tree depth.

source: `bpo-25994 <https://bugs.python.org/issue25994>`__: Added the close() method and the support of the context manager protocol for the os.scandir() iterator.
fr: `bpo-25994 <https://bugs.python.org/25994>`__: Added the close() method and the support of the context manager protocol for the os.scandir() iterator.

source: `bpo-23992 <https://bugs.python.org/issue23992>`__: multiprocessing: make MapResult not fail-fast upon exception.
fr: `bpo-23992 <https://bugs.python.org/23992>`__: multiprocessing: make MapResult not fail-fast upon exception.

source: `bpo-26243 <https://bugs.python.org/issue26243>`__: Support keyword arguments to zlib.compress(). Patch by Aviv Palivoda.
fr: `bpo-26243 <https://bugs.python.org/26243>`__: Support keyword arguments to zlib.compress(). Patch by Aviv Palivoda.

source: `bpo-26117 <https://bugs.python.org/issue26117>`__: The os.scandir() iterator now closes file descriptor not only when the iteration is finished, but when it was failed with error.
fr: `bpo-26117 <https://bugs.python.org/26117>`__: The os.scandir() iterator now closes file descriptor not only when the iteration is finished, but when it was failed with error.

source: `bpo-25949 <https://bugs.python.org/issue25949>`__: __dict__ for an OrderedDict instance is now created only when needed.
fr: `bpo-25949 <https://bugs.python.org/25949>`__: __dict__ for an OrderedDict instance is now created only when needed.

source: `bpo-25911 <https://bugs.python.org/issue25911>`__: Restored support of bytes paths in os.walk() on Windows.
fr: `bpo-25911 <https://bugs.python.org/25911>`__: Restored support of bytes paths in os.walk() on Windows.

source: `bpo-26045 <https://bugs.python.org/issue26045>`__: Add UTF-8 suggestion to error message when posting a non-Latin-1 string with http.client.
fr: `bpo-26045 <https://bugs.python.org/26045>`__: Add UTF-8 suggestion to error message when posting a non-Latin-1 string with http.client.

source: `bpo-26039 <https://bugs.python.org/issue26039>`__: Added zipfile.ZipInfo.from_file() and zipinfo.ZipInfo.is_dir(). Patch by Thomas Kluyver.
fr: `bpo-26039 <https://bugs.python.org/26039>`__: Added zipfile.ZipInfo.from_file() and zipinfo.ZipInfo.is_dir(). Patch by Thomas Kluyver.

source: `bpo-12923 <https://bugs.python.org/issue12923>`__: Reset FancyURLopener's redirect counter even if there is an exception. Based on patches by Brian Brazil and Daniel Rocco.
fr: `bpo-12923 <https://bugs.python.org/12923>`__: Reset FancyURLopener's redirect counter even if there is an exception. Based on patches by Brian Brazil and Daniel Rocco.

source: `bpo-25945 <https://bugs.python.org/issue25945>`__: Fixed a crash when unpickle the functools.partial object with wrong state. Fixed a leak in failed functools.partial constructor. "args" and "keywords" attributes of functools.partial have now always types tuple and dict correspondingly.
fr: `bpo-25945 <https://bugs.python.org/25945>`__: Fixed a crash when unpickle the functools.partial object with wrong state. Fixed a leak in failed functools.partial constructor. "args" and "keywords" attributes of functools.partial have now always types tuple and dict correspondingly.

source: `bpo-26202 <https://bugs.python.org/issue26202>`__: copy.deepcopy() now correctly copies range() objects with non-atomic attributes.
fr: `bpo-26202 <https://bugs.python.org/26202>`__: copy.deepcopy() now correctly copies range() objects with non-atomic attributes.

source: `bpo-23076 <https://bugs.python.org/issue23076>`__: Path.glob() now raises a ValueError if it's called with an invalid pattern. Patch by Thomas Nyberg.
fr: `bpo-23076 <https://bugs.python.org/23076>`__: Path.glob() now raises a ValueError if it's called with an invalid pattern. Patch by Thomas Nyberg.

source: `bpo-19883 <https://bugs.python.org/issue19883>`__: Fixed possible integer overflows in zipimport.
fr: `bpo-19883 <https://bugs.python.org/19883>`__: Fixed possible integer overflows in zipimport.

source: `bpo-26227 <https://bugs.python.org/issue26227>`__: On Windows, getnameinfo(), gethostbyaddr() and gethostbyname_ex() functions of the socket module now decode the hostname from the ANSI code page rather than UTF-8.
fr: `bpo-26227 <https://bugs.python.org/26227>`__: On Windows, getnameinfo(), gethostbyaddr() and gethostbyname_ex() functions of the socket module now decode the hostname from the ANSI code page rather than UTF-8.

source: `bpo-26099 <https://bugs.python.org/issue26099>`__: The site module now writes an error into stderr if sitecustomize module can be imported but executing the module raise an ImportError. Same change for usercustomize.
fr: `bpo-26099 <https://bugs.python.org/26099>`__: The site module now writes an error into stderr if sitecustomize module can be imported but executing the module raise an ImportError. Same change for usercustomize.

source: `bpo-26147 <https://bugs.python.org/issue26147>`__: xmlrpc now works with strings not encodable with used non-UTF-8 encoding.
fr: `bpo-26147 <https://bugs.python.org/26147>`__: xmlrpc now works with strings not encodable with used non-UTF-8 encoding.

source: `bpo-25935 <https://bugs.python.org/issue25935>`__: Garbage collector now breaks reference loops with OrderedDict.
fr: `bpo-25935 <https://bugs.python.org/25935>`__: Garbage collector now breaks reference loops with OrderedDict.

source: `bpo-16620 <https://bugs.python.org/issue16620>`__: Fixed AttributeError in msilib.Directory.glob().
fr: `bpo-16620 <https://bugs.python.org/16620>`__: Fixed AttributeError in msilib.Directory.glob().

source: `bpo-26013 <https://bugs.python.org/issue26013>`__: Added compatibility with broken protocol 2 pickles created in old Python 3 versions (3.4.3 and lower).
fr: `bpo-26013 <https://bugs.python.org/26013>`__: Added compatibility with broken protocol 2 pickles created in old Python 3 versions (3.4.3 and lower).

source: `bpo-26129 <https://bugs.python.org/issue26129>`__: Deprecated accepting non-integers in grp.getgrgid().
fr: `bpo-26129 <https://bugs.python.org/26129>`__: Deprecated accepting non-integers in grp.getgrgid().

source: `bpo-25850 <https://bugs.python.org/issue25850>`__: Use cross-compilation by default for 64-bit Windows.
fr: `bpo-25850 <https://bugs.python.org/25850>`__: Use cross-compilation by default for 64-bit Windows.

source: `bpo-25822 <https://bugs.python.org/issue25822>`__: Add docstrings to the fields of urllib.parse results. Patch contributed by Swati Jaiswal.
fr: `bpo-25822 <https://bugs.python.org/25822>`__: Add docstrings to the fields of urllib.parse results. Patch contributed by Swati Jaiswal.

source: `bpo-22642 <https://bugs.python.org/issue22642>`__: Convert trace module option parsing mechanism to argparse. Patch contributed by SilentGhost.
fr: `bpo-22642 <https://bugs.python.org/22642>`__: Convert trace module option parsing mechanism to argparse. Patch contributed by SilentGhost.

source: `bpo-24705 <https://bugs.python.org/issue24705>`__: Fix sysconfig._parse_makefile not expanding ${} vars appearing before $() vars.
fr: `bpo-24705 <https://bugs.python.org/24705>`__: Fix sysconfig._parse_makefile not expanding ${} vars appearing before $() vars.

source: `bpo-26069 <https://bugs.python.org/issue26069>`__: Remove the deprecated apis in the trace module.
fr: `bpo-26069 <https://bugs.python.org/26069>`__: Remove the deprecated apis in the trace module.

source: `bpo-22138 <https://bugs.python.org/issue22138>`__: Fix mock.patch behavior when patching descriptors. Restore original values after patching. Patch contributed by Sean McCully.
fr: `bpo-22138 <https://bugs.python.org/22138>`__: Fix mock.patch behavior when patching descriptors. Restore original values after patching. Patch contributed by Sean McCully.

source: `bpo-25672 <https://bugs.python.org/issue25672>`__: In the ssl module, enable the SSL_MODE_RELEASE_BUFFERS mode option if it is safe to do so.
fr: `bpo-25672 <https://bugs.python.org/25672>`__: In the ssl module, enable the SSL_MODE_RELEASE_BUFFERS mode option if it is safe to do so.

source: `bpo-26012 <https://bugs.python.org/issue26012>`__: Don't traverse into symlinks for ** pattern in pathlib.Path.[r]glob().
fr: `bpo-26012 <https://bugs.python.org/26012>`__: Don't traverse into symlinks for ** pattern in pathlib.Path.[r]glob().

source: `bpo-24120 <https://bugs.python.org/issue24120>`__: Ignore PermissionError when traversing a tree with pathlib.Path.[r]glob(). Patch by Ulrich Petri.
fr: `bpo-24120 <https://bugs.python.org/24120>`__: Ignore PermissionError when traversing a tree with pathlib.Path.[r]glob(). Patch by Ulrich Petri.

source: `bpo-21815 <https://bugs.python.org/issue21815>`__: Accept ] characters in the data portion of imap responses, in order to handle the flags with square brackets accepted and produced by servers such as gmail.
fr: `bpo-21815 <https://bugs.python.org/21815>`__: Accept ] characters in the data portion of imap responses, in order to handle the flags with square brackets accepted and produced by servers such as gmail.

source: `bpo-25447 <https://bugs.python.org/issue25447>`__: fileinput now uses sys.stdin as-is if it does not have a buffer attribute (restores backward compatibility).
fr: `bpo-25447 <https://bugs.python.org/25447>`__: fileinput now uses sys.stdin as-is if it does not have a buffer attribute (restores backward compatibility).

source: `bpo-25971 <https://bugs.python.org/issue25971>`__: Optimized creating Fractions from floats by 2 times and from Decimals by 3 times.
fr: `bpo-25971 <https://bugs.python.org/25971>`__: Optimized creating Fractions from floats by 2 times and from Decimals by 3 times.

source: `bpo-25802 <https://bugs.python.org/issue25802>`__: Document as deprecated the remaining implementations of importlib.abc.Loader.load_module().
fr: `bpo-25802 <https://bugs.python.org/25802>`__: Document as deprecated the remaining implementations of importlib.abc.Loader.load_module().

source: `bpo-25928 <https://bugs.python.org/issue25928>`__: Add Decimal.as_integer_ratio().
fr: `bpo-25928 <https://bugs.python.org/25928>`__: Add Decimal.as_integer_ratio().

source: `bpo-25447 <https://bugs.python.org/issue25447>`__: Copying the lru_cache() wrapper object now always works, independently from the type of the wrapped object (by returning the original object unchanged).
fr: `bpo-25447 <https://bugs.python.org/25447>`__: Copying the lru_cache() wrapper object now always works, independently from the type of the wrapped object (by returning the original object unchanged).

source: `bpo-25768 <https://bugs.python.org/issue25768>`__: Have the functions in compileall return booleans instead of ints and add proper documentation and tests for the return values.
fr: `bpo-25768 <https://bugs.python.org/25768>`__: Have the functions in compileall return booleans instead of ints and add proper documentation and tests for the return values.

source: `bpo-24103 <https://bugs.python.org/issue24103>`__: Fixed possible use after free in ElementTree.XMLPullParser.
fr: `bpo-24103 <https://bugs.python.org/24103>`__: Fixed possible use after free in ElementTree.XMLPullParser.

source: `bpo-25860 <https://bugs.python.org/issue25860>`__: os.fwalk() no longer skips remaining directories when error occurs. Original patch by Samson Lee.
fr: `bpo-25860 <https://bugs.python.org/25860>`__: os.fwalk() no longer skips remaining directories when error occurs. Original patch by Samson Lee.

source: `bpo-25914 <https://bugs.python.org/issue25914>`__: Fixed and simplified OrderedDict.__sizeof__.
fr: `bpo-25914 <https://bugs.python.org/25914>`__: Fixed and simplified OrderedDict.__sizeof__.

source: `bpo-25869 <https://bugs.python.org/issue25869>`__: Optimized deepcopying ElementTree; it is now 20 times faster.
fr: `bpo-25869 <https://bugs.python.org/25869>`__: Optimized deepcopying ElementTree; it is now 20 times faster.

source: `bpo-25873 <https://bugs.python.org/issue25873>`__: Optimized iterating ElementTree. Iterating elements Element.iter() is now 40% faster, iterating text Element.itertext() is now up to 2.5 times faster.
fr: `bpo-25873 <https://bugs.python.org/25873>`__: Optimized iterating ElementTree. Iterating elements Element.iter() is now 40% faster, iterating text Element.itertext() is now up to 2.5 times faster.

source: `bpo-25902 <https://bugs.python.org/issue25902>`__: Fixed various refcount issues in ElementTree iteration.
fr: `bpo-25902 <https://bugs.python.org/25902>`__: Fixed various refcount issues in ElementTree iteration.

source: `bpo-22227 <https://bugs.python.org/issue22227>`__: The TarFile iterator is reimplemented using generator. This implementation is simpler that using class.
fr: `bpo-22227 <https://bugs.python.org/22227>`__: The TarFile iterator is reimplemented using generator. This implementation is simpler that using class.

source: `bpo-25638 <https://bugs.python.org/issue25638>`__: Optimized ElementTree.iterparse(); it is now 2x faster. Optimized ElementTree parsing; it is now 10% faster.
fr: `bpo-25638 <https://bugs.python.org/25638>`__: Optimized ElementTree.iterparse(); it is now 2x faster. Optimized ElementTree parsing; it is now 10% faster.

source: `bpo-25761 <https://bugs.python.org/issue25761>`__: Improved detecting errors in broken pickle data.
fr: `bpo-25761 <https://bugs.python.org/25761>`__: Improved detecting errors in broken pickle data.

source: `bpo-25717 <https://bugs.python.org/issue25717>`__: Restore the previous behaviour of tolerating most fstat() errors when opening files. This was a regression in 3.5a1, and stopped anonymous temporary files from working in special cases.
fr: `bpo-25717 <https://bugs.python.org/25717>`__: Restore the previous behaviour of tolerating most fstat() errors when opening files. This was a regression in 3.5a1, and stopped anonymous temporary files from working in special cases.

source: `bpo-24903 <https://bugs.python.org/issue24903>`__: Fix regression in number of arguments compileall accepts when '-d' is specified. The check on the number of arguments has been dropped completely as it never worked correctly anyway.
fr: `bpo-24903 <https://bugs.python.org/24903>`__: Fix regression in number of arguments compileall accepts when '-d' is specified. The check on the number of arguments has been dropped completely as it never worked correctly anyway.

source: `bpo-25764 <https://bugs.python.org/issue25764>`__: In the subprocess module, preserve any exception caused by fork() failure when preexec_fn is used.
fr: `bpo-25764 <https://bugs.python.org/25764>`__: In the subprocess module, preserve any exception caused by fork() failure when preexec_fn is used.

source: `bpo-25771 <https://bugs.python.org/issue25771>`__: Tweak the exception message for importlib.util.resolve_name() when 'package' isn't specified but necessary.
fr: `bpo-25771 <https://bugs.python.org/25771>`__: Tweak the exception message for importlib.util.resolve_name() when 'package' isn't specified but necessary.

source: `bpo-6478 <https://bugs.python.org/issue6478>`__: _strptime's regexp cache now is reset after changing timezone with time.tzset().
fr: `bpo-6478 <https://bugs.python.org/6478>`__: _strptime's regexp cache now is reset after changing timezone with time.tzset().
