Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-25339 <https://bugs.python.org/issue25339>`__: PYTHONIOENCODING now has priority over locale in setting the error handler for stdin and stdout.
fr: `bpo-25339 <https://bugs.python.org/25339>`__: PYTHONIOENCODING now has priority over locale in setting the error handler for stdin and stdout.

source: `bpo-26494 <https://bugs.python.org/issue26494>`__: Fixed crash on iterating exhausting iterators. Affected classes are generic sequence iterators, iterators of str, bytes, bytearray, list, tuple, set, frozenset, dict, OrderedDict, corresponding views and os.scandir() iterator.
fr: `bpo-26494 <https://bugs.python.org/26494>`__: Fixed crash on iterating exhausting iterators. Affected classes are generic sequence iterators, iterators of str, bytes, bytearray, list, tuple, set, frozenset, dict, OrderedDict, corresponding views and os.scandir() iterator.

source: `bpo-26574 <https://bugs.python.org/issue26574>`__: Optimize ``bytes.replace(b'', b'.')`` and ``bytearray.replace(b'', b'.')``. Patch written by Josh Snider.
fr: `bpo-26574 <https://bugs.python.org/26574>`__: Optimize ``bytes.replace(b'', b'.')`` and ``bytearray.replace(b'', b'.')``. Patch written by Josh Snider.

source: `bpo-26581 <https://bugs.python.org/issue26581>`__: If coding cookie is specified multiple times on a line in Python source code file, only the first one is taken to account.
fr: `bpo-26581 <https://bugs.python.org/26581>`__: If coding cookie is specified multiple times on a line in Python source code file, only the first one is taken to account.

source: `bpo-19711 <https://bugs.python.org/issue19711>`__: Add tests for reloading namespace packages.
fr: `bpo-19711 <https://bugs.python.org/19711>`__: Add tests for reloading namespace packages.

source: `bpo-21099 <https://bugs.python.org/issue21099>`__: Switch applicable importlib tests to use PEP 451 API.
fr: `bpo-21099 <https://bugs.python.org/21099>`__: Switch applicable importlib tests to use PEP 451 API.

source: `bpo-26563 <https://bugs.python.org/issue26563>`__: Debug hooks on Python memory allocators now raise a fatal error if functions of the :c:func:`PyMem_Malloc` family are called without holding the GIL.
fr: `bpo-26563 <https://bugs.python.org/26563>`__: Debug hooks on Python memory allocators now raise a fatal error if functions of the :c:func:`PyMem_Malloc` family are called without holding the GIL.

source: `bpo-26564 <https://bugs.python.org/issue26564>`__: On error, the debug hooks on Python memory allocators now use the :mod:`tracemalloc` module to get the traceback where a memory block was allocated.
fr: `bpo-26564 <https://bugs.python.org/26564>`__: On error, the debug hooks on Python memory allocators now use the :mod:`tracemalloc` module to get the traceback where a memory block was allocated.

source: `bpo-26558 <https://bugs.python.org/issue26558>`__: The debug hooks on Python memory allocator :c:func:`PyObject_Malloc` now detect when functions are called without holding the GIL.
fr: `bpo-26558 <https://bugs.python.org/26558>`__: The debug hooks on Python memory allocator :c:func:`PyObject_Malloc` now detect when functions are called without holding the GIL.

source: `bpo-26516 <https://bugs.python.org/issue26516>`__: Add :envvar:`PYTHONMALLOC` environment variable to set the Python memory allocators and/or install debug hooks.
fr: `bpo-26516 <https://bugs.python.org/26516>`__: Add :envvar:`PYTHONMALLOC` environment variable to set the Python memory allocators and/or install debug hooks.

source: `bpo-26516 <https://bugs.python.org/issue26516>`__: The :c:func:`PyMem_SetupDebugHooks` function can now also be used on Python compiled in release mode.
fr: `bpo-26516 <https://bugs.python.org/26516>`__: The :c:func:`PyMem_SetupDebugHooks` function can now also be used on Python compiled in release mode.

source: `bpo-26516 <https://bugs.python.org/issue26516>`__: The :envvar:`PYTHONMALLOCSTATS` environment variable can now also be used on Python compiled in release mode. It now has no effect if set to an empty string.
fr: `bpo-26516 <https://bugs.python.org/26516>`__: The :envvar:`PYTHONMALLOCSTATS` environment variable can now also be used on Python compiled in release mode. It now has no effect if set to an empty string.

source: `bpo-26516 <https://bugs.python.org/issue26516>`__: In debug mode, debug hooks are now also installed on Python memory allocators when Python is configured without pymalloc.
fr: `bpo-26516 <https://bugs.python.org/26516>`__: In debug mode, debug hooks are now also installed on Python memory allocators when Python is configured without pymalloc.

source: `bpo-26464 <https://bugs.python.org/issue26464>`__: Fix str.translate() when string is ASCII and first replacements removes character, but next replacement uses a non-ASCII character or a string longer than 1 character. Regression introduced in Python 3.5.0.
fr: `bpo-26464 <https://bugs.python.org/26464>`__: Fix str.translate() when string is ASCII and first replacements removes character, but next replacement uses a non-ASCII character or a string longer than 1 character. Regression introduced in Python 3.5.0.

source: `bpo-22836 <https://bugs.python.org/issue22836>`__: Ensure exception reports from PyErr_Display() and PyErr_WriteUnraisable() are sensible even when formatting them produces secondary errors. This affects the reports produced by sys.__excepthook__() and when __del__() raises an exception.
fr: `bpo-22836 <https://bugs.python.org/22836>`__: Ensure exception reports from PyErr_Display() and PyErr_WriteUnraisable() are sensible even when formatting them produces secondary errors. This affects the reports produced by sys.__excepthook__() and when __del__() raises an exception.

source: `bpo-26302 <https://bugs.python.org/issue26302>`__: Correct behavior to reject comma as a legal character for cookie names.
fr: `bpo-26302 <https://bugs.python.org/26302>`__: Correct behavior to reject comma as a legal character for cookie names.

source: `bpo-26136 <https://bugs.python.org/issue26136>`__: Upgrade the warning when a generator raises StopIteration from PendingDeprecationWarning to DeprecationWarning. Patch by Anish Shah.
fr: `bpo-26136 <https://bugs.python.org/26136>`__: Upgrade the warning when a generator raises StopIteration from PendingDeprecationWarning to DeprecationWarning. Patch by Anish Shah.

source: `bpo-26204 <https://bugs.python.org/issue26204>`__: The compiler now ignores all constant statements: bytes, str, int, float, complex, name constants (None, False, True), Ellipsis and ast.Constant; not only str and int. For example, ``1.0`` is now ignored in ``def f(): 1.0``.
fr: `bpo-26204 <https://bugs.python.org/26204>`__: The compiler now ignores all constant statements: bytes, str, int, float, complex, name constants (None, False, True), Ellipsis and ast.Constant; not only str and int. For example, ``1.0`` is now ignored in ``def f(): 1.0``.

source: `bpo-4806 <https://bugs.python.org/issue4806>`__: Avoid masking the original TypeError exception when using star (*) unpacking in function calls. Based on patch by Hagen Fürstenau and Daniel Urban.
fr: `bpo-4806 <https://bugs.python.org/4806>`__: Avoid masking the original TypeError exception when using star (*) unpacking in function calls. Based on patch by Hagen Fürstenau and Daniel Urban.

source: `bpo-26146 <https://bugs.python.org/issue26146>`__: Add a new kind of AST node: ``ast.Constant``. It can be used by external AST optimizers, but the compiler does not emit directly such node.
fr: `bpo-26146 <https://bugs.python.org/26146>`__: Add a new kind of AST node: ``ast.Constant``. It can be used by external AST optimizers, but the compiler does not emit directly such node.

source: `bpo-23601 <https://bugs.python.org/issue23601>`__: Sped-up allocation of dict key objects by using Python's small object allocator. (Contributed by Julian Taylor.)
fr: `bpo-23601 <https://bugs.python.org/23601>`__: Sped-up allocation of dict key objects by using Python's small object allocator. (Contributed by Julian Taylor.)

source: `bpo-18018 <https://bugs.python.org/issue18018>`__: Import raises ImportError instead of SystemError if a relative import is attempted without a known parent package.
fr: `bpo-18018 <https://bugs.python.org/18018>`__: Import raises ImportError instead of SystemError if a relative import is attempted without a known parent package.

source: `bpo-25843 <https://bugs.python.org/issue25843>`__: When compiling code, don't merge constants if they are equal but have a different types. For example, ``f1, f2 = lambda: 1, lambda: 1.0`` is now correctly compiled to two different functions: ``f1()`` returns ``1`` (``int``) and ``f2()`` returns ``1.0`` (``float``), even if ``1`` and ``1.0`` are equal.
fr: `bpo-25843 <https://bugs.python.org/25843>`__: When compiling code, don't merge constants if they are equal but have a different types. For example, ``f1, f2 = lambda: 1, lambda: 1.0`` is now correctly compiled to two different functions: ``f1()`` returns ``1`` (``int``) and ``f2()`` returns ``1.0`` (``float``), even if ``1`` and ``1.0`` are equal.

source: `bpo-26107 <https://bugs.python.org/issue26107>`__: The format of the ``co_lnotab`` attribute of code objects changes to support negative line number delta.
fr: `bpo-26107 <https://bugs.python.org/26107>`__: The format of the ``co_lnotab`` attribute of code objects changes to support negative line number delta.

source: `bpo-26154 <https://bugs.python.org/issue26154>`__: Add a new private _PyThreadState_UncheckedGet() function to get the current Python thread state, but don't issue a fatal error if it is NULL. This new function must be used instead of accessing directly the _PyThreadState_Current variable. The variable is no more exposed since Python 3.5.1 to hide the exact implementation of atomic C types, to avoid compiler issues.
fr: `bpo-26154 <https://bugs.python.org/26154>`__: Add a new private _PyThreadState_UncheckedGet() function to get the current Python thread state, but don't issue a fatal error if it is NULL. This new function must be used instead of accessing directly the _PyThreadState_Current variable. The variable is no more exposed since Python 3.5.1 to hide the exact implementation of atomic C types, to avoid compiler issues.

source: `bpo-25791 <https://bugs.python.org/issue25791>`__: If __package__ != __spec__.parent or if neither __package__ or __spec__ are defined then ImportWarning is raised.
fr: `bpo-25791 <https://bugs.python.org/25791>`__: If __package__ != __spec__.parent or if neither __package__ or __spec__ are defined then ImportWarning is raised.

source: `bpo-22995 <https://bugs.python.org/issue22995>`__: [UPDATE] Comment out the one of the pickleability tests in _PyObject_GetState() due to regressions observed in Cython-based projects.
fr: `bpo-22995 <https://bugs.python.org/22995>`__: [UPDATE] Comment out the one of the pickleability tests in _PyObject_GetState() due to regressions observed in Cython-based projects.

source: `bpo-25961 <https://bugs.python.org/issue25961>`__: Disallowed null characters in the type name.
fr: `bpo-25961 <https://bugs.python.org/25961>`__: Disallowed null characters in the type name.

source: `bpo-25973 <https://bugs.python.org/issue25973>`__: Fix segfault when an invalid nonlocal statement binds a name starting with two underscores.
fr: `bpo-25973 <https://bugs.python.org/25973>`__: Fix segfault when an invalid nonlocal statement binds a name starting with two underscores.

source: `bpo-22995 <https://bugs.python.org/issue22995>`__: Instances of extension types with a state that aren't subclasses of list or dict and haven't implemented any pickle-related methods (__reduce__, __reduce_ex__, __getnewargs__, __getnewargs_ex__, or __getstate__), can no longer be pickled. Including memoryview.
fr: `bpo-22995 <https://bugs.python.org/22995>`__: Instances of extension types with a state that aren't subclasses of list or dict and haven't implemented any pickle-related methods (__reduce__, __reduce_ex__, __getnewargs__, __getnewargs_ex__, or __getstate__), can no longer be pickled. Including memoryview.

source: `bpo-20440 <https://bugs.python.org/issue20440>`__: Massive replacing unsafe attribute setting code with special macro Py_SETREF.
fr: `bpo-20440 <https://bugs.python.org/20440>`__: Massive replacing unsafe attribute setting code with special macro Py_SETREF.

source: `bpo-25766 <https://bugs.python.org/issue25766>`__: Special method __bytes__() now works in str subclasses.
fr: `bpo-25766 <https://bugs.python.org/25766>`__: Special method __bytes__() now works in str subclasses.

source: `bpo-25421 <https://bugs.python.org/issue25421>`__: __sizeof__ methods of builtin types now use dynamic basic size. This allows sys.getsize() to work correctly with their subclasses with __slots__ defined.
fr: `bpo-25421 <https://bugs.python.org/25421>`__: __sizeof__ methods of builtin types now use dynamic basic size. This allows sys.getsize() to work correctly with their subclasses with __slots__ defined.

source: `bpo-25709 <https://bugs.python.org/issue25709>`__: Fixed problem with in-place string concatenation and utf-8 cache.
fr: `bpo-25709 <https://bugs.python.org/25709>`__: Fixed problem with in-place string concatenation and utf-8 cache.

source: `bpo-5319 <https://bugs.python.org/issue5319>`__: New Py_FinalizeEx() API allowing Python to set an exit status of 120 on failure to flush buffered streams.
fr: `bpo-5319 <https://bugs.python.org/5319>`__: New Py_FinalizeEx() API allowing Python to set an exit status of 120 on failure to flush buffered streams.

source: `bpo-25485 <https://bugs.python.org/issue25485>`__: telnetlib.Telnet is now a context manager.
fr: `bpo-25485 <https://bugs.python.org/25485>`__: telnetlib.Telnet is now a context manager.

source: `bpo-24097 <https://bugs.python.org/issue24097>`__: Fixed crash in object.__reduce__() if slot name is freed inside __getattr__.
fr: `bpo-24097 <https://bugs.python.org/24097>`__: Fixed crash in object.__reduce__() if slot name is freed inside __getattr__.

source: `bpo-24731 <https://bugs.python.org/issue24731>`__: Fixed crash on converting objects with special methods __bytes__, __trunc__, and __float__ returning instances of subclasses of bytes, int, and float to subclasses of bytes, int, and float correspondingly.
fr: `bpo-24731 <https://bugs.python.org/24731>`__: Fixed crash on converting objects with special methods __bytes__, __trunc__, and __float__ returning instances of subclasses of bytes, int, and float to subclasses of bytes, int, and float correspondingly.

source: `bpo-25630 <https://bugs.python.org/issue25630>`__: Fix a possible segfault during argument parsing in functions that accept filesystem paths.
fr: `bpo-25630 <https://bugs.python.org/25630>`__: Fix a possible segfault during argument parsing in functions that accept filesystem paths.

source: `bpo-23564 <https://bugs.python.org/issue23564>`__: Fixed a partially broken sanity check in the _posixsubprocess internals regarding how fds_to_pass were passed to the child. The bug had no actual impact as subprocess.py already avoided it.
fr: `bpo-23564 <https://bugs.python.org/23564>`__: Fixed a partially broken sanity check in the _posixsubprocess internals regarding how fds_to_pass were passed to the child. The bug had no actual impact as subprocess.py already avoided it.

source: `bpo-25388 <https://bugs.python.org/issue25388>`__: Fixed tokenizer crash when processing undecodable source code with a null byte.
fr: `bpo-25388 <https://bugs.python.org/25388>`__: Fixed tokenizer crash when processing undecodable source code with a null byte.

source: `bpo-25462 <https://bugs.python.org/issue25462>`__: The hash of the key now is calculated only once in most operations in C implementation of OrderedDict.
fr: `bpo-25462 <https://bugs.python.org/25462>`__: The hash of the key now is calculated only once in most operations in C implementation of OrderedDict.

source: `bpo-22995 <https://bugs.python.org/issue22995>`__: Default implementation of __reduce__ and __reduce_ex__ now rejects builtin types with not defined __new__.
fr: `bpo-22995 <https://bugs.python.org/22995>`__: Default implementation of __reduce__ and __reduce_ex__ now rejects builtin types with not defined __new__.

source: `bpo-24802 <https://bugs.python.org/issue24802>`__: Avoid buffer overreads when int(), float(), compile(), exec() and eval() are passed bytes-like objects. These objects are not necessarily terminated by a null byte, but the functions assumed they were.
fr: `bpo-24802 <https://bugs.python.org/24802>`__: Avoid buffer overreads when int(), float(), compile(), exec() and eval() are passed bytes-like objects. These objects are not necessarily terminated by a null byte, but the functions assumed they were.

source: `bpo-25555 <https://bugs.python.org/issue25555>`__: Fix parser and AST: fill lineno and col_offset of "arg" node when compiling AST from Python objects.
fr: `bpo-25555 <https://bugs.python.org/25555>`__: Fix parser and AST: fill lineno and col_offset of "arg" node when compiling AST from Python objects.

source: `bpo-24726 <https://bugs.python.org/issue24726>`__: Fixed a crash and leaking NULL in repr() of OrderedDict that was mutated by direct calls of dict methods.
fr: `bpo-24726 <https://bugs.python.org/24726>`__: Fixed a crash and leaking NULL in repr() of OrderedDict that was mutated by direct calls of dict methods.

source: `bpo-25449 <https://bugs.python.org/issue25449>`__: Iterating OrderedDict with keys with unstable hash now raises KeyError in C implementations as well as in Python implementation.
fr: `bpo-25449 <https://bugs.python.org/25449>`__: Iterating OrderedDict with keys with unstable hash now raises KeyError in C implementations as well as in Python implementation.

source: `bpo-25395 <https://bugs.python.org/issue25395>`__: Fixed crash when highly nested OrderedDict structures were garbage collected.
fr: `bpo-25395 <https://bugs.python.org/25395>`__: Fixed crash when highly nested OrderedDict structures were garbage collected.

source: `bpo-25401 <https://bugs.python.org/issue25401>`__: Optimize bytes.fromhex() and bytearray.fromhex(): they are now between 2x and 3.5x faster.
fr: `bpo-25401 <https://bugs.python.org/25401>`__: Optimize bytes.fromhex() and bytearray.fromhex(): they are now between 2x and 3.5x faster.

source: `bpo-25399 <https://bugs.python.org/issue25399>`__: Optimize bytearray % args using the new private _PyBytesWriter API. Formatting is now between 2.5 and 5 times faster.
fr: `bpo-25399 <https://bugs.python.org/25399>`__: Optimize bytearray % args using the new private _PyBytesWriter API. Formatting is now between 2.5 and 5 times faster.

source: `bpo-25274 <https://bugs.python.org/issue25274>`__: sys.setrecursionlimit() now raises a RecursionError if the new recursion limit is too low depending at the current recursion depth. Modify also the "lower-water mark" formula to make it monotonic. This mark is used to decide when the overflowed flag of the thread state is reset.
fr: `bpo-25274 <https://bugs.python.org/25274>`__: sys.setrecursionlimit() now raises a RecursionError if the new recursion limit is too low depending at the current recursion depth. Modify also the "lower-water mark" formula to make it monotonic. This mark is used to decide when the overflowed flag of the thread state is reset.

source: `bpo-24402 <https://bugs.python.org/issue24402>`__: Fix input() to prompt to the redirected stdout when sys.stdout.fileno() fails.
fr: `bpo-24402 <https://bugs.python.org/24402>`__: Fix input() to prompt to the redirected stdout when sys.stdout.fileno() fails.

source: `bpo-25349 <https://bugs.python.org/issue25349>`__: Optimize bytes % args using the new private _PyBytesWriter API. Formatting is now up to 2 times faster.
fr: `bpo-25349 <https://bugs.python.org/25349>`__: Optimize bytes % args using the new private _PyBytesWriter API. Formatting is now up to 2 times faster.

source: `bpo-24806 <https://bugs.python.org/issue24806>`__: Prevent builtin types that are not allowed to be subclassed from being subclassed through multiple inheritance.
fr: `bpo-24806 <https://bugs.python.org/24806>`__: Prevent builtin types that are not allowed to be subclassed from being subclassed through multiple inheritance.

source: `bpo-25301 <https://bugs.python.org/issue25301>`__: The UTF-8 decoder is now up to 15 times as fast for error handlers: ``ignore``, ``replace`` and ``surrogateescape``.
fr: `bpo-25301 <https://bugs.python.org/25301>`__: The UTF-8 decoder is now up to 15 times as fast for error handlers: ``ignore``, ``replace`` and ``surrogateescape``.

source: `bpo-24848 <https://bugs.python.org/issue24848>`__: Fixed a number of bugs in UTF-7 decoding of misformed data.
fr: `bpo-24848 <https://bugs.python.org/24848>`__: Fixed a number of bugs in UTF-7 decoding of misformed data.

source: `bpo-25267 <https://bugs.python.org/issue25267>`__: The UTF-8 encoder is now up to 75 times as fast for error handlers: ``ignore``, ``replace``, ``surrogateescape``, ``surrogatepass``. Patch co-written with Serhiy Storchaka.
fr: `bpo-25267 <https://bugs.python.org/25267>`__: The UTF-8 encoder is now up to 75 times as fast for error handlers: ``ignore``, ``replace``, ``surrogateescape``, ``surrogatepass``. Patch co-written with Serhiy Storchaka.

source: `bpo-25280 <https://bugs.python.org/issue25280>`__: Import trace messages emitted in verbose (-v) mode are no longer formatted twice.
fr: `bpo-25280 <https://bugs.python.org/25280>`__: Import trace messages emitted in verbose (-v) mode are no longer formatted twice.

source: `bpo-25227 <https://bugs.python.org/issue25227>`__: Optimize ASCII and latin1 encoders with the ``surrogateescape`` error handler: the encoders are now up to 3 times as fast. Initial patch written by Serhiy Storchaka.
fr: `bpo-25227 <https://bugs.python.org/25227>`__: Optimize ASCII and latin1 encoders with the ``surrogateescape`` error handler: the encoders are now up to 3 times as fast. Initial patch written by Serhiy Storchaka.

source: `bpo-25003 <https://bugs.python.org/issue25003>`__: On Solaris 11.3 or newer, os.urandom() now uses the getrandom() function instead of the getentropy() function. The getentropy() function is blocking to generate very good quality entropy, os.urandom() doesn't need such high-quality entropy.
fr: `bpo-25003 <https://bugs.python.org/25003>`__: On Solaris 11.3 or newer, os.urandom() now uses the getrandom() function instead of the getentropy() function. The getentropy() function is blocking to generate very good quality entropy, os.urandom() doesn't need such high-quality entropy.

source: `bpo-9232 <https://bugs.python.org/issue9232>`__: Modify Python's grammar to allow trailing commas in the argument list of a function declaration. For example, "def f(\*, a = 3,): pass" is now legal. Patch from Mark Dickinson.
fr: `bpo-9232 <https://bugs.python.org/9232>`__: Modify Python's grammar to allow trailing commas in the argument list of a function declaration. For example, "def f(\*, a = 3,): pass" is now legal. Patch from Mark Dickinson.

source: `bpo-24965 <https://bugs.python.org/issue24965>`__: Implement PEP 498 "Literal String Interpolation". This allows you to embed expressions inside f-strings, which are converted to normal strings at run time. Given x=3, then f'value={x}' == 'value=3'. Patch by Eric V. Smith.
fr: `bpo-24965 <https://bugs.python.org/24965>`__: Implement PEP 498 "Literal String Interpolation". This allows you to embed expressions inside f-strings, which are converted to normal strings at run time. Given x=3, then f'value={x}' == 'value=3'. Patch by Eric V. Smith.
