Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-27186 <https://bugs.python.org/issue27186>`__: Add os.PathLike support to DirEntry (part of PEP 519). Initial patch by Jelle Zijlstra.
fr: `bpo-27186 <https://bugs.python.org/27186>`__: Add os.PathLike support to DirEntry (part of PEP 519). Initial patch by Jelle Zijlstra.

source: `bpo-20900 <https://bugs.python.org/issue20900>`__: distutils register command now decodes HTTP responses correctly. Initial patch by ingrid.
fr: `bpo-20900 <https://bugs.python.org/20900>`__: distutils register command now decodes HTTP responses correctly. Initial patch by ingrid.

source: `bpo-27186 <https://bugs.python.org/issue27186>`__: Add os.PathLike support to pathlib, removing its provisional status (part of PEP 519). Initial patch by Dusty Phillips.
fr: `bpo-27186 <https://bugs.python.org/27186>`__: Add os.PathLike support to pathlib, removing its provisional status (part of PEP 519). Initial patch by Dusty Phillips.

source: `bpo-27186 <https://bugs.python.org/issue27186>`__: Add support for os.PathLike objects to os.fsencode() and os.fsdecode() (part of PEP 519).
fr: `bpo-27186 <https://bugs.python.org/27186>`__: Add support for os.PathLike objects to os.fsencode() and os.fsdecode() (part of PEP 519).

source: `bpo-27186 <https://bugs.python.org/issue27186>`__: Introduce os.PathLike and os.fspath() (part of PEP 519).
fr: `bpo-27186 <https://bugs.python.org/27186>`__: Introduce os.PathLike and os.fspath() (part of PEP 519).

source: `bpo-25738 <https://bugs.python.org/issue25738>`__: Stop http.server.BaseHTTPRequestHandler.send_error() from sending a message body for 205 Reset Content. Also, don't send Content header fields in responses that don't have a body. Patch by Susumu Koshiba.
fr: `bpo-25738 <https://bugs.python.org/25738>`__: Stop http.server.BaseHTTPRequestHandler.send_error() from sending a message body for 205 Reset Content. Also, don't send Content header fields in responses that don't have a body. Patch by Susumu Koshiba.

source: `bpo-21313 <https://bugs.python.org/issue21313>`__: Fix the "platform" module to tolerate when sys.version contains truncated build information.
fr: `bpo-21313 <https://bugs.python.org/21313>`__: Fix the "platform" module to tolerate when sys.version contains truncated build information.

source: `bpo-23883 <https://bugs.python.org/issue23883>`__: Added missing APIs to __all__ to match the documented APIs for the following modules: cgi, mailbox, mimetypes, plistlib and smtpd. Patches by Jacek Kołodziej.
fr: `bpo-23883 <https://bugs.python.org/23883>`__: Added missing APIs to __all__ to match the documented APIs for the following modules: cgi, mailbox, mimetypes, plistlib and smtpd. Patches by Jacek Kołodziej.

source: `bpo-27164 <https://bugs.python.org/issue27164>`__: In the zlib module, allow decompressing raw Deflate streams with a predefined zdict. Based on patch by Xiang Zhang.
fr: `bpo-27164 <https://bugs.python.org/27164>`__: In the zlib module, allow decompressing raw Deflate streams with a predefined zdict. Based on patch by Xiang Zhang.

source: `bpo-24291 <https://bugs.python.org/issue24291>`__: Fix wsgiref.simple_server.WSGIRequestHandler to completely write data to the client. Previously it could do partial writes and truncate data. Also, wsgiref.handler.ServerHandler can now handle stdout doing partial writes, but this is deprecated.
fr: `bpo-24291 <https://bugs.python.org/24291>`__: Fix wsgiref.simple_server.WSGIRequestHandler to completely write data to the client. Previously it could do partial writes and truncate data. Also, wsgiref.handler.ServerHandler can now handle stdout doing partial writes, but this is deprecated.

source: `bpo-21272 <https://bugs.python.org/issue21272>`__: Use _sysconfigdata.py to initialize distutils.sysconfig.
fr: `bpo-21272 <https://bugs.python.org/21272>`__: Use _sysconfigdata.py to initialize distutils.sysconfig.

source: `bpo-19611 <https://bugs.python.org/issue19611>`__: :mod:`inspect` now reports the implicit ``.0`` parameters generated by the compiler for comprehension and generator expression scopes as if they were positional-only parameters called ``implicit0``. Patch by Jelle Zijlstra.
fr: `bpo-19611 <https://bugs.python.org/19611>`__: :mod:`inspect` now reports the implicit ``.0`` parameters generated by the compiler for comprehension and generator expression scopes as if they were positional-only parameters called ``implicit0``. Patch by Jelle Zijlstra.

source: `bpo-26809 <https://bugs.python.org/issue26809>`__: Add ``__all__`` to :mod:`string`. Patch by Emanuel Barry.
fr: `bpo-26809 <https://bugs.python.org/26809>`__: Add ``__all__`` to :mod:`string`. Patch by Emanuel Barry.

source: `bpo-26373 <https://bugs.python.org/issue26373>`__: subprocess.Popen.communicate now correctly ignores BrokenPipeError when the child process dies before .communicate() is called in more/all circumstances.
fr: `bpo-26373 <https://bugs.python.org/26373>`__: subprocess.Popen.communicate now correctly ignores BrokenPipeError when the child process dies before .communicate() is called in more/all circumstances.

source: `bpo-27167 <https://bugs.python.org/issue27167>`__: Clarify the subprocess.CalledProcessError error message text when the child process died due to a signal.
fr: `bpo-27167 <https://bugs.python.org/27167>`__: Clarify the subprocess.CalledProcessError error message text when the child process died due to a signal.

source: `bpo-25931 <https://bugs.python.org/issue25931>`__: Don't define socketserver.Forking* names on platforms such as Windows that do not support os.fork().
fr: `bpo-25931 <https://bugs.python.org/25931>`__: Don't define socketserver.Forking* names on platforms such as Windows that do not support os.fork().

source: `bpo-21776 <https://bugs.python.org/issue21776>`__: distutils.upload now correctly handles HTTPError. Initial patch by Claudiu Popa.
fr: `bpo-21776 <https://bugs.python.org/21776>`__: distutils.upload now correctly handles HTTPError. Initial patch by Claudiu Popa.

source: `bpo-26526 <https://bugs.python.org/issue26526>`__: Replace custom parse tree validation in the parser module with a simple DFA validator.
fr: `bpo-26526 <https://bugs.python.org/26526>`__: Replace custom parse tree validation in the parser module with a simple DFA validator.

source: `bpo-27114 <https://bugs.python.org/issue27114>`__: Fix SSLContext._load_windows_store_certs fails with PermissionError
fr: `bpo-27114 <https://bugs.python.org/27114>`__: Fix SSLContext._load_windows_store_certs fails with PermissionError

source: `bpo-18383 <https://bugs.python.org/issue18383>`__: Avoid creating duplicate filters when using filterwarnings and simplefilter. Based on patch by Alex Shkop.
fr: `bpo-18383 <https://bugs.python.org/18383>`__: Avoid creating duplicate filters when using filterwarnings and simplefilter. Based on patch by Alex Shkop.

source: `bpo-23026 <https://bugs.python.org/issue23026>`__: winreg.QueryValueEx() now return an integer for REG_QWORD type.
fr: `bpo-23026 <https://bugs.python.org/23026>`__: winreg.QueryValueEx() now return an integer for REG_QWORD type.

source: `bpo-26741 <https://bugs.python.org/issue26741>`__: subprocess.Popen destructor now emits a ResourceWarning warning if the child process is still running.
fr: `bpo-26741 <https://bugs.python.org/26741>`__: subprocess.Popen destructor now emits a ResourceWarning warning if the child process is still running.

source: `bpo-27056 <https://bugs.python.org/issue27056>`__: Optimize pickle.load() and pickle.loads(), up to 10% faster to deserialize a lot of small objects.
fr: `bpo-27056 <https://bugs.python.org/27056>`__: Optimize pickle.load() and pickle.loads(), up to 10% faster to deserialize a lot of small objects.

source: `bpo-21271 <https://bugs.python.org/issue21271>`__: New keyword only parameters in reset_mock call.
fr: `bpo-21271 <https://bugs.python.org/21271>`__: New keyword only parameters in reset_mock call.

source: `bpo-5124 <https://bugs.python.org/issue5124>`__: Paste with text selected now replaces the selection on X11. This matches how paste works on Windows, Mac, most modern Linux apps, and ttk widgets. Original patch by Serhiy Storchaka.
fr: `bpo-5124 <https://bugs.python.org/5124>`__: Paste with text selected now replaces the selection on X11. This matches how paste works on Windows, Mac, most modern Linux apps, and ttk widgets. Original patch by Serhiy Storchaka.

source: `bpo-24750 <https://bugs.python.org/issue24750>`__: Switch all scrollbars in IDLE to ttk versions. Where needed, minimal tests are added to cover changes.
fr: `bpo-24750 <https://bugs.python.org/24750>`__: Switch all scrollbars in IDLE to ttk versions. Where needed, minimal tests are added to cover changes.

source: `bpo-24759 <https://bugs.python.org/issue24759>`__: IDLE requires tk 8.5 and availability ttk widgets. Delete now unneeded tk version tests and code for older versions. Add test for IDLE syntax colorizoer.
fr: `bpo-24759 <https://bugs.python.org/24759>`__: IDLE requires tk 8.5 and availability ttk widgets. Delete now unneeded tk version tests and code for older versions. Add test for IDLE syntax colorizoer.

source: `bpo-27239 <https://bugs.python.org/issue27239>`__: idlelib.macosx.isXyzTk functions initialize as needed.
fr: `bpo-27239 <https://bugs.python.org/27239>`__: idlelib.macosx.isXyzTk functions initialize as needed.

source: `bpo-27262 <https://bugs.python.org/issue27262>`__: move Aqua unbinding code, which enable context menus, to maxosx.
fr: `bpo-27262 <https://bugs.python.org/27262>`__: move Aqua unbinding code, which enable context menus, to maxosx.

source: `bpo-24759 <https://bugs.python.org/issue24759>`__: Make clear in idlelib.idle_test.__init__ that the directory is a private implementation of test.test_idle and tool for maintainers.
fr: `bpo-24759 <https://bugs.python.org/24759>`__: Make clear in idlelib.idle_test.__init__ that the directory is a private implementation of test.test_idle and tool for maintainers.

source: `bpo-27196 <https://bugs.python.org/issue27196>`__: Stop 'ThemeChanged' warnings when running IDLE tests. These persisted after other warnings were suppressed in #20567. Apply Serhiy Storchaka's update_idletasks solution to four test files. Record this additional advice in idle_test/README.txt
fr: `bpo-27196 <https://bugs.python.org/27196>`__: Stop 'ThemeChanged' warnings when running IDLE tests. These persisted after other warnings were suppressed in #20567. Apply Serhiy Storchaka's update_idletasks solution to four test files. Record this additional advice in idle_test/README.txt

source: `bpo-20567 <https://bugs.python.org/issue20567>`__: Revise idle_test/README.txt with advice about avoiding tk warning messages from tests. Apply advice to several IDLE tests.
fr: `bpo-20567 <https://bugs.python.org/20567>`__: Revise idle_test/README.txt with advice about avoiding tk warning messages from tests. Apply advice to several IDLE tests.

source: `bpo-24225 <https://bugs.python.org/issue24225>`__: Update idlelib/README.txt with new file names and event handlers.
fr: `bpo-24225 <https://bugs.python.org/24225>`__: Update idlelib/README.txt with new file names and event handlers.

source: `bpo-27156 <https://bugs.python.org/issue27156>`__: Remove obsolete code not used by IDLE. Replacements: 1. help.txt, replaced by help.html, is out-of-date and should not be used. Its dedicated viewer has be replaced by the html viewer in help.py. 2. ``import idlever; I = idlever.IDLE_VERSION`` is the same as ``import sys; I = version[:version.index(' ')]`` 3. After ``ob = stackviewer.VariablesTreeItem(*args)``, ``ob.keys() == list(ob.object.keys)``. 4. In macosc, runningAsOSXAPP == isAquaTk; idCarbonAquaTk == isCarbonTk
fr: `bpo-27156 <https://bugs.python.org/27156>`__: Remove obsolete code not used by IDLE. Replacements: 1. help.txt, replaced by help.html, is out-of-date and should not be used. Its dedicated viewer has be replaced by the html viewer in help.py. 2. ``import idlever; I = idlever.IDLE_VERSION`` is the same as ``import sys; I = version[:version.index(' ')]`` 3. After ``ob = stackviewer.VariablesTreeItem(*args)``, ``ob.keys() == list(ob.object.keys)``. 4. In macosc, runningAsOSXAPP == isAquaTk; idCarbonAquaTk == isCarbonTk

source: `bpo-27117 <https://bugs.python.org/issue27117>`__: Make colorizer htest and turtledemo work with dark themes. Move code for configuring text widget colors to a new function.
fr: `bpo-27117 <https://bugs.python.org/27117>`__: Make colorizer htest and turtledemo work with dark themes. Move code for configuring text widget colors to a new function.

source: `bpo-24225 <https://bugs.python.org/issue24225>`__: Rename many `idlelib/*.py` and `idle_test/test_*.py` files. Edit files to replace old names with new names when the old name referred to the module rather than the class it contained. See the issue and IDLE section in What's New in 3.6 for more.
fr: `bpo-24225 <https://bugs.python.org/24225>`__: Rename many `idlelib/*.py` and `idle_test/test_*.py` files. Edit files to replace old names with new names when the old name referred to the module rather than the class it contained. See the issue and IDLE section in What's New in 3.6 for more.

source: `bpo-26673 <https://bugs.python.org/issue26673>`__: When tk reports font size as 0, change to size 10. Such fonts on Linux prevented the configuration dialog from opening.
fr: `bpo-26673 <https://bugs.python.org/26673>`__: When tk reports font size as 0, change to size 10. Such fonts on Linux prevented the configuration dialog from opening.

source: `bpo-21939 <https://bugs.python.org/issue21939>`__: Add test for IDLE's percolator. Original patch by Saimadhav Heblikar.
fr: `bpo-21939 <https://bugs.python.org/21939>`__: Add test for IDLE's percolator. Original patch by Saimadhav Heblikar.

source: `bpo-21676 <https://bugs.python.org/issue21676>`__: Add test for IDLE's replace dialog. Original patch by Saimadhav Heblikar.
fr: `bpo-21676 <https://bugs.python.org/21676>`__: Add test for IDLE's replace dialog. Original patch by Saimadhav Heblikar.

source: `bpo-18410 <https://bugs.python.org/issue18410>`__: Add test for IDLE's search dialog. Original patch by Westley Martínez.
fr: `bpo-18410 <https://bugs.python.org/18410>`__: Add test for IDLE's search dialog. Original patch by Westley Martínez.

source: `bpo-21703 <https://bugs.python.org/issue21703>`__: Add test for undo delegator. Patch mostly by Saimadhav Heblikar .
fr: `bpo-21703 <https://bugs.python.org/21703>`__: Add test for undo delegator. Patch mostly by Saimadhav Heblikar .

source: `bpo-27044 <https://bugs.python.org/issue27044>`__: Add ConfigDialog.remove_var_callbacks to stop memory leaks.
fr: `bpo-27044 <https://bugs.python.org/27044>`__: Add ConfigDialog.remove_var_callbacks to stop memory leaks.

source: `bpo-23977 <https://bugs.python.org/issue23977>`__: Add more asserts to test_delegator.
fr: `bpo-23977 <https://bugs.python.org/23977>`__: Add more asserts to test_delegator.

source: `bpo-16484 <https://bugs.python.org/issue16484>`__: Change the default PYTHONDOCS URL to "https:", and fix the resulting links to use lowercase. Patch by Sean Rodman, test by Kaushik Nadikuditi.
fr: `bpo-16484 <https://bugs.python.org/16484>`__: Change the default PYTHONDOCS URL to "https:", and fix the resulting links to use lowercase. Patch by Sean Rodman, test by Kaushik Nadikuditi.

source: `bpo-24136 <https://bugs.python.org/issue24136>`__: Document the new PEP 448 unpacking syntax of 3.5.
fr: `bpo-24136 <https://bugs.python.org/24136>`__: Document the new PEP 448 unpacking syntax of 3.5.

source: `bpo-22558 <https://bugs.python.org/issue22558>`__: Add remaining doc links to source code for Python-coded modules. Patch by Yoni Lavi.
fr: `bpo-22558 <https://bugs.python.org/22558>`__: Add remaining doc links to source code for Python-coded modules. Patch by Yoni Lavi.

source: `bpo-25285 <https://bugs.python.org/issue25285>`__: regrtest now uses subprocesses when the -j1 command line option is used: each test file runs in a fresh child process. Before, the -j1 option was ignored.
fr: `bpo-25285 <https://bugs.python.org/25285>`__: regrtest now uses subprocesses when the -j1 command line option is used: each test file runs in a fresh child process. Before, the -j1 option was ignored.

source: `bpo-25285 <https://bugs.python.org/issue25285>`__: Tools/buildbot/test.bat script now uses -j1 by default to run each test file in fresh child process.
fr: `bpo-25285 <https://bugs.python.org/25285>`__: Tools/buildbot/test.bat script now uses -j1 by default to run each test file in fresh child process.

source: `bpo-27064 <https://bugs.python.org/issue27064>`__: The py.exe launcher now defaults to Python 3. The Windows launcher ``py.exe`` no longer prefers an installed Python 2 version over Python 3 by default when used interactively.
fr: `bpo-27064 <https://bugs.python.org/27064>`__: The py.exe launcher now defaults to Python 3. The Windows launcher ``py.exe`` no longer prefers an installed Python 2 version over Python 3 by default when used interactively.

source: `bpo-27229 <https://bugs.python.org/issue27229>`__: Fix the cross-compiling pgen rule for in-tree builds. Patch by Xavier de Gaye.
fr: `bpo-27229 <https://bugs.python.org/27229>`__: Fix the cross-compiling pgen rule for in-tree builds. Patch by Xavier de Gaye.

source: `bpo-26930 <https://bugs.python.org/issue26930>`__: Update OS X 10.5+ 32-bit-only installer to build and link with OpenSSL 1.0.2h.
fr: `bpo-26930 <https://bugs.python.org/26930>`__: Update OS X 10.5+ 32-bit-only installer to build and link with OpenSSL 1.0.2h.

source: `bpo-17500 <https://bugs.python.org/issue17500>`__, and https://github.com/python/pythondotorg/issues/945: Remove unused and outdated icons.
fr: `bpo-17500 <https://bugs.python.org/17500>`__, and https://github.com/python/pythondotorg/issues/945: Remove unused and outdated icons.

source: `bpo-27186 <https://bugs.python.org/issue27186>`__: Add the PyOS_FSPath() function (part of PEP 519).
fr: `bpo-27186 <https://bugs.python.org/27186>`__: Add the PyOS_FSPath() function (part of PEP 519).

source: `bpo-26282 <https://bugs.python.org/issue26282>`__: PyArg_ParseTupleAndKeywords() now supports positional-only parameters.
fr: `bpo-26282 <https://bugs.python.org/26282>`__: PyArg_ParseTupleAndKeywords() now supports positional-only parameters.

source: `bpo-26282 <https://bugs.python.org/issue26282>`__: Argument Clinic now supports positional-only and keyword parameters in the same function.
fr: `bpo-26282 <https://bugs.python.org/26282>`__: Argument Clinic now supports positional-only and keyword parameters in the same function.

source: `bpo-20041 <https://bugs.python.org/issue20041>`__: Fixed TypeError when frame.f_trace is set to None. Patch by Xavier de Gaye.
fr: `bpo-20041 <https://bugs.python.org/20041>`__: Fixed TypeError when frame.f_trace is set to None. Patch by Xavier de Gaye.

source: `bpo-26168 <https://bugs.python.org/issue26168>`__: Fixed possible refleaks in failing Py_BuildValue() with the "N" format unit.
fr: `bpo-26168 <https://bugs.python.org/26168>`__: Fixed possible refleaks in failing Py_BuildValue() with the "N" format unit.

source: `bpo-26991 <https://bugs.python.org/issue26991>`__: Fix possible refleak when creating a function with annotations.
fr: `bpo-26991 <https://bugs.python.org/26991>`__: Fix possible refleak when creating a function with annotations.

source: `bpo-27039 <https://bugs.python.org/issue27039>`__: Fixed bytearray.remove() for values greater than 127. Based on patch by Joe Jevnik.
fr: `bpo-27039 <https://bugs.python.org/27039>`__: Fixed bytearray.remove() for values greater than 127. Based on patch by Joe Jevnik.

source: `bpo-23640 <https://bugs.python.org/issue23640>`__: int.from_bytes() no longer bypasses constructors for subclasses.
fr: `bpo-23640 <https://bugs.python.org/23640>`__: int.from_bytes() no longer bypasses constructors for subclasses.

source: `bpo-27005 <https://bugs.python.org/issue27005>`__: Optimized the float.fromhex() class method for exact float. It is now 2 times faster.
fr: `bpo-27005 <https://bugs.python.org/27005>`__: Optimized the float.fromhex() class method for exact float. It is now 2 times faster.

source: `bpo-18531 <https://bugs.python.org/issue18531>`__: Single var-keyword argument of dict subtype was passed unscathed to the C-defined function. Now it is converted to exact dict.
fr: `bpo-18531 <https://bugs.python.org/18531>`__: Single var-keyword argument of dict subtype was passed unscathed to the C-defined function. Now it is converted to exact dict.

source: `bpo-26811 <https://bugs.python.org/issue26811>`__: gc.get_objects() no longer contains a broken tuple with NULL pointer.
fr: `bpo-26811 <https://bugs.python.org/26811>`__: gc.get_objects() no longer contains a broken tuple with NULL pointer.

source: `bpo-20120 <https://bugs.python.org/issue20120>`__: Use RawConfigParser for .pypirc parsing, removing support for interpolation unintentionally added with move to Python 3. Behavior no longer does any interpolation in .pypirc files, matching behavior in Python 2.7 and Setuptools 19.0.
fr: `bpo-20120 <https://bugs.python.org/20120>`__: Use RawConfigParser for .pypirc parsing, removing support for interpolation unintentionally added with move to Python 3. Behavior no longer does any interpolation in .pypirc files, matching behavior in Python 2.7 and Setuptools 19.0.

source: `bpo-26249 <https://bugs.python.org/issue26249>`__: Memory functions of the :c:func:`PyMem_Malloc` domain (:c:data:`PYMEM_DOMAIN_MEM`) now use the :ref:`pymalloc allocator <pymalloc>` rather than system :c:func:`malloc`. Applications calling :c:func:`PyMem_Malloc` without holding the GIL can now crash: use ``PYTHONMALLOC=debug`` environment variable to validate the usage of memory allocators in your application.
fr: `bpo-26249 <https://bugs.python.org/26249>`__: Memory functions of the :c:func:`PyMem_Malloc` domain (:c:data:`PYMEM_DOMAIN_MEM`) now use the :ref:`pymalloc allocator <pymalloc>` rather than system :c:func:`malloc`. Applications calling :c:func:`PyMem_Malloc` without holding the GIL can now crash: use ``PYTHONMALLOC=debug`` environment variable to validate the usage of memory allocators in your application.

source: `bpo-26802 <https://bugs.python.org/issue26802>`__: Optimize function calls only using unpacking like ``func(*tuple)`` (no other positional argument, no keyword): avoid copying the tuple. Patch written by Joe Jevnik.
fr: `bpo-26802 <https://bugs.python.org/26802>`__: Optimize function calls only using unpacking like ``func(*tuple)`` (no other positional argument, no keyword): avoid copying the tuple. Patch written by Joe Jevnik.

source: `bpo-26659 <https://bugs.python.org/issue26659>`__: Make the builtin slice type support cycle collection.
fr: `bpo-26659 <https://bugs.python.org/26659>`__: Make the builtin slice type support cycle collection.

source: `bpo-26718 <https://bugs.python.org/issue26718>`__: super.__init__ no longer leaks memory if called multiple times. NOTE: A direct call of super.__init__ is not endorsed!
fr: `bpo-26718 <https://bugs.python.org/26718>`__: super.__init__ no longer leaks memory if called multiple times. NOTE: A direct call of super.__init__ is not endorsed!

source: `bpo-27138 <https://bugs.python.org/issue27138>`__: Fix the doc comment for FileFinder.find_spec().
fr: `bpo-27138 <https://bugs.python.org/27138>`__: Fix the doc comment for FileFinder.find_spec().

source: `bpo-27147 <https://bugs.python.org/issue27147>`__: Mention PEP 420 in the importlib docs.
fr: `bpo-27147 <https://bugs.python.org/27147>`__: Mention PEP 420 in the importlib docs.
