Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-25569 <https://bugs.python.org/issue25569>`__: Fix memory leak in SSLSocket.getpeercert().
fr: `bpo-25569 <https://bugs.python.org/25569>`__: Fix memory leak in SSLSocket.getpeercert().

source: `bpo-25471 <https://bugs.python.org/issue25471>`__: Sockets returned from accept() shouldn't appear to be nonblocking.
fr: `bpo-25471 <https://bugs.python.org/25471>`__: Sockets returned from accept() shouldn't appear to be nonblocking.

source: `bpo-25319 <https://bugs.python.org/issue25319>`__: When threading.Event is reinitialized, the underlying condition should use a regular lock rather than a recursive lock.
fr: `bpo-25319 <https://bugs.python.org/25319>`__: When threading.Event is reinitialized, the underlying condition should use a regular lock rather than a recursive lock.

source: `bpo-26050 <https://bugs.python.org/issue26050>`__: Add asyncio.StreamReader.readuntil() method. Patch by Марк Коренберг.
fr: `bpo-26050 <https://bugs.python.org/26050>`__: Add asyncio.StreamReader.readuntil() method. Patch by Марк Коренберг.

source: `bpo-25924 <https://bugs.python.org/issue25924>`__: Avoid unnecessary serialization of getaddrinfo(3) calls on OS X versions 10.5 or higher. Original patch by A. Jesse Jiryu Davis.
fr: `bpo-25924 <https://bugs.python.org/25924>`__: Avoid unnecessary serialization of getaddrinfo(3) calls on OS X versions 10.5 or higher. Original patch by A. Jesse Jiryu Davis.

source: `bpo-26406 <https://bugs.python.org/issue26406>`__: Avoid unnecessary serialization of getaddrinfo(3) calls on current versions of OpenBSD and NetBSD. Patch by A. Jesse Jiryu Davis.
fr: `bpo-26406 <https://bugs.python.org/26406>`__: Avoid unnecessary serialization of getaddrinfo(3) calls on current versions of OpenBSD and NetBSD. Patch by A. Jesse Jiryu Davis.

source: `bpo-26848 <https://bugs.python.org/issue26848>`__: Fix asyncio/subprocess.communicate() to handle empty input. Patch by Jack O'Connor.
fr: `bpo-26848 <https://bugs.python.org/26848>`__: Fix asyncio/subprocess.communicate() to handle empty input. Patch by Jack O'Connor.

source: `bpo-27040 <https://bugs.python.org/issue27040>`__: Add loop.get_exception_handler method
fr: `bpo-27040 <https://bugs.python.org/27040>`__: Add loop.get_exception_handler method

source: `bpo-27041 <https://bugs.python.org/issue27041>`__: asyncio: Add loop.create_future method
fr: `bpo-27041 <https://bugs.python.org/27041>`__: asyncio: Add loop.create_future method

source: `bpo-20640 <https://bugs.python.org/issue20640>`__: Add tests for idlelib.configHelpSourceEdit. Patch by Saimadhav Heblikar.
fr: `bpo-20640 <https://bugs.python.org/20640>`__: Add tests for idlelib.configHelpSourceEdit. Patch by Saimadhav Heblikar.

source: `bpo-25507 <https://bugs.python.org/issue25507>`__: fix incorrect change in IOBinding that prevented printing. Augment IOBinding htest to include all major IOBinding functions.
fr: `bpo-25507 <https://bugs.python.org/25507>`__: fix incorrect change in IOBinding that prevented printing. Augment IOBinding htest to include all major IOBinding functions.

source: `bpo-25905 <https://bugs.python.org/issue25905>`__: Revert unwanted conversion of ' to ’ RIGHT SINGLE QUOTATION MARK in README.txt and open this and NEWS.txt with 'ascii'. Re-encode CREDITS.txt to utf-8 and open it with 'utf-8'.
fr: `bpo-25905 <https://bugs.python.org/25905>`__: Revert unwanted conversion of ' to ’ RIGHT SINGLE QUOTATION MARK in README.txt and open this and NEWS.txt with 'ascii'. Re-encode CREDITS.txt to utf-8 and open it with 'utf-8'.

source: `bpo-15348 <https://bugs.python.org/issue15348>`__: Stop the debugger engine (normally in a user process) before closing the debugger window (running in the IDLE process). This prevents the RuntimeErrors that were being caught and ignored.
fr: `bpo-15348 <https://bugs.python.org/15348>`__: Stop the debugger engine (normally in a user process) before closing the debugger window (running in the IDLE process). This prevents the RuntimeErrors that were being caught and ignored.

source: `bpo-24455 <https://bugs.python.org/issue24455>`__: Prevent IDLE from hanging when a) closing the shell while the debugger is active (15347); b) closing the debugger with the [X] button (15348); and c) activating the debugger when already active (24455). The patch by Mark Roseman does this by making two changes. 1. Suspend and resume the gui.interaction method with the tcl vwait mechanism intended for this purpose (instead of root.mainloop & .quit). 2. In gui.run, allow any existing interaction to terminate first.
fr: `bpo-24455 <https://bugs.python.org/24455>`__: Prevent IDLE from hanging when a) closing the shell while the debugger is active (15347); b) closing the debugger with the [X] button (15348); and c) activating the debugger when already active (24455). The patch by Mark Roseman does this by making two changes. 1. Suspend and resume the gui.interaction method with the tcl vwait mechanism intended for this purpose (instead of root.mainloop & .quit). 2. In gui.run, allow any existing interaction to terminate first.

source: `bpo-24750 <https://bugs.python.org/issue24750>`__: Improve the appearance of the IDLE editor window status bar. Patch by Mark Roseman.
fr: `bpo-24750 <https://bugs.python.org/24750>`__: Improve the appearance of the IDLE editor window status bar. Patch by Mark Roseman.

source: `bpo-25313 <https://bugs.python.org/issue25313>`__: Change the handling of new built-in text color themes to better address the compatibility problem introduced by the addition of IDLE Dark. Consistently use the revised idleConf.CurrentTheme everywhere in idlelib.
fr: `bpo-25313 <https://bugs.python.org/25313>`__: Change the handling of new built-in text color themes to better address the compatibility problem introduced by the addition of IDLE Dark. Consistently use the revised idleConf.CurrentTheme everywhere in idlelib.

source: `bpo-24782 <https://bugs.python.org/issue24782>`__: Extension configuration is now a tab in the IDLE Preferences dialog rather than a separate dialog. The former tabs are now a sorted list. Patch by Mark Roseman.
fr: `bpo-24782 <https://bugs.python.org/24782>`__: Extension configuration is now a tab in the IDLE Preferences dialog rather than a separate dialog. The former tabs are now a sorted list. Patch by Mark Roseman.

source: `bpo-22726 <https://bugs.python.org/issue22726>`__: Re-activate the config dialog help button with some content about the other buttons and the new IDLE Dark theme.
fr: `bpo-22726 <https://bugs.python.org/22726>`__: Re-activate the config dialog help button with some content about the other buttons and the new IDLE Dark theme.

source: `bpo-24820 <https://bugs.python.org/issue24820>`__: IDLE now has an 'IDLE Dark' built-in text color theme. It is more or less IDLE Classic inverted, with a cobalt blue background. Strings, comments, keywords, ... are still green, red, orange, ... . To use it with IDLEs released before November 2015, hit the 'Save as New Custom Theme' button and enter a new name, such as 'Custom Dark'. The custom theme will work with any IDLE release, and can be modified.
fr: `bpo-24820 <https://bugs.python.org/24820>`__: IDLE now has an 'IDLE Dark' built-in text color theme. It is more or less IDLE Classic inverted, with a cobalt blue background. Strings, comments, keywords, ... are still green, red, orange, ... . To use it with IDLEs released before November 2015, hit the 'Save as New Custom Theme' button and enter a new name, such as 'Custom Dark'. The custom theme will work with any IDLE release, and can be modified.

source: `bpo-25224 <https://bugs.python.org/issue25224>`__: README.txt is now an idlelib index for IDLE developers and curious users. The previous user content is now in the IDLE doc chapter. 'IDLE' now means 'Integrated Development and Learning Environment'.
fr: `bpo-25224 <https://bugs.python.org/25224>`__: README.txt is now an idlelib index for IDLE developers and curious users. The previous user content is now in the IDLE doc chapter. 'IDLE' now means 'Integrated Development and Learning Environment'.

source: `bpo-24820 <https://bugs.python.org/issue24820>`__: Users can now set breakpoint colors in Settings -> Custom Highlighting. Original patch by Mark Roseman.
fr: `bpo-24820 <https://bugs.python.org/24820>`__: Users can now set breakpoint colors in Settings -> Custom Highlighting. Original patch by Mark Roseman.

source: `bpo-24972 <https://bugs.python.org/issue24972>`__: Inactive selection background now matches active selection background, as configured by users, on all systems. Found items are now always highlighted on Windows. Initial patch by Mark Roseman.
fr: `bpo-24972 <https://bugs.python.org/24972>`__: Inactive selection background now matches active selection background, as configured by users, on all systems. Found items are now always highlighted on Windows. Initial patch by Mark Roseman.

source: `bpo-24570 <https://bugs.python.org/issue24570>`__: Idle: make calltip and completion boxes appear on Macs affected by a tk regression. Initial patch by Mark Roseman.
fr: `bpo-24570 <https://bugs.python.org/24570>`__: Idle: make calltip and completion boxes appear on Macs affected by a tk regression. Initial patch by Mark Roseman.

source: `bpo-24988 <https://bugs.python.org/issue24988>`__: Idle ScrolledList context menus (used in debugger) now work on Mac Aqua. Patch by Mark Roseman.
fr: `bpo-24988 <https://bugs.python.org/24988>`__: Idle ScrolledList context menus (used in debugger) now work on Mac Aqua. Patch by Mark Roseman.

source: `bpo-24801 <https://bugs.python.org/issue24801>`__: Make right-click for context menu work on Mac Aqua. Patch by Mark Roseman.
fr: `bpo-24801 <https://bugs.python.org/24801>`__: Make right-click for context menu work on Mac Aqua. Patch by Mark Roseman.

source: `bpo-25173 <https://bugs.python.org/issue25173>`__: Associate tkinter messageboxes with a specific widget. For Mac OSX, make them a 'sheet'. Patch by Mark Roseman.
fr: `bpo-25173 <https://bugs.python.org/25173>`__: Associate tkinter messageboxes with a specific widget. For Mac OSX, make them a 'sheet'. Patch by Mark Roseman.

source: `bpo-25198 <https://bugs.python.org/issue25198>`__: Enhance the initial html viewer now used for Idle Help. * Properly indent fixed-pitch text (patch by Mark Roseman). * Give code snippet a very Sphinx-like light blueish-gray background. * Re-use initial width and height set by users for shell and editor. * When the Table of Contents (TOC) menu is used, put the section header at the top of the screen.
fr: `bpo-25198 <https://bugs.python.org/25198>`__: Enhance the initial html viewer now used for Idle Help. * Properly indent fixed-pitch text (patch by Mark Roseman). * Give code snippet a very Sphinx-like light blueish-gray background. * Re-use initial width and height set by users for shell and editor. * When the Table of Contents (TOC) menu is used, put the section header at the top of the screen.

source: `bpo-25225 <https://bugs.python.org/issue25225>`__: Condense and rewrite Idle doc section on text colors.
fr: `bpo-25225 <https://bugs.python.org/25225>`__: Condense and rewrite Idle doc section on text colors.

source: `bpo-21995 <https://bugs.python.org/issue21995>`__: Explain some differences between IDLE and console Python.
fr: `bpo-21995 <https://bugs.python.org/21995>`__: Explain some differences between IDLE and console Python.

source: `bpo-22820 <https://bugs.python.org/issue22820>`__: Explain need for *print* when running file from Idle editor.
fr: `bpo-22820 <https://bugs.python.org/22820>`__: Explain need for *print* when running file from Idle editor.

source: `bpo-25224 <https://bugs.python.org/issue25224>`__: Doc: augment Idle feature list and no-subprocess section.
fr: `bpo-25224 <https://bugs.python.org/25224>`__: Doc: augment Idle feature list and no-subprocess section.

source: `bpo-25219 <https://bugs.python.org/issue25219>`__: Update doc for Idle command line options. Some were missing and notes were not correct.
fr: `bpo-25219 <https://bugs.python.org/25219>`__: Update doc for Idle command line options. Some were missing and notes were not correct.

source: `bpo-24861 <https://bugs.python.org/issue24861>`__: Most of idlelib is private and subject to change. Use idleib.idle.* to start Idle. See idlelib.__init__.__doc__.
fr: `bpo-24861 <https://bugs.python.org/24861>`__: Most of idlelib is private and subject to change. Use idleib.idle.* to start Idle. See idlelib.__init__.__doc__.

source: `bpo-25199 <https://bugs.python.org/issue25199>`__: Idle: add synchronization comments for future maintainers.
fr: `bpo-25199 <https://bugs.python.org/25199>`__: Idle: add synchronization comments for future maintainers.

source: `bpo-16893 <https://bugs.python.org/issue16893>`__: Replace help.txt with help.html for Idle doc display. The new idlelib/help.html is rstripped Doc/build/html/library/idle.html. It looks better than help.txt and will better document Idle as released. The tkinter html viewer that works for this file was written by Rose Roseman. The now unused EditorWindow.HelpDialog class and helt.txt file are deprecated.
fr: `bpo-16893 <https://bugs.python.org/16893>`__: Replace help.txt with help.html for Idle doc display. The new idlelib/help.html is rstripped Doc/build/html/library/idle.html. It looks better than help.txt and will better document Idle as released. The tkinter html viewer that works for this file was written by Rose Roseman. The now unused EditorWindow.HelpDialog class and helt.txt file are deprecated.

source: `bpo-24199 <https://bugs.python.org/issue24199>`__: Deprecate unused idlelib.idlever with possible removal in 3.6.
fr: `bpo-24199 <https://bugs.python.org/24199>`__: Deprecate unused idlelib.idlever with possible removal in 3.6.

source: `bpo-24790 <https://bugs.python.org/issue24790>`__: Remove extraneous code (which also create 2 & 3 conflicts).
fr: `bpo-24790 <https://bugs.python.org/24790>`__: Remove extraneous code (which also create 2 & 3 conflicts).

source: `bpo-26736 <https://bugs.python.org/issue26736>`__: Used HTTPS for external links in the documentation if possible.
fr: `bpo-26736 <https://bugs.python.org/26736>`__: Used HTTPS for external links in the documentation if possible.

source: `bpo-6953 <https://bugs.python.org/issue6953>`__: Rework the Readline module documentation to group related functions together, and add more details such as what underlying Readline functions and variables are accessed.
fr: `bpo-6953 <https://bugs.python.org/6953>`__: Rework the Readline module documentation to group related functions together, and add more details such as what underlying Readline functions and variables are accessed.

source: `bpo-23606 <https://bugs.python.org/issue23606>`__: Adds note to ctypes documentation regarding cdll.msvcrt.
fr: `bpo-23606 <https://bugs.python.org/23606>`__: Adds note to ctypes documentation regarding cdll.msvcrt.

source: `bpo-24952 <https://bugs.python.org/issue24952>`__: Clarify the default size argument of stack_size() in the "threading" and "_thread" modules. Patch from Mattip.
fr: `bpo-24952 <https://bugs.python.org/24952>`__: Clarify the default size argument of stack_size() in the "threading" and "_thread" modules. Patch from Mattip.

source: `bpo-26014 <https://bugs.python.org/issue26014>`__: Update 3.x packaging documentation: * "See also" links to the new docs are now provided in the legacy pages * links to setuptools documentation have been updated
fr: `bpo-26014 <https://bugs.python.org/26014>`__: Update 3.x packaging documentation: * "See also" links to the new docs are now provided in the legacy pages * links to setuptools documentation have been updated

source: `bpo-21916 <https://bugs.python.org/issue21916>`__: Added tests for the turtle module. Patch by ingrid, Gregory Loyse and Jelle Zijlstra.
fr: `bpo-21916 <https://bugs.python.org/21916>`__: Added tests for the turtle module. Patch by ingrid, Gregory Loyse and Jelle Zijlstra.

source: `bpo-26295 <https://bugs.python.org/issue26295>`__: When using "python3 -m test --testdir=TESTDIR", regrtest doesn't add "test." prefix to test module names.
fr: `bpo-26295 <https://bugs.python.org/26295>`__: When using "python3 -m test --testdir=TESTDIR", regrtest doesn't add "test." prefix to test module names.

source: `bpo-26523 <https://bugs.python.org/issue26523>`__: The multiprocessing thread pool (multiprocessing.dummy.Pool) was untested.
fr: `bpo-26523 <https://bugs.python.org/26523>`__: The multiprocessing thread pool (multiprocessing.dummy.Pool) was untested.

source: `bpo-26015 <https://bugs.python.org/issue26015>`__: Added new tests for pickling iterators of mutable sequences.
fr: `bpo-26015 <https://bugs.python.org/26015>`__: Added new tests for pickling iterators of mutable sequences.

source: `bpo-26325 <https://bugs.python.org/issue26325>`__: Added test.support.check_no_resource_warning() to check that no ResourceWarning is emitted.
fr: `bpo-26325 <https://bugs.python.org/26325>`__: Added test.support.check_no_resource_warning() to check that no ResourceWarning is emitted.

source: `bpo-25940 <https://bugs.python.org/issue25940>`__: Changed test_ssl to use its internal local server more. This avoids relying on svn.python.org, which recently changed root certificate.
fr: `bpo-25940 <https://bugs.python.org/25940>`__: Changed test_ssl to use its internal local server more. This avoids relying on svn.python.org, which recently changed root certificate.

source: `bpo-25616 <https://bugs.python.org/issue25616>`__: Tests for OrderedDict are extracted from test_collections into separate file test_ordered_dict.
fr: `bpo-25616 <https://bugs.python.org/25616>`__: Tests for OrderedDict are extracted from test_collections into separate file test_ordered_dict.

source: `bpo-25449 <https://bugs.python.org/issue25449>`__: Added tests for OrderedDict subclasses.
fr: `bpo-25449 <https://bugs.python.org/25449>`__: Added tests for OrderedDict subclasses.

source: `bpo-25188 <https://bugs.python.org/issue25188>`__: Add -P/--pgo to test.regrtest to suppress error output when running the test suite for the purposes of a PGO build. Initial patch by Alecsandru Patrascu.
fr: `bpo-25188 <https://bugs.python.org/25188>`__: Add -P/--pgo to test.regrtest to suppress error output when running the test suite for the purposes of a PGO build. Initial patch by Alecsandru Patrascu.

source: `bpo-22806 <https://bugs.python.org/issue22806>`__: Add ``python -m test --list-tests`` command to list tests.
fr: `bpo-22806 <https://bugs.python.org/22806>`__: Add ``python -m test --list-tests`` command to list tests.

source: `bpo-18174 <https://bugs.python.org/issue18174>`__: ``python -m test --huntrleaks ...`` now also checks for leak of file descriptors. Patch written by Richard Oudkerk.
fr: `bpo-18174 <https://bugs.python.org/18174>`__: ``python -m test --huntrleaks ...`` now also checks for leak of file descriptors. Patch written by Richard Oudkerk.

source: `bpo-25260 <https://bugs.python.org/issue25260>`__: Fix ``python -m test --coverage`` on Windows. Remove the list of ignored directories.
fr: `bpo-25260 <https://bugs.python.org/25260>`__: Fix ``python -m test --coverage`` on Windows. Remove the list of ignored directories.

source: `bpo-26583 <https://bugs.python.org/issue26583>`__: Skip test_timestamp_overflow in test_import if bytecode files cannot be written.
fr: `bpo-26583 <https://bugs.python.org/26583>`__: Skip test_timestamp_overflow in test_import if bytecode files cannot be written.

source: `bpo-21277 <https://bugs.python.org/issue21277>`__: Don't try to link _ctypes with a ffi_convenience library.
fr: `bpo-21277 <https://bugs.python.org/21277>`__: Don't try to link _ctypes with a ffi_convenience library.

source: `bpo-26884 <https://bugs.python.org/issue26884>`__: Fix linking extension modules for cross builds. Patch by Xavier de Gaye.
fr: `bpo-26884 <https://bugs.python.org/26884>`__: Fix linking extension modules for cross builds. Patch by Xavier de Gaye.

source: `bpo-26932 <https://bugs.python.org/issue26932>`__: Fixed support of RTLD_* constants defined as enum values, not via macros (in particular on Android). Patch by Chi Hsuan Yen.
fr: `bpo-26932 <https://bugs.python.org/26932>`__: Fixed support of RTLD_* constants defined as enum values, not via macros (in particular on Android). Patch by Chi Hsuan Yen.

source: `bpo-22359 <https://bugs.python.org/issue22359>`__: Disable the rules for running _freeze_importlib and pgen when cross-compiling. The output of these programs is normally saved with the source code anyway, and is still regenerated when doing a native build. Patch by Xavier de Gaye.
fr: `bpo-22359 <https://bugs.python.org/22359>`__: Disable the rules for running _freeze_importlib and pgen when cross-compiling. The output of these programs is normally saved with the source code anyway, and is still regenerated when doing a native build. Patch by Xavier de Gaye.

source: `bpo-21668 <https://bugs.python.org/issue21668>`__: Link audioop, _datetime, _ctypes_test modules to libm, except on Mac OS X. Patch written by Chi Hsuan Yen.
fr: `bpo-21668 <https://bugs.python.org/21668>`__: Link audioop, _datetime, _ctypes_test modules to libm, except on Mac OS X. Patch written by Chi Hsuan Yen.

source: `bpo-25702 <https://bugs.python.org/issue25702>`__: A --with-lto configure option has been added that will enable link time optimizations at build time during a make profile-opt. Some compilers and toolchains are known to not produce stable code when using LTO, be sure to test things thoroughly before relying on it. It can provide a few % speed up over profile-opt alone.
fr: `bpo-25702 <https://bugs.python.org/25702>`__: A --with-lto configure option has been added that will enable link time optimizations at build time during a make profile-opt. Some compilers and toolchains are known to not produce stable code when using LTO, be sure to test things thoroughly before relying on it. It can provide a few % speed up over profile-opt alone.

source: `bpo-26624 <https://bugs.python.org/issue26624>`__: Adds validation of ucrtbase[d].dll version with warning for old versions.
fr: `bpo-26624 <https://bugs.python.org/26624>`__: Adds validation of ucrtbase[d].dll version with warning for old versions.

source: `bpo-17603 <https://bugs.python.org/issue17603>`__: Avoid error about nonexistant fileblocks.o file by using a lower-level check for st_blocks in struct stat.
fr: `bpo-17603 <https://bugs.python.org/17603>`__: Avoid error about nonexistant fileblocks.o file by using a lower-level check for st_blocks in struct stat.

source: `bpo-26079 <https://bugs.python.org/issue26079>`__: Fixing the build output folder for tix-8.4.3.6. Patch by Bjoern Thiel.
fr: `bpo-26079 <https://bugs.python.org/26079>`__: Fixing the build output folder for tix-8.4.3.6. Patch by Bjoern Thiel.

source: `bpo-26465 <https://bugs.python.org/issue26465>`__: Update Windows builds to use OpenSSL 1.0.2g.
fr: `bpo-26465 <https://bugs.python.org/26465>`__: Update Windows builds to use OpenSSL 1.0.2g.

source: `bpo-25348 <https://bugs.python.org/issue25348>`__: Added ``--pgo`` and ``--pgo-job`` arguments to ``PCbuild\build.bat`` for building with Profile-Guided Optimization. The old ``PCbuild\build_pgo.bat`` script is removed.
fr: `bpo-25348 <https://bugs.python.org/25348>`__: Added ``--pgo`` and ``--pgo-job`` arguments to ``PCbuild\build.bat`` for building with Profile-Guided Optimization. The old ``PCbuild\build_pgo.bat`` script is removed.

source: `bpo-25827 <https://bugs.python.org/issue25827>`__: Add support for building with ICC to ``configure``, including a new ``--with-icc`` flag.
fr: `bpo-25827 <https://bugs.python.org/25827>`__: Add support for building with ICC to ``configure``, including a new ``--with-icc`` flag.
