Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-20942 <https://bugs.python.org/issue20942>`__: PyImport_ImportFrozenModuleObject() no longer sets __file__ to match what importlib does; this affects _frozen_importlib as well as any module loaded using imp.init_frozen().
fr: `bpo-20942 <https://bugs.python.org/20942>`__: PyImport_ImportFrozenModuleObject() no longer sets __file__ to match what importlib does; this affects _frozen_importlib as well as any module loaded using imp.init_frozen().

source: `bpo-19548 <https://bugs.python.org/issue19548>`__: Update the codecs module documentation to better cover the distinction between text encodings and other codecs, together with other clarifications. Patch by Martin Panter.
fr: `bpo-19548 <https://bugs.python.org/19548>`__: Update the codecs module documentation to better cover the distinction between text encodings and other codecs, together with other clarifications. Patch by Martin Panter.

source: `bpo-22394 <https://bugs.python.org/issue22394>`__: Doc/Makefile now supports ``make venv PYTHON=../python`` to create a venv for generating the documentation, e.g., ``make html PYTHON=venv/bin/python3``.
fr: `bpo-22394 <https://bugs.python.org/22394>`__: Doc/Makefile now supports ``make venv PYTHON=../python`` to create a venv for generating the documentation, e.g., ``make html PYTHON=venv/bin/python3``.

source: `bpo-21514 <https://bugs.python.org/issue21514>`__: The documentation of the json module now refers to new JSON RFC 7159 instead of obsoleted RFC 4627.
fr: `bpo-21514 <https://bugs.python.org/21514>`__: The documentation of the json module now refers to new JSON RFC 7159 instead of obsoleted RFC 4627.

source: `bpo-21777 <https://bugs.python.org/issue21777>`__: The binary sequence methods on bytes and bytearray are now documented explicitly, rather than assuming users will be able to derive the expected behaviour from the behaviour of the corresponding str methods.
fr: `bpo-21777 <https://bugs.python.org/21777>`__: The binary sequence methods on bytes and bytearray are now documented explicitly, rather than assuming users will be able to derive the expected behaviour from the behaviour of the corresponding str methods.

source: `bpo-6916 <https://bugs.python.org/issue6916>`__: undocument deprecated asynchat.fifo class.
fr: `bpo-6916 <https://bugs.python.org/6916>`__: undocument deprecated asynchat.fifo class.

source: `bpo-17386 <https://bugs.python.org/issue17386>`__: Expanded functionality of the ``Doc/make.bat`` script to make it much more comparable to ``Doc/Makefile``.
fr: `bpo-17386 <https://bugs.python.org/17386>`__: Expanded functionality of the ``Doc/make.bat`` script to make it much more comparable to ``Doc/Makefile``.

source: `bpo-21312 <https://bugs.python.org/issue21312>`__: Update the thread_foobar.h template file to include newer threading APIs. Patch by Jack McCracken.
fr: `bpo-21312 <https://bugs.python.org/21312>`__: Update the thread_foobar.h template file to include newer threading APIs. Patch by Jack McCracken.

source: `bpo-21043 <https://bugs.python.org/issue21043>`__: Remove the recommendation for specific CA organizations and to mention the ability to load the OS certificates.
fr: `bpo-21043 <https://bugs.python.org/21043>`__: Remove the recommendation for specific CA organizations and to mention the ability to load the OS certificates.

source: `bpo-20765 <https://bugs.python.org/issue20765>`__: Add missing documentation for PurePath.with_name() and PurePath.with_suffix().
fr: `bpo-20765 <https://bugs.python.org/20765>`__: Add missing documentation for PurePath.with_name() and PurePath.with_suffix().

source: `bpo-19407 <https://bugs.python.org/issue19407>`__: New package installation and distribution guides based on the Python Packaging Authority tools. Existing guides have been retained as legacy links from the distutils docs, as they still contain some required reference material for tool developers that isn't recorded anywhere else.
fr: `bpo-19407 <https://bugs.python.org/19407>`__: New package installation and distribution guides based on the Python Packaging Authority tools. Existing guides have been retained as legacy links from the distutils docs, as they still contain some required reference material for tool developers that isn't recorded anywhere else.

source: `bpo-19697 <https://bugs.python.org/issue19697>`__: Document cases where __main__.__spec__ is None.
fr: `bpo-19697 <https://bugs.python.org/19697>`__: Document cases where __main__.__spec__ is None.

source: `bpo-18982 <https://bugs.python.org/issue18982>`__: Add tests for CLI of the calendar module.
fr: `bpo-18982 <https://bugs.python.org/18982>`__: Add tests for CLI of the calendar module.

source: `bpo-19548 <https://bugs.python.org/issue19548>`__: Added some additional checks to test_codecs to ensure that statements in the updated documentation remain accurate. Patch by Martin Panter.
fr: `bpo-19548 <https://bugs.python.org/19548>`__: Added some additional checks to test_codecs to ensure that statements in the updated documentation remain accurate. Patch by Martin Panter.

source: `bpo-22838 <https://bugs.python.org/issue22838>`__: All test_re tests now work with unittest test discovery.
fr: `bpo-22838 <https://bugs.python.org/22838>`__: All test_re tests now work with unittest test discovery.

source: `bpo-22173 <https://bugs.python.org/issue22173>`__: Update lib2to3 tests to use unittest test discovery.
fr: `bpo-22173 <https://bugs.python.org/22173>`__: Update lib2to3 tests to use unittest test discovery.

source: `bpo-16000 <https://bugs.python.org/issue16000>`__: Convert test_curses to use unittest.
fr: `bpo-16000 <https://bugs.python.org/16000>`__: Convert test_curses to use unittest.

source: `bpo-21456 <https://bugs.python.org/issue21456>`__: Skip two tests in test_urllib2net.py if _ssl module not present. Patch by Remi Pointel.
fr: `bpo-21456 <https://bugs.python.org/21456>`__: Skip two tests in test_urllib2net.py if _ssl module not present. Patch by Remi Pointel.

source: `bpo-20746 <https://bugs.python.org/issue20746>`__: Fix test_pdb to run in refleak mode (-R). Patch by Xavier de Gaye.
fr: `bpo-20746 <https://bugs.python.org/20746>`__: Fix test_pdb to run in refleak mode (-R). Patch by Xavier de Gaye.

source: `bpo-22060 <https://bugs.python.org/issue22060>`__: test_ctypes has been somewhat cleaned up and simplified; it now uses unittest test discovery to find its tests.
fr: `bpo-22060 <https://bugs.python.org/22060>`__: test_ctypes has been somewhat cleaned up and simplified; it now uses unittest test discovery to find its tests.

source: `bpo-22104 <https://bugs.python.org/issue22104>`__: regrtest.py no longer holds a reference to the suite of tests loaded from test modules that don't define test_main().
fr: `bpo-22104 <https://bugs.python.org/22104>`__: regrtest.py no longer holds a reference to the suite of tests loaded from test modules that don't define test_main().

source: `bpo-22111 <https://bugs.python.org/issue22111>`__: Assorted cleanups in test_imaplib. Patch by Milan Oberkirch.
fr: `bpo-22111 <https://bugs.python.org/22111>`__: Assorted cleanups in test_imaplib. Patch by Milan Oberkirch.

source: `bpo-22002 <https://bugs.python.org/issue22002>`__: Added ``load_package_tests`` function to test.support and used it to implement/augment test discovery in test_asyncio, test_email, test_importlib, test_json, and test_tools.
fr: `bpo-22002 <https://bugs.python.org/22002>`__: Added ``load_package_tests`` function to test.support and used it to implement/augment test discovery in test_asyncio, test_email, test_importlib, test_json, and test_tools.

source: `bpo-21976 <https://bugs.python.org/issue21976>`__: Fix test_ssl to accept LibreSSL version strings. Thanks to William Orr.
fr: `bpo-21976 <https://bugs.python.org/21976>`__: Fix test_ssl to accept LibreSSL version strings. Thanks to William Orr.

source: `bpo-21918 <https://bugs.python.org/issue21918>`__: Converted test_tools from a module to a package containing separate test files for each tested script.
fr: `bpo-21918 <https://bugs.python.org/21918>`__: Converted test_tools from a module to a package containing separate test files for each tested script.

source: `bpo-9554 <https://bugs.python.org/issue9554>`__: Use modern unittest features in test_argparse. Initial patch by Denver Coneybeare and Radu Voicilas.
fr: `bpo-9554 <https://bugs.python.org/9554>`__: Use modern unittest features in test_argparse. Initial patch by Denver Coneybeare and Radu Voicilas.

source: `bpo-20155 <https://bugs.python.org/issue20155>`__: Changed HTTP method names in failing tests in test_httpservers so that packet filtering software (specifically Windows Base Filtering Engine) does not interfere with the transaction semantics expected by the tests.
fr: `bpo-20155 <https://bugs.python.org/20155>`__: Changed HTTP method names in failing tests in test_httpservers so that packet filtering software (specifically Windows Base Filtering Engine) does not interfere with the transaction semantics expected by the tests.

source: `bpo-19493 <https://bugs.python.org/issue19493>`__: Refactored the ctypes test package to skip tests explicitly rather than silently.
fr: `bpo-19493 <https://bugs.python.org/19493>`__: Refactored the ctypes test package to skip tests explicitly rather than silently.

source: `bpo-18492 <https://bugs.python.org/issue18492>`__: All resources are now allowed when tests are not run by regrtest.py.
fr: `bpo-18492 <https://bugs.python.org/18492>`__: All resources are now allowed when tests are not run by regrtest.py.

source: `bpo-21634 <https://bugs.python.org/issue21634>`__: Fix pystone micro-benchmark: use floor division instead of true division to benchmark integers instead of floating point numbers. Set pystone version to 1.2. Patch written by Lennart Regebro.
fr: `bpo-21634 <https://bugs.python.org/21634>`__: Fix pystone micro-benchmark: use floor division instead of true division to benchmark integers instead of floating point numbers. Set pystone version to 1.2. Patch written by Lennart Regebro.

source: `bpo-21605 <https://bugs.python.org/issue21605>`__: Added tests for Tkinter images.
fr: `bpo-21605 <https://bugs.python.org/21605>`__: Added tests for Tkinter images.

source: `bpo-21493 <https://bugs.python.org/issue21493>`__: Added test for ntpath.expanduser(). Original patch by Claudiu Popa.
fr: `bpo-21493 <https://bugs.python.org/21493>`__: Added test for ntpath.expanduser(). Original patch by Claudiu Popa.

source: `bpo-19925 <https://bugs.python.org/issue19925>`__: Added tests for the spwd module. Original patch by Vajrasky Kok.
fr: `bpo-19925 <https://bugs.python.org/19925>`__: Added tests for the spwd module. Original patch by Vajrasky Kok.

source: `bpo-21522 <https://bugs.python.org/issue21522>`__: Added Tkinter tests for Listbox.itemconfigure(), PanedWindow.paneconfigure(), and Menu.entryconfigure().
fr: `bpo-21522 <https://bugs.python.org/21522>`__: Added Tkinter tests for Listbox.itemconfigure(), PanedWindow.paneconfigure(), and Menu.entryconfigure().

source: `bpo-17756 <https://bugs.python.org/issue17756>`__: Fix test_code test when run from the installed location.
fr: `bpo-17756 <https://bugs.python.org/17756>`__: Fix test_code test when run from the installed location.

source: `bpo-17752 <https://bugs.python.org/issue17752>`__: Fix distutils tests when run from the installed location.
fr: `bpo-17752 <https://bugs.python.org/17752>`__: Fix distutils tests when run from the installed location.

source: `bpo-18604 <https://bugs.python.org/issue18604>`__: Consolidated checks for GUI availability. All platforms now at least check whether Tk can be instantiated when the GUI resource is requested.
fr: `bpo-18604 <https://bugs.python.org/18604>`__: Consolidated checks for GUI availability. All platforms now at least check whether Tk can be instantiated when the GUI resource is requested.

source: `bpo-21275 <https://bugs.python.org/issue21275>`__: Fix a socket test on KFreeBSD.
fr: `bpo-21275 <https://bugs.python.org/21275>`__: Fix a socket test on KFreeBSD.

source: `bpo-21223 <https://bugs.python.org/issue21223>`__: Pass test_site/test_startup_imports when some of the extensions are built as builtins.
fr: `bpo-21223 <https://bugs.python.org/21223>`__: Pass test_site/test_startup_imports when some of the extensions are built as builtins.

source: `bpo-20635 <https://bugs.python.org/issue20635>`__: Added tests for Tk geometry managers.
fr: `bpo-20635 <https://bugs.python.org/20635>`__: Added tests for Tk geometry managers.

source: Add test case for freeze.
fr: Ajoute un test pour *freeze*.

source: `bpo-20743 <https://bugs.python.org/issue20743>`__: Fix a reference leak in test_tcl.
fr: `bpo-20743 <https://bugs.python.org/20743>`__: Fix a reference leak in test_tcl.

source: `bpo-21097 <https://bugs.python.org/issue21097>`__: Move test_namespace_pkgs into test_importlib.
fr: `bpo-21097 <https://bugs.python.org/21097>`__: Move test_namespace_pkgs into test_importlib.

source: `bpo-21503 <https://bugs.python.org/issue21503>`__: Use test_both() consistently in test_importlib.
fr: `bpo-21503 <https://bugs.python.org/21503>`__: Use test_both() consistently in test_importlib.

source: `bpo-20939 <https://bugs.python.org/issue20939>`__: Avoid various network test failures due to new redirect of http://www.python.org/ to https://www.python.org: use http://www.example.com instead.
fr: `bpo-20939 <https://bugs.python.org/20939>`__: Avoid various network test failures due to new redirect of http://www.python.org/ to https://www.python.org: use http://www.example.com instead.

source: `bpo-20668 <https://bugs.python.org/issue20668>`__: asyncio tests no longer rely on tests.txt file. (Patch by Vajrasky Kok)
fr: `bpo-20668 <https://bugs.python.org/20668>`__: asyncio tests no longer rely on tests.txt file. (Patch by Vajrasky Kok)

source: `bpo-21093 <https://bugs.python.org/issue21093>`__: Prevent failures of ctypes test_macholib on OS X if a copy of libz exists in $HOME/lib or /usr/local/lib.
fr: `bpo-21093 <https://bugs.python.org/21093>`__: Prevent failures of ctypes test_macholib on OS X if a copy of libz exists in $HOME/lib or /usr/local/lib.

source: `bpo-22770 <https://bugs.python.org/issue22770>`__: Prevent some Tk segfaults on OS X when running gui tests.
fr: `bpo-22770 <https://bugs.python.org/22770>`__: Prevent some Tk segfaults on OS X when running gui tests.

source: `bpo-23211 <https://bugs.python.org/issue23211>`__: Workaround test_logging failure on some OS X 10.6 systems.
fr: `bpo-23211 <https://bugs.python.org/23211>`__: Workaround test_logging failure on some OS X 10.6 systems.

source: `bpo-23345 <https://bugs.python.org/issue23345>`__: Prevent test_ssl failures with large OpenSSL patch level values (like 0.9.8zc).
fr: `bpo-23345 <https://bugs.python.org/23345>`__: Prevent test_ssl failures with large OpenSSL patch level values (like 0.9.8zc).

source: `bpo-22314 <https://bugs.python.org/issue22314>`__: pydoc now works when the LINES environment variable is set.
fr: `bpo-22314 <https://bugs.python.org/22314>`__: pydoc now works when the LINES environment variable is set.

source: `bpo-22615 <https://bugs.python.org/issue22615>`__: Argument Clinic now supports the "type" argument for the int converter. This permits using the int converter with enums and typedefs.
fr: `bpo-22615 <https://bugs.python.org/22615>`__: Argument Clinic now supports the "type" argument for the int converter. This permits using the int converter with enums and typedefs.

source: `bpo-20076 <https://bugs.python.org/issue20076>`__: The makelocalealias.py script no longer ignores UTF-8 mapping.
fr: `bpo-20076 <https://bugs.python.org/20076>`__: The makelocalealias.py script no longer ignores UTF-8 mapping.

source: `bpo-20079 <https://bugs.python.org/issue20079>`__: The makelocalealias.py script now can parse the SUPPORTED file from glibc sources and supports command line options for source paths.
fr: `bpo-20079 <https://bugs.python.org/20079>`__: The makelocalealias.py script now can parse the SUPPORTED file from glibc sources and supports command line options for source paths.

source: `bpo-22201 <https://bugs.python.org/issue22201>`__: Command-line interface of the zipfile module now correctly extracts ZIP files with directory entries. Patch by Ryan Wilson.
fr: `bpo-22201 <https://bugs.python.org/22201>`__: Command-line interface of the zipfile module now correctly extracts ZIP files with directory entries. Patch by Ryan Wilson.

source: `bpo-22120 <https://bugs.python.org/issue22120>`__: For functions using an unsigned integer return converter, Argument Clinic now generates a cast to that type for the comparison to -1 in the generated code. (This suppresses a compilation warning.)
fr: `bpo-22120 <https://bugs.python.org/22120>`__: For functions using an unsigned integer return converter, Argument Clinic now generates a cast to that type for the comparison to -1 in the generated code. (This suppresses a compilation warning.)

source: `bpo-18974 <https://bugs.python.org/issue18974>`__: Tools/scripts/diff.py now uses argparse instead of optparse.
fr: `bpo-18974 <https://bugs.python.org/18974>`__: Tools/scripts/diff.py now uses argparse instead of optparse.

source: `bpo-21906 <https://bugs.python.org/issue21906>`__: Make Tools/scripts/md5sum.py work in Python 3. Patch by Zachary Ware.
fr: `bpo-21906 <https://bugs.python.org/21906>`__: Make Tools/scripts/md5sum.py work in Python 3. Patch by Zachary Ware.

source: `bpo-21629 <https://bugs.python.org/issue21629>`__: Fix Argument Clinic's "--converters" feature.
fr: `bpo-21629 <https://bugs.python.org/21629>`__: Fix Argument Clinic's "--converters" feature.

source: Add support for ``yield from`` to 2to3.
fr: Ajoute le support de ``yield from`` à *2to3*.

source: `bpo-16047 <https://bugs.python.org/issue16047>`__: Fix module exception list and __file__ handling in freeze. Patch by Meador Inge.
fr: `bpo-16047 <https://bugs.python.org/16047>`__: Fix module exception list and __file__ handling in freeze. Patch by Meador Inge.

source: `bpo-11824 <https://bugs.python.org/issue11824>`__: Consider ABI tags in freeze. Patch by Meador Inge.
fr: `bpo-11824 <https://bugs.python.org/11824>`__: Consider ABI tags in freeze. Patch by Meador Inge.

source: `bpo-20535 <https://bugs.python.org/issue20535>`__: PYTHONWARNING no longer affects the run_tests.py script. Patch by Arfrever Frehtes Taifersar Arahesis.
fr: `bpo-20535 <https://bugs.python.org/20535>`__: PYTHONWARNING no longer affects the run_tests.py script. Patch by Arfrever Frehtes Taifersar Arahesis.

source: `bpo-23260 <https://bugs.python.org/issue23260>`__: Update Windows installer
fr: `bpo-23260 <https://bugs.python.org/23260>`__: Update Windows installer

source: `bpo-17896 <https://bugs.python.org/issue17896>`__: The Windows build scripts now expect external library sources to be in ``PCbuild\..\externals`` rather than ``PCbuild\..\..``.
fr: `bpo-17896 <https://bugs.python.org/17896>`__: The Windows build scripts now expect external library sources to be in ``PCbuild\..\externals`` rather than ``PCbuild\..\..``.

source: `bpo-17717 <https://bugs.python.org/issue17717>`__: The Windows build scripts now use a copy of NASM pulled from svn.python.org to build OpenSSL.
fr: `bpo-17717 <https://bugs.python.org/17717>`__: The Windows build scripts now use a copy of NASM pulled from svn.python.org to build OpenSSL.

source: `bpo-21907 <https://bugs.python.org/issue21907>`__: Improved the batch scripts provided for building Python.
fr: `bpo-21907 <https://bugs.python.org/21907>`__: Improved the batch scripts provided for building Python.

source: `bpo-22644 <https://bugs.python.org/issue22644>`__: The bundled version of OpenSSL has been updated to 1.0.1j.
fr: `bpo-22644 <https://bugs.python.org/22644>`__: The bundled version of OpenSSL has been updated to 1.0.1j.

source: `bpo-10747 <https://bugs.python.org/issue10747>`__: Use versioned labels in the Windows start menu. Patch by Olive Kilburn.
fr: `bpo-10747 <https://bugs.python.org/10747>`__: Use versioned labels in the Windows start menu. Patch by Olive Kilburn.

source: `bpo-22980 <https://bugs.python.org/issue22980>`__: .pyd files with a version and platform tag (for example, ".cp35-win32.pyd") will now be loaded in preference to those without tags.
fr: `bpo-22980 <https://bugs.python.org/22980>`__: .pyd files with a version and platform tag (for example, ".cp35-win32.pyd") will now be loaded in preference to those without tags.

source: **(For information about older versions, consult the HISTORY file.)**
fr: **(Pour des informations sur les versions précédentes, consultez le fichier HISTORY.)**
