Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-25696 <https://bugs.python.org/issue25696>`__: Fix installation of Python on UNIX with make -j9.
fr: `bpo-25696 <https://bugs.python.org/25696>`__: Fix installation of Python on UNIX with make -j9.

source: `bpo-24986 <https://bugs.python.org/issue24986>`__: It is now possible to build Python on Windows without errors when external libraries are not available.
fr: `bpo-24986 <https://bugs.python.org/24986>`__: It is now possible to build Python on Windows without errors when external libraries are not available.

source: `bpo-24421 <https://bugs.python.org/issue24421>`__: Compile Modules/_math.c once, before building extensions. Previously it could fail to compile properly if the math and cmath builds were concurrent.
fr: `bpo-24421 <https://bugs.python.org/24421>`__: Compile Modules/_math.c once, before building extensions. Previously it could fail to compile properly if the math and cmath builds were concurrent.

source: `bpo-26465 <https://bugs.python.org/issue26465>`__: Update OS X 10.5+ 32-bit-only installer to build and link with OpenSSL 1.0.2g.
fr: `bpo-26465 <https://bugs.python.org/26465>`__: Update OS X 10.5+ 32-bit-only installer to build and link with OpenSSL 1.0.2g.

source: `bpo-26268 <https://bugs.python.org/issue26268>`__: Update Windows builds to use OpenSSL 1.0.2f.
fr: `bpo-26268 <https://bugs.python.org/26268>`__: Update Windows builds to use OpenSSL 1.0.2f.

source: `bpo-25136 <https://bugs.python.org/issue25136>`__: Support Apple Xcode 7's new textual SDK stub libraries.
fr: `bpo-25136 <https://bugs.python.org/25136>`__: Support Apple Xcode 7's new textual SDK stub libraries.

source: `bpo-24324 <https://bugs.python.org/issue24324>`__: Do not enable unreachable code warnings when using gcc as the option does not work correctly in older versions of gcc and has been silently removed as of gcc-4.5.
fr: `bpo-24324 <https://bugs.python.org/24324>`__: Do not enable unreachable code warnings when using gcc as the option does not work correctly in older versions of gcc and has been silently removed as of gcc-4.5.

source: `bpo-27053 <https://bugs.python.org/issue27053>`__: Updates make_zip.py to correctly generate library ZIP file.
fr: `bpo-27053 <https://bugs.python.org/27053>`__: Updates make_zip.py to correctly generate library ZIP file.

source: `bpo-26268 <https://bugs.python.org/issue26268>`__: Update the prepare_ssl.py script to handle OpenSSL releases that don't include the contents of the include directory (that is, 1.0.2e and later).
fr: `bpo-26268 <https://bugs.python.org/26268>`__: Update the prepare_ssl.py script to handle OpenSSL releases that don't include the contents of the include directory (that is, 1.0.2e and later).

source: `bpo-26071 <https://bugs.python.org/issue26071>`__: bdist_wininst created binaries fail to start and find 32bit Python
fr: `bpo-26071 <https://bugs.python.org/26071>`__: bdist_wininst created binaries fail to start and find 32bit Python

source: `bpo-26073 <https://bugs.python.org/issue26073>`__: Update the list of magic numbers in launcher
fr: `bpo-26073 <https://bugs.python.org/26073>`__: Update the list of magic numbers in launcher

source: `bpo-26065 <https://bugs.python.org/issue26065>`__: Excludes venv from library when generating embeddable distro.
fr: `bpo-26065 <https://bugs.python.org/26065>`__: Excludes venv from library when generating embeddable distro.

source: `bpo-25022 <https://bugs.python.org/issue25022>`__: Removed very outdated PC/example_nt/ directory.
fr: `bpo-25022 <https://bugs.python.org/25022>`__: Removed very outdated PC/example_nt/ directory.

source: `bpo-26799 <https://bugs.python.org/issue26799>`__: Fix python-gdb.py: don't get C types once when the Python code is loaded, but get C types on demand. The C types can change if python-gdb.py is loaded before the Python executable. Patch written by Thomas Ilsche.
fr: `bpo-26799 <https://bugs.python.org/26799>`__: Fix python-gdb.py: don't get C types once when the Python code is loaded, but get C types on demand. The C types can change if python-gdb.py is loaded before the Python executable. Patch written by Thomas Ilsche.

source: `bpo-26271 <https://bugs.python.org/issue26271>`__: Fix the Freeze tool to properly use flags passed through configure. Patch by Daniel Shaulov.
fr: `bpo-26271 <https://bugs.python.org/26271>`__: Fix the Freeze tool to properly use flags passed through configure. Patch by Daniel Shaulov.

source: `bpo-26489 <https://bugs.python.org/issue26489>`__: Add dictionary unpacking support to Tools/parser/unparse.py. Patch by Guo Ci Teo.
fr: `bpo-26489 <https://bugs.python.org/26489>`__: Add dictionary unpacking support to Tools/parser/unparse.py. Patch by Guo Ci Teo.

source: `bpo-26316 <https://bugs.python.org/issue26316>`__: Fix variable name typo in Argument Clinic.
fr: `bpo-26316 <https://bugs.python.org/26316>`__: Fix variable name typo in Argument Clinic.

source: `bpo-25440 <https://bugs.python.org/issue25440>`__: Fix output of python-config --extension-suffix.
fr: `bpo-25440 <https://bugs.python.org/25440>`__: Fix output of python-config --extension-suffix.

source: `bpo-25154 <https://bugs.python.org/issue25154>`__: The pyvenv script has been deprecated in favour of `python3 -m venv`.
fr: `bpo-25154 <https://bugs.python.org/25154>`__: The pyvenv script has been deprecated in favour of `python3 -m venv`.

source: `bpo-26312 <https://bugs.python.org/issue26312>`__: SystemError is now raised in all programming bugs with using PyArg_ParseTupleAndKeywords(). RuntimeError did raised before in some programming bugs.
fr: `bpo-26312 <https://bugs.python.org/26312>`__: SystemError is now raised in all programming bugs with using PyArg_ParseTupleAndKeywords(). RuntimeError did raised before in some programming bugs.

source: `bpo-26198 <https://bugs.python.org/issue26198>`__: ValueError is now raised instead of TypeError on buffer overflow in parsing "es#" and "et#" format units. SystemError is now raised instead of TypeError on programmical error in parsing format string.
fr: `bpo-26198 <https://bugs.python.org/26198>`__: ValueError is now raised instead of TypeError on buffer overflow in parsing "es#" and "et#" format units. SystemError is now raised instead of TypeError on programmical error in parsing format string.

source: `bpo-28203 <https://bugs.python.org/issue28203>`__: Fix incorrect type in error message from ``complex(1.0, {2:3})``. Patch by Soumya Sharma.
fr: `bpo-28203 <https://bugs.python.org/28203>`__: Fix incorrect type in complex(1.0, {2:3}) error message. Patch by Soumya Sharma.

source: `bpo-27419 <https://bugs.python.org/issue27419>`__: Standard __import__() no longer look up "__import__" in globals or builtins for importing submodules or "from import". Fixed handling an error of non-string package name.
fr: `bpo-27419 <https://bugs.python.org/27419>`__: Standard __import__() no longer look up "__import__" in globals or builtins for importing submodules or "from import". Fixed a crash if raise a warning about unabling to resolve package from __spec__ or __package__.

source: `bpo-27611 <https://bugs.python.org/issue27611>`__: Fixed support of default root window in the tkinter.tix module.
fr: `bpo-27611 <https://bugs.python.org/27611>`__: Fixed support of default root window in the tkinter.tix module. Added the master parameter in the DisplayStyle constructor.

source: `bpo-26750 <https://bugs.python.org/issue26750>`__: unittest.mock.create_autospec() now works properly for subclasses of property() and other data descriptors.
fr: `bpo-26750 <https://bugs.python.org/26750>`__: unittest.mock.create_autospec() now works properly for subclasses of property() and other data descriptors. Removes the never publicly used, never documented unittest.mock.DescriptorTypes tuple.

source: `bpo-22115 <https://bugs.python.org/issue22115>`__: Fixed tracing Tkinter variables: trace_vdelete() with wrong mode no longer break tracing, trace_vinfo() now always returns a list of pairs of strings, tracing in the "u" mode now works.
fr: `bpo-22115 <https://bugs.python.org/22115>`__: Added methods trace_add, trace_remove and trace_info in the tkinter.Variable class. They replace old methods trace_variable, trace, trace_vdelete and trace_vinfo that use obsolete Tcl commands and might not work in future versions of Tcl. Fixed old tracing methods: trace_vdelete() with wrong mode no longer break tracing, trace_vinfo() now always returns a list of pairs of strings, tracing in the "u" mode now works.

source: `bpo-26754 <https://bugs.python.org/issue26754>`__: PyUnicode_FSDecoder() accepted a filename argument encoded as an iterable of integers. Now only strings and bytes-like objects are accepted.
fr: `bpo-26754 <https://bugs.python.org/26754>`__: PyUnicode_FSDecoder() accepted a filename argument encoded as an iterable of integers. Now only strings and byte-like objects are accepted.

source: `bpo-27309 <https://bugs.python.org/issue27309>`__: Enabled proper Windows styles in python[w].exe manifest.
fr: `bpo-27309 <https://bugs.python.org/27309>`__: Enables proper Windows styles in python[w].exe manifest.

source: `bpo-25825 <https://bugs.python.org/issue25825>`__: Correct the references to Modules/python.exp and ld_so_aix, which are required on AIX. This updates references to an installation path that was changed in 3.2a4, and undoes changed references to the build tree that were made in 3.5.0a1.
fr: `bpo-25825 <https://bugs.python.org/25825>`__: Correct the references to Modules/python.exp, which is required on AIX. The references were accidentally changed in 3.5.0a1.

source: `bpo-27365 <https://bugs.python.org/issue27365>`__: Allow non-ascii in idlelib/NEWS.txt - minimal part for 3.5.2.
fr: `bpo-27365 <https://bugs.python.org/27365>`__: Allow non-ascii chars in IDLE NEWS.txt, for contributor names.

source: `bpo-27039 <https://bugs.python.org/issue27039>`__: Fixed bytearray.remove() for values greater than 127. Patch by Joe Jevnik.
fr: `bpo-27039 <https://bugs.python.org/27039>`__: Fixed bytearray.remove() for values greater than 127. Based on patch by Joe Jevnik.

source: `bpo-25843 <https://bugs.python.org/issue25843>`__: When compiling code, don't merge constants if they are equal but have a different types. For example, ``f1, f2 = lambda: 1, lambda: 1.0`` is now correctly compiled to two different functions: ``f1()`` returns ``1`` (``int``) and ``f2()`` returns ``1.0`` (``int``), even if ``1`` and ``1.0`` are equal.
fr: `bpo-25843 <https://bugs.python.org/25843>`__: When compiling code, don't merge constants if they are equal but have a different types. For example, ``f1, f2 = lambda: 1, lambda: 1.0`` is now correctly compiled to two different functions: ``f1()`` returns ``1`` (``int``) and ``f2()`` returns ``1.0`` (``float``), even if ``1`` and ``1.0`` are equal.

source: `bpo-21925 <https://bugs.python.org/issue21925>`__: :func:`warnings.formatwarning` now catches exceptions on ``linecache.getline(...)`` to be able to log :exc:`ResourceWarning` emitted late during the Python shutdown process.
fr: `bpo-21925 <https://bugs.python.org/21925>`__: :func:`warnings.formatwarning` now catches exceptions when calling :func:`linecache.getline` and :func:`tracemalloc.get_object_traceback` to be able to log :exc:`ResourceWarning` emitted late during the Python shutdown process.

source: `bpo-15068 <https://bugs.python.org/issue15068>`__: Got rid of excessive buffering in the fileinput module. The bufsize parameter is no longer used.
fr: `bpo-15068 <https://bugs.python.org/15068>`__: Got rid of excessive buffering in fileinput. The bufsize parameter is now deprecated and ignored.

source: `bpo-26367 <https://bugs.python.org/issue26367>`__: importlib.__import__() raises SystemError like builtins.__import__() when ``level`` is specified but without an accompanying package specified.
fr: `bpo-26367 <https://bugs.python.org/26367>`__: importlib.__import__() raises ImportError like builtins.__import__() when ``level`` is specified but without an accompanying package specified.

source: `bpo-25447 <https://bugs.python.org/issue25447>`__: Copying the lru_cache() wrapper object now always works, independedly from the type of the wrapped object (by returning the original object unchanged).
fr: `bpo-25447 <https://bugs.python.org/25447>`__: Copying the lru_cache() wrapper object now always works, independently from the type of the wrapped object (by returning the original object unchanged).

source: `bpo-25940 <https://bugs.python.org/issue25940>`__: Changed test_ssl to use self-signed.pythontest.net. This avoids relying on svn.python.org, which recently changed root certificate.
fr: `bpo-25940 <https://bugs.python.org/25940>`__: Changed test_ssl to use its internal local server more. This avoids relying on svn.python.org, which recently changed root certificate.

source: `bpo-21668 <https://bugs.python.org/issue21668>`__: Link audioop, _datetime, _ctypes_test modules to libm, except on Mac OS X. Patch written by Xavier de Gaye.
fr: `bpo-21668 <https://bugs.python.org/21668>`__: Link audioop, _datetime, _ctypes_test modules to libm, except on Mac OS X. Patch written by Chi Hsuan Yen.

source: `bpo-25348 <https://bugs.python.org/issue25348>`__: Added ``--pgo`` and ``--pgo-job`` arguments to ``PCbuild\build.bat`` for building with Profile-Guided Optimization. The old ``PCbuild\build_pgo.bat`` script is now deprecated, and simply calls ``PCbuild\build.bat --pgo %*``.
fr: `bpo-25348 <https://bugs.python.org/25348>`__: Added ``--pgo`` and ``--pgo-job`` arguments to ``PCbuild\build.bat`` for building with Profile-Guided Optimization. The old ``PCbuild\build_pgo.bat`` script is removed.

source: `bpo-25715 <https://bugs.python.org/issue25715>`__: Python 3.5.1 installer shows wrong upgrade path and incorrect logic for launcher detection.
fr: `bpo-25715 <https://bugs.python.org/25715>`__: Python 3.5.1 installer shows wrong upgrade path and incorrect logic for launcher detection.

source: `bpo-25182 <https://bugs.python.org/issue25182>`__: The stdprinter (used as sys.stderr before the io module is imported at startup) now uses the backslashreplace error handler.
fr: `bpo-25182 <https://bugs.python.org/25182>`__: The stdprinter (used as sys.stderr before the io module is imported at startup) now uses the backslashreplace error handler.

source: `bpo-25131 <https://bugs.python.org/issue25131>`__: Make the line number and column offset of set/dict literals and comprehensions correspond to the opening brace.
fr: `bpo-25131 <https://bugs.python.org/25131>`__: Make the line number and column offset of set/dict literals and comprehensions correspond to the opening brace.

source: `bpo-25150 <https://bugs.python.org/issue25150>`__: Hide the private _Py_atomic_xxx symbols from the public Python.h header to fix a compilation error with OpenMP. PyThreadState_GET() becomes an alias to PyThreadState_Get() to avoid ABI incompatibilies.
fr: `bpo-25150 <https://bugs.python.org/25150>`__: Hide the private _Py_atomic_xxx symbols from the public Python.h header to fix a compilation error with OpenMP. PyThreadState_GET() becomes an alias to PyThreadState_Get() to avoid ABI incompatibilies.

source: `bpo-25590 <https://bugs.python.org/issue25590>`__: In the Readline completer, only call getattr() once per attribute.
fr: `bpo-25590 <https://bugs.python.org/25590>`__: In the Readline completer, only call getattr() once per attribute.

source: `bpo-24483 <https://bugs.python.org/issue24483>`__: C implementation of functools.lru_cache() now calculates key's hash only once.
fr: `bpo-24483 <https://bugs.python.org/24483>`__: C implementation of functools.lru_cache() now calculates key's hash only once.

source: `bpo-22958 <https://bugs.python.org/issue22958>`__: Constructor and update method of weakref.WeakValueDictionary now accept the self and the dict keyword arguments.
fr: `bpo-22958 <https://bugs.python.org/22958>`__: Constructor and update method of weakref.WeakValueDictionary now accept the self and the dict keyword arguments.

source: `bpo-22609 <https://bugs.python.org/issue22609>`__: Constructor of collections.UserDict now accepts the self keyword argument.
fr: `bpo-22609 <https://bugs.python.org/22609>`__: Constructor of collections.UserDict now accepts the self keyword argument.

source: `bpo-25111 <https://bugs.python.org/issue25111>`__: Fixed comparison of traceback.FrameSummary.
fr: `bpo-25111 <https://bugs.python.org/25111>`__: Fixed comparison of traceback.FrameSummary.

source: `bpo-25262 <https://bugs.python.org/issue25262>`__: Added support for BINBYTES8 opcode in Python implementation of unpickler. Highest 32 bits of 64-bit size for BINUNICODE8 and BINBYTES8 opcodes no longer silently ignored on 32-bit platforms in C implementation.
fr: `bpo-25262 <https://bugs.python.org/25262>`__: Added support for BINBYTES8 opcode in Python implementation of unpickler. Highest 32 bits of 64-bit size for BINUNICODE8 and BINBYTES8 opcodes no longer silently ignored on 32-bit platforms in C implementation.

source: `bpo-25034 <https://bugs.python.org/issue25034>`__: Fix string.Formatter problem with auto-numbering and nested format_specs. Patch by Anthon van der Neut.
fr: `bpo-25034 <https://bugs.python.org/25034>`__: Fix string.Formatter problem with auto-numbering and nested format_specs. Patch by Anthon van der Neut.

source: `bpo-25233 <https://bugs.python.org/issue25233>`__: Rewrite the guts of asyncio.Queue and asyncio.Semaphore to be more understandable and correct.
fr: `bpo-25233 <https://bugs.python.org/25233>`__: Rewrite the guts of asyncio.Queue and asyncio.Semaphore to be more understandable and correct.

source: `bpo-23329 <https://bugs.python.org/issue23329>`__: Allow the ssl module to be built with older versions of LibreSSL.
fr: `bpo-23329 <https://bugs.python.org/23329>`__: Allow the ssl module to be built with older versions of LibreSSL.

source: `bpo-25047 <https://bugs.python.org/issue25047>`__: The XML encoding declaration written by Element Tree now respects the letter case given by the user. This restores the ability to write encoding names in uppercase like "UTF-8", which worked in Python 2.
fr: `bpo-25047 <https://bugs.python.org/25047>`__: The XML encoding declaration written by Element Tree now respects the letter case given by the user. This restores the ability to write encoding names in uppercase like "UTF-8", which worked in Python 2.

source: `bpo-25135 <https://bugs.python.org/issue25135>`__: Make deque_clear() safer by emptying the deque before clearing. This helps avoid possible reentrancy issues.
fr: `bpo-25135 <https://bugs.python.org/25135>`__: Make deque_clear() safer by emptying the deque before clearing. This helps avoid possible reentrancy issues.

source: `bpo-19143 <https://bugs.python.org/issue19143>`__: platform module now reads Windows version from kernel32.dll to avoid compatibility shims.
fr: `bpo-19143 <https://bugs.python.org/19143>`__: platform module now reads Windows version from kernel32.dll to avoid compatibility shims.

source: `bpo-25092 <https://bugs.python.org/issue25092>`__: Fix datetime.strftime() failure when errno was already set to EINVAL.
fr: `bpo-25092 <https://bugs.python.org/25092>`__: Fix datetime.strftime() failure when errno was already set to EINVAL.

source: `bpo-23517 <https://bugs.python.org/issue23517>`__: Fix rounding in fromtimestamp() and utcfromtimestamp() methods of datetime.datetime: microseconds are now rounded to nearest with ties going to nearest even integer (ROUND_HALF_EVEN), instead of being rounding towards minus infinity (ROUND_FLOOR). It's important that these methods use the same rounding mode than datetime.timedelta to keep the property: (datetime(1970,1,1) + timedelta(seconds=t)) == datetime.utcfromtimestamp(t). It also the rounding mode used by round(float) for example.
fr: `bpo-23517 <https://bugs.python.org/23517>`__: Fix rounding in fromtimestamp() and utcfromtimestamp() methods of datetime.datetime: microseconds are now rounded to nearest with ties going to nearest even integer (ROUND_HALF_EVEN), instead of being rounding towards minus infinity (ROUND_FLOOR). It's important that these methods use the same rounding mode than datetime.timedelta to keep the property: (datetime(1970,1,1) + timedelta(seconds=t)) == datetime.utcfromtimestamp(t). It also the rounding mode used by round(float) for example.

source: `bpo-25155 <https://bugs.python.org/issue25155>`__: Fix datetime.datetime.now() and datetime.datetime.utcnow() on Windows to support date after year 2038. It was a regression introduced in Python 3.5.0.
fr: `bpo-25155 <https://bugs.python.org/25155>`__: Fix datetime.datetime.now() and datetime.datetime.utcnow() on Windows to support date after year 2038. It was a regression introduced in Python 3.5.0.

source: `bpo-25108 <https://bugs.python.org/issue25108>`__: Omitted internal frames in traceback functions print_stack(), format_stack(), and extract_stack() called without arguments.
fr: `bpo-25108 <https://bugs.python.org/25108>`__: Omitted internal frames in traceback functions print_stack(), format_stack(), and extract_stack() called without arguments.

source: `bpo-25118 <https://bugs.python.org/issue25118>`__: Fix a regression of Python 3.5.0 in os.waitpid() on Windows.
fr: `bpo-25118 <https://bugs.python.org/25118>`__: Fix a regression of Python 3.5.0 in os.waitpid() on Windows.

source: `bpo-24684 <https://bugs.python.org/issue24684>`__: socket.socket.getaddrinfo() now calls PyUnicode_AsEncodedString() instead of calling the encode() method of the host, to handle correctly custom string with an encode() method which doesn't return a byte string. The encoder of the IDNA codec is now called directly instead of calling the encode() method of the string.
fr: `bpo-24684 <https://bugs.python.org/24684>`__: socket.socket.getaddrinfo() now calls PyUnicode_AsEncodedString() instead of calling the encode() method of the host, to handle correctly custom string with an encode() method which doesn't return a byte string. The encoder of the IDNA codec is now called directly instead of calling the encode() method of the string.

source: `bpo-25060 <https://bugs.python.org/issue25060>`__: Correctly compute stack usage of the BUILD_MAP opcode.
fr: `bpo-25060 <https://bugs.python.org/25060>`__: Correctly compute stack usage of the BUILD_MAP opcode.

source: `bpo-24857 <https://bugs.python.org/issue24857>`__: Comparing call_args to a long sequence now correctly returns a boolean result instead of raising an exception. Patch by A Kaptur.
fr: `bpo-24857 <https://bugs.python.org/24857>`__: Comparing call_args to a long sequence now correctly returns a boolean result instead of raising an exception. Patch by A Kaptur.

source: `bpo-23144 <https://bugs.python.org/issue23144>`__: Make sure that HTMLParser.feed() returns all the data, even when convert_charrefs is True.
fr: `bpo-23144 <https://bugs.python.org/23144>`__: Make sure that HTMLParser.feed() returns all the data, even when convert_charrefs is True.

source: `bpo-24982 <https://bugs.python.org/issue24982>`__: shutil.make_archive() with the "zip" format now adds entries for directories (including empty directories) in ZIP file.
fr: `bpo-24982 <https://bugs.python.org/24982>`__: shutil.make_archive() with the "zip" format now adds entries for directories (including empty directories) in ZIP file.

source: `bpo-25019 <https://bugs.python.org/issue25019>`__: Fixed a crash caused by setting non-string key of expat parser. Based on patch by John Leitch.
fr: `bpo-25019 <https://bugs.python.org/25019>`__: Fixed a crash caused by setting non-string key of expat parser. Based on patch by John Leitch.
