Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-22818 <https://bugs.python.org/issue22818>`__: Splitting on a pattern that could match an empty string now raises a warning. Patterns that can only match empty strings are now rejected.
fr: `bpo-22818 <https://bugs.python.org/22818>`__: Splitting on a pattern that could match an empty string now raises a warning. Patterns that can only match empty strings are now rejected.

source: `bpo-23099 <https://bugs.python.org/issue23099>`__: Closing io.BytesIO with exported buffer is rejected now to prevent corrupting exported buffer.
fr: `bpo-23099 <https://bugs.python.org/23099>`__: Closing io.BytesIO with exported buffer is rejected now to prevent corrupting exported buffer.

source: `bpo-23326 <https://bugs.python.org/issue23326>`__: Removed __ne__ implementations. Since fixing default __ne__ implementation in `bpo-21408 <https://bugs.python.org/issue21408>`__ they are redundant.
fr: `bpo-23326 <https://bugs.python.org/23326>`__: Removed __ne__ implementations. Since fixing default __ne__ implementation in `issue #21408 <https://bugs.python.org/21408>`__ they are redundant.

source: `bpo-23363 <https://bugs.python.org/issue23363>`__: Fix possible overflow in itertools.permutations.
fr: `bpo-23363 <https://bugs.python.org/23363>`__: Fix possible overflow in itertools.permutations.

source: `bpo-23364 <https://bugs.python.org/issue23364>`__: Fix possible overflow in itertools.product.
fr: `bpo-23364 <https://bugs.python.org/23364>`__: Fix possible overflow in itertools.product.

source: `bpo-23366 <https://bugs.python.org/issue23366>`__: Fixed possible integer overflow in itertools.combinations.
fr: `bpo-23366 <https://bugs.python.org/23366>`__: Fixed possible integer overflow in itertools.combinations.

source: `bpo-23369 <https://bugs.python.org/issue23369>`__: Fixed possible integer overflow in _json.encode_basestring_ascii.
fr: `bpo-23369 <https://bugs.python.org/23369>`__: Fixed possible integer overflow in _json.encode_basestring_ascii.

source: `bpo-23353 <https://bugs.python.org/issue23353>`__: Fix the exception handling of generators in PyEval_EvalFrameEx(). At entry, save or swap the exception state even if PyEval_EvalFrameEx() is called with throwflag=0. At exit, the exception state is now always restored or swapped, not only if why is WHY_YIELD or WHY_RETURN. Patch co-written with Antoine Pitrou.
fr: `bpo-23353 <https://bugs.python.org/23353>`__: Fix the exception handling of generators in PyEval_EvalFrameEx(). At entry, save or swap the exception state even if PyEval_EvalFrameEx() is called with throwflag=0. At exit, the exception state is now always restored or swapped, not only if why is WHY_YIELD or WHY_RETURN. Patch co-written with Antoine Pitrou.

source: `bpo-14099 <https://bugs.python.org/issue14099>`__: Restored support of writing ZIP files to tellable but non-seekable streams.
fr: `bpo-14099 <https://bugs.python.org/14099>`__: Restored support of writing ZIP files to tellable but non-seekable streams.

source: `bpo-14099 <https://bugs.python.org/issue14099>`__: Writing to ZipFile and reading multiple ZipExtFiles is threadsafe now.
fr: `bpo-14099 <https://bugs.python.org/14099>`__: Writing to ZipFile and reading multiple ZipExtFiles is threadsafe now.

source: `bpo-19361 <https://bugs.python.org/issue19361>`__: JSON decoder now raises JSONDecodeError instead of ValueError.
fr: `bpo-19361 <https://bugs.python.org/19361>`__: JSON decoder now raises JSONDecodeError instead of ValueError.

source: `bpo-18518 <https://bugs.python.org/issue18518>`__: timeit now rejects statements which can't be compiled outside a function or a loop (e.g. "return" or "break").
fr: `bpo-18518 <https://bugs.python.org/18518>`__: timeit now rejects statements which can't be compiled outside a function or a loop (e.g. "return" or "break").

source: `bpo-23094 <https://bugs.python.org/issue23094>`__: Fixed readline with frames in Python implementation of pickle.
fr: `bpo-23094 <https://bugs.python.org/23094>`__: Fixed readline with frames in Python implementation of pickle.

source: `bpo-23268 <https://bugs.python.org/issue23268>`__: Fixed bugs in the comparison of ipaddress classes.
fr: `bpo-23268 <https://bugs.python.org/23268>`__: Fixed bugs in the comparison of ipaddress classes.

source: `bpo-21408 <https://bugs.python.org/issue21408>`__: Removed incorrect implementations of __ne__() which didn't returned NotImplemented if __eq__() returned NotImplemented. The default __ne__() now works correctly.
fr: `bpo-21408 <https://bugs.python.org/21408>`__: Removed incorrect implementations of __ne__() which didn't returned NotImplemented if __eq__() returned NotImplemented. The default __ne__() now works correctly.

source: `bpo-19996 <https://bugs.python.org/issue19996>`__: :class:`email.feedparser.FeedParser` now handles (malformed) headers with no key rather than assuming the body has started.
fr: `bpo-19996 <https://bugs.python.org/19996>`__: :class:`email.feedparser.FeedParser` now handles (malformed) headers with no key rather than assuming the body has started.

source: `bpo-20188 <https://bugs.python.org/issue20188>`__: Support Application-Layer Protocol Negotiation (ALPN) in the ssl module.
fr: `bpo-20188 <https://bugs.python.org/20188>`__: Support Application-Layer Protocol Negotiation (ALPN) in the ssl module.

source: `bpo-23133 <https://bugs.python.org/issue23133>`__: Pickling of ipaddress objects now produces more compact and portable representation.
fr: `bpo-23133 <https://bugs.python.org/23133>`__: Pickling of ipaddress objects now produces more compact and portable representation.

source: `bpo-23248 <https://bugs.python.org/issue23248>`__: Update ssl error codes from latest OpenSSL git master.
fr: `bpo-23248 <https://bugs.python.org/23248>`__: Update ssl error codes from latest OpenSSL git master.

source: `bpo-23266 <https://bugs.python.org/issue23266>`__: Much faster implementation of ipaddress.collapse_addresses() when there are many non-consecutive addresses.
fr: `bpo-23266 <https://bugs.python.org/23266>`__: Much faster implementation of ipaddress.collapse_addresses() when there are many non-consecutive addresses.

source: `bpo-23098 <https://bugs.python.org/issue23098>`__: 64-bit dev_t is now supported in the os module.
fr: `bpo-23098 <https://bugs.python.org/23098>`__: 64-bit dev_t is now supported in the os module.

source: `bpo-21817 <https://bugs.python.org/issue21817>`__: When an exception is raised in a task submitted to a ProcessPoolExecutor, the remote traceback is now displayed in the parent process. Patch by Claudiu Popa.
fr: `bpo-21817 <https://bugs.python.org/21817>`__: When an exception is raised in a task submitted to a ProcessPoolExecutor, the remote traceback is now displayed in the parent process. Patch by Claudiu Popa.

source: `bpo-15955 <https://bugs.python.org/issue15955>`__: Add an option to limit output size when decompressing LZMA data. Patch by Nikolaus Rath and Martin Panter.
fr: `bpo-15955 <https://bugs.python.org/15955>`__: Add an option to limit output size when decompressing LZMA data. Patch by Nikolaus Rath and Martin Panter.

source: `bpo-23250 <https://bugs.python.org/issue23250>`__: In the http.cookies module, capitalize "HttpOnly" and "Secure" as they are written in the standard.
fr: `bpo-23250 <https://bugs.python.org/23250>`__: In the http.cookies module, capitalize "HttpOnly" and "Secure" as they are written in the standard.

source: `bpo-23063 <https://bugs.python.org/issue23063>`__: In the disutils' check command, fix parsing of reST with code or code-block directives.
fr: `bpo-23063 <https://bugs.python.org/23063>`__: In the disutils' check command, fix parsing of reST with code or code-block directives.

source: `bpo-23209 <https://bugs.python.org/issue23209>`__, #23225: selectors.BaseSelector.get_key() now raises a RuntimeError if the selector is closed. And selectors.BaseSelector.close() now clears its internal reference to the selector mapping to break a reference cycle. Initial patch written by Martin Richard.
fr: `bpo-23209 <https://bugs.python.org/23209>`__, #23225: selectors.BaseSelector.get_key() now raises a RuntimeError if the selector is closed. And selectors.BaseSelector.close() now clears its internal reference to the selector mapping to break a reference cycle. Initial patch written by Martin Richard.

source: `bpo-17911 <https://bugs.python.org/issue17911>`__: Provide a way to seed the linecache for a PEP-302 module without actually loading the code.
fr: `bpo-17911 <https://bugs.python.org/17911>`__: Provide a way to seed the linecache for a PEP-302 module without actually loading the code.

source: `bpo-17911 <https://bugs.python.org/issue17911>`__: Provide a new object API for traceback, including the ability to not lookup lines at all until the traceback is actually rendered, without any trace of the original objects being kept alive.
fr: `bpo-17911 <https://bugs.python.org/17911>`__: Provide a new object API for traceback, including the ability to not lookup lines at all until the traceback is actually rendered, without any trace of the original objects being kept alive.

source: `bpo-19777 <https://bugs.python.org/issue19777>`__: Provide a home() classmethod on Path objects. Contributed by Victor Salgado and Mayank Tripathi.
fr: `bpo-19777 <https://bugs.python.org/19777>`__: Provide a home() classmethod on Path objects. Contributed by Victor Salgado and Mayank Tripathi.

source: `bpo-23206 <https://bugs.python.org/issue23206>`__: Make ``json.dumps(..., ensure_ascii=False)`` as fast as the default case of ``ensure_ascii=True``. Patch by Naoki Inada.
fr: `bpo-23206 <https://bugs.python.org/23206>`__: Make ``json.dumps(..., ensure_ascii=False)`` as fast as the default case of ``ensure_ascii=True``. Patch by Naoki Inada.

source: `bpo-23185 <https://bugs.python.org/issue23185>`__: Add math.inf and math.nan constants.
fr: `bpo-23185 <https://bugs.python.org/23185>`__: Add math.inf and math.nan constants.

source: `bpo-23186 <https://bugs.python.org/issue23186>`__: Add ssl.SSLObject.shared_ciphers() and ssl.SSLSocket.shared_ciphers() to fetch the client's list ciphers sent at handshake.
fr: `bpo-23186 <https://bugs.python.org/23186>`__: Add ssl.SSLObject.shared_ciphers() and ssl.SSLSocket.shared_ciphers() to fetch the client's list ciphers sent at handshake.

source: `bpo-23143 <https://bugs.python.org/issue23143>`__: Remove compatibility with OpenSSLs older than 0.9.8.
fr: `bpo-23143 <https://bugs.python.org/23143>`__: Remove compatibility with OpenSSLs older than 0.9.8.

source: `bpo-23132 <https://bugs.python.org/issue23132>`__: Improve performance and introspection support of comparison methods created by functool.total_ordering.
fr: `bpo-23132 <https://bugs.python.org/23132>`__: Improve performance and introspection support of comparison methods created by functool.total_ordering.

source: `bpo-19776 <https://bugs.python.org/issue19776>`__: Add an expanduser() method on Path objects.
fr: `bpo-19776 <https://bugs.python.org/19776>`__: Add an expanduser() method on Path objects.

source: `bpo-23112 <https://bugs.python.org/issue23112>`__: Fix SimpleHTTPServer to correctly carry the query string and fragment when it redirects to add a trailing slash.
fr: `bpo-23112 <https://bugs.python.org/23112>`__: Fix SimpleHTTPServer to correctly carry the query string and fragment when it redirects to add a trailing slash.

source: `bpo-21793 <https://bugs.python.org/issue21793>`__: Added http.HTTPStatus enums (i.e. HTTPStatus.OK, HTTPStatus.NOT_FOUND). Patch by Demian Brecht.
fr: `bpo-21793 <https://bugs.python.org/21793>`__: Added http.HTTPStatus enums (i.e. HTTPStatus.OK, HTTPStatus.NOT_FOUND). Patch by Demian Brecht.

source: `bpo-23093 <https://bugs.python.org/issue23093>`__: In the io, module allow more operations to work on detached streams.
fr: `bpo-23093 <https://bugs.python.org/23093>`__: In the io, module allow more operations to work on detached streams.

source: `bpo-23111 <https://bugs.python.org/issue23111>`__: In the ftplib, make ssl.PROTOCOL_SSLv23 the default protocol version.
fr: `bpo-23111 <https://bugs.python.org/23111>`__: In the ftplib, make ssl.PROTOCOL_SSLv23 the default protocol version.

source: `bpo-22585 <https://bugs.python.org/issue22585>`__: On OpenBSD 5.6 and newer, os.urandom() now calls getentropy(), instead of reading /dev/urandom, to get pseudo-random bytes.
fr: `bpo-22585 <https://bugs.python.org/22585>`__: On OpenBSD 5.6 and newer, os.urandom() now calls getentropy(), instead of reading /dev/urandom, to get pseudo-random bytes.

source: `bpo-19104 <https://bugs.python.org/issue19104>`__: pprint now produces evaluable output for wrapped strings.
fr: `bpo-19104 <https://bugs.python.org/19104>`__: pprint now produces evaluable output for wrapped strings.

source: `bpo-23071 <https://bugs.python.org/issue23071>`__: Added missing names to codecs.__all__. Patch by Martin Panter.
fr: `bpo-23071 <https://bugs.python.org/23071>`__: Added missing names to codecs.__all__. Patch by Martin Panter.

source: `bpo-22783 <https://bugs.python.org/issue22783>`__: Pickling now uses the NEWOBJ opcode instead of the NEWOBJ_EX opcode if possible.
fr: `bpo-22783 <https://bugs.python.org/22783>`__: Pickling now uses the NEWOBJ opcode instead of the NEWOBJ_EX opcode if possible.

source: `bpo-15513 <https://bugs.python.org/issue15513>`__: Added a __sizeof__ implementation for pickle classes.
fr: `bpo-15513 <https://bugs.python.org/15513>`__: Added a __sizeof__ implementation for pickle classes.

source: `bpo-19858 <https://bugs.python.org/issue19858>`__: pickletools.optimize() now aware of the MEMOIZE opcode, can produce more compact result and no longer produces invalid output if input data contains MEMOIZE opcodes together with PUT or BINPUT opcodes.
fr: `bpo-19858 <https://bugs.python.org/19858>`__: pickletools.optimize() now aware of the MEMOIZE opcode, can produce more compact result and no longer produces invalid output if input data contains MEMOIZE opcodes together with PUT or BINPUT opcodes.

source: `bpo-22095 <https://bugs.python.org/issue22095>`__: Fixed HTTPConnection.set_tunnel with default port. The port value in the host header was set to "None". Patch by Demian Brecht.
fr: `bpo-22095 <https://bugs.python.org/22095>`__: Fixed HTTPConnection.set_tunnel with default port. The port value in the host header was set to "None". Patch by Demian Brecht.

source: `bpo-23016 <https://bugs.python.org/issue23016>`__: A warning no longer produces an AttributeError when the program is run with pythonw.exe.
fr: `bpo-23016 <https://bugs.python.org/23016>`__: A warning no longer produces an AttributeError when the program is run with pythonw.exe.

source: `bpo-21775 <https://bugs.python.org/issue21775>`__: shutil.copytree(): fix crash when copying to VFAT. An exception handler assumed that OSError objects always have a 'winerror' attribute. That is not the case, so the exception handler itself raised AttributeError when run on Linux (and, presumably, any other non-Windows OS). Patch by Greg Ward.
fr: `bpo-21775 <https://bugs.python.org/21775>`__: shutil.copytree(): fix crash when copying to VFAT. An exception handler assumed that OSError objects always have a 'winerror' attribute. That is not the case, so the exception handler itself raised AttributeError when run on Linux (and, presumably, any other non-Windows OS). Patch by Greg Ward.

source: `bpo-1218234 <https://bugs.python.org/issue1218234>`__: Fix inspect.getsource() to load updated source of reloaded module. Initial patch by Berker Peksag.
fr: `bpo-1218234 <https://bugs.python.org/1218234>`__: Fix inspect.getsource() to load updated source of reloaded module. Initial patch by Berker Peksag.

source: `bpo-21740 <https://bugs.python.org/issue21740>`__: Support wrapped callables in doctest. Patch by Claudiu Popa.
fr: `bpo-21740 <https://bugs.python.org/21740>`__: Support wrapped callables in doctest. Patch by Claudiu Popa.

source: `bpo-23009 <https://bugs.python.org/issue23009>`__: Make sure selectors.EpollSelecrtor.select() works when no FD is registered.
fr: `bpo-23009 <https://bugs.python.org/23009>`__: Make sure selectors.EpollSelecrtor.select() works when no FD is registered.

source: `bpo-22959 <https://bugs.python.org/issue22959>`__: In the constructor of http.client.HTTPSConnection, prefer the context's check_hostname attribute over the *check_hostname* parameter.
fr: `bpo-22959 <https://bugs.python.org/22959>`__: In the constructor of http.client.HTTPSConnection, prefer the context's check_hostname attribute over the *check_hostname* parameter.

source: `bpo-22696 <https://bugs.python.org/issue22696>`__: Add function :func:`sys.is_finalizing` to know about interpreter shutdown.
fr: `bpo-22696 <https://bugs.python.org/22696>`__: Add function :func:`sys.is_finalizing` to know about interpreter shutdown.

source: `bpo-16043 <https://bugs.python.org/issue16043>`__: Add a default limit for the amount of data xmlrpclib.gzip_decode will return. This resolves CVE-2013-1753.
fr: `bpo-16043 <https://bugs.python.org/16043>`__: Add a default limit for the amount of data xmlrpclib.gzip_decode will return. This resolves CVE-2013-1753.

source: `bpo-14099 <https://bugs.python.org/issue14099>`__: ZipFile.open() no longer reopen the underlying file. Objects returned by ZipFile.open() can now operate independently of the ZipFile even if the ZipFile was created by passing in a file-like object as the first argument to the constructor.
fr: `bpo-14099 <https://bugs.python.org/14099>`__: ZipFile.open() no longer reopen the underlying file. Objects returned by ZipFile.open() can now operate independently of the ZipFile even if the ZipFile was created by passing in a file-like object as the first argument to the constructor.

source: `bpo-22966 <https://bugs.python.org/issue22966>`__: Fix __pycache__ pyc file name clobber when pyc_compile is asked to compile a source file containing multiple dots in the source file name.
fr: `bpo-22966 <https://bugs.python.org/22966>`__: Fix __pycache__ pyc file name clobber when pyc_compile is asked to compile a source file containing multiple dots in the source file name.

source: `bpo-21971 <https://bugs.python.org/issue21971>`__: Update turtledemo doc and add module to the index.
fr: `bpo-21971 <https://bugs.python.org/21971>`__: Update turtledemo doc and add module to the index.

source: `bpo-21032 <https://bugs.python.org/issue21032>`__: Fixed socket leak if HTTPConnection.getresponse() fails. Original patch by Martin Panter.
fr: `bpo-21032 <https://bugs.python.org/21032>`__: Fixed socket leak if HTTPConnection.getresponse() fails. Original patch by Martin Panter.

source: `bpo-22407 <https://bugs.python.org/issue22407>`__: Deprecated the use of re.LOCALE flag with str patterns or re.ASCII. It was newer worked.
fr: `bpo-22407 <https://bugs.python.org/22407>`__: Deprecated the use of re.LOCALE flag with str patterns or re.ASCII. It was newer worked.

source: `bpo-22902 <https://bugs.python.org/issue22902>`__: The "ip" command is now used on Linux to determine MAC address in uuid.getnode(). Pach by Bruno Cauet.
fr: `bpo-22902 <https://bugs.python.org/22902>`__: The "ip" command is now used on Linux to determine MAC address in uuid.getnode(). Pach by Bruno Cauet.

source: `bpo-22960 <https://bugs.python.org/issue22960>`__: Add a context argument to xmlrpclib.ServerProxy constructor.
fr: `bpo-22960 <https://bugs.python.org/22960>`__: Add a context argument to xmlrpclib.ServerProxy constructor.

source: `bpo-22389 <https://bugs.python.org/issue22389>`__: Add contextlib.redirect_stderr().
fr: `bpo-22389 <https://bugs.python.org/22389>`__: Add contextlib.redirect_stderr().

source: `bpo-21356 <https://bugs.python.org/issue21356>`__: Make ssl.RAND_egd() optional to support LibreSSL. The availability of the function is checked during the compilation. Patch written by Bernard Spil.
fr: `bpo-21356 <https://bugs.python.org/21356>`__: Make ssl.RAND_egd() optional to support LibreSSL. The availability of the function is checked during the compilation. Patch written by Bernard Spil.

source: `bpo-22915 <https://bugs.python.org/issue22915>`__: SAX parser now supports files opened with file descriptor or bytes path.
fr: `bpo-22915 <https://bugs.python.org/22915>`__: SAX parser now supports files opened with file descriptor or bytes path.

source: `bpo-22609 <https://bugs.python.org/issue22609>`__: Constructors and update methods of mapping classes in the collections module now accept the self keyword argument.
fr: `bpo-22609 <https://bugs.python.org/22609>`__: Constructors and update methods of mapping classes in the collections module now accept the self keyword argument.

source: `bpo-22940 <https://bugs.python.org/issue22940>`__: Add readline.append_history_file.
fr: `bpo-22940 <https://bugs.python.org/22940>`__: Add readline.append_history_file.

source: `bpo-19676 <https://bugs.python.org/issue19676>`__: Added the "namereplace" error handler.
fr: `bpo-19676 <https://bugs.python.org/19676>`__: Added the "namereplace" error handler.

source: `bpo-22788 <https://bugs.python.org/issue22788>`__: Add *context* parameter to logging.handlers.HTTPHandler.
fr: `bpo-22788 <https://bugs.python.org/22788>`__: Add *context* parameter to logging.handlers.HTTPHandler.

source: `bpo-22921 <https://bugs.python.org/issue22921>`__: Allow SSLContext to take the *hostname* parameter even if OpenSSL doesn't support SNI.
fr: `bpo-22921 <https://bugs.python.org/22921>`__: Allow SSLContext to take the *hostname* parameter even if OpenSSL doesn't support SNI.

source: `bpo-22894 <https://bugs.python.org/issue22894>`__: TestCase.subTest() would cause the test suite to be stopped when in failfast mode, even in the absence of failures.
fr: `bpo-22894 <https://bugs.python.org/22894>`__: TestCase.subTest() would cause the test suite to be stopped when in failfast mode, even in the absence of failures.

source: `bpo-22796 <https://bugs.python.org/issue22796>`__: HTTP cookie parsing is now stricter, in order to protect against potential injection attacks.
fr: `bpo-22796 <https://bugs.python.org/22796>`__: HTTP cookie parsing is now stricter, in order to protect against potential injection attacks.

source: `bpo-22370 <https://bugs.python.org/issue22370>`__: Windows detection in pathlib is now more robust.
fr: `bpo-22370 <https://bugs.python.org/22370>`__: Windows detection in pathlib is now more robust.

source: `bpo-22841 <https://bugs.python.org/issue22841>`__: Reject coroutines in asyncio add_signal_handler(). Patch by Ludovic.Gasc.
fr: `bpo-22841 <https://bugs.python.org/22841>`__: Reject coroutines in asyncio add_signal_handler(). Patch by Ludovic.Gasc.

source: `bpo-19494 <https://bugs.python.org/issue19494>`__: Added urllib.request.HTTPBasicPriorAuthHandler. Patch by Matej Cepl.
fr: `bpo-19494 <https://bugs.python.org/19494>`__: Added urllib.request.HTTPBasicPriorAuthHandler. Patch by Matej Cepl.

source: `bpo-22578 <https://bugs.python.org/issue22578>`__: Added attributes to the re.error class.
fr: `bpo-22578 <https://bugs.python.org/22578>`__: Added attributes to the re.error class.

source: `bpo-22849 <https://bugs.python.org/issue22849>`__: Fix possible double free in the io.TextIOWrapper constructor.
fr: `bpo-22849 <https://bugs.python.org/22849>`__: Fix possible double free in the io.TextIOWrapper constructor.

source: `bpo-12728 <https://bugs.python.org/issue12728>`__: Different Unicode characters having the same uppercase but different lowercase are now matched in case-insensitive regular expressions.
fr: `bpo-12728 <https://bugs.python.org/12728>`__: Different Unicode characters having the same uppercase but different lowercase are now matched in case-insensitive regular expressions.
