Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-22189 <https://bugs.python.org/issue22189>`__: collections.UserString now supports __getnewargs__(), __rmod__(), casefold(), format_map(), isprintable(), and maketrans(). Patch by Joe Jevnik.
fr: `bpo-22189 <https://bugs.python.org/22189>`__: collections.UserString now supports __getnewargs__(), __rmod__(), casefold(), format_map(), isprintable(), and maketrans(). Patch by Joe Jevnik.

source: `bpo-24244 <https://bugs.python.org/issue24244>`__: Prevents termination when an invalid format string is encountered on Windows in strftime.
fr: `bpo-24244 <https://bugs.python.org/24244>`__: Prevents termination when an invalid format string is encountered on Windows in strftime.

source: `bpo-23973 <https://bugs.python.org/issue23973>`__: PEP 484: Add the typing module.
fr: `bpo-23973 <https://bugs.python.org/23973>`__: PEP 484: Add the typing module.

source: `bpo-23086 <https://bugs.python.org/issue23086>`__: The collections.abc.Sequence() abstract base class added *start* and *stop* parameters to the index() mixin. Patch by Devin Jeanpierre.
fr: `bpo-23086 <https://bugs.python.org/23086>`__: The collections.abc.Sequence() abstract base class added *start* and *stop* parameters to the index() mixin. Patch by Devin Jeanpierre.

source: `bpo-20035 <https://bugs.python.org/issue20035>`__: Replaced the ``tkinter._fix`` module used for setting up the Tcl/Tk environment on Windows with a private function in the ``_tkinter`` module that makes no permanent changes to the environment.
fr: `bpo-20035 <https://bugs.python.org/20035>`__: Replaced the ``tkinter._fix`` module used for setting up the Tcl/Tk environment on Windows with a private function in the ``_tkinter`` module that makes no permanent changes to the environment.

source: `bpo-24257 <https://bugs.python.org/issue24257>`__: Fixed segmentation fault in sqlite3.Row constructor with faked cursor type.
fr: `bpo-24257 <https://bugs.python.org/24257>`__: Fixed segmentation fault in sqlite3.Row constructor with faked cursor type.

source: `bpo-15836 <https://bugs.python.org/issue15836>`__: assertRaises(), assertRaisesRegex(), assertWarns() and assertWarnsRegex() assertments now check the type of the first argument to prevent possible user error. Based on patch by Daniel Wagner-Hall.
fr: `bpo-15836 <https://bugs.python.org/15836>`__: assertRaises(), assertRaisesRegex(), assertWarns() and assertWarnsRegex() assertments now check the type of the first argument to prevent possible user error. Based on patch by Daniel Wagner-Hall.

source: `bpo-9858 <https://bugs.python.org/issue9858>`__: Add missing method stubs to _io.RawIOBase. Patch by Laura Rupprecht.
fr: `bpo-9858 <https://bugs.python.org/9858>`__: Add missing method stubs to _io.RawIOBase. Patch by Laura Rupprecht.

source: `bpo-22955 <https://bugs.python.org/issue22955>`__: attrgetter, itemgetter and methodcaller objects in the operator module now support pickling. Added readable and evaluable repr for these objects. Based on patch by Josh Rosenberg.
fr: `bpo-22955 <https://bugs.python.org/22955>`__: attrgetter, itemgetter and methodcaller objects in the operator module now support pickling. Added readable and evaluable repr for these objects. Based on patch by Josh Rosenberg.

source: `bpo-22107 <https://bugs.python.org/issue22107>`__: tempfile.gettempdir() and tempfile.mkdtemp() now try again when a directory with the chosen name already exists on Windows as well as on Unix. tempfile.mkstemp() now fails early if parent directory is not valid (not exists or is a file) on Windows.
fr: `bpo-22107 <https://bugs.python.org/22107>`__: tempfile.gettempdir() and tempfile.mkdtemp() now try again when a directory with the chosen name already exists on Windows as well as on Unix. tempfile.mkstemp() now fails early if parent directory is not valid (not exists or is a file) on Windows.

source: `bpo-23780 <https://bugs.python.org/issue23780>`__: Improved error message in os.path.join() with single argument.
fr: `bpo-23780 <https://bugs.python.org/23780>`__: Improved error message in os.path.join() with single argument.

source: `bpo-6598 <https://bugs.python.org/issue6598>`__: Increased time precision and random number range in email.utils.make_msgid() to strengthen the uniqueness of the message ID.
fr: `bpo-6598 <https://bugs.python.org/6598>`__: Increased time precision and random number range in email.utils.make_msgid() to strengthen the uniqueness of the message ID.

source: `bpo-24091 <https://bugs.python.org/issue24091>`__: Fixed various crashes in corner cases in C implementation of ElementTree.
fr: `bpo-24091 <https://bugs.python.org/24091>`__: Fixed various crashes in corner cases in C implementation of ElementTree.

source: `bpo-21931 <https://bugs.python.org/issue21931>`__: msilib.FCICreate() now raises TypeError in the case of a bad argument instead of a ValueError with a bogus FCI error number. Patch by Jeffrey Armstrong.
fr: `bpo-21931 <https://bugs.python.org/21931>`__: msilib.FCICreate() now raises TypeError in the case of a bad argument instead of a ValueError with a bogus FCI error number. Patch by Jeffrey Armstrong.

source: `bpo-13866 <https://bugs.python.org/issue13866>`__: *quote_via* argument added to urllib.parse.urlencode.
fr: `bpo-13866 <https://bugs.python.org/13866>`__: *quote_via* argument added to urllib.parse.urlencode.

source: `bpo-20098 <https://bugs.python.org/issue20098>`__: New mangle_from policy option for email, default True for compat32, but False for all other policies.
fr: `bpo-20098 <https://bugs.python.org/20098>`__: New mangle_from policy option for email, default True for compat32, but False for all other policies.

source: `bpo-24211 <https://bugs.python.org/issue24211>`__: The email library now supports RFC 6532: it can generate headers using utf-8 instead of encoded words.
fr: `bpo-24211 <https://bugs.python.org/24211>`__: The email library now supports RFC 6532: it can generate headers using utf-8 instead of encoded words.

source: `bpo-16314 <https://bugs.python.org/issue16314>`__: Added support for the LZMA compression in distutils.
fr: `bpo-16314 <https://bugs.python.org/16314>`__: Added support for the LZMA compression in distutils.

source: `bpo-21804 <https://bugs.python.org/issue21804>`__: poplib now supports RFC 6856 (UTF8).
fr: `bpo-21804 <https://bugs.python.org/21804>`__: poplib now supports RFC 6856 (UTF8).

source: `bpo-18682 <https://bugs.python.org/issue18682>`__: Optimized pprint functions for builtin scalar types.
fr: `bpo-18682 <https://bugs.python.org/18682>`__: Optimized pprint functions for builtin scalar types.

source: `bpo-22027 <https://bugs.python.org/issue22027>`__: smtplib now supports RFC 6531 (SMTPUTF8).
fr: `bpo-22027 <https://bugs.python.org/22027>`__: smtplib now supports RFC 6531 (SMTPUTF8).

source: `bpo-23488 <https://bugs.python.org/issue23488>`__: Random generator objects now consume 2x less memory on 64-bit.
fr: `bpo-23488 <https://bugs.python.org/23488>`__: Random generator objects now consume 2x less memory on 64-bit.

source: `bpo-1322 <https://bugs.python.org/issue1322>`__: platform.dist() and platform.linux_distribution() functions are now deprecated. Initial patch by Vajrasky Kok.
fr: `bpo-1322 <https://bugs.python.org/1322>`__: platform.dist() and platform.linux_distribution() functions are now deprecated. Initial patch by Vajrasky Kok.

source: `bpo-22486 <https://bugs.python.org/issue22486>`__: Added the math.gcd() function. The fractions.gcd() function now is deprecated. Based on patch by Mark Dickinson.
fr: `bpo-22486 <https://bugs.python.org/22486>`__: Added the math.gcd() function. The fractions.gcd() function now is deprecated. Based on patch by Mark Dickinson.

source: `bpo-24064 <https://bugs.python.org/issue24064>`__: Property() docstrings are now writeable. (Patch by Berker Peksag.)
fr: `bpo-24064 <https://bugs.python.org/24064>`__: Property() docstrings are now writeable. (Patch by Berker Peksag.)

source: `bpo-22681 <https://bugs.python.org/issue22681>`__: Added support for the koi8_t encoding.
fr: `bpo-22681 <https://bugs.python.org/22681>`__: Added support for the koi8_t encoding.

source: `bpo-22682 <https://bugs.python.org/issue22682>`__: Added support for the kz1048 encoding.
fr: `bpo-22682 <https://bugs.python.org/22682>`__: Added support for the kz1048 encoding.

source: `bpo-23796 <https://bugs.python.org/issue23796>`__: peek and read1 methods of BufferedReader now raise ValueError if they called on a closed object. Patch by John Hergenroeder.
fr: `bpo-23796 <https://bugs.python.org/23796>`__: peek and read1 methods of BufferedReader now raise ValueError if they called on a closed object. Patch by John Hergenroeder.

source: `bpo-21795 <https://bugs.python.org/issue21795>`__: smtpd now supports the 8BITMIME extension whenever the new *decode_data* constructor argument is set to False.
fr: `bpo-21795 <https://bugs.python.org/21795>`__: smtpd now supports the 8BITMIME extension whenever the new *decode_data* constructor argument is set to False.

source: `bpo-24155 <https://bugs.python.org/issue24155>`__: optimize heapq.heapify() for better cache performance when heapifying large lists.
fr: `bpo-24155 <https://bugs.python.org/24155>`__: optimize heapq.heapify() for better cache performance when heapifying large lists.

source: `bpo-21800 <https://bugs.python.org/issue21800>`__: imaplib now supports RFC 5161 (enable), RFC 6855 (utf8/internationalized email) and automatically encodes non-ASCII usernames and passwords to UTF8.
fr: `bpo-21800 <https://bugs.python.org/21800>`__: imaplib now supports RFC 5161 (enable), RFC 6855 (utf8/internationalized email) and automatically encodes non-ASCII usernames and passwords to UTF8.

source: `bpo-20274 <https://bugs.python.org/issue20274>`__: When calling a _sqlite.Connection, it now complains if passed any keyword arguments. Previously it silently ignored them.
fr: `bpo-20274 <https://bugs.python.org/20274>`__: When calling a _sqlite.Connection, it now complains if passed any keyword arguments. Previously it silently ignored them.

source: `bpo-20274 <https://bugs.python.org/issue20274>`__: Remove ignored and erroneous "kwargs" parameters from three METH_VARARGS methods on _sqlite.Connection.
fr: `bpo-20274 <https://bugs.python.org/20274>`__: Remove ignored and erroneous "kwargs" parameters from three METH_VARARGS methods on _sqlite.Connection.

source: `bpo-24134 <https://bugs.python.org/issue24134>`__: assertRaises(), assertRaisesRegex(), assertWarns() and assertWarnsRegex() checks now emits a deprecation warning when callable is None or keyword arguments except msg is passed in the context manager mode.
fr: `bpo-24134 <https://bugs.python.org/24134>`__: assertRaises(), assertRaisesRegex(), assertWarns() and assertWarnsRegex() checks now emits a deprecation warning when callable is None or keyword arguments except msg is passed in the context manager mode.

source: `bpo-24018 <https://bugs.python.org/issue24018>`__: Add a collections.abc.Generator abstract base class. Contributed by Stefan Behnel.
fr: `bpo-24018 <https://bugs.python.org/24018>`__: Add a collections.abc.Generator abstract base class. Contributed by Stefan Behnel.

source: `bpo-23880 <https://bugs.python.org/issue23880>`__: Tkinter's getint() and getdouble() now support Tcl_Obj. Tkinter's getdouble() now supports any numbers (in particular int).
fr: `bpo-23880 <https://bugs.python.org/23880>`__: Tkinter's getint() and getdouble() now support Tcl_Obj. Tkinter's getdouble() now supports any numbers (in particular int).

source: `bpo-22619 <https://bugs.python.org/issue22619>`__: Added negative limit support in the traceback module. Based on patch by Dmitry Kazakov.
fr: `bpo-22619 <https://bugs.python.org/22619>`__: Added negative limit support in the traceback module. Based on patch by Dmitry Kazakov.

source: `bpo-24094 <https://bugs.python.org/issue24094>`__: Fix possible crash in json.encode with poorly behaved dict subclasses.
fr: `bpo-24094 <https://bugs.python.org/24094>`__: Fix possible crash in json.encode with poorly behaved dict subclasses.

source: `bpo-9246 <https://bugs.python.org/issue9246>`__: On POSIX, os.getcwd() now supports paths longer than 1025 bytes. Patch written by William Orr.
fr: `bpo-9246 <https://bugs.python.org/9246>`__: On POSIX, os.getcwd() now supports paths longer than 1025 bytes. Patch written by William Orr.

source: `bpo-17445 <https://bugs.python.org/issue17445>`__: add difflib.diff_bytes() to support comparison of byte strings (fixes a regression from Python 2).
fr: `bpo-17445 <https://bugs.python.org/17445>`__: add difflib.diff_bytes() to support comparison of byte strings (fixes a regression from Python 2).

source: `bpo-23917 <https://bugs.python.org/issue23917>`__: Fall back to sequential compilation when ProcessPoolExecutor doesn't exist. Patch by Claudiu Popa.
fr: `bpo-23917 <https://bugs.python.org/23917>`__: Fall back to sequential compilation when ProcessPoolExecutor doesn't exist. Patch by Claudiu Popa.

source: `bpo-23008 <https://bugs.python.org/issue23008>`__: Fixed resolving attributes with boolean value is False in pydoc.
fr: `bpo-23008 <https://bugs.python.org/23008>`__: Fixed resolving attributes with boolean value is False in pydoc.

source: `bpo-23908 <https://bugs.python.org/issue23908>`__: os functions now reject paths with embedded null character on Windows instead of silently truncating them.
fr: `bpo-23908 <https://bugs.python.org/23908>`__: os functions now reject paths with embedded null character on Windows instead of silently truncating them.

source: `bpo-23728 <https://bugs.python.org/issue23728>`__: binascii.crc_hqx() could return an integer outside of the range 0-0xffff for empty data.
fr: `bpo-23728 <https://bugs.python.org/23728>`__: binascii.crc_hqx() could return an integer outside of the range 0-0xffff for empty data.

source: `bpo-23887 <https://bugs.python.org/issue23887>`__: urllib.error.HTTPError now has a proper repr() representation. Patch by Berker Peksag.
fr: `bpo-23887 <https://bugs.python.org/23887>`__: urllib.error.HTTPError now has a proper repr() representation. Patch by Berker Peksag.

source: `bpo-24178 <https://bugs.python.org/issue24178>`__: asyncio.Lock, Condition, Semaphore, and BoundedSemaphore support new 'async with' syntax. Contributed by Yury Selivanov.
fr: `bpo-24178 <https://bugs.python.org/24178>`__: asyncio.Lock, Condition, Semaphore, and BoundedSemaphore support new 'async with' syntax. Contributed by Yury Selivanov.

source: `bpo-24179 <https://bugs.python.org/issue24179>`__: Support 'async for' for asyncio.StreamReader. Contributed by Yury Selivanov.
fr: `bpo-24179 <https://bugs.python.org/24179>`__: Support 'async for' for asyncio.StreamReader. Contributed by Yury Selivanov.

source: `bpo-24184 <https://bugs.python.org/issue24184>`__: Add AsyncIterator and AsyncIterable ABCs to collections.abc. Contributed by Yury Selivanov.
fr: `bpo-24184 <https://bugs.python.org/24184>`__: Add AsyncIterator and AsyncIterable ABCs to collections.abc. Contributed by Yury Selivanov.

source: `bpo-22547 <https://bugs.python.org/issue22547>`__: Implement informative __repr__ for inspect.BoundArguments. Contributed by Yury Selivanov.
fr: `bpo-22547 <https://bugs.python.org/22547>`__: Implement informative __repr__ for inspect.BoundArguments. Contributed by Yury Selivanov.

source: `bpo-24190 <https://bugs.python.org/issue24190>`__: Implement inspect.BoundArgument.apply_defaults() method. Contributed by Yury Selivanov.
fr: `bpo-24190 <https://bugs.python.org/24190>`__: Implement inspect.BoundArgument.apply_defaults() method. Contributed by Yury Selivanov.

source: `bpo-20691 <https://bugs.python.org/issue20691>`__: Add 'follow_wrapped' argument to inspect.Signature.from_callable() and inspect.signature(). Contributed by Yury Selivanov.
fr: `bpo-20691 <https://bugs.python.org/20691>`__: Add 'follow_wrapped' argument to inspect.Signature.from_callable() and inspect.signature(). Contributed by Yury Selivanov.

source: `bpo-24248 <https://bugs.python.org/issue24248>`__: Deprecate inspect.Signature.from_function() and inspect.Signature.from_builtin().
fr: `bpo-24248 <https://bugs.python.org/24248>`__: Deprecate inspect.Signature.from_function() and inspect.Signature.from_builtin().

source: `bpo-23898 <https://bugs.python.org/issue23898>`__: Fix inspect.classify_class_attrs() to support attributes with overloaded __eq__ and __bool__. Patch by Mike Bayer.
fr: `bpo-23898 <https://bugs.python.org/23898>`__: Fix inspect.classify_class_attrs() to support attributes with overloaded __eq__ and __bool__. Patch by Mike Bayer.

source: `bpo-24298 <https://bugs.python.org/issue24298>`__: Fix inspect.signature() to correctly unwrap wrappers around bound methods.
fr: `bpo-24298 <https://bugs.python.org/24298>`__: Fix inspect.signature() to correctly unwrap wrappers around bound methods.

source: `bpo-23184 <https://bugs.python.org/issue23184>`__: remove unused names and imports in idlelib. Initial patch by Al Sweigart.
fr: `bpo-23184 <https://bugs.python.org/23184>`__: remove unused names and imports in idlelib. Initial patch by Al Sweigart.

source: `bpo-21520 <https://bugs.python.org/issue21520>`__: test_zipfile no longer fails if the word 'bad' appears anywhere in the name of the current directory.
fr: `bpo-21520 <https://bugs.python.org/21520>`__: test_zipfile no longer fails if the word 'bad' appears anywhere in the name of the current directory.

source: `bpo-9517 <https://bugs.python.org/issue9517>`__: Move script_helper into the support package. Patch by Christie Wilson.
fr: `bpo-9517 <https://bugs.python.org/9517>`__: Move script_helper into the support package. Patch by Christie Wilson.

source: `bpo-22155 <https://bugs.python.org/issue22155>`__: Add File Handlers subsection with createfilehandler to tkinter doc. Remove obsolete example from FAQ. Patch by Martin Panter.
fr: `bpo-22155 <https://bugs.python.org/22155>`__: Add File Handlers subsection with createfilehandler to tkinter doc. Remove obsolete example from FAQ. Patch by Martin Panter.

source: `bpo-24029 <https://bugs.python.org/issue24029>`__: Document the name binding behavior for submodule imports.
fr: `bpo-24029 <https://bugs.python.org/24029>`__: Document the name binding behavior for submodule imports.

source: `bpo-24077 <https://bugs.python.org/issue24077>`__: Fix typo in man page for -I command option: -s, not -S
fr: `bpo-24077 <https://bugs.python.org/24077>`__: Fix typo in man page for -I command option: -s, not -S

source: `bpo-24000 <https://bugs.python.org/issue24000>`__: Improved Argument Clinic's mapping of converters to legacy "format units". Updated the documentation to match.
fr: `bpo-24000 <https://bugs.python.org/24000>`__: Improved Argument Clinic's mapping of converters to legacy "format units". Updated the documentation to match.

source: `bpo-24001 <https://bugs.python.org/issue24001>`__: Argument Clinic converters now use accept={type} instead of types={'type'} to specify the types the converter accepts.
fr: `bpo-24001 <https://bugs.python.org/24001>`__: Argument Clinic converters now use accept={type} instead of types={'type'} to specify the types the converter accepts.

source: `bpo-23330 <https://bugs.python.org/issue23330>`__: h2py now supports arbitrary filenames in #include.
fr: `bpo-23330 <https://bugs.python.org/23330>`__: h2py now supports arbitrary filenames in #include.

source: `bpo-24031 <https://bugs.python.org/issue24031>`__: make patchcheck now supports git checkouts, too.
fr: `bpo-24031 <https://bugs.python.org/24031>`__: make patchcheck now supports git checkouts, too.

source: `bpo-22980 <https://bugs.python.org/issue22980>`__: Under Linux, GNU/KFreeBSD and the Hurd, C extensions now include the architecture triplet in the extension name, to make it easy to test builds for different ABIs in the same working tree. Under OS X, the extension name now includes PEP 3149-style information.
fr: `bpo-22980 <https://bugs.python.org/22980>`__: Under Linux, GNU/KFreeBSD and the Hurd, C extensions now include the architecture triplet in the extension name, to make it easy to test builds for different ABIs in the same working tree. Under OS X, the extension name now includes PEP 3149-style information.

source: `bpo-22631 <https://bugs.python.org/issue22631>`__: Added Linux-specific socket constant CAN_RAW_FD_FRAMES. Patch courtesy of Joe Jevnik.
fr: `bpo-22631 <https://bugs.python.org/22631>`__: Added Linux-specific socket constant CAN_RAW_FD_FRAMES. Patch courtesy of Joe Jevnik.

source: `bpo-23731 <https://bugs.python.org/issue23731>`__: Implement PEP 488: removal of .pyo files.
fr: `bpo-23731 <https://bugs.python.org/23731>`__: Implement PEP 488: removal of .pyo files.

source: `bpo-23726 <https://bugs.python.org/issue23726>`__: Don't enable GC for user subclasses of non-GC types that don't add any new fields. Patch by Eugene Toder.
fr: `bpo-23726 <https://bugs.python.org/23726>`__: Don't enable GC for user subclasses of non-GC types that don't add any new fields. Patch by Eugene Toder.

source: `bpo-23309 <https://bugs.python.org/issue23309>`__: Avoid a deadlock at shutdown if a daemon thread is aborted while it is holding a lock to a buffered I/O object, and the main thread tries to use the same I/O object (typically stdout or stderr). A fatal error is emitted instead.
fr: `bpo-23309 <https://bugs.python.org/23309>`__: Avoid a deadlock at shutdown if a daemon thread is aborted while it is holding a lock to a buffered I/O object, and the main thread tries to use the same I/O object (typically stdout or stderr). A fatal error is emitted instead.

source: `bpo-22977 <https://bugs.python.org/issue22977>`__: Fixed formatting Windows error messages on Wine. Patch by Martin Panter.
fr: `bpo-22977 <https://bugs.python.org/22977>`__: Fixed formatting Windows error messages on Wine. Patch by Martin Panter.

source: `bpo-23466 <https://bugs.python.org/issue23466>`__: %c, %o, %x, and %X in bytes formatting now raise TypeError on non-integer input.
fr: `bpo-23466 <https://bugs.python.org/23466>`__: %c, %o, %x, and %X in bytes formatting now raise TypeError on non-integer input.

source: `bpo-24044 <https://bugs.python.org/issue24044>`__: Fix possible null pointer dereference in list.sort in out of memory conditions.
fr: `bpo-24044 <https://bugs.python.org/24044>`__: Fix possible null pointer dereference in list.sort in out of memory conditions.

source: `bpo-21354 <https://bugs.python.org/issue21354>`__: PyCFunction_New function is exposed by python DLL again.
fr: `bpo-21354 <https://bugs.python.org/21354>`__: PyCFunction_New function is exposed by python DLL again.

source: `bpo-23840 <https://bugs.python.org/issue23840>`__: tokenize.open() now closes the temporary binary file on error to fix a resource warning.
fr: `bpo-23840 <https://bugs.python.org/23840>`__: tokenize.open() now closes the temporary binary file on error to fix a resource warning.

source: `bpo-16914 <https://bugs.python.org/issue16914>`__: new debuglevel 2 in smtplib adds timestamps to debug output.
fr: `bpo-16914 <https://bugs.python.org/16914>`__: new debuglevel 2 in smtplib adds timestamps to debug output.

source: `bpo-7159 <https://bugs.python.org/issue7159>`__: urllib.request now supports sending auth credentials automatically after the first 401. This enhancement is a superset of the enhancement from `bpo-19494 <https://bugs.python.org/issue19494>`__ and supersedes that change.
fr: `bpo-7159 <https://bugs.python.org/7159>`__: urllib.request now supports sending auth credentials automatically after the first 401. This enhancement is a superset of the enhancement from `issue #19494 <https://bugs.python.org/19494>`__ and supersedes that change.
