Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: Changelog
fr: Changements

source: Library
fr: Bibliothèque

source: `bpo-25455 <https://bugs.python.org/issue25455>`__: Fixed crashes in repr of recursive buffered file-like objects.
fr: `bpo-25455 <https://bugs.python.org/25455>`__: Fixed crashes in repr of recursive ElementTree.Element and functools.partial objects.

source: `bpo-28214 <https://bugs.python.org/issue28214>`__: Improved exception reporting for problematic __set_name__ attributes.
fr: `bpo-28214 <https://bugs.python.org/28214>`__: Improved exception reporting for problematic __set_name__ attributes.

source: `bpo-23782 <https://bugs.python.org/issue23782>`__: Fixed possible memory leak in _PyTraceback_Add() and exception loss in PyTraceBack_Here().
fr: `bpo-23782 <https://bugs.python.org/23782>`__: Fixed possible memory leak in _PyTraceback_Add() and exception loss in PyTraceBack_Here().

source: `bpo-28471 <https://bugs.python.org/issue28471>`__: Fix "Python memory allocator called without holding the GIL" crash in socket.setblocking.
fr: `bpo-28471 <https://bugs.python.org/28471>`__: Fix "Python memory allocator called without holding the GIL" crash in socket.setblocking.

source: `bpo-18219 <https://bugs.python.org/issue18219>`__: Optimize csv.DictWriter for large number of columns. Patch by Mariatta Wijaya.
fr: `bpo-18219 <https://bugs.python.org/18219>`__: Optimize csv.DictWriter for large number of columns. Patch by Mariatta Wijaya.

source: `bpo-28448 <https://bugs.python.org/issue28448>`__: Fix C implemented asyncio.Future didn't work on Windows.
fr: `bpo-28448 <https://bugs.python.org/28448>`__: Fix C implemented asyncio.Future didn't work on Windows.

source: `bpo-28480 <https://bugs.python.org/issue28480>`__: Fix error building socket module when multithreading is disabled.
fr: `bpo-28480 <https://bugs.python.org/28480>`__: Fix error building socket module when multithreading is disabled.

source: `bpo-24452 <https://bugs.python.org/issue24452>`__: Make webbrowser support Chrome on Mac OS X.
fr: `bpo-24452 <https://bugs.python.org/24452>`__: Make webbrowser support Chrome on Mac OS X.

source: `bpo-20766 <https://bugs.python.org/issue20766>`__: Fix references leaked by pdb in the handling of SIGINT handlers.
fr: `bpo-20766 <https://bugs.python.org/20766>`__: Fix references leaked by pdb in the handling of SIGINT handlers.

source: `bpo-28492 <https://bugs.python.org/issue28492>`__: Fix how StopIteration exception is raised in _asyncio.Future.
fr: `bpo-28492 <https://bugs.python.org/28492>`__: Fix how StopIteration exception is raised in _asyncio.Future.

source: `bpo-28500 <https://bugs.python.org/issue28500>`__: Fix asyncio to handle async gens GC from another thread.
fr: `bpo-28500 <https://bugs.python.org/28500>`__: Fix asyncio to handle async gens GC from another thread.

source: `bpo-26923 <https://bugs.python.org/issue26923>`__: Fix asyncio.Gather to refuse being cancelled once all children are done. Patch by Johannes Ebke.
fr: `bpo-26923 <https://bugs.python.org/26923>`__: Fix asyncio.Gather to refuse being cancelled once all children are done. Patch by Johannes Ebke.

source: `bpo-26796 <https://bugs.python.org/issue26796>`__: Don't configure the number of workers for default threadpool executor. Initial patch by Hans Lawrenz.
fr: `bpo-26796 <https://bugs.python.org/26796>`__: Don't configure the number of workers for default threadpool executor. Initial patch by Hans Lawrenz.

source: `bpo-28208 <https://bugs.python.org/issue28208>`__: Update Windows build and OS X installers to use SQLite 3.14.2.
fr: `bpo-28208 <https://bugs.python.org/28208>`__: Update Windows build to use SQLite 3.14.2.0.

source: `bpo-26944 <https://bugs.python.org/issue26944>`__: Fix test_posix for Android where 'id -G' is entirely wrong or missing the effective gid.
fr: `bpo-26944 <https://bugs.python.org/26944>`__: Fix test_posix for Android where 'id -G' is entirely wrong or missing the effective gid.

source: `bpo-28409 <https://bugs.python.org/issue28409>`__: regrtest: fix the parser of command line arguments.
fr: `bpo-28409 <https://bugs.python.org/28409>`__: regrtest: fix the parser of command line arguments.

source: `bpo-28183 <https://bugs.python.org/issue28183>`__: Optimize and cleanup dict iteration.
fr: `bpo-28183 <https://bugs.python.org/28183>`__: Optimize and cleanup dict iteration.

source: `bpo-26081 <https://bugs.python.org/issue26081>`__: Added C implementation of asyncio.Future. Original patch by Yury Selivanov.
fr: `bpo-26081 <https://bugs.python.org/26081>`__: Added C implementation of asyncio.Future. Original patch by Yury Selivanov.

source: `bpo-28379 <https://bugs.python.org/issue28379>`__: Added sanity checks and tests for PyUnicode_CopyCharacters(). Patch by Xiang Zhang.
fr: `bpo-28379 <https://bugs.python.org/28379>`__: Added sanity checks and tests for PyUnicode_CopyCharacters(). Patch by Xiang Zhang.

source: `bpo-28376 <https://bugs.python.org/issue28376>`__: The type of long range iterator is now registered as Iterator. Patch by Oren Milman.
fr: `bpo-28376 <https://bugs.python.org/28376>`__: The type of long range iterator is now registered as Iterator. Patch by Oren Milman.

source: `bpo-28376 <https://bugs.python.org/issue28376>`__: Creating instances of range_iterator by calling range_iterator type now is deprecated. Patch by Oren Milman.
fr: `bpo-28376 <https://bugs.python.org/28376>`__: Creating instances of range_iterator by calling range_iterator type now is deprecated. Patch by Oren Milman.

source: `bpo-28376 <https://bugs.python.org/issue28376>`__: The constructor of range_iterator now checks that step is not 0. Patch by Oren Milman.
fr: `bpo-28376 <https://bugs.python.org/28376>`__: The constructor of range_iterator now checks that step is not 0. Patch by Oren Milman.

source: `bpo-26906 <https://bugs.python.org/issue26906>`__: Resolving special methods of uninitialized type now causes implicit initialization of the type instead of a fail.
fr: `bpo-26906 <https://bugs.python.org/26906>`__: Resolving special methods of uninitialized type now causes implicit initialization of the type instead of a fail.

source: `bpo-18287 <https://bugs.python.org/issue18287>`__: PyType_Ready() now checks that tp_name is not NULL. Original patch by Niklas Koep.
fr: `bpo-18287 <https://bugs.python.org/18287>`__: PyType_Ready() now checks that tp_name is not NULL. Original patch by Niklas Koep.

source: `bpo-24098 <https://bugs.python.org/issue24098>`__: Fixed possible crash when AST is changed in process of compiling it.
fr: `bpo-24098 <https://bugs.python.org/24098>`__: Fixed possible crash when AST is changed in process of compiling it.

source: `bpo-28201 <https://bugs.python.org/issue28201>`__: Dict reduces possibility of 2nd conflict in hash table when hashes have same lower bits.
fr: `bpo-28201 <https://bugs.python.org/28201>`__: Dict reduces possibility of 2nd conflict in hash table when hashes have same lower bits.

source: `bpo-28350 <https://bugs.python.org/issue28350>`__: String constants with null character no longer interned.
fr: `bpo-28350 <https://bugs.python.org/28350>`__: String constants with null character no longer interned.

source: `bpo-26617 <https://bugs.python.org/issue26617>`__: Fix crash when GC runs during weakref callbacks.
fr: `bpo-26617 <https://bugs.python.org/26617>`__: Fix crash when GC runs during weakref callbacks.

source: `bpo-27942 <https://bugs.python.org/issue27942>`__: String constants now interned recursively in tuples and frozensets.
fr: `bpo-27942 <https://bugs.python.org/27942>`__: String constants now interned recursively in tuples and frozensets.

source: `bpo-21578 <https://bugs.python.org/issue21578>`__: Fixed misleading error message when ImportError called with invalid keyword args.
fr: `bpo-21578 <https://bugs.python.org/21578>`__: Fixed misleading error message when ImportError called with invalid keyword args.

source: `bpo-28203 <https://bugs.python.org/issue28203>`__: Fix incorrect type in complex(1.0, {2:3}) error message. Patch by Soumya Sharma.
fr: `bpo-28203 <https://bugs.python.org/28203>`__: Fix incorrect type in complex(1.0, {2:3}) error message. Patch by Soumya Sharma.

source: `bpo-28086 <https://bugs.python.org/issue28086>`__: Single var-positional argument of tuple subtype was passed unscathed to the C-defined function. Now it is converted to exact tuple.
fr: `bpo-28086 <https://bugs.python.org/28086>`__: Single var-positional argument of tuple subtype was passed unscathed to the C-defined function. Now it is converted to exact tuple.

source: `bpo-28214 <https://bugs.python.org/issue28214>`__: Now __set_name__ is looked up on the class instead of the instance.
fr: `bpo-28214 <https://bugs.python.org/28214>`__: Now __set_name__ is looked up on the class instead of the instance.

source: `bpo-27955 <https://bugs.python.org/issue27955>`__: Fallback on reading /dev/urandom device when the getrandom() syscall fails with EPERM, for example when blocked by SECCOMP.
fr: `bpo-27955 <https://bugs.python.org/27955>`__: Fallback on reading /dev/urandom device when the getrandom() syscall fails with EPERM, for example when blocked by SECCOMP.

source: `bpo-28192 <https://bugs.python.org/issue28192>`__: Don't import readline in isolated mode.
fr: `bpo-28192 <https://bugs.python.org/28192>`__: Don't import readline in isolated mode.

source: `bpo-28131 <https://bugs.python.org/issue28131>`__: Fix a regression in zipimport's compile_source(). zipimport should use the same optimization level as the interpreter.
fr: `bpo-28131 <https://bugs.python.org/28131>`__: Fix a regression in zipimport's compile_source(). zipimport should use the same optimization level as the interpreter.

source: `bpo-28126 <https://bugs.python.org/issue28126>`__: Replace Py_MEMCPY with memcpy(). Visual Studio can properly optimize memcpy().
fr: `bpo-28126 <https://bugs.python.org/28126>`__: Replace Py_MEMCPY with memcpy(). Visual Studio can properly optimize memcpy().

source: `bpo-28120 <https://bugs.python.org/issue28120>`__: Fix dict.pop() for splitted dictionary when trying to remove a "pending key" (Not yet inserted in split-table). Patch by Xiang Zhang.
fr: `bpo-28120 <https://bugs.python.org/28120>`__: Fix dict.pop() for splitted dictionary when trying to remove a "pending key" (Not yet inserted in split-table). Patch by Xiang Zhang.

source: `bpo-26182 <https://bugs.python.org/issue26182>`__: Raise DeprecationWarning when async and await keywords are used as variable/attribute/class/function name.
fr: `bpo-26182 <https://bugs.python.org/26182>`__: Raise DeprecationWarning when async and await keywords are used as variable/attribute/class/function name.

source: `bpo-27998 <https://bugs.python.org/issue27998>`__: Fixed bytes path support in os.scandir() on Windows. Patch by Eryk Sun.
fr: `bpo-27998 <https://bugs.python.org/27998>`__: Fixed bytes path support in os.scandir() on Windows. Patch by Eryk Sun.

source: `bpo-28317 <https://bugs.python.org/issue28317>`__: The disassembler now decodes FORMAT_VALUE argument.
fr: `bpo-28317 <https://bugs.python.org/28317>`__: The disassembler now decodes FORMAT_VALUE argument.

source: `bpo-26293 <https://bugs.python.org/issue26293>`__: Fixed writing ZIP files that starts not from the start of the file. Offsets in ZIP file now are relative to the start of the archive in conforming to the specification.
fr: `bpo-26293 <https://bugs.python.org/26293>`__: Fixed writing ZIP files that starts not from the start of the file. Offsets in ZIP file now are relative to the start of the archive in conforming to the specification.

source: `bpo-28380 <https://bugs.python.org/issue28380>`__: unittest.mock Mock autospec functions now properly support assert_called, assert_not_called, and assert_called_once.
fr: `bpo-28380 <https://bugs.python.org/28380>`__: unittest.mock Mock autospec functions now properly support assert_called, assert_not_called, and assert_called_once.

source: `bpo-27181 <https://bugs.python.org/issue27181>`__ remove statistics.geometric_mean and defer until 3.7.
fr: `bpo-27181 <https://bugs.python.org/27181>`__ remove statistics.geometric_mean and defer until 3.7.

source: `bpo-28229 <https://bugs.python.org/issue28229>`__: lzma module now supports pathlib.
fr: `bpo-28229 <https://bugs.python.org/28229>`__: lzma module now supports pathlib.

source: `bpo-28321 <https://bugs.python.org/issue28321>`__: Fixed writing non-BMP characters with binary format in plistlib.
fr: `bpo-28321 <https://bugs.python.org/28321>`__: Fixed writing non-BMP characters with binary format in plistlib.

source: `bpo-28225 <https://bugs.python.org/issue28225>`__: bz2 module now supports pathlib. Initial patch by Ethan Furman.
fr: `bpo-28225 <https://bugs.python.org/28225>`__: bz2 module now supports pathlib. Initial patch by Ethan Furman.

source: `bpo-28227 <https://bugs.python.org/issue28227>`__: gzip now supports pathlib. Patch by Ethan Furman.
fr: `bpo-28227 <https://bugs.python.org/28227>`__: gzip now supports pathlib. Patch by Ethan Furman.

source: `bpo-27358 <https://bugs.python.org/issue27358>`__: Optimized merging var-keyword arguments and improved error message when passing a non-mapping as a var-keyword argument.
fr: `bpo-27358 <https://bugs.python.org/27358>`__: Optimized merging var-keyword arguments and improved error message when pass a non-mapping as a var-keyword argument.

source: `bpo-28257 <https://bugs.python.org/issue28257>`__: Improved error message when passing a non-iterable as a var-positional argument. Added opcode BUILD_TUPLE_UNPACK_WITH_CALL.
fr: `bpo-28257 <https://bugs.python.org/28257>`__: Improved error message when pass a non-iterable as a var-positional argument. Added opcode BUILD_TUPLE_UNPACK_WITH_CALL.

source: `bpo-28322 <https://bugs.python.org/issue28322>`__: Fixed possible crashes when unpickle itertools objects from incorrect pickle data. Based on patch by John Leitch.
fr: `bpo-28322 <https://bugs.python.org/28322>`__: Fixed possible crashes when unpickle itertools objects from incorrect pickle data. Based on patch by John Leitch.

source: `bpo-28228 <https://bugs.python.org/issue28228>`__: imghdr now supports pathlib.
fr: `bpo-28228 <https://bugs.python.org/28228>`__: imghdr now supports pathlib.

source: `bpo-28226 <https://bugs.python.org/issue28226>`__: compileall now supports pathlib.
fr: `bpo-28226 <https://bugs.python.org/28226>`__: compileall now supports pathlib.

source: `bpo-28314 <https://bugs.python.org/issue28314>`__: Fix function declaration (C flags) for the getiterator() method of xml.etree.ElementTree.Element.
fr: `bpo-28314 <https://bugs.python.org/28314>`__: Fix function declaration (C flags) for the getiterator() method of xml.etree.ElementTree.Element.

source: `bpo-28148 <https://bugs.python.org/issue28148>`__: Stop using localtime() and gmtime() in the time module.
fr: `bpo-28148 <https://bugs.python.org/28148>`__: Stop using localtime() and gmtime() in the time module.

source: `bpo-28253 <https://bugs.python.org/issue28253>`__: Fixed calendar functions for extreme months: 0001-01 and 9999-12.
fr: `bpo-28253 <https://bugs.python.org/28253>`__: Fixed calendar functions for extreme months: 0001-01 and 9999-12.

source: `bpo-28275 <https://bugs.python.org/issue28275>`__: Fixed possible use after free in the decompress() methods of the LZMADecompressor and BZ2Decompressor classes. Original patch by John Leitch.
fr: `bpo-28275 <https://bugs.python.org/28275>`__: Fixed possible use after free in the decompress() methods of the LZMADecompressor and BZ2Decompressor classes. Original patch by John Leitch.

source: `bpo-27897 <https://bugs.python.org/issue27897>`__: Fixed possible crash in sqlite3.Connection.create_collation() if pass invalid string-like object as a name. Patch by Xiang Zhang.
fr: `bpo-27897 <https://bugs.python.org/27897>`__: Fixed possible crash in sqlite3.Connection.create_collation() if pass invalid string-like object as a name. Patch by Xiang Zhang.

source: `bpo-18844 <https://bugs.python.org/issue18844>`__: random.choices() now has k as a keyword-only argument to improve the readability of common cases and come into line with the signature used in other languages.
fr: `bpo-18844 <https://bugs.python.org/18844>`__: random.choices() now has k as a keyword-only argument to improve the readability of common cases and the come into line with the signature used in other languages.

source: `bpo-18893 <https://bugs.python.org/issue18893>`__: Fix invalid exception handling in Lib/ctypes/macholib/dyld.py. Patch by Madison May.
fr: `bpo-18893 <https://bugs.python.org/18893>`__: Fix invalid exception handling in Lib/ctypes/macholib/dyld.py. Patch by Madison May.

source: `bpo-27611 <https://bugs.python.org/issue27611>`__: Fixed support of default root window in the tkinter.tix module. Added the master parameter in the DisplayStyle constructor.
fr: `bpo-27611 <https://bugs.python.org/27611>`__: Fixed support of default root window in the tkinter.tix module. Added the master parameter in the DisplayStyle constructor.

source: `bpo-27348 <https://bugs.python.org/issue27348>`__: In the traceback module, restore the formatting of exception messages like "Exception: None". This fixes a regression introduced in 3.5a2.
fr: `bpo-27348 <https://bugs.python.org/27348>`__: In the traceback module, restore the formatting of exception messages like "Exception: None". This fixes a regression introduced in 3.5a2.

source: `bpo-25651 <https://bugs.python.org/issue25651>`__: Allow falsy values to be used for msg parameter of subTest().
fr: `bpo-25651 <https://bugs.python.org/25651>`__: Allow falsy values to be used for msg parameter of subTest().

source: `bpo-27778 <https://bugs.python.org/issue27778>`__: Fix a memory leak in os.getrandom() when the getrandom() is interrupted by a signal and a signal handler raises a Python exception.
fr: `bpo-27778 <https://bugs.python.org/27778>`__: Fix a memory leak in os.getrandom() when the getrandom() is interrupted by a signal and a signal handler raises a Python exception.

source: `bpo-28200 <https://bugs.python.org/issue28200>`__: Fix memory leak on Windows in the os module (fix path_converter() function).
fr: `bpo-28200 <https://bugs.python.org/28200>`__: Fix memory leak on Windows in the os module (fix path_converter() function).

source: `bpo-25400 <https://bugs.python.org/issue25400>`__: RobotFileParser now correctly returns default values for crawl_delay and request_rate. Initial patch by Peter Wirtz.
fr: `bpo-25400 <https://bugs.python.org/25400>`__: RobotFileParser now correctly returns default values for crawl_delay and request_rate. Initial patch by Peter Wirtz.

source: `bpo-27932 <https://bugs.python.org/issue27932>`__: Prevent memory leak in win32_ver().
fr: `bpo-27932 <https://bugs.python.org/27932>`__: Prevent memory leak in win32_ver().

source: `bpo-28075 <https://bugs.python.org/issue28075>`__: Check for ERROR_ACCESS_DENIED in Windows implementation of os.stat(). Patch by Eryk Sun.
fr: `bpo-28075 <https://bugs.python.org/28075>`__: Check for ERROR_ACCESS_DENIED in Windows implementation of os.stat(). Patch by Eryk Sun.

source: `bpo-22493 <https://bugs.python.org/issue22493>`__: Warning message emitted by using inline flags in the middle of regular expression now contains a (truncated) regex pattern. Patch by Tim Graham.
fr: `bpo-22493 <https://bugs.python.org/22493>`__: Warning message emitted by using inline flags in the middle of regular expression now contains a (truncated) regex pattern. Patch by Tim Graham.

source: `bpo-25270 <https://bugs.python.org/issue25270>`__: Prevent codecs.escape_encode() from raising SystemError when an empty bytestring is passed.
fr: `bpo-25270 <https://bugs.python.org/25270>`__: Prevent codecs.escape_encode() from raising SystemError when an empty bytestring is passed.

source: `bpo-28181 <https://bugs.python.org/issue28181>`__: Get antigravity over HTTPS. Patch by Kaartic Sivaraam.
fr: `bpo-28181 <https://bugs.python.org/28181>`__: Get antigravity over HTTPS. Patch by Kaartic Sivaraam.

source: `bpo-25895 <https://bugs.python.org/issue25895>`__: Enable WebSocket URL schemes in urllib.parse.urljoin. Patch by Gergely Imreh and Markus Holtermann.
fr: `bpo-25895 <https://bugs.python.org/25895>`__: Enable WebSocket URL schemes in urllib.parse.urljoin. Patch by Gergely Imreh and Markus Holtermann.

source: `bpo-28114 <https://bugs.python.org/issue28114>`__: Fix a crash in parse_envlist() when env contains byte strings. Patch by Eryk Sun.
fr: `bpo-28114 <https://bugs.python.org/28114>`__: Fix a crash in parse_envlist() when env contains byte strings. Patch by Eryk Sun.

source: `bpo-27599 <https://bugs.python.org/issue27599>`__: Fixed buffer overrun in binascii.b2a_qp() and binascii.a2b_qp().
fr: `bpo-27599 <https://bugs.python.org/27599>`__: Fixed buffer overrun in binascii.b2a_qp() and binascii.a2b_qp().

source: `bpo-27906 <https://bugs.python.org/issue27906>`__: Fix socket accept exhaustion during high TCP traffic. Patch by Kevin Conway.
fr: `bpo-27906 <https://bugs.python.org/27906>`__: Fix socket accept exhaustion during high TCP traffic. Patch by Kevin Conway.

source: `bpo-28174 <https://bugs.python.org/issue28174>`__: Handle when SO_REUSEPORT isn't properly supported. Patch by Seth Michael Larson.
fr: `bpo-28174 <https://bugs.python.org/28174>`__: Handle when SO_REUSEPORT isn't properly supported. Patch by Seth Michael Larson.

source: `bpo-26654 <https://bugs.python.org/issue26654>`__: Inspect functools.partial in asyncio.Handle.__repr__. Patch by iceboy.
fr: `bpo-26654 <https://bugs.python.org/26654>`__: Inspect functools.partial in asyncio.Handle.__repr__. Patch by iceboy.

source: `bpo-26909 <https://bugs.python.org/issue26909>`__: Fix slow pipes IO in asyncio. Patch by INADA Naoki.
fr: `bpo-26909 <https://bugs.python.org/26909>`__: Fix slow pipes IO in asyncio. Patch by INADA Naoki.

source: `bpo-28176 <https://bugs.python.org/issue28176>`__: Fix callbacks race in asyncio.SelectorLoop.sock_connect.
fr: `bpo-28176 <https://bugs.python.org/28176>`__: Fix callbacks race in asyncio.SelectorLoop.sock_connect.

source: `bpo-27759 <https://bugs.python.org/issue27759>`__: Fix selectors incorrectly retain invalid file descriptors. Patch by Mark Williams.
fr: `bpo-27759 <https://bugs.python.org/27759>`__: Fix selectors incorrectly retain invalid file descriptors. Patch by Mark Williams.

source: `bpo-28368 <https://bugs.python.org/issue28368>`__: Refuse monitoring processes if the child watcher has no loop attached. Patch by Vincent Michel.
fr: `bpo-28368 <https://bugs.python.org/28368>`__: Refuse monitoring processes if the child watcher has no loop attached. Patch by Vincent Michel.

source: `bpo-28369 <https://bugs.python.org/issue28369>`__: Raise RuntimeError when transport's FD is used with add_reader, add_writer, etc.
fr: `bpo-28369 <https://bugs.python.org/28369>`__: Raise RuntimeError when transport's FD is used with add_reader, add_writer, etc.

source: `bpo-28370 <https://bugs.python.org/issue28370>`__: Speedup asyncio.StreamReader.readexactly. Patch by Коренберг Марк.
fr: `bpo-28370 <https://bugs.python.org/28370>`__: Speedup asyncio.StreamReader.readexactly. Patch by Коренберг Марк.

source: `bpo-28371 <https://bugs.python.org/issue28371>`__: Deprecate passing asyncio.Handles to run_in_executor.
fr: `bpo-28371 <https://bugs.python.org/28371>`__: Deprecate passing asyncio.Handles to run_in_executor.

source: `bpo-28372 <https://bugs.python.org/issue28372>`__: Fix asyncio to support formatting of non-python coroutines.
fr: `bpo-28372 <https://bugs.python.org/28372>`__: Fix asyncio to support formatting of non-python coroutines.
