Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-20817 <https://bugs.python.org/issue20817>`__: Fix inspect.getcallargs() to fail correctly if more than 3 arguments are missing. Patch by Jeremiah Lowin.
fr: `bpo-20817 <https://bugs.python.org/20817>`__: Fix inspect.getcallargs() to fail correctly if more than 3 arguments are missing. Patch by Jeremiah Lowin.

source: `bpo-6676 <https://bugs.python.org/issue6676>`__: Ensure a meaningful exception is raised when attempting to parse more than one XML document per pyexpat xmlparser instance. (Original patches by Hirokazu Yamamoto and Amaury Forgeot d'Arc, with suggested wording by David Gutteridge)
fr: `bpo-6676 <https://bugs.python.org/6676>`__: Ensure a meaningful exception is raised when attempting to parse more than one XML document per pyexpat xmlparser instance. (Original patches by Hirokazu Yamamoto and Amaury Forgeot d'Arc, with suggested wording by David Gutteridge)

source: `bpo-21117 <https://bugs.python.org/issue21117>`__: Fix inspect.signature to better support functools.partial. Due to the specifics of functools.partial implementation, positional-or-keyword arguments passed as keyword arguments become keyword-only.
fr: `bpo-21117 <https://bugs.python.org/21117>`__: Fix inspect.signature to better support functools.partial. Due to the specifics of functools.partial implementation, positional-or-keyword arguments passed as keyword arguments become keyword-only.

source: `bpo-20334 <https://bugs.python.org/issue20334>`__: inspect.Signature and inspect.Parameter are now hashable. Thanks to Antony Lee for bug reports and suggestions.
fr: `bpo-20334 <https://bugs.python.org/20334>`__: inspect.Signature and inspect.Parameter are now hashable. Thanks to Antony Lee for bug reports and suggestions.

source: `bpo-15916 <https://bugs.python.org/issue15916>`__: doctest.DocTestSuite returns an empty unittest.TestSuite instead of raising ValueError if it finds no tests
fr: `bpo-15916 <https://bugs.python.org/15916>`__: doctest.DocTestSuite returns an empty unittest.TestSuite instead of raising ValueError if it finds no tests

source: `bpo-21209 <https://bugs.python.org/issue21209>`__: Fix asyncio.tasks.CoroWrapper to workaround a bug in yield-from implementation in CPythons prior to 3.4.1.
fr: `bpo-21209 <https://bugs.python.org/21209>`__: Fix asyncio.tasks.CoroWrapper to workaround a bug in yield-from implementation in CPythons prior to 3.4.1.

source: `bpo-21311 <https://bugs.python.org/issue21311>`__: Avoid exception in _osx_support with non-standard compiler configurations. Patch by John Szakmeister.
fr: `bpo-21311 <https://bugs.python.org/21311>`__: Avoid exception in _osx_support with non-standard compiler configurations. Patch by John Szakmeister.

source: `bpo-11571 <https://bugs.python.org/issue11571>`__: Ensure that the turtle window becomes the topmost window when launched on OS X.
fr: `bpo-11571 <https://bugs.python.org/11571>`__: Ensure that the turtle window becomes the topmost window when launched on OS X.

source: `bpo-21801 <https://bugs.python.org/issue21801>`__: Validate that __signature__ is None or an instance of Signature.
fr: `bpo-21801 <https://bugs.python.org/21801>`__: Validate that __signature__ is None or an instance of Signature.

source: `bpo-21923 <https://bugs.python.org/issue21923>`__: Prevent AttributeError in distutils.sysconfig.customize_compiler due to possible uninitialized _config_vars.
fr: `bpo-21923 <https://bugs.python.org/21923>`__: Prevent AttributeError in distutils.sysconfig.customize_compiler due to possible uninitialized _config_vars.

source: `bpo-21323 <https://bugs.python.org/issue21323>`__: Fix http.server to again handle scripts in CGI subdirectories, broken by the fix for security `bpo-19435 <https://bugs.python.org/issue19435>`__. Patch by Zach Byrne.
fr: `bpo-21323 <https://bugs.python.org/21323>`__: Fix http.server to again handle scripts in CGI subdirectories, broken by the fix for security `issue #19435 <https://bugs.python.org/19435>`__. Patch by Zach Byrne.

source: `bpo-22733 <https://bugs.python.org/issue22733>`__: Fix ffi_prep_args not zero-extending argument values correctly on 64-bit Windows.
fr: `bpo-22733 <https://bugs.python.org/22733>`__: Fix ffi_prep_args not zero-extending argument values correctly on 64-bit Windows.

source: `bpo-23302 <https://bugs.python.org/issue23302>`__: Default to TCP_NODELAY=1 upon establishing an HTTPConnection. Removed use of hard-coded MSS as it's an optimization that's no longer needed with Nagle disabled.
fr: `bpo-23302 <https://bugs.python.org/23302>`__: Default to TCP_NODELAY=1 upon establishing an HTTPConnection. Removed use of hard-coded MSS as it's an optimization that's no longer needed with Nagle disabled.

source: `bpo-20577 <https://bugs.python.org/issue20577>`__: Configuration of the max line length for the FormatParagraph extension has been moved from the General tab of the Idle preferences dialog to the FormatParagraph tab of the Config Extensions dialog. Patch by Tal Einat.
fr: `bpo-20577 <https://bugs.python.org/20577>`__: Configuration of the max line length for the FormatParagraph extension has been moved from the General tab of the Idle preferences dialog to the FormatParagraph tab of the Config Extensions dialog. Patch by Tal Einat.

source: `bpo-16893 <https://bugs.python.org/issue16893>`__: Update Idle doc chapter to match current Idle and add new information.
fr: `bpo-16893 <https://bugs.python.org/16893>`__: Update Idle doc chapter to match current Idle and add new information.

source: `bpo-3068 <https://bugs.python.org/issue3068>`__: Add Idle extension configuration dialog to Options menu. Changes are written to HOME/.idlerc/config-extensions.cfg. Original patch by Tal Einat.
fr: `bpo-3068 <https://bugs.python.org/3068>`__: Add Idle extension configuration dialog to Options menu. Changes are written to HOME/.idlerc/config-extensions.cfg. Original patch by Tal Einat.

source: `bpo-16233 <https://bugs.python.org/issue16233>`__: A module browser (File : Class Browser, Alt+C) requires an editor window with a filename. When Class Browser is requested otherwise, from a shell, output window, or 'Untitled' editor, Idle no longer displays an error box. It now pops up an Open Module box (Alt+M). If a valid name is entered and a module is opened, a corresponding browser is also opened.
fr: `bpo-16233 <https://bugs.python.org/16233>`__: A module browser (File : Class Browser, Alt+C) requires an editor window with a filename. When Class Browser is requested otherwise, from a shell, output window, or 'Untitled' editor, Idle no longer displays an error box. It now pops up an Open Module box (Alt+M). If a valid name is entered and a module is opened, a corresponding browser is also opened.

source: `bpo-4832 <https://bugs.python.org/issue4832>`__: Save As to type Python files automatically adds .py to the name you enter (even if your system does not display it). Some systems automatically add .txt when type is Text files.
fr: `bpo-4832 <https://bugs.python.org/4832>`__: Save As to type Python files automatically adds .py to the name you enter (even if your system does not display it). Some systems automatically add .txt when type is Text files.

source: `bpo-21986 <https://bugs.python.org/issue21986>`__: Code objects are not normally pickled by the pickle module. To match this, they are no longer pickled when running under Idle.
fr: `bpo-21986 <https://bugs.python.org/21986>`__: Code objects are not normally pickled by the pickle module. To match this, they are no longer pickled when running under Idle.

source: `bpo-17390 <https://bugs.python.org/issue17390>`__: Adjust Editor window title; remove 'Python', move version to end.
fr: `bpo-17390 <https://bugs.python.org/17390>`__: Adjust Editor window title; remove 'Python', move version to end.

source: `bpo-14105 <https://bugs.python.org/issue14105>`__: Idle debugger breakpoints no longer disappear when inserting or deleting lines.
fr: `bpo-14105 <https://bugs.python.org/14105>`__: Idle debugger breakpoints no longer disappear when inserting or deleting lines.

source: `bpo-17172 <https://bugs.python.org/issue17172>`__: Turtledemo can now be run from Idle. Currently, the entry is on the Help menu, but it may move to Run. Patch by Ramchandra Apt and Lita Cho.
fr: `bpo-17172 <https://bugs.python.org/17172>`__: Turtledemo can now be run from Idle. Currently, the entry is on the Help menu, but it may move to Run. Patch by Ramchandra Apt and Lita Cho.

source: `bpo-21765 <https://bugs.python.org/issue21765>`__: Add support for non-ascii identifiers to HyperParser.
fr: `bpo-21765 <https://bugs.python.org/21765>`__: Add support for non-ascii identifiers to HyperParser.

source: `bpo-21940 <https://bugs.python.org/issue21940>`__: Add unittest for WidgetRedirector. Initial patch by Saimadhav Heblikar.
fr: `bpo-21940 <https://bugs.python.org/21940>`__: Add unittest for WidgetRedirector. Initial patch by Saimadhav Heblikar.

source: `bpo-18592 <https://bugs.python.org/issue18592>`__: Add unittest for SearchDialogBase. Patch by Phil Webster.
fr: `bpo-18592 <https://bugs.python.org/18592>`__: Add unittest for SearchDialogBase. Patch by Phil Webster.

source: `bpo-21694 <https://bugs.python.org/issue21694>`__: Add unittest for ParenMatch. Patch by Saimadhav Heblikar.
fr: `bpo-21694 <https://bugs.python.org/21694>`__: Add unittest for ParenMatch. Patch by Saimadhav Heblikar.

source: `bpo-21686 <https://bugs.python.org/issue21686>`__: add unittest for HyperParser. Original patch by Saimadhav Heblikar.
fr: `bpo-21686 <https://bugs.python.org/21686>`__: add unittest for HyperParser. Original patch by Saimadhav Heblikar.

source: `bpo-12387 <https://bugs.python.org/issue12387>`__: Add missing upper(lower)case versions of default Windows key bindings for Idle so Caps Lock does not disable them. Patch by Roger Serwy.
fr: `bpo-12387 <https://bugs.python.org/12387>`__: Add missing upper(lower)case versions of default Windows key bindings for Idle so Caps Lock does not disable them. Patch by Roger Serwy.

source: `bpo-21695 <https://bugs.python.org/issue21695>`__: Closing a Find-in-files output window while the search is still in progress no longer closes Idle.
fr: `bpo-21695 <https://bugs.python.org/21695>`__: Closing a Find-in-files output window while the search is still in progress no longer closes Idle.

source: `bpo-18910 <https://bugs.python.org/issue18910>`__: Add unittest for textView. Patch by Phil Webster.
fr: `bpo-18910 <https://bugs.python.org/18910>`__: Add unittest for textView. Patch by Phil Webster.

source: `bpo-18292 <https://bugs.python.org/issue18292>`__: Add unittest for AutoExpand. Patch by Saihadhav Heblikar.
fr: `bpo-18292 <https://bugs.python.org/18292>`__: Add unittest for AutoExpand. Patch by Saihadhav Heblikar.

source: `bpo-18409 <https://bugs.python.org/issue18409>`__: Add unittest for AutoComplete. Patch by Phil Webster.
fr: `bpo-18409 <https://bugs.python.org/18409>`__: Add unittest for AutoComplete. Patch by Phil Webster.

source: `bpo-21477 <https://bugs.python.org/issue21477>`__: htest.py - Improve framework, complete set of tests. Patches by Saimadhav Heblikar
fr: `bpo-21477 <https://bugs.python.org/21477>`__: htest.py - Improve framework, complete set of tests. Patches by Saimadhav Heblikar

source: `bpo-18104 <https://bugs.python.org/issue18104>`__: Add idlelib/idle_test/htest.py with a few sample tests to begin consolidating and improving human-validated tests of Idle. Change other files as needed to work with htest. Running the module as __main__ runs all tests.
fr: `bpo-18104 <https://bugs.python.org/18104>`__: Add idlelib/idle_test/htest.py with a few sample tests to begin consolidating and improving human-validated tests of Idle. Change other files as needed to work with htest. Running the module as __main__ runs all tests.

source: `bpo-21139 <https://bugs.python.org/issue21139>`__: Change default paragraph width to 72, the PEP 8 recommendation.
fr: `bpo-21139 <https://bugs.python.org/21139>`__: Change default paragraph width to 72, the PEP 8 recommendation.

source: `bpo-21284 <https://bugs.python.org/issue21284>`__: Paragraph reformat test passes after user changes reformat width.
fr: `bpo-21284 <https://bugs.python.org/21284>`__: Paragraph reformat test passes after user changes reformat width.

source: `bpo-17654 <https://bugs.python.org/issue17654>`__: Ensure IDLE menus are customized properly on OS X for non-framework builds and for all variants of Tk.
fr: `bpo-17654 <https://bugs.python.org/17654>`__: Ensure IDLE menus are customized properly on OS X for non-framework builds and for all variants of Tk.

source: `bpo-23180 <https://bugs.python.org/issue23180>`__: Rename IDLE "Windows" menu item to "Window". Patch by Al Sweigart.
fr: `bpo-23180 <https://bugs.python.org/23180>`__: Rename IDLE "Windows" menu item to "Window". Patch by Al Sweigart.

source: `bpo-15506 <https://bugs.python.org/issue15506>`__: Use standard PKG_PROG_PKG_CONFIG autoconf macro in the configure script.
fr: `bpo-15506 <https://bugs.python.org/15506>`__: Use standard PKG_PROG_PKG_CONFIG autoconf macro in the configure script.

source: `bpo-22935 <https://bugs.python.org/issue22935>`__: Allow the ssl module to be compiled if openssl doesn't support SSL 3.
fr: `bpo-22935 <https://bugs.python.org/22935>`__: Allow the ssl module to be compiled if openssl doesn't support SSL 3.

source: `bpo-22592 <https://bugs.python.org/issue22592>`__: Drop support of the Borland C compiler to build Python. The distutils module still supports it to build extensions.
fr: `bpo-22592 <https://bugs.python.org/22592>`__: Drop support of the Borland C compiler to build Python. The distutils module still supports it to build extensions.

source: `bpo-22591 <https://bugs.python.org/issue22591>`__: Drop support of MS-DOS, especially of the DJGPP compiler (MS-DOS port of GCC).
fr: `bpo-22591 <https://bugs.python.org/22591>`__: Drop support of MS-DOS, especially of the DJGPP compiler (MS-DOS port of GCC).

source: `bpo-16537 <https://bugs.python.org/issue16537>`__: Check whether self.extensions is empty in setup.py. Patch by Jonathan Hosmer.
fr: `bpo-16537 <https://bugs.python.org/16537>`__: Check whether self.extensions is empty in setup.py. Patch by Jonathan Hosmer.

source: `bpo-22359 <https://bugs.python.org/issue22359>`__: Remove incorrect uses of recursive make. Patch by Jonas Wagner.
fr: `bpo-22359 <https://bugs.python.org/22359>`__: Remove incorrect uses of recursive make. Patch by Jonas Wagner.

source: `bpo-21958 <https://bugs.python.org/issue21958>`__: Define HAVE_ROUND when building with Visual Studio 2013 and above. Patch by Zachary Turner.
fr: `bpo-21958 <https://bugs.python.org/21958>`__: Define HAVE_ROUND when building with Visual Studio 2013 and above. Patch by Zachary Turner.

source: `bpo-18093 <https://bugs.python.org/issue18093>`__: the programs that embed the CPython runtime are now in a separate "Programs" directory, rather than being kept in the Modules directory.
fr: `bpo-18093 <https://bugs.python.org/18093>`__: the programs that embed the CPython runtime are now in a separate "Programs" directory, rather than being kept in the Modules directory.

source: `bpo-15759 <https://bugs.python.org/issue15759>`__: "make suspicious", "make linkcheck" and "make doctest" in Doc/ now display special message when and only when there are failures.
fr: `bpo-15759 <https://bugs.python.org/15759>`__: "make suspicious", "make linkcheck" and "make doctest" in Doc/ now display special message when and only when there are failures.

source: `bpo-21141 <https://bugs.python.org/issue21141>`__: The Windows build process no longer attempts to find Perl, instead relying on OpenSSL source being configured and ready to build. The ``PCbuild\build_ssl.py`` script has been re-written and re-named to ``PCbuild\prepare_ssl.py``, and takes care of configuring OpenSSL source for both 32 and 64 bit platforms. OpenSSL sources obtained from svn.python.org will always be pre-configured and ready to build.
fr: `bpo-21141 <https://bugs.python.org/21141>`__: The Windows build process no longer attempts to find Perl, instead relying on OpenSSL source being configured and ready to build. The ``PCbuild\build_ssl.py`` script has been re-written and re-named to ``PCbuild\prepare_ssl.py``, and takes care of configuring OpenSSL source for both 32 and 64 bit platforms. OpenSSL sources obtained from svn.python.org will always be pre-configured and ready to build.

source: `bpo-21037 <https://bugs.python.org/issue21037>`__: Add a build option to enable AddressSanitizer support.
fr: `bpo-21037 <https://bugs.python.org/21037>`__: Add a build option to enable AddressSanitizer support.

source: `bpo-19962 <https://bugs.python.org/issue19962>`__: The Windows build process now creates "python.bat" in the root of the source tree, which passes all arguments through to the most recently built interpreter.
fr: `bpo-19962 <https://bugs.python.org/19962>`__: The Windows build process now creates "python.bat" in the root of the source tree, which passes all arguments through to the most recently built interpreter.

source: `bpo-21285 <https://bugs.python.org/issue21285>`__: Refactor and fix curses configure check to always search in a ncursesw directory.
fr: `bpo-21285 <https://bugs.python.org/21285>`__: Refactor and fix curses configure check to always search in a ncursesw directory.

source: `bpo-15234 <https://bugs.python.org/issue15234>`__: For BerkelyDB and Sqlite, only add the found library and include directories if they aren't already being searched. This avoids an explicit runtime library dependency.
fr: `bpo-15234 <https://bugs.python.org/15234>`__: For BerkelyDB and Sqlite, only add the found library and include directories if they aren't already being searched. This avoids an explicit runtime library dependency.

source: `bpo-17861 <https://bugs.python.org/issue17861>`__: Tools/scripts/generate_opcode_h.py automatically regenerates Include/opcode.h from Lib/opcode.py if the latter gets any change.
fr: `bpo-17861 <https://bugs.python.org/17861>`__: Tools/scripts/generate_opcode_h.py automatically regenerates Include/opcode.h from Lib/opcode.py if the latter gets any change.

source: `bpo-20644 <https://bugs.python.org/issue20644>`__: OS X installer build support for documentation build changes in 3.4.1: assume externally supplied sphinx-build is available in /usr/bin.
fr: `bpo-20644 <https://bugs.python.org/20644>`__: OS X installer build support for documentation build changes in 3.4.1: assume externally supplied sphinx-build is available in /usr/bin.

source: `bpo-20022 <https://bugs.python.org/issue20022>`__: Eliminate use of deprecated bundlebuilder in OS X builds.
fr: `bpo-20022 <https://bugs.python.org/20022>`__: Eliminate use of deprecated bundlebuilder in OS X builds.

source: `bpo-15968 <https://bugs.python.org/issue15968>`__: Incorporated Tcl, Tk, and Tix builds into the Windows build solution.
fr: `bpo-15968 <https://bugs.python.org/15968>`__: Incorporated Tcl, Tk, and Tix builds into the Windows build solution.

source: `bpo-17095 <https://bugs.python.org/issue17095>`__: Fix Modules/Setup *shared* support.
fr: `bpo-17095 <https://bugs.python.org/17095>`__: Fix Modules/Setup *shared* support.

source: `bpo-21811 <https://bugs.python.org/issue21811>`__: Anticipated fixes to support OS X versions > 10.9.
fr: `bpo-21811 <https://bugs.python.org/21811>`__: Anticipated fixes to support OS X versions > 10.9.

source: `bpo-21166 <https://bugs.python.org/issue21166>`__: Prevent possible segfaults and other random failures of python --generate-posix-vars in pybuilddir.txt build target.
fr: `bpo-21166 <https://bugs.python.org/21166>`__: Prevent possible segfaults and other random failures of python --generate-posix-vars in pybuilddir.txt build target.

source: `bpo-18096 <https://bugs.python.org/issue18096>`__: Fix library order returned by python-config.
fr: `bpo-18096 <https://bugs.python.org/18096>`__: Fix library order returned by python-config.

source: `bpo-17219 <https://bugs.python.org/issue17219>`__: Add library build dir for Python extension cross-builds.
fr: `bpo-17219 <https://bugs.python.org/17219>`__: Add library build dir for Python extension cross-builds.

source: `bpo-22919 <https://bugs.python.org/issue22919>`__: Windows build updated to support VC 14.0 (Visual Studio 2015), which will be used for the official release.
fr: `bpo-22919 <https://bugs.python.org/22919>`__: Windows build updated to support VC 14.0 (Visual Studio 2015), which will be used for the official release.

source: `bpo-21236 <https://bugs.python.org/issue21236>`__: Build _msi.pyd with cabinet.lib instead of fci.lib
fr: `bpo-21236 <https://bugs.python.org/21236>`__: Build _msi.pyd with cabinet.lib instead of fci.lib

source: `bpo-17128 <https://bugs.python.org/issue17128>`__: Use private version of OpenSSL for OS X 10.5+ installer.
fr: `bpo-17128 <https://bugs.python.org/17128>`__: Use private version of OpenSSL for OS X 10.5+ installer.

source: `bpo-14203 <https://bugs.python.org/issue14203>`__: Remove obsolete support for view==NULL in PyBuffer_FillInfo(), bytearray_getbuffer(), bytesiobuf_getbuffer() and array_buffer_getbuf(). All functions now raise BufferError in that case.
fr: `bpo-14203 <https://bugs.python.org/14203>`__: Remove obsolete support for view==NULL in PyBuffer_FillInfo(), bytearray_getbuffer(), bytesiobuf_getbuffer() and array_buffer_getbuf(). All functions now raise BufferError in that case.

source: `bpo-22445 <https://bugs.python.org/issue22445>`__: PyBuffer_IsContiguous() now implements precise contiguity tests, compatible with NumPy's NPY_RELAXED_STRIDES_CHECKING compilation flag. Previously the function reported false negatives for corner cases.
fr: `bpo-22445 <https://bugs.python.org/22445>`__: PyBuffer_IsContiguous() now implements precise contiguity tests, compatible with NumPy's NPY_RELAXED_STRIDES_CHECKING compilation flag. Previously the function reported false negatives for corner cases.

source: `bpo-22079 <https://bugs.python.org/issue22079>`__: PyType_Ready() now checks that statically allocated type has no dynamically allocated bases.
fr: `bpo-22079 <https://bugs.python.org/22079>`__: PyType_Ready() now checks that statically allocated type has no dynamically allocated bases.

source: `bpo-22453 <https://bugs.python.org/issue22453>`__: Removed non-documented macro PyObject_REPR().
fr: `bpo-22453 <https://bugs.python.org/22453>`__: Removed non-documented macro PyObject_REPR().

source: `bpo-18395 <https://bugs.python.org/issue18395>`__: Rename ``_Py_char2wchar()`` to :c:func:`Py_DecodeLocale`, rename ``_Py_wchar2char()`` to :c:func:`Py_EncodeLocale`, and document these functions.
fr: `bpo-18395 <https://bugs.python.org/18395>`__: Rename ``_Py_char2wchar()`` to :c:func:`Py_DecodeLocale`, rename ``_Py_wchar2char()`` to :c:func:`Py_EncodeLocale`, and document these functions.

source: `bpo-21233 <https://bugs.python.org/issue21233>`__: Add new C functions: PyMem_RawCalloc(), PyMem_Calloc(), PyObject_Calloc(), _PyObject_GC_Calloc(). bytes(int) is now using ``calloc()`` instead of ``malloc()`` for large objects which is faster and use less memory.
fr: `bpo-21233 <https://bugs.python.org/21233>`__: Add new C functions: PyMem_RawCalloc(), PyMem_Calloc(), PyObject_Calloc(), _PyObject_GC_Calloc(). bytes(int) is now using ``calloc()`` instead of ``malloc()`` for large objects which is faster and use less memory.
