Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-10910 <https://bugs.python.org/issue10910>`__: Avoid C++ compilation errors on FreeBSD and OS X. Also update FreedBSD version checks for the original ctype UTF-8 workaround.
fr: `bpo-10910 <https://bugs.python.org/10910>`__: Avoid C++ compilation errors on FreeBSD and OS X. Also update FreedBSD version checks for the original ctype UTF-8 workaround.

source: `bpo-27473 <https://bugs.python.org/issue27473>`__: Fixed possible integer overflow in bytes and bytearray concatenations. Patch by Xiang Zhang.
fr: `bpo-27473 <https://bugs.python.org/27473>`__: Fixed possible integer overflow in bytes and bytearray concatenations. Patch by Xiang Zhang.

source: `bpo-23034 <https://bugs.python.org/issue23034>`__: The output of a special Python build with defined COUNT_ALLOCS, SHOW_ALLOC_COUNT or SHOW_TRACK_COUNT macros is now off by default. It can be re-enabled using the "-X showalloccount" option. It now outputs to stderr instead of stdout.
fr: `bpo-23034 <https://bugs.python.org/23034>`__: The output of a special Python build with defined COUNT_ALLOCS, SHOW_ALLOC_COUNT or SHOW_TRACK_COUNT macros is now off by default. It can be re-enabled using the "-X showalloccount" option. It now outputs to stderr instead of stdout.

source: `bpo-27443 <https://bugs.python.org/issue27443>`__: __length_hint__() of bytearray iterators no longer return a negative integer for a resized bytearray.
fr: `bpo-27443 <https://bugs.python.org/27443>`__: __length_hint__() of bytearray iterators no longer return a negative integer for a resized bytearray.

source: `bpo-27007 <https://bugs.python.org/issue27007>`__: The fromhex() class methods of bytes and bytearray subclasses now return an instance of corresponding subclass.
fr: `bpo-27007 <https://bugs.python.org/27007>`__: The fromhex() class methods of bytes and bytearray subclasses now return an instance of corresponding subclass.

source: `bpo-26844 <https://bugs.python.org/issue26844>`__: Fix error message for imp.find_module() to refer to 'path' instead of 'name'. Patch by Lev Maximov.
fr: `bpo-26844 <https://bugs.python.org/26844>`__: Fix error message for imp.find_module() to refer to 'path' instead of 'name'. Patch by Lev Maximov.

source: `bpo-23804 <https://bugs.python.org/issue23804>`__: Fix SSL zero-length recv() calls to not block and not raise an error about unclean EOF.
fr: `bpo-23804 <https://bugs.python.org/23804>`__: Fix SSL zero-length recv() calls to not block and not raise an error about unclean EOF.

source: `bpo-27466 <https://bugs.python.org/issue27466>`__: Change time format returned by http.cookie.time2netscape, confirming the netscape cookie format and making it consistent with documentation.
fr: `bpo-27466 <https://bugs.python.org/27466>`__: Change time format returned by http.cookie.time2netscape, confirming the netscape cookie format and making it consistent with documentation.

source: `bpo-21708 <https://bugs.python.org/issue21708>`__: Deprecated dbm.dumb behavior that differs from common dbm behavior: creating a database in 'r' and 'w' modes and modifying a database in 'r' mode.
fr: `bpo-21708 <https://bugs.python.org/21708>`__: Deprecated dbm.dumb behavior that differs from common dbm behavior: creating a database in 'r' and 'w' modes and modifying a database in 'r' mode.

source: `bpo-26721 <https://bugs.python.org/issue26721>`__: Change the socketserver.StreamRequestHandler.wfile attribute to implement BufferedIOBase. In particular, the write() method no longer does partial writes.
fr: `bpo-26721 <https://bugs.python.org/26721>`__: Change the socketserver.StreamRequestHandler.wfile attribute to implement BufferedIOBase. In particular, the write() method no longer does partial writes.

source: `bpo-22115 <https://bugs.python.org/issue22115>`__: Added methods trace_add, trace_remove and trace_info in the tkinter.Variable class. They replace old methods trace_variable, trace, trace_vdelete and trace_vinfo that use obsolete Tcl commands and might not work in future versions of Tcl. Fixed old tracing methods: trace_vdelete() with wrong mode no longer break tracing, trace_vinfo() now always returns a list of pairs of strings, tracing in the "u" mode now works.
fr: `bpo-22115 <https://bugs.python.org/22115>`__: Added methods trace_add, trace_remove and trace_info in the tkinter.Variable class. They replace old methods trace_variable, trace, trace_vdelete and trace_vinfo that use obsolete Tcl commands and might not work in future versions of Tcl. Fixed old tracing methods: trace_vdelete() with wrong mode no longer break tracing, trace_vinfo() now always returns a list of pairs of strings, tracing in the "u" mode now works.

source: `bpo-26243 <https://bugs.python.org/issue26243>`__: Only the level argument to zlib.compress() is keyword argument now. The first argument is positional-only.
fr: `bpo-26243 <https://bugs.python.org/26243>`__: Only the level argument to zlib.compress() is keyword argument now. The first argument is positional-only.

source: `bpo-27038 <https://bugs.python.org/issue27038>`__: Expose the DirEntry type as os.DirEntry. Code patch by Jelle Zijlstra.
fr: `bpo-27038 <https://bugs.python.org/27038>`__: Expose the DirEntry type as os.DirEntry. Code patch by Jelle Zijlstra.

source: `bpo-27186 <https://bugs.python.org/issue27186>`__: Update os.fspath()/PyOS_FSPath() to check the return value of __fspath__() to be either str or bytes.
fr: `bpo-27186 <https://bugs.python.org/27186>`__: Update os.fspath()/PyOS_FSPath() to check the return value of __fspath__() to be either str or bytes.

source: `bpo-18726 <https://bugs.python.org/issue18726>`__: All optional parameters of the dump(), dumps(), load() and loads() functions and JSONEncoder and JSONDecoder class constructors in the json module are now keyword-only.
fr: `bpo-18726 <https://bugs.python.org/18726>`__: All optional parameters of the dump(), dumps(), load() and loads() functions and JSONEncoder and JSONDecoder class constructors in the json module are now keyword-only.

source: `bpo-27319 <https://bugs.python.org/issue27319>`__: Methods selection_set(), selection_add(), selection_remove() and selection_toggle() of ttk.TreeView now allow passing multiple items as multiple arguments instead of passing them as a tuple. Deprecated undocumented ability of calling the selection() method with arguments.
fr: `bpo-27319 <https://bugs.python.org/27319>`__: Methods selection_set(), selection_add(), selection_remove() and selection_toggle() of ttk.TreeView now allow passing multiple items as multiple arguments instead of passing them as a tuple. Deprecated undocumented ability of calling the selection() method with arguments.

source: `bpo-27079 <https://bugs.python.org/issue27079>`__: Fixed curses.ascii functions isblank(), iscntrl() and ispunct().
fr: `bpo-27079 <https://bugs.python.org/27079>`__: Fixed curses.ascii functions isblank(), iscntrl() and ispunct().

source: `bpo-27294 <https://bugs.python.org/issue27294>`__: Numerical state in the repr for Tkinter event objects is now represented as a combination of known flags.
fr: `bpo-27294 <https://bugs.python.org/27294>`__: Numerical state in the repr for Tkinter event objects is now represented as a combination of known flags.

source: `bpo-27177 <https://bugs.python.org/issue27177>`__: Match objects in the re module now support index-like objects as group indices. Based on patches by Jeroen Demeyer and Xiang Zhang.
fr: `bpo-27177 <https://bugs.python.org/27177>`__: Match objects in the re module now support index-like objects as group indices. Based on patches by Jeroen Demeyer and Xiang Zhang.

source: `bpo-26754 <https://bugs.python.org/issue26754>`__: Some functions (compile() etc) accepted a filename argument encoded as an iterable of integers. Now only strings and byte-like objects are accepted.
fr: `bpo-26754 <https://bugs.python.org/26754>`__: Some functions (compile() etc) accepted a filename argument encoded as an iterable of integers. Now only strings and byte-like objects are accepted.

source: `bpo-26536 <https://bugs.python.org/issue26536>`__: socket.ioctl now supports SIO_LOOPBACK_FAST_PATH. Patch by Daniel Stokes.
fr: `bpo-26536 <https://bugs.python.org/26536>`__: socket.ioctl now supports SIO_LOOPBACK_FAST_PATH. Patch by Daniel Stokes.

source: `bpo-27048 <https://bugs.python.org/issue27048>`__: Prevents distutils failing on Windows when environment variables contain non-ASCII characters
fr: `bpo-27048 <https://bugs.python.org/27048>`__: Prevents distutils failing on Windows when environment variables contain non-ASCII characters

source: `bpo-27330 <https://bugs.python.org/issue27330>`__: Fixed possible leaks in the ctypes module.
fr: `bpo-27330 <https://bugs.python.org/27330>`__: Fixed possible leaks in the ctypes module.

source: `bpo-27238 <https://bugs.python.org/issue27238>`__: Got rid of bare excepts in the turtle module. Original patch by Jelle Zijlstra.
fr: `bpo-27238 <https://bugs.python.org/27238>`__: Got rid of bare excepts in the turtle module. Original patch by Jelle Zijlstra.

source: `bpo-27122 <https://bugs.python.org/issue27122>`__: When an exception is raised within the context being managed by a contextlib.ExitStack() and one of the exit stack generators catches and raises it in a chain, do not re-raise the original exception when exiting, let the new chained one through. This avoids the PEP 479 bug described in issue25782.
fr: `bpo-27122 <https://bugs.python.org/27122>`__: When an exception is raised within the context being managed by a contextlib.ExitStack() and one of the exit stack generators catches and raises it in a chain, do not re-raise the original exception when exiting, let the new chained one through. This avoids the PEP 479 bug described in issue25782.

source: `bpo-16864 <https://bugs.python.org/issue16864>`__: sqlite3.Cursor.lastrowid now supports REPLACE statement. Initial patch by Alex LordThorsen.
fr: `bpo-16864 <https://bugs.python.org/16864>`__: sqlite3.Cursor.lastrowid now supports REPLACE statement. Initial patch by Alex LordThorsen.

source: `bpo-26386 <https://bugs.python.org/issue26386>`__: Fixed ttk.TreeView selection operations with item id's containing spaces.
fr: `bpo-26386 <https://bugs.python.org/26386>`__: Fixed ttk.TreeView selection operations with item id's containing spaces.

source: `bpo-8637 <https://bugs.python.org/issue8637>`__: Honor a pager set by the env var MANPAGER (in preference to one set by the env var PAGER).
fr: `bpo-8637 <https://bugs.python.org/8637>`__: Honor a pager set by the env var MANPAGER (in preference to one set by the env var PAGER).

source: `bpo-16182 <https://bugs.python.org/issue16182>`__: Fix various functions in the "readline" module to use the locale encoding, and fix get_begidx() and get_endidx() to return code point indexes.
fr: `bpo-16182 <https://bugs.python.org/16182>`__: Fix various functions in the "readline" module to use the locale encoding, and fix get_begidx() and get_endidx() to return code point indexes.

source: `bpo-27392 <https://bugs.python.org/issue27392>`__: Add loop.connect_accepted_socket(). Patch by Jim Fulton.
fr: `bpo-27392 <https://bugs.python.org/27392>`__: Add loop.connect_accepted_socket(). Patch by Jim Fulton.

source: `bpo-27477 <https://bugs.python.org/issue27477>`__: IDLE search dialogs now use ttk widgets.
fr: `bpo-27477 <https://bugs.python.org/27477>`__: IDLE search dialogs now use ttk widgets.

source: `bpo-27452 <https://bugs.python.org/issue27452>`__: make command line "idle-test> python test_help.py" work. __file__ is relative when python is started in the file's directory.
fr: `bpo-27452 <https://bugs.python.org/27452>`__: make command line "idle-test> python test_help.py" work. __file__ is relative when python is started in the file's directory.

source: `bpo-27380 <https://bugs.python.org/issue27380>`__: IDLE: add query.py with base Query dialog and ttk widgets. Module had subclasses SectionName, ModuleName, and HelpSource, which are used to get information from users by configdialog and file =>Load Module. Each subclass has itw own validity checks. Using ModuleName allows users to edit bad module names instead of starting over. Add tests and delete the two files combined into the new one.
fr: `bpo-27380 <https://bugs.python.org/27380>`__: IDLE: add query.py with base Query dialog and ttk widgets. Module had subclasses SectionName, ModuleName, and HelpSource, which are used to get information from users by configdialog and file =>Load Module. Each subclass has itw own validity checks. Using ModuleName allows users to edit bad module names instead of starting over. Add tests and delete the two files combined into the new one.

source: `bpo-27372 <https://bugs.python.org/issue27372>`__: Test_idle no longer changes the locale.
fr: `bpo-27372 <https://bugs.python.org/27372>`__: Test_idle no longer changes the locale.

source: `bpo-27365 <https://bugs.python.org/issue27365>`__: Allow non-ascii chars in IDLE NEWS.txt, for contributor names.
fr: `bpo-27365 <https://bugs.python.org/27365>`__: Allow non-ascii chars in IDLE NEWS.txt, for contributor names.

source: `bpo-27245 <https://bugs.python.org/issue27245>`__: IDLE: Cleanly delete custom themes and key bindings. Previously, when IDLE was started from a console or by import, a cascade of warnings was emitted. Patch by Serhiy Storchaka.
fr: `bpo-27245 <https://bugs.python.org/27245>`__: IDLE: Cleanly delete custom themes and key bindings. Previously, when IDLE was started from a console or by import, a cascade of warnings was emitted. Patch by Serhiy Storchaka.

source: `bpo-24137 <https://bugs.python.org/issue24137>`__: Run IDLE, test_idle, and htest with tkinter default root disabled. Fix code and tests that fail with this restriction. Fix htests to not create a second and redundant root and mainloop.
fr: `bpo-24137 <https://bugs.python.org/24137>`__: Run IDLE, test_idle, and htest with tkinter default root disabled. Fix code and tests that fail with this restriction. Fix htests to not create a second and redundant root and mainloop.

source: `bpo-27310 <https://bugs.python.org/issue27310>`__: Fix IDLE.app failure to launch on OS X due to vestigial import.
fr: `bpo-27310 <https://bugs.python.org/27310>`__: Fix IDLE.app failure to launch on OS X due to vestigial import.

source: `bpo-26754 <https://bugs.python.org/issue26754>`__: PyUnicode_FSDecoder() accepted a filename argument encoded as an iterable of integers. Now only strings and byte-like objects are accepted.
fr: `bpo-26754 <https://bugs.python.org/26754>`__: PyUnicode_FSDecoder() accepted a filename argument encoded as an iterable of integers. Now only strings and byte-like objects are accepted.

source: `bpo-28066 <https://bugs.python.org/issue28066>`__: Fix the logic that searches build directories for generated include files when building outside the source tree.
fr: `bpo-28066 <https://bugs.python.org/28066>`__: Fix the logic that searches build directories for generated include files when building outside the source tree.

source: `bpo-27442 <https://bugs.python.org/issue27442>`__: Expose the Android API level that python was built against, in sysconfig.get_config_vars() as 'ANDROID_API_LEVEL'.
fr: `bpo-27442 <https://bugs.python.org/27442>`__: Expose the Android API level that python was built against, in sysconfig.get_config_vars() as 'ANDROID_API_LEVEL'.

source: `bpo-27434 <https://bugs.python.org/issue27434>`__: The interpreter that runs the cross-build, found in PATH, must now be of the same feature version (e.g. 3.6) as the source being built.
fr: `bpo-27434 <https://bugs.python.org/27434>`__: The interpreter that runs the cross-build, found in PATH, must now be of the same feature version (e.g. 3.6) as the source being built.

source: `bpo-26930 <https://bugs.python.org/issue26930>`__: Update Windows builds to use OpenSSL 1.0.2h.
fr: `bpo-26930 <https://bugs.python.org/26930>`__: Update Windows builds to use OpenSSL 1.0.2h.

source: `bpo-23968 <https://bugs.python.org/issue23968>`__: Rename the platform directory from plat-$(MACHDEP) to plat-$(PLATFORM_TRIPLET). Rename the config directory (LIBPL) from config-$(LDVERSION) to config-$(LDVERSION)-$(PLATFORM_TRIPLET). Install the platform specifc _sysconfigdata module into the platform directory and rename it to include the ABIFLAGS.
fr: `bpo-23968 <https://bugs.python.org/23968>`__: Rename the platform directory from plat-$(MACHDEP) to plat-$(PLATFORM_TRIPLET). Rename the config directory (LIBPL) from config-$(LDVERSION) to config-$(LDVERSION)-$(PLATFORM_TRIPLET). Install the platform specifc _sysconfigdata module into the platform directory and rename it to include the ABIFLAGS.

source: `bpo-27332 <https://bugs.python.org/issue27332>`__: Fixed the type of the first argument of module-level functions generated by Argument Clinic. Patch by Petr Viktorin.
fr: `bpo-27332 <https://bugs.python.org/27332>`__: Fixed the type of the first argument of module-level functions generated by Argument Clinic. Patch by Petr Viktorin.

source: `bpo-27418 <https://bugs.python.org/issue27418>`__: Fixed Tools/importbench/importbench.py.
fr: `bpo-27418 <https://bugs.python.org/27418>`__: Fixed Tools/importbench/importbench.py.

source: `bpo-19489 <https://bugs.python.org/issue19489>`__: Moved the search box from the sidebar to the header and footer of each page. Patch by Ammar Askar.
fr: `bpo-19489 <https://bugs.python.org/19489>`__: Moved the search box from the sidebar to the header and footer of each page. Patch by Ammar Askar.

source: `bpo-27285 <https://bugs.python.org/issue27285>`__: Update documentation to reflect the deprecation of ``pyvenv`` and normalize on the term "virtual environment". Patch by Steve Piercy.
fr: `bpo-27285 <https://bugs.python.org/27285>`__: Update documentation to reflect the deprecation of ``pyvenv`` and normalize on the term "virtual environment". Patch by Steve Piercy.

source: `bpo-27027 <https://bugs.python.org/issue27027>`__: Added test.support.is_android that is True when this is an Android build.
fr: `bpo-27027 <https://bugs.python.org/27027>`__: Added test.support.is_android that is True when this is an Android build.

source: `bpo-27095 <https://bugs.python.org/issue27095>`__: Simplified MAKE_FUNCTION and removed MAKE_CLOSURE opcodes. Patch by Demur Rumed.
fr: `bpo-27095 <https://bugs.python.org/27095>`__: Simplified MAKE_FUNCTION and removed MAKE_CLOSURE opcodes. Patch by Demur Rumed.

source: `bpo-27190 <https://bugs.python.org/issue27190>`__: Raise NotSupportedError if sqlite3 is older than 3.3.1. Patch by Dave Sawyer.
fr: `bpo-27190 <https://bugs.python.org/27190>`__: Raise NotSupportedError if sqlite3 is older than 3.3.1. Patch by Dave Sawyer.

source: `bpo-27286 <https://bugs.python.org/issue27286>`__: Fixed compiling BUILD_MAP_UNPACK_WITH_CALL opcode. Calling function with generalized unpacking (PEP 448) and conflicting keyword names could cause undefined behavior.
fr: `bpo-27286 <https://bugs.python.org/27286>`__: Fixed compiling BUILD_MAP_UNPACK_WITH_CALL opcode. Calling function with generalized unpacking (PEP 448) and conflicting keyword names could cause undefined behavior.

source: `bpo-27140 <https://bugs.python.org/issue27140>`__: Added BUILD_CONST_KEY_MAP opcode.
fr: `bpo-27140 <https://bugs.python.org/27140>`__: Added BUILD_CONST_KEY_MAP opcode.

source: `bpo-27186 <https://bugs.python.org/issue27186>`__: Add support for os.PathLike objects to open() (part of PEP 519).
fr: `bpo-27186 <https://bugs.python.org/27186>`__: Add support for os.PathLike objects to open() (part of PEP 519).

source: `bpo-27066 <https://bugs.python.org/issue27066>`__: Fixed SystemError if a custom opener (for open()) returns a negative number without setting an exception.
fr: `bpo-27066 <https://bugs.python.org/27066>`__: Fixed SystemError if a custom opener (for open()) returns a negative number without setting an exception.

source: `bpo-26983 <https://bugs.python.org/issue26983>`__: float() now always return an instance of exact float. The deprecation warning is emitted if __float__ returns an instance of a strict subclass of float. In a future versions of Python this can be an error.
fr: `bpo-26983 <https://bugs.python.org/26983>`__: float() now always return an instance of exact float. The deprecation warning is emitted if __float__ returns an instance of a strict subclass of float. In a future versions of Python this can be an error.

source: `bpo-27097 <https://bugs.python.org/issue27097>`__: Python interpreter is now about 7% faster due to optimized instruction decoding. Based on patch by Demur Rumed.
fr: `bpo-27097 <https://bugs.python.org/27097>`__: Python interpreter is now about 7% faster due to optimized instruction decoding. Based on patch by Demur Rumed.

source: `bpo-26647 <https://bugs.python.org/issue26647>`__: Python interpreter now uses 16-bit wordcode instead of bytecode. Patch by Demur Rumed.
fr: `bpo-26647 <https://bugs.python.org/26647>`__: Python interpreter now uses 16-bit wordcode instead of bytecode. Patch by Demur Rumed.

source: `bpo-23275 <https://bugs.python.org/issue23275>`__: Allow assigning to an empty target list in round brackets: () = iterable.
fr: `bpo-23275 <https://bugs.python.org/23275>`__: Allow assigning to an empty target list in round brackets: () = iterable.

source: `bpo-27243 <https://bugs.python.org/issue27243>`__: Update the __aiter__ protocol: instead of returning an awaitable that resolves to an asynchronous iterator, the asynchronous iterator should be returned directly. Doing the former will trigger a PendingDeprecationWarning.
fr: `bpo-27243 <https://bugs.python.org/27243>`__: Update the __aiter__ protocol: instead of returning an awaitable that resolves to an asynchronous iterator, the asynchronous iterator should be returned directly. Doing the former will trigger a PendingDeprecationWarning.

source: `bpo-25455 <https://bugs.python.org/issue25455>`__: Fixed crashes in repr of recursive ElementTree.Element and functools.partial objects.
fr: `bpo-25455 <https://bugs.python.org/25455>`__: Fixed crashes in repr of recursive ElementTree.Element and functools.partial objects.

source: `bpo-27294 <https://bugs.python.org/issue27294>`__: Improved repr for Tkinter event objects.
fr: `bpo-27294 <https://bugs.python.org/27294>`__: Improved repr for Tkinter event objects.

source: `bpo-20508 <https://bugs.python.org/issue20508>`__: Improve exception message of IPv{4,6}Network.__getitem__. Patch by Gareth Rees.
fr: `bpo-20508 <https://bugs.python.org/20508>`__: Improve exception message of IPv{4,6}Network.__getitem__. Patch by Gareth Rees.

source: `bpo-21386 <https://bugs.python.org/issue21386>`__: Implement missing IPv4Address.is_global property. It was documented since 07a5610bae9d. Initial patch by Roger Luethi.
fr: `bpo-21386 <https://bugs.python.org/21386>`__: Implement missing IPv4Address.is_global property. It was documented since 07a5610bae9d. Initial patch by Roger Luethi.

source: `bpo-27029 <https://bugs.python.org/issue27029>`__: Removed deprecated support of universal newlines mode from ZipFile.open().
fr: `bpo-27029 <https://bugs.python.org/27029>`__: Removed deprecated support of universal newlines mode from ZipFile.open().

source: `bpo-27030 <https://bugs.python.org/issue27030>`__: Unknown escapes consisting of ``'\'`` and an ASCII letter in regular expressions now are errors. The re.LOCALE flag now can be used only with bytes patterns.
fr: `bpo-27030 <https://bugs.python.org/27030>`__: Unknown escapes consisting of ``'\'`` and an ASCII letter in regular expressions now are errors. The re.LOCALE flag now can be used only with bytes patterns.
