Repository: python/python-docs-fr
Catalog: whatsnew/changelog.po
Languages: fr

source: `bpo-25969 <https://bugs.python.org/issue25969>`__: Update the lib2to3 grammar to handle the unpacking generalizations added in 3.5.
fr: `bpo-25969 <https://bugs.python.org/25969>`__: Update the lib2to3 grammar to handle the unpacking generalizations added in 3.5.

source: `bpo-14977 <https://bugs.python.org/issue14977>`__: mailcap now respects the order of the lines in the mailcap files ("first match"), as required by RFC 1542. Patch by Michael Lazar.
fr: `bpo-14977 <https://bugs.python.org/14977>`__: mailcap now respects the order of the lines in the mailcap files ("first match"), as required by RFC 1542. Patch by Michael Lazar.

source: `bpo-28025 <https://bugs.python.org/issue28025>`__: Convert all ssl module constants to IntEnum and IntFlags. SSLContext properties now return flags and enums.
fr: `bpo-28025 <https://bugs.python.org/28025>`__: Convert all ssl module constants to IntEnum and IntFlags. SSLContext properties now return flags and enums.

source: `bpo-433028 <https://bugs.python.org/issue433028>`__: Added support of modifier spans in regular expressions.
fr: `bpo-433028 <https://bugs.python.org/433028>`__: Added support of modifier spans in regular expressions.

source: `bpo-24594 <https://bugs.python.org/issue24594>`__: Validates persist parameter when opening MSI database
fr: `bpo-24594 <https://bugs.python.org/24594>`__: Validates persist parameter when opening MSI database

source: `bpo-17582 <https://bugs.python.org/issue17582>`__: xml.etree.ElementTree nows preserves whitespaces in attributes (Patch by Duane Griffin. Reviewed and approved by Stefan Behnel.)
fr: `bpo-17582 <https://bugs.python.org/17582>`__: xml.etree.ElementTree nows preserves whitespaces in attributes (Patch by Duane Griffin. Reviewed and approved by Stefan Behnel.)

source: `bpo-28047 <https://bugs.python.org/issue28047>`__: Fixed calculation of line length used for the base64 CTE in the new email policies.
fr: `bpo-28047 <https://bugs.python.org/28047>`__: Fixed calculation of line length used for the base64 CTE in the new email policies.

source: `bpo-27576 <https://bugs.python.org/issue27576>`__: Fix call order in OrderedDict.__init__().
fr: `bpo-27576 <https://bugs.python.org/27576>`__: Fix call order in OrderedDict.__init__().

source: `bpo-28027 <https://bugs.python.org/issue28027>`__: Remove undocumented modules from ``Lib/plat-*``: IN, CDROM, DLFCN, TYPES, CDIO, and STROPTS.
fr: `bpo-28027 <https://bugs.python.org/28027>`__: Remove undocumented modules from ``Lib/plat-*``: IN, CDROM, DLFCN, TYPES, CDIO, and STROPTS.

source: `bpo-27445 <https://bugs.python.org/issue27445>`__: Don't pass str(_charset) to MIMEText.set_payload(). Patch by Claude Paroz.
fr: `bpo-27445 <https://bugs.python.org/27445>`__: Don't pass str(_charset) to MIMEText.set_payload(). Patch by Claude Paroz.

source: `bpo-24277 <https://bugs.python.org/issue24277>`__: The new email API is no longer provisional, and the docs have been reorganized and rewritten to emphasize the new API.
fr: `bpo-24277 <https://bugs.python.org/24277>`__: The new email API is no longer provisional, and the docs have been reorganized and rewritten to emphasize the new API.

source: `bpo-22450 <https://bugs.python.org/issue22450>`__: urllib now includes an "Accept: */*" header among the default headers. This makes the results of REST API requests more consistent and predictable especially when proxy servers are involved.
fr: `bpo-22450 <https://bugs.python.org/22450>`__: urllib now includes an "Accept: */*" header among the default headers. This makes the results of REST API requests more consistent and predictable especially when proxy servers are involved.

source: `bpo-28005 <https://bugs.python.org/issue28005>`__: Allow ImportErrors in encoding implementation to propagate.
fr: `bpo-28005 <https://bugs.python.org/28005>`__: Allow ImportErrors in encoding implementation to propagate.

source: `bpo-26667 <https://bugs.python.org/issue26667>`__: Support path-like objects in importlib.util.
fr: `bpo-26667 <https://bugs.python.org/26667>`__: Support path-like objects in importlib.util.

source: `bpo-27570 <https://bugs.python.org/issue27570>`__: Avoid zero-length memcpy() etc calls with null source pointers in the "ctypes" and "array" modules.
fr: `bpo-27570 <https://bugs.python.org/27570>`__: Avoid zero-length memcpy() etc calls with null source pointers in the "ctypes" and "array" modules.

source: `bpo-22233 <https://bugs.python.org/issue22233>`__: Break email header lines *only* on the RFC specified CR and LF characters, not on arbitrary unicode line breaks. This also fixes a bug in HTTP header parsing.
fr: `bpo-22233 <https://bugs.python.org/22233>`__: Break email header lines *only* on the RFC specified CR and LF characters, not on arbitrary unicode line breaks. This also fixes a bug in HTTP header parsing.

source: `bpo-16113 <https://bugs.python.org/issue16113>`__: Add SHA-3 and SHAKE support to hashlib module.
fr: `bpo-16113 <https://bugs.python.org/16113>`__: Add SHA-3 and SHAKE support to hashlib module.

source: `bpo-27776 <https://bugs.python.org/issue27776>`__: The :func:`os.urandom` function does now block on Linux 3.17 and newer until the system urandom entropy pool is initialized to increase the security. This change is part of the :pep:`524`.
fr: `bpo-27776 <https://bugs.python.org/27776>`__: The :func:`os.urandom` function does now block on Linux 3.17 and newer until the system urandom entropy pool is initialized to increase the security. This change is part of the :pep:`524`.

source: `bpo-27778 <https://bugs.python.org/issue27778>`__: Expose the Linux ``getrandom()`` syscall as a new :func:`os.getrandom` function. This change is part of the :pep:`524`.
fr: `bpo-27778 <https://bugs.python.org/27778>`__: Expose the Linux ``getrandom()`` syscall as a new :func:`os.getrandom` function. This change is part of the :pep:`524`.

source: `bpo-27691 <https://bugs.python.org/issue27691>`__: Fix ssl module's parsing of GEN_RID subject alternative name fields in X.509 certs.
fr: `bpo-27691 <https://bugs.python.org/27691>`__: Fix ssl module's parsing of GEN_RID subject alternative name fields in X.509 certs.

source: `bpo-18844 <https://bugs.python.org/issue18844>`__: Add random.choices().
fr: `bpo-18844 <https://bugs.python.org/18844>`__: Add random.choices().

source: `bpo-25761 <https://bugs.python.org/issue25761>`__: Improved error reporting about truncated pickle data in C implementation of unpickler. UnpicklingError is now raised instead of AttributeError and ValueError in some cases.
fr: `bpo-25761 <https://bugs.python.org/25761>`__: Improved error reporting about truncated pickle data in C implementation of unpickler. UnpicklingError is now raised instead of AttributeError and ValueError in some cases.

source: `bpo-26798 <https://bugs.python.org/issue26798>`__: Add BLAKE2 (blake2b and blake2s) to hashlib.
fr: `bpo-26798 <https://bugs.python.org/26798>`__: Add BLAKE2 (blake2b and blake2s) to hashlib.

source: `bpo-26032 <https://bugs.python.org/issue26032>`__: Optimized globbing in pathlib by using os.scandir(); it is now about 1.5--4 times faster.
fr: `bpo-26032 <https://bugs.python.org/26032>`__: Optimized globbing in pathlib by using os.scandir(); it is now about 1.5--4 times faster.

source: `bpo-25596 <https://bugs.python.org/issue25596>`__: Optimized glob() and iglob() functions in the glob module; they are now about 3--6 times faster.
fr: `bpo-25596 <https://bugs.python.org/25596>`__: Optimized glob() and iglob() functions in the glob module; they are now about 3--6 times faster.

source: `bpo-27928 <https://bugs.python.org/issue27928>`__: Add scrypt (password-based key derivation function) to hashlib module (requires OpenSSL 1.1.0).
fr: `bpo-27928 <https://bugs.python.org/27928>`__: Add scrypt (password-based key derivation function) to hashlib module (requires OpenSSL 1.1.0).

source: `bpo-27850 <https://bugs.python.org/issue27850>`__: Remove 3DES from ssl module's default cipher list to counter measure sweet32 attack (CVE-2016-2183).
fr: `bpo-27850 <https://bugs.python.org/27850>`__: Remove 3DES from ssl module's default cipher list to counter measure sweet32 attack (CVE-2016-2183).

source: `bpo-27766 <https://bugs.python.org/issue27766>`__: Add ChaCha20 Poly1305 to ssl module's default ciper list. (Required OpenSSL 1.1.0 or LibreSSL).
fr: `bpo-27766 <https://bugs.python.org/27766>`__: Add ChaCha20 Poly1305 to ssl module's default ciper list. (Required OpenSSL 1.1.0 or LibreSSL).

source: `bpo-25387 <https://bugs.python.org/issue25387>`__: Check return value of winsound.MessageBeep.
fr: `bpo-25387 <https://bugs.python.org/25387>`__: Check return value of winsound.MessageBeep.

source: `bpo-27866 <https://bugs.python.org/issue27866>`__: Add SSLContext.get_ciphers() method to get a list of all enabled ciphers.
fr: `bpo-27866 <https://bugs.python.org/27866>`__: Add SSLContext.get_ciphers() method to get a list of all enabled ciphers.

source: `bpo-27744 <https://bugs.python.org/issue27744>`__: Add AF_ALG (Linux Kernel crypto) to socket module.
fr: `bpo-27744 <https://bugs.python.org/27744>`__: Add AF_ALG (Linux Kernel crypto) to socket module.

source: `bpo-26470 <https://bugs.python.org/issue26470>`__: Port ssl and hashlib module to OpenSSL 1.1.0.
fr: `bpo-26470 <https://bugs.python.org/26470>`__: Port ssl and hashlib module to OpenSSL 1.1.0.

source: `bpo-11620 <https://bugs.python.org/issue11620>`__: Fix support for SND_MEMORY in winsound.PlaySound. Based on a patch by Tim Lesher.
fr: `bpo-11620 <https://bugs.python.org/11620>`__: Fix support for SND_MEMORY in winsound.PlaySound. Based on a patch by Tim Lesher.

source: `bpo-11734 <https://bugs.python.org/issue11734>`__: Add support for IEEE 754 half-precision floats to the struct module. Based on a patch by Eli Stevens.
fr: `bpo-11734 <https://bugs.python.org/11734>`__: Add support for IEEE 754 half-precision floats to the struct module. Based on a patch by Eli Stevens.

source: `bpo-27919 <https://bugs.python.org/issue27919>`__: Deprecated ``extra_path`` distribution option in distutils packaging.
fr: `bpo-27919 <https://bugs.python.org/27919>`__: Deprecated ``extra_path`` distribution option in distutils packaging.

source: `bpo-23229 <https://bugs.python.org/issue23229>`__: Add new ``cmath`` constants: ``cmath.inf`` and ``cmath.nan`` to match ``math.inf`` and ``math.nan``, and also ``cmath.infj`` and ``cmath.nanj`` to match the format used by complex repr.
fr: `bpo-23229 <https://bugs.python.org/23229>`__: Add new ``cmath`` constants: ``cmath.inf`` and ``cmath.nan`` to match ``math.inf`` and ``math.nan``, and also ``cmath.infj`` and ``cmath.nanj`` to match the format used by complex repr.

source: `bpo-27842 <https://bugs.python.org/issue27842>`__: The csv.DictReader now returns rows of type OrderedDict. (Contributed by Steve Holden.)
fr: `bpo-27842 <https://bugs.python.org/27842>`__: The csv.DictReader now returns rows of type OrderedDict. (Contributed by Steve Holden.)

source: `bpo-12885 <https://bugs.python.org/issue12885>`__: Fix error when distutils encounters symlink.
fr: `bpo-12885 <https://bugs.python.org/12885>`__: Fix error when distutils encounters symlink.

source: `bpo-27881 <https://bugs.python.org/issue27881>`__: Fixed possible bugs when setting sqlite3.Connection.isolation_level. Based on patch by Xiang Zhang.
fr: `bpo-27881 <https://bugs.python.org/27881>`__: Fixed possible bugs when setting sqlite3.Connection.isolation_level. Based on patch by Xiang Zhang.

source: `bpo-27861 <https://bugs.python.org/issue27861>`__: Fixed a crash in sqlite3.Connection.cursor() when a factory creates not a cursor. Patch by Xiang Zhang.
fr: `bpo-27861 <https://bugs.python.org/27861>`__: Fixed a crash in sqlite3.Connection.cursor() when a factory creates not a cursor. Patch by Xiang Zhang.

source: `bpo-19884 <https://bugs.python.org/issue19884>`__: Avoid spurious output on OS X with Gnu Readline.
fr: `bpo-19884 <https://bugs.python.org/19884>`__: Avoid spurious output on OS X with Gnu Readline.

source: `bpo-27706 <https://bugs.python.org/issue27706>`__: Restore deterministic behavior of random.Random().seed() for string seeds using seeding version 1. Allows sequences of calls to random() to exactly match those obtained in Python 2. Patch by Nofar Schnider.
fr: `bpo-27706 <https://bugs.python.org/27706>`__: Restore deterministic behavior of random.Random().seed() for string seeds using seeding version 1. Allows sequences of calls to random() to exactly match those obtained in Python 2. Patch by Nofar Schnider.

source: `bpo-10513 <https://bugs.python.org/issue10513>`__: Fix a regression in Connection.commit(). Statements should not be reset after a commit.
fr: `bpo-10513 <https://bugs.python.org/10513>`__: Fix a regression in Connection.commit(). Statements should not be reset after a commit.

source: `bpo-12319 <https://bugs.python.org/issue12319>`__: Chunked transfer encoding support added to http.client.HTTPConnection requests. The urllib.request.AbstractHTTPHandler class does not enforce a Content-Length header any more. If a HTTP request has a file or iterable body, but no Content-Length header, the library now falls back to use chunked transfer- encoding.
fr: `bpo-12319 <https://bugs.python.org/12319>`__: Chunked transfer encoding support added to http.client.HTTPConnection requests. The urllib.request.AbstractHTTPHandler class does not enforce a Content-Length header any more. If a HTTP request has a file or iterable body, but no Content-Length header, the library now falls back to use chunked transfer- encoding.

source: `bpo-27832 <https://bugs.python.org/issue27832>`__: Make ``_normalize`` parameter to ``Fraction`` constuctor keyword-only, so that ``Fraction(2, 3, 4)`` now raises ``TypeError``.
fr: `bpo-27832 <https://bugs.python.org/27832>`__: Make ``_normalize`` parameter to ``Fraction`` constuctor keyword-only, so that ``Fraction(2, 3, 4)`` now raises ``TypeError``.

source: `bpo-27539 <https://bugs.python.org/issue27539>`__: Fix unnormalised ``Fraction.__pow__`` result in the case of negative exponent and negative base.
fr: `bpo-27539 <https://bugs.python.org/27539>`__: Fix unnormalised ``Fraction.__pow__`` result in the case of negative exponent and negative base.

source: `bpo-21718 <https://bugs.python.org/issue21718>`__: cursor.description is now available for queries using CTEs.
fr: `bpo-21718 <https://bugs.python.org/21718>`__: cursor.description is now available for queries using CTEs.

source: `bpo-27819 <https://bugs.python.org/issue27819>`__: In distutils sdists, simply produce the "gztar" (gzipped tar format) distributions on all platforms unless "formats" is supplied.
fr: `bpo-27819 <https://bugs.python.org/27819>`__: In distutils sdists, simply produce the "gztar" (gzipped tar format) distributions on all platforms unless "formats" is supplied.

source: `bpo-2466 <https://bugs.python.org/issue2466>`__: posixpath.ismount now correctly recognizes mount points which the user does not have permission to access.
fr: `bpo-2466 <https://bugs.python.org/2466>`__: posixpath.ismount now correctly recognizes mount points which the user does not have permission to access.

source: `bpo-9998 <https://bugs.python.org/issue9998>`__: On Linux, ctypes.util.find_library now looks in LD_LIBRARY_PATH for shared libraries.
fr: `bpo-9998 <https://bugs.python.org/9998>`__: On Linux, ctypes.util.find_library now looks in LD_LIBRARY_PATH for shared libraries.

source: `bpo-27573 <https://bugs.python.org/issue27573>`__: exit message for code.interact is now configurable.
fr: `bpo-27573 <https://bugs.python.org/27573>`__: exit message for code.interact is now configurable.

source: `bpo-27930 <https://bugs.python.org/issue27930>`__: Improved behaviour of logging.handlers.QueueListener. Thanks to Paulo Andrade and Petr Viktorin for the analysis and patch.
fr: `bpo-27930 <https://bugs.python.org/27930>`__: Improved behaviour of logging.handlers.QueueListener. Thanks to Paulo Andrade and Petr Viktorin for the analysis and patch.

source: `bpo-6766 <https://bugs.python.org/issue6766>`__: Distributed reference counting added to multiprocessing to support nesting of shared values / proxy objects.
fr: `bpo-6766 <https://bugs.python.org/6766>`__: Distributed reference counting added to multiprocessing to support nesting of shared values / proxy objects.

source: `bpo-21201 <https://bugs.python.org/issue21201>`__: Improves readability of multiprocessing error message. Thanks to Wojciech Walczak for patch.
fr: `bpo-21201 <https://bugs.python.org/21201>`__: Improves readability of multiprocessing error message. Thanks to Wojciech Walczak for patch.

source: `bpo-27456 <https://bugs.python.org/issue27456>`__: asyncio: Set TCP_NODELAY by default.
fr: `bpo-27456 <https://bugs.python.org/27456>`__: asyncio: Set TCP_NODELAY by default.

source: `bpo-15308 <https://bugs.python.org/issue15308>`__: Add 'interrupt execution' (^C) to Shell menu. Patch by Roger Serwy, updated by Bayard Randel.
fr: `bpo-15308 <https://bugs.python.org/15308>`__: Add 'interrupt execution' (^C) to Shell menu. Patch by Roger Serwy, updated by Bayard Randel.

source: `bpo-27922 <https://bugs.python.org/issue27922>`__: Stop IDLE tests from 'flashing' gui widgets on the screen.
fr: `bpo-27922 <https://bugs.python.org/27922>`__: Stop IDLE tests from 'flashing' gui widgets on the screen.

source: `bpo-27891 <https://bugs.python.org/issue27891>`__: Consistently group and sort imports within idlelib modules.
fr: `bpo-27891 <https://bugs.python.org/27891>`__: Consistently group and sort imports within idlelib modules.

source: `bpo-17642 <https://bugs.python.org/issue17642>`__: add larger font sizes for classroom projection.
fr: `bpo-17642 <https://bugs.python.org/17642>`__: add larger font sizes for classroom projection.

source: `bpo-25564 <https://bugs.python.org/issue25564>`__: In section on IDLE -- console differences, mention that using exec means that __builtins__ is defined for each statement.
fr: `bpo-25564 <https://bugs.python.org/25564>`__: In section on IDLE -- console differences, mention that using exec means that __builtins__ is defined for each statement.

source: `bpo-27821 <https://bugs.python.org/issue27821>`__: Fix 3.6.0a3 regression that prevented custom key sets from being selected when no custom theme was defined.
fr: `bpo-27821 <https://bugs.python.org/27821>`__: Fix 3.6.0a3 regression that prevented custom key sets from being selected when no custom theme was defined.

source: `bpo-26900 <https://bugs.python.org/issue26900>`__: Excluded underscored names and other private API from limited API.
fr: `bpo-26900 <https://bugs.python.org/26900>`__: Excluded underscored names and other private API from limited API.

source: `bpo-26027 <https://bugs.python.org/issue26027>`__: Add support for path-like objects in PyUnicode_FSConverter() & PyUnicode_FSDecoder().
fr: `bpo-26027 <https://bugs.python.org/26027>`__: Add support for path-like objects in PyUnicode_FSConverter() & PyUnicode_FSDecoder().

source: `bpo-27427 <https://bugs.python.org/issue27427>`__: Additional tests for the math module. Patch by Francisco Couzo.
fr: `bpo-27427 <https://bugs.python.org/27427>`__: Additional tests for the math module. Patch by Francisco Couzo.

source: `bpo-27953 <https://bugs.python.org/issue27953>`__: Skip math and cmath tests that fail on OS X 10.4 due to a poor libm implementation of tan.
fr: `bpo-27953 <https://bugs.python.org/27953>`__: Skip math and cmath tests that fail on OS X 10.4 due to a poor libm implementation of tan.

source: `bpo-26040 <https://bugs.python.org/issue26040>`__: Improve test_math and test_cmath coverage and rigour. Patch by Jeff Allen.
fr: `bpo-26040 <https://bugs.python.org/26040>`__: Improve test_math and test_cmath coverage and rigour. Patch by Jeff Allen.

source: `bpo-27787 <https://bugs.python.org/issue27787>`__: Call gc.collect() before checking each test for "dangling threads", since the dangling threads are weak references.
fr: `bpo-27787 <https://bugs.python.org/27787>`__: Call gc.collect() before checking each test for "dangling threads", since the dangling threads are weak references.

source: `bpo-27566 <https://bugs.python.org/issue27566>`__: Fix clean target in freeze makefile (patch by Lisa Roach)
fr: `bpo-27566 <https://bugs.python.org/27566>`__: Fix clean target in freeze makefile (patch by Lisa Roach)

source: `bpo-27705 <https://bugs.python.org/issue27705>`__: Update message in validate_ucrtbase.py
fr: `bpo-27705 <https://bugs.python.org/27705>`__: Update message in validate_ucrtbase.py

source: `bpo-27976 <https://bugs.python.org/issue27976>`__: Deprecate building _ctypes with the bundled copy of libffi on non-OSX UNIX platforms.
fr: `bpo-27976 <https://bugs.python.org/27976>`__: Deprecate building _ctypes with the bundled copy of libffi on non-OSX UNIX platforms.

source: `bpo-27983 <https://bugs.python.org/issue27983>`__: Cause lack of llvm-profdata tool when using clang as required for PGO linking to be a configure time error rather than make time when --with-optimizations is enabled. Also improve our ability to find the llvm-profdata tool on MacOS and some Linuxes.
fr: `bpo-27983 <https://bugs.python.org/27983>`__: Cause lack of llvm-profdata tool when using clang as required for PGO linking to be a configure time error rather than make time when --with-optimizations is enabled. Also improve our ability to find the llvm-profdata tool on MacOS and some Linuxes.

source: `bpo-21590 <https://bugs.python.org/issue21590>`__: Support for DTrace and SystemTap probes.
fr: `bpo-21590 <https://bugs.python.org/21590>`__: Support for DTrace and SystemTap probes.

source: `bpo-26307 <https://bugs.python.org/issue26307>`__: The profile-opt build now applies PGO to the built-in modules.
fr: `bpo-26307 <https://bugs.python.org/26307>`__: The profile-opt build now applies PGO to the built-in modules.

source: `bpo-27917 <https://bugs.python.org/issue27917>`__: Set platform triplets for Android builds.
fr: `bpo-27917 <https://bugs.python.org/27917>`__: Set platform triplets for Android builds.

source: `bpo-25825 <https://bugs.python.org/issue25825>`__: Update references to the $(LIBPL) installation path on AIX. This path was changed in 3.2a4.
fr: `bpo-25825 <https://bugs.python.org/25825>`__: Update references to the $(LIBPL) installation path on AIX. This path was changed in 3.2a4.

source: `bpo-21122 <https://bugs.python.org/issue21122>`__: Fix LTO builds on OS X.
fr: `bpo-21122 <https://bugs.python.org/21122>`__: Fix LTO builds on OS X.

source: `bpo-17128 <https://bugs.python.org/issue17128>`__: Build OS X installer with a private copy of OpenSSL. Also provide a sample Install Certificates command script to install a set of root certificates from the third-party certifi module.
fr: `bpo-17128 <https://bugs.python.org/17128>`__: Build OS X installer with a private copy of OpenSSL. Also provide a sample Install Certificates command script to install a set of root certificates from the third-party certifi module.

source: `bpo-27952 <https://bugs.python.org/issue27952>`__: Get Tools/scripts/fixcid.py working with Python 3 and the current "re" module, avoid invalid Python backslash escapes, and fix a bug parsing escaped C quote signs.
fr: `bpo-27952 <https://bugs.python.org/27952>`__: Get Tools/scripts/fixcid.py working with Python 3 and the current "re" module, avoid invalid Python backslash escapes, and fix a bug parsing escaped C quote signs.

source: `bpo-28065 <https://bugs.python.org/issue28065>`__: Update xz dependency to 5.2.2 and build it from source.
fr: `bpo-28065 <https://bugs.python.org/28065>`__: Update xz dependency to 5.2.2 and build it from source.
