Repository: python/python-docs-fr
Catalog: tutorial/classes.po
Languages: fr

source: Use :func:`issubclass` to check class inheritance: ``issubclass(bool, int)`` is ``True`` since :class:`bool` is a subclass of :class:`int`. However, ``issubclass(float, int)`` is ``False`` since :class:`float` is not a subclass of :class:`int`.
fr: utilisez :func:`issubclass` pour tester l'héritage d'une classe : ``issubclass(bool, int)`` renvoie ``True`` car la classe :class:`bool` est une sous-classe de :class:`int`. Cependant, ``issubclass(float, int)`` renvoie ``False`` car :class:`float` n'est pas une sous-classe de :class:`int`.

source: Multiple Inheritance
fr: Héritage multiple

source: Python supports a form of multiple inheritance as well. A class definition with multiple base classes looks like this::
fr: Python gère également une forme d'héritage multiple. Une définition de classe ayant plusieurs classes de base est de cette forme ::

source: For most purposes, in the simplest cases, you can think of the search for attributes inherited from a parent class as depth-first, left-to-right, not searching twice in the same class where there is an overlap in the hierarchy. Thus, if an attribute is not found in :class:`DerivedClassName`, it is searched for in :class:`Base1`, then (recursively) in the base classes of :class:`Base1`, and if it was not found there, it was searched for in :class:`Base2`, and so on.
fr: Dans la plupart des cas, vous pouvez vous représenter la recherche d'attributs dans les classes parentes comme étant : le plus profond d'abord, de gauche à droite, sans chercher deux fois dans la même classe si elle apparaît plusieurs fois dans la hiérarchie. Ainsi, si un attribut n'est pas trouvé dans :class:`DerivedClassName`, il est recherché dans :class:`Base1`, puis (récursivement) dans les classes de base de :class:`Base1` ; s'il n'y est pas trouvé, il est recherché dans :class:`Base2` et ses classes de base, et ainsi de suite.

source: In fact, it is slightly more complex than that; the method resolution order changes dynamically to support cooperative calls to :func:`super`. This approach is known in some other multiple-inheritance languages as call-next-method and is more powerful than the super call found in single-inheritance languages.
fr: Dans les faits, c'est un peu plus complexe que ça ; l'ordre de la recherche (*method resolution order, ou MRO* en anglais) change dynamiquement pour gérer des appels coopératifs à :func:`super`. Cette approche est connue sous le nom de la "appel de la méthode la plus proche" (*call-next-method* en anglais) dans d'autres langages avec héritage multiple. Elle est plus puissante que le simple appel à super que l'on trouve dans les langages à héritage simple.

source: Dynamic ordering is necessary because all cases of multiple inheritance exhibit one or more diamond relationships (where at least one of the parent classes can be accessed through multiple paths from the bottommost class). For example, all classes inherit from :class:`object`, so any case of multiple inheritance provides more than one path to reach :class:`object`. To keep the base classes from being accessed more than once, the dynamic algorithm linearizes the search order in a way that preserves the left-to-right ordering specified in each class, that calls each parent only once, and that is monotonic (meaning that a class can be subclassed without affecting the precedence order of its parents). Taken together, these properties make it possible to design reliable and extensible classes with multiple inheritance. For more detail, see https://www.python.org/download/releases/2.3/mro/.
fr: L'ordre défini dynamiquement est nécessaire car tous les cas d'héritage multiple comportent une ou plusieurs relations en losange (où au moins une classe peut être accédée à partir de plusieurs chemins en partant de la classe la plus basse). Par exemple, puisque toutes les classes héritent de :class:`object`, tout héritage multiple ouvre plusieurs chemins pour atteindre :class:`object`. Pour qu'une classe de base ne soit pas appelée plusieurs fois, l'algorithme dynamique linéarise l'ordre de recherche d'une façon qui préserve l'ordre d'héritage, de la gauche vers la droite, spécifié dans chaque classe, qui appelle chaque classe parente une seule fois, qui est monotone (ce qui signifie qu'une classe peut être sous-classée sans affecter l'ordre d'héritage de ses parents). Prises ensemble, ces propriétés permettent de concevoir des classes de façon fiable et extensible dans un contexte d'héritage multiple. Pour plus de détails, consultez http://www.python.org/download/releases/2.3/mro/.

source: Private Variables
fr: Variables privées

source: "Private" instance variables that cannot be accessed except from inside an object don't exist in Python. However, there is a convention that is followed by most Python code: a name prefixed with an underscore (e.g. ``_spam``) should be treated as a non-public part of the API (whether it is a function, a method or a data member). It should be considered an implementation detail and subject to change without notice.
fr: Les membres "privés", qui ne peuvent être accédés que depuis l'intérieur d'un objet, n'existent pas en Python. Toutefois, il existe une convention respectée par la majorité du code Python : un nom préfixé par un tiret bas (comme ``_spam``) doit être considéré comme une partie non publique de l'API (qu'il s'agisse d'une fonction, d'une méthode ou d'un attribut 'données'). Il doit être vu comme un détail d'implémentation pouvant faire l'objet de modifications futures sans préavis.

source: Since there is a valid use-case for class-private members (namely to avoid name clashes of names with names defined by subclasses), there is limited support for such a mechanism, called :dfn:`name mangling`. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with leading underscore(s) stripped. This mangling is done without regard to the syntactic position of the identifier, as long as it occurs within the definition of a class.
fr: Dès lors qu'il y a un cas d'utilisation valable pour avoir des attributs privés aux classes (notamment pour éviter des conflits avec des noms définis dans des sous-classes), il existe un support (certes limité) pour un tel mécanisme, appelé :dfn:`name mangling`. Tout identifiant de la forme ``__spam`` (avec au moins deux tirets bas en tête et au plus un à la fin) est remplacé textuellement par ``_classname__spam``, où ``classname`` est le nom de la classe sans le ou les premiers tirets-bas. Ce "découpage" est effectué sans tenir compte de la position syntaxique de l'identifiant, tant qu'il est présent dans la définition d'une classe.

source: Name mangling is helpful for letting subclasses override methods without breaking intraclass method calls. For example::
fr: Ce changement de nom est utile pour permettre à des sous-classes de surcharger des méthodes sans casser les appels de méthodes à l'intérieur d'une classe. Par exemple ::

source: The above example would work even if ``MappingSubclass`` were to introduce a ``__update`` identifier since it is replaced with ``_Mapping__update`` in the ``Mapping`` class and ``_MappingSubclass__update`` in the ``MappingSubclass`` class respectively.
fr: L'exemple si dessus fonctionnerait même si ``MappingSubclass`` introduisait un identifieur ``__update`` puisqu'il a été remplacé avec ``_Mapping__update`` dans la classe ``Mapping`` et ``_MappingSubclass__update`` dans la classe ``MappingSubclass`` respectivement.

source: Note that the mangling rules are designed mostly to avoid accidents; it still is possible to access or modify a variable that is considered private. This can even be useful in special circumstances, such as in the debugger.
fr: Notez que ces règles sont conçues avant tout pour éviter les accidents ; il reste possible d'accéder ou de modifier une variable considérée comme privée. Ceci peut même être utile dans certaines circonstances, comme au sein du débogueur.

source: Notice that code passed to ``exec()`` or ``eval()`` does not consider the classname of the invoking class to be the current class; this is similar to the effect of the ``global`` statement, the effect of which is likewise restricted to code that is byte-compiled together. The same restriction applies to ``getattr()``, ``setattr()`` and ``delattr()``, as well as when referencing ``__dict__`` directly.
fr: Remarquez que le code que vous passez à ``exec()``, ``eval()`` ne considère pas le nom de la classe appelante comme étant la classe courante ; le même effet s'applique à la directive ``global`` dont l'effet est, de la même façon, restreint au code compilé dans le même ensemble de byte-code. Les mêmes restrictions s'appliquent à ``getattr()``, ``setattr()`` et ``delattr()``, ainsi qu'aux références directes à ``__dict__``.

source: Odds and Ends
fr: Trucs et astuces

source: Sometimes it is useful to have a data type similar to the Pascal "record" or C "struct", bundling together a few named data items. An empty class definition will do nicely::
fr: Il est parfois utile d'avoir un type de donnée similaire au "record" du Pascal ou au *struct* du C, qui regroupent ensemble quelques attributs 'données' nommés. La définition d'une classe vide remplit parfaitement ce besoin ::

source: A piece of Python code that expects a particular abstract data type can often be passed a class that emulates the methods of that data type instead. For instance, if you have a function that formats some data from a file object, you can define a class with methods :meth:`read` and :meth:`!readline` that get the data from a string buffer instead, and pass it as an argument.
fr: À du code Python qui s'attend à recevoir un type de donnée abstrait spécifique, on peut souvent fournir une classe qui simule les méthodes de ce type. Par exemple, à une fonction qui formate des données extraites d'un objet fichier, vous pouvez lui passer comme argument une instance d'une classe qui implémente les méthodes :meth:`read` et :meth:`!readline` en puisant ses données à partir d'un tampon de chaînes de caractères.

source: Instance method objects have attributes, too: ``m.__self__`` is the instance object with the method :meth:`m`, and ``m.__func__`` is the function object corresponding to the method.
fr: Les objets méthodes d'instances ont aussi des attributs : ``m.__self__`` est l'instance d'objet avec la méthode :meth:`m` et ``m.__func__`` est l'objet fonction correspondant à la méthode.

source: Iterators
fr: Itérateurs

source: By now you have probably noticed that most container objects can be looped over using a :keyword:`for` statement::
fr: Vous avez maintenant certainement remarqué que l'on peut itérer sur la plupart des objets conteneurs en utilisant une instruction :keyword:`for` ::

source: This style of access is clear, concise, and convenient. The use of iterators pervades and unifies Python. Behind the scenes, the :keyword:`for` statement calls :func:`iter` on the container object. The function returns an iterator object that defines the method :meth:`~iterator.__next__` which accesses elements in the container one at a time. When there are no more elements, :meth:`~iterator.__next__` raises a :exc:`StopIteration` exception which tells the :keyword:`!for` loop to terminate. You can call the :meth:`~iterator.__next__` method using the :func:`next` built-in function; this example shows how it all works::
fr: Ce style est simple, concis et pratique. L'utilisation d'itérateurs imprègne et unifie Python. En arrière plan, l'instruction :keyword:`for` appelle la fonction :func:`iter` sur l'objet conteneur. Cette fonction renvoie un objet itérateur qui définit la méthode :meth:`~iterator.__next__`, laquelle accède aux éléments du conteneur un par un. Lorsqu'il n'y a plus d'élément, :meth:`~iterator.__next__` lève une exception :exc:`StopIteration` qui indique à la boucle de l'instruction :keyword:`!for` de se terminer. Vous pouvez appeler la méthode :meth:`~iterator.__next__` en utilisant la fonction native :func:`next`. Cet exemple montre comment tout cela fonctionne ::

source: Having seen the mechanics behind the iterator protocol, it is easy to add iterator behavior to your classes. Define an :meth:`__iter__` method which returns an object with a :meth:`~iterator.__next__` method. If the class defines :meth:`__next__`, then :meth:`__iter__` can just return ``self``::
fr: Une fois compris les mécanismes de gestion des itérateurs, il est simple d'ajouter ce comportement à vos classes. Définissez une méthode :meth:`__iter__` qui renvoie un objet disposant d'une méthode :meth:`~iterator.__next__`. Si la classe définit elle-même la méthode :meth:`__next__`, alors :meth:`__iter__` peut simplement renvoyer ``self`` ::

source: Generators
fr: Générateurs

source: :term:`Generator`\s are a simple and powerful tool for creating iterators. They are written like regular functions but use the :keyword:`yield` statement whenever they want to return data. Each time :func:`next` is called on it, the generator resumes where it left off (it remembers all the data values and which statement was last executed). An example shows that generators can be trivially easy to create::
fr: Les :term:`générateurs <generator>` sont des outils simples et puissants pour créer des itérateurs. Ils sont écrits comme des fonctions classiques mais utilisent l'instruction :keyword:`yield` lorsqu'ils veulent renvoyer des données. À chaque fois qu'il est appelé par :func:`next`, le générateur reprend son exécution là où il s'était arrêté (en conservant tout son contexte d'exécution). Un exemple montre très bien combien les générateurs sont simples à créer ::

source: Anything that can be done with generators can also be done with class-based iterators as described in the previous section. What makes generators so compact is that the :meth:`__iter__` and :meth:`~generator.__next__` methods are created automatically.
fr: Tout ce qui peut être fait avec des générateurs peut également être fait avec des itérateurs basés sur des classes, comme décrit dans le paragraphe précédent. Ce qui rend les générateurs si compacts, c'est que les méthodes :meth:`__iter__` et :meth:`~generator.__next__` sont créées automatiquement.

source: Another key feature is that the local variables and execution state are automatically saved between calls. This made the function easier to write and much more clear than an approach using instance variables like ``self.index`` and ``self.data``.
fr: Une autre fonctionnalité clé est que les variables locales ainsi que le contexte d'exécution sont sauvegardés automatiquement entre les appels. Cela simplifie d'autant plus l'écriture de ces fonctions et rend leur code beaucoup plus lisible qu'avec une approche utilisant des variables d'instance telles que ``self.index`` et ``self.data``.

source: In addition to automatic method creation and saving program state, when generators terminate, they automatically raise :exc:`StopIteration`. In combination, these features make it easy to create iterators with no more effort than writing a regular function.
fr: En plus de la création automatique de méthodes et de la sauvegarde du contexte d'exécution, les générateurs lèvent automatiquement une exception :exc:`StopIteration` lorsqu'ils terminent leur exécution. La combinaison de ces fonctionnalités rend très simple la création d'itérateurs, sans plus d'effort que l'écriture d'une fonction classique.

source: Generator Expressions
fr: Expressions et générateurs

source: Some simple generators can be coded succinctly as expressions using a syntax similar to list comprehensions but with parentheses instead of square brackets. These expressions are designed for situations where the generator is used right away by an enclosing function. Generator expressions are more compact but less versatile than full generator definitions and tend to be more memory friendly than equivalent list comprehensions.
fr: Des générateurs simples peuvent être codés très rapidement avec des expressions utilisant la même syntaxe que les compréhensions de listes, mais en utilisant des parenthèses à la place des crochets. Ces expressions sont conçues pour des situations où le générateur est utilisé tout de suite dans une fonction. Ces expressions sont plus compactes mais moins souples que des définitions complètes de générateurs et ont tendance à être plus économes en mémoire que leur équivalent en compréhension de listes.

source: Examples::
fr: Exemples ::

source: Footnotes
fr: Notes de bas de page

source: Except for one thing. Module objects have a secret read-only attribute called :attr:`~object.__dict__` which returns the dictionary used to implement the module's namespace; the name :attr:`~object.__dict__` is an attribute but not a global name. Obviously, using this violates the abstraction of namespace implementation, and should be restricted to things like post-mortem debuggers.
fr: Il existe une exception : les modules disposent d'un attribut secret en lecture seule appelé :attr:`~object.__dict__` qui renvoie le dictionnaire utilisé pour implémenter l'espace de nommage du module ; le nom :attr:`~object.__dict__` est un attribut mais pas un nom global. Évidemment, si vous l'utilisez, vous brisez l'abstraction de l'implémentation des espaces de nommage. Il est donc réservé à des choses comme les débogueurs post-mortem.
