Repository: python/python-docs-fr
Catalog: tutorial/controlflow.po
Languages: fr

source: This helps users with small displays and makes it possible to have several code files side-by-side on larger displays.
fr: Vous facilitez ainsi la lecture pour les utilisateurs qui n'ont qu'un petit écran et, pour les autres, cela leur permet de visualiser plusieurs fichiers côte à côte ;

source: Use blank lines to separate functions and classes, and larger blocks of code inside functions.
fr: utilisez des lignes vides pour séparer les fonctions et les classes, ou pour scinder de gros blocs de code à l'intérieur de fonctions ;

source: When possible, put comments on a line of their own.
fr: lorsque c'est possible, placez les commentaires sur leurs propres lignes ;

source: Use docstrings.
fr: utilisez les chaînes de documentation ;

source: Use spaces around operators and after commas, but not directly inside bracketing constructs: ``a = f(1, 2) + g(3, 4)``.
fr: utilisez des espaces autour des opérateurs et après les virgules, mais pas juste à l'intérieur des parenthèses : ``a = f(1, 2) + g(3, 4)`` ;

source: Name your classes and functions consistently; the convention is to use ``UpperCamelCase`` for classes and ``lowercase_with_underscores`` for functions and methods. Always use ``self`` as the name for the first method argument (see :ref:`tut-firstclasses` for more on classes and methods).
fr: nommez toujours vos classes et fonctions de la même manière ; la convention est d'utiliser une notation ``UpperCamelCase`` pour les classes, et ``minuscules_avec_trait_bas`` pour les fonctions et méthodes. Utilisez toujours ``self`` comme nom du premier argument des méthodes (voyez :ref:`tut-firstclasses` pour en savoir plus sur les classes et les méthodes) ;

source: Don't use fancy encodings if your code is meant to be used in international environments. Python's default, UTF-8, or even plain ASCII work best in any case.
fr: n’utilisez pas d'encodage exotique dès lors que votre code est censé être utilisé dans des environnements internationaux. Par défaut, Python travaille en UTF-8. Pour couvrir tous les cas, préférez le simple ASCII ;

source: Likewise, don't use non-ASCII characters in identifiers if there is only the slightest chance people speaking a different language will read or maintain the code.
fr: de la même manière, n'utilisez que des caractères ASCII pour vos noms de variables s'il est envisageable qu'une personne parlant une autre langue lise ou doive modifier votre code.

source: Footnotes
fr: Notes

source: Actually, *call by object reference* would be a better description, since if a mutable object is passed, the caller will see any changes the callee makes to it (items inserted into a list).
fr: En fait, *appels par référence d'objets* serait sans doute une description plus juste dans la mesure où, si un objet mutable est passé en argument, l'appelant verra toutes les modifications qui lui auront été apportées par l'appelé (insertion d'éléments dans une liste…).
