Repository: python/python-docs-fr
Catalog: tutorial/controlflow.po
Languages: fr

source: More Control Flow Tools
fr: D'autres outils de contrôle de flux

source: :keyword:`!if` Statements
fr: L'instruction :keyword:`!if`

source: Perhaps the most well-known statement type is the :keyword:`if` statement. For example::
fr: L'instruction :keyword:`if` est sans doute la plus connue. Par exemple ::

source: There can be zero or more :keyword:`elif` parts, and the :keyword:`else` part is optional. The keyword ':keyword:`!elif`' is short for 'else if', and is useful to avoid excessive indentation. An :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... sequence is a substitute for the ``switch`` or ``case`` statements found in other languages.
fr: Il peut y avoir un nombre quelconque de parties :keyword:`elif` et la partie :keyword:`else` est facultative. Le mot clé :keyword:`!elif` est un raccourci pour *else if*, et permet de gagner un niveau d'indentation. Une séquence :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... est par ailleurs équivalente aux instructions ``switch`` ou ``case`` disponibles dans d'autres langages.

source: If you're comparing the same value to several constants, or checking for specific types or attributes, you may also find the :keyword:`!match` statement useful. For more details see :ref:`tut-match`.
fr: Pour les comparaisons avec beaucoup de constantes, ainsi que les tests d'appartenance à un type ou de forme d'un attribut, l'instruction :keyword:`!match` décrite plus bas peut se révéler utile (voir :ref:`tut-match`).

source: :keyword:`!for` Statements
fr: L'instruction :keyword:`!for`

source: The :keyword:`for` statement in Python differs a bit from what you may be used to in C or Pascal. Rather than always iterating over an arithmetic progression of numbers (like in Pascal), or giving the user the ability to define both the iteration step and halting condition (as C), Python's :keyword:`!for` statement iterates over the items of any sequence (a list or a string), in the order that they appear in the sequence. For example (no pun intended):
fr: L'instruction :keyword:`for` que propose Python est un peu différente de celle que l'on peut trouver en C ou en Pascal. Au lieu de toujours itérer sur une suite arithmétique de nombres (comme en Pascal), ou de donner à l'utilisateur la possibilité de définir le pas d'itération et la condition de fin (comme en C), l'instruction :keyword:`!for` en Python itère sur les éléments d'une séquence (qui peut être une liste, une chaîne de caractères…), dans l'ordre dans lequel ils apparaissent dans la séquence. Par exemple :

source: Code that modifies a collection while iterating over that same collection can be tricky to get right. Instead, it is usually more straight-forward to loop over a copy of the collection or to create a new collection::
fr: Écrire du code qui modifie une collection tout en itérant dessus peut s'avérer délicat. Il est généralement plus simple de boucler sur une copie de la collection ou de créer une nouvelle collection ::

source: The :func:`range` Function
fr: La fonction :func:`range`

source: If you do need to iterate over a sequence of numbers, the built-in function :func:`range` comes in handy. It generates arithmetic progressions::
fr: Si vous devez itérer sur une suite de nombres, la fonction native :func:`range` est faite pour cela. Elle génère des suites arithmétiques ::

source: The given end point is never part of the generated sequence; ``range(10)`` generates 10 values, the legal indices for items of a sequence of length 10. It is possible to let the range start at another number, or to specify a different increment (even negative; sometimes this is called the 'step')::
fr: Le dernier élément fourni en paramètre ne fait jamais partie de la liste générée ; ``range(10)`` génère une liste de 10 valeurs, dont les valeurs vont de 0 à 9. Il est possible de spécifier une valeur de début et une valeur d'incrément différentes (y compris négative pour cette dernière, que l'on appelle également parfois le « pas ») ::

source: To iterate over the indices of a sequence, you can combine :func:`range` and :func:`len` as follows::
fr: Pour itérer sur les indices d'une séquence, on peut combiner les fonctions :func:`range` et :func:`len` ::

source: In most such cases, however, it is convenient to use the :func:`enumerate` function, see :ref:`tut-loopidioms`.
fr: Cependant, dans la plupart des cas, il est plus pratique d'utiliser la fonction :func:`enumerate`. Voyez pour cela :ref:`tut-loopidioms`.

source: A strange thing happens if you just print a range::
fr: Une chose étrange se produit lorsqu'on affiche un *range* ::

source: In many ways the object returned by :func:`range` behaves as if it is a list, but in fact it isn't. It is an object which returns the successive items of the desired sequence when you iterate over it, but it doesn't really make the list, thus saving space.
fr: L'objet renvoyé par :func:`range` se comporte presque comme une liste, mais ce n'en est pas une. Cet objet génère les éléments de la séquence au fur et à mesure de l'itération, sans réellement produire la liste en tant que telle, économisant ainsi de l'espace.

source: We say such an object is :term:`iterable`, that is, suitable as a target for functions and constructs that expect something from which they can obtain successive items until the supply is exhausted. We have seen that the :keyword:`for` statement is such a construct, while an example of a function that takes an iterable is :func:`sum`::
fr: On appelle de tels objets des :term:`itérables <iterable>`, c'est-à-dire des objets qui conviennent à des fonctions ou constructions qui s'attendent à quelque chose duquel elles peuvent tirer des éléments, successivement, jusqu'à épuisement. Nous avons vu que l'instruction :keyword:`for` est une de ces constructions, et un exemple de fonction qui prend un itérable en paramètre est :func:`sum` ::

source: Later we will see more functions that return iterables and take iterables as arguments. In chapter :ref:`tut-structures`, we will discuss in more detail about :func:`list`.
fr: Plus loin nous voyons d'autres fonctions qui donnent des itérables ou en prennent en paramètre. De plus amples détails sur :func:`list` sont donnés dans :ref:`tut-structures`.

source: :keyword:`!pass` Statements
fr: L'instruction :keyword:`!pass`

source: The :keyword:`pass` statement does nothing. It can be used when a statement is required syntactically but the program requires no action. For example::
fr: L'instruction :keyword:`pass` ne fait rien. Elle peut être utilisée lorsqu'une instruction est nécessaire pour fournir une syntaxe correcte, mais qu'aucune action ne doit être effectuée. Par exemple ::

source: This is commonly used for creating minimal classes::
fr: On utilise couramment cette instruction pour créer des classes minimales ::

source: Another place :keyword:`pass` can be used is as a place-holder for a function or conditional body when you are working on new code, allowing you to keep thinking at a more abstract level. The :keyword:`!pass` is silently ignored::
fr: Un autre cas d'utilisation du :keyword:`pass` est de réserver un espace en phase de développement pour une fonction ou un traitement conditionnel, vous permettant ainsi de construire votre code à un niveau plus abstrait. L'instruction :keyword:`!pass` est alors ignorée silencieusement ::

source: :keyword:`!match` Statements
fr: L'instruction :keyword:`!match`

source: A :keyword:`match` statement takes an expression and compares its value to successive patterns given as one or more case blocks. This is superficially similar to a switch statement in C, Java or JavaScript (and many other languages), but it's more similar to pattern matching in languages like Rust or Haskell. Only the first pattern that matches gets executed and it can also extract components (sequence elements or object attributes) from the value into variables.
fr: L'instruction :keyword:`match` confronte la valeur d'une expression à plusieurs filtres successifs donnés par les instructions ``case``. L’instruction ``match`` peut faire penser au ``switch`` que l'on trouve dans les langages C, Java, JavaScript et autres, mais elle ressemble plus au filtrage par motif des langages Rust et Haskell. Seul le premier filtre qui correspond est exécuté et elle permet aussi d'extraire dans des variables des composantes de la valeur, comme les éléments d'une séquence ou les attributs d'un objet.

source: The simplest form compares a subject value against one or more literals::
fr: Dans sa plus simple expression, une instruction ``match`` compare une valeur à des littéraux ::

source: Note the last block: the "variable name" ``_`` acts as a *wildcard* and never fails to match. If no case matches, none of the branches is executed.
fr: Remarquez l'emploi du signe souligné ``_`` dans le dernier bloc, qui est normalement un nom de variable spécial. Ici, c'est un filtre *attrape-tout*, c'est-à-dire qu'il accepte toutes les valeurs. Si aucun des filtres dans les ``case`` ne fonctionne, aucune des branches indentées sous les ``case`` n'est exécutée.

source: You can combine several literals in a single pattern using ``|`` ("or")::
fr: On peut combiner plusieurs littéraux en un seul filtre avec le signe ``|``, qui se lit OU ::

source: Patterns can look like unpacking assignments, and can be used to bind variables::
fr: Les filtres peuvent prendre une forme similaire aux affectations multiples, et provoquer la liaison de variables ::

source: Study that one carefully! The first pattern has two literals, and can be thought of as an extension of the literal pattern shown above. But the next two patterns combine a literal and a variable, and the variable *binds* a value from the subject (``point``). The fourth pattern captures two values, which makes it conceptually similar to the unpacking assignment ``(x, y) = point``.
fr: Observez bien cet exemple ! Le premier filtre contient simplement deux littéraux. C'est une sorte d'extension des filtres littéraux. Mais les deux filtres suivants mélangent un littéral et un nom de variable. Si un tel filtre réussit, il provoque l'affectation à la variable. Le quatrième filtre est constitué de deux variables, ce qui le fait beaucoup ressembler à l'affectation multiple ``(x, y) = point``.

source: If you are using classes to structure your data you can use the class name followed by an argument list resembling a constructor, but with the ability to capture attributes into variables::
fr: Si vous structurez vos données par l'utilisation de classes, vous pouvez former des filtres avec le nom de la classe suivi d'une liste d'arguments. Ces filtres sont semblables à l'appel d'un constructeur, et permettent de capturer des attributs ::

source: You can use positional parameters with some builtin classes that provide an ordering for their attributes (e.g. dataclasses). You can also define a specific position for attributes in patterns by setting the ``__match_args__`` special attribute in your classes. If it's set to ("x", "y"), the following patterns are all equivalent (and all bind the ``y`` attribute to the ``var`` variable)::
fr: Un certain nombre de classes natives, notamment les classes de données, prennent en charge le filtrage par arguments positionnels en définissant un ordre des attributs. Vous pouvez ajouter cette possibilité à vos propres classes en y définissant l'attribut spécial ``__match_args__``. Par exemple, le mettre à ``("x", "y")`` rend tous les filtres ci-dessous équivalents (en particulier, tous provoquent la liaison de l'attribut ``y`` à la variable ``var``) ::

source: A recommended way to read patterns is to look at them as an extended form of what you would put on the left of an assignment, to understand which variables would be set to what. Only the standalone names (like ``var`` above) are assigned to by a match statement. Dotted names (like ``foo.bar``), attribute names (the ``x=`` and ``y=`` above) or class names (recognized by the "(...)" next to them like ``Point`` above) are never assigned to.
fr: Une méthode préconisée pour lire les filtres est de les voir comme une extension de ce que l'on peut placer à gauche du signe ``=`` dans une affectation. Cela permet de visualiser quelles variables sont liées à quoi. Seuls les noms simples, comme ``var`` ci-dessus, sont des variables susceptibles d'être liées à une valeur. Il n'y a jamais de liaison pour les noms qualifiés (avec un point, comme dans ``truc.machin``), les noms d'attributs (tels que ``x=`` et ``y=`` dans l'exemple précédent) et les noms de classes (identifiés par les parenthèses à leur droite, comme ``Point``).

source: We can add an ``if`` clause to a pattern, known as a "guard". If the guard is false, ``match`` goes on to try the next case block. Note that value capture happens before the guard is evaluated::
fr: Un filtre peut comporter un ``if``, qui introduit ce que l'on appelle une garde. Si le filtre réussit, la garde est alors testée et, si elle s'évalue à une valeur fausse, l'exécution continue au bloc ``case`` suivant. Les variables sont liées avant l'évaluation de la garde, et peuvent être utilisées à l'intérieur ::

source: Several other key features of this statement:
fr: Voici d’autres caractéristiques importantes de cette instruction :

source: Like unpacking assignments, tuple and list patterns have exactly the same meaning and actually match arbitrary sequences. An important exception is that they don't match iterators or strings.
fr: comme dans les affectations multiples, les filtres de *n*-uplet et de liste sont totalement équivalents et autorisent tous les types de séquences. Exception importante, ils n'autorisent pas les itérateurs ni les chaînes de caractères ;

source: Sequence patterns support extended unpacking: ``[x, y, *rest]`` and ``(x, y, *rest)`` work similar to unpacking assignments. The name after ``*`` may also be ``_``, so ``(x, y, *_)`` matches a sequence of at least two items without binding the remaining items.
fr: les filtres de séquence peuvent faire intervenir l'affectation étoilée : ``[x, y, *reste]`` ou ``(x, y, *reste)`` ont le même sens que dans une affectation avec ``=``. Le nom de variable après l'étoile peut aussi être l'attrape-tout ``_``. Ainsi, ``(x, y, *_)`` est un filtre qui reconnaît les séquences à deux éléments ou plus, en capturant les deux premiers et en ignorant le reste ;

source: Mapping patterns: ``{"bandwidth": b, "latency": l}`` captures the ``"bandwidth"`` and ``"latency"`` values from a dictionary. Unlike sequence patterns, extra keys are ignored. An unpacking like ``**rest`` is also supported. (But ``**_`` would be redundant, so it is not allowed.)
fr: Il existe des filtres d'association. Par exemple, le filtre ``{"bande_passante": b, "latence": l}`` extrait les valeurs des clés ``"bande_passante"`` et ``"latence"`` dans un dictionnaire. Contrairement aux filtres de séquence, les clés absentes du filtre sont ignorées. L'affectation double-étoilée (``**reste``) fonctionne aussi (cependant, ``**_`` serait redondant et n'est donc pas permis) ;

source: Subpatterns may be captured using the ``as`` keyword::
fr: on peut capturer la valeur d'une partie d'un filtre avec le mot-clé ``as``, par exemple ::

source: will capture the second element of the input as ``p2`` (as long as the input is a sequence of two points)
fr: Ce filtre, lorsqu'il est comparé à une séquence de deux points, réussit et capture le second dans la variable ``p2`` ;

source: Most literals are compared by equality, however the singletons ``True``, ``False`` and ``None`` are compared by identity.
fr: la plupart des littéraux sont comparés par égalité. Néanmoins, les singletons ``True``, ``False`` et ``None`` sont comparés par identité ;

source: Patterns may use named constants. These must be dotted names to prevent them from being interpreted as capture variable::
fr: les filtres peuvent contenir des noms qui se réfèrent à des constantes. Ces noms doivent impérativement être qualifiés (contenir un point) pour ne pas être interprétés comme des variables de capture ::

source: For a more detailed explanation and additional examples, you can look into :pep:`636` which is written in a tutorial format.
fr: Pour plus d'explications et d'exemples, lire la :pep:`636` (en anglais), qui est écrite sous forme de tutoriel.

source: Defining Functions
fr: Définir des fonctions

source: We can create a function that writes the Fibonacci series to an arbitrary boundary::
fr: On peut créer une fonction qui écrit la suite de Fibonacci jusqu'à une limite imposée ::

source: The keyword :keyword:`def` introduces a function *definition*. It must be followed by the function name and the parenthesized list of formal parameters. The statements that form the body of the function start at the next line, and must be indented.
fr: Le mot-clé :keyword:`def` introduit une *définition* de fonction. Il doit être suivi du nom de la fonction et d'une liste, entre parenthèses, de ses paramètres. L'instruction qui constitue le corps de la fonction débute à la ligne suivante et doit être indentée.

source: The first statement of the function body can optionally be a string literal; this string literal is the function's documentation string, or :dfn:`docstring`. (More about docstrings can be found in the section :ref:`tut-docstrings`.) There are tools which use docstrings to automatically produce online or printed documentation, or to let the user interactively browse through code; it's good practice to include docstrings in code that you write, so make a habit of it.
fr: La première instruction d'une fonction peut, de façon facultative, être une chaîne de caractères littérale ; cette chaîne de caractères sera alors la chaîne de documentation de la fonction, appelée :dfn:`docstring` (consultez la section :ref:`tut-docstrings` pour en savoir plus). Il existe des outils qui utilisent ces chaînes de documentation pour générer automatiquement une documentation en ligne ou imprimée, ou pour permettre à l'utilisateur de naviguer de façon interactive dans le code ; prenez-en l'habitude, c'est une bonne pratique que de documenter le code que vous écrivez.

source: The *execution* of a function introduces a new symbol table used for the local variables of the function. More precisely, all variable assignments in a function store the value in the local symbol table; whereas variable references first look in the local symbol table, then in the local symbol tables of enclosing functions, then in the global symbol table, and finally in the table of built-in names. Thus, global variables and variables of enclosing functions cannot be directly assigned a value within a function (unless, for global variables, named in a :keyword:`global` statement, or, for variables of enclosing functions, named in a :keyword:`nonlocal` statement), although they may be referenced.
fr: *L'exécution* d'une fonction introduit une nouvelle table de symboles utilisée par les variables locales de la fonction. Plus précisément, toutes les affectations de variables effectuées au sein d'une fonction stockent les valeurs dans la table des symboles locaux ; en revanche, les références de variables sont recherchées dans la table des symboles locaux, puis dans les tables des symboles locaux des fonctions englobantes, puis dans la table des symboles globaux et finalement dans la table des noms des primitives. Par conséquent, bien qu'elles puissent être référencées, il est impossible d'affecter une valeur à une variable globale ou à une variable d'une fonction englobante (sauf pour les variables globales désignées dans une instruction :keyword:`global` et, pour les variables des fonctions englobantes, désignées dans une instruction :keyword:`nonlocal`).

source: The actual parameters (arguments) to a function call are introduced in the local symbol table of the called function when it is called; thus, arguments are passed using *call by value* (where the *value* is always an object *reference*, not the value of the object). [#]_ When a function calls another function, or calls itself recursively, a new local symbol table is created for that call.
fr: Les paramètres effectifs (arguments) d'une fonction sont introduits dans la table des symboles locaux de la fonction appelée, au moment où elle est appelée ; par conséquent, les passages de paramètres se font *par valeur*, la *valeur* étant toujours une *référence* à un objet et non la valeur de l'objet lui-même [#]_. Lorsqu'une fonction appelle une autre fonction, ou s'appelle elle-même par récursion, une nouvelle table de symboles locaux est créée pour cet appel.

source: A function definition associates the function name with the function object in the current symbol table. The interpreter recognizes the object pointed to by that name as a user-defined function. Other names can also point to that same function object and can also be used to access the function::
fr: Une définition de fonction associe un nom de fonction à un objet fonction dans l'espace de noms actuel. Pour l'interpréteur, l'objet référencé par ce nom est une fonction définie par l'utilisateur. Plusieurs noms peuvent faire référence à une même fonction, ils peuvent alors tous être utilisés pour appeler la fonction ::

source: Coming from other languages, you might object that ``fib`` is not a function but a procedure since it doesn't return a value. In fact, even functions without a :keyword:`return` statement do return a value, albeit a rather boring one. This value is called ``None`` (it's a built-in name). Writing the value ``None`` is normally suppressed by the interpreter if it would be the only value written. You can see it if you really want to using :func:`print`::
fr: Si vous venez d'autres langages, vous pouvez penser que ``fib`` n'est pas une fonction mais une procédure, puisqu'elle ne renvoie pas de résultat. En fait, même les fonctions sans instruction :keyword:`return` renvoient une valeur, quoique ennuyeuse. Cette valeur est appelée ``None`` (c'est le nom d'une primitive). Écrire la valeur ``None`` est normalement supprimé par l'interpréteur lorsqu'il s'agit de la seule valeur qui doit être écrite. Vous pouvez le constater, si vous y tenez vraiment, en utilisant :func:`print` ::

source: It is simple to write a function that returns a list of the numbers of the Fibonacci series, instead of printing it::
fr: Il est facile d'écrire une fonction qui renvoie une liste de la série de Fibonacci au lieu de l'afficher ::

source: This example, as usual, demonstrates some new Python features:
fr: Cet exemple, comme d'habitude, illustre de nouvelles fonctionnalités de Python :

source: The :keyword:`return` statement returns with a value from a function. :keyword:`!return` without an expression argument returns ``None``. Falling off the end of a function also returns ``None``.
fr: l'instruction :keyword:`return` provoque la sortie de la fonction en renvoyant une valeur. :keyword:`!return` sans expression en paramètre renvoie ``None``. Arriver à la fin d'une fonction renvoie également ``None`` ;

source: More on Defining Functions
fr: Davantage sur la définition des fonctions

source: It is also possible to define functions with a variable number of arguments. There are three forms, which can be combined.
fr: Il est également possible de définir des fonctions avec un nombre variable d'arguments. Trois syntaxes peuvent être utilisées, éventuellement combinées.

source: Default Argument Values
fr: Valeur par défaut des arguments
