Repository: python/python-docs-fr
Catalog: tutorial/controlflow.po
Languages: fr

source: The most useful form is to specify a default value for one or more arguments. This creates a function that can be called with fewer arguments than it is defined to allow. For example::
fr: La forme la plus utile consiste à indiquer une valeur par défaut pour certains arguments. Ceci crée une fonction qui peut être appelée avec moins d'arguments que ceux présents dans sa définition. Par exemple ::

source: This function can be called in several ways:
fr: Cette fonction peut être appelée de plusieurs façons :

source: giving only the mandatory argument: ``ask_ok('Do you really want to quit?')``
fr: en ne fournissant que les arguments obligatoires : ``ask_ok('Do you really want to quit?')`` ;

source: giving one of the optional arguments: ``ask_ok('OK to overwrite the file?', 2)``
fr: en fournissant une partie des arguments facultatifs : ``ask_ok('OK to overwrite the file?', 2)`` ;

source: or even giving all arguments: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``
fr: en fournissant tous les arguments : ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``.

source: This example also introduces the :keyword:`in` keyword. This tests whether or not a sequence contains a certain value.
fr: Cet exemple présente également le mot-clé :keyword:`in`. Celui-ci permet de tester si une séquence contient une certaine valeur.

source: The default values are evaluated at the point of function definition in the *defining* scope, so that ::
fr: Les valeurs par défaut sont évaluées lors de la définition de la fonction dans la portée de la *définition*, de telle sorte que ::

source: will print ``5``.
fr: affiche ``5``.

source: **Important warning:** The default value is evaluated only once. This makes a difference when the default is a mutable object such as a list, dictionary, or instances of most classes. For example, the following function accumulates the arguments passed to it on subsequent calls::
fr: **Avertissement important :** la valeur par défaut n'est évaluée qu'une seule fois. Ceci fait une différence lorsque cette valeur par défaut est un objet mutable tel qu'une liste, un dictionnaire ou des instances de la plupart des classes. Par exemple, la fonction suivante accumule les arguments qui lui sont passés au fil des appels successifs ::

source: This will print ::
fr: affiche ::

source: If you don't want the default to be shared between subsequent calls, you can write the function like this instead::
fr: Si vous ne voulez pas que cette valeur par défaut soit partagée entre des appels successifs, vous pouvez écrire la fonction de cette façon ::

source: Keyword Arguments
fr: Les arguments nommés

source: Functions can also be called using :term:`keyword arguments <keyword argument>` of the form ``kwarg=value``. For instance, the following function::
fr: Les fonctions peuvent également être appelées en utilisant des :term:`arguments nommés <keyword argument>` sous la forme ``kwarg=value``. Par exemple, la fonction suivante ::

source: accepts one required argument (``voltage``) and three optional arguments (``state``, ``action``, and ``type``). This function can be called in any of the following ways::
fr: accepte un argument obligatoire (``voltage``) et trois arguments facultatifs (``state``, ``action`` et ``type``). Cette fonction peut être appelée de n'importe laquelle des façons suivantes ::

source: but all the following calls would be invalid::
fr: mais tous les appels qui suivent sont incorrects ::

source: In a function call, keyword arguments must follow positional arguments. All the keyword arguments passed must match one of the arguments accepted by the function (e.g. ``actor`` is not a valid argument for the ``parrot`` function), and their order is not important. This also includes non-optional arguments (e.g. ``parrot(voltage=1000)`` is valid too). No argument may receive a value more than once. Here's an example that fails due to this restriction::
fr: Dans un appel de fonction, les arguments nommés doivent suivre les arguments positionnés. Tous les arguments nommés doivent correspondre à l'un des arguments acceptés par la fonction (par exemple, ``actor`` n'est pas un argument accepté par la fonction ``parrot``), mais leur ordre n'est pas important. Ceci inclut également les arguments obligatoires (``parrot(voltage=1000)`` est également correct). Aucun argument ne peut recevoir une valeur plus d'une fois, comme l'illustre cet exemple incorrect du fait de cette restriction ::

source: When a final formal parameter of the form ``**name`` is present, it receives a dictionary (see :ref:`typesmapping`) containing all keyword arguments except for those corresponding to a formal parameter. This may be combined with a formal parameter of the form ``*name`` (described in the next subsection) which receives a :ref:`tuple <tut-tuples>` containing the positional arguments beyond the formal parameter list. (``*name`` must occur before ``**name``.) For example, if we define a function like this::
fr: Quand un dernier paramètre formel est présent sous la forme ``**name``, il reçoit un dictionnaire (voir :ref:`typesmapping`) contenant tous les arguments nommés à l'exception de ceux correspondant à un paramètre formel. Ceci peut être combiné à un paramètre formel sous la forme ``*name`` (décrit dans la section suivante) qui lui reçoit un :ref:`n-uplet <tut-tuples>` contenant les arguments positionnés au-delà de la liste des paramètres formels (``*name`` doit être présent avant ``**name``). Par exemple, si vous définissez une fonction comme ceci ::

source: It could be called like this::
fr: Elle pourrait être appelée comme ceci ::

source: and of course it would print:
fr: et, bien sûr, elle affiche :

source: Note that the order in which the keyword arguments are printed is guaranteed to match the order in which they were provided in the function call.
fr: Notez que Python garantit que l'ordre d'affichage des arguments est le même que l'ordre dans lesquels ils sont fournis lors de l'appel à la fonction.

source: Special parameters
fr: Paramètres spéciaux

source: By default, arguments may be passed to a Python function either by position or explicitly by keyword. For readability and performance, it makes sense to restrict the way arguments can be passed so that a developer need only look at the function definition to determine if items are passed by position, by position or keyword, or by keyword.
fr: Par défaut, les arguments peuvent être passés à une fonction Python par position, ou explicitement en les nommant. Pour la lisibilité et la performance, il est logique de restreindre la façon dont les arguments peuvent être transmis afin qu'un développeur n'ait qu'à regarder la définition de la fonction pour déterminer si les éléments sont transmis par position seule, par position ou nommé, ou seulement nommé.

source: A function definition may look like:
fr: Voici à quoi ressemble une définition de fonction :

source: where ``/`` and ``*`` are optional. If used, these symbols indicate the kind of parameter by how the arguments may be passed to the function: positional-only, positional-or-keyword, and keyword-only. Keyword parameters are also referred to as named parameters.
fr: où ``/`` et ``*`` sont facultatifs. S'ils sont utilisés, ces symboles indiquent par quel type de paramètre un argument peut être transmis à la fonction : position seule, position ou nommé, et seulement nommé. Les paramètres par mot-clé sont aussi appelés paramètres nommés.

source: Positional-or-Keyword Arguments
fr: Les arguments positionnels-ou-nommés

source: If ``/`` and ``*`` are not present in the function definition, arguments may be passed to a function by position or by keyword.
fr: Si ``/`` et ``*`` ne sont pas présents dans la définition de fonction, les arguments peuvent être passés à une fonction par position ou par nommés.

source: Positional-Only Parameters
fr: Paramètres positionnels uniquement

source: Looking at this in a bit more detail, it is possible to mark certain parameters as *positional-only*. If *positional-only*, the parameters' order matters, and the parameters cannot be passed by keyword. Positional-only parameters are placed before a ``/`` (forward-slash). The ``/`` is used to logically separate the positional-only parameters from the rest of the parameters. If there is no ``/`` in the function definition, there are no positional-only parameters.
fr: En y regardant de plus près, il est possible de marquer certains paramètres comme *positionnels uniquement*. S'ils sont marqués comme *positionnels uniquement*, l'ordre des paramètres est important, et les paramètres ne peuvent pas être transmis en tant que « arguments nommés ». Les paramètres « positionnels uniquement » sont placés avant un ``/``. Le ``/`` est utilisé pour séparer logiquement les paramètres « positionnels uniquement » du reste des paramètres. S'il n'y a pas de ``/`` dans la définition de fonction, il n'y a pas de paramètres « positionnels uniquement ».

source: Parameters following the ``/`` may be *positional-or-keyword* or *keyword-only*.
fr: Les paramètres qui suivent le ``/`` peuvent être *positionnels-ou-nommés* ou *nommés-uniquement*.

source: Keyword-Only Arguments
fr: Arguments nommés uniquement

source: To mark parameters as *keyword-only*, indicating the parameters must be passed by keyword argument, place an ``*`` in the arguments list just before the first *keyword-only* parameter.
fr: Pour marquer les paramètres comme *uniquement nommés*, indiquant que les paramètres doivent être passés avec l'argument comme mot-clé, placez un ``*`` dans la liste des arguments juste avant le premier paramètre *uniquement nommé*.

source: Function Examples
fr: Exemples de fonctions

source: Consider the following example function definitions paying close attention to the markers ``/`` and ``*``::
fr: Considérons l'exemple suivant de définitions de fonctions en portant une attention particulière aux marqueurs ``/`` et ``*`` ::

source: The first function definition, ``standard_arg``, the most familiar form, places no restrictions on the calling convention and arguments may be passed by position or keyword::
fr: La première définition de fonction, ``standard_arg``, la forme la plus familière, n'impose aucune restriction sur la convention d'appel et les arguments peuvent être passés par position ou nommés ::

source: The second function ``pos_only_arg`` is restricted to only use positional parameters as there is a ``/`` in the function definition::
fr: La deuxième fonction ``pos_only_arg`` restreint le passage aux seuls arguments par position car il y a un ``/`` dans la définition de fonction ::

source: And the last uses all three calling conventions in the same function definition::
fr: Et la dernière utilise les trois conventions d'appel dans la même définition de fonction ::

source: Finally, consider this function definition which has a potential collision between the positional argument ``name`` and ``**kwds`` which has ``name`` as a key::
fr: Enfin, considérons cette définition de fonction qui a une collision potentielle entre l'argument positionnel ``name`` et ``**kwds`` qui a ``name`` comme mot-clé ::

source: There is no possible call that will make it return ``True`` as the keyword ``'name'`` will always bind to the first parameter. For example::
fr: Il n'y a pas d'appel possible qui renvoie ``True`` car le mot-clé ``'name'`` est toujours lié au premier paramètre. Par exemple ::

source: But using ``/`` (positional only arguments), it is possible since it allows ``name`` as a positional argument and ``'name'`` as a key in the keyword arguments::
fr: Mais en utilisant ``/`` (arguments positionnels seulement), c'est possible puisqu'il permet d'utiliser ``name`` comme argument positionnel et ``'name'`` comme mot-clé dans les arguments nommés ::

source: In other words, the names of positional-only parameters can be used in ``**kwds`` without ambiguity.
fr: En d'autres termes, les noms des paramètres seulement positionnels peuvent être utilisés sans ambiguïté dans ``**kwds``.

source: Recap
fr: Récapitulatif

source: The use case will determine which parameters to use in the function definition::
fr: Le cas d'utilisation détermine les paramètres à utiliser dans la définition de fonction ::

source: As guidance:
fr: Quelques conseils :

source: Use positional-only if you want the name of the parameters to not be available to the user. This is useful when parameter names have no real meaning, if you want to enforce the order of the arguments when the function is called or if you need to take some positional parameters and arbitrary keywords.
fr: utilisez les paramètres positionnels si vous voulez que le nom des paramètres soit masqué à l'utilisateur. Ceci est utile lorsque les noms de paramètres n'ont pas de signification réelle, si vous voulez faire respecter l'ordre des arguments lorsque la fonction est appelée ou si vous avez besoin de prendre certains paramètres positionnels et mots-clés arbitraires ;

source: Use keyword-only when names have meaning and the function definition is more understandable by being explicit with names or you want to prevent users relying on the position of the argument being passed.
fr: utilisez les paramètres nommés lorsque les noms ont un sens et que la définition de la fonction est plus compréhensible avec des noms explicites ou si vous voulez empêcher les utilisateurs de se fier à la position de l'argument qui est passé ;

source: For an API, use positional-only to prevent breaking API changes if the parameter's name is modified in the future.
fr: dans le cas d'une API, utilisez les paramètres seulement positionnels pour éviter de casser l'API si le nom du paramètre est modifié dans l'avenir.

source: Arbitrary Argument Lists
fr: Listes d'arguments arbitraires

source: Finally, the least frequently used option is to specify that a function can be called with an arbitrary number of arguments. These arguments will be wrapped up in a tuple (see :ref:`tut-tuples`). Before the variable number of arguments, zero or more normal arguments may occur. ::
fr: Pour terminer, l'option la moins fréquente consiste à indiquer qu'une fonction peut être appelée avec un nombre arbitraire d'arguments. Ces arguments sont intégrés dans un *n*-uplet (voir :ref:`tut-tuples`). Avant le nombre variable d'arguments, zéro ou plus arguments normaux peuvent apparaître ::

source: Normally, these *variadic* arguments will be last in the list of formal parameters, because they scoop up all remaining input arguments that are passed to the function. Any formal parameters which occur after the ``*args`` parameter are 'keyword-only' arguments, meaning that they can only be used as keywords rather than positional arguments. ::
fr: Normalement, ces arguments ``variadiques`` sont les derniers paramètres, parce qu'ils agrègent toutes les valeurs suivantes. Tout paramètre placé après le paramètre ``*arg`` ne pourra être utilisé que comme argument nommé, pas comme argument positionnel ::

source: Unpacking Argument Lists
fr: Séparation des listes d'arguments

source: The reverse situation occurs when the arguments are already in a list or tuple but need to be unpacked for a function call requiring separate positional arguments. For instance, the built-in :func:`range` function expects separate *start* and *stop* arguments. If they are not available separately, write the function call with the ``*``\ -operator to unpack the arguments out of a list or tuple::
fr: La situation inverse intervient lorsque les arguments sont déjà dans une liste ou un *n*-uplet mais doivent être séparés pour un appel de fonction nécessitant des arguments positionnés séparés. Par exemple, la primitive :func:`range` attend des arguments *start* et *stop* distincts. S'ils ne sont pas disponibles séparément, écrivez l'appel de fonction en utilisant l'opérateur ``*`` pour séparer les arguments présents dans une liste ou un *n*-uplet ::

source: In the same fashion, dictionaries can deliver keyword arguments with the ``**``\ -operator::
fr: De la même façon, les dictionnaires peuvent fournir des arguments nommés en utilisant l'opérateur ``**`` ::

source: Lambda Expressions
fr: Fonctions anonymes

source: Small anonymous functions can be created with the :keyword:`lambda` keyword. This function returns the sum of its two arguments: ``lambda a, b: a+b``. Lambda functions can be used wherever function objects are required. They are syntactically restricted to a single expression. Semantically, they are just syntactic sugar for a normal function definition. Like nested function definitions, lambda functions can reference variables from the containing scope::
fr: Avec le mot-clé :keyword:`lambda`, vous pouvez créer de petites fonctions anonymes. En voici une qui renvoie la somme de ses deux arguments : ``lambda a, b: a+b``. Les fonctions lambda peuvent être utilisées partout où un objet fonction est attendu. Elles sont syntaxiquement restreintes à une seule expression. Sémantiquement, elles ne sont que du sucre syntaxique pour une définition de fonction normale. Comme les fonctions imbriquées, les fonctions lambda peuvent référencer des variables de la portée englobante ::

source: The above example uses a lambda expression to return a function. Another use is to pass a small function as an argument::
fr: L'exemple précédent utilise une fonction anonyme pour renvoyer une fonction. Une autre utilisation classique est de donner une fonction minimaliste directement en tant que paramètre ::

source: Documentation Strings
fr: Chaînes de documentation

source: Here are some conventions about the content and formatting of documentation strings.
fr: Voici quelques conventions concernant le contenu et le format des chaînes de documentation.

source: The first line should always be a short, concise summary of the object's purpose. For brevity, it should not explicitly state the object's name or type, since these are available by other means (except if the name happens to be a verb describing a function's operation). This line should begin with a capital letter and end with a period.
fr: Il convient que la première ligne soit toujours courte et résume de manière concise l'utilité de l'objet. Afin d'être bref, nul besoin de rappeler le nom de l'objet ou son type, qui sont accessibles par d'autres moyens (sauf si le nom est un verbe qui décrit une opération). La convention veut que la ligne commence par une majuscule et se termine par un point.

source: If there are more lines in the documentation string, the second line should be blank, visually separating the summary from the rest of the description. The following lines should be one or more paragraphs describing the object's calling conventions, its side effects, etc.
fr: S'il y a d'autres lignes dans la chaîne de documentation, la deuxième ligne devrait être vide, pour la séparer visuellement du reste de la description. Les autres lignes peuvent alors constituer un ou plusieurs paragraphes décrivant le mode d'utilisation de l'objet, ses effets de bord, etc.

source: The Python parser does not strip indentation from multi-line string literals in Python, so tools that process documentation have to strip indentation if desired. This is done using the following convention. The first non-blank line *after* the first line of the string determines the amount of indentation for the entire documentation string. (We can't use the first line since it is generally adjacent to the string's opening quotes so its indentation is not apparent in the string literal.) Whitespace "equivalent" to this indentation is then stripped from the start of all lines of the string. Lines that are indented less should not occur, but if they occur all their leading whitespace should be stripped. Equivalence of whitespace should be tested after expansion of tabs (to 8 spaces, normally).
fr: L'analyseur de code Python ne supprime pas l'indentation des chaînes de caractères littérales multi-lignes, donc les outils qui utilisent la documentation doivent si besoin faire cette opération eux-mêmes. La convention suivante s'applique : la première ligne non vide *après* la première détermine la profondeur d'indentation de l'ensemble de la chaîne de documentation (on ne peut pas utiliser la première ligne qui est généralement accolée aux guillemets d'ouverture de la chaîne de caractères et dont l'indentation n'est donc pas visible). Les espaces « correspondant » à cette profondeur d'indentation sont alors supprimées du début de chacune des lignes de la chaîne. Aucune ligne ne devrait présenter un niveau d'indentation inférieur mais, si cela arrive, toutes les espaces situées en début de ligne doivent être supprimées. L'équivalent des espaces doit être testé après expansion des tabulations (normalement remplacées par 8 espaces).

source: Here is an example of a multi-line docstring::
fr: Voici un exemple de chaîne de documentation multi-lignes ::

source: Function Annotations
fr: Annotations de fonctions

source: :ref:`Function annotations <function>` are completely optional metadata information about the types used by user-defined functions (see :pep:`3107` and :pep:`484` for more information).
fr: :ref:`Les annotations de fonction <function>` sont des métadonnées optionnelles décrivant les types utilisés par une fonction définie par l'utilisateur (voir les :pep:`3107` et :pep:`484` pour plus d'informations).

source: Intermezzo: Coding Style
fr: Aparté : le style de codage

source: Now that you are about to write longer, more complex pieces of Python, it is a good time to talk about *coding style*. Most languages can be written (or more concise, *formatted*) in different styles; some are more readable than others. Making it easy for others to read your code is always a good idea, and adopting a nice coding style helps tremendously for that.
fr: Maintenant que vous êtes prêt à écrire des programmes plus longs et plus complexes, il est temps de parler du *style de codage*. La plupart des langages peuvent être écrits (ou plutôt *formatés*) selon différents styles ; certains sont plus lisibles que d'autres. Rendre la lecture de votre code plus facile aux autres est toujours une bonne idée et adopter un bon style de codage peut énormément vous y aider.

source: For Python, :pep:`8` has emerged as the style guide that most projects adhere to; it promotes a very readable and eye-pleasing coding style. Every Python developer should read it at some point; here are the most important points extracted for you:
fr: En Python, la plupart des projets adhèrent au style défini dans la :pep:`8` ; elle met en avant un style de codage très lisible et agréable à l’œil. Chaque développeur Python se doit donc de la lire et de s'en inspirer autant que possible ; voici ses principaux points notables :

source: Use 4-space indentation, and no tabs.
fr: utilisez des indentations de 4 espaces et pas de tabulation.

source: 4 spaces are a good compromise between small indentation (allows greater nesting depth) and large indentation (easier to read). Tabs introduce confusion, and are best left out.
fr: 4 espaces constituent un bon compromis entre une indentation courte (qui permet une profondeur d'imbrication plus importante) et une longue (qui rend le code plus facile à lire). Les tabulations introduisent de la confusion et doivent être proscrites autant que possible ;

source: Wrap lines so that they don't exceed 79 characters.
fr: faites en sorte que les lignes ne dépassent pas 79 caractères, au besoin en insérant des retours à la ligne.
