Repository: python/python-docs-fr
Catalog: tutorial/datastructures.po
Languages: fr

source: Performing ``list(d)`` on a dictionary returns a list of all the keys used in the dictionary, in insertion order (if you want it sorted, just use ``sorted(d)`` instead). To check whether a single key is in the dictionary, use the :keyword:`in` keyword.
fr: Exécuter ``list(d)`` sur un dictionnaire ``d`` renvoie une liste de toutes les clés utilisées dans le dictionnaire, dans l'ordre d'insertion (si vous voulez qu'elles soient ordonnées, utilisez ``sorted(d)``). Pour tester si une clé est dans le dictionnaire, utilisez le mot-clé :keyword:`in`.

source: Here is a small example using a dictionary::
fr: Voici un petit exemple utilisant un dictionnaire ::

source: The :func:`dict` constructor builds dictionaries directly from sequences of key-value pairs::
fr: Le constructeur :func:`dict` fabrique un dictionnaire directement à partir d'une liste de paires clé-valeur stockées sous la forme de n-uplets ::

source: In addition, dict comprehensions can be used to create dictionaries from arbitrary key and value expressions::
fr: De plus, il est possible de créer des dictionnaires par compréhension depuis un jeu de clef et valeurs ::

source: When the keys are simple strings, it is sometimes easier to specify pairs using keyword arguments::
fr: Lorsque les clés sont de simples chaînes de caractères, il est parfois plus facile de spécifier les paires en utilisant des paramètres nommés ::

source: Looping Techniques
fr: Techniques de boucles

source: When looping through dictionaries, the key and corresponding value can be retrieved at the same time using the :meth:`items` method. ::
fr: Lorsque vous faites une boucle sur un dictionnaire, les clés et leurs valeurs peuvent être récupérées en même temps en utilisant la méthode :meth:`items` ::

source: When looping through a sequence, the position index and corresponding value can be retrieved at the same time using the :func:`enumerate` function. ::
fr: Lorsque vous itérez sur une séquence, la position et la valeur correspondante peuvent être récupérées en même temps en utilisant la fonction :func:`enumerate`. ::

source: To loop over two or more sequences at the same time, the entries can be paired with the :func:`zip` function. ::
fr: Pour faire des boucles sur deux séquences ou plus en même temps, les éléments peuvent être associés par la fonction :func:`zip` ::

source: To loop over a sequence in reverse, first specify the sequence in a forward direction and then call the :func:`reversed` function. ::
fr: Pour faire une boucle en sens inverse sur une séquence, commencez par spécifier la séquence dans son ordre normal, puis appliquez la fonction :func:`reversed` ::

source: To loop over a sequence in sorted order, use the :func:`sorted` function which returns a new sorted list while leaving the source unaltered. ::
fr: Pour parcourir les éléments d'une séquence de manière ordonnée, utilisez la fonction :func:`sorted`, elle renvoie une nouvelle liste ordonnée sans altérer la source ::

source: It is sometimes tempting to change a list while you are looping over it; however, it is often simpler and safer to create a new list instead. ::
fr: Il est parfois tentant de modifier une liste pendant son itération. Cependant, c'est souvent plus simple et plus sûr de créer une nouvelle liste à la place. ::

source: More on Conditions
fr: Plus d'informations sur les conditions

source: The conditions used in ``while`` and ``if`` statements can contain any operators, not just comparisons.
fr: Les conditions utilisées dans une instruction ``while`` ou ``if`` peuvent contenir n'importe quel opérateur, pas seulement des comparaisons.

source: The comparison operators ``in`` and ``not in`` check whether a value occurs (does not occur) in a sequence. The operators ``is`` and ``is not`` compare whether two objects are really the same object; this only matters for mutable objects like lists. All comparison operators have the same priority, which is lower than that of all numerical operators.
fr: Les opérateurs de comparaison ``in`` et ``not in`` testent si une valeur est présente ou non dans une séquence. Les opérateurs ``is`` et ``is not`` testent si deux objets sont vraiment le même objet ; ceci n'est important que pour des objets muables comme des listes. Tous les opérateurs de comparaison ont la même priorité, qui est plus faible que celle des opérateurs numériques.

source: Comparisons can be chained. For example, ``a < b == c`` tests whether ``a`` is less than ``b`` and moreover ``b`` equals ``c``.
fr: Les comparaisons peuvent être enchaînées. Par exemple, ``a < b == c`` teste si ``a`` est inférieur à ``b`` et si, de plus, ``b`` égale ``c``.

source: Comparisons may be combined using the Boolean operators ``and`` and ``or``, and the outcome of a comparison (or of any other Boolean expression) may be negated with ``not``. These have lower priorities than comparison operators; between them, ``not`` has the highest priority and ``or`` the lowest, so that ``A and not B or C`` is equivalent to ``(A and (not B)) or C``. As always, parentheses can be used to express the desired composition.
fr: Les comparaisons peuvent être combinées en utilisant les opérateurs booléens ``and`` et ``or``, le résultat d'une comparaison (ou de toute expression booléenne) pouvant être inversé avec ``not``. Ces opérateurs ont une priorité inférieure à celle des opérateurs de comparaison ; entre eux, ``not`` a la priorité la plus élevée et ``or`` la plus faible, de telle sorte que ``A and not B or C`` est équivalent à ``(A and (not B)) or C``. Comme toujours, des parenthèses peuvent être utilisées pour exprimer l'instruction désirée.

source: The Boolean operators ``and`` and ``or`` are so-called *short-circuit* operators: their arguments are evaluated from left to right, and evaluation stops as soon as the outcome is determined. For example, if ``A`` and ``C`` are true but ``B`` is false, ``A and B and C`` does not evaluate the expression ``C``. When used as a general value and not as a Boolean, the return value of a short-circuit operator is the last evaluated argument.
fr: Les opérateurs booléens ``and`` et ``or`` sont appelés opérateurs *en circuit court* : leurs arguments sont évalués de la gauche vers la droite et l'évaluation s'arrête dès que le résultat est déterminé. Par exemple, si ``A`` et ``C`` sont vrais et ``B`` est faux, ``A and B and C`` n'évalue pas l'expression ``C``. Lorsqu'elle est utilisée en tant que valeur et non en tant que booléen, la valeur de retour d'un opérateur en circuit court est celle du dernier argument évalué.

source: It is possible to assign the result of a comparison or other Boolean expression to a variable. For example, ::
fr: Il est possible d'affecter le résultat d'une comparaison ou d'une autre expression booléenne à une variable. Par exemple ::

source: Note that in Python, unlike C, assignment inside expressions must be done explicitly with the walrus operator ``:=``. This avoids a common class of problems encountered in C programs: typing ``=`` in an expression when ``==`` was intended.
fr: Notez qu'en Python, à la différence du C, une affectation à l'intérieur d'une expression doit être faite explicitement avec l'opérateur morse ``:=``.Cela évite des erreurs fréquentes que l'on rencontre en C, lorsque l'on tape ``=`` alors que l'on voulait faire un test avec ``==``.

source: Comparing Sequences and Other Types
fr: Comparer des séquences avec d'autres types

source: Sequence objects typically may be compared to other objects with the same sequence type. The comparison uses *lexicographical* ordering: first the first two items are compared, and if they differ this determines the outcome of the comparison; if they are equal, the next two items are compared, and so on, until either sequence is exhausted. If two items to be compared are themselves sequences of the same type, the lexicographical comparison is carried out recursively. If all items of two sequences compare equal, the sequences are considered equal. If one sequence is an initial sub-sequence of the other, the shorter sequence is the smaller (lesser) one. Lexicographical ordering for strings uses the Unicode code point number to order individual characters. Some examples of comparisons between sequences of the same type::
fr: Des séquences peuvent être comparées avec d'autres séquences du même type. La comparaison utilise un ordre *lexicographique* : les deux premiers éléments de chaque séquence sont comparés et, s'ils diffèrent, cela détermine le résultat de la comparaison ; s'ils sont égaux, les deux éléments suivants sont comparés à leur tour et ainsi de suite jusqu'à ce que l'une des séquences soit épuisée. Si deux éléments à comparer sont eux-mêmes des séquences du même type, alors la comparaison lexicographique est effectuée récursivement. Si tous les éléments des deux séquences sont égaux, les deux séquences sont alors considérées comme égales. Si une séquence est une sous-séquence de l'autre, la séquence la plus courte est celle dont la valeur est inférieure. La comparaison lexicographique des chaînes de caractères utilise le code Unicode des caractères. Voici quelques exemples de comparaisons entre séquences de même type ::

source: Note that comparing objects of different types with ``<`` or ``>`` is legal provided that the objects have appropriate comparison methods. For example, mixed numeric types are compared according to their numeric value, so 0 equals 0.0, etc. Otherwise, rather than providing an arbitrary ordering, the interpreter will raise a :exc:`TypeError` exception.
fr: Comparer des objets de type différents avec ``<`` ou ``>`` est autorisé si les objets ont des méthodes de comparaison appropriées. Par exemple, les types numériques sont comparés via leur valeur numérique, donc 0 égale 0,0, etc. Dans les autres cas, au lieu de donner un ordre imprévisible, l'interpréteur lève une exception :exc:`TypeError`.

source: Footnotes
fr: Notes

source: Other languages may return the mutated object, which allows method chaining, such as ``d->insert("a")->remove("b")->sort();``.
fr: D'autres langages renvoient l'objet modifié, ce qui permet de chaîner les méthodes comme ceci : ``d->insert("a")->remove("b")->sort();``.
