Repository: python/python-docs-fr
Catalog: tutorial/datastructures.po
Languages: fr

source: Data Structures
fr: Structures de données

source: This chapter describes some things you've learned about already in more detail, and adds some new things as well.
fr: Ce chapitre reprend plus en détail quelques points déjà décrits précédemment et introduit également de nouvelles notions.

source: More on Lists
fr: Compléments sur les listes

source: The list data type has some more methods. Here are all of the methods of list objects:
fr: Le type liste dispose de méthodes supplémentaires. Voici toutes les méthodes des objets de type liste :

source: Add an item to the end of the list. Equivalent to ``a[len(a):] = [x]``.
fr: Ajoute un élément à la fin de la liste. Équivalent à ``a[len(a):] = [x]``.

source: Extend the list by appending all the items from the iterable. Equivalent to ``a[len(a):] = iterable``.
fr: Étend la liste en y ajoutant tous les éléments de l'itérable. Équivalent à ``a[len(a):] = iterable``.

source: Insert an item at a given position. The first argument is the index of the element before which to insert, so ``a.insert(0, x)`` inserts at the front of the list, and ``a.insert(len(a), x)`` is equivalent to ``a.append(x)``.
fr: Insère un élément à la position indiquée. Le premier argument est la position de l'élément courant avant lequel l'insertion doit s'effectuer, donc ``a.insert(0, x)`` insère l'élément en tête de la liste et ``a.insert(len(a), x)`` est équivalent à ``a.append(x)``.

source: Remove the first item from the list whose value is equal to *x*. It raises a :exc:`ValueError` if there is no such item.
fr: Supprime de la liste le premier élément dont la valeur est égale à *x*. Une exception :exc:`ValueError` est levée s'il n'existe aucun élément avec cette valeur.

source: Remove the item at the given position in the list, and return it. If no index is specified, ``a.pop()`` removes and returns the last item in the list. (The square brackets around the *i* in the method signature denote that the parameter is optional, not that you should type square brackets at that position. You will see this notation frequently in the Python Library Reference.)
fr: Enlève de la liste l'élément situé à la position indiquée et le renvoie en valeur de retour. Si aucune position n'est spécifiée, ``a.pop()`` enlève et renvoie le dernier élément de la liste (les crochets autour du *i* dans la signature de la méthode indiquent que ce paramètre est facultatif et non que vous devez placer des crochets dans votre code ! Vous retrouverez cette notation fréquemment dans le Guide de Référence de la Bibliothèque Python).

source: Remove all items from the list. Equivalent to ``del a[:]``.
fr: Supprime tous les éléments de la liste. Équivalent à ``del a[:]``.

source: Return zero-based index in the list of the first item whose value is equal to *x*. Raises a :exc:`ValueError` if there is no such item.
fr: Renvoie la position du premier élément de la liste dont la valeur égale *x* (en commençant à compter les positions à partir de zéro). Une exception :exc:`ValueError` est levée si aucun élément n'est trouvé.

source: The optional arguments *start* and *end* are interpreted as in the slice notation and are used to limit the search to a particular subsequence of the list. The returned index is computed relative to the beginning of the full sequence rather than the *start* argument.
fr: Les arguments optionnels *start* et *end* sont interprétés de la même manière que dans la notation des tranches et sont utilisés pour limiter la recherche à une sous-séquence particulière. L'indice renvoyé est calculé relativement au début de la séquence complète et non relativement à *start*.

source: Return the number of times *x* appears in the list.
fr: Renvoie le nombre d'éléments ayant la valeur *x* dans la liste.

source: Sort the items of the list in place (the arguments can be used for sort customization, see :func:`sorted` for their explanation).
fr: Ordonne les éléments dans la liste (les arguments peuvent personnaliser l'ordonnancement, voir :func:`sorted` pour leur explication).

source: Reverse the elements of the list in place.
fr: Inverse l'ordre des éléments dans la liste.

source: Return a shallow copy of the list. Equivalent to ``a[:]``.
fr: Renvoie une copie superficielle de la liste. Équivalent à ``a[:]``.

source: An example that uses most of the list methods::
fr: L'exemple suivant utilise la plupart des méthodes des listes ::

source: You might have noticed that methods like ``insert``, ``remove`` or ``sort`` that only modify the list have no return value printed -- they return the default ``None``. [1]_ This is a design principle for all mutable data structures in Python.
fr: Vous avez probablement remarqué que les méthodes telles que ``insert``, ``remove`` ou ``sort``, qui ne font que modifier la liste, n'affichent pas de valeur de retour (elles renvoient ``None``) [1]_. C'est un principe respecté par toutes les structures de données variables en Python.

source: Another thing you might notice is that not all data can be sorted or compared. For instance, ``[None, 'hello', 10]`` doesn't sort because integers can't be compared to strings and *None* can't be compared to other types. Also, there are some types that don't have a defined ordering relation. For example, ``3+4j < 5+7j`` isn't a valid comparison.
fr: Une autre chose que vous remarquerez peut-être est que toutes les données ne peuvent pas être ordonnées ou comparées. Par exemple, ``[None, 'hello', 10]`` ne sera pas ordonné parce que les entiers ne peuvent pas être comparés aux chaînes de caractères et *None* ne peut pas être comparé à d'autres types. En outre, il existe certains types qui n'ont pas de relation d'ordre définie. Par exemple, ``3+4j < 5+7j`` n'est pas une comparaison valide.

source: Using Lists as Stacks
fr: Utilisation des listes comme des piles

source: The list methods make it very easy to use a list as a stack, where the last element added is the first element retrieved ("last-in, first-out"). To add an item to the top of the stack, use :meth:`append`. To retrieve an item from the top of the stack, use :meth:`pop` without an explicit index. For example::
fr: Les méthodes des listes rendent très facile leur utilisation comme des piles, où le dernier élément ajouté est le premier récupéré (« dernier entré, premier sorti » ou LIFO pour *last-in, first-out* en anglais). Pour ajouter un élément sur la pile, utilisez la méthode :meth:`append`. Pour récupérer l'objet au sommet de la pile, utilisez la méthode :meth:`pop` sans indicateur de position. Par exemple ::

source: Using Lists as Queues
fr: Utilisation des listes comme des files

source: It is also possible to use a list as a queue, where the first element added is the first element retrieved ("first-in, first-out"); however, lists are not efficient for this purpose. While appends and pops from the end of list are fast, doing inserts or pops from the beginning of a list is slow (because all of the other elements have to be shifted by one).
fr: Il est également possible d'utiliser une liste comme une file, où le premier élément ajouté est le premier récupéré (« premier entré, premier sorti » ou FIFO pour *first-in, first-out*) ; toutefois, les listes ne sont pas très efficaces pour réaliser ce type de traitement. Alors que les ajouts et suppressions en fin de liste sont rapides, les opérations d'insertions ou de retraits en début de liste sont lentes (car tous les autres éléments doivent être décalés d'une position).

source: To implement a queue, use :class:`collections.deque` which was designed to have fast appends and pops from both ends. For example::
fr: Pour implémenter une file, utilisez la classe :class:`collections.deque` qui a été conçue pour réaliser rapidement les opérations d'ajouts et de retraits aux deux extrémités. Par exemple ::

source: List Comprehensions
fr: Compréhensions de listes

source: List comprehensions provide a concise way to create lists. Common applications are to make new lists where each element is the result of some operations applied to each member of another sequence or iterable, or to create a subsequence of those elements that satisfy a certain condition.
fr: Les compréhensions de listes fournissent un moyen de construire des listes de manière très concise. Une application classique est la construction de nouvelles listes où chaque élément est le résultat d'une opération appliquée à chaque élément d'une autre séquence ; ou de créer une sous-séquence des éléments satisfaisant une condition spécifique.

source: For example, assume we want to create a list of squares, like::
fr: Par exemple, supposons que l'on veuille créer une liste de carrés, comme ::

source: Note that this creates (or overwrites) a variable named ``x`` that still exists after the loop completes. We can calculate the list of squares without any side effects using::
fr: Notez que cela crée (ou remplace) une variable nommée ``x`` qui existe toujours après l'exécution de la boucle. On peut calculer une liste de carrés sans effet de bord avec ::

source: or, equivalently::
fr: ou, de manière équivalente ::

source: which is more concise and readable.
fr: qui est plus court et lisible.

source: A list comprehension consists of brackets containing an expression followed by a :keyword:`!for` clause, then zero or more :keyword:`!for` or :keyword:`!if` clauses. The result will be a new list resulting from evaluating the expression in the context of the :keyword:`!for` and :keyword:`!if` clauses which follow it. For example, this listcomp combines the elements of two lists if they are not equal::
fr: Une compréhension de liste consiste à placer entre crochets une expression suivie par une clause :keyword:`!for` puis par zéro ou plus clauses :keyword:`!for` ou :keyword:`!if`. Le résultat est une nouvelle liste résultat de l'évaluation de l'expression dans le contexte des clauses :keyword:`!for` et :keyword:`!if` qui la suivent. Par exemple, cette compréhension de liste combine les éléments de deux listes s'ils ne sont pas égaux ::

source: and it's equivalent to::
fr: et c'est équivalent à ::

source: Note how the order of the :keyword:`for` and :keyword:`if` statements is the same in both these snippets.
fr: Notez que l'ordre des instructions :keyword:`for` et :keyword:`if` est le même dans ces différents extraits de code.

source: If the expression is a tuple (e.g. the ``(x, y)`` in the previous example), it must be parenthesized. ::
fr: Si l'expression est un n-uplet (c'est-à-dire ``(x, y)`` dans cet exemple), elle doit être entourée par des parenthèses ::

source: List comprehensions can contain complex expressions and nested functions::
fr: Les compréhensions de listes peuvent contenir des expressions complexes et des fonctions imbriquées ::

source: Nested List Comprehensions
fr: Compréhensions de listes imbriquées

source: The initial expression in a list comprehension can be any arbitrary expression, including another list comprehension.
fr: La première expression dans une compréhension de liste peut être n'importe quelle expression, y compris une autre compréhension de liste.

source: Consider the following example of a 3x4 matrix implemented as a list of 3 lists of length 4::
fr: Voyez l'exemple suivant d'une matrice de 3 par 4, implémentée sous la forme de 3 listes de 4 éléments ::

source: The following list comprehension will transpose rows and columns::
fr: Cette compréhension de liste transpose les lignes et les colonnes ::

source: As we saw in the previous section, the nested listcomp is evaluated in the context of the :keyword:`for` that follows it, so this example is equivalent to::
fr: Comme nous l'avons vu dans la section précédente, la compréhension de liste imbriquée est évaluée dans le contexte de l'instruction :keyword:`for` qui la suit, donc cet exemple est équivalent à ::

source: which, in turn, is the same as::
fr: lequel à son tour est équivalent à ::

source: In the real world, you should prefer built-in functions to complex flow statements. The :func:`zip` function would do a great job for this use case::
fr: Dans des cas concrets, il est toujours préférable d'utiliser des fonctions natives plutôt que des instructions de contrôle de flux complexes. La fonction :func:`zip` ferait dans ce cas un excellent travail ::

source: See :ref:`tut-unpacking-arguments` for details on the asterisk in this line.
fr: Voyez :ref:`tut-unpacking-arguments` pour plus de détails sur l'astérisque de cette ligne.

source: The :keyword:`!del` statement
fr: L'instruction :keyword:`!del`

source: There is a way to remove an item from a list given its index instead of its value: the :keyword:`del` statement. This differs from the :meth:`pop` method which returns a value. The :keyword:`!del` statement can also be used to remove slices from a list or clear the entire list (which we did earlier by assignment of an empty list to the slice). For example::
fr: Il existe un moyen de retirer un élément d'une liste à partir de sa position au lieu de sa valeur : l'instruction :keyword:`del`. Elle diffère de la méthode :meth:`pop` qui, elle, renvoie une valeur. L'instruction :keyword:`!del` peut également être utilisée pour supprimer des tranches d'une liste ou la vider complètement (ce que nous avions fait auparavant en affectant une liste vide à la tranche). Par exemple ::

source: :keyword:`del` can also be used to delete entire variables::
fr: :keyword:`del` peut aussi être utilisée pour supprimer des variables ::

source: Referencing the name ``a`` hereafter is an error (at least until another value is assigned to it). We'll find other uses for :keyword:`del` later.
fr: À partir de là, référencer le nom ``a`` est une erreur (au moins jusqu'à ce qu'une autre valeur lui soit affectée). Vous trouverez d'autres utilisations de la fonction :keyword:`del` plus tard.

source: Tuples and Sequences
fr: Tuples et séquences

source: We saw that lists and strings have many common properties, such as indexing and slicing operations. They are two examples of *sequence* data types (see :ref:`typesseq`). Since Python is an evolving language, other sequence data types may be added. There is also another standard sequence data type: the *tuple*.
fr: Nous avons vu que les listes et les chaînes de caractères ont beaucoup de propriétés en commun, comme l'indiçage et les opérations sur des tranches. Ce sont deux exemples de *séquences* (voir :ref:`typesseq`). Comme Python est un langage en constante évolution, d'autres types de séquences y seront peut-être ajoutés. Il existe également un autre type standard de séquence : le *tuple* (ou n-uplet, dénomination que nous utiliserons dans la suite de cette documentation).

source: A tuple consists of a number of values separated by commas, for instance::
fr: Un n-uplet consiste en différentes valeurs séparées par des virgules, par exemple ::

source: As you see, on output tuples are always enclosed in parentheses, so that nested tuples are interpreted correctly; they may be input with or without surrounding parentheses, although often parentheses are necessary anyway (if the tuple is part of a larger expression). It is not possible to assign to the individual items of a tuple, however it is possible to create tuples which contain mutable objects, such as lists.
fr: Comme vous pouvez le voir, les n-uplets sont toujours affichés entre parenthèses, de façon à ce que des n-uplets imbriqués soient interprétés correctement ; ils peuvent être saisis avec ou sans parenthèses, même si celles-ci sont souvent nécessaires (notamment lorsqu'un n-uplet fait partie d'une expression plus longue). Il n'est pas possible d'affecter de valeur à un élément d'un n-uplet ; par contre, il est possible de créer des n-uplets contenant des objets muables, comme des listes.

source: Though tuples may seem similar to lists, they are often used in different situations and for different purposes. Tuples are :term:`immutable`, and usually contain a heterogeneous sequence of elements that are accessed via unpacking (see later in this section) or indexing (or even by attribute in the case of :func:`namedtuples <collections.namedtuple>`). Lists are :term:`mutable`, and their elements are usually homogeneous and are accessed by iterating over the list.
fr: Si les n-uplets peuvent sembler similaires aux listes, ils sont souvent utilisés dans des cas différents et pour des raisons différentes. Les n-uplets sont :term:`immuable`\s et contiennent souvent des séquences hétérogènes d'éléments qui sont accédés par « dissociation » (*unpacking* en anglais, voir plus loin) ou par indice (ou même par attributs dans le cas des :func:`namedtuples <collections.namedtuple>`). Les listes sont souvent :term:`muable <muable>`\s et contiennent des éléments généralement homogènes qui sont accédés par itération sur la liste.

source: A special problem is the construction of tuples containing 0 or 1 items: the syntax has some extra quirks to accommodate these. Empty tuples are constructed by an empty pair of parentheses; a tuple with one item is constructed by following a value with a comma (it is not sufficient to enclose a single value in parentheses). Ugly, but effective. For example::
fr: Un problème spécifique est la construction de n-uplets ne contenant aucun ou un seul élément : la syntaxe a quelques tournures spécifiques pour s'en accommoder. Les n-uplets vides sont construits par une paire de parenthèses vides ; un n-uplet avec un seul élément est construit en faisant suivre la valeur par une virgule (il n'est pas suffisant de placer cette valeur entre parenthèses). Pas très joli, mais efficace. Par exemple ::

source: The statement ``t = 12345, 54321, 'hello!'`` is an example of *tuple packing*: the values ``12345``, ``54321`` and ``'hello!'`` are packed together in a tuple. The reverse operation is also possible::
fr: L'instruction ``t = 12345, 54321, 'hello !'`` est un exemple d'un *d'agrégation de n-uplet* (*tuple packing* en anglais) : les valeurs ``12345``, ``54321`` et ``hello !`` sont agrégées ensemble dans un n-uplet. L'opération inverse est aussi possible ::

source: This is called, appropriately enough, *sequence unpacking* and works for any sequence on the right-hand side. Sequence unpacking requires that there are as many variables on the left side of the equals sign as there are elements in the sequence. Note that multiple assignment is really just a combination of tuple packing and sequence unpacking.
fr: Ceci est appelé, de façon plus ou moins appropriée, un *dissociation de séquence* (*sequence unpacking* en anglais) et fonctionne pour toute séquence placée à droite de l'expression. Cette dissociation requiert autant de variables dans la partie gauche qu'il y a d'éléments dans la séquence. Notez également que cette affectation multiple est juste une combinaison entre une agrégation de n-uplet et une dissociation de séquence.

source: Sets
fr: Ensembles

source: Python also includes a data type for *sets*. A set is an unordered collection with no duplicate elements. Basic uses include membership testing and eliminating duplicate entries. Set objects also support mathematical operations like union, intersection, difference, and symmetric difference.
fr: Python fournit également un type de donnée pour les *ensembles*. Un ensemble est une collection non ordonnée sans élément dupliqué. Des utilisations basiques concernent par exemple des tests d'appartenance ou des suppressions de doublons. Les ensembles savent également effectuer les opérations mathématiques telles que les unions, intersections, différences et différences symétriques.

source: Curly braces or the :func:`set` function can be used to create sets. Note: to create an empty set you have to use ``set()``, not ``{}``; the latter creates an empty dictionary, a data structure that we discuss in the next section.
fr: Des accolades ou la fonction :func:`set` peuvent être utilisés pour créer des ensembles. Notez que pour créer un ensemble vide, ``{}`` ne fonctionne pas, cela crée un dictionnaire vide. Utilisez plutôt ``set()``.

source: Here is a brief demonstration::
fr: Voici une brève démonstration ::

source: Similarly to :ref:`list comprehensions <tut-listcomps>`, set comprehensions are also supported::
fr: Tout comme pour les :ref:`compréhensions de listes <tut-listcomps>`, il est possible d'écrire des compréhensions d'ensembles ::

source: Dictionaries
fr: Dictionnaires

source: Another useful data type built into Python is the *dictionary* (see :ref:`typesmapping`). Dictionaries are sometimes found in other languages as "associative memories" or "associative arrays". Unlike sequences, which are indexed by a range of numbers, dictionaries are indexed by *keys*, which can be any immutable type; strings and numbers can always be keys. Tuples can be used as keys if they contain only strings, numbers, or tuples; if a tuple contains any mutable object either directly or indirectly, it cannot be used as a key. You can't use lists as keys, since lists can be modified in place using index assignments, slice assignments, or methods like :meth:`append` and :meth:`extend`.
fr: Un autre type de donnée très utile, natif dans Python, est le *dictionnaire* (voir :ref:`typesmapping`). Ces dictionnaires sont parfois présents dans d'autres langages sous le nom de « mémoires associatives » ou de « tableaux associatifs ». À la différence des séquences, qui sont indexées par des nombres, les dictionnaires sont indexés par des *clés*, qui peuvent être de n'importe quel type immuable ; les chaînes de caractères et les nombres peuvent toujours être des clés. Des n-uplets peuvent être utilisés comme clés s'ils ne contiennent que des chaînes, des nombres ou des n-uplets ; si un n-uplet contient un objet muable, de façon directe ou indirecte, il ne peut pas être utilisé comme une clé. Vous ne pouvez pas utiliser des listes comme clés, car les listes peuvent être modifiées en place en utilisant des affectations par position, par tranches ou via des méthodes comme :meth:`append` ou :meth:`extend`.

source: It is best to think of a dictionary as a set of *key: value* pairs, with the requirement that the keys are unique (within one dictionary). A pair of braces creates an empty dictionary: ``{}``. Placing a comma-separated list of key:value pairs within the braces adds initial key:value pairs to the dictionary; this is also the way dictionaries are written on output.
fr: Le plus simple est de considérer les dictionnaires comme des ensembles de paires *clé: valeur*, les clés devant être uniques (au sein d'un dictionnaire). Une paire d'accolades crée un dictionnaire vide : ``{}``. Placer une liste de paires clé:valeur séparées par des virgules à l'intérieur des accolades ajoute les valeurs correspondantes au dictionnaire ; c'est également de cette façon que les dictionnaires sont affichés.

source: The main operations on a dictionary are storing a value with some key and extracting the value given the key. It is also possible to delete a key:value pair with ``del``. If you store using a key that is already in use, the old value associated with that key is forgotten. It is an error to extract a value using a non-existent key.
fr: Les opérations classiques sur un dictionnaire consistent à stocker une valeur pour une clé et à extraire la valeur correspondant à une clé. Il est également possible de supprimer une paire clé:valeur avec ``del``. Si vous stockez une valeur pour une clé qui est déjà utilisée, l'ancienne valeur associée à cette clé est perdue. Si vous tentez d'extraire une valeur associée à une clé qui n'existe pas, une exception est levée.
