Repository: python/python-docs-fr
Catalog: tutorial/inputoutput.po
Languages: fr

source: File objects have some additional methods, such as :meth:`~file.isatty` and :meth:`~file.truncate` which are less frequently used; consult the Library Reference for a complete guide to file objects.
fr: Les fichiers disposent de méthodes supplémentaires, telles que :meth:`~file.isatty` et :meth:`~file.truncate` qui sont moins souvent utilisées ; consultez la Référence de la Bibliothèque Standard pour avoir un guide complet des objets fichiers.

source: Saving structured data with :mod:`json`
fr: Sauvegarde de données structurées avec le module :mod:`json`

source: Strings can easily be written to and read from a file. Numbers take a bit more effort, since the :meth:`read` method only returns strings, which will have to be passed to a function like :func:`int`, which takes a string like ``'123'`` and returns its numeric value 123. When you want to save more complex data types like nested lists and dictionaries, parsing and serializing by hand becomes complicated.
fr: Les chaînes de caractères peuvent facilement être écrites dans un fichier et relues. Les nombres nécessitent un peu plus d'effort, car la méthode :meth:`read` ne renvoie que des chaînes. Elles doivent donc être passées à une fonction comme :func:`int`, qui prend une chaîne comme ``'123'`` en entrée et renvoie sa valeur numérique 123. Mais dès que vous voulez enregistrer des types de données plus complexes comme des listes, des dictionnaires ou des instances de classes, le traitement lecture/écriture à la main devient vite compliqué.

source: Rather than having users constantly writing and debugging code to save complicated data types to files, Python allows you to use the popular data interchange format called `JSON (JavaScript Object Notation) <http://json.org>`_. The standard module called :mod:`json` can take Python data hierarchies, and convert them to string representations; this process is called :dfn:`serializing`. Reconstructing the data from the string representation is called :dfn:`deserializing`. Between serializing and deserializing, the string representing the object may have been stored in a file or data, or sent over a network connection to some distant machine.
fr: Plutôt que de passer son temps à écrire et déboguer du code permettant de sauvegarder des types de données compliqués, Python permet d'utiliser `JSON (*JavaScript Object Notation*) <http://json.org>`_, un format répandu de représentation et d'échange de données. Le module standard appelé :mod:`json` peut transformer des données hiérarchisées Python en une représentation sous forme de chaîne de caractères. Ce processus est nommé :dfn:`sérialiser`. Reconstruire les données à partir de leur représentation sous forme de chaîne est appelé :dfn:`déserialiser`. Entre sa sérialisation et sa dé-sérialisation, la chaîne représentant les données peut avoir été stockée ou transmise à une autre machine.

source: The JSON format is commonly used by modern applications to allow for data exchange. Many programmers are already familiar with it, which makes it a good choice for interoperability.
fr: Le format JSON est couramment utilisé dans les applications modernes pour échanger des données. Beaucoup de développeurs le maîtrisent, ce qui en fait un format de prédilection pour l'interopérabilité.

source: If you have an object ``x``, you can view its JSON string representation with a simple line of code::
fr: Si vous avez un objet ``x``, vous pouvez voir sa représentation JSON en tapant simplement ::

source: Another variant of the :func:`~json.dumps` function, called :func:`~json.dump`, simply serializes the object to a :term:`text file`. So if ``f`` is a :term:`text file` object opened for writing, we can do this::
fr: Une variante de la fonction :func:`~json.dumps`, nommée :func:`~json.dump`, sérialise simplement l'objet donné vers un :term:`fichier texte <text file>`. Donc si ``f`` est un :term:`fichier texte <text file>` ouvert en écriture, il est possible de faire ::

source: To decode the object again, if ``f`` is a :term:`text file` object which has been opened for reading::
fr: Pour reconstruire l'objet, si ``f`` est cette fois un :term:`fichier texte` ouvert en lecture ::

source: This simple serialization technique can handle lists and dictionaries, but serializing arbitrary class instances in JSON requires a bit of extra effort. The reference for the :mod:`json` module contains an explanation of this.
fr: Cette méthode de sérialisation peut sérialiser des listes et des dictionnaires. Mais sérialiser d'autres types de données requiert un peu plus de travail. La documentation du module :mod:`json` explique comment faire.

source: :mod:`pickle` - the pickle module
fr: Le module :mod:`pickle`

source: Contrary to :ref:`JSON <tut-json>`, *pickle* is a protocol which allows the serialization of arbitrarily complex Python objects. As such, it is specific to Python and cannot be used to communicate with applications written in other languages. It is also insecure by default: deserializing pickle data coming from an untrusted source can execute arbitrary code, if the data was crafted by a skilled attacker.
fr: Au contraire de :ref:`JSON <tut-json>`, *pickle* est un protocole permettant la sérialisation d'objets Python arbitrairement complexes. Il est donc spécifique à Python et ne peut pas être utilisé pour communiquer avec d'autres langages. Il est aussi, par défaut, une source de vulnérabilité : dé-sérialiser des données au format *pickle* provenant d'une source malveillante et particulièrement habile peut mener à exécuter du code arbitraire.
