Repository: python/python-docs-fr
Catalog: tutorial/introduction.po
Languages: fr

source: The keyword argument *end* can be used to avoid the newline after the output, or end the output with a different string::
fr: Le paramètre nommé *end* peut servir pour enlever le retour à la ligne ou pour terminer la ligne par une autre chaîne : ::

source: Footnotes
fr: Notes

source: Since ``**`` has higher precedence than ``-``, ``-3**2`` will be interpreted as ``-(3**2)`` and thus result in ``-9``. To avoid this and get ``9``, you can use ``(-3)**2``.
fr: Puisque ``**`` est prioritaire sur ``-``, ``-3 ** 2`` est interprété ``-(3 ** 2)`` et vaut donc ``-9``. Pour éviter cela et obtenir ``9``, utilisez des parenthèses : ``(-3) ** 2``.

source: Unlike other languages, special characters such as ``\n`` have the same meaning with both single (``'...'``) and double (``"..."``) quotes. The only difference between the two is that within single quotes you don't need to escape ``"`` (but you have to escape ``\'``) and vice versa.
fr: Contrairement à d'autres langages, les caractères spéciaux comme ``\n`` ont la même signification entre guillemets (``"..."``) ou entre guillemets simples (``'...'``). La seule différence est que, dans une chaîne entre guillemets, il n'est pas nécessaire de protéger les guillemets simples et vice-versa.
