Repository: python/python-docs-fr
Catalog: tutorial/introduction.po
Languages: fr

source: An Informal Introduction to Python
fr: Introduction informelle à Python

source: In the following examples, input and output are distinguished by the presence or absence of prompts (:term:`>>>` and :term:`...`): to repeat the example, you must type everything after the prompt, when the prompt appears; lines that do not begin with a prompt are output from the interpreter. Note that a secondary prompt on a line by itself in an example means you must type a blank line; this is used to end a multi-line command.
fr: Dans les exemples qui suivent, les entrées et sorties se distinguent par la présence ou l'absence d'invite (:term:`>>>` et :term:`...`) : pour reproduire les exemples, vous devez taper tout ce qui est après l'invite, au moment où celle-ci apparaît ; les lignes qui n'affichent pas d'invite sont les sorties de l'interpréteur. Notez qu'une invite secondaire affichée seule sur une ligne dans un exemple indique que vous devez entrer une ligne vide ; ceci est utilisé pour terminer une commande multi-lignes.

source: Many of the examples in this manual, even those entered at the interactive prompt, include comments. Comments in Python start with the hash character, ``#``, and extend to the end of the physical line. A comment may appear at the start of a line or following whitespace or code, but not within a string literal. A hash character within a string literal is just a hash character. Since comments are to clarify code and are not interpreted by Python, they may be omitted when typing in examples.
fr: Beaucoup d'exemples de ce manuel, même ceux saisis à l'invite de l'interpréteur, incluent des commentaires. Les commentaires en Python commencent avec un caractère croisillon, ``#``, et s'étendent jusqu'à la fin de la ligne. Un commentaire peut apparaître au début d'une ligne ou à la suite d'un espace ou de code, mais pas à l'intérieur d'une chaîne de caractères littérale. Un caractère croisillon à l'intérieur d'une chaîne de caractères est juste un caractère croisillon. Comme les commentaires ne servent qu'à expliquer le code et ne sont pas interprétés par Python, ils peuvent être ignorés lorsque vous tapez les exemples.

source: Some examples::
fr: Quelques exemples : ::

source: Using Python as a Calculator
fr: Utilisation de Python comme une calculatrice

source: Let's try some simple Python commands. Start the interpreter and wait for the primary prompt, ``>>>``. (It shouldn't take long.)
fr: Essayons quelques commandes Python simples. Démarrez l'interpréteur et attendez l'invite primaire, ``>>>``. Ça ne devrait pas être long.

source: Numbers
fr: Les nombres

source: The interpreter acts as a simple calculator: you can type an expression at it and it will write the value. Expression syntax is straightforward: the operators ``+``, ``-``, ``*`` and ``/`` work just like in most other languages (for example, Pascal or C); parentheses (``()``) can be used for grouping. For example::
fr: L'interpréteur agit comme une simple calculatrice : vous pouvez lui entrer une expression et il vous affiche la valeur. La syntaxe des expressions est simple : les opérateurs ``+``, ``-``, ``*`` et ``/`` fonctionnent comme dans la plupart des langages (par exemple, Pascal ou C) ; les parenthèses peuvent être utilisées pour faire des regroupements. Par exemple : ::

source: The integer numbers (e.g. ``2``, ``4``, ``20``) have type :class:`int`, the ones with a fractional part (e.g. ``5.0``, ``1.6``) have type :class:`float`. We will see more about numeric types later in the tutorial.
fr: Les nombre entiers (comme ``2``, ``4``, ``20``) sont de type :class:`int`, alors que les décimaux (comme ``5.0``, ``1.6``) sont de type :class:`float`. Vous trouvez plus de détails sur les types numériques plus loin dans ce tutoriel.

source: Division (``/``) always returns a float. To do :term:`floor division` and get an integer result (discarding any fractional result) you can use the ``//`` operator; to calculate the remainder you can use ``%``::
fr: Les divisions (``/``) donnent toujours des :class:`float`. Utilisez l'opérateur ``//`` pour effectuer des divisions entières et donc obtenir un résultat entier. Pour obtenir le reste d'une division entière, utilisez l'opérateur ``%`` : ::

source: With Python, it is possible to use the ``**`` operator to calculate powers [#]_::
fr: En Python, il est possible de calculer des puissances avec l'opérateur ``**`` [#]_ : ::

source: The equal sign (``=``) is used to assign a value to a variable. Afterwards, no result is displayed before the next interactive prompt::
fr: Le signe égal (``=``) est utilisé pour affecter une valeur à une variable. Dans ce cas, aucun résultat n'est affiché avant l'invite suivante : ::

source: If a variable is not "defined" (assigned a value), trying to use it will give you an error::
fr: Si une variable n'est pas "définie" (si aucune valeur ne lui a été affectée), son utilisation produit une erreur : ::

source: There is full support for floating point; operators with mixed type operands convert the integer operand to floating point::
fr: Les nombres à virgule flottante sont tout à fait admis (NdT : Python utilise le point *.* comme séparateur entre la partie entière et la partie décimale des nombres, c'est la convention anglo-saxonne) ; les opérateurs avec des opérandes de types différents convertissent l'opérande de type entier en type virgule flottante : ::

source: In interactive mode, the last printed expression is assigned to the variable ``_``. This means that when you are using Python as a desk calculator, it is somewhat easier to continue calculations, for example::
fr: En mode interactif, la dernière expression affichée est affectée à la variable ``_``. Ainsi, lorsque vous utilisez Python comme calculatrice, cela vous permet de continuer des calculs facilement, par exemple : ::

source: This variable should be treated as read-only by the user. Don't explicitly assign a value to it --- you would create an independent local variable with the same name masking the built-in variable with its magic behavior.
fr: Cette variable doit être considérée comme une variable en lecture seule par l'utilisateur. Ne lui affectez pas de valeur explicitement --- vous créeriez ainsi une variable locale indépendante, avec le même nom, qui masquerait la variable native et son fonctionnement magique.

source: In addition to :class:`int` and :class:`float`, Python supports other types of numbers, such as :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Python also has built-in support for :ref:`complex numbers <typesnumeric>`, and uses the ``j`` or ``J`` suffix to indicate the imaginary part (e.g. ``3+5j``).
fr: En plus des :class:`int` et des :class:`float`, il existe les :class:`~decimal.Decimal` et les :class:`~fractions.Fraction`. Python gère aussi les :ref:`nombres complexes <typesnumeric>`, en utilisant le suffixe ``j`` ou ``J`` pour indiquer la partie imaginaire (tel que ``3+5j``).

source: Strings
fr: Chaînes de caractères

source: Besides numbers, Python can also manipulate strings, which can be expressed in several ways. They can be enclosed in single quotes (``'...'``) or double quotes (``"..."``) with the same result [#]_. ``\`` can be used to escape quotes::
fr: En plus des nombres, Python sait aussi manipuler des chaînes de caractères, qui peuvent être exprimées de différentes manières. Elles peuvent être écrites entre guillemets simples (``'...'``) ou entre guillemets (``"..."``) sans distinction [#]_. ``\`` peut être utilisé pour protéger un guillemet : ::

source: In the interactive interpreter, the output string is enclosed in quotes and special characters are escaped with backslashes. While this might sometimes look different from the input (the enclosing quotes could change), the two strings are equivalent. The string is enclosed in double quotes if the string contains a single quote and no double quotes, otherwise it is enclosed in single quotes. The :func:`print` function produces a more readable output, by omitting the enclosing quotes and by printing escaped and special characters::
fr: En mode interactif, l'interpréteur affiche les chaînes de caractères entre guillemets. Les guillemets et autres caractères spéciaux sont protégés avec des barres obliques inverses (*backslash* en anglais). Bien que cela puisse être affiché différemment de ce qui a été entré (les guillemets peuvent changer), les deux formats sont équivalents. La chaîne est affichée entre guillemets si elle contient un guillemet simple et aucun guillemet, sinon elle est affichée entre guillemets simples. La fonction :func:`print` affiche les chaînes de manière plus lisible, en retirant les guillemets et en affichant les caractères spéciaux qui étaient protégés par une barre oblique inverse : ::

source: If you don't want characters prefaced by ``\`` to be interpreted as special characters, you can use *raw strings* by adding an ``r`` before the first quote::
fr: Si vous ne voulez pas que les caractères précédés d'un ``\`` soient interprétés comme étant spéciaux, utilisez les *chaînes brutes* (*raw strings* en anglais) en préfixant la chaîne d'un ``r`` : ::

source: String literals can span multiple lines. One way is using triple-quotes: ``"""..."""`` or ``'''...'''``. End of lines are automatically included in the string, but it's possible to prevent this by adding a ``\`` at the end of the line. The following example::
fr: Les chaînes de caractères peuvent s'étendre sur plusieurs lignes. Utilisez alors des triples guillemets, simples ou doubles : ``'''...'''`` ou ``"""..."""``. Les retours à la ligne sont automatiquement inclus, mais on peut l'empêcher en ajoutant ``\`` à la fin de la ligne. L'exemple suivant : ::

source: produces the following output (note that the initial newline is not included):
fr: produit l'affichage suivant (notez que le premier retour à la ligne n'est pas inclus) :

source: Strings can be concatenated (glued together) with the ``+`` operator, and repeated with ``*``::
fr: Les chaînes peuvent être concaténées (collées ensemble) avec l'opérateur ``+`` et répétées avec l'opérateur ``*`` ::

source: Two or more *string literals* (i.e. the ones enclosed between quotes) next to each other are automatically concatenated. ::
fr: Plusieurs chaînes de caractères, écrites littéralement (c'est à dire entre guillemets), côte à côte, sont automatiquement concaténées. ::

source: This feature is particularly useful when you want to break long strings::
fr: Cette fonctionnalité est surtout intéressante pour couper des chaînes trop longues : ::

source: This only works with two literals though, not with variables or expressions::
fr: Cela ne fonctionne cependant qu'avec les chaînes littérales, pas avec les variables ni les expressions : ::

source: If you want to concatenate variables or a variable and a literal, use ``+``::
fr: Pour concaténer des variables, ou des variables avec des chaînes littérales, utilisez l'opérateur ``+`` : ::

source: Strings can be *indexed* (subscripted), with the first character having index 0. There is no separate character type; a character is simply a string of size one::
fr: Les chaînes de caractères peuvent être indexées (i.e. on peut accéder aux caractères par leur position), le premier caractère d'une chaîne étant à la position 0. Il n'existe pas de type distinct pour les caractères, un caractère est simplement une chaîne de longueur 1 ::

source: Indices may also be negative numbers, to start counting from the right::
fr: Les indices peuvent également être négatifs, on compte alors en partant de la droite. Par exemple : ::

source: Note that since -0 is the same as 0, negative indices start from -1.
fr: Notez que, comme ``-0`` égale ``0``, les indices négatifs commencent par ``-1``.

source: In addition to indexing, *slicing* is also supported. While indexing is used to obtain individual characters, *slicing* allows you to obtain substring::
fr: En plus d'accéder à un élément par son indice, il est aussi possible de "trancher" (*slice* en anglais) une chaîne. Accéder à une chaîne par un indice permet d'obtenir un caractère, *trancher* permet d'obtenir une sous-chaîne : ::

source: Note how the start is always included, and the end always excluded. This makes sure that ``s[:i] + s[i:]`` is always equal to ``s``::
fr: Notez que le début est toujours inclus et la fin toujours exclue. Cela assure que ``s[:i] + s[i:]`` est toujours égal à ``s`` : ::

source: Slice indices have useful defaults; an omitted first index defaults to zero, an omitted second index defaults to the size of the string being sliced. ::
fr: Les valeurs par défaut des indices de tranches ont une utilité ; le premier indice vaut zéro par défaut (i.e. lorsqu'il est omis), le deuxième correspond par défaut à la taille de la chaîne de caractères : ::

source: One way to remember how slices work is to think of the indices as pointing *between* characters, with the left edge of the first character numbered 0. Then the right edge of the last character of a string of *n* characters has index *n*, for example::
fr: Pour mémoriser la façon dont les tranches fonctionnent, vous pouvez imaginer que les indices pointent *entre* les caractères, le côté gauche du premier caractère ayant la position 0. Le côté droit du dernier caractère d'une chaîne de *n* caractères a alors pour indice *n*. Par exemple : ::

source: The first row of numbers gives the position of the indices 0...6 in the string; the second row gives the corresponding negative indices. The slice from *i* to *j* consists of all characters between the edges labeled *i* and *j*, respectively.
fr: La première ligne de nombres donne la position des indices 0...6 dans la chaîne ; la deuxième ligne donne l'indice négatif correspondant. La tranche de *i* à *j* est constituée de tous les caractères situés entre les bords libellés *i* et *j*, respectivement.

source: For non-negative indices, the length of a slice is the difference of the indices, if both are within bounds. For example, the length of ``word[1:3]`` is 2.
fr: Pour des indices non négatifs, la longueur d'une tranche est la différence entre ces indices, si les deux sont entre les bornes. Par exemple, la longueur de ``word[1:3]`` est 2.

source: Attempting to use an index that is too large will result in an error::
fr: Utiliser un indice trop grand produit une erreur : ::

source: However, out of range slice indexes are handled gracefully when used for slicing::
fr: Cependant, les indices hors bornes sont gérés silencieusement lorsqu'ils sont utilisés dans des tranches : ::

source: Python strings cannot be changed --- they are :term:`immutable`. Therefore, assigning to an indexed position in the string results in an error::
fr: Les chaînes de caractères, en Python, ne peuvent pas être modifiées. On dit qu'elles sont :term:`immuable`\s. Affecter une nouvelle valeur à un indice dans une chaîne produit une erreur : ::

source: If you need a different string, you should create a new one::
fr: Si vous avez besoin d'une chaîne différente, vous devez en créer une nouvelle : ::

source: The built-in function :func:`len` returns the length of a string::
fr: La fonction native :func:`len` renvoie la longueur d'une chaîne : ::

source: Strings are examples of *sequence types*, and support the common operations supported by such types.
fr: Les chaînes de caractères sont des exemples de *types séquences* ; elles acceptent donc les opérations classiques prises en charge par ces types.

source: Strings support a large number of methods for basic transformations and searching.
fr: Les chaînes de caractères gèrent un large éventail de méthodes de transformations basiques et de recherche.

source: String literals that have embedded expressions.
fr: Des chaînes littérales qui contiennent des expressions.

source: Information about string formatting with :meth:`str.format`.
fr: Informations sur le formatage des chaînes avec la méthode :meth:`str.format`.

source: The old formatting operations invoked when strings are the left operand of the ``%`` operator are described in more detail here.
fr: Description détaillée des anciennes méthodes de mise en forme, appelées lorsque les chaînes de caractères sont à gauche de l'opérateur ``%``.

source: Lists
fr: Listes

source: Python knows a number of *compound* data types, used to group together other values. The most versatile is the *list*, which can be written as a list of comma-separated values (items) between square brackets. Lists might contain items of different types, but usually the items all have the same type. ::
fr: Python connaît différents types de données *combinés*, utilisés pour regrouper plusieurs valeurs. La plus souple est la *liste*, qui peut être écrite comme une suite, placée entre crochets, de valeurs (éléments) séparés par des virgules. Les éléments d'une liste ne sont pas obligatoirement tous du même type, bien qu'à l'usage ce soit souvent le cas. ::

source: Like strings (and all other built-in :term:`sequence` types), lists can be indexed and sliced::
fr: Comme les chaînes de caractères (et toute autre type de :term:`sequence`), les listes peuvent être indicées et découpées ::

source: All slice operations return a new list containing the requested elements. This means that the following slice returns a new (shallow) copy of the list::
fr: Toutes les opérations par tranches renvoient une nouvelle liste contenant les éléments demandés. Cela signifie que l'opération suivante renvoie une copie (superficielle) de la liste : ::

source: Lists also support operations like concatenation::
fr: Les listes gèrent aussi les opérations comme les concaténations : ::

source: Unlike strings, which are :term:`immutable`, lists are a :term:`mutable` type, i.e. it is possible to change their content::
fr: Mais à la différence des chaînes qui sont :term:`immuable`\s, les listes sont :term:`muables <mutable>`\s : il est possible de modifier leur contenu : ::

source: You can also add new items at the end of the list, by using the :meth:`~list.append` *method* (we will see more about methods later)::
fr: Il est aussi possible d'ajouter de nouveaux éléments à la fin d'une liste avec la méthode :meth:`~list.append` (les méthodes sont abordées plus tard) : ::

source: Assignment to slices is also possible, and this can even change the size of the list or clear it entirely::
fr: Des affectations de tranches sont également possibles, ce qui peut même modifier la taille de la liste ou la vider complètement : ::

source: The built-in function :func:`len` also applies to lists::
fr: La primitive :func:`len` s'applique aussi aux listes : ::

source: It is possible to nest lists (create lists containing other lists), for example::
fr: Il est possible d'imbriquer des listes (i.e. créer des listes contenant d'autres listes). Par exemple : ::

source: First Steps Towards Programming
fr: Premiers pas vers la programmation

source: Of course, we can use Python for more complicated tasks than adding two and two together. For instance, we can write an initial sub-sequence of the `Fibonacci series <https://en.wikipedia.org/wiki/Fibonacci_number>`_ as follows::
fr: Bien entendu, on peut utiliser Python pour des tâches plus compliquées que d'additionner deux et deux. Par exemple, on peut écrire le début de la `suite de Fibonacci <https://fr.wikipedia.org/wiki/Suite_de_Fibonacci>`_ comme ceci : ::

source: This example introduces several new features.
fr: Cet exemple introduit plusieurs nouvelles fonctionnalités.

source: The first line contains a *multiple assignment*: the variables ``a`` and ``b`` simultaneously get the new values 0 and 1. On the last line this is used again, demonstrating that the expressions on the right-hand side are all evaluated first before any of the assignments take place. The right-hand side expressions are evaluated from the left to the right.
fr: La première ligne contient une *affectation multiple* : les variables ``a`` et ``b`` se voient affecter simultanément leurs nouvelles valeurs 0 et 1. Cette méthode est encore utilisée à la dernière ligne, pour démontrer que les expressions sur la partie droite de l'affectation sont toutes évaluées avant que les affectations ne soient effectuées. Ces expressions en partie droite sont toujours évaluées de la gauche vers la droite.

source: The :keyword:`while` loop executes as long as the condition (here: ``a < 10``) remains true. In Python, like in C, any non-zero integer value is true; zero is false. The condition may also be a string or list value, in fact any sequence; anything with a non-zero length is true, empty sequences are false. The test used in the example is a simple comparison. The standard comparison operators are written the same as in C: ``<`` (less than), ``>`` (greater than), ``==`` (equal to), ``<=`` (less than or equal to), ``>=`` (greater than or equal to) and ``!=`` (not equal to).
fr: La boucle :keyword:`while` s'exécute tant que la condition (ici : ``a < 10``) reste vraie. En Python, comme en C, tout entier différent de zéro est vrai et zéro est faux. La condition peut aussi être une chaîne de caractères, une liste, ou en fait toute séquence ; une séquence avec une valeur non nulle est vraie, une séquence vide est fausse. Le test utilisé dans l'exemple est une simple comparaison. Les opérateurs de comparaison standards sont écrits comme en C : ``<`` (inférieur), ``>`` (supérieur), ``==`` (égal), ``<=`` (inférieur ou égal), ``>=`` (supérieur ou égal) et ``!=`` (non égal).

source: The *body* of the loop is *indented*: indentation is Python's way of grouping statements. At the interactive prompt, you have to type a tab or space(s) for each indented line. In practice you will prepare more complicated input for Python with a text editor; all decent text editors have an auto-indent facility. When a compound statement is entered interactively, it must be followed by a blank line to indicate completion (since the parser cannot guess when you have typed the last line). Note that each line within a basic block must be indented by the same amount.
fr: Le *corps* de la boucle est *indenté* : l'indentation est la méthode utilisée par Python pour regrouper des instructions. En mode interactif, vous devez saisir une tabulation ou des espaces pour chaque ligne indentée. En pratique, vous aurez intérêt à utiliser un éditeur de texte pour les saisies plus compliquées ; tous les éditeurs de texte dignes de ce nom disposent d'une fonction d'auto-indentation. Lorsqu'une expression composée est saisie en mode interactif, elle doit être suivie d'une ligne vide pour indiquer qu'elle est terminée (car l'analyseur ne peut pas deviner que vous venez de saisir la dernière ligne). Notez bien que toutes les lignes à l'intérieur d'un bloc doivent être indentées au même niveau.

source: The :func:`print` function writes the value of the argument(s) it is given. It differs from just writing the expression you want to write (as we did earlier in the calculator examples) in the way it handles multiple arguments, floating point quantities, and strings. Strings are printed without quotes, and a space is inserted between items, so you can format things nicely, like this::
fr: La fonction :func:`print` écrit les valeur des paramètres qui lui sont fournis. Ce n'est pas la même chose que d'écrire l'expression que vous voulez afficher (comme nous l'avons fait dans l'exemple de la calculatrice), en raison de la manière qu'a ``print`` de gérer les paramètres multiples, les nombres décimaux et les chaînes. Les chaînes sont affichées sans apostrophe et une espace est insérée entre les éléments de telle sorte que vous pouvez facilement formater les choses, comme ceci : ::
