Repository: python/python-docs-fr
Catalog: tutorial/modules.po
Languages: fr

source: If you quit from the Python interpreter and enter it again, the definitions you have made (functions and variables) are lost. Therefore, if you want to write a somewhat longer program, you are better off using a text editor to prepare the input for the interpreter and running it with that file as input instead. This is known as creating a *script*. As your program gets longer, you may want to split it into several files for easier maintenance. You may also want to use a handy function that you've written in several programs without copying its definition into each program.
fr: Lorsque vous quittez et entrez à nouveau dans l'interpréteur Python, tout ce que vous avez déclaré dans la session précédente est perdu. Afin de rédiger des programmes plus longs, vous devez utiliser un éditeur de texte, préparer votre code dans un fichier et exécuter Python avec ce fichier en paramètre. Cela s'appelle créer un *script*. Lorsque votre programme grandit, vous pouvez séparer votre code dans plusieurs fichiers. Ainsi, il vous est facile de réutiliser des fonctions écrites pour un programme dans un autre sans avoir à les copier.

source: To support this, Python has a way to put definitions in a file and use them in a script or in an interactive instance of the interpreter. Such a file is called a *module*; definitions from a module can be *imported* into other modules or into the *main* module (the collection of variables that you have access to in a script executed at the top level and in calculator mode).
fr: Pour gérer cela, Python vous permet de placer des définitions dans un fichier et de les utiliser dans un script ou une session interactive. Un tel fichier est appelé un *module* et les définitions d'un module peuvent être importées dans un autre module ou dans le module *main* (qui est le module qui contient vos variables et définitions lors de l'exécution d'un script au niveau le plus haut ou en mode interactif).

source: A module is a file containing Python definitions and statements. The file name is the module name with the suffix :file:`.py` appended. Within a module, the module's name (as a string) is available as the value of the global variable ``__name__``. For instance, use your favorite text editor to create a file called :file:`fibo.py` in the current directory with the following contents::
fr: Un module est un fichier contenant des définitions et des instructions. Son nom de fichier est le nom du module suffixé de :file:`.py`. À l'intérieur d'un module, son propre nom est accessible par la variable ``__name__``. Par exemple, prenez votre éditeur favori et créez un fichier :file:`fibo.py` dans le répertoire courant qui contient : ::

source: Now enter the Python interpreter and import this module with the following command::
fr: Maintenant, ouvrez un interpréteur et importez le module en tapant : ::

source: This does not enter the names of the functions defined in ``fibo`` directly in the current symbol table; it only enters the module name ``fibo`` there. Using the module name you can access the functions::
fr: Cela n'importe pas les noms des fonctions définies dans ``fibo`` directement dans la table des symboles courants mais y ajoute simplement ``fibo``. Vous pouvez donc appeler les fonctions *via* le nom du module : ::

source: If you intend to use a function often you can assign it to a local name::
fr: Si vous avez l'intention d'utiliser souvent une fonction, il est possible de lui assigner un nom local : ::

source: More on Modules
fr: Les modules en détail

source: A module can contain executable statements as well as function definitions. These statements are intended to initialize the module. They are executed only the *first* time the module name is encountered in an import statement. [#]_ (They are also run if the file is executed as a script.)
fr: Un module peut contenir aussi bien des instructions que des déclarations de fonctions. Ces instructions permettent d'initialiser le module. Elles ne sont exécutées que la *première* fois que le nom d'un module est trouvé dans un ``import`` [#]_ (elles sont aussi exécutées lorsque le fichier est exécuté en tant que script).

source: Each module has its own private symbol table, which is used as the global symbol table by all functions defined in the module. Thus, the author of a module can use global variables in the module without worrying about accidental clashes with a user's global variables. On the other hand, if you know what you are doing you can touch a module's global variables with the same notation used to refer to its functions, ``modname.itemname``.
fr: Chaque module possède sa propre table de symboles, utilisée comme table de symboles globaux par toutes les fonctions définies par le module. Ainsi l'auteur d'un module peut utiliser des variables globales dans un module sans se soucier de collisions de noms avec des variables globales définies par l'utilisateur du module. Cependant, si vous savez ce que vous faites, vous pouvez modifier une variable globale d'un module avec la même notation que pour accéder aux fonctions : ``nommodule.nomelement``.

source: Modules can import other modules. It is customary but not required to place all :keyword:`import` statements at the beginning of a module (or script, for that matter). The imported module names are placed in the importing module's global symbol table.
fr: Des modules peuvent importer d'autres modules. Il est courant, mais pas obligatoire, de ranger tous les :keyword:`import` au début du module (ou du script). Les noms des modules importés sont insérés dans la table des symboles globaux du module qui importe.

source: There is a variant of the :keyword:`import` statement that imports names from a module directly into the importing module's symbol table. For example::
fr: Il existe une variante de l'instruction :keyword:`import` qui importe les noms d'un module directement dans la table de symboles du module qui l'importe, par exemple : ::

source: This does not introduce the module name from which the imports are taken in the local symbol table (so in the example, ``fibo`` is not defined).
fr: Cela n'insère pas le nom du module depuis lequel les définitions sont récupérées dans la table des symboles locaux (dans cet exemple, ``fibo`` n'est pas défini).

source: There is even a variant to import all names that a module defines::
fr: Il existe même une variante permettant d'importer tous les noms qu'un module définit : ::

source: This imports all names except those beginning with an underscore (``_``). In most cases Python programmers do not use this facility since it introduces an unknown set of names into the interpreter, possibly hiding some things you have already defined.
fr: Tous les noms ne commençant pas par un tiret bas (``_``) sont importés. Dans la grande majorité des cas, les développeurs n'utilisent pas cette syntaxe puisqu'en important un ensemble indéfini de noms, des noms déjà définis peuvent se retrouver masqués.

source: Note that in general the practice of importing ``*`` from a module or package is frowned upon, since it often causes poorly readable code. However, it is okay to use it to save typing in interactive sessions.
fr: Notez qu'en général, importer ``*`` d'un module ou d'un paquet est déconseillé. Souvent, le code devient difficilement lisible. Son utilisation en mode interactif est acceptée pour gagner quelques secondes.

source: If the module name is followed by :keyword:`as`, then the name following :keyword:`as` is bound directly to the imported module.
fr: Si le nom du module est suivi par :keyword:`as`, alors le nom suivant :keyword:`as` est directement lié au module importé.

source: This is effectively importing the module in the same way that ``import fibo`` will do, with the only difference of it being available as ``fib``.
fr: Dans les faits, le module est importé de la même manière qu'avec ``import fibo``, la seule différence est qu'il sera disponnible sous le nom de ``fib``.

source: It can also be used when utilising :keyword:`from` with similar effects::
fr: C'est aussi valide en utilisant :keyword:`from`, et a le même effet ::

source: For efficiency reasons, each module is only imported once per interpreter session. Therefore, if you change your modules, you must restart the interpreter -- or, if it's just one module you want to test interactively, use :func:`importlib.reload`, e.g. ``import importlib; importlib.reload(modulename)``.
fr: pour des raisons de performance, chaque module n'est importé qu'une fois par session. Si vous changez le code d'un module vous devez donc redémarrer l'interpréteur afin d'en voir l'impact ; ou, s'il s'agit simplement d'un seul module que vous voulez tester en mode interactif, vous pouvez le ré-importer explicitement en utilisant :func:`importlib.reload`, par exemple : ``import importlib; importlib.reload(nommodule)``.

source: Executing modules as scripts
fr: Exécuter des modules comme des scripts

source: When you run a Python module with ::
fr: Lorsque vous exécutez un module Python avec : ::

source: the code in the module will be executed, just as if you imported it, but with the ``__name__`` set to ``"__main__"``. That means that by adding this code at the end of your module::
fr: le code du module est exécuté comme si vous l'aviez importé mais son ``__name__`` vaut ``"__main__"``. Donc, en ajoutant ces lignes à la fin du module : ::

source: you can make the file usable as a script as well as an importable module, because the code that parses the command line only runs if the module is executed as the "main" file:
fr: vous pouvez rendre le fichier utilisable comme script aussi bien que comme module importable, car le code qui analyse la ligne de commande n'est lancé que si le module est exécuté comme fichier « main » :

source: If the module is imported, the code is not run::
fr: Si le fichier est importé, le code n'est pas exécuté : ::

source: This is often used either to provide a convenient user interface to a module, or for testing purposes (running the module as a script executes a test suite).
fr: C'est typiquement utilisé soit pour proposer une interface utilisateur pour un module, soit pour lancer les tests sur le module (exécuter le module en tant que script lance les tests).

source: The Module Search Path
fr: Les dossiers de recherche de modules

source: When a module named :mod:`spam` is imported, the interpreter first searches for a built-in module with that name. If not found, it then searches for a file named :file:`spam.py` in a list of directories given by the variable :data:`sys.path`. :data:`sys.path` is initialized from these locations:
fr: Lorsqu'un module nommé par exemple :mod:`spam` est importé, il est d'abord recherché parmi les modules natifs puis, s'il n'est pas trouvé, l'interpréteur cherche un fichier nommé :file:`spam.py` dans une liste de dossiers donnée par la variable :data:`sys.path`. Par défaut, :data:`sys.path` est initialisée à : ::

source: The directory containing the input script (or the current directory when no file is specified).
fr: le dossier contenant le script courant (ou le dossier courant si aucun script n'est donné) ;

source: :envvar:`PYTHONPATH` (a list of directory names, with the same syntax as the shell variable :envvar:`PATH`).
fr: :envvar:`PYTHONPATH` (une liste de dossiers, utilisant la même syntaxe que la variable shell :envvar:`PATH`) ;

source: The installation-dependent default.
fr: la valeur par défaut, dépendante de l'installation.

source: On file systems which support symlinks, the directory containing the input script is calculated after the symlink is followed. In other words the directory containing the symlink is **not** added to the module search path.
fr: sur les systèmes qui gèrent les liens symboliques, le dossier contenant le script courant est résolu après avoir suivi le lien symbolique du script. Autrement dit, le dossier contenant le lien symbolique n'est **pas** ajouté aux dossiers de recherche de modules.

source: After initialization, Python programs can modify :data:`sys.path`. The directory containing the script being run is placed at the beginning of the search path, ahead of the standard library path. This means that scripts in that directory will be loaded instead of modules of the same name in the library directory. This is an error unless the replacement is intended. See section :ref:`tut-standardmodules` for more information.
fr: Après leur initialisation, les programmes Python peuvent modifier leur :data:`sys.path`. Le dossier contenant le script courant est placé au début de la liste des dossiers à rechercher, avant les dossiers de bibliothèques. Cela signifie qu'un module dans ce dossier, ayant le même nom qu'un module, sera chargé à sa place. C'est une erreur typique, à moins que ce ne soit voulu. Voir :ref:`tut-standardmodules` pour plus d'informations.

source: "Compiled" Python files
fr: Fichiers Python "compilés"

source: To speed up loading modules, Python caches the compiled version of each module in the ``__pycache__`` directory under the name :file:`module.{version}.pyc`, where the version encodes the format of the compiled file; it generally contains the Python version number. For example, in CPython release 3.3 the compiled version of spam.py would be cached as ``__pycache__/spam.cpython-33.pyc``. This naming convention allows compiled modules from different releases and different versions of Python to coexist.
fr: Pour accélérer le chargement des modules, Python cache une version compilée de chaque module dans un fichier nommé :file:`module(version).pyc` (ou *version* représente le format du fichier compilé, typiquement une version de Python) dans le dossier ``__pycache__``. Par exemple, avec CPython 3.3, la version compilée de spam.py serait ``__pycache__/spam.cpython-33.pyc``. Cette règle de nommage permet à des versions compilées par des versions différentes de Python de coexister.

source: Python checks the modification date of the source against the compiled version to see if it's out of date and needs to be recompiled. This is a completely automatic process. Also, the compiled modules are platform-independent, so the same library can be shared among systems with different architectures.
fr: Python compare les dates de modification du fichier source et de sa version compilée pour voir si le module doit être recompilé. Ce processus est entièrement automatique. Par ailleurs, les versions compilées sont indépendantes de la plateforme et peuvent donc être partagées entre des systèmes d'architectures différentes.

source: Python does not check the cache in two circumstances. First, it always recompiles and does not store the result for the module that's loaded directly from the command line. Second, it does not check the cache if there is no source module. To support a non-source (compiled only) distribution, the compiled module must be in the source directory, and there must not be a source module.
fr: Il existe deux situations où Python ne vérifie pas le cache : le premier cas est lorsque le module est donné par la ligne de commande (cas où le module est toujours recompilé, sans même cacher sa version compilée) ; le second cas est lorsque le module n'a pas de source. Pour gérer un module sans source (où seule la version compilée est fournie), le module compilé doit se trouver dans le dossier source et sa source ne doit pas être présente.

source: Some tips for experts:
fr: Astuces pour les experts :

source: You can use the :option:`-O` or :option:`-OO` switches on the Python command to reduce the size of a compiled module. The ``-O`` switch removes assert statements, the ``-OO`` switch removes both assert statements and __doc__ strings. Since some programs may rely on having these available, you should only use this option if you know what you're doing. "Optimized" modules have an ``opt-`` tag and are usually smaller. Future releases may change the effects of optimization.
fr: vous pouvez utiliser les options :option:`-O` ou :option:`-OO` lors de l'appel à Python pour réduire la taille des modules compilés. L'option ``-O`` supprime les instructions ``assert`` et l'option ``-OO`` supprime aussi les documentations ``__doc__``. Cependant, puisque certains programmes ont besoin de ces ``__doc__``, vous ne devriez utiliser ``-OO`` que si vous savez ce que vous faites. Les modules "optimisés" sont marqués d'un ``opt-`` et sont généralement plus petits. Les versions futures de Python pourraient changer les effets de l'optimisation ;

source: A program doesn't run any faster when it is read from a ``.pyc`` file than when it is read from a ``.py`` file; the only thing that's faster about ``.pyc`` files is the speed with which they are loaded.
fr: un programme ne s'exécute pas plus vite lorsqu'il est lu depuis un ``.pyc``, il est juste chargé plus vite ;

source: The module :mod:`compileall` can create .pyc files for all modules in a directory.
fr: le module :mod:`compileall` peut créer des fichiers ``.pyc`` pour tous les modules d'un dossier ;

source: Standard Modules
fr: Modules standards

source: Python comes with a library of standard modules, described in a separate document, the Python Library Reference ("Library Reference" hereafter). Some modules are built into the interpreter; these provide access to operations that are not part of the core of the language but are nevertheless built in, either for efficiency or to provide access to operating system primitives such as system calls. The set of such modules is a configuration option which also depends on the underlying platform. For example, the :mod:`winreg` module is only provided on Windows systems. One particular module deserves some attention: :mod:`sys`, which is built into every Python interpreter. The variables ``sys.ps1`` and ``sys.ps2`` define the strings used as primary and secondary prompts::
fr: Python est accompagné d'une bibliothèque de modules standards, décrits dans la documentation de la Bibliothèque Python, plus loin. Certains modules sont intégrés dans l'interpréteur, ils exposent des outils qui ne font pas partie du langage mais qui font tout de même partie de l'interpréteur, soit pour le côté pratique, soit pour exposer des outils essentiels tels que l'accès aux appels système. La composition de ces modules est configurable à la compilation et dépend aussi de la plateforme cible. Par exemple, le module :mod:`winreg` n'est proposé que sur les systèmes Windows. Un module mérite une attention particulière, le module :mod:`sys`, qui est présent dans tous les interpréteurs Python. Les variables ``sys.ps1`` et ``sys.ps2`` définissent les chaînes d'invites principales et secondaires : ::

source: These two variables are only defined if the interpreter is in interactive mode.
fr: Ces deux variables ne sont définies que si l'interpréteur est en mode interactif.

source: The variable ``sys.path`` is a list of strings that determines the interpreter's search path for modules. It is initialized to a default path taken from the environment variable :envvar:`PYTHONPATH`, or from a built-in default if :envvar:`PYTHONPATH` is not set. You can modify it using standard list operations::
fr: La variable ``sys.path`` est une liste de chaînes qui détermine les chemins de recherche de modules pour l'interpréteur. Elle est initialisée à un chemin par défaut pris de la variable d'environnement :envvar:`PYTHONPATH` ou d'une valeur par défaut interne si :envvar:`PYTHONPATH` n'est pas définie. ``sys.path`` est modifiable en utilisant les opérations habituelles des listes : ::

source: The :func:`dir` Function
fr: La fonction :func:`dir`

source: The built-in function :func:`dir` is used to find out which names a module defines. It returns a sorted list of strings::
fr: La fonction interne :func:`dir` est utilisée pour trouver quels noms sont définis par un module. Elle donne une liste de chaînes classées par ordre lexicographique : ::

source: Without arguments, :func:`dir` lists the names you have defined currently::
fr: Sans paramètre, :func:`dir` liste les noms actuellement définis : ::

source: Note that it lists all types of names: variables, modules, functions, etc.
fr: Notez qu'elle liste tous les types de noms : les variables, fonctions, modules, etc.

source: :func:`dir` does not list the names of built-in functions and variables. If you want a list of those, they are defined in the standard module :mod:`builtins`::
fr: :func:`dir` ne liste ni les fonctions primitives, ni les variables internes. Si vous voulez les lister, elles sont définies dans le module :mod:`builtins` : ::

source: Packages
fr: Les paquets

source: Packages are a way of structuring Python's module namespace by using "dotted module names". For example, the module name :mod:`A.B` designates a submodule named ``B`` in a package named ``A``. Just like the use of modules saves the authors of different modules from having to worry about each other's global variable names, the use of dotted module names saves the authors of multi-module packages like NumPy or Pillow from having to worry about each other's module names.
fr: Les paquets sont un moyen de structurer les espaces de noms des modules Python en utilisant une notation "pointée". Par exemple, le nom de module :mod:`A.B` désigne le sous-module ``B`` du paquet ``A``. De la même manière que l'utilisation des modules évite aux auteurs de différents modules d'avoir à se soucier des noms de variables globales des autres, l'utilisation des noms de modules avec des points évite aux auteurs de paquets contenant plusieurs modules tel que NumPy ou Pillow d'avoir à se soucier des noms des modules des autres.

source: Suppose you want to design a collection of modules (a "package") for the uniform handling of sound files and sound data. There are many different sound file formats (usually recognized by their extension, for example: :file:`.wav`, :file:`.aiff`, :file:`.au`), so you may need to create and maintain a growing collection of modules for the conversion between the various file formats. There are also many different operations you might want to perform on sound data (such as mixing, adding echo, applying an equalizer function, creating an artificial stereo effect), so in addition you will be writing a never-ending stream of modules to perform these operations. Here's a possible structure for your package (expressed in terms of a hierarchical filesystem):
fr: Imaginez que vous voulez construire un ensemble de modules (un "paquet") pour gérer uniformément les fichiers contenant du son et des données sonores. Il existe un grand nombre de formats de fichiers pour stocker du son (généralement identifiés par leur extension, par exemple :file:`.wav`, :file:`.aiff`, :file:`.au`), vous avez donc besoin de créer et maintenir un nombre croissant de modules pour gérer la conversion entre tous ces formats. Vous voulez aussi pouvoir appliquer un certain nombre d'opérations sur ces sons : mixer, ajouter de l'écho, égaliser, ajouter un effet stéréo artificiel, etc. Donc, en plus des modules de conversion, vous allez écrire une myriade de modules permettant d'effectuer ces opérations. Voici une structure possible pour votre paquet (exprimée sous la forme d'une arborescence de fichiers :

source: When importing the package, Python searches through the directories on ``sys.path`` looking for the package subdirectory.
fr: Lorsqu'il importe des paquets, Python cherche dans chaque dossier de ``sys.path`` un sous-dossier du nom du paquet.
