Repository: python/python-docs-fr
Catalog: tutorial/modules.po
Languages: fr

source: The :file:`__init__.py` files are required to make Python treat the directories as containing packages; this is done to prevent directories with a common name, such as ``string``, from unintentionally hiding valid modules that occur later on the module search path. In the simplest case, :file:`__init__.py` can just be an empty file, but it can also execute initialization code for the package or set the ``__all__`` variable, described later.
fr: Les fichiers :file:`__init__.py` sont nécessaires pour que Python considère les dossiers comme contenant des paquets, cela évite que des dossiers ayant des noms courants comme ``string`` ne masquent des modules qui auraient été trouvés plus tard dans la recherche des dossiers. Dans le plus simple des cas, :file:`__init__.py` peut être vide, mais il peut aussi exécuter du code d'initialisation pour son paquet ou configurer la variable ``__all__`` (documentée plus loin).

source: Users of the package can import individual modules from the package, for example::
fr: Les utilisateurs d'un module peuvent importer ses modules individuellement, par exemple : ::

source: This loads the submodule :mod:`sound.effects.echo`. It must be referenced with its full name. ::
fr: charge le sous-module :mod:`sound.effects.echo`. Il doit alors être référencé par son nom complet. ::

source: An alternative way of importing the submodule is::
fr: Une autre manière d'importer des sous-modules est : ::

source: This also loads the submodule :mod:`echo`, and makes it available without its package prefix, so it can be used as follows::
fr: charge aussi le sous-module :mod:`echo` et le rend disponible sans avoir à indiquer le préfixe du paquet. Il peut donc être utilisé comme ceci : ::

source: Yet another variation is to import the desired function or variable directly::
fr: Une autre méthode consiste à importer la fonction ou la variable désirée directement : ::

source: Again, this loads the submodule :mod:`echo`, but this makes its function :func:`echofilter` directly available::
fr: Le sous-module :mod:`echo` est toujours chargé mais ici la fonction :func:`echofilter` est disponible directement : ::

source: Note that when using ``from package import item``, the item can be either a submodule (or subpackage) of the package, or some other name defined in the package, like a function, class or variable. The ``import`` statement first tests whether the item is defined in the package; if not, it assumes it is a module and attempts to load it. If it fails to find it, an :exc:`ImportError` exception is raised.
fr: Notez que lorsque vous utilisez ``from package import element``, ``element`` peut aussi bien être un sous-module, un sous-paquet ou simplement un nom déclaré dans le paquet (une variable, une fonction ou une classe). L'instruction ``import`` cherche en premier si ``element`` est défini dans le paquet ; s'il ne l'est pas, elle cherche à charger un module et, si elle n'en trouve pas, une exception :exc:`ImportError` est levée.

source: Contrarily, when using syntax like ``import item.subitem.subsubitem``, each item except for the last must be a package; the last item can be a module or a package but can't be a class or function or variable defined in the previous item.
fr: Au contraire, en utilisant la syntaxe ``import element.souselement.soussouselement``, chaque ``element`` sauf le dernier doit être un paquet. Le dernier ``element`` peut être un module ou un paquet, mais ne peut être ni une fonction, ni une classe, ni une variable définie dans l'élément précédent.

source: Importing \* From a Package
fr: Importer \* depuis un paquet

source: Now what happens when the user writes ``from sound.effects import *``? Ideally, one would hope that this somehow goes out to the filesystem, finds which submodules are present in the package, and imports them all. This could take a long time and importing sub-modules might have unwanted side-effects that should only happen when the sub-module is explicitly imported.
fr: Qu'arrive-il lorsqu'un utilisateur écrit ``from sound.effects import *`` ? Idéalement, on pourrait espérer que Python aille chercher tous les sous-modules du paquet sur le système de fichiers et qu'ils seraient tous importés. Cela pourrait être long et importer certains sous-modules pourrait avoir des effets secondaires indésirables ou, du moins, désirés seulement lorsque le sous-module est importé explicitement.

source: The only solution is for the package author to provide an explicit index of the package. The :keyword:`import` statement uses the following convention: if a package's :file:`__init__.py` code defines a list named ``__all__``, it is taken to be the list of module names that should be imported when ``from package import *`` is encountered. It is up to the package author to keep this list up-to-date when a new version of the package is released. Package authors may also decide not to support it, if they don't see a use for importing \* from their package. For example, the file :file:`sound/effects/__init__.py` could contain the following code::
fr: La seule solution, pour l'auteur du paquet, est de fournir un index explicite du contenu du paquet. L'instruction :keyword:`import` utilise la convention suivante : si le fichier :file:`__init__.py` du paquet définit une liste nommée ``__all__``, cette liste est utilisée comme liste des noms de modules devant être importés lorsque ``from package import *`` est utilisé. Il est de la responsabilité de l'auteur du paquet de maintenir cette liste à jour lorsque de nouvelles versions du paquet sont publiées. Un auteur de paquet peut aussi décider de ne pas autoriser d'importer ``*`` pour son paquet. Par exemple, le fichier :file:`sound/effects/__init__.py` peut contenir le code suivant : ::

source: This would mean that ``from sound.effects import *`` would import the three named submodules of the :mod:`sound` package.
fr: Cela signifie que ``from sound.effects import *`` importe les trois sous-modules explicitement désignés du paquet :mod:`sound`.

source: If ``__all__`` is not defined, the statement ``from sound.effects import *`` does *not* import all submodules from the package :mod:`sound.effects` into the current namespace; it only ensures that the package :mod:`sound.effects` has been imported (possibly running any initialization code in :file:`__init__.py`) and then imports whatever names are defined in the package. This includes any names defined (and submodules explicitly loaded) by :file:`__init__.py`. It also includes any submodules of the package that were explicitly loaded by previous :keyword:`import` statements. Consider this code::
fr: Si ``__all__`` n'est pas définie, l'instruction ``from sound.effects import *`` n'importe *pas* tous les sous-modules du paquet :mod:`sound.effects` dans l'espace de noms courant mais s'assure seulement que le paquet :mod:`sound.effects` a été importé (i.e. que tout le code du fichier :file:`__init__.py` a été exécuté) et importe ensuite les noms définis dans le paquet. Cela inclut tous les noms définis (et sous-modules chargés explicitement) par :file:`__init__.py`. Sont aussi inclus tous les sous-modules du paquet ayant été chargés explicitement par une instruction :keyword:`import`. Typiquement : ::

source: In this example, the :mod:`echo` and :mod:`surround` modules are imported in the current namespace because they are defined in the :mod:`sound.effects` package when the ``from...import`` statement is executed. (This also works when ``__all__`` is defined.)
fr: Dans cet exemple, les modules :mod:`echo` et :mod:`surround` sont importés dans l'espace de noms courant lorsque ``from...import`` est exécuté parce qu'ils sont définis dans le paquet :mod:`sound.effects` (cela fonctionne aussi lorsque ``__all__`` est définie).

source: Although certain modules are designed to export only names that follow certain patterns when you use ``import *``, it is still considered bad practice in production code.
fr: Bien que certains modules ont été pensés pour n'exporter que les noms respectant une certaine structure lorsque ``import *`` est utilisé, ``import *`` reste considéré comme une mauvaise pratique dans du code à destination d'un environnement de production.

source: Remember, there is nothing wrong with using ``from Package import specific_submodule``! In fact, this is the recommended notation unless the importing module needs to use submodules with the same name from different packages.
fr: Rappelez-vous que rien ne vous empêche d'utiliser ``from paquet import sous_module_specifique`` ! C'est d'ailleurs la manière recommandée, à moins que le module qui fait les imports ait besoin de sous-modules ayant le même nom mais provenant de paquets différents.

source: Intra-package References
fr: Références internes dans un paquet

source: When packages are structured into subpackages (as with the :mod:`sound` package in the example), you can use absolute imports to refer to submodules of siblings packages. For example, if the module :mod:`sound.filters.vocoder` needs to use the :mod:`echo` module in the :mod:`sound.effects` package, it can use ``from sound.effects import echo``.
fr: Lorsque les paquets sont organisés en sous-paquets (comme le paquet :mod:`sound` par exemple), vous pouvez utiliser des imports absolus pour cibler des paquets voisins. Par exemple, si le module :mod:`sound.filters.vocoder` a besoin du module :mod:`echo` du paquet :mod:`sound.effects`, il peut utiliser ``from sound.effects import echo``.

source: You can also write relative imports, with the ``from module import name`` form of import statement. These imports use leading dots to indicate the current and parent packages involved in the relative import. From the :mod:`surround` module for example, you might use::
fr: Il est aussi possible d'écrire des imports relatifs de la forme ``from module import name``. Ces imports relatifs sont préfixés par des points pour indiquer leur origine (paquet courant ou parent). Depuis le module :mod:`surround`, par exemple vous pouvez écrire : ::

source: Note that relative imports are based on the name of the current module. Since the name of the main module is always ``"__main__"``, modules intended for use as the main module of a Python application must always use absolute imports.
fr: Notez que les imports relatifs se fient au nom du module actuel. Puisque le nom du module principal est toujours ``"__main__"``, les modules utilisés par le module principal d'une application ne peuvent être importés que par des imports absolus.

source: Packages in Multiple Directories
fr: Paquets dans plusieurs dossiers

source: Packages support one more special attribute, :attr:`__path__`. This is initialized to be a list containing the name of the directory holding the package's :file:`__init__.py` before the code in that file is executed. This variable can be modified; doing so affects future searches for modules and subpackages contained in the package.
fr: Les paquets possèdent un attribut supplémentaire, :attr:`__path__`, qui est une liste initialisée avant l'exécution du fichier :file:`__init__.py`, contenant le nom de son dossier dans le système de fichiers. Cette liste peut être modifiée, altérant ainsi les futures recherches de modules et sous-paquets contenus dans le paquet.

source: While this feature is not often needed, it can be used to extend the set of modules found in a package.
fr: Bien que cette fonctionnalité ne soit que rarement utile, elle peut servir à élargir la liste des modules trouvés dans un paquet.

source: Footnotes
fr: Notes

source: In fact function definitions are also 'statements' that are 'executed'; the execution of a module-level function definition enters the function name in the module's global symbol table.
fr: En réalité, la déclaration d'une fonction est elle-même une instruction ; son exécution enregistre le nom de la fonction dans la table des symboles globaux du module.
