Repository: python/python-docs-fr
Catalog: tutorial/stdlib.po
Languages: fr

source: Brief Tour of the Standard Library
fr: Survol de la bibliothèque standard

source: Operating System Interface
fr: Interface avec le système d'exploitation

source: The :mod:`os` module provides dozens of functions for interacting with the operating system::
fr: Le module :mod:`os` propose des dizaines de fonctions pour interagir avec le système d'exploitation ::

source: Be sure to use the ``import os`` style instead of ``from os import *``. This will keep :func:`os.open` from shadowing the built-in :func:`open` function which operates much differently.
fr: Veillez bien à utiliser ``import os`` plutôt que ``from os import *``, sinon :func:`os.open` cache la primitive :func:`open` qui fonctionne différemment.

source: The built-in :func:`dir` and :func:`help` functions are useful as interactive aids for working with large modules like :mod:`os`::
fr: Les primitives :func:`dir` et :func:`help` sont des aides utiles lorsque vous travaillez en mode interactif avez des gros modules comme :mod:`os` ::

source: For daily file and directory management tasks, the :mod:`shutil` module provides a higher level interface that is easier to use::
fr: Pour la gestion des fichiers et dossiers, le module :mod:`shutil` expose une interface plus abstraite et plus facile à utiliser ::

source: File Wildcards
fr: Jokers sur les noms de fichiers

source: The :mod:`glob` module provides a function for making file lists from directory wildcard searches::
fr: Le module :mod:`glob` fournit une fonction pour construire des listes de fichiers à partir de motifs ::

source: Command Line Arguments
fr: Paramètres passés en ligne de commande

source: The :mod:`argparse` module provides a more sophisticated mechanism to process command line arguments. The following script extracts one or more filenames and an optional number of lines to be displayed::
fr: Le module :mod:`argparse` fournit un mécanisme plus sophistiqué pour traiter les arguments de la ligne de commande. Le script suivant extrait un ou plusieurs noms de fichiers et un nombre facultatif de lignes à afficher ::

source: When run at the command line with ``python top.py --lines=5 alpha.txt beta.txt``, the script sets ``args.lines`` to ``5`` and ``args.filenames`` to ``['alpha.txt', 'beta.txt']``.
fr: Lorsqu'il est exécuté avec la ligne de commande ``python top.py --lines=5 alpha.txt beta.txt``, le script définit ``args.lines`` à ``5`` et ``args.filenames`` à ``['alpha.txt', 'beta.txt']``.

source: Error Output Redirection and Program Termination
fr: Redirection de la sortie d'erreur et fin d'exécution

source: The :mod:`sys` module also has attributes for *stdin*, *stdout*, and *stderr*. The latter is useful for emitting warnings and error messages to make them visible even when *stdout* has been redirected::
fr: Le module :mod:`sys` a aussi des attributs pour *stdin*, *stdout* et *stderr*. Ce dernier est utile pour émettre des messages d'avertissement ou d'erreur qui restent visibles même si *stdout* est redirigé ::

source: The most direct way to terminate a script is to use ``sys.exit()``.
fr: Le moyen le plus direct de terminer un script est d'utiliser ``sys.exit()``.

source: String Pattern Matching
fr: Recherche de motifs dans les chaînes

source: The :mod:`re` module provides regular expression tools for advanced string processing. For complex matching and manipulation, regular expressions offer succinct, optimized solutions::
fr: Le module :mod:`re` fournit des outils basés sur les expressions rationnelles permettant des opérations complexes sur les chaînes. C'est une solution optimisée, utilisant une syntaxe concise, pour rechercher des motifs complexes ou effectuer des remplacements complexes dans les chaînes ::

source: When only simple capabilities are needed, string methods are preferred because they are easier to read and debug::
fr: Lorsque les opérations sont simples, il est préférable d'utiliser les méthodes des chaînes. Elles sont plus lisibles et plus faciles à déboguer ::

source: Mathematics
fr: Mathématiques

source: The :mod:`random` module provides tools for making random selections::
fr: Le module :mod:`random` offre des outils pour faire des tirages aléatoires ::

source: The :mod:`statistics` module calculates basic statistical properties (the mean, median, variance, etc.) of numeric data::
fr: Le module :mod:`statistics` permet de calculer des valeurs statistiques basiques (moyenne, médiane, variance…) ::

source: The SciPy project <https://scipy.org> has many other modules for numerical computations.
fr: Le projet SciPy <https://scipy.org> contient beaucoup d'autres modules dédiés aux calculs numériques.

source: Internet Access
fr: Accès à internet

source: There are a number of modules for accessing the internet and processing internet protocols. Two of the simplest are :mod:`urllib.request` for retrieving data from URLs and :mod:`smtplib` for sending mail::
fr: Il existe beaucoup de modules permettant d'accéder à internet et gérer les protocoles réseaux. Les deux plus simples sont :mod:`urllib.request` qui permet de récupérer des données à partir d'une URL et :mod:`smtplib` pour envoyer des courriers électroniques ::

source: (Note that the second example needs a mailserver running on localhost.)
fr: (Notez que le deuxième exemple a besoin d'un serveur mail tournant localement.)

source: Dates and Times
fr: Dates et heures

source: The :mod:`datetime` module supplies classes for manipulating dates and times in both simple and complex ways. While date and time arithmetic is supported, the focus of the implementation is on efficient member extraction for output formatting and manipulation. The module also supports objects that are timezone aware. ::
fr: Le module :mod:`datetime` propose des classes pour manipuler les dates et les heures de manière simple ou plus complexe. Bien que faire des calculs de dates et d'heures soit possible, la priorité de l'implémentation est mise sur l'extraction efficace des attributs pour le formatage et la manipulation. Le module gère aussi les objets dépendant des fuseaux horaires ::

source: Data Compression
fr: Compression de données

source: Common data archiving and compression formats are directly supported by modules including: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` and :mod:`tarfile`. ::
fr: Les formats d'archivage et de compression les plus communs sont directement gérés par les modules :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` et :mod:`tarfile` ::

source: Performance Measurement
fr: Mesure des performances

source: Some Python users develop a deep interest in knowing the relative performance of different approaches to the same problem. Python provides a measurement tool that answers those questions immediately.
fr: Certains utilisateurs de Python sont très intéressés par les performances de différentes approches d'un même problème. Python propose un outil de mesure répondant simplement à ces questions.

source: For example, it may be tempting to use the tuple packing and unpacking feature instead of the traditional approach to swapping arguments. The :mod:`timeit` module quickly demonstrates a modest performance advantage::
fr: Par exemple, pour échanger deux variables, il peut être tentant d'utiliser l'empaquetage et le dépaquetage de *n*-uplets plutôt que la méthode traditionnelle. Le module :mod:`timeit` montre rapidement le léger gain de performance obtenu ::

source: In contrast to :mod:`timeit`'s fine level of granularity, the :mod:`profile` and :mod:`pstats` modules provide tools for identifying time critical sections in larger blocks of code.
fr: En opposition à :mod:`timeit` et sa granularité fine, :mod:`profile` et :mod:`pstats` fournissent des outils permettant d'identifier les parties les plus gourmandes en temps d'exécution dans des volumes de code plus grands.

source: Quality Control
fr: Contrôle qualité

source: One approach for developing high quality software is to write tests for each function as it is developed and to run those tests frequently during the development process.
fr: Une approche possible pour développer des applications de très bonne qualité est d'écrire des tests pour chaque fonction au fur et à mesure de son développement, puis d'exécuter ces tests fréquemment lors du processus de développement.

source: The :mod:`doctest` module provides a tool for scanning a module and validating tests embedded in a program's docstrings. Test construction is as simple as cutting-and-pasting a typical call along with its results into the docstring. This improves the documentation by providing the user with an example and it allows the doctest module to make sure the code remains true to the documentation::
fr: Le module :mod:`doctest` cherche des tests dans les chaînes de documentation. Un test ressemble à un simple copier-coller d'un appel et son résultat depuis le mode interactif. Cela améliore la documentation en fournissant des exemples tout en prouvant qu'ils sont justes ::

source: The :mod:`unittest` module is not as effortless as the :mod:`doctest` module, but it allows a more comprehensive set of tests to be maintained in a separate file::
fr: Le module :mod:`unittest` requiert plus d'efforts que le module :mod:`doctest` mais il permet de construire un jeu de tests plus complet que l'on fait évoluer dans un fichier séparé ::

source: Batteries Included
fr: Piles fournies

source: Python has a "batteries included" philosophy. This is best seen through the sophisticated and robust capabilities of its larger packages. For example:
fr: Python adopte le principe des "piles fournies". Vous pouvez le constater au travers des fonctionnalités évoluées et solides fournies par ses plus gros paquets. Par exemple :

source: The :mod:`xmlrpc.client` and :mod:`xmlrpc.server` modules make implementing remote procedure calls into an almost trivial task. Despite the modules' names, no direct knowledge or handling of XML is needed.
fr: Les modules :mod:`xmlrpc.client` et :mod:`xmlrpc.server` permettent d'appeler des fonctions à distance quasiment sans effort. En dépit du nom des modules, aucune connaissance du XML n'est nécessaire.

source: The :mod:`email` package is a library for managing email messages, including MIME and other :rfc:`2822`-based message documents. Unlike :mod:`smtplib` and :mod:`poplib` which actually send and receive messages, the email package has a complete toolset for building or decoding complex message structures (including attachments) and for implementing internet encoding and header protocols.
fr: Le paquet :mod:`email` est une bibliothèque pour gérer les messages électroniques, incluant les MIME et autres encodages basés sur la :rfc:`2822`. Contrairement à :mod:`smtplib` et :mod:`poplib` qui envoient et reçoivent des messages, le paquet *email* est une boite à outils pour construire, lire des structures de messages complexes (comprenant des pièces jointes) ou implémenter des encodages et protocoles.

source: The :mod:`json` package provides robust support for parsing this popular data interchange format. The :mod:`csv` module supports direct reading and writing of files in Comma-Separated Value format, commonly supported by databases and spreadsheets. XML processing is supported by the :mod:`xml.etree.ElementTree`, :mod:`xml.dom` and :mod:`xml.sax` packages. Together, these modules and packages greatly simplify data interchange between Python applications and other tools.
fr: Le paquet :mod:`json` permet de lire et d'écrire du JSON, format d'encodage de données répandu. Le module :mod:`csv` gère la lecture et l'écriture de données stockées sous forme de valeurs séparées par des virgules dans des fichiers (*Comma-Separated Values* en anglais), format typiquement interopérable avec les bases de données et les feuilles de calculs. Pour la lecture du XML, utilisez les paquets :mod:`xml.etree.ElementTree`, :mod:`xml.dom` et :mod:`xml.sax`. Combinés, ces modules et paquets simplifient grandement l'échange de données entre les applications Python et les autres outils.

source: The :mod:`sqlite3` module is a wrapper for the SQLite database library, providing a persistent database that can be updated and accessed using slightly nonstandard SQL syntax.
fr: Le module :mod:`sqlite3` est une abstraction de la bibliothèque SQLite, permettant de manipuler une base de données persistante, accédée et manipulée en utilisant une syntaxe SQL quasi standard.

source: Internationalization is supported by a number of modules including :mod:`gettext`, :mod:`locale`, and the :mod:`codecs` package.
fr: L'internationalisation est possible grâce à de nombreux paquets tels que :mod:`gettext`, :mod:`locale` ou :mod:`codecs`.

source: built-in function
fr: fonction native

source: help
fr: aide
