Repository: python/python-docs-fr
Catalog: tutorial/venv.po
Languages: fr

source: Virtual Environments and Packages
fr: Environnements virtuels et paquets

source: Python applications will often use packages and modules that don't come as part of the standard library. Applications will sometimes need a specific version of a library, because the application may require that a particular bug has been fixed or the application may be written using an obsolete version of the library's interface.
fr: Les programmes Python utilisent souvent des paquets et modules qui ne font pas partie de la bibliothèque standard. Ils nécessitent aussi, parfois, une version spécifique d'une bibliothèque, par exemple parce qu'un certain bug a été corrigé ou encore que le programme a été implémenté en utilisant une version obsolète de l'interface de cette bibliothèque.

source: This means it may not be possible for one Python installation to meet the requirements of every application. If application A needs version 1.0 of a particular module but application B needs version 2.0, then the requirements are in conflict and installing either version 1.0 or 2.0 will leave one application unable to run.
fr: Cela signifie qu'il n'est pas toujours possible, pour une installation unique de Python, de couvrir tous les besoins de toutes les applications. Basiquement, si une application A dépend de la version 1.0 d'un module et qu'une application B dépend de la version 2.0, ces dépendances entrent en conflit et installer la version 1.0 ou 2.0 laisse une des deux applications incapable de fonctionner.

source: The solution for this problem is to create a :term:`virtual environment`, a self-contained directory tree that contains a Python installation for a particular version of Python, plus a number of additional packages.
fr: La solution est de créer un :term:`environnement virtuel`, un dossier auto-suffisant qui contient une installation de Python pour une version particulière de Python ainsi que des paquets additionnels.

source: Different applications can then use different virtual environments. To resolve the earlier example of conflicting requirements, application A can have its own virtual environment with version 1.0 installed while application B has another virtual environment with version 2.0. If application B requires a library be upgraded to version 3.0, this will not affect application A's environment.
fr: Différentes applications peuvent alors utiliser des environnements virtuels différents. Pour résoudre l'exemple précédent où il existe un conflit de dépendances, l'application A a son environnement virtuel avec la version 1.0 installée pendant que l'application B a un autre environnement virtuel avec la version 2.0. Si l'application B requiert que la bibliothèque soit mise à jour à la version 3.0, cela n'affecte pas l'environnement de A.

source: Creating Virtual Environments
fr: Création d'environnements virtuels

source: The module used to create and manage virtual environments is called :mod:`venv`. :mod:`venv` will usually install the most recent version of Python that you have available. If you have multiple versions of Python on your system, you can select a specific Python version by running ``python3`` or whichever version you want.
fr: Le module utilisé pour créer et gérer des environnements virtuels s'appelle :mod:`venv`. :mod:`venv` installe en général la version de Python la plus récente dont vous disposez. Si plusieurs versions de Python sont sur votre système, vous pouvez choisir une version particulière en exécutant ``python3.X`` où X indique la version de votre choix.

source: To create a virtual environment, decide upon a directory where you want to place it, and run the :mod:`venv` module as a script with the directory path::
fr: Pour créer un environnement virtuel, décidez d'un dossier où vous voulez le placer et exécutez le module :mod:`venv` comme un script avec le chemin du dossier ::

source: This will create the ``tutorial-env`` directory if it doesn't exist, and also create directories inside it containing a copy of the Python interpreter, the standard library, and various supporting files.
fr: Cela crée le dossier ``tutorial-env`` (s'il n'existe pas) et des sous-dossiers contenant une copie de l'interpréteur Python, de la bibliothèque standard et quelques autres fichiers utiles.

source: A common directory location for a virtual environment is ``.venv``. This name keeps the directory typically hidden in your shell and thus out of the way while giving it a name that explains why the directory exists. It also prevents clashing with ``.env`` environment variable definition files that some tooling supports.
fr: Un répertoire habituel pour un environnement virtuel est ``.venv``. Ce nom fait que le répertoire est généralement caché dans votre explorateur de fichiers, et donc non gênant, tout en lui donnant un nom qui explique pourquoi le répertoire existe. Il empêche également de rentrer en conflit avec les fichiers de définition de variable d'environnement ``.env`` que certains outils utilisent.

source: Once you've created a virtual environment, you may activate it.
fr: Une fois l'environnement virtuel créé, vous pouvez l'activer.

source: On Windows, run::
fr: Sur Windows, lancez ::

source: On Unix or MacOS, run::
fr: Sur Unix et MacOS, lancez ::

source: (This script is written for the bash shell. If you use the :program:`csh` or :program:`fish` shells, there are alternate ``activate.csh`` and ``activate.fish`` scripts you should use instead.)
fr: (Ce script est écrit pour le shell :program:`bash`. Si vous utilisez :program:`csh` ou :program:`fish`, utilisez les variantes ``activate.csh`` ou ``activate.fish``.)

source: Activating the virtual environment will change your shell's prompt to show what virtual environment you're using, and modify the environment so that running ``python`` will get you that particular version and installation of Python. For example:
fr: Activer l'environnement virtuel change le prompt de votre ligne de commande pour afficher le nom de l'environnement virtuel que vous utilisez. Cela modifie aussi l'environnement afin, lorsque vous tapez ``python``, d'exécuter la version spécifique de Python installée dans l'environnement. Par exemple ::

source: Managing Packages with pip
fr: Gestion des paquets avec *pip*

source: You can install, upgrade, and remove packages using a program called :program:`pip`. By default ``pip`` will install packages from the Python Package Index, <https://pypi.org>. You can browse the Python Package Index by going to it in your web browser, or you can use ``pip``'s limited search feature:
fr: Vous pouvez installer, mettre à jour et supprimer des paquets en utilisant un programme appelé :program:`pip`. Par défaut, ``pip`` installe les paquets du Python Package Index, <https://pypi.org>. Vous pouvez parcourir le Python Package Index avec un navigateur ou utiliser la fonction de recherche (assez) limitée de ``pip`` ::

source: ``pip`` has a number of subcommands: "search", "install", "uninstall", "freeze", etc. (Consult the :ref:`installing-index` guide for complete documentation for ``pip``.)
fr: ``pip`` a plusieurs sous-commandes : ``search``, ``install``, ``uninstall``, ``freeze``, etc. Consultez le guide :ref:`installing-index` pour une documentation exhaustive sur ``pip``.

source: You can install the latest version of a package by specifying a package's name:
fr: Vous pouvez installer la dernière version d'un paquet en indiquant son nom ::

source: You can also install a specific version of a package by giving the package name followed by ``==`` and the version number:
fr: Vous pouvez installer une version spécifique d'un paquet en donnant le nom du paquet suivi de ``==`` et du numéro de version souhaitée ::

source: If you re-run this command, ``pip`` will notice that the requested version is already installed and do nothing. You can supply a different version number to get that version, or you can run ``pip install --upgrade`` to upgrade the package to the latest version:
fr: Si vous relancez cette commande, ``pip`` remarque que la version demandée est déjà installée et ne fait rien. Vous pouvez fournir un numéro de version différent pour récupérer cette version ou lancer ``pip install --upgrade`` pour mettre à jour le paquet à la dernière version ::

source: ``pip uninstall`` followed by one or more package names will remove the packages from the virtual environment.
fr: ``pip uninstall`` suivi d'un ou plusieurs noms de paquets les supprime de votre environnement virtuel.

source: ``pip show`` will display information about a particular package:
fr: ``pip show`` affiche des informations à propos d'un paquet précis :

source: ``pip list`` will display all of the packages installed in the virtual environment:
fr: ``pip list`` liste tous les paquets installés dans l'environnement virtuel ::

source: ``pip freeze`` will produce a similar list of the installed packages, but the output uses the format that ``pip install`` expects. A common convention is to put this list in a ``requirements.txt`` file:
fr: ``pip freeze`` produit une liste similaire des paquets installés mais l'affichage adopte un format que ``pip install`` peut lire. La convention habituelle est de mettre cette liste dans un fichier ``requirements.txt`` :

source: The ``requirements.txt`` can then be committed to version control and shipped as part of an application. Users can then install all the necessary packages with ``install -r``:
fr: Le fichier ``requirements.txt`` peut alors être ajouté dans un système de gestion de versions comme faisant partie de votre application. Les utilisateurs peuvent alors installer tous les paquets nécessaires à l'application avec ``install -r`` :

source: ``pip`` has many more options. Consult the :ref:`installing-index` guide for complete documentation for ``pip``. When you've written a package and want to make it available on the Python Package Index, consult the :ref:`distributing-index` guide.
fr: ``pip`` reconnait beaucoup d'autres options, documentées dans le guide :ref:`installing-index`. Lorsque vous avez écrit un paquet, si vous voulez le rendre disponible sur PyPI, lisez le guide :ref:`distributing-index`.
