Repository: python/python-docs-fr
Catalog: tutorial/whatnow.po
Languages: fr

source: What Now?
fr: Pour aller plus loin

source: Reading this tutorial has probably reinforced your interest in using Python --- you should be eager to apply Python to solving your real-world problems. Where should you go to learn more?
fr: La lecture de ce tutoriel a probablement renforcé votre intérêt pour Python et vous devez être impatient de l'utiliser pour résoudre des vrais problèmes. Où aller pour en apprendre plus ?

source: This tutorial is part of Python's documentation set. Some other documents in the set are:
fr: Ce tutoriel fait partie de la documentation de Python, et la documentation de Python est vaste ::

source: You should browse through this manual, which gives complete (though terse) reference material about types, functions, and the modules in the standard library. The standard Python distribution includes a *lot* of additional code. There are modules to read Unix mailboxes, retrieve documents via HTTP, generate random numbers, parse command-line options, write CGI programs, compress data, and many other tasks. Skimming through the Library Reference will give you an idea of what's available.
fr: Nous vous conseillons de naviguer dans le manuel, c'est une référence complète (quoique laconique) sur les types, fonctions et modules de la bibliothèque standard. La distribution standard de Python inclut *énormément* de code supplémentaire. Il existe des modules pour lire les courriels, récupérer des documents *via* HTTP, générer des nombres aléatoires, analyser les paramètres de la ligne de commande, écrire des programmes CGI, compresser des données et beaucoup d'autres fonctions. Une balade dans la documentation de la bibliothèque vous donnera une idée de ce qui est disponible.

source: :ref:`installing-index` explains how to install additional modules written by other Python users.
fr: :ref:`installing-index` explique comment installer des paquets écrits par d'autres utilisateurs de Python.

source: :ref:`reference-index`: A detailed explanation of Python's syntax and semantics. It's heavy reading, but is useful as a complete guide to the language itself.
fr: :ref:`reference-index` contient une explication détaillée de la syntaxe et sémantique de Python. C'est une lecture fastidieuse, mais elle a sa place dans une documentation exhaustive.

source: More Python resources:
fr: D'autres ressources :

source: https://www.python.org: The major Python Web site. It contains code, documentation, and pointers to Python-related pages around the Web. This Web site is mirrored in various places around the world, such as Europe, Japan, and Australia; a mirror may be faster than the main site, depending on your geographical location.
fr: https://www.python.org est le site principal pour Python. Il contient du code, de la documentation, des liens vers d'autres sites traitant de Python partout sur Internet. Il est répliqué dans différents endroits autour du globe, comme en Europe, au Japon et en Australie. Ces répliques peuvent dans certains cas être plus rapides que le site principal, en fonction de l'endroit où vous vous trouvez.

source: https://docs.python.org: Fast access to Python's documentation.
fr: https://docs.python.org/fr/ offre un accès rapide à la documentation de Python en français.

source: https://pypi.org: The Python Package Index, previously also nicknamed the Cheese Shop [#]_, is an index of user-created Python modules that are available for download. Once you begin releasing code, you can register it here so that others can find it.
fr: https://pypi.org (*The Python Package Index* en anglais, pour le "répertoire des paquets Python") : auparavant surnommé "La Fromagerie" [#]_ (*The Cheese Shop* en anglais), c'est un catalogue de modules Python disponibles au téléchargement, construit par les utilisateurs. Lorsque vous commencez à distribuer du code, vous pouvez l'inscrire ici afin que les autres puissent le trouver.

source: https://code.activestate.com/recipes/langs/python/: The Python Cookbook is a sizable collection of code examples, larger modules, and useful scripts. Particularly notable contributions are collected in a book also titled Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)
fr: https://code.activestate.com/recipes/langs/python/ : "The Python Cookbook" est un recueil assez imposant d'exemples de code, de modules et de scripts. Les contributions les plus remarquables y sont regroupées dans le livre "Python Cookbook" (O'Reilly & Associates, ISBN 0-596-00797-3).

source: http://www.pyvideo.org collects links to Python-related videos from conferences and user-group meetings.
fr: http://www.pyvideo.org regroupe des liens vers des vidéos relatives à Python, enregistrées lors de conférences ou de réunions de groupes d'utilisateurs.

source: https://scipy.org: The Scientific Python project includes modules for fast array computations and manipulations plus a host of packages for such things as linear algebra, Fourier transforms, non-linear solvers, random number distributions, statistical analysis and the like.
fr: https://scipy.org : le projet "The Scientific Python" contient des modules pour manipuler et calculer rapidement sur des tableaux. Le projet héberge aussi divers paquets sur l'algèbre linéaire, les transformées de Fourier, des résolveurs non-linéaires, différentes distributions de nombres aléatoires, l'analyse statistique et d'autres choses du domaine scientifique.

source: For Python-related questions and problem reports, you can post to the newsgroup :newsgroup:`comp.lang.python`, or send them to the mailing list at python-list@python.org. The newsgroup and mailing list are gatewayed, so messages posted to one will automatically be forwarded to the other. There are hundreds of postings a day, asking (and answering) questions, suggesting new features, and announcing new modules. Mailing list archives are available at https://mail.python.org/pipermail/.
fr: Pour poser des questions ou remonter des problèmes liés à Python, vous pouvez écrire sur le forum :newsgroup:`comp.lang.python` ou les envoyer à la liste de diffusion <python-list@python.org>. Le forum et la liste de diffusion sont liées, un message publié sur l'un sera automatiquement transféré sur l'autre. Des centaines de messages y sont publiés chaque jour, posant (ou répondant à) des questions, suggérant de nouvelles fonctionnalités et annonçant des nouveaux modules. Les archives sont disponibles à https://mail.python.org/pipermail/.

source: Before posting, be sure to check the list of :ref:`Frequently Asked Questions <faq-index>` (also called the FAQ). The FAQ answers many of the questions that come up again and again, and may already contain the solution for your problem.
fr: Avant de publier un message, assurez-vous d'avoir lu la liste de la :ref:`Foire Aux Questions <faq-index>` (aussi appelée FAQ). La FAQ répond à beaucoup de questions fréquentes et contient probablement une solution à votre problème.

source: Footnotes
fr: Notes

source: "Cheese Shop" is a Monty Python's sketch: a customer enters a cheese shop, but whatever cheese he asks for, the clerk says it's missing.
fr: « Cheese Shop » est un sketch de Monty Python : un client entre dans une fromagerie, mais peu importe le fromage que demande le client, le vendeur dit qu’il n’en a pas.
