Repository: python/python-docs-fr
Catalog: about.po
Languages: fr

source: About these documents
fr: À propos de ces documents

source: These documents are generated from `reStructuredText`_ sources by `Sphinx`_, a document processor specifically written for the Python documentation.
fr: Ces documents sont générés à partir de sources en `reStructuredText`_ par `Sphinx`_, un analyseur de documents spécialement conçu pour la documentation Python.

source: Development of the documentation and its toolchain is an entirely volunteer effort, just like Python itself. If you want to contribute, please take a look at the :ref:`reporting-bugs` page for information on how to do so. New volunteers are always welcome!
fr: Le développement de la documentation et de ses outils est entièrement basé sur le volontariat, tout comme Python. Si vous voulez contribuer, allez voir la page :ref:`reporting-bugs` qui contient des informations pour vous y aider. Les nouveaux volontaires sont toujours les bienvenus !

source: Many thanks go to:
fr: Merci beaucoup à :

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and writer of much of the content;
fr: Fred L. Drake, Jr., créateur des outils originaux de la documentation Python et rédacteur de la plupart de son contenu ;

source: the `Docutils <http://docutils.sourceforge.net/>`_ project for creating reStructuredText and the Docutils suite;
fr: le projet `Docutils <http://docutils.sourceforge.net/>`_ pour avoir créé *reStructuredText* et la suite d'outils *Docutils* ;

source: Fredrik Lundh for his `Alternative Python Reference <http://effbot.org/zone/pyref.htm>`_ project from which Sphinx got many good ideas.
fr: Fredrik Lundh pour son projet `Alternative Python Reference <http://effbot.org/zone/pyref.htm>`_, dont Sphinx a pris beaucoup de bonnes idées.

source: Contributors to the Python Documentation
fr: Contributeurs de la documentation Python

source: Many people have contributed to the Python language, the Python standard library, and the Python documentation. See :source:`Misc/ACKS` in the Python source distribution for a partial list of contributors.
fr: De nombreuses personnes ont contribué au langage Python, à sa bibliothèque standard et à sa documentation. Consultez :source:`Misc/ACKS` dans les sources de la distribution Python pour avoir une liste partielle des contributeurs.

source: It is only with the input and contributions of the Python community that Python has such wonderful documentation -- Thank You!
fr: Ce n'est que grâce aux suggestions et contributions de la communauté Python que Python a une documentation si merveilleuse — Merci !
