Repository: python/python-docs-fr
Catalog: bugs.po
Languages: fr

source: Dealing with Bugs
fr: S'attaquer aux bogues

source: Python is a mature programming language which has established a reputation for stability. In order to maintain this reputation, the developers would like to know of any deficiencies you find in Python.
fr: Python est un langage de programmation robuste réputé pour sa stabilité. Afin de maintenir cette réputation, les développeurs souhaitent connaître tout problème que vous pourriez rencontrer dans Python.

source: It can be sometimes faster to fix bugs yourself and contribute patches to Python as it streamlines the process and involves less people. Learn how to :ref:`contribute <contributing-to-python>`.
fr: Il est parfois plus rapide de réparer les bogues soi-même et d'en proposer les correctifs, ça simplifie le processus et implique moins de monde. Apprenez à :ref:`contribuer <contributing-to-python>`.

source: Documentation bugs
fr: Bogues de documentation

source: If you find a bug in this documentation or would like to propose an improvement, please submit a bug report on the :ref:`tracker <using-the-tracker>`. If you have a suggestion on how to fix it, include that as well.
fr: Si vous trouvez un bogue dans cette documentation ou si vous désirez proposer une amélioration, si cela concerne aussi la documentation en anglais, ouvrez un rapport sur le :ref:`traqueur <using-the-tracker>` décrivant en anglais le bogue et où vous l'avez trouvé. Si le problème ne touche que la traduction en français, ouvrez un ticket sur https://git.afpy.org/AFPy/python-docs-fr/issues, ou venez nous en toucher un mot sur le canal #python-fr sur *libera.chat* (https://kiwiirc.com/nextclient/#irc://irc.libera.chat/#python-fr). Si vous avez une suggestion de correction, merci de l'inclure également.

source: If you're short on time, you can also email documentation bug reports to docs@python.org (behavioral bugs can be sent to python-list@python.org). 'docs@' is a mailing list run by volunteers; your request will be noticed, though it may take a while to be processed.
fr: Si vous êtes limité par le temps, vous pouvez aussi envoyer un courriel à docs@python.org (les bogues de comportement peuvent être envoyés à python-list@python.org). « docs@ » est une liste de diffusion gérée par des volontaires, votre requête sera vue, mais elle peut prendre un moment pour être traitée.

source: `Documentation bugs`_
fr: `Bogues de documentation`_

source: A list of documentation bugs that have been submitted to the Python issue tracker.
fr: Liste des bogues de documentation soumis à l'outil de suivi des problèmes Python.

source: `Issue Tracking <https://devguide.python.org/tracker/>`_
fr: `Outil de suivi des problèmes <https://devguide.python.org/tracker/>`_

source: Overview of the process involved in reporting an improvement on the tracker.
fr: Vue d'ensemble du processus pour proposer une amélioration avec l'outil de suivi.

source: `Helping with Documentation <https://devguide.python.org/docquality/#helping-with-documentation>`_
fr: `Aider avec la documentation <https://devguide.python.org/docquality/#helping-with-documentation>`_

source: Comprehensive guide for individuals that are interested in contributing to Python documentation.
fr: Guide complet pour qui souhaite contribuer à la documentation Python.

source: `Documentation Translations <https://devguide.python.org/documenting/#translating>`_
fr: `Aider avec la documentation <https://devguide.python.org/documenting/#translating>`_

source: A list of GitHub pages for documentation translation and their primary contacts.
fr: Liste de dépôts GitHub où la documentation est traduite, avec les personnes à contacter.

source: Using the Python issue tracker
fr: Utilisation du gestionnaire de tickets Python

source: Issue reports for Python itself should be submitted via the GitHub issues tracker (https://github.com/python/cpython/issues). The GitHub issues tracker offers a web form which allows pertinent information to be entered and submitted to the developers.
fr: Les rapports concernant un problème relatif à Python lui-même doivent être soumis *via* l'outil de suivi des problèmes de GitHub (https://github.com/python/cpython/issues). Le gestionnaire de tickets propose un formulaire Web permettant de saisir des informations pertinentes à soumettre aux développeurs.

source: The first step in filing a report is to determine whether the problem has already been reported. The advantage in doing so, aside from saving the developers' time, is that you learn what has been done to fix it; it may be that the problem has already been fixed for the next release, or additional information is needed (in which case you are welcome to provide it if you can!). To do this, search the tracker using the search box at the top of the page.
fr: La première étape pour remplir un rapport est de déterminer si le problème a déjà été rapporté. L'avantage de cette approche, en plus d'économiser du temps aux développeurs, est d'apprendre ce qui a été fait pour le résoudre ; il se peut que le problème soit déjà résolu dans la prochaine version, ou que des informations complémentaires soient attendues (auquel cas votre contribution est la bienvenue !). Pour ce faire, cherchez dans le gestionnaire de tickets grâce à la boîte de recherche en haut de la page.

source: If the problem you're reporting is not already in the list, log in to GitHub. If you don't already have a GitHub account, create a new account using the "Sign up" link. It is not possible to submit a bug report anonymously.
fr: Si le problème que vous soumettez n'est pas déjà dans la liste, connectez-vous à GitHub. Si vous n'avez pas déjà un compte GitHub, créez un nouveau compte en cliquant sur le lien « Sign Up ». Il n'est pas possible de soumettre un rapport de bogue de manière anonyme.

source: Being now logged in, you can submit an issue. Click on the "New issue" button in the top bar to report a new issue.
fr: Une fois connecté, vous pouvez rapporter un problème. Sélectionnez le bouton *New issue* dans la barre en haut pour ouvrir un nouveau formulaire de rapport.

source: The submission form has two fields, "Title" and "Comment".
fr: Le formulaire de rapport contient deux champs, *Title* et *Comment*.

source: In the "Comment" field, describe the problem in detail, including what you expected to happen and what did happen. Be sure to include whether any extension modules were involved, and what hardware and software platform you were using (including version information as appropriate).
fr: Dans le champ « Commentaire », décrivez le problème de manière détaillée, incluant ce à quoi vous vous attendiez et ce qui s'est vraiment produit. Assurez-vous d'y inclure les éventuels modules d'extensions impliqués et la plateforme matérielle et logicielle vous utilisiez (en incluant les informations de versions).

source: Each issue report will be reviewed by a developer who will determine what needs to be done to correct the problem. You will receive an update each time an action is taken on the issue.
fr: Chaque rapport sera attribué à un développeur qui déterminera ce qui est nécessaire d'entreprendre pour corriger le problème. Vous recevrez une notification à chaque action concernant le rapport.

source: `How to Report Bugs Effectively <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
fr: `Comment signaler des bogues de manière efficace <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_ (en anglais)

source: Article which goes into some detail about how to create a useful bug report. This describes what kind of information is useful and why it is useful.
fr: Article qui entre dans les détails sur la manière de créer un rapport de bogue utile. Il décrit quel genre d'information est utile et pourquoi elle est utile.

source: `Bug Writing Guidelines <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_
fr: `Guide pour la rédaction de rapports de bogues <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_

source: Information about writing a good bug report. Some of this is specific to the Mozilla project, but describes general good practices.
fr: Conseils pour écrire un bon rapport de bogue. Certains sont spécifiques au projet Mozilla mais présentent des bonnes pratiques générales.

source: Getting started contributing to Python yourself
fr: Commencer à contribuer à Python vous-même

source: Beyond just reporting bugs that you find, you are also welcome to submit patches to fix them. You can find more information on how to get started patching Python in the `Python Developer's Guide`_. If you have questions, the `core-mentorship mailing list`_ is a friendly place to get answers to any and all questions pertaining to the process of fixing issues in Python.
fr: Au-delà de simplement remonter les bogues que vous trouvez, il est aussi apprécié d'y attacher des correctifs. Vous pouvez trouver plus d'informations pour débuter la rédaction de correctifs dans le `Python Developer's Guide`_. Si vous avez des questions, le `core-mentorship mailing list`_ est un endroit amical pour obtenir des réponses à toutes les questions à propos du processus de corrections de bugs dans Python.
