Repository: python/python-docs-fr
Catalog: glossary.po
Languages: fr

source: A named entity in a :term:`function` (or method) definition that specifies an :term:`argument` (or in some cases, arguments) that the function can accept. There are five kinds of parameter:
fr: Entité nommée dans la définition d'une :term:`fonction` (ou méthode), décrivant un :term:`argument` (ou dans certains cas des arguments) que la fonction accepte. Il existe cinq sortes de paramètres :

source: :dfn:`positional-or-keyword`: specifies an argument that can be passed either :term:`positionally <argument>` or as a :term:`keyword argument <argument>`. This is the default kind of parameter, for example *foo* and *bar* in the following::
fr: :dfn:`positional-or-keyword`: l'argument peut être passé soit par sa :term:`position <argument>`, soit en tant que :term:`argument nommé <argument>`. C'est le type de paramètre par défaut. Par exemple, *foo* et *bar* dans l'exemple suivant : ::

source: :dfn:`positional-only`: specifies an argument that can be supplied only by position. Python has no syntax for defining positional-only parameters. However, some built-in functions have positional-only parameters (e.g. :func:`abs`).
fr: :dfn:`positional-only`: l'argument ne peut être donné que par sa position. Python n'a pas de syntaxe pour déclarer de tels paramètres, cependant des fonctions natives, comme :func:`abs`, en utilisent.

source: :dfn:`keyword-only`: specifies an argument that can be supplied only by keyword. Keyword-only parameters can be defined by including a single var-positional parameter or bare ``*`` in the parameter list of the function definition before them, for example *kw_only1* and *kw_only2* in the following::
fr: :dfn:`keyword-only`: l'argument ne peut être fourni que nommé. Les paramètres *keyword-only* peuvent être définis en utilisant un seul paramètre *var-positional*, ou en ajoutant une étoile (``*``) seule dans la liste des paramètres avant eux. Par exemple, *kw_only1* et *kw_only2* dans le code suivant : ::

source: :dfn:`var-positional`: specifies that an arbitrary sequence of positional arguments can be provided (in addition to any positional arguments already accepted by other parameters). Such a parameter can be defined by prepending the parameter name with ``*``, for example *args* in the following::
fr: :dfn:`var-positional`: une séquence d'arguments positionnels peut être fournie (en plus de tous les arguments positionnels déjà acceptés par d'autres paramètres). Un tel paramètre peut être défini en préfixant son nom par une ``*``. Par exemple *args* ci-après : ::

source: :dfn:`var-keyword`: specifies that arbitrarily many keyword arguments can be provided (in addition to any keyword arguments already accepted by other parameters). Such a parameter can be defined by prepending the parameter name with ``**``, for example *kwargs* in the example above.
fr: :dfn:`var-keyword`: une quantité arbitraire d'arguments peut être passée, chacun étant nommé (en plus de tous les arguments nommés déjà acceptés par d'autres paramètres). Un tel paramètre est défini en préfixant le nom du paramètre par ``**``. Par exemple, *kwargs* ci-dessus.

source: Parameters can specify both optional and required arguments, as well as default values for some optional arguments.
fr: Les paramètres peuvent spécifier des arguments obligatoires ou optionnels, ainsi que des valeurs par défaut pour les arguments optionnels.

source: See also the :term:`argument` glossary entry, the FAQ question on :ref:`the difference between arguments and parameters <faq-argument-vs-parameter>`, the :class:`inspect.Parameter` class, the :ref:`function` section, and :pep:`362`.
fr: Voir aussi :term:`argument` dans le glossaire, la question sur :ref:`la différence entre les arguments et les paramètres <faq-argument-vs-parameter>` dans la FAQ, la classe :class:`inspect.Parameter`, la section :ref:`function` et la :pep:`362`.

source: path entry
fr: entrée de chemin

source: A single location on the :term:`import path` which the :term:`path based finder` consults to find modules for importing.
fr: Emplacement dans le :term:`chemin des imports <import path>` (*import path* en anglais, d'où le *path*) que le :term:`chercheur basé sur les chemins <path based finder>` consulte pour trouver des modules à importer.

source: path entry finder
fr: chercheur de chemins

source: A :term:`finder` returned by a callable on :data:`sys.path_hooks` (i.e. a :term:`path entry hook`) which knows how to locate modules given a :term:`path entry`.
fr: :term:`chercheur <finder>` renvoyé par un appelable sur un :data:`sys.path_hooks` (c'est-à-dire un :term:`point d'entrée pour la recherche dans path <path entry hook>`) qui sait où trouver des modules lorsqu'on lui donne une :term:`entrée de path <path entry>`.

source: See :class:`importlib.abc.PathEntryFinder` for the methods that path entry finders implement.
fr: Voir :class:`importlib.abc.PathEntryFinder` pour les méthodes qu'un chercheur d'entrée dans *path* doit implémenter.

source: path entry hook
fr: point d'entrée pour la recherche dans *path*

source: A callable on the :data:`sys.path_hook` list which returns a :term:`path entry finder` if it knows how to find modules on a specific :term:`path entry`.
fr: Appelable dans la liste :data:`sys.path_hook` qui donne un :term:`chercheur d'entrée dans path <path entry finder>` s'il sait où trouver des modules pour une :term:`entrée dans path <path entry>` donnée.

source: path based finder
fr: chercheur basé sur les chemins

source: One of the default :term:`meta path finders <meta path finder>` which searches an :term:`import path` for modules.
fr: L'un des :term:`chercheurs dans les méta-chemins <meta path finder>` par défaut qui cherche des modules dans un :term:`chemin des imports <import path>`.

source: path-like object
fr: objet simili-chemin

source: An object representing a file system path. A path-like object is either a :class:`str` or :class:`bytes` object representing a path, or an object implementing the :class:`os.PathLike` protocol. An object that supports the :class:`os.PathLike` protocol can be converted to a :class:`str` or :class:`bytes` file system path by calling the :func:`os.fspath` function; :func:`os.fsdecode` and :func:`os.fsencode` can be used to guarantee a :class:`str` or :class:`bytes` result instead, respectively. Introduced by :pep:`519`.
fr: Objet représentant un chemin du système de fichiers. Un objet simili-chemin est un objet :class:`str` ou un objet :class:`bytes` représentant un chemin ou un objet implémentant le protocole :class:`os.PathLike`. Un objet qui accepte le protocole :class:`os.PathLike` peut être converti en un chemin :class:`str` ou :class:`bytes` du système de fichiers en appelant la fonction :func:`os.fspath`. :func:`os.fsdecode` et :func:`os.fsencode` peuvent être utilisées, respectivement, pour garantir un résultat de type :class:`str` ou :class:`bytes` à la place. A été Introduit par la :pep:`519`.

source: Python Enhancement Proposal. A PEP is a design document providing information to the Python community, or describing a new feature for Python or its processes or environment. PEPs should provide a concise technical specification and a rationale for proposed features.
fr: *Python Enhancement Proposal* (Proposition d'amélioration Python). Un PEP est un document de conception fournissant des informations à la communauté Python ou décrivant une nouvelle fonctionnalité pour Python, ses processus ou son environnement. Les PEP doivent fournir une spécification technique concise et une justification des fonctionnalités proposées.

source: PEPs are intended to be the primary mechanisms for proposing major new features, for collecting community input on an issue, and for documenting the design decisions that have gone into Python. The PEP author is responsible for building consensus within the community and documenting dissenting opinions.
fr: Les PEPs sont censés être les principaux mécanismes pour proposer de nouvelles fonctionnalités majeures, pour recueillir les commentaires de la communauté sur une question et pour documenter les décisions de conception qui sont intégrées en Python. L’auteur du PEP est responsable de l’établissement d’un consensus au sein de la communauté et de documenter les opinions contradictoires.

source: See :pep:`1`.
fr: Voir :pep:`1`.

source: A set of files in a single directory (possibly stored in a zip file) that contribute to a namespace package, as defined in :pep:`420`.
fr: Jeu de fichiers dans un seul dossier (pouvant être stocké sous forme de fichier zip) qui contribue à l'espace de noms d'un paquet, tel que défini dans la :pep:`420`.

source: positional argument
fr: argument positionnel

source: provisional API
fr: API provisoire

source: A provisional API is one which has been deliberately excluded from the standard library's backwards compatibility guarantees. While major changes to such interfaces are not expected, as long as they are marked provisional, backwards incompatible changes (up to and including removal of the interface) may occur if deemed necessary by core developers. Such changes will not be made gratuitously -- they will occur only if serious fundamental flaws are uncovered that were missed prior to the inclusion of the API.
fr: Une API provisoire est une API qui n'offre aucune garantie de rétrocompatibilité (la bibliothèque standard exige la rétrocompatibilité). Bien que des changements majeurs d'une telle interface ne soient pas attendus, tant qu'elle est étiquetée provisoire, des changement cassant la rétrocompatibilité (y compris sa suppression complète) peuvent survenir si les développeurs principaux le jugent nécessaire. Ces modifications ne surviendront que si de sérieux problèmes sont découverts et qu'ils n'avaient pas été identifiés avant l'ajout de l'API.

source: Even for provisional APIs, backwards incompatible changes are seen as a "solution of last resort" - every attempt will still be made to find a backwards compatible resolution to any identified problems.
fr: Même pour les API provisoires, les changement cassant la rétrocompatibilité sont considérées comme des "solutions de dernier recours". Tout ce qui est possible sera fait pour tenter de résoudre les problème en conservant la rétrocompatibilité.

source: This process allows the standard library to continue to evolve over time, without locking in problematic design errors for extended periods of time. See :pep:`411` for more details.
fr: Ce processus permet à la bibliothèque standard de continuer à évoluer avec le temps, sans se bloquer longtemps sur des erreurs d'architecture. Voir la :pep:`411` pour plus de détails.

source: provisional package
fr: paquet provisoire

source: See :term:`provisional API`.
fr: Voir :term:`provisional API`.

source: Nickname for the Python 3.x release line (coined long ago when the release of version 3 was something in the distant future.) This is also abbreviated "Py3k".
fr: Surnom donné à la série des Python 3.x (très vieux surnom donné à l'époque où Python 3 représentait un futur lointain). Aussi abrégé *Py3k*.

source: Pythonic
fr: *Pythonique*

source: An idea or piece of code which closely follows the most common idioms of the Python language, rather than implementing code using concepts common to other languages. For example, a common idiom in Python is to loop over all elements of an iterable using a :keyword:`for` statement. Many other languages don't have this type of construct, so people unfamiliar with Python sometimes use a numerical counter instead::
fr: Idée, ou bout de code, qui colle aux idiomes de Python plutôt qu'aux concepts communs rencontrés dans d'autres langages. Par exemple, il est idiomatique en Python de parcourir les éléments d'un itérable en utilisant :keyword:`for`. Beaucoup d'autres langages n'ont pas cette possibilité, donc les gens qui ne sont pas habitués à Python utilisent parfois un compteur numérique à la place : ::

source: As opposed to the cleaner, Pythonic method::
fr: Plutôt qu'utiliser la méthode, plus propre et élégante, donc *Pythonique* : ::

source: qualified name
fr: nom qualifié

source: A dotted name showing the "path" from a module's global scope to a class, function or method defined in that module, as defined in :pep:`3155`. For top-level functions and classes, the qualified name is the same as the object's name::
fr: Nom, comprenant des points, montrant le "chemin" de l'espace de noms global d'un module vers une classe, fonction ou méthode définie dans ce module, tel que défini dans la :pep:`3155`. Pour les fonctions et classes de premier niveau, le nom qualifié est le même que le nom de l'objet : ::

source: When used to refer to modules, the *fully qualified name* means the entire dotted path to the module, including any parent packages, e.g. ``email.mime.text``::
fr: Lorsqu'il est utilisé pour nommer des modules, le *nom qualifié complet* (*fully qualified name - FQN* en anglais) signifie le chemin complet (séparé par des points) vers le module, incluant tous les paquets parents. Par exemple : ``email.mime.text`` ::

source: reference count
fr: nombre de références

source: The number of references to an object. When the reference count of an object drops to zero, it is deallocated. Reference counting is generally not visible to Python code, but it is a key element of the :term:`CPython` implementation. The :mod:`sys` module defines a :func:`~sys.getrefcount` function that programmers can call to return the reference count for a particular object.
fr: Nombre de références à un objet. Lorsque le nombre de références à un objet descend à zéro, l'objet est désalloué. Le comptage de référence n'est généralement pas visible dans le code Python, mais c'est un élément clé de l'implémentation :term:`CPython`. Le module :mod:`sys` définit une fonction :func:`~sys.getrefcount` que les développeurs peuvent utiliser pour obtenir le nombre de références à un objet donné.

source: regular package
fr: paquet classique

source: A traditional :term:`package`, such as a directory containing an ``__init__.py`` file.
fr: :term:`paquet` traditionnel, tel qu'un dossier contenant un fichier ``__init__.py``.

source: See also :term:`namespace package`.
fr: Voir aussi :term:`paquet-espace de noms`.

source: A declaration inside a class that saves memory by pre-declaring space for instance attributes and eliminating instance dictionaries. Though popular, the technique is somewhat tricky to get right and is best reserved for rare cases where there are large numbers of instances in a memory-critical application.
fr: Déclaration dans une classe qui économise de la mémoire en pré-allouant de l'espace pour les attributs des instances et qui élimine le dictionnaire (des attributs) des instances. Bien que populaire, cette technique est difficile à maîtriser et devrait être réservée à de rares cas où un grand nombre d'instances dans une application devient un sujet critique pour la mémoire.

source: sequence
fr: séquence

source: An :term:`iterable` which supports efficient element access using integer indices via the :meth:`__getitem__` special method and defines a :meth:`__len__` method that returns the length of the sequence. Some built-in sequence types are :class:`list`, :class:`str`, :class:`tuple`, and :class:`bytes`. Note that :class:`dict` also supports :meth:`__getitem__` and :meth:`__len__`, but is considered a mapping rather than a sequence because the lookups use arbitrary :term:`immutable` keys rather than integers.
fr: :term:`itérable` qui offre un accès efficace à ses éléments par un indice sous forme de nombre entier via la méthode spéciale :meth:`__getitem__` et qui définit une méthode :meth:`__len__` donnant sa taille. Voici quelques séquences natives : :class:`list`, :class:`str`, :class:`tuple`, et :class:`bytes`. Notez que :class:`dict` possède aussi une méthode :meth:`__getitem__` et une méthode :meth:`__len__`, mais il est considéré comme un *mapping* plutôt qu'une séquence, car ses accès se font par une clé arbitraire :term:`immuable` plutôt qu'un nombre entier.

source: The :class:`collections.abc.Sequence` abstract base class defines a much richer interface that goes beyond just :meth:`__getitem__` and :meth:`__len__`, adding :meth:`count`, :meth:`index`, :meth:`__contains__`, and :meth:`__reversed__`. Types that implement this expanded interface can be registered explicitly using :func:`~abc.register`.
fr: La classe abstraite de base :class:`collections.abc.Sequence` définit une interface plus riche qui va au-delà des simples :meth:`__getitem__` et :meth:`__len__`, en ajoutant :meth:`count`, :meth:`index`, :meth:`__contains__` et :meth:`__reversed__`. Les types qui implémentent cette interface étendue peuvent s'enregistrer explicitement en utilisant :func:`~abc.register`.

source: single dispatch
fr: distribution simple

source: A form of :term:`generic function` dispatch where the implementation is chosen based on the type of a single argument.
fr: Forme de distribution, comme les :term:`fonction génériques <fonction générique>`, où l'implémentation est choisie en fonction du type d'un seul argument.

source: slice
fr: tranche

source: An object usually containing a portion of a :term:`sequence`. A slice is created using the subscript notation, ``[]`` with colons between numbers when several are given, such as in ``variable_name[1:3:5]``. The bracket (subscript) notation uses :class:`slice` objects internally.
fr: (*slice* en anglais), un objet contenant habituellement une portion de :term:`séquence`. Une tranche est créée en utilisant la notation ``[]`` avec des ``:`` entre les nombres lorsque plusieurs sont fournis, comme dans ``variable_name[1:3:5]``. Cette notation utilise des objets :class:`slice` en interne.

source: special method
fr: méthode spéciale

source: A method that is called implicitly by Python to execute a certain operation on a type, such as addition. Such methods have names starting and ending with double underscores. Special methods are documented in :ref:`specialnames`.
fr: (*special method* en anglais) Méthode appelée implicitement par Python pour exécuter une opération sur un type, comme une addition. De telles méthodes ont des noms commençant et terminant par des doubles tirets bas. Les méthodes spéciales sont documentées dans :ref:`specialnames`.

source: statement
fr: instruction

source: A statement is part of a suite (a "block" of code). A statement is either an :term:`expression` or one of several constructs with a keyword, such as :keyword:`if`, :keyword:`while` or :keyword:`for`.
fr: Une instruction (*statement* en anglais) est un composant d'un "bloc" de code. Une instruction est soit une :term:`expression`, soit une ou plusieurs constructions basées sur un mot-clé, comme :keyword:`if`, :keyword:`while` ou :keyword:`for`.

source: A tuple with named elements. Struct sequences expose an interface similar to :term:`named tuple` in that elements can be accessed either by index or as an attribute. However, they do not have any of the named tuple methods like :meth:`~collections.somenamedtuple._make` or :meth:`~collections.somenamedtuple._asdict`. Examples of struct sequences include :data:`sys.float_info` and the return value of :func:`os.stat`.
fr: Un n-uplet (*tuple* en anglais) dont les éléments sont nommés. Les *struct sequences* exposent une interface similaire au :term:`n-uplet nommé` car on peut accéder à leurs éléments par un nom d'attribut ou par un indice. Cependant, elles n'ont aucune des méthodes du *n-uplet nommé* : ni :meth:`collections.somenamedtuple._make` ou :meth:`~collections.somenamedtuple._asdict`. Par exemple :data:`sys.float_info` ou les valeurs données par :func:`os.stat` sont des *struct sequence*.

source: text encoding
fr: encodage de texte

source: A codec which encodes Unicode strings to bytes.
fr: Codec (codeur-décodeur) qui convertit des chaînes de caractères Unicode en octets (classe *bytes*).

source: text file
fr: fichier texte

source: A :term:`file object` able to read and write :class:`str` objects. Often, a text file actually accesses a byte-oriented datastream and handles the :term:`text encoding` automatically. Examples of text files are files opened in text mode (``'r'`` or ``'w'``), :data:`sys.stdin`, :data:`sys.stdout`, and instances of :class:`io.StringIO`.
fr: :term:`file object` capable de lire et d'écrire des objets :class:`str`. Souvent, un fichier texte (*text file* en anglais) accède en fait à un flux de donnée en octets et gère l':term:`text encoding` automatiquement. Des exemples de fichiers textes sont les fichiers ouverts en mode texte (``'r'`` ou ``'w'``), :data:`sys.stdin`, :data:`sys.stdout` et les instances de :class:`io.StringIO`.

source: See also :term:`binary file` for a file object able to read and write :term:`bytes-like objects <bytes-like object>`.
fr: Voir aussi :term:`binary file` pour un objet fichier capable de lire et d'écrire :term:`bytes-like objects <bytes-like object>`.

source: triple-quoted string
fr: chaîne entre triple guillemets

source: A string which is bound by three instances of either a quotation mark (") or an apostrophe ('). While they don't provide any functionality not available with single-quoted strings, they are useful for a number of reasons. They allow you to include unescaped single and double quotes within a string and they can span multiple lines without the use of the continuation character, making them especially useful when writing docstrings.
fr: Chaîne qui est délimitée par trois guillemets simples (``'``) ou trois guillemets doubles (``"``). Bien qu'elle ne fournisse aucune fonctionnalité qui ne soit pas disponible avec une chaîne entre guillemets, elle est utile pour de nombreuses raisons. Elle vous autorise à insérer des guillemets simples et doubles dans une chaîne sans avoir à les protéger et elle peut s'étendre sur plusieurs lignes sans avoir à terminer chaque ligne par un ``\``. Elle est ainsi particulièrement utile pour les chaînes de documentation (*docstrings*).

source: The type of a Python object determines what kind of object it is; every object has a type. An object's type is accessible as its :attr:`~instance.__class__` attribute or can be retrieved with ``type(obj)``.
fr: Le type d'un objet Python détermine quel genre d'objet c'est. Tous les objets ont un type. Le type d'un objet peut être obtenu via son attribut :attr:`~instance.__class__` ou via ``type(obj)``.

source: type alias
fr: alias de type

source: A synonym for a type, created by assigning the type to an identifier.
fr: Synonyme d'un type, créé en affectant le type à un identifiant.

source: Type aliases are useful for simplifying :term:`type hints <type hint>`. For example::
fr: Les alias de types sont utiles pour simplifier les :term:`indications de types <type hint>`. Par exemple ::

source: could be made more readable like this::
fr: pourrait être rendu plus lisible comme ceci ::

source: See :mod:`typing` and :pep:`484`, which describe this functionality.
fr: Voir :mod:`typing` et :pep:`484`, qui décrivent cette fonctionnalité.

source: type hint
fr: indication de type

source: An :term:`annotation` that specifies the expected type for a variable, a class attribute, or a function parameter or return value.
fr: Le :term:`annotation` qui spécifie le type attendu pour une variable, un attribut de classe, un paramètre de fonction ou une valeur de retour.

source: Type hints are optional and are not enforced by Python but they are useful to static type analysis tools, and aid IDEs with code completion and refactoring.
fr: Les indications de type sont facultatifs et ne sont pas indispensables à l'interpréteur Python, mais ils sont utiles aux outils d'analyse de type statique et aident les IDE à compléter et à réusiner (*code refactoring* en anglais) le code.
