Repository: python/python-docs-fr
Catalog: glossary.po
Languages: fr

source: Glossary
fr: Glossaire

source: The default Python prompt of the interactive shell. Often seen for code examples which can be executed interactively in the interpreter.
fr: L'invite de commande utilisée par défaut dans l'interpréteur interactif. On la voit souvent dans des exemples de code qui peuvent être exécutés interactivement dans l'interpréteur.

source: The default Python prompt of the interactive shell when entering code for an indented code block, when within a pair of matching left and right delimiters (parentheses, square brackets, curly braces or triple quotes), or after specifying a decorator.
fr: L'invite de commande utilisée par défaut dans l'interpréteur interactif lorsqu'on entre un bloc de code indenté, dans des délimiteurs fonctionnant par paires (parenthèses, crochets, accolades, triple guillemets), ou après un décorateur.

source: A tool that tries to convert Python 2.x code to Python 3.x code by handling most of the incompatibilities which can be detected by parsing the source and traversing the parse tree.
fr: Outil qui essaie de convertir du code pour Python 2.x en code pour Python 3.x en gérant la plupart des incompatibilités qui peuvent être détectées en analysant la source et parcourant son arbre syntaxique.

source: 2to3 is available in the standard library as :mod:`lib2to3`; a standalone entry point is provided as :file:`Tools/scripts/2to3`. See :ref:`2to3-reference`.
fr: *2to3* est disponible dans la bibliothèque standard sous le nom de :mod:`lib2to3`; un point d’entrée indépendant est fourni via :file:`Tools/scripts/2to3`. Cf. :ref:`2to3-reference`.

source: abstract base class
fr: classe de base abstraite

source: Abstract base classes complement :term:`duck-typing` by providing a way to define interfaces when other techniques like :func:`hasattr` would be clumsy or subtly wrong (for example with :ref:`magic methods <special-lookup>`). ABCs introduce virtual subclasses, which are classes that don't inherit from a class but are still recognized by :func:`isinstance` and :func:`issubclass`; see the :mod:`abc` module documentation. Python comes with many built-in ABCs for data structures (in the :mod:`collections.abc` module), numbers (in the :mod:`numbers` module), streams (in the :mod:`io` module), import finders and loaders (in the :mod:`importlib.abc` module). You can create your own ABCs with the :mod:`abc` module.
fr: Les classes de base abstraites (ABC, suivant l'abréviation anglaise *Abstract Base Class*) complètent le :term:`duck-typing` en fournissant un moyen de définir des interfaces pour les cas où d'autres techniques comme :func:`hasattr` seraient inélégantes ou subitement fausses (par exemple avec les :ref:`méthodes magiques <special-lookup>`). Les ABC introduisent des sous-classes virtuelles qui n'héritent pas d'une classe mais qui sont quand même reconnues par :func:`isinstance` ou :func:`issubclass` (voir la documentation du module :mod:`abc`). Python contient de nombreuses ABC pour les structures de données (dans le module :mod:`collections.abc`), les nombres (dans le module :mod:`numbers`), les flux (dans le module :mod:`io`) et les chercheurs-chargeurs du système d'importation (dans le module :mod:`importlib.abc`). Vous pouvez créer vos propres ABC avec le module :mod:`abc`.

source: A label associated with a variable, a class attribute or a function parameter or return value, used by convention as a :term:`type hint`.
fr: Étiquette associée à une variable, un attribut de classe, un paramètre de fonction ou une valeur de retour. Elle est utilisé par convention comme :term:`type hint`.

source: Annotations of local variables cannot be accessed at runtime, but annotations of global variables, class attributes, and functions are stored in the :attr:`__annotations__` special attribute of modules, classes, and functions, respectively.
fr: Les annotations de variables locales ne sont pas accessibles au moment de l'exécution, mais les annotations de variables globales, d'attributs de classe et de fonctions sont stockées dans l'attribut spécial :attr:`__annotations__` des modules, classes et fonctions, respectivement.

source: See :term:`variable annotation`, :term:`function annotation`, :pep:`484` and :pep:`526`, which describe this functionality.
fr: Voir :term:`variable annotation`, :term:`function annotation`, :pep:`484` et :pep:`526`, qui décrivent cette fonctionnalité.

source: A value passed to a :term:`function` (or :term:`method`) when calling the function. There are two kinds of argument:
fr: Valeur, donnée à une :term:`fonction` ou à une :term:`méthode` lors de son appel. Il existe deux types d'arguments :

source: :dfn:`keyword argument`: an argument preceded by an identifier (e.g. ``name=``) in a function call or passed as a value in a dictionary preceded by ``**``. For example, ``3`` and ``5`` are both keyword arguments in the following calls to :func:`complex`::
fr: :dfn:`argument nommé`: un argument précédé d'un identifiant (comme ``name=``) ou un dictionnaire précédé de ``**``, lors d'un appel de fonction. Par exemple, ``3`` et ``5`` sont tous les deux des arguments nommés dans l'appel à :func:`complex` ici : ::

source: :dfn:`positional argument`: an argument that is not a keyword argument. Positional arguments can appear at the beginning of an argument list and/or be passed as elements of an :term:`iterable` preceded by ``*``. For example, ``3`` and ``5`` are both positional arguments in the following calls::
fr: :dfn:`argument positionnel` : Un argument qui n'est pas nommé. Les arguments positionnels apparaissent au début de la liste des arguments, ou donnés sous forme d'un :term:`itérable` précédé par ``*``. Par exemple, ``3`` et ``5`` sont tous les deux des arguments positionnels dans les appels suivants : ::

source: Arguments are assigned to the named local variables in a function body. See the :ref:`calls` section for the rules governing this assignment. Syntactically, any expression can be used to represent an argument; the evaluated value is assigned to the local variable.
fr: Les arguments se retrouvent dans le corps de la fonction appelée parmi les variables locales. Voir la section :ref:`calls` à propos des règles dictant cette affectation. Syntaxiquement, toute expression est acceptée comme argument, et c'est la valeur résultante de l'expression qui sera affectée à la variable locale.

source: See also the :term:`parameter` glossary entry, the FAQ question on :ref:`the difference between arguments and parameters <faq-argument-vs-parameter>`, and :pep:`362`.
fr: Voir aussi :term:`parameter` dans le glossaire, la question :ref:`Différence entre argument et paramètre <faq-argument-vs-parameter>` de la FAQ et la :pep:`362`.

source: asynchronous context manager
fr: gestionnaire de contexte asynchrone

source: An object which controls the environment seen in an :keyword:`async with` statement by defining :meth:`__aenter__` and :meth:`__aexit__` methods. Introduced by :pep:`492`.
fr: (*asynchronous context manager* en anglais) Objet contrôlant l'environnement à l'intérieur d'une instruction :keyword:`with` en définissant les méthodes :meth:`__aenter__` et :meth:`__aexit__`. A été Introduit par la :pep:`492`.

source: asynchronous generator
fr: générateur asynchrone

source: A function which returns an :term:`asynchronous generator iterator`. It looks like a coroutine function defined with :keyword:`async def` except that it contains :keyword:`yield` expressions for producing a series of values usable in an :keyword:`async for` loop.
fr: Fonction qui renvoie un :term:`asynchronous generator iterator`. Cela ressemble à une coroutine définie par :keyword:`async def`, sauf qu'elle contient une ou des expressions :keyword:`yield` produisant ainsi uns série de valeurs utilisables dans une boucle :keyword:`async for`.

source: An asynchronous generator function may contain :keyword:`await` expressions as well as :keyword:`async for`, and :keyword:`async with` statements.
fr: Un générateur asynchrone peut contenir des expressions :keyword:`await` ainsi que des instructions :keyword:`async for`, et :keyword:`async with`.

source: asynchronous generator iterator
fr: itérateur de générateur asynchrone

source: An object created by a :term:`asynchronous generator` function.
fr: Objet créé par une fonction :term:`asynchronous generator`.

source: Each :keyword:`yield` temporarily suspends processing, remembering the location execution state (including local variables and pending try-statements). When the *asynchronous generator iterator* effectively resumes with another awaitable returned by :meth:`__anext__`, it picks up where it left off. See :pep:`492` and :pep:`525`.
fr: Chaque :keyword:`yield` suspend temporairement l'exécution, en gardant en mémoire l'endroit et l'état de l'exécution (ce qui inclut les variables locales et les *try* en cours). Lorsque l'exécution de l'itérateur de générateur asynchrone reprend avec un nouvel *awaitable* renvoyé par :meth:`__anext__`, elle repart de là où elle s'était arrêtée. Voir la :pep:`492` et la :pep:`525`.

source: asynchronous iterable
fr: itérable asynchrone

source: An object, that can be used in an :keyword:`async for` statement. Must return an :term:`asynchronous iterator` from its :meth:`__aiter__` method. Introduced by :pep:`492`.
fr: Objet qui peut être utilisé dans une instruction :keyword:`async for`. Sa méthode :meth:`__aiter__` doit renvoyer un :term:`asynchronous iterator`. A été introduit par la :pep:`492`.

source: asynchronous iterator
fr: itérateur asynchrone

source: An object that implements the :meth:`__aiter__` and :meth:`__anext__` methods. ``__anext__`` must return an :term:`awaitable` object. :keyword:`async for` resolves the awaitables returned by an asynchronous iterator's :meth:`__anext__` method until it raises a :exc:`StopAsyncIteration` exception. Introduced by :pep:`492`.
fr: Objet qui implémente les méthodes :meth:`__aiter__` et :meth:`__anext__`. ``__anext__`` doit renvoyer un objet :term:`awaitable`. Tant que la méthode :meth:`__anext__` produit des objets *awaitable*, le :keyword:`async for` appelant les consomme. L'itérateur asynchrone lève une exception :exc:`StopAsyncIteration` pour signifier la fin de l'itération. A été introduit par la :pep:`492`.

source: attribute
fr: attribut

source: A value associated with an object which is referenced by name using dotted expressions. For example, if an object *o* has an attribute *a* it would be referenced as *o.a*.
fr: Valeur associée à un objet et désignée par son nom via une notation utilisant des points. Par exemple, si un objet *o* possède un attribut *a*, il sera référencé par *o.a*.

source: An object that can be used in an :keyword:`await` expression. Can be a :term:`coroutine` or an object with an :meth:`__await__` method. See also :pep:`492`.
fr: Objet pouvant être utilisé dans une expression :keyword:`await`. Peut être une :term:`coroutine` ou un objet avec une méthode :meth:`__await__`. Voir aussi la :pep:`492`.

source: Benevolent Dictator For Life, a.k.a. `Guido van Rossum <https://gvanrossum.github.io/>`_, Python's creator.
fr: Dictateur bienveillant à vie (*Benevolent Dictator For Life* en anglais). Pseudonyme de `Guido van Rossum <https://gvanrossum.github.io/>`_, le créateur de Python.

source: binary file
fr: fichier binaire

source: A :term:`file object` able to read and write :term:`bytes-like objects <bytes-like object>`. Examples of binary files are files opened in binary mode (``'rb'``, ``'wb'`` or ``'rb+'``), :data:`sys.stdin.buffer`, :data:`sys.stdout.buffer`, and instances of :class:`io.BytesIO` and :class:`gzip.GzipFile`.
fr: Un :term:`file object` capable de lire et d'écrire des :term:`bytes-like objects <bytes-like object>`. Des fichiers binaires sont, par exemple, les fichiers ouverts en mode binaire (``'rb'``, ``'wb'``, ou ``'rb+'``), :data:`sys.stdin.buffer`, :data:`sys.stdout.buffer`, les instances de :class:`io.BytesIO` ou de :class:`gzip.GzipFile`.

source: See also :term:`text file` for a file object able to read and write :class:`str` objects.
fr: Consultez :term:`fichier texte`, un objet fichier capable de lire et d'écrire des objets :class:`str`.

source: bytes-like object
fr: Objet bytes-compatible

source: An object that supports the :ref:`bufferobjects` and can export a C-:term:`contiguous` buffer. This includes all :class:`bytes`, :class:`bytearray`, and :class:`array.array` objects, as well as many common :class:`memoryview` objects. Bytes-like objects can be used for various operations that work with binary data; these include compression, saving to a binary file, and sending over a socket.
fr: Un objet gérant les :ref:`bufferobjects` et pouvant exporter un tampon (*buffer* en anglais) C-:term:`contiguous`. Cela inclut les objets :class:`bytes`, :class:`bytearray` et :class:`array.array`, ainsi que beaucoup d'objets :class:`memoryview`. Les objets bytes-compatibles peuvent être utilisés pour diverses opérations sur des données binaires, comme la compression, la sauvegarde dans un fichier binaire ou l'envoi sur le réseau.

source: Some operations need the binary data to be mutable. The documentation often refers to these as "read-write bytes-like objects". Example mutable buffer objects include :class:`bytearray` and a :class:`memoryview` of a :class:`bytearray`. Other operations require the binary data to be stored in immutable objects ("read-only bytes-like objects"); examples of these include :class:`bytes` and a :class:`memoryview` of a :class:`bytes` object.
fr: Certaines opérations nécessitent de travailler sur des données binaires variables. La documentation parle de ceux-ci comme des *read-write bytes-like objects*. Par exemple, :class:`bytearray` ou une :class:`memoryview` d'un :class:`bytearray` en font partie. D'autres opérations nécessitent de travailler sur des données binaires stockées dans des objets immuables (*"read-only bytes-like objects"*), par exemples :class:`bytes` ou :class:`memoryview` d'un objet :class:`byte`.

source: bytecode
fr: code intermédiaire (*bytecode*)

source: Python source code is compiled into bytecode, the internal representation of a Python program in the CPython interpreter. The bytecode is also cached in ``.pyc`` files so that executing the same file is faster the second time (recompilation from source to bytecode can be avoided). This "intermediate language" is said to run on a :term:`virtual machine` that executes the machine code corresponding to each bytecode. Do note that bytecodes are not expected to work between different Python virtual machines, nor to be stable between Python releases.
fr: Le code source, en Python, est compilé en un code intermédiaire (*bytecode* en anglais), la représentation interne à CPython d'un programme Python. Le code intermédiaire est mis en cache dans un fichier ``.pyc`` de manière à ce qu'une seconde exécution soit plus rapide (la compilation en code intermédiaire a déjà été faite). On dit que ce *langage intermédiaire* est exécuté sur une :term:`virtual machine` qui exécute des instructions machine pour chaque instruction du code intermédiaire. Notez que le code intermédiaire n'a pas vocation à fonctionner sur différentes machines virtuelles Python ou à être stable entre différentes versions de Python.

source: A list of bytecode instructions can be found in the documentation for :ref:`the dis module <bytecodes>`.
fr: La documentation du :ref:`module dis <bytecodes>` fournit une liste des instructions du code intermédiaire.

source: class
fr: classe

source: A template for creating user-defined objects. Class definitions normally contain method definitions which operate on instances of the class.
fr: Modèle pour créer des objets définis par l'utilisateur. Une définition de classe (*class*) contient normalement des définitions de méthodes qui agissent sur les instances de la classe.

source: class variable
fr: variable de classe

source: A variable defined in a class and intended to be modified only at class level (i.e., not in an instance of the class).
fr: Une variable définie dans une classe et destinée à être modifiée uniquement au niveau de la classe (c'est-à-dire, pas dans une instance de la classe).

source: coercion
fr: coercition

source: complex number
fr: nombre complexe

source: An extension of the familiar real number system in which all numbers are expressed as a sum of a real part and an imaginary part. Imaginary numbers are real multiples of the imaginary unit (the square root of ``-1``), often written ``i`` in mathematics or ``j`` in engineering. Python has built-in support for complex numbers, which are written with this latter notation; the imaginary part is written with a ``j`` suffix, e.g., ``3+1j``. To get access to complex equivalents of the :mod:`math` module, use :mod:`cmath`. Use of complex numbers is a fairly advanced mathematical feature. If you're not aware of a need for them, it's almost certain you can safely ignore them.
fr: Extension des nombres réels familiers, dans laquelle tous les nombres sont exprimés sous la forme d'une somme d'une partie réelle et d'une partie imaginaire. Les nombres imaginaires sont les nombres réels multipliés par l'unité imaginaire (la racine carrée de ``-1``, souvent écrite ``i`` en mathématiques ou ``j`` par les ingénieurs). Python comprend nativement les nombres complexes, écrits avec cette dernière notation : la partie imaginaire est écrite avec un suffixe ``j``, exemple, ``3+1j``. Pour utiliser les équivalents complexes de :mod:`math`, utilisez :mod:`cmath`. Les nombres complexes sont un concept assez avancé en mathématiques. Si vous ne connaissez pas ce concept, vous pouvez tranquillement les ignorer.

source: context manager
fr: gestionnaire de contexte

source: An object which controls the environment seen in a :keyword:`with` statement by defining :meth:`__enter__` and :meth:`__exit__` methods. See :pep:`343`.
fr: Objet contrôlant l'environnement à l'intérieur d'un bloc :keyword:`with` en définissant les méthodes :meth:`__enter__` et :meth:`__exit__`. Consultez la :pep:`343`.

source: contiguous
fr: contigu

source: A buffer is considered contiguous exactly if it is either *C-contiguous* or *Fortran contiguous*. Zero-dimensional buffers are C and Fortran contiguous. In one-dimensional arrays, the items must be laid out in memory next to each other, in order of increasing indexes starting from zero. In multidimensional C-contiguous arrays, the last index varies the fastest when visiting items in order of memory address. However, in Fortran contiguous arrays, the first index varies the fastest.
fr: Un tampon (*buffer* en anglais) est considéré comme contigu s’il est soit *C-contigu* soit *Fortran-contigu*. Les tampons de dimension zéro sont C-contigus et Fortran-contigus. Pour un tableau à une dimension, ses éléments doivent être placés en mémoire l’un à côté de l’autre, dans l’ordre croissant de leur indice, en commençant à zéro. Pour qu’un tableau multidimensionnel soit C-contigu, le dernier indice doit être celui qui varie le plus rapidement lors du parcours de ses éléments dans l’ordre de leur adresse mémoire. À l'inverse, dans les tableaux Fortran-contigu, c’est le premier indice qui doit varier le plus rapidement.

source: Coroutines is a more generalized form of subroutines. Subroutines are entered at one point and exited at another point. Coroutines can be entered, exited, and resumed at many different points. They can be implemented with the :keyword:`async def` statement. See also :pep:`492`.
fr: Les coroutines sont une forme généralisées des fonctions. On entre dans une fonction en un point et on en sort en un autre point. On peut entrer, sortir et reprendre l'exécution d'une coroutine en plusieurs points. Elles peuvent être implémentées en utilisant l'instruction :keyword:`async def`. Voir aussi la :pep:`492`.

source: coroutine function
fr: fonction coroutine

source: A function which returns a :term:`coroutine` object. A coroutine function may be defined with the :keyword:`async def` statement, and may contain :keyword:`await`, :keyword:`async for`, and :keyword:`async with` keywords. These were introduced by :pep:`492`.
fr: Fonction qui renvoie un objet :term:`coroutine`. Une fonction coroutine peut être définie par l'instruction :keyword:`async def` et peut contenir les mots clés :keyword:`await`, :keyword:`async for` ainsi que :keyword:`async with`. A été introduit par la :pep:`492`.

source: The canonical implementation of the Python programming language, as distributed on `python.org <https://www.python.org>`_. The term "CPython" is used when necessary to distinguish this implementation from others such as Jython or IronPython.
fr: L'implémentation canonique du langage de programmation Python, tel que distribué sur `python.org <https://www.python.org>`_. Le terme "CPython" est utilisé dans certains contextes lorsqu'il est nécessaire de distinguer cette implémentation des autres comme *Jython* ou *IronPython*.

source: decorator
fr: décorateur

source: A function returning another function, usually applied as a function transformation using the ``@wrapper`` syntax. Common examples for decorators are :func:`classmethod` and :func:`staticmethod`.
fr: Fonction dont la valeur de retour est une autre fonction. Un décorateur est habituellement utilisé pour transformer une fonction via la syntaxe ``@wrapper``, dont les exemples typiques sont : :func:`classmethod` et :func:`staticmethod`.

source: The decorator syntax is merely syntactic sugar, the following two function definitions are semantically equivalent::
fr: La syntaxe des décorateurs est simplement du sucre syntaxique, les définitions des deux fonctions suivantes sont sémantiquement équivalentes ::

source: The same concept exists for classes, but is less commonly used there. See the documentation for :ref:`function definitions <function>` and :ref:`class definitions <class>` for more about decorators.
fr: Quoique moins fréquemment utilisé, le même concept existe pour les classes. Consultez la documentation :ref:`définitions de fonctions <function>` et :ref:`définitions de classes <class>` pour en savoir plus sur les décorateurs.

source: descriptor
fr: descripteur

source: Any object which defines the methods :meth:`__get__`, :meth:`__set__`, or :meth:`__delete__`. When a class attribute is a descriptor, its special binding behavior is triggered upon attribute lookup. Normally, using *a.b* to get, set or delete an attribute looks up the object named *b* in the class dictionary for *a*, but if *b* is a descriptor, the respective descriptor method gets called. Understanding descriptors is a key to a deep understanding of Python because they are the basis for many features including functions, methods, properties, class methods, static methods, and reference to super classes.
fr: N'importe quel objet définissant les méthodes :meth:`__get__`, :meth:`__set__`, ou :meth:`__delete__`. Lorsque l'attribut d'une classe est un descripteur, son comportement spécial est déclenché lors de la recherche des attributs. Normalement, lorsque vous écrivez *a.b* pour obtenir, affecter ou effacer un attribut, Python recherche l'objet nommé *b* dans le dictionnaire de la classe de *a*. Mais si *b* est un descripteur, c'est la méthode de ce descripteur qui est alors appelée. Comprendre les descripteurs est requis pour avoir une compréhension approfondie de Python, ils sont la base de nombre de ses caractéristiques notamment les fonctions, méthodes, propriétés, méthodes de classes, méthodes statiques et les références aux classes parentes.

source: For more information about descriptors' methods, see :ref:`descriptors`.
fr: Pour plus d'informations sur les méthodes des descripteurs, consultez :ref:`descriptors`.

source: dictionary
fr: dictionnaire
