Repository: python/python-docs-fr
Catalog: glossary.po
Languages: fr

source: When asked to shut down, the Python interpreter enters a special phase where it gradually releases all allocated resources, such as modules and various critical internal structures. It also makes several calls to the :term:`garbage collector <garbage collection>`. This can trigger the execution of code in user-defined destructors or weakref callbacks. Code executed during the shutdown phase can encounter various exceptions as the resources it relies on may not function anymore (common examples are library modules or the warnings machinery).
fr: Lorsqu'on lui demande de s'arrêter, l'interpréteur Python entre dans une phase spéciale où il libère graduellement les ressources allouées, comme les modules ou quelques structures de données internes. Il fait aussi quelques appels au :term:`ramasse-miettes`. Cela peut déclencher l'exécution de code dans des destructeurs ou des fonctions de rappels de *weakrefs*. Le code exécuté lors de l'arrêt peut rencontrer quelques exception puisque les ressources auxquelles il fait appel pourraient ne plus fonctionner, (typiquement les modules des bibliothèques ou le mécanisme de *warning*).

source: The main reason for interpreter shutdown is that the ``__main__`` module or the script being run has finished executing.
fr: La principale raison d'arrêt de l'interpréteur est que le module ``__main__`` ou le script en cours d'exécution a terminé de s'exécuter.

source: iterable
fr: itérable

source: An object capable of returning its members one at a time. Examples of iterables include all sequence types (such as :class:`list`, :class:`str`, and :class:`tuple`) and some non-sequence types like :class:`dict`, :term:`file objects <file object>`, and objects of any classes you define with an :meth:`__iter__` method or with a :meth:`__getitem__` method that implements :term:`Sequence` semantics.
fr: Objet capable de renvoyer ses éléments un à un. Par exemple, tous les types séquence (comme :class:`list`, :class:`str`, et :class:`tuple`), quelques autres types comme :class:`dict`, :term:`objets fichiers <objet fichier>` ou tout objet d'une classe ayant une méthode :meth:`__iter__` ou :meth:`__getitem__` qui implémente la sémantique d'une :term:`Sequence`.

source: Iterables can be used in a :keyword:`for` loop and in many other places where a sequence is needed (:func:`zip`, :func:`map`, ...). When an iterable object is passed as an argument to the built-in function :func:`iter`, it returns an iterator for the object. This iterator is good for one pass over the set of values. When using iterables, it is usually not necessary to call :func:`iter` or deal with iterator objects yourself. The ``for`` statement does that automatically for you, creating a temporary unnamed variable to hold the iterator for the duration of the loop. See also :term:`iterator`, :term:`sequence`, and :term:`generator`.
fr: Les itérables peuvent être utilisés dans des boucles :keyword:`for` et à beaucoup d'autres endroits où une séquence est requise (:func:`zip`, :func:`map`, ...). Lorsqu'un itérable est passé comme argument à la fonction native :func:`iter`, celle-ci fournit en retour un itérateur sur cet itérable. Cet itérateur n'est valable que pour une seule passe sur le jeu de valeurs. Lors de l'utilisation d'itérables, il n'est habituellement pas nécessaire d'appeler :func:`iter` ou de s'occuper soi-même des objets itérateurs. L'instruction ``for`` le fait automatiquement pour vous, créant une variable temporaire anonyme pour garder l'itérateur durant la boucle. Voir aussi :term:`itérateur`, :term:`séquence` et :term:`générateur`.

source: iterator
fr: itérateur

source: An object representing a stream of data. Repeated calls to the iterator's :meth:`~iterator.__next__` method (or passing it to the built-in function :func:`next`) return successive items in the stream. When no more data are available a :exc:`StopIteration` exception is raised instead. At this point, the iterator object is exhausted and any further calls to its :meth:`__next__` method just raise :exc:`StopIteration` again. Iterators are required to have an :meth:`__iter__` method that returns the iterator object itself so every iterator is also iterable and may be used in most places where other iterables are accepted. One notable exception is code which attempts multiple iteration passes. A container object (such as a :class:`list`) produces a fresh new iterator each time you pass it to the :func:`iter` function or use it in a :keyword:`for` loop. Attempting this with an iterator will just return the same exhausted iterator object used in the previous iteration pass, making it appear like an empty container.
fr: Objet représentant un flux de donnée. Des appels successifs à la méthode :meth:`~iterator.__next__` de l'itérateur (ou le passer à la fonction native :func:`next`) donne successivement les objets du flux. Lorsque plus aucune donnée n'est disponible, une exception :exc:`StopIteration` est levée. À ce point, l'itérateur est épuisé et tous les appels suivants à sa méthode :meth:`__next__` lèveront encore une exception :exc:`StopIteration`. Les itérateurs doivent avoir une méthode :meth:`__iter__` qui renvoie l'objet itérateur lui même, de façon à ce que chaque itérateur soit aussi itérable et puisse être utilisé dans la plupart des endroits où d'autres itérables sont attendus. Une exception notable est un code qui tente plusieurs itérations complètes. Un objet conteneur, (tel que :class:`list`) produit un nouvel itérateur neuf à chaque fois qu'il est passé à la fonction :func:`iter` ou s'il est utilisé dans une boucle :keyword:`for`. Faire ceci sur un itérateur donnerait simplement le même objet itérateur épuisé utilisé dans son itération précédente, le faisant ressembler à un conteneur vide.

source: More information can be found in :ref:`typeiter`.
fr: Vous trouverez davantage d'informations dans :ref:`typeiter`.

source: key function
fr: fonction clé

source: A key function or collation function is a callable that returns a value used for sorting or ordering. For example, :func:`locale.strxfrm` is used to produce a sort key that is aware of locale specific sort conventions.
fr: Une fonction clé est un objet appelable qui renvoie une valeur à fins de tri ou de classement. Par exemple, la fonction :func:`locale.strxfrm` est utilisée pour générer une clé de classement prenant en compte les conventions de classement spécifiques aux paramètres régionaux courants.

source: A number of tools in Python accept key functions to control how elements are ordered or grouped. They include :func:`min`, :func:`max`, :func:`sorted`, :meth:`list.sort`, :func:`heapq.merge`, :func:`heapq.nsmallest`, :func:`heapq.nlargest`, and :func:`itertools.groupby`.
fr: Plusieurs outils dans Python acceptent des fonctions clés pour déterminer comment les éléments sont classés ou groupés. On peut citer les fonctions :func:`min`, :func:`max`, :func:`sorted`, :meth:`list.sort`, :func:`heapq.merge`, :func:`heapq.nsmallest`, :func:`heapq.nlargest` et :func:`itertools.groupby`.

source: There are several ways to create a key function. For example. the :meth:`str.lower` method can serve as a key function for case insensitive sorts. Alternatively, a key function can be built from a :keyword:`lambda` expression such as ``lambda r: (r[0], r[2])``. Also, the :mod:`operator` module provides three key function constructors: :func:`~operator.attrgetter`, :func:`~operator.itemgetter`, and :func:`~operator.methodcaller`. See the :ref:`Sorting HOW TO <sortinghowto>` for examples of how to create and use key functions.
fr: Il existe plusieurs moyens de créer une fonction clé. Par exemple, la méthode :meth:`str.lower` peut servir de fonction clé pour effectuer des recherches insensibles à la casse. Aussi, il est possible de créer des fonctions clés avec des expressions :keyword:`lambda`, comme ``lambda r: (r[0], r[2])``. Vous noterez que le module :mod:`operator` propose des constructeurs de fonctions clefs : :func:`~operator.attrgetter`, :func:`~operator.itemgetter` et :func:`~operator.methodcaller`. Voir :ref:`Comment Trier <sortinghowto>` pour des exemples de création et d'utilisation de fonctions clefs.

source: keyword argument
fr: argument nommé

source: See :term:`argument`.
fr: Voir :term:`argument`.

source: An anonymous inline function consisting of a single :term:`expression` which is evaluated when the function is called. The syntax to create a lambda function is ``lambda [parameters]: expression``
fr: Fonction anonyme sous la forme d'une :term:`expression` et ne contenant qu'une seule expression, exécutée lorsque la fonction est appelée. La syntaxe pour créer des fonctions lambda est: ``lambda [parameters]: expression``

source: Look before you leap. This coding style explicitly tests for pre-conditions before making calls or lookups. This style contrasts with the :term:`EAFP` approach and is characterized by the presence of many :keyword:`if` statements.
fr: Regarde devant avant de tomber, (*Look before you leap* en anglais). Ce style de programmation consiste à vérifier des conditions avant d'effectuer des appels ou des accès. Ce style contraste avec le style :term:`EAFP` et se caractérise par la présence de beaucoup d'instructions :keyword:`if`.

source: In a multi-threaded environment, the LBYL approach can risk introducing a race condition between "the looking" and "the leaping". For example, the code, ``if key in mapping: return mapping[key]`` can fail if another thread removes *key* from *mapping* after the test, but before the lookup. This issue can be solved with locks or by using the EAFP approach.
fr: Dans un environnement avec plusieurs fils d'exécution (*multi-threaded* en anglais), le style *LBYL* peut engendrer un séquencement critique (*race condition* en anglais) entre le "regarde" et le "tomber". Par exemple, le code ``if key in mapping: return mapping[key]`` peut échouer si un autre fil d'exécution supprime la clé *key* du *mapping* après le test mais avant l'accès. Ce problème peut être résolu avec des verrous (*locks*) ou avec l'approche EAFP.

source: A built-in Python :term:`sequence`. Despite its name it is more akin to an array in other languages than to a linked list since access to elements is O(1).
fr: Un type natif de :term:`sequence` dans Python. En dépit de son nom, une ``list`` ressemble plus à un tableau (*array* dans la plupart des langages) qu'à une liste chaînée puisque les accès se font en O(1).

source: list comprehension
fr: liste en compréhension (ou liste en intension)

source: A compact way to process all or part of the elements in a sequence and return a list with the results. ``result = ['{:#04x}'.format(x) for x in range(256) if x % 2 == 0]`` generates a list of strings containing even hex numbers (0x..) in the range from 0 to 255. The :keyword:`if` clause is optional. If omitted, all elements in ``range(256)`` are processed.
fr: Écriture concise pour manipuler tout ou partie des éléments d'une séquence et renvoyer une liste contenant les résultats. ``result = ['{:#04x}'.format(x) for x in range(256) if x % 2 == 0]`` génère la liste composée des nombres pairs de 0 à 255 écrits sous formes de chaînes de caractères et en hexadécimal (``0x``...). La clause :keyword:`if` est optionnelle. Si elle est omise, tous les éléments du ``range(256)`` seront utilisés.

source: loader
fr: chargeur

source: An object that loads a module. It must define a method named :meth:`load_module`. A loader is typically returned by a :term:`finder`. See :pep:`302` for details and :class:`importlib.abc.Loader` for an :term:`abstract base class`.
fr: Objet qui charge un module. Il doit définir une méthode nommée :meth:`load_module`. Un chargeur est typiquement donné par un :term:`chercheur <finder>`. Voir la :pep:`302` pour plus de détails et :class:`importlib.ABC.Loader` pour sa :term:`classe de base abstraite`.

source: mapping
fr: Tableau de correspondances

source: A container object that supports arbitrary key lookups and implements the methods specified in the :class:`~collections.abc.Mapping` or :class:`~collections.abc.MutableMapping` :ref:`abstract base classes <collections-abstract-base-classes>`. Examples include :class:`dict`, :class:`collections.defaultdict`, :class:`collections.OrderedDict` and :class:`collections.Counter`.
fr: (*mapping* en anglais) Conteneur permettant de rechercher des éléments à partir de clés et implémentant les méthodes spécifiées dans les :ref:`classes de base abstraites <collections-abstract-base-classes>` :class:`collections.abc.Mapping` ou :class:`collections.abc.MutableMapping`. Les classes suivantes sont des exemples de tableaux de correspondances : :class:`dict`, :class:`collections.defaultdict`, :class:`collections.OrderedDict` et :class:`collections.Counter`.

source: meta path finder
fr: chercheur dans les méta-chemins

source: A :term:`finder` returned by a search of :data:`sys.meta_path`. Meta path finders are related to, but different from :term:`path entry finders <path entry finder>`.
fr: Un :term:`chercheur <finder>` renvoyé par une recherche dans :data:`sys.meta_path`. Les chercheurs dans les méta-chemins ressemblent, mais sont différents des :term:`chercheurs d'entrée dans path <path entry finder>`.

source: See :class:`importlib.abc.MetaPathFinder` for the methods that meta path finders implement.
fr: Voir :class:`importlib.abc.MetaPathFinder` pour les méthodes que les chercheurs dans les méta-chemins doivent implémenter.

source: metaclass
fr: métaclasse

source: The class of a class. Class definitions create a class name, a class dictionary, and a list of base classes. The metaclass is responsible for taking those three arguments and creating the class. Most object oriented programming languages provide a default implementation. What makes Python special is that it is possible to create custom metaclasses. Most users never need this tool, but when the need arises, metaclasses can provide powerful, elegant solutions. They have been used for logging attribute access, adding thread-safety, tracking object creation, implementing singletons, and many other tasks.
fr: Classe d'une classe. Les définitions de classe créent un nom pour la classe, un dictionnaire de classe et une liste de classes parentes. La métaclasse a pour rôle de réunir ces trois paramètres pour construire la classe. La plupart des langages orientés objet fournissent une implémentation par défaut. La particularité de Python est la possibilité de créer des métaclasses personnalisées. La plupart des utilisateurs n'aura jamais besoin de cet outil, mais lorsque le besoin survient, les métaclasses offrent des solutions élégantes et puissantes. Elles sont utilisées pour journaliser les accès à des propriétés, rendre sûr les environnements *multi-threads*, suivre la création d'objets, implémenter des singletons et bien d'autres tâches.

source: More information can be found in :ref:`metaclasses`.
fr: Plus d'informations sont disponibles dans : :ref:`metaclasses`.

source: method
fr: méthode

source: A function which is defined inside a class body. If called as an attribute of an instance of that class, the method will get the instance object as its first :term:`argument` (which is usually called ``self``). See :term:`function` and :term:`nested scope`.
fr: Fonction définie à l'intérieur d'une classe. Lorsqu'elle est appelée comme un attribut d'une instance de cette classe, la méthode reçoit l'instance en premier :term:`argument` (qui, par convention, est habituellement nommé ``self``). Voir :term:`function` et :term:`nested scope`.

source: method resolution order
fr: ordre de résolution des méthodes

source: Method Resolution Order is the order in which base classes are searched for a member during lookup. See `The Python 2.3 Method Resolution Order <https://www.python.org/download/releases/2.3/mro/>`_ for details of the algorithm used by the Python interpreter since the 2.3 release.
fr: L'ordre de résolution des méthodes (*MRO* pour *Method Resolution Order* en anglais) est, lors de la recherche d'un attribut dans les classes parentes, la façon dont l'interpréteur Python classe ces classes parentes. Voir `The Python 2.3 Method Resolution Order <https://www.python.org/download/releases/2.3/mro/>`_ pour plus de détails sur l'algorithme utilisé par l'interpréteur Python depuis la version 2.3.

source: An object that serves as an organizational unit of Python code. Modules have a namespace containing arbitrary Python objects. Modules are loaded into Python by the process of :term:`importing`.
fr: Objet utilisé pour organiser une portion unitaire de code en Python. Les modules ont un espace de noms et peuvent contenir n'importe quels objets Python. Charger des modules est appelé :term:`importer <importing>`.

source: See also :term:`package`.
fr: Voir aussi :term:`paquet`.

source: module spec
fr: spécificateur de module

source: A namespace containing the import-related information used to load a module. An instance of :class:`importlib.machinery.ModuleSpec`.
fr: Espace de noms contenant les informations, relatives à l'importation, utilisées pour charger un module. C'est une instance de la classe :class:`importlib.machinery.ModuleSpec`.

source: See :term:`method resolution order`.
fr: Voir :term:`ordre de résolution des méthodes`.

source: mutable
fr: muable

source: Mutable objects can change their value but keep their :func:`id`. See also :term:`immutable`.
fr: Un objet muable peut changer de valeur tout en gardant le même :func:`id`. Voir aussi :term:`immuable`.

source: named tuple
fr: n-uplet nommé

source: Any tuple-like class whose indexable elements are also accessible using named attributes (for example, :func:`time.localtime` returns a tuple-like object where the *year* is accessible either with an index such as ``t[0]`` or with a named attribute like ``t.tm_year``).
fr: (*named-tuple* en anglais) Classe qui, comme un *n-uplet* (*tuple* en anglais), a ses éléments accessibles par leur indice. Et en plus, les éléments sont accessibles par leur nom. Par exemple, :func:`time.localtime` donne un objet ressemblant à un *n-uplet*, dont *year* est accessible par son indice : ``t[0]`` ou par son nom : ``t.tm_year``).

source: A named tuple can be a built-in type such as :class:`time.struct_time`, or it can be created with a regular class definition. A full featured named tuple can also be created with the factory function :func:`collections.namedtuple`. The latter approach automatically provides extra features such as a self-documenting representation like ``Employee(name='jones', title='programmer')``.
fr: Un *n-uplet nommé* peut être un type natif tel que :class:`time.struct_time` ou il peut être construit comme une simple classe. Un *n-uplet nommé* complet peut aussi être créé via la fonction :func:`collections.namedtuple`. Cette dernière approche fournit automatiquement des fonctionnalités supplémentaires, tel qu'une représentation lisible comme ``Employee(name='jones', title='programmer')``.

source: namespace
fr: espace de noms

source: The place where a variable is stored. Namespaces are implemented as dictionaries. There are the local, global and built-in namespaces as well as nested namespaces in objects (in methods). Namespaces support modularity by preventing naming conflicts. For instance, the functions :func:`builtins.open <.open>` and :func:`os.open` are distinguished by their namespaces. Namespaces also aid readability and maintainability by making it clear which module implements a function. For instance, writing :func:`random.seed` or :func:`itertools.islice` makes it clear that those functions are implemented by the :mod:`random` and :mod:`itertools` modules, respectively.
fr: L'endroit où une variable est stockée. Les espaces de noms sont implémentés avec des dictionnaires. Il existe des espaces de noms globaux, natifs ou imbriqués dans les objets (dans les méthodes). Les espaces de noms favorisent la modularité car ils permettent d'éviter les conflits de noms. Par exemple, les fonctions :func:`builtins.open <.open>` et :func:`os.open` sont différenciées par leurs espaces de nom. Les espaces de noms aident aussi à la lisibilité et la maintenabilité en rendant clair quel module implémente une fonction. Par exemple, écrire :func:`random.seed` ou :func:`itertools.islice` affiche clairement que ces fonctions sont implémentées respectivement dans les modules :mod:`random` et :mod:`itertools`.

source: namespace package
fr: paquet-espace de noms

source: A :pep:`420` :term:`package` which serves only as a container for subpackages. Namespace packages may have no physical representation, and specifically are not like a :term:`regular package` because they have no ``__init__.py`` file.
fr: Un :term:`paquet` tel que défini dans la :pep:`421` qui ne sert qu'à contenir des sous-paquets. Les paquets-espace de noms peuvent n'avoir aucune représentation physique et, plus spécifiquement, ne sont pas comme un :term:`paquet classique` puisqu'ils n'ont pas de fichier ``__init__.py``.

source: See also :term:`module`.
fr: Voir aussi :term:`module`.

source: nested scope
fr: portée imbriquée

source: The ability to refer to a variable in an enclosing definition. For instance, a function defined inside another function can refer to variables in the outer function. Note that nested scopes by default work only for reference and not for assignment. Local variables both read and write in the innermost scope. Likewise, global variables read and write to the global namespace. The :keyword:`nonlocal` allows writing to outer scopes.
fr: Possibilité de faire référence à une variable déclarée dans une définition englobante. Typiquement, une fonction définie à l'intérieur d'une autre fonction a accès aux variables de cette dernière. Souvenez-vous cependant que cela ne fonctionne que pour accéder à des variables, pas pour les assigner. Les variables locales sont lues et assignées dans l'espace de noms le plus proche. Tout comme les variables globales qui sont stockés dans l'espace de noms global, le mot clef :keyword:`nonlocal` permet d'écrire dans l'espace de noms dans lequel est déclarée la variable.

source: new-style class
fr: nouvelle classe

source: Old name for the flavor of classes now used for all class objects. In earlier Python versions, only new-style classes could use Python's newer, versatile features like :attr:`~object.__slots__`, descriptors, properties, :meth:`__getattribute__`, class methods, and static methods.
fr: Ancien nom pour l'implémentation actuelle des classes, pour tous les objets. Dans les anciennes versions de Python, seules les nouvelles classes pouvaient utiliser les nouvelles fonctionnalités telles que :attr:`~object.__slots__`, les descripteurs, les propriétés, :meth:`__getattribute__`, les méthodes de classe et les méthodes statiques.

source: object
fr: objet

source: Any data with state (attributes or value) and defined behavior (methods). Also the ultimate base class of any :term:`new-style class`.
fr: N'importe quelle donnée comportant des états (sous forme d'attributs ou d'une valeur) et un comportement (des méthodes). C'est aussi (``object``) l'ancêtre commun à absolument toutes les :term:`nouvelles classes <new-style class>`.

source: package
fr: paquet

source: A Python :term:`module` which can contain submodules or recursively, subpackages. Technically, a package is a Python module with an ``__path__`` attribute.
fr: :term:`module` Python qui peut contenir des sous-modules ou des sous-paquets. Techniquement, un paquet est un module qui possède un attribut ``__path__``.

source: See also :term:`regular package` and :term:`namespace package`.
fr: Voir aussi :term:`paquet classique` et :term:`namespace package`.

source: parameter
fr: paramètre
