Repository: python/python-docs-fr
Catalog: glossary.po
Languages: fr

source: Type hints of global variables, class attributes, and functions, but not local variables, can be accessed using :func:`typing.get_type_hints`.
fr: Les indicateurs de type de variables globales, d'attributs de classe et de fonctions, mais pas de variables locales, peuvent être consultés en utilisant :func:`typing.get_type_hints`.

source: universal newlines
fr: retours à la ligne universels

source: A manner of interpreting text streams in which all of the following are recognized as ending a line: the Unix end-of-line convention ``'\n'``, the Windows convention ``'\r\n'``, and the old Macintosh convention ``'\r'``. See :pep:`278` and :pep:`3116`, as well as :func:`bytes.splitlines` for an additional use.
fr: Une manière d'interpréter des flux de texte dans lesquels sont reconnues toutes les fins de ligne suivantes : la convention Unix ``'\n'``, la convention Windows ``'\r\n'`` et l'ancienne convention Macintosh ``'\r'``. Voir la :pep:`278` et la :pep:`3116`, ainsi que la fonction :func:`bytes.splitlines` pour d'autres usages.

source: variable annotation
fr: annotation de variable

source: An :term:`annotation` of a variable or a class attribute.
fr: :term:`annotation` d'une variable ou d'un attribut de classe.

source: When annotating a variable or a class attribute, assignment is optional::
fr: Lorsque vous annotez une variable ou un attribut de classe, l'affectation est facultative ::

source: Variable annotations are usually used for :term:`type hints <type hint>`: for example this variable is expected to take :class:`int` values::
fr: Les annotations de variables sont généralement utilisées pour des :term:`indications de types <type hint>` : par exemple, cette variable devrait prendre des valeurs de type :class:`int` ::

source: Variable annotation syntax is explained in section :ref:`annassign`.
fr: La syntaxe d'annotation de la variable est expliquée dans la section :ref:`annassign`.

source: See :term:`function annotation`, :pep:`484` and :pep:`526`, which describe this functionality.
fr: Reportez-vous à :term:`function annotation`, à la :pep:` 484` et à la :pep:`526` qui décrivent cette fonctionnalité.

source: virtual environment
fr: environnement virtuel

source: A cooperatively isolated runtime environment that allows Python users and applications to install and upgrade Python distribution packages without interfering with the behaviour of other Python applications running on the same system.
fr: Environnement d'exécution isolé (en mode coopératif) qui permet aux utilisateurs de Python et aux applications d'installer et de mettre à jour des paquets sans interférer avec d'autres applications Python fonctionnant sur le même système.

source: See also :mod:`venv`.
fr: Voir aussi :mod:`venv`.

source: virtual machine
fr: machine virtuelle

source: A computer defined entirely in software. Python's virtual machine executes the :term:`bytecode` emitted by the bytecode compiler.
fr: Ordinateur défini entièrement par du logiciel. La machine virtuelle (*virtual machine*) de Python exécute le :term:`bytecode` produit par le compilateur de *bytecode*.

source: Zen of Python
fr: Le zen de Python

source: Listing of Python design principles and philosophies that are helpful in understanding and using the language. The listing can be found by typing "``import this``" at the interactive prompt.
fr: Liste de principes et de préceptes utiles pour comprendre et utiliser le langage. Cette liste peut être obtenue en tapant "``import this``" dans une invite Python interactive.
