Repository: python/python-docs-fr
Catalog: glossary.po
Languages: fr

source: An associative array, where arbitrary keys are mapped to values. The keys can be any object with :meth:`__hash__` and :meth:`__eq__` methods. Called a hash in Perl.
fr: Structure de donnée associant des clés à des valeurs. Les clés peuvent être n'importe quel objet possédant les méthodes :meth:`__hash__` et :meth:`__eq__`. En Perl, les dictionnaires sont appelés "*hash*".

source: dictionary view
fr: vue de dictionnaire

source: The objects returned from :meth:`dict.keys`, :meth:`dict.values`, and :meth:`dict.items` are called dictionary views. They provide a dynamic view on the dictionary’s entries, which means that when the dictionary changes, the view reflects these changes. To force the dictionary view to become a full list use ``list(dictview)``. See :ref:`dict-views`.
fr: Objets retournés par les méthodes :meth:`dict.keys`, :meth:`dict.values` et :meth:`dict.items`. Ils fournissent des vues dynamiques des entrées du dictionnaire, ce qui signifie que lorsque le dictionnaire change, la vue change. Pour transformer une vue en vraie liste, utilisez ``list(dictview)``. Voir :ref:`dict-views`.

source: A string literal which appears as the first expression in a class, function or module. While ignored when the suite is executed, it is recognized by the compiler and put into the :attr:`__doc__` attribute of the enclosing class, function or module. Since it is available via introspection, it is the canonical place for documentation of the object.
fr: Première chaîne littérale qui apparaît dans l'expression d'une classe, fonction, ou module. Bien qu'ignorée à l'exécution, elles est reconnue par le compilateur et placée dans l'attribut :attr:`__doc__` de la classe, de la fonction ou du module. Comme cette chaîne est disponible par introspection, c'est l'endroit idéal pour documenter l'objet.

source: A programming style which does not look at an object's type to determine if it has the right interface; instead, the method or attribute is simply called or used ("If it looks like a duck and quacks like a duck, it must be a duck.") By emphasizing interfaces rather than specific types, well-designed code improves its flexibility by allowing polymorphic substitution. Duck-typing avoids tests using :func:`type` or :func:`isinstance`. (Note, however, that duck-typing can be complemented with :term:`abstract base classes <abstract base class>`.) Instead, it typically employs :func:`hasattr` tests or :term:`EAFP` programming.
fr: Style de programmation qui ne prend pas en compte le type d'un objet pour déterminer s'il respecte une interface, mais qui appelle simplement la méthode ou l'attribut (*Si ça a un bec et que ça cancane, ça doit être un canard*, *duck* signifie canard en anglais). En se concentrant sur les interfaces plutôt que les types, du code bien construit améliore sa flexibilité en autorisant des substitutions polymorphiques. Le *duck-typing* évite de vérifier les types via :func:`type` ou :func:`isinstance`, Notez cependant que le *duck-typing* peut travailler de pair avec les :term:`classes de base abstraites <classe de base abstraite>`. À la place, le *duck-typing* utilise plutôt :func:`hasattr` ou la programmation :term:`EAFP`.

source: Easier to ask for forgiveness than permission. This common Python coding style assumes the existence of valid keys or attributes and catches exceptions if the assumption proves false. This clean and fast style is characterized by the presence of many :keyword:`try` and :keyword:`except` statements. The technique contrasts with the :term:`LBYL` style common to many other languages such as C.
fr: Il est plus simple de demander pardon que demander la permission (*Easier to Ask for Forgiveness than Permission* en anglais). Ce style de développement Python fait l'hypothèse que le code est valide et traite les exceptions si cette hypothèse s'avère fausse. Ce style, propre et efficace, est caractérisé par la présence de beaucoup de mots clés :keyword:`try` et :keyword:`except`. Cette technique de programmation contraste avec le style :term:`LBYL` utilisé couramment dans les langages tels que C.

source: A piece of syntax which can be evaluated to some value. In other words, an expression is an accumulation of expression elements like literals, names, attribute access, operators or function calls which all return a value. In contrast to many other languages, not all language constructs are expressions. There are also :term:`statement`\s which cannot be used as expressions, such as :keyword:`if`. Assignments are also statements, not expressions.
fr: Suite logique de termes et chiffres conformes à la syntaxe Python dont l'évaluation fournit une valeur. En d'autres termes, une expression est une suite d'éléments tels que des noms, opérateurs, littéraux, accès d'attributs, méthodes ou fonctions qui aboutissent à une valeur. Contrairement à beaucoup d'autres langages, les différentes constructions du langage ne sont pas toutes des expressions. On trouve également des :term:`instructions <statement>` qui ne peuvent pas être utilisées comme expressions, tel que :keyword:`if`. Les affectations sont également des instructions et non des expressions.

source: extension module
fr: module d'extension

source: A module written in C or C++, using Python's C API to interact with the core and with user code.
fr: Module écrit en C ou C++, utilisant l'API C de Python pour interagir avec Python et le code de l'utilisateur.

source: String literals prefixed with ``'f'`` or ``'F'`` are commonly called "f-strings" which is short for :ref:`formatted string literals <f-strings>`. See also :pep:`498`.
fr: Chaîne littérale préfixée de ``'f'`` ou ``'F'``. Les "f-strings" sont un raccourci pour :ref:`formatted string literals <f-strings>`. Voir la :pep:`498`.

source: file object
fr: objet fichier

source: An object exposing a file-oriented API (with methods such as :meth:`read()` or :meth:`write()`) to an underlying resource. Depending on the way it was created, a file object can mediate access to a real on-disk file or to another type of storage or communication device (for example standard input/output, in-memory buffers, sockets, pipes, etc.). File objects are also called :dfn:`file-like objects` or :dfn:`streams`.
fr: Objet exposant une ressource via une API orientée fichier (avec les méthodes :meth:`read()` ou :meth:`write()`). En fonction de la manière dont il a été créé, un objet fichier peut interfacer l'accès à un fichier sur le disque ou à un autre type de stockage ou de communication (typiquement l'entrée standard, la sortie standard, un tampon en mémoire, une socket réseau, ...). Les objets fichiers sont aussi appelés :dfn:`file-like-objects` ou :dfn:`streams`.

source: There are actually three categories of file objects: raw :term:`binary files <binary file>`, buffered :term:`binary files <binary file>` and :term:`text files <text file>`. Their interfaces are defined in the :mod:`io` module. The canonical way to create a file object is by using the :func:`open` function.
fr: Il existe en réalité trois catégories de fichiers objets : les :term:`fichiers binaires <fichier binaire>` bruts, les :term:`fichiers binaires <fichier binaire>` avec tampon (*buffer*) et les :term:`fichiers textes <fichier texte>`. Leurs interfaces sont définies dans le module :mod:`io`. Le moyen le plus simple et direct de créer un objet fichier est d'utiliser la fonction :func:`open`.

source: file-like object
fr: objet fichier-compatible

source: A synonym for :term:`file object`.
fr: Synonyme de :term:`objet fichier`.

source: finder
fr: chercheur

source: An object that tries to find the :term:`loader` for a module that is being imported.
fr: Objet qui essaie de trouver un :term:`chargeur <loader>` pour le module en cours d'importation.

source: Since Python 3.3, there are two types of finder: :term:`meta path finders <meta path finder>` for use with :data:`sys.meta_path`, and :term:`path entry finders <path entry finder>` for use with :data:`sys.path_hooks`.
fr: Depuis Python 3.3, il existe deux types de chercheurs : les :term:`chercheurs dans les méta-chemins <meta path finder>` à utiliser avec :data:`sys.meta_path` ; les :term:`chercheurs d'entrée dans path <path entry finder>` à utiliser avec :data:`sys.path_hooks`.

source: See :pep:`302`, :pep:`420` and :pep:`451` for much more detail.
fr: Voir les :pep:`302`, :pep:`420` et :pep:`451` pour plus de détails.

source: floor division
fr: division entière

source: Mathematical division that rounds down to nearest integer. The floor division operator is ``//``. For example, the expression ``11 // 4`` evaluates to ``2`` in contrast to the ``2.75`` returned by float true division. Note that ``(-11) // 4`` is ``-3`` because that is ``-2.75`` rounded *downward*. See :pep:`238`.
fr: Division mathématique arrondissant à l'entier inférieur. L'opérateur de la division entière est ``//``. Par exemple l'expression ``11 // 4`` vaut ``2``, contrairement à ``11 / 4`` qui vaut ``2.75``. Notez que ``(-11) // 4`` vaut ``-3`` car l'arrondi se fait à l'entier inférieur. Voir la :pep:`328`.

source: function
fr: fonction

source: A series of statements which returns some value to a caller. It can also be passed zero or more :term:`arguments <argument>` which may be used in the execution of the body. See also :term:`parameter`, :term:`method`, and the :ref:`function` section.
fr: Suite d'instructions qui renvoie une valeur à son appelant. On peut lui passer des :term:`arguments <argument>` qui pourront être utilisés dans le corps de la fonction. Voir aussi :term:`paramètre`, :term:`méthode` et :ref:`function`.

source: function annotation
fr: annotation de fonction

source: An :term:`annotation` of a function parameter or return value.
fr: :term:`annotation` d'un paramètre de fonction ou valeur de retour

source: Function annotation syntax is explained in section :ref:`function`.
fr: L'annotation syntaxique de la fonction est expliquée dans la section :ref:`function`.

source: See :term:`variable annotation` and :pep:`484`, which describe this functionality.
fr: Voir :term:`variable annotation` et :pep:` 484`, qui décrivent cette fonctionnalité.

source: A pseudo-module which programmers can use to enable new language features which are not compatible with the current interpreter.
fr: Pseudo-module que les développeurs peuvent utiliser pour activer de nouvelles fonctionnalités du langage qui ne sont pas compatibles avec l'interpréteur utilisé.

source: By importing the :mod:`__future__` module and evaluating its variables, you can see when a new feature was first added to the language and when it becomes the default::
fr: En important le module :mod:`__future__` et en affichant ses variables, vous pouvez voir à quel moment une nouvelle fonctionnalité a été rajoutée dans le langage et quand elle devient le comportement par défaut : ::

source: garbage collection
fr: ramasse-miettes

source: The process of freeing memory when it is not used anymore. Python performs garbage collection via reference counting and a cyclic garbage collector that is able to detect and break reference cycles. The garbage collector can be controlled using the :mod:`gc` module.
fr: (*garbage collection* en anglais) Mécanisme permettant de libérer de la mémoire lorsqu'elle n'est plus utilisée. Python utilise un ramasse-miettes par comptage de référence et un ramasse-miettes cyclique capable de détecter et casser les références circulaires. Le ramasse-miettes peut être contrôlé en utilisant le module :mod:`gc`.

source: generator
fr: générateur

source: A function which returns a :term:`generator iterator`. It looks like a normal function except that it contains :keyword:`yield` expressions for producing a series of values usable in a for-loop or that can be retrieved one at a time with the :func:`next` function.
fr: Fonction qui renvoie un :term:`itérateur de générateur`. Cela ressemble à une fonction normale, en dehors du fait qu'elle contient une ou des expressions :keyword:`yield` produisant une série de valeurs utilisable dans une boucle *for* ou récupérées une à une via la fonction :func:`next`.

source: Usually refers to a generator function, but may refer to a *generator iterator* in some contexts. In cases where the intended meaning isn't clear, using the full terms avoids ambiguity.
fr: Fait généralement référence à une fonction générateur mais peut faire référence à un *itérateur de générateur* dans certains contextes. Dans les cas où le sens voulu n'est pas clair, utiliser les termes complets lève l’ambigüité.

source: generator iterator
fr: itérateur de générateur

source: An object created by a :term:`generator` function.
fr: Objet créé par une fonction :term:`générateur`.

source: Each :keyword:`yield` temporarily suspends processing, remembering the location execution state (including local variables and pending try-statements). When the *generator iterator* resumes, it picks up where it left off (in contrast to functions which start fresh on every invocation).
fr: Chaque :keyword:`yield` suspend temporairement l'exécution, en se rappelant l'endroit et l'état de l'exécution (y compris les variables locales et les *try* en cours). Lorsque l'itérateur de générateur reprend, il repart là où il en était (contrairement à une fonction qui prendrait un nouveau départ à chaque invocation).

source: generator expression
fr: expression génératrice

source: An expression that returns an iterator. It looks like a normal expression followed by a :keyword:`for` expression defining a loop variable, range, and an optional :keyword:`if` expression. The combined expression generates values for an enclosing function::
fr: Expression qui donne un itérateur. Elle ressemble à une expression normale, suivie d'une expression :keyword:`for` définissant une variable de boucle, un intervalle et une expression :keyword:`if` optionnelle. Toute cette expression génère des valeurs pour la fonction qui l'entoure : ::

source: generic function
fr: fonction générique

source: A function composed of multiple functions implementing the same operation for different types. Which implementation should be used during a call is determined by the dispatch algorithm.
fr: Fonction composée de plusieurs fonctions implémentant les mêmes opérations pour différents types. L'implémentation à utiliser est déterminée lors de l'appel par l'algorithme de répartition.

source: See also the :term:`single dispatch` glossary entry, the :func:`functools.singledispatch` decorator, and :pep:`443`.
fr: Voir aussi :term:`single dispatch`, le décorateur :func:`functools.singledispatch` et la :pep:`443`.

source: See :term:`global interpreter lock`.
fr: Voir :term:`global interpreter lock`.

source: global interpreter lock
fr: verrou global de l'interpréteur

source: The mechanism used by the :term:`CPython` interpreter to assure that only one thread executes Python :term:`bytecode` at a time. This simplifies the CPython implementation by making the object model (including critical built-in types such as :class:`dict`) implicitly safe against concurrent access. Locking the entire interpreter makes it easier for the interpreter to be multi-threaded, at the expense of much of the parallelism afforded by multi-processor machines.
fr: (*global interpreter lock* en anglais) Mécanisme utilisé par l'interpréteur :term:`CPython` pour s'assurer qu'un seul fil d'exécution (*thread* en anglais) n'exécute le :term:`bytecode` à la fois. Cela simplifie l'implémentation de CPython en rendant le modèle objet (incluant des parties critiques comme la classe native :class:`dict`) implicitement protégé contre les accès concourants. Verrouiller l'interpréteur entier rend plus facile l'implémentation de multiples fils d'exécution (*multi-thread* en anglais), au détriment malheureusement de beaucoup du parallélisme possible sur les machines ayant plusieurs processeurs.

source: However, some extension modules, either standard or third-party, are designed so as to release the GIL when doing computationally-intensive tasks such as compression or hashing. Also, the GIL is always released when doing I/O.
fr: Cependant, certains modules d'extension, standards ou non, sont conçus de manière à libérer le GIL lorsqu'ils effectuent des tâches lourdes tel que la compression ou le hachage. De la même manière, le GIL est toujours libéré lors des entrées / sorties.

source: Past efforts to create a "free-threaded" interpreter (one which locks shared data at a much finer granularity) have not been successful because performance suffered in the common single-processor case. It is believed that overcoming this performance issue would make the implementation much more complicated and therefore costlier to maintain.
fr: Les tentatives précédentes d'implémenter un interpréteur Python avec une granularité de verrouillage plus fine ont toutes échouées, à cause de leurs mauvaises performances dans le cas d'un processeur unique. Il est admis que corriger ce problème de performance induit mènerait à une implémentation beaucoup plus compliquée et donc plus coûteuse à maintenir.

source: hash-based pyc
fr: *pyc* utilisant le hachage

source: A bytecode cache file that uses the hash rather than the last-modified time of the corresponding source file to determine its validity. See :ref:`pyc-invalidation`.
fr: Un fichier de cache de code intermédiaire (*bytecode* en anglais) qui utilise le hachage plutôt que l'heure de dernière modification du fichier source correspondant pour déterminer sa validité. Voir :ref:`pyc-invalidation`.

source: hashable
fr: hachable

source: An object is *hashable* if it has a hash value which never changes during its lifetime (it needs a :meth:`__hash__` method), and can be compared to other objects (it needs an :meth:`__eq__` method). Hashable objects which compare equal must have the same hash value.
fr: Un objet est *hachable* s'il a une empreinte (*hash*) qui ne change jamais (il doit donc implémenter une méthode :meth:`__hash__`) et s'il peut être comparé à d'autres objets (avec la méthode :meth:`__eq__`). Les objets hachables dont la comparaison par ``__eq__`` est vraie doivent avoir la même empreinte.

source: Hashability makes an object usable as a dictionary key and a set member, because these data structures use the hash value internally.
fr: La hachabilité permet à un objet d'être utilisé comme clé de dictionnaire ou en tant que membre d'un ensemble (type *set*), car ces structures de données utilisent ce *hash*.

source: All of Python's immutable built-in objects are hashable; mutable containers (such as lists or dictionaries) are not. Objects which are instances of user-defined classes are hashable by default. They all compare unequal (except with themselves), and their hash value is derived from their :func:`id`.
fr: Tous les types immuables natifs de Python sont hachables, mais les conteneurs muables (comme les listes ou les dictionnaires) ne le sont pas. Toutes les instances de classes définies par les utilisateurs sont hachables par défaut. Elles sont toutes considérées différentes (sauf avec elles-mêmes) et leur valeur de hachage est calculée à partir de leur :func:`id`.

source: An Integrated Development Environment for Python. IDLE is a basic editor and interpreter environment which ships with the standard distribution of Python.
fr: Environnement de développement intégré pour Python. IDLE est un éditeur basique et un interpréteur livré avec la distribution standard de Python.

source: immutable
fr: immuable

source: An object with a fixed value. Immutable objects include numbers, strings and tuples. Such an object cannot be altered. A new object has to be created if a different value has to be stored. They play an important role in places where a constant hash value is needed, for example as a key in a dictionary.
fr: Objet dont la valeur ne change pas. Les nombres, les chaînes et les n-uplets sont immuables. Ils ne peuvent être modifiés. Un nouvel objet doit être créé si une valeur différente doit être stockée. Ils jouent un rôle important quand une valeur de *hash* constante est requise, typiquement en clé de dictionnaire.

source: import path
fr: chemin des imports

source: A list of locations (or :term:`path entries <path entry>`) that are searched by the :term:`path based finder` for modules to import. During import, this list of locations usually comes from :data:`sys.path`, but for subpackages it may also come from the parent package's ``__path__`` attribute.
fr: Liste de :term:`entrées <path entry>` dans lesquelles le :term:`chercheur basé sur les chemins <path based finder>` cherche les modules à importer. Typiquement, lors d'une importation, cette liste vient de :data:`sys.path` ; pour les sous-paquets, elle peut aussi venir de l'attribut ``__path__`` du paquet parent.

source: importing
fr: importer

source: The process by which Python code in one module is made available to Python code in another module.
fr: Processus rendant le code Python d'un module disponible dans un autre.

source: importer
fr: importateur

source: An object that both finds and loads a module; both a :term:`finder` and :term:`loader` object.
fr: Objet qui trouve et charge un module, en même temps un :term:`chercheur <finder>` et un :term:`chargeur <loader>`.

source: interactive
fr: interactif

source: Python has an interactive interpreter which means you can enter statements and expressions at the interpreter prompt, immediately execute them and see their results. Just launch ``python`` with no arguments (possibly by selecting it from your computer's main menu). It is a very powerful way to test out new ideas or inspect modules and packages (remember ``help(x)``).
fr: Python a un interpréteur interactif, ce qui signifie que vous pouvez écrire des expressions et des instructions à l'invite de l'interpréteur. L'interpréteur Python va les exécuter immédiatement et vous en présenter le résultat. Démarrez juste ``python`` (probablement depuis le menu principal de votre ordinateur). C'est un moyen puissant pour tester de nouvelles idées ou étudier de nouveaux modules (souvenez-vous de ``help(x)``).

source: interpreted
fr: interprété

source: Python is an interpreted language, as opposed to a compiled one, though the distinction can be blurry because of the presence of the bytecode compiler. This means that source files can be run directly without explicitly creating an executable which is then run. Interpreted languages typically have a shorter development/debug cycle than compiled ones, though their programs generally also run more slowly. See also :term:`interactive`.
fr: Python est un langage interprété, en opposition aux langages compilés, bien que la frontière soit floue en raison de la présence d'un compilateur en code intermédiaire. Cela signifie que les fichiers sources peuvent être exécutés directement, sans avoir à compiler un fichier exécutable intermédiaire. Les langages interprétés ont généralement un cycle de développement / débogage plus court que les langages compilés. Cependant, ils s'exécutent généralement plus lentement. Voir aussi :term:`interactif`.

source: interpreter shutdown
fr: arrêt de l'interpréteur
