Repository: python/python-docs-fr
Catalog: license.po
Languages: fr

source: History and License
fr: Histoire et licence

source: History of the software
fr: Histoire du logiciel

source: Python was created in the early 1990s by Guido van Rossum at Stichting Mathematisch Centrum (CWI, see https://www.cwi.nl/) in the Netherlands as a successor of a language called ABC. Guido remains Python's principal author, although it includes many contributions from others.
fr: Python a été créé au début des années 1990 par Guido van Rossum, au Stichting Mathematisch Centrum (CWI, voir https://www.cwi.nl/) aux Pays-Bas en tant que successeur d'un langage appelé ABC. Guido est l'auteur principal de Python, bien qu'il inclut de nombreuses contributions de la part d'autres personnes.

source: In 1995, Guido continued his work on Python at the Corporation for National Research Initiatives (CNRI, see https://www.cnri.reston.va.us/) in Reston, Virginia where he released several versions of the software.
fr: En 1995, Guido continua son travail sur Python au Corporation for National Research Initiatives (CNRI, voir https://www.cnri.reston.va.us/) de Reston, en Viriginie, d'où il diffusa plusieurs versions du logiciel.

source: In May 2000, Guido and the Python core development team moved to BeOpen.com to form the BeOpen PythonLabs team. In October of the same year, the PythonLabs team moved to Digital Creations (now Zope Corporation; see https://www.zope.org/). In 2001, the Python Software Foundation (PSF, see https://www.python.org/psf/) was formed, a non-profit organization created specifically to own Python-related Intellectual Property. Zope Corporation is a sponsoring member of the PSF.
fr: En mai 2000, Guido et l'équipe de développement centrale de Python sont partis vers BeOpen.com pour former l'équipe BeOpen PythonLabs. En octobre de la même année, l'équipe de PythonLabs est partie vers Digital Creations (désormais Zope Corporation ; voir https://www.zope.com/). En 2001, la Python Software Foundation (PSF, voir https://www.python.org/psf/) voit le jour. Il s'agit d'une organisation à but non lucratif détenant les droits de propriété intellectuelle de Python. Zope Corporation en est un sponsor.

source: All Python releases are Open Source (see https://opensource.org/ for the Open Source Definition). Historically, most, but not all, Python releases have also been GPL-compatible; the table below summarizes the various releases.
fr: Toutes les versions de Python sont Open Source (voir https://www.opensource.org/ pour la définition d'Open Source). Historiquement, la plupart, mais pas toutes, des versions de Python ont également été compatible avec la GPL, le tableau ci-dessous résume les différentes versions.

source: Release
fr: Version

source: Derived from
fr: Dérivé de

source: Year
fr: Année

source: Owner
fr: Propriétaire

source: GPL compatible?
fr: Compatible avec la GPL ?

source: 0.9.0 thru 1.2
fr: 0.9.0 à 1.2

source: yes
fr: oui

source: 1.3 thru 1.5.2
fr: 1.3 à 1.5.2

source: no
fr: non

source: 2.2 and above
fr: 2.2 et ultérieure

source: 2001-now
fr: 2001-maintenant

source: GPL-compatible doesn't mean that we're distributing Python under the GPL. All Python licenses, unlike the GPL, let you distribute a modified version without making your changes open source. The GPL-compatible licenses make it possible to combine Python with other software that is released under the GPL; the others don't.
fr: Compatible GPL ne signifie pas que nous distribuons Python sous licence GPL. Toutes les licences Python, excepté la licence GPL, vous permettent la distribution d'une version modifiée sans rendre open source ces changements. La licence « compatible GPL » rend possible la diffusion de Python avec un autre logiciel qui est lui, diffusé sous la licence GPL ; les licences « non-compatibles GPL » ne le peuvent pas.

source: Thanks to the many outside volunteers who have worked under Guido's direction to make these releases possible.
fr: Merci aux nombreux bénévoles qui ont travaillé sous la direction de Guido pour rendre ces versions possibles.

source: Terms and conditions for accessing or otherwise using Python
fr: Conditions générales pour accéder à, ou utiliser, Python

source: Python software and documentation are licensed under the :ref:`PSF License Agreement <PSF-license>`.
fr: Le logiciel Python et sa documentation sont distribués sous :ref:`la licence d'utilisation PSF <PSF-license>`.

source: Starting with Python 3.8.6, examples, recipes, and other code in the documentation are dual licensed under the PSF License Agreement and the :ref:`Zero-Clause BSD license <BSD0>`.
fr: Depuis Python 3.8.6, les exemples, recettes et autres codes présents dans la documentation sont sous la double licence d'utilisation PSF et :ref:`la licence Zero-Clause BSD <BSD0>`.

source: Some software incorporated into Python is under different licenses. The licenses are listed with code falling under that license. See :ref:`OtherLicenses` for an incomplete list of these licenses.
fr: Certains logiciels faisant partie de Python sont soumis à d'autres licences. Ces licences sont incluses avec le code lié à celles-ci. Voir :ref:`OtherLicenses` pour une liste non exhaustive de ces licences.

source: BEOPEN.COM LICENSE AGREEMENT FOR PYTHON 2.0
fr: LICENCE D'UTILISATION BEOPEN.COM POUR PYTHON 2.0

source: BEOPEN PYTHON OPEN SOURCE LICENSE AGREEMENT VERSION 1
fr: LICENCE D'UTILISATION LIBRE BEOPEN PYTHON VERSION 1

source: CNRI LICENSE AGREEMENT FOR PYTHON 1.6.1
fr: LICENCE D'UTILISATION CNRI POUR PYTHON 1.6.1

source: CWI LICENSE AGREEMENT FOR PYTHON 0.9.0 THROUGH 1.2
fr: LICENCE D'UTILISATION CWI POUR PYTHON 0.9.0 à 1.2

source: ZERO-CLAUSE BSD LICENSE FOR CODE IN THE PYTHON |release| DOCUMENTATION
fr: LICENCE BSD ZERO-CLAUSE POUR LE CODE DANS LA DOCUMENTATION DE PYTHON |release|

source: Licenses and Acknowledgements for Incorporated Software
fr: Licences et remerciements pour les logiciels tiers

source: This section is an incomplete, but growing list of licenses and acknowledgements for third-party software incorporated in the Python distribution.
fr: Cette section est une liste incomplète mais grandissante de licences et remerciements pour les logiciels tiers incorporés dans la distribution de Python.

source: The :mod:`_random` module includes code based on a download from http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/MT2002/emt19937ar.html. The following are the verbatim comments from the original code::
fr: Le module :mod:`_random` inclut du code construit à partir d'un téléchargement depuis http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/MT2002/emt19937ar.html. Voici mot pour mot les commentaires du code original ::

source: Sockets
fr: Interfaces de connexion (*sockets*)

source: Asynchronous socket services
fr: Interfaces de connexion asynchrones

source: The :mod:`asynchat` and :mod:`asyncore` modules contain the following notice::
fr: Les modules :mod:`asynchat` et :mod:`asyncore` contiennent la note suivante ::

source: Cookie management
fr: Gestion de témoin (*cookie*)

source: The :mod:`http.cookies` module contains the following notice::
fr: Le module :mod:`http.cookies` contient la note suivante ::

source: Execution tracing
fr: Traçage d'exécution

source: The :mod:`trace` module contains the following notice::
fr: Le module :mod:`trace` contient la note suivante ::

source: UUencode and UUdecode functions
fr: Les fonctions UUencode et UUdecode

source: The :mod:`uu` module contains the following notice::
fr: Le module :mod:`uu` contient la note suivante ::

source: XML Remote Procedure Calls
fr: Appel de procédures distantes en XML (*RPC*, pour *Remote Procedure Call*)

source: The :mod:`xmlrpc.client` module contains the following notice::
fr: Le module :mod:`xmlrpc.client` contient la note suivante ::

source: The :mod:`test_epoll` module contains the following notice::
fr: Le module :mod:`test_epoll` contient la note suivante ::

source: The :mod:`select` module contains the following notice for the kqueue interface::
fr: Le module :mod:`select` contient la note suivante pour l'interface *kqueue* ::

source: The file :file:`Python/pyhash.c` contains Marek Majkowski' implementation of Dan Bernstein's SipHash24 algorithm. It contains the following note::
fr: Le fichier :file:`Python/pyhash.c` contient une implémentation par Marek Majkowski de l'algorithme *SipHash24* de Dan Bernstein. Il contient la note suivante ::

source: strtod and dtoa
fr: *strtod* et *dtoa*

source: The modules :mod:`hashlib`, :mod:`posix`, :mod:`ssl`, :mod:`crypt` use the OpenSSL library for added performance if made available by the operating system. Additionally, the Windows and macOS installers for Python may include a copy of the OpenSSL libraries, so we include a copy of the OpenSSL license here::
fr: Les modules :mod:`hashlib`, :mod:`posix`, :mod:`ssl`, et :mod:`crypt` utilisent la bibliothèque OpenSSL pour améliorer les performances, si elle est disponible via le système d'exploitation. Aussi les outils d'installation sur Windows et macOS peuvent inclure une copie des bibliothèques d'OpenSSL, donc on colle une copie de la licence d'OpenSSL ici ::

source: The :mod:`pyexpat` extension is built using an included copy of the expat sources unless the build is configured ``--with-system-expat``::
fr: Le module :mod:`pyexpat` est compilé avec une copie des sources d'*expat*, sauf si la compilation est configurée avec ``--with-system-expat`` ::

source: The :mod:`_ctypes` extension is built using an included copy of the libffi sources unless the build is configured ``--with-system-libffi``::
fr: Le module :mod:`_ctypes` est compilé en utilisant une copie des sources de la *libffi*, sauf si la compilation est configurée avec ``--with-system-libffi`` ::

source: The :mod:`zlib` extension is built using an included copy of the zlib sources if the zlib version found on the system is too old to be used for the build::
fr: Le module :mod:`zlib` est compilé en utilisant une copie du code source de *zlib* si la version de *zlib* trouvée sur le système est trop vieille pour être utilisée ::

source: The implementation of the hash table used by the :mod:`tracemalloc` is based on the cfuhash project::
fr: L'implémentation des dictionnaires, utilisée par le module :mod:`tracemalloc` est basée sur le projet *cfuhash* ::

source: The :mod:`_decimal` module is built using an included copy of the libmpdec library unless the build is configured ``--with-system-libmpdec``::
fr: Le module :mod:`_decimal` est construit en incluant une copie de la bibliothèque *libmpdec*, sauf si elle est compilée avec ``--with-system-libmpdec`` ::

source: W3C C14N test suite
fr: Ensemble de tests C14N du W3C

source: The C14N 2.0 test suite in the :mod:`test` package (``Lib/test/xmltestdata/c14n-20/``) was retrieved from the W3C website at https://www.w3.org/TR/xml-c14n2-testcases/ and is distributed under the 3-clause BSD license::
fr: Les tests de C14N version 2.0 du module :mod:`test` (``Lib/test/xmltestdata/c14n-20/``) proviennent du site du W3C à l'adresse https://www.w3.org/TR/xml-c14n2-testcases/ et sont distribués sous licence BSD modifiée :
