Repository: python/python-docs-fr
Catalog: sphinx.po
Languages: fr

source: This Page
fr: Cette page

source: Report a Bug
fr: Signalement de bogue

source: Show Source
fr: Voir la source

source: CPython implementation detail:
fr: Particularité de l'implémentation CPython :

source: Deprecated since version {deprecated}, will be removed in version {removed}
fr: Obsolète depuis la version {deprecated}, sera supprimé dans la version {removed}

source: Deprecated since version {deprecated}, removed in version {removed}
fr: Obsolète depuis la version {deprecated}, supprimé dans la version {removed}

source: Welcome! This is the documentation for Python %(release)s.
fr: Bienvenue sur la documentation de Python %(release)s.

source: Parts of the documentation:
fr: La documentation :

source: What's new in Python %(version)s?
fr: Les nouveautés de Python %(version)s

source: or <a href="%(whatsnew_index)s">all "What's new" documents</a> since 2.0
fr: ou <a href="%(whatsnew_index)s">toutes les nouveautés</a> depuis la 2.0

source: Tutorial
fr: Tutoriel

source: start here
fr: démarrez ici

source: Library Reference
fr: Référence de la bibliothèque

source: keep this under your pillow
fr: gardez-ça sous votre oreiller

source: Language Reference
fr: Référence du langage

source: describes syntax and language elements
fr: décrit la syntaxe et les éléments du langage

source: Python Setup and Usage
fr: Installation et utilisation de Python

source: how to use Python on different platforms
fr: utilisation de Python sur différentes plateformes

source: Python HOWTOs
fr: Les HOWTOs de Python

source: in-depth documents on specific topics
fr: documents explorant certains sujets en profondeur

source: Installing Python Modules
fr: Installation de modules Python

source: installing from the Python Package Index &amp; other sources
fr: installation depuis le *Python Package Index* ou d'autres sources

source: Distributing Python Modules
fr: Distribuer des modules Python

source: publishing modules for installation by others
fr: publier des modules pour que d'autres puissent les installer

source: Extending and Embedding
fr: Amélioration et intégration

source: tutorial for C/C++ programmers
fr: tutoriel pour les développeurs C/C++

source: reference for C/C++ programmers
fr: référence pour les développeurs C/C++

source: frequently asked questions (with answers!)
fr: foire aux questions (avec les réponses !)

source: Indices and tables:
fr: Index et tables des matières :

source: Global Module Index
fr: Index global des modules

source: quick access to all modules
fr: accès rapide à tous les modules

source: General Index
fr: Index général

source: all functions, classes, terms
fr: toutes les fonctions, classes et termes

source: Glossary
fr: Glossaire

source: the most important terms explained
fr: explication des mots les plus importants

source: Search page
fr: Page de recherche

source: search this documentation
fr: recherche dans cette documentation

source: Complete Table of Contents
fr: Table des matières complète

source: lists all sections and subsections
fr: liste complète des sections et sous-sections

source: Meta information:
fr: Méta informations :

source: Reporting bugs
fr: Signalement de bogue

source: Contributing to Docs
fr: Contribuer à la documentation

source: About the documentation
fr: À propos de la documentation

source: History and License of Python
fr: Histoire et licence de Python

source: Download
fr: Téléchargement

source: Download these documents
fr: Téléchargement de ces documentations

source: Docs by version
fr: Docs par version

source: Python 3.10 (in development)
fr: Python 3.10 (en développement)

source: Python 3.9 (pre-release)
fr: Python 3.9 (pré-lancement)

source: Python 3.6 (security-fixes)
fr: Python 3.6 (correctifs de sécurité)

source: Python 3.5 (security-fixes)
fr: Python 3.5 (correctifs de sécurité)

source: Python 2.7 (EOL)
fr: Python 2.7 (en fin de vie)

source: All versions
fr: Toutes les versions

source: Other resources
fr: Autres ressources

source: PEP Index
fr: Index des PEP

source: Beginner's Guide
fr: Guide du débutant

source: Book List
fr: Liste de livres

source: Audio/Visual Talks
fr: Documents multimédia

source: Python Developer’s Guide
fr: Guide du développeur Python

source: This document is for an old version of Python that is no longer supported. You should upgrade, and read the
fr: Ce document est relatif à une vieille version de Python qui n'est plus soutenue. Mettez à jour votre version et lisez

source: Python documentation for the current stable release
fr: Bienvenue sur la documentation de la version stable actuelle de Python
