Repository: python/python-docs-fr
Catalog: extending/extending.po
Languages: fr

source: Extending Python with C or C++
fr: Étendre Python en C ou C++

source: It is quite easy to add new built-in modules to Python, if you know how to program in C. Such :dfn:`extension modules` can do two things that can't be done directly in Python: they can implement new built-in object types, and they can call C library functions and system calls.
fr: Il est relativement facile d'ajouter de nouveaux modules à Python, si vous savez programmer en C. Ces :dfn:`<modules d'extension> extension modules` permettent deux choses qui ne sont pas possibles directement en Python : Elles peuvent définir de nouveaux types natifs, et peuvent appeler des fonctions de bibliothèques C ou faire des appels systèmes.

source: To support extensions, the Python API (Application Programmers Interface) defines a set of functions, macros and variables that provide access to most aspects of the Python run-time system. The Python API is incorporated in a C source file by including the header ``"Python.h"``.
fr: Pour gérer les extensions, l'API Python (*Application Programmer Interface*) définit un ensemble de fonctions, macros et variables qui donnent accès à la plupart des aspects du système d'exécution de Python. L'API Python est incorporée dans un fichier source C en incluant l'en-tête ``"Python.h"``.

source: The compilation of an extension module depends on its intended use as well as on your system setup; details are given in later chapters.
fr: La compilation d'un module d'extension dépend de l'usage prévu et de la configuration du système, plus de détails peuvent être trouvés dans les chapitres suivants.

source: The C extension interface is specific to CPython, and extension modules do not work on other Python implementations. In many cases, it is possible to avoid writing C extensions and preserve portability to other implementations. For example, if your use case is calling C library functions or system calls, you should consider using the :mod:`ctypes` module or the `cffi <https://cffi.readthedocs.io/>`_ library rather than writing custom C code. These modules let you write Python code to interface with C code and are more portable between implementations of Python than writing and compiling a C extension module.
fr: L'interface d'extension C est spécifique à *CPython*, et les modules d'extension ne fonctionne pas sur les autres implémentations de Python. Dans de nombreux cas, il est possible d'éviter la rédaction des extensions en C et ainsi préserver la portabilité vers d'autres implémentations. Par exemple, si vous devez appeler une fonction de la bibliothèque C ou faire un appel système, vous devriez envisager d'utiliser le module :mod:`ctypes` ou d'utiliser la bibliothèque `*cffi* <https://cffi.readthedocs.io/>`_ plutôt que d'écrire du code C sur mesure. Ces modules vous permettent d'écrire du code Python s'interfaçant avec le code C et sont plus portables entre les implémentations de Python que l'écriture et la compilation d'une d'extension C.

source: A Simple Example
fr: Un exemple simple

source: Let's create an extension module called ``spam`` (the favorite food of Monty Python fans...) and let's say we want to create a Python interface to the C library function :c:func:`system` [#]_. This function takes a null-terminated character string as argument and returns an integer. We want this function to be callable from Python as follows:
fr: Créons un module d'extension appelé ``spam`` (la nourriture préférée de fans des *Monty Python* …) et disons que nous voulons créer une interface Python à la fonction de la bibliothèque C :c:func:`system` [#]_. Cette fonction prend une chaîne de caractères à terminaison nulle comme argument et renvoie un entier. Nous voulons que cette fonction soit appelable à partir de Python comme suit :

source: Begin by creating a file :file:`spammodule.c`. (Historically, if a module is called ``spam``, the C file containing its implementation is called :file:`spammodule.c`; if the module name is very long, like ``spammify``, the module name can be just :file:`spammify.c`.)
fr: Commencez par créer un fichier :file:`spammodule.c`. (Historiquement, si un module se nomme ``spam``, le fichier C contenant son implémentation est appelé :file:`spammodule.c`. Si le nom du module est très long, comme ``spammify``, le nom du module peut être juste :file:`spammify.c`.)

source: The first two lines of our file can be::
fr: Les deux premières lignes de notre fichier peuvent être ::

source: which pulls in the Python API (you can add a comment describing the purpose of the module and a copyright notice if you like).
fr: qui récupère l'API Python (vous pouvez ajouter un commentaire décrivant le but du module et un avis de droit d'auteur si vous le souhaitez).

source: Since Python may define some pre-processor definitions which affect the standard headers on some systems, you *must* include :file:`Python.h` before any standard headers are included.
fr: Python pouvant définir certaines définitions pré-processeur qui affectent les têtes standard sur certains systèmes, vous *devez* inclure :file:`Python.h` avant les en-têtes standards.

source: It is recommended to always define ``PY_SSIZE_T_CLEAN`` before including ``Python.h``. See :ref:`parsetuple` for a description of this macro.
fr: Il est recommandé de toujours définir ``PY_SSIZE_T_CLEAN`` avant d'inclure ``Python.h``. Lisez :ref:`parsetuple` pour avoir une description de cette macro.

source: All user-visible symbols defined by :file:`Python.h` have a prefix of ``Py`` or ``PY``, except those defined in standard header files. For convenience, and since they are used extensively by the Python interpreter, ``"Python.h"`` includes a few standard header files: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, and ``<stdlib.h>``. If the latter header file does not exist on your system, it declares the functions :c:func:`malloc`, :c:func:`free` and :c:func:`realloc` directly.
fr: Tous les symboles exposés par :file:`Python.h` sont préfixés de ``Py`` ou ``PY``, sauf ceux qui sont définis dans les en-têtes standard. Pour le confort, et comme ils sont largement utilisés par l'interpréteur Python, ``"Python.h"`` inclut lui-même quelques d'en-têtes standard : ``<stdio.h>``, ``<string.h>``, ``<errno.h>`` et ``<stdlib.h>``. Si ce dernier n'existe pas sur votre système, il déclare les fonctions :c:func:`malloc`, :c:func:`free` et :c:func:`realloc` directement.

source: The next thing we add to our module file is the C function that will be called when the Python expression ``spam.system(string)`` is evaluated (we'll see shortly how it ends up being called)::
fr: La prochaine chose que nous ajoutons à notre fichier de module est la fonction C qui sera appelée lorsque l'expression Python ``spam.system(chaîne)`` sera évaluée (nous verrons bientôt comment elle finit par être appelée) ::

source: There is a straightforward translation from the argument list in Python (for example, the single expression ``"ls -l"``) to the arguments passed to the C function. The C function always has two arguments, conventionally named *self* and *args*.
fr: Il y a une correspondance directe de la liste des arguments en Python (par exemple, l'expression ``"ls -l"``) aux arguments passés à la fonction C. La fonction C a toujours deux arguments, appelés par convention *self* et *args*.

source: The *self* argument points to the module object for module-level functions; for a method it would point to the object instance.
fr: Pour les fonctions au niveau du module, l'argument *self* pointe sur l'objet module, pour une méthode, il pointe sur l'instance de l'objet.

source: The *args* argument will be a pointer to a Python tuple object containing the arguments. Each item of the tuple corresponds to an argument in the call's argument list. The arguments are Python objects --- in order to do anything with them in our C function we have to convert them to C values. The function :c:func:`PyArg_ParseTuple` in the Python API checks the argument types and converts them to C values. It uses a template string to determine the required types of the arguments as well as the types of the C variables into which to store the converted values. More about this later.
fr: L'argument *args* sera un pointeur vers un *n*-uplet Python contenant les arguments. Chaque élément du *n*-uplet correspond à un argument dans la liste des arguments de l'appel. Les arguments sont des objets Python, afin d'en faire quelque chose dans notre fonction C, nous devons les convertir en valeurs C. La fonction :c:func:`PyArg_ParseTuple` de l'API Python vérifie les types des arguments et les convertit en valeurs C. Elle utilise un modèle sous forme de chaîne pour déterminer les types requis des arguments ainsi que les types de variables C dans lequel stocker les valeurs converties. Nous en verront plus, plus tard.

source: :c:func:`PyArg_ParseTuple` returns true (nonzero) if all arguments have the right type and its components have been stored in the variables whose addresses are passed. It returns false (zero) if an invalid argument list was passed. In the latter case it also raises an appropriate exception so the calling function can return ``NULL`` immediately (as we saw in the example).
fr: :c:func:`PyArg_ParseTuple` renvoie vrai (pas zéro) si tous les arguments ont le bon type et que ses composants ont été stockés dans les variables dont les adresses ont été données en entrée. Il renvoie faux (zéro) si une liste d'arguments invalide a été passée. Dans ce dernier cas, elle lève également une exception appropriée de sorte que la fonction d'appel puisse renvoyer ``NULL`` immédiatement (comme nous l'avons vu dans l'exemple).

source: Intermezzo: Errors and Exceptions
fr: Intermezzo : Les erreurs et les exceptions

source: The Python API defines a number of functions to set various types of exceptions.
fr: L'API Python définit un certain nombre de fonctions pour créer différents types d'exceptions.

source: The most common one is :c:func:`PyErr_SetString`. Its arguments are an exception object and a C string. The exception object is usually a predefined object like :c:data:`PyExc_ZeroDivisionError`. The C string indicates the cause of the error and is converted to a Python string object and stored as the "associated value" of the exception.
fr: La plus courante est :c:func:`PyErr_SetString`. Ses arguments sont un objet exception et une chaîne C. L'objet exception est généralement un objet prédéfini comme :c:data:`PyExc_ZeroDivisionError`. La chaîne C indique la cause de l'erreur et est convertie en une chaîne Python puis stockée en tant que "valeur associée" à l'exception.

source: Another useful function is :c:func:`PyErr_SetFromErrno`, which only takes an exception argument and constructs the associated value by inspection of the global variable :c:data:`errno`. The most general function is :c:func:`PyErr_SetObject`, which takes two object arguments, the exception and its associated value. You don't need to :c:func:`Py_INCREF` the objects passed to any of these functions.
fr: Une autre fonction utile est :c:func:`PyErr_SetFromErrno`, qui construit une exception à partir de la valeur de la variable globale :c:data:`errno`. La fonction la plus générale est :c:func:`PyErr_SetObject`, qui prend deux arguments : l'exception et sa valeur associée. Vous ne devez pas appliquer :c:func:`Py_INCREF` aux objets transmis à ces fonctions.

source: You can test non-destructively whether an exception has been set with :c:func:`PyErr_Occurred`. This returns the current exception object, or ``NULL`` if no exception has occurred. You normally don't need to call :c:func:`PyErr_Occurred` to see whether an error occurred in a function call, since you should be able to tell from the return value.
fr: Vous pouvez tester de manière non destructive si une exception a été levée avec :c:func:`PyErr_Occurred`. Cela renvoie l'objet exception actuel, ou ``NULL`` si aucune exception n'a eu lieu. Cependant, vous ne devriez pas avoir besoin d'appeler :c:func:`PyErr_Occurred` pour voir si une erreur est survenue durant l'appel d'une fonction, puisque vous devriez être en mesure de le déterminer à partir de la valeur renvoyée.

source: To ignore an exception set by a function call that failed, the exception condition must be cleared explicitly by calling :c:func:`PyErr_Clear`. The only time C code should call :c:func:`PyErr_Clear` is if it doesn't want to pass the error on to the interpreter but wants to handle it completely by itself (possibly by trying something else, or pretending nothing went wrong).
fr: Pour ignorer une exception qui aurait été émise lors d'un appel de fonction qui aurait échoué, l'exception doit être retirée explicitement en appelant :c:func:`PyErr_Clear`. Le seul cas pour lequel du code C devrait appeler :c:func:`PyErr_Clear` est lorsqu'il ne veut pas passer l'erreur à l'interpréteur, mais souhaite la gérer lui-même (peut-être en essayant quelque chose d'autre, ou en prétendant que rien n'a mal tourné).

source: Every failing :c:func:`malloc` call must be turned into an exception --- the direct caller of :c:func:`malloc` (or :c:func:`realloc`) must call :c:func:`PyErr_NoMemory` and return a failure indicator itself. All the object-creating functions (for example, :c:func:`PyLong_FromLong`) already do this, so this note is only relevant to those who call :c:func:`malloc` directly.
fr: Chaque échec de :c:func:`malloc` doit être transformé en une exception, l'appelant direct de :c:func:`malloc` (ou :c:func:`realloc`) doit appeler :c:func:`PyErr_NoMemory` et prendre l'initiative de renvoyer une valeur d'erreur. Toutes les fonctions construisant des objets (tels que :c:func:`PyLong_FromLong`) le font déjà, donc cette note ne concerne que ceux qui appellent :c:func:`malloc` directement.

source: Also note that, with the important exception of :c:func:`PyArg_ParseTuple` and friends, functions that return an integer status usually return a positive value or zero for success and ``-1`` for failure, like Unix system calls.
fr: Notez également que, à l'exception notable de :c:func:`PyArg_ParseTuple` et compagnie, les fonctions qui renvoient leur statut sous forme d'entier donnent généralement une valeur positive ou zéro en cas de succès et ``-1`` en cas d'échec, comme les appels du système Unix.

source: Finally, be careful to clean up garbage (by making :c:func:`Py_XDECREF` or :c:func:`Py_DECREF` calls for objects you have already created) when you return an error indicator!
fr: Enfin, lorsque vous renvoyez un code d'erreur, n'oubliez pas faire un brin de nettoyage (en appelant :c:func:`Py_XDECREF` ou :c:func:`Py_DECREF` avec les objets que vous auriez déjà créés) !

source: The choice of which exception to raise is entirely yours. There are predeclared C objects corresponding to all built-in Python exceptions, such as :c:data:`PyExc_ZeroDivisionError`, which you can use directly. Of course, you should choose exceptions wisely --- don't use :c:data:`PyExc_TypeError` to mean that a file couldn't be opened (that should probably be :c:data:`PyExc_IOError`). If something's wrong with the argument list, the :c:func:`PyArg_ParseTuple` function usually raises :c:data:`PyExc_TypeError`. If you have an argument whose value must be in a particular range or must satisfy other conditions, :c:data:`PyExc_ValueError` is appropriate.
fr: Le choix de l'exception à lever vous incombe. Il existe des objets C correspondant à chaque exception Python, tel que :c:data:`PyExc_ZeroDivisionError`, que vous pouvez utiliser directement. Choisissez judicieusement vos exceptions, typiquement n'utilisez pas :c:data:`PyExc_TypeError` pour indiquer qu'un fichier n'a pas pu être ouvert (qui devrait probablement être :c:data:`PyExc_IOError`). Si quelque chose ne va pas avec la liste des arguments, la fonction :c:func:`PyArg_ParseTuple` lève habituellement une exception :c:data:`PyExc_TypeError`. Mais si vous avez un argument dont la valeur doit être dans un intervalle particulier ou qui doit satisfaire d'autres conditions, :c:data:`PyExc_ValueError` sera plus appropriée.

source: You can also define a new exception that is unique to your module. For this, you usually declare a static object variable at the beginning of your file::
fr: Vous pouvez également créer une exception spécifique à votre module. Pour cela, déclarez simplement une variable statique au début de votre fichier ::

source: and initialize it in your module's initialization function (:c:func:`PyInit_spam`) with an exception object::
fr: et initialisez-la dans la fonction d'initialisation de votre module (:c:func:`PyInit_spam`) avec un objet exception ::

source: Note that the Python name for the exception object is :exc:`spam.error`. The :c:func:`PyErr_NewException` function may create a class with the base class being :exc:`Exception` (unless another class is passed in instead of ``NULL``), described in :ref:`bltin-exceptions`.
fr: Notez que le nom de l'exception en Python est :exc:`spam.error`. La fonction :c:func:`PyErr_NewException` peut créer une classe héritant de :exc:`Exception` (à moins qu'une autre classe ne lui soit fournie à la place de ``NULL``), voir :ref:`bltin-exceptions`.

source: Note also that the :c:data:`SpamError` variable retains a reference to the newly created exception class; this is intentional! Since the exception could be removed from the module by external code, an owned reference to the class is needed to ensure that it will not be discarded, causing :c:data:`SpamError` to become a dangling pointer. Should it become a dangling pointer, C code which raises the exception could cause a core dump or other unintended side effects.
fr: Notez également que la variable :c:data:`SpamError` contient une référence à la nouvelle classe créée ; ceci est intentionnel ! Comme l'exception peut être retirée du module par un code externe, une référence à la classe est nécessaire pour assurer qu'il ne sera pas rejeté, causant :c:data:`SpamError` et devenir un pointeur défaillant. Si cela se produirait, le C code qui lève cette exception peut engendrer un *core dump* ou des effets secondaires inattendus.

source: We discuss the use of ``PyMODINIT_FUNC`` as a function return type later in this sample.
fr: Nous traiterons de l'utilisation de ``PyMODINIT_FUNC`` comme un type de renvoi de fonction plus tard dans cette section.

source: The :exc:`spam.error` exception can be raised in your extension module using a call to :c:func:`PyErr_SetString` as shown below::
fr: L'exception :exc:`spam.error` peut être levée dans votre module d'extension en appelant :c:func:`PyErr_SetString` comme montré ci-dessous ::

source: Back to the Example
fr: Retour vers l'exemple

source: Going back to our example function, you should now be able to understand this statement::
fr: En revenant vers notre fonction exemple, vous devriez maintenant être capable de comprendre cette affirmation ::

source: It returns ``NULL`` (the error indicator for functions returning object pointers) if an error is detected in the argument list, relying on the exception set by :c:func:`PyArg_ParseTuple`. Otherwise the string value of the argument has been copied to the local variable :c:data:`command`. This is a pointer assignment and you are not supposed to modify the string to which it points (so in Standard C, the variable :c:data:`command` should properly be declared as ``const char *command``).
fr: Elle renvoie ``NULL`` (l'indicateur d'erreur pour les fonctions renvoyant des pointeurs d'objet) si une erreur est détectée dans la liste des arguments, se fiant à l'exception définie par :c:func:`PyArg_ParseTuple`. Autrement, la valeur chaîne de l'argument a été copiée dans la variable locale :c:data:`command`. Il s'agit d'une attribution de pointeur et vous n'êtes pas supposés modifier la chaîne vers laquelle il pointe (donc en C Standard, la variable :c:data:`command` doit être clairement déclarée comme ``const char *command``).

source: The next statement is a call to the Unix function :c:func:`system`, passing it the string we just got from :c:func:`PyArg_ParseTuple`::
fr: La prochaine instruction est un appel à la fonction Unix :c:func:`system`, en lui passant la chaîne que nous venons d'obtenir à partir de :c:func:`PyArg_ParseTuple` ::

source: Our :func:`spam.system` function must return the value of :c:data:`sts` as a Python object. This is done using the function :c:func:`PyLong_FromLong`. ::
fr: Notre fonction :func:`spam.system` doit renvoyer la valeur de :c:data:`sts` comme un objet Python. Cela est effectué par l'utilisation de la fonction :c:func:`PyLong_FromLong`. ::

source: In this case, it will return an integer object. (Yes, even integers are objects on the heap in Python!)
fr: Dans ce cas, elle renverra un objet entier. (Oui, même les entiers sont des objets dans le tas en Python !)

source: :c:data:`Py_None` is the C name for the special Python object ``None``. It is a genuine Python object rather than a ``NULL`` pointer, which means "error" in most contexts, as we have seen.
fr: :c:data:`Py_None` est la dénomination en C pour l'objet spécial Python ``None``. C'est un authentique objet Python plutôt qu'un pointeur ``NULL``, qui signifie qu'une erreur est survenue, dans la plupart des situations, comme nous l'avons vu.

source: The Module's Method Table and Initialization Function
fr: La fonction d'initialisation et le tableau des méthodes du module

source: I promised to show how :c:func:`spam_system` is called from Python programs. First, we need to list its name and address in a "method table"::
fr: Nous avons promis de montrer comment :c:func:`spam_system` est appelée depuis les programmes Python. D'abord, nous avons besoin d'avoir son nom et son adresse dans un « tableau des méthodes » ::

source: Note the third entry (``METH_VARARGS``). This is a flag telling the interpreter the calling convention to be used for the C function. It should normally always be ``METH_VARARGS`` or ``METH_VARARGS | METH_KEYWORDS``; a value of ``0`` means that an obsolete variant of :c:func:`PyArg_ParseTuple` is used.
fr: Notez la troisième entrée (``METH_VARARGS``). C'est un indicateur du type de convention à utiliser pour la fonction C, à destination de l'interpréteur. Il doit valoir normalement ``METH_VARARGS`` ou ``METH_VARARGS | METH_KEYWORDS`` ; la valeur ``0`` indique qu'une variante obsolète de :c:func:`PyArg_ParseTuple` est utilisée.

source: When using only ``METH_VARARGS``, the function should expect the Python-level parameters to be passed in as a tuple acceptable for parsing via :c:func:`PyArg_ParseTuple`; more information on this function is provided below.
fr: Si seulement ``METH_VARARGS`` est utilisé, la fonction s'attend à ce que les paramètres Python soient passés comme un *n*-uplet que l'on peut analyser *via* :c:func:`PyArg_ParseTuple` ; des informations supplémentaires sont fournies plus bas.

source: The :const:`METH_KEYWORDS` bit may be set in the third field if keyword arguments should be passed to the function. In this case, the C function should accept a third ``PyObject *`` parameter which will be a dictionary of keywords. Use :c:func:`PyArg_ParseTupleAndKeywords` to parse the arguments to such a function.
fr: Le bit :const:`METH_KEYWORDS` peut être mis à un dans le troisième champ si des arguments par mots-clés doivent être passés à la fonction. Dans ce cas, la fonction C doit accepter un troisième paramètre ``PyObject *`` qui est un dictionnaire des mots-clés. Utilisez :c:func:`PyArg_ParseTupleAndKeywords` pour analyser les arguments d'une telle fonction.

source: The method table must be referenced in the module definition structure::
fr: Le tableau des méthodes doit être référencé dans la structure de définition du module ::
