Repository: python/python-docs-fr
Catalog: extending/extending.po
Languages: fr

source: Let's follow the control flow into :c:func:`PyList_SetItem`. The list owns references to all its items, so when item 1 is replaced, it has to dispose of the original item 1. Now let's suppose the original item 1 was an instance of a user-defined class, and let's further suppose that the class defined a :meth:`__del__` method. If this class instance has a reference count of 1, disposing of it will call its :meth:`__del__` method.
fr: Suivons le flux de contrôle dans :c:func:`PyList_SetItem`. La liste possède des références à tous ses éléments, donc quand l'élément 1 est remplacé, elle doit se débarrasser de l'élément 1 original. Supposons maintenant que l'élément 1 original était une instance d'une classe définie par l'utilisateur, et supposons en outre que la classe définisse une méthode :meth:`__del__`. Si l'instance de cette classe a un nombre des références de 1, sa destruction appellera sa méthode :meth:`__del__`.

source: Since it is written in Python, the :meth:`__del__` method can execute arbitrary Python code. Could it perhaps do something to invalidate the reference to ``item`` in :c:func:`bug`? You bet! Assuming that the list passed into :c:func:`bug` is accessible to the :meth:`__del__` method, it could execute a statement to the effect of ``del list[0]``, and assuming this was the last reference to that object, it would free the memory associated with it, thereby invalidating ``item``.
fr: Comme elle est écrite en Python, la méthode :meth:`__del__` peut exécuter du code Python arbitraire. Pourrait-elle faire quelque chose pour invalider la référence à ``item`` dans :c:func:`bug` ? Bien sûr ! En supposant que la liste passée dans :c:func:`bug` est accessible à la méthode :meth:`__del__`, elle pourrait exécuter une instruction à l'effet de ``del list[0]``, et en supposant que ce soit la dernière référence à cet objet, elle libérerait la mémoire qui lui est associée, invalidant ainsi ``item``.

source: The second case of problems with a borrowed reference is a variant involving threads. Normally, multiple threads in the Python interpreter can't get in each other's way, because there is a global lock protecting Python's entire object space. However, it is possible to temporarily release this lock using the macro :c:macro:`Py_BEGIN_ALLOW_THREADS`, and to re-acquire it using :c:macro:`Py_END_ALLOW_THREADS`. This is common around blocking I/O calls, to let other threads use the processor while waiting for the I/O to complete. Obviously, the following function has the same problem as the previous one::
fr: Le deuxième cas de problèmes liés à une référence empruntée est une variante impliquant des fils de discussion. Normalement, plusieurs threads dans l'interpréteur Python ne peuvent pas se gêner mutuellement, car il existe un verrou global protégeant tout l'espace objet de Python. Cependant, il est possible de libérer temporairement ce verrou en utilisant la macro :c:macro:`Py_BEGIN_ALLOW_THREADS`, et de le ré-acquérir en utilisant :c:macro:`Py_END_ALLOW_THREADS`. Ceci est un procédé courant pour bloquer les appels d'entrées/sorties, afin de permettre aux autres threads d'utiliser le processeur en attendant que les E/S soient terminées. Évidemment, la fonction suivante a le même problème que la précédente ::

source: NULL Pointers
fr: Pointeurs ``NULL``

source: In general, functions that take object references as arguments do not expect you to pass them ``NULL`` pointers, and will dump core (or cause later core dumps) if you do so. Functions that return object references generally return ``NULL`` only to indicate that an exception occurred. The reason for not testing for ``NULL`` arguments is that functions often pass the objects they receive on to other function --- if each function were to test for ``NULL``, there would be a lot of redundant tests and the code would run more slowly.
fr: En général, les fonctions qui prennent des références d'objets comme arguments ne sont pas conçues pour recevoir des pointeurs ``NULL``, et si vous en donnez comme arguments, elles causeront une erreur de segmentation (ou provoqueront des *core dump* ultérieurs). Les fonctions qui renvoient des références d'objets renvoient généralement ``NULL`` uniquement pour indiquer qu'une exception s'est produite. La raison pour laquelle les arguments ``NULL`` ne sont pas testés est que les fonctions passent souvent les objets qu'elles reçoivent à d'autres fonctions, si chaque fonction devait tester pour ``NULL``, il y aurait beaucoup de tests redondants et le code s'exécuterait plus lentement.

source: It is better to test for ``NULL`` only at the "source:" when a pointer that may be ``NULL`` is received, for example, from :c:func:`malloc` or from a function that may raise an exception.
fr: Il est préférable de tester la présence de ``NULL`` uniquement au début : lorsqu'un pointeur qui peut être ``NULL`` est reçu, par exemple, de :c:func:`malloc` ou d'une fonction qui peut lever une exception.

source: The macros :c:func:`Py_INCREF` and :c:func:`Py_DECREF` do not check for ``NULL`` pointers --- however, their variants :c:func:`Py_XINCREF` and :c:func:`Py_XDECREF` do.
fr: Les macros :c:func:`Py_INCREF` et :c:func:`Py_DECREF` ne vérifient pas les pointeurs ``NULL``. Cependant, leurs variantes :c:func:`Py_XINCREF` et :c:func:`Py_XDECREF` le font.

source: The C function calling mechanism guarantees that the argument list passed to C functions (``args`` in the examples) is never ``NULL`` --- in fact it guarantees that it is always a tuple [#]_.
fr: Le mécanisme d'appel de fonctions C garantit que la liste d'arguments passée aux fonctions C (``args`` dans les exemples) n'est jamais ``NULL``. En fait, il garantit qu'il s'agit toujours d'un n-uplet [#]_.

source: It is a severe error to ever let a ``NULL`` pointer "escape" to the Python user.
fr: C'est une grave erreur de laisser un pointeur ``NULL`` "échapper" à l'utilisateur Python.

source: Writing Extensions in C++
fr: Écrire des extensions en C++

source: It is possible to write extension modules in C++. Some restrictions apply. If the main program (the Python interpreter) is compiled and linked by the C compiler, global or static objects with constructors cannot be used. This is not a problem if the main program is linked by the C++ compiler. Functions that will be called by the Python interpreter (in particular, module initialization functions) have to be declared using ``extern "C"``. It is unnecessary to enclose the Python header files in ``extern "C" {...}`` --- they use this form already if the symbol ``__cplusplus`` is defined (all recent C++ compilers define this symbol).
fr: C'est possible d'écrire des modules d'extension en C++, mais sous certaines conditions. Si le programme principal (l'interpréteur Python) est compilé et lié par le compilateur C, les objets globaux ou statiques avec les constructeurs ne peuvent pas être utilisés. Ceci n'est pas un problème si le programme principal est relié par le compilateur C++. Les fonctions qui seront appelées par l'interpréteur Python (en particulier, les fonctions d'initialisation des modules) doivent être déclarées en utilisant ``extern "C"``. Il n'est pas nécessaire d'inclure les fichiers d'en-tête Python dans le ``extern "C" {…}``, car ils utilisent déjà ce format si le symbole ``__cplusplus`` est défini (tous les compilateurs C++ récents définissent ce symbole).

source: Providing a C API for an Extension Module
fr: Fournir une API en langage C pour un module d'extension

source: Many extension modules just provide new functions and types to be used from Python, but sometimes the code in an extension module can be useful for other extension modules. For example, an extension module could implement a type "collection" which works like lists without order. Just like the standard Python list type has a C API which permits extension modules to create and manipulate lists, this new collection type should have a set of C functions for direct manipulation from other extension modules.
fr: De nombreux modules d'extension fournissent simplement de nouvelles fonctions et de nouveaux types à utiliser à partir de Python, mais parfois le code d'un module d'extension peut être utile pour d'autres modules d'extension. Par exemple, un module d'extension peut mettre en œuvre un type "collection" qui fonctionne comme des listes sans ordre. Tout comme le type de liste Python standard possède une API C qui permet aux modules d'extension de créer et de manipuler des listes, ce nouveau type de collection devrait posséder un ensemble de fonctions C pour une manipulation directe à partir d'autres modules d'extension.

source: At first sight this seems easy: just write the functions (without declaring them ``static``, of course), provide an appropriate header file, and document the C API. And in fact this would work if all extension modules were always linked statically with the Python interpreter. When modules are used as shared libraries, however, the symbols defined in one module may not be visible to another module. The details of visibility depend on the operating system; some systems use one global namespace for the Python interpreter and all extension modules (Windows, for example), whereas others require an explicit list of imported symbols at module link time (AIX is one example), or offer a choice of different strategies (most Unices). And even if symbols are globally visible, the module whose functions one wishes to call might not have been loaded yet!
fr: À première vue, cela semble facile : il suffit d'écrire les fonctions (sans les déclarer "statiques", bien sûr), de fournir un fichier d'en-tête approprié et de documenter l'API C. Et en fait, cela fonctionnerait si tous les modules d'extension étaient toujours liés statiquement avec l'interpréteur Python. Cependant, lorsque les modules sont utilisés comme des bibliothèques partagées, les symboles définis dans un module peuvent ne pas être visibles par un autre module. Les détails de la visibilité dépendent du système d'exploitation ; certains systèmes utilisent un espace de noms global pour l'interpréteur Python et tous les modules d'extension (Windows, par exemple), tandis que d'autres exigent une liste explicite des symboles importés au moment de la liaison des modules (AIX en est un exemple), ou offrent un choix de stratégies différentes (la plupart des *Unix*). Et même si les symboles sont globalement visibles, le module dont on souhaite appeler les fonctions n'est peut-être pas encore chargé !

source: Portability therefore requires not to make any assumptions about symbol visibility. This means that all symbols in extension modules should be declared ``static``, except for the module's initialization function, in order to avoid name clashes with other extension modules (as discussed in section :ref:`methodtable`). And it means that symbols that *should* be accessible from other extension modules must be exported in a different way.
fr: La portabilité exige donc de ne faire aucune supposition sur la visibilité des symboles. Cela signifie que tous les symboles des modules d'extension doivent être déclarés ``static``, à l'exception de la fonction d'initialisation du module, afin d'éviter les conflits de noms avec les autres modules d'extension (comme discuté dans la section :ref:`methodtable`). Et cela signifie que les symboles qui *devraient* être accessibles à partir d'autres modules d'extension doivent être exportés d'une manière différente.

source: There are many ways in which Capsules can be used to export the C API of an extension module. Each function could get its own Capsule, or all C API pointers could be stored in an array whose address is published in a Capsule. And the various tasks of storing and retrieving the pointers can be distributed in different ways between the module providing the code and the client modules.
fr: Il existe de nombreuses façons d'utiliser les Capsules pour exporter l'API C d'un module d'extension. Chaque fonction peut obtenir sa propre Capsule, ou tous les pointeurs de l'API C peuvent être stockés dans un tableau dont l'adresse est inscrite dans une Capsule. Et les différentes tâches de stockage et de récupération des pointeurs peuvent être réparties de différentes manières entre le module fournissant le code et les modules clients.

source: The exporting module is a modification of the :mod:`spam` module from section :ref:`extending-simpleexample`. The function :func:`spam.system` does not call the C library function :c:func:`system` directly, but a function :c:func:`PySpam_System`, which would of course do something more complicated in reality (such as adding "spam" to every command). This function :c:func:`PySpam_System` is also exported to other extension modules.
fr: Le module d'exportation est une modification du module :mod:`spam` de la section :ref:`extending-simpleexample`. La fonction :func:`spam.system` n'appelle pas directement la fonction de la bibliothèque C :c:func:`system`, mais une fonction :c:func:`PySpam_System`, qui ferait bien sûr quelque chose de plus compliqué en réalité (comme ajouter du *spam* à chaque commande). Cette fonction :c:func:`PySpam_System` est également exportée vers d'autres modules d'extension.

source: The function :c:func:`spam_system` is modified in a trivial way::
fr: La fonction :c:func:`spam_system` est modifiée de manière simple ::

source: In the beginning of the module, right after the line ::
fr: Au début du module, immédiatement après la ligne ::

source: two more lines must be added::
fr: on doit ajouter deux lignes supplémentaires ::

source: The ``#define`` is used to tell the header file that it is being included in the exporting module, not a client module. Finally, the module's initialization function must take care of initializing the C API pointer array::
fr: L'indicateur ``#define`` est utilisé pour indiquer au fichier d'en-tête qu'il est inclus dans le module d'exportation, et non dans un module client. Enfin, la fonction d'initialisation du module doit prendre en charge l'initialisation du tableau de pointeurs de l'API C ::

source: Note that ``PySpam_API`` is declared ``static``; otherwise the pointer array would disappear when :func:`PyInit_spam` terminates!
fr: Notez que ``PySpam_API`` est déclaré ``static`` ; sinon le tableau de pointeurs disparaîtrait lorsque :func:`PyInit_spam` se finit !

source: The bulk of the work is in the header file :file:`spammodule.h`, which looks like this::
fr: L'essentiel du travail se trouve dans le fichier d'en-tête :file:`spammodule.h`, qui ressemble à ceci ::

source: All that a client module must do in order to have access to the function :c:func:`PySpam_System` is to call the function (or rather macro) :c:func:`import_spam` in its initialization function::
fr: Tout ce qu'un module client doit faire pour avoir accès à la fonction :c:func:`PySpam_System` est d'appeler la fonction (ou plutôt la macro) :c:func:`import_spam` dans sa fonction d'initialisation ::

source: The main disadvantage of this approach is that the file :file:`spammodule.h` is rather complicated. However, the basic structure is the same for each function that is exported, so it has to be learned only once.
fr: Le principal inconvénient de cette approche est que le fichier :file:`spammodule.h` est assez compliqué. Cependant, la structure de base est la même pour chaque fonction exportée, ce qui fait qu'elle ne doit être apprise qu'une seule fois.

source: Finally it should be mentioned that Capsules offer additional functionality, which is especially useful for memory allocation and deallocation of the pointer stored in a Capsule. The details are described in the Python/C API Reference Manual in the section :ref:`capsules` and in the implementation of Capsules (files :file:`Include/pycapsule.h` and :file:`Objects/pycapsule.c` in the Python source code distribution).
fr: Enfin, il convient de mentionner que Capsules offrent des fonctionnalités supplémentaires, qui sont particulièrement utiles pour l'allocation de la mémoire et la dés-allocation du pointeur stocké dans un objet Capsule. Les détails sont décrits dans le manuel de référence de l'API Python/C dans la section :ref:`capsules` et dans l'implémentation des Capsules (fichiers :file:`Include/pycapsule.h` et :file:`Objects/pycapsule.c` dans la distribution du code source Python).

source: Footnotes
fr: Notes

source: An interface for this function already exists in the standard module :mod:`os` --- it was chosen as a simple and straightforward example.
fr: Une interface pour cette fonction existe déjà dans le module standard :mod:`os`, elle a été choisie comme un exemple simple et direct.

source: The metaphor of "borrowing" a reference is not completely correct: the owner still has a copy of the reference.
fr: L'expression « emprunter une référence » n'est pas tout à fait correcte, car le propriétaire a toujours une copie de la référence.

source: Checking that the reference count is at least 1 **does not work** --- the reference count itself could be in freed memory and may thus be reused for another object!
fr: Vérifier que le comptage de référence est d'au moins 1 **ne fonctionne pas**, le compte de référence lui-même pourrait être en mémoire libérée et peut donc être réutilisé pour un autre objet !

source: These guarantees don't hold when you use the "old" style calling convention --- this is still found in much existing code.
fr: Ces garanties ne sont pas valables lorsqu'on emploie les conventions de nommage anciennes, qu'on retrouve encore assez souvent dans beaucoup de code existant.
