Repository: python/python-docs-fr
Catalog: extending/extending.po
Languages: fr

source: This structure, in turn, must be passed to the interpreter in the module's initialization function. The initialization function must be named :c:func:`PyInit_name`, where *name* is the name of the module, and should be the only non-\ ``static`` item defined in the module file::
fr: Cette structure, à son tour, doit être transmise à l'interpréteur dans la fonction d'initialisation du module. La fonction d'initialisation doit être nommée :c:func:`PyInit_name`, où *nom* est le nom du module, et doit être le seul élément non ``static`` défini dans le fichier du module ::

source: Note that PyMODINIT_FUNC declares the function as ``PyObject *`` return type, declares any special linkage declarations required by the platform, and for C++ declares the function as ``extern "C"``.
fr: Notez que *PyMODINIT_FUNC* déclare la fonction comme renvoyant un objet de type ``PyObject *``, et déclare également toute déclaration de liaison spéciale requise par la plate-forme, et pour le C++ déclare la fonction comme un C ``extern``.

source: When the Python program imports module :mod:`spam` for the first time, :c:func:`PyInit_spam` is called. (See below for comments about embedding Python.) It calls :c:func:`PyModule_Create`, which returns a module object, and inserts built-in function objects into the newly created module based upon the table (an array of :c:type:`PyMethodDef` structures) found in the module definition. :c:func:`PyModule_Create` returns a pointer to the module object that it creates. It may abort with a fatal error for certain errors, or return ``NULL`` if the module could not be initialized satisfactorily. The init function must return the module object to its caller, so that it then gets inserted into ``sys.modules``.
fr: Lorsque le programme Python importe le module :mod:`spam` pour la première fois, :c:func:`PyInit_spam` est appelé. (Voir ci-dessous pour les commentaires sur l'intégration en Python.) Il appelle :c:func:`PyModule_Create`, qui renvoie un objet module, et insère des objets fonction intégrés dans le module nouvellement créé en se basant sur la table (un tableau de structures :c:type:`PyMethodDef`) trouvée dans la définition du module. :c:func:`PyModule_Create` renvoie un pointeur vers l'objet module qu'il crée. Il peut s'interrompre avec une erreur fatale pour certaines erreurs, ou renvoyer ``NULL`` si le module n'a pas pu être initialisé de manière satisfaisante. La fonction `*init* doit renvoyer l'objet module à son appelant, afin qu'il soit ensuite inséré dans ``sys.modules``.

source: When embedding Python, the :c:func:`PyInit_spam` function is not called automatically unless there's an entry in the :c:data:`PyImport_Inittab` table. To add the module to the initialization table, use :c:func:`PyImport_AppendInittab`, optionally followed by an import of the module::
fr: Lors de l'intégration de Python, la fonction :c:func:`PyInit_spam` n'est pas appelée automatiquement, sauf s'il y a une entrée dans la table :c:data:`PyImport_Inittab`. Pour ajouter le module à la table d'initialisation, utilisez :c:func:`PyImport_AppendInittab`, suivi éventuellement d'une importation du module ::

source: Removing entries from ``sys.modules`` or importing compiled modules into multiple interpreters within a process (or following a :c:func:`fork` without an intervening :c:func:`exec`) can create problems for some extension modules. Extension module authors should exercise caution when initializing internal data structures.
fr: Supprimer des entrées de ``sys.modules`` ou importer des modules compilés dans plusieurs interpréteurs au sein d'un processus (ou suivre un :c:func:`fork` sans l'intervention d'un :c:func:`exec`) peut créer des problèmes pour certains modules d'extension. Les auteurs de modules d'extension doivent faire preuve de prudence lorsqu'ils initialisent des structures de données internes.

source: A more substantial example module is included in the Python source distribution as :file:`Modules/xxmodule.c`. This file may be used as a template or simply read as an example.
fr: Un exemple de module plus substantiel est inclus dans la distribution des sources Python sous le nom :file:`Modules/xxmodule.c`. Ce fichier peut être utilisé comme modèle ou simplement lu comme exemple.

source: Unlike our ``spam`` example, ``xxmodule`` uses *multi-phase initialization* (new in Python 3.5), where a PyModuleDef structure is returned from ``PyInit_spam``, and creation of the module is left to the import machinery. For details on multi-phase initialization, see :PEP:`489`.
fr: Contrairement à notre exemple de ``spam``, ``xxmodule`` utilise une *initialisation multi-phase* (nouveau en Python 3.5), où une structure *PyModuleDef* est renvoyée à partir de ``PyInit_spam``, et la création du module est laissée au mécanisme d'importation. Pour plus de détails sur l'initialisation multi-phase, voir :PEP:`489`.

source: Compilation and Linkage
fr: Compilation et liaison

source: Calling Python Functions from C
fr: Appeler des fonctions Python en C

source: This function must be registered with the interpreter using the :const:`METH_VARARGS` flag; this is described in section :ref:`methodtable`. The :c:func:`PyArg_ParseTuple` function and its arguments are documented in section :ref:`parsetuple`.
fr: Cette fonction doit être déclarée en utilisant le drapeau :const:`METH_VARARGS` ; ceci est décrit dans la section :ref:`methodtable`. La fonction :c:func:`PyArg_ParseTuple` et ses arguments sont documentés dans la section :ref:`parsetuple`.

source: The macros :c:func:`Py_XINCREF` and :c:func:`Py_XDECREF` increment/decrement the reference count of an object and are safe in the presence of ``NULL`` pointers (but note that *temp* will not be ``NULL`` in this context). More info on them in section :ref:`refcounts`.
fr: Les macros :c:func:`Py_XINCREF` et :c:func:`Py_XDECREF` incrémentent/décrémentent le compteur des références d'un objet et sont sûres quant à la présence de pointeurs ``NULL`` (mais notez que *temp* ne sera pas ``NULL`` dans ce contexte). Plus d'informations à ce sujet dans la section :ref:`refcounts`.

source: Before you do this, however, it is important to check that the return value isn't ``NULL``. If it is, the Python function terminated by raising an exception. If the C code that called :c:func:`PyObject_CallObject` is called from Python, it should now return an error indication to its Python caller, so the interpreter can print a stack trace, or the calling Python code can handle the exception. If this is not possible or desirable, the exception should be cleared by calling :c:func:`PyErr_Clear`. For example::
fr: Mais avant de le faire, il est important de vérifier que la valeur renvoyée n'est pas ``NULL``. Si c'est le cas, la fonction Python s'est terminée par la levée d'une exception. Si le code C qui a appelé :c:func:`PyObject_CallObject` est appelé depuis Python, il devrait maintenant renvoyer une indication d'erreur à son appelant Python, afin que l'interpréteur puisse afficher la pile d'appels, ou que le code Python appelant puisse gérer l'exception. Si cela n'est pas possible ou souhaitable, l'exception doit être effacée en appelant :c:func:`PyErr_Clear`. Par exemple ::

source: Depending on the desired interface to the Python callback function, you may also have to provide an argument list to :c:func:`PyObject_CallObject`. In some cases the argument list is also provided by the Python program, through the same interface that specified the callback function. It can then be saved and used in the same manner as the function object. In other cases, you may have to construct a new tuple to pass as the argument list. The simplest way to do this is to call :c:func:`Py_BuildValue`. For example, if you want to pass an integral event code, you might use the following code::
fr: Selon l'interface souhaitée pour la fonction de rappel Python, vous devrez peut-être aussi fournir une liste d'arguments à :c:func:`PyObject_CallObject`. Dans certains cas, la liste d'arguments est également fournie par le programme Python, par l'intermédiaire de la même interface qui a spécifié la fonction de rappel. Elle peut alors être sauvegardée et utilisée de la même manière que l'objet fonction. Dans d'autres cas, vous pouvez avoir à construire un nouveau n-uplet à passer comme liste d'arguments. La façon la plus simple de faire cela est d'appeler :c:func:`Py_BuildValue`. Par exemple, si vous voulez passer un code d'événement intégral, vous pouvez utiliser le code suivant ::

source: You may also call a function with keyword arguments by using :c:func:`PyObject_Call`, which supports arguments and keyword arguments. As in the above example, we use :c:func:`Py_BuildValue` to construct the dictionary. ::
fr: Vous pouvez également appeler une fonction avec des arguments nommés en utilisant :c:func:`PyObject_Call`, qui accepte les arguments et les arguments nommés. Comme dans l'exemple ci-dessus, nous utilisons :c:func:`Py_BuildValue` pour construire le dictionnaire. ::

source: Extracting Parameters in Extension Functions
fr: Extraire des paramètres dans des fonctions d'extension

source: The :c:func:`PyArg_ParseTuple` function is declared as follows::
fr: La fonction :c:func:`PyArg_ParseTuple` est déclarée ainsi ::

source: Note that any Python object references which are provided to the caller are *borrowed* references; do not decrement their reference count!
fr: Notez que n'importe quelles références sur un objet Python qui sont données à l'appelant sont des références *empruntées* ; ne décrémentez pas leur compteur de références !

source: Some example calls::
fr: Quelques exemples d'appels ::

source: Keyword Parameters for Extension Functions
fr: Paramètres nommés pour des fonctions d'extension

source: The :c:func:`PyArg_ParseTupleAndKeywords` function is declared as follows::
fr: La fonction :c:func:`PyArg_ParseTupleAndKeywords` est déclarée ainsi ::

source: The *arg* and *format* parameters are identical to those of the :c:func:`PyArg_ParseTuple` function. The *kwdict* parameter is the dictionary of keywords received as the third parameter from the Python runtime. The *kwlist* parameter is a ``NULL``-terminated list of strings which identify the parameters; the names are matched with the type information from *format* from left to right. On success, :c:func:`PyArg_ParseTupleAndKeywords` returns true, otherwise it returns false and raises an appropriate exception.
fr: Les paramètres *arg* et *format* sont identiques à ceux de la fonction :c:func:`PyArg_ParseTuple`. Le paramètre *kwdict* est le dictionnaire de mots-clés reçu comme troisième paramètre du *runtime* Python. Le paramètre *kwlist* est une liste de chaînes de caractères terminée par ``NULL`` qui identifie les paramètres ; les noms sont mis en correspondance, de gauche à droite, avec les informations de type de *format*. En cas de succès du processus, :c:func:`PyArg_ParseTupleAndKeywords` renvoie vrai, sinon il renvoie faux et lève une exception appropriée.

source: Nested tuples cannot be parsed when using keyword arguments! Keyword parameters passed in which are not present in the *kwlist* will cause :exc:`TypeError` to be raised.
fr: Les n-uplets imbriqués ne peuvent pas être traités lorsqu'on utilise des arguments de type mot-clé ! Ceux-ci doivent apparaître dans dans *kwlist*, dans le cas contraire une exception :exc:`TypeError` est levée.

source: Here is an example module which uses keywords, based on an example by Geoff Philbrick (philbrick@hks.com)::
fr: Voici un exemple de module qui utilise des mots-clés, basé sur un exemple de *Geoff Philbrick* (philbrick@hks.com) ::

source: Building Arbitrary Values
fr: Créer des valeurs arbitraires

source: This function is the counterpart to :c:func:`PyArg_ParseTuple`. It is declared as follows::
fr: Cette fonction est le complément de :c:func:`PyArg_ParseTuple`. Elle est déclarée comme suit ::

source: It recognizes a set of format units similar to the ones recognized by :c:func:`PyArg_ParseTuple`, but the arguments (which are input to the function, not output) must not be pointers, just values. It returns a new Python object, suitable for returning from a C function called from Python.
fr: Il reconnaît un ensemble d'unités de format similaires à celles reconnues par :c:func:`PyArg_ParseTuple`, mais les arguments (qui sont les données en entrée de fonction, et non de la sortie) ne doivent pas être des pointeurs, mais juste des valeurs. Il renvoie un nouvel objet Python, adapté pour être renvoyé par une fonction C appelée depuis Python.

source: Examples (to the left the call, to the right the resulting Python value):
fr: Exemples (à gauche l'appel, à droite la valeur résultante, en Python) :

source: Reference Counts
fr: Compteurs de références

source: In languages like C or C++, the programmer is responsible for dynamic allocation and deallocation of memory on the heap. In C, this is done using the functions :c:func:`malloc` and :c:func:`free`. In C++, the operators ``new`` and ``delete`` are used with essentially the same meaning and we'll restrict the following discussion to the C case.
fr: Dans les langages comme le C ou le C++, le développeur est responsable de l'allocation dynamique et de la dés-allocation de la mémoire sur le tas. En C, cela se fait à l'aide des fonctions :c:func:`malloc` et :c:func:`free`. En C++, les opérateurs ``new`` et ``delete`` sont utilisés avec essentiellement la même signification et nous limiterons la discussion suivante au cas du C.

source: Since Python makes heavy use of :c:func:`malloc` and :c:func:`free`, it needs a strategy to avoid memory leaks as well as the use of freed memory. The chosen method is called :dfn:`reference counting`. The principle is simple: every object contains a counter, which is incremented when a reference to the object is stored somewhere, and which is decremented when a reference to it is deleted. When the counter reaches zero, the last reference to the object has been deleted and the object is freed.
fr: Comme Python fait un usage intensif de :c:func:`malloc` et de :c:func:`free`, il a besoin d'une stratégie pour éviter les fuites de mémoire ainsi que l'utilisation de la mémoire libérée. La méthode choisie est appelée :dfn:`reference counting`. Le principe est simple : chaque objet contient un compteur, qui est incrémenté lorsqu'une référence à l'objet est stockée quelque part, et qui est décrémenté lorsqu'une référence à celui-ci est supprimée. Lorsque le compteur atteint zéro, la dernière référence à l'objet a été supprimée et l'objet est libéré.

source: An alternative strategy is called :dfn:`automatic garbage collection`. (Sometimes, reference counting is also referred to as a garbage collection strategy, hence my use of "automatic" to distinguish the two.) The big advantage of automatic garbage collection is that the user doesn't need to call :c:func:`free` explicitly. (Another claimed advantage is an improvement in speed or memory usage --- this is no hard fact however.) The disadvantage is that for C, there is no truly portable automatic garbage collector, while reference counting can be implemented portably (as long as the functions :c:func:`malloc` and :c:func:`free` are available --- which the C Standard guarantees). Maybe some day a sufficiently portable automatic garbage collector will be available for C. Until then, we'll have to live with reference counts.
fr: Une stratégie alternative est appelée :dfn:`automatic garbage collection` (ramasse-miettes). Parfois, le comptage des références est également appelé stratégie de ramasse-miettes, d'où l'utilisation du terme "automatique" pour distinguer les deux. Le grand avantage du ramasse-miettes est que l'utilisateur n'a pas besoin d'appeler :c:func:`free` explicitement. (Un autre avantage important est l'amélioration de la vitesse ou de l'utilisation de la mémoire, ce n'est cependant pas un fait avéré). L'inconvénient est que pour C, il n'y a pas de ramasse-miettes portable proprement-dit, alors que le comptage des références peut être implémenté de façon portable (tant que les fonctions :c:func:`malloc` et :c:func:`free` soient disponibles, ce que la norme C garantit). Peut-être qu'un jour un ramasse-miettes suffisamment portable sera disponible pour C. D'ici là, nous devrons utiliser les compteurs des références.

source: While Python uses the traditional reference counting implementation, it also offers a cycle detector that works to detect reference cycles. This allows applications to not worry about creating direct or indirect circular references; these are the weakness of garbage collection implemented using only reference counting. Reference cycles consist of objects which contain (possibly indirect) references to themselves, so that each object in the cycle has a reference count which is non-zero. Typical reference counting implementations are not able to reclaim the memory belonging to any objects in a reference cycle, or referenced from the objects in the cycle, even though there are no further references to the cycle itself.
fr: Bien que Python utilise l'implémentation traditionnelle de comptage de référence, il contient également un détecteur de cycles qui fonctionne pour détecter les cycles de référence. Cela permet aux applications d'empêcher la création de références circulaires directes ou indirectes ; ceci sont les faiblesses du ramasse-miettes mis en œuvre en utilisant uniquement le comptage de référence. Les cycles de référence sont constitués d'objets qui contiennent des références (éventuellement indirectes) à eux-mêmes, de sorte que chaque objet du cycle a un comptage de référence qui n'est pas nul. Les implémentations typiques de comptage de référence ne sont pas capables de récupérer la mémoire appartenant à des objets dans un cycle de référence, ou référencés à partir des objets dans le cycle, même s'il n'y a pas d'autres références au cycle lui-même.

source: Reference Counting in Python
fr: Comptage de références en Python

source: There are two macros, ``Py_INCREF(x)`` and ``Py_DECREF(x)``, which handle the incrementing and decrementing of the reference count. :c:func:`Py_DECREF` also frees the object when the count reaches zero. For flexibility, it doesn't call :c:func:`free` directly --- rather, it makes a call through a function pointer in the object's :dfn:`type object`. For this purpose (and others), every object also contains a pointer to its type object.
fr: Il existe deux macros, ``Py_INCREF(x)`` et ``Py_DECREF(x)``, qui gèrent l'incrémentation et la décrémentation du comptage de référence. :c:func:`Py_DECREF` libère également l'objet lorsque le comptage atteint zéro. Pour plus de flexibilité, il n'appelle pas :c:func:`free` directement — plutôt, il fait un appel à travers un pointeur de fonction dans l'objet :dfn:`type objet` de l'objet. À cette fin (et pour d'autres), chaque objet contient également un pointeur vers son objet type.

source: The big question now remains: when to use ``Py_INCREF(x)`` and ``Py_DECREF(x)``? Let's first introduce some terms. Nobody "owns" an object; however, you can :dfn:`own a reference` to an object. An object's reference count is now defined as the number of owned references to it. The owner of a reference is responsible for calling :c:func:`Py_DECREF` when the reference is no longer needed. Ownership of a reference can be transferred. There are three ways to dispose of an owned reference: pass it on, store it, or call :c:func:`Py_DECREF`. Forgetting to dispose of an owned reference creates a memory leak.
fr: La grande question demeure maintenant : quand utiliser ``Py_INCREF(x)`` et ``Py_DECREF(x)`` ? Commençons par définir quelques termes. Personne ne possède un objet, mais vous pouvez en :dfn:`avoir une référence`. Le comptage de références d'un objet est maintenant défini comme étant le nombre de références à cet objet. Le propriétaire d'une référence est responsable d'appeler :c:func:`Py_DECREF` lorsque la référence n'est plus nécessaire. La propriété d'une référence peut être transférée. Il y a trois façons de disposer d'une référence : la transmettre, la stocker, ou appeler :c:func:`Py_DECREF`. Oublier de se débarrasser d'une référence crée une fuite de mémoire.

source: The advantage of borrowing over owning a reference is that you don't need to take care of disposing of the reference on all possible paths through the code --- in other words, with a borrowed reference you don't run the risk of leaking when a premature exit is taken. The disadvantage of borrowing over owning is that there are some subtle situations where in seemingly correct code a borrowed reference can be used after the owner from which it was borrowed has in fact disposed of it.
fr: L'avantage d'emprunter, plutôt qu'être propriétaire d'une référence est que vous n'avez pas à vous soucier de disposer de la référence sur tous les chemins possibles dans le code — en d'autres termes, avec une référence empruntée, vous ne courez pas le risque de fuites lors d'une sortie prématurée. L'inconvénient de l'emprunt par rapport à la possession est qu'il existe certaines situations subtiles où, dans un code apparemment correct, une référence empruntée peut être utilisée après que le propriétaire auquel elle a été empruntée l'a en fait éliminée.

source: Ownership Rules
fr: Règles concernant la propriété de références

source: Whenever an object reference is passed into or out of a function, it is part of the function's interface specification whether ownership is transferred with the reference or not.
fr: Chaque fois qu'une référence d'objet est passée à l'intérieur ou à l'extérieur d'une fonction, elle fait partie de la spécification de l'interface de la fonction, peu importe que la propriété soit transférée avec la référence ou non.

source: Thin Ice
fr: Terrain dangereux

source: There are a few situations where seemingly harmless use of a borrowed reference can lead to problems. These all have to do with implicit invocations of the interpreter, which can cause the owner of a reference to dispose of it.
fr: Il existe quelques situations où l'utilisation apparemment inoffensive d'une référence empruntée peut entraîner des problèmes. Tous ces problèmes sont en lien avec des invocations implicites de l’interpréteur, et peuvent amener le propriétaire d'une référence à s'en défaire.

source: The first and most important case to know about is using :c:func:`Py_DECREF` on an unrelated object while borrowing a reference to a list item. For instance::
fr: Le premier cas, et le plus important à connaître, est celui de l'application de :c:func:`Py_DECREF` à un objet non relié, tout en empruntant une référence à un élément de liste. Par exemple ::

source: This function first borrows a reference to ``list[0]``, then replaces ``list[1]`` with the value ``0``, and finally prints the borrowed reference. Looks harmless, right? But it's not!
fr: Cette fonction emprunte d'abord une référence à ``list[0]``, puis remplace ``list[1]`` par la valeur ``0``, et enfin affiche la référence empruntée. Ça a l'air inoffensif, n'est-ce pas ? Mais ce n'est pas le cas !
