Repository: python/python-docs-fr
Catalog: extending/index.po
Languages: fr

source: Extending and Embedding the Python Interpreter
fr: Extension et intégration de l'interpréteur Python

source: This document describes how to write modules in C or C++ to extend the Python interpreter with new modules. Those modules can not only define new functions but also new object types and their methods. The document also describes how to embed the Python interpreter in another application, for use as an extension language. Finally, it shows how to compile and link extension modules so that they can be loaded dynamically (at run time) into the interpreter, if the underlying operating system supports this feature.
fr: Ce document décrit comment écrire des modules en C ou C++ pour étendre l'interpréteur Python à de nouveaux modules. En plus de définir de nouvelles fonctions, ces modules peuvent définir de nouveaux types d'objets ainsi que leur méthodes. Ce document explique aussi comment intégrer l'interpréteur Python dans une autre application, pour être utilisé comme langage d'extension. Enfin, ce document montre comment compiler et lier les modules d'extension pour qu'ils puissent être chargés dynamiquement (à l'exécution) dans l'interpréteur, si le système d'exploitation sous-jacent supporte cette fonctionnalité.

source: This document assumes basic knowledge about Python. For an informal introduction to the language, see :ref:`tutorial-index`. :ref:`reference-index` gives a more formal definition of the language. :ref:`library-index` documents the existing object types, functions and modules (both built-in and written in Python) that give the language its wide application range.
fr: Ce document présuppose que vous avez des connaissances de base sur Python. Pour une introduction informelle du langage, voyez :ref:`tutorial-index`. :ref:`reference-index` donne une définition plus formelle du langage. :ref:`library-index` documente les objets types, fonctions et modules existants (tous intégrés et écrits en Python) qui donnent au langage sa large gamme d'applications.

source: For a detailed description of the whole Python/C API, see the separate :ref:`c-api-index`.
fr: Pour une description dans sa totalité de l'API Python/C, voir :ref:`c-api-index`.

source: Recommended third party tools
fr: Les outils tiers recommandés

source: This guide only covers the basic tools for creating extensions provided as part of this version of CPython. Third party tools like `Cython <http://cython.org/>`_, `cffi <https://cffi.readthedocs.io>`_, `SWIG <http://www.swig.org>`_ and `Numba <https://numba.pydata.org/>`_ offer both simpler and more sophisticated approaches to creating C and C++ extensions for Python.
fr: Ce guide ne couvre que les outils basiques permettant de créer des extensions fournies dans cette version de CPython. Les outils tiers tels que `Cython <http://cython.org/>`_, `cffi <https://cffi.readthedocs.io>`_, `SWIG <http://www.swig.org>`_ et `Numba <https://numba.pydata.org/>`_ offrent des approches plus simples et plus élaborées pour créer des extensions C et C++ pour Python.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/guides/packaging-binary-extensions/>`_
fr: `Guide d'utilisation de l'empaquetage Python : Extensions binaires <https://packaging.python.org/guides/packaging-binary-extensions/>`_

source: The Python Packaging User Guide not only covers several available tools that simplify the creation of binary extensions, but also discusses the various reasons why creating an extension module may be desirable in the first place.
fr: Le guide d'utilisation de l'empaquetage Python ne couvre pas uniquement quelques outils disponibles qui simplifient la création d'extensions binaires, mais aborde aussi les différentes raisons pour lesquelles créer un module d'extension peut être souhaitable d'entrée.

source: Creating extensions without third party tools
fr: Création d'extensions sans outils tiers

source: This section of the guide covers creating C and C++ extensions without assistance from third party tools. It is intended primarily for creators of those tools, rather than being a recommended way to create your own C extensions.
fr: Cette section du guide couvre la création d'extensions C et C++ sans l'utilisation d'outils tiers. Cette section est destinée aux créateurs de ces outils, plus que d'être une méthode recommandée pour créer votre propre extension C.

source: Embedding the CPython runtime in a larger application
fr: Intégrer l'interpréteur CPython dans une plus grande application

source: Sometimes, rather than creating an extension that runs inside the Python interpreter as the main application, it is desirable to instead embed the CPython runtime inside a larger application. This section covers some of the details involved in doing that successfully.
fr: Parfois, plutôt que de créer une extension qui s'exécute dans l'interpréteur Python comme application principale, il est préférable d'intégrer l'interpréteur Python dans une application plus large. Cette section donne quelques informations nécessaires au succès de cette opération.
