Repository: python/python-docs-fr
Catalog: extending/newtypes.po
Languages: fr

source: *kwds* is a dictionary of keyword arguments that were passed. If this is non-``NULL`` and you support keyword arguments, use :c:func:`PyArg_ParseTupleAndKeywords` to extract the arguments. If you do not want to support keyword arguments and this is non-``NULL``, raise a :exc:`TypeError` with a message saying that keyword arguments are not supported.
fr: *kwds* est le dictionnaire d'arguments nommés qui ont été passés. Si ce n'est pas ``NULL`` et que vous gérez les arguments nommés, utilisez :c:func:`PyArg_ParseTupleAndKeywords` pour extraire les arguments. Si vous ne souhaitez pas prendre en charge les arguments nommés et qu'il n'est pas ``NULL``, levez une :exc:`TypeError` avec un message indiquant que les arguments nommés ne sont pas pris en charge.

source: Here is a toy ``tp_call`` implementation::
fr: Ceci est une implémentation ``tp_call`` très simple ::

source: Any :term:`iterable` object must implement the :c:member:`~PyTypeObject.tp_iter` handler, which must return an :term:`iterator` object. Here the same guidelines apply as for Python classes:
fr: Tout objet :term:`iterable` doit implémenter le gestionnaire :c:member:`~PyTypeObject.tp_iter`, qui doit renvoyer un objet de type :term:`iterator`. Ici, les mêmes directives s'appliquent de la même façon que pour les classes *Python* :

source: For collections (such as lists and tuples) which can support multiple independent iterators, a new iterator should be created and returned by each call to :c:member:`~PyTypeObject.tp_iter`.
fr: Pour les collections (telles que les listes et les n-uplets) qui peuvent implémenter plusieurs itérateurs indépendants, un nouvel itérateur doit être créé et renvoyé par chaque appel de type :c:member:`~PyTypeObject.tp_iter`.

source: Objects which can only be iterated over once (usually due to side effects of iteration, such as file objects) can implement :c:member:`~PyTypeObject.tp_iter` by returning a new reference to themselves -- and should also therefore implement the :c:member:`~PyTypeObject.tp_iternext` handler.
fr: Les objets qui ne peuvent être itérés qu'une seule fois (généralement en raison d'effets de bord de l'itération, tels que les objets fichiers) peuvent implémenter :c:member:`~PyTypeObject.tp_iter` en renvoyant une nouvelle référence à eux-mêmes – et doivent donc également implémenter le gestionnaire :c:member:`~PyTypeObject.tp_iternext`.

source: Any :term:`iterator` object should implement both :c:member:`~PyTypeObject.tp_iter` and :c:member:`~PyTypeObject.tp_iternext`. An iterator's :c:member:`~PyTypeObject.tp_iter` handler should return a new reference to the iterator. Its :c:member:`~PyTypeObject.tp_iternext` handler should return a new reference to the next object in the iteration, if there is one. If the iteration has reached the end, :c:member:`~PyTypeObject.tp_iternext` may return ``NULL`` without setting an exception, or it may set :exc:`StopIteration` *in addition* to returning ``NULL``; avoiding the exception can yield slightly better performance. If an actual error occurs, :c:member:`~PyTypeObject.tp_iternext` should always set an exception and return ``NULL``.
fr: Tout objet :term:`itérateur <iterator>` doit implémenter à la fois :c:member:`~PyTypeObject.tp_iter` et :c:member:`~PyTypeObject.tp_iternext`. Le gestionnaire :c:member:`~PyTypeObject.tp_iter` d'un itérateur doit renvoyer une nouvelle référence de l'itérateur. Son gestionnaire :c:member:`~PyTypeObject.tp_iternext` doit renvoyer une nouvelle référence à l'objet suivant dans l'itération, s'il y en a un. Si l'itération a atteint la fin, :c:member:`~PyTypeObject.tp_iternext` peut renvoyer ``NULL`` sans définir d'exception, ou il peut définir :exc:`StopIteration` *en plus* de renvoyer ``NULL`` ; éviter de lever une exception peut donner des performances légèrement meilleures. Si une erreur réelle se produit, :c:member:`~PyTypeObject.tp_iternext` doit toujours définir une exception et renvoyer ``NULL``.

source: Weak Reference Support
fr: Prise en charge de la référence faible

source: One of the goals of Python's weak reference implementation is to allow any type to participate in the weak reference mechanism without incurring the overhead on performance-critical objects (such as numbers).
fr: L'un des objectifs de l'implémentation de la référence faible de *Python* est de permettre à tout type d'objet de participer au mécanisme de référence faible sans avoir à supporter le surcoût de la performance critique des certains objets, tels que les nombres.

source: Documentation for the :mod:`weakref` module.
fr: documentation pour le module :mod:`weakref`.

source: More Suggestions
fr: Plus de suggestions

source: In order to learn how to implement any specific method for your new data type, get the :term:`CPython` source code. Go to the :file:`Objects` directory, then search the C source files for ``tp_`` plus the function you want (for example, ``tp_richcompare``). You will find examples of the function you want to implement.
fr: Pour savoir comment mettre en œuvre une méthode spécifique pour votre nouveau type de données, téléchargez le code source :term:`CPython`. Allez dans le répertoire :file:`Objects`, puis cherchez dans les fichiers sources *C* la fonction ``tp_`` plus la fonction que vous voulez (par exemple, ``tp_richcompare``). Vous trouverez des exemples de la fonction que vous voulez implémenter.

source: When you need to verify that an object is a concrete instance of the type you are implementing, use the :c:func:`PyObject_TypeCheck` function. A sample of its use might be something like the following::
fr: Lorsque vous avez besoin de vérifier qu'un objet est une instance concrète du type que vous implémentez, utilisez la fonction :c:func:`PyObject_TypeCheck`. Voici un exemple de son utilisation ::

source: Download CPython source releases.
fr: Télécharger les versions sources de *CPython*.

source: The CPython project on GitHub, where the CPython source code is developed.
fr: Le projet *CPython* sur *GitHub*, où se trouve le code source *CPython*.

source: object
fr: objet

source: deallocation
fr: libération de mémoire

source: deallocation, object
fr: libération de mémoire, objet

source: finalization
fr: finalisation

source: finalization, of objects
fr: finalisation, d'objets

source: string
fr: chaîne

source: object representation
fr: Représentation de l'objet

source: built-in function
fr: fonction native
