Repository: python/python-docs-fr
Catalog: extending/newtypes_tutorial.po
Languages: fr

source: Defining Extension Types: Tutorial
fr: Tutoriel : définir des types dans des extensions

source: Python allows the writer of a C extension module to define new types that can be manipulated from Python code, much like the built-in :class:`str` and :class:`list` types. The code for all extension types follows a pattern, but there are some details that you need to understand before you can get started. This document is a gentle introduction to the topic.
fr: Python permet à l'auteur d'un module d'extension C de définir de nouveaux types qui peuvent être manipulés depuis du code Python, à la manière des types natifs :class:`str` et :class:`list`. Les implémentations de tous les types d'extension ont des similarités, mais quelques subtilités doivent être abordées avant de commencer.

source: The Basics
fr: Les bases

source: The :term:`CPython` runtime sees all Python objects as variables of type :c:expr:`PyObject*`, which serves as a "base type" for all Python objects. The :c:type:`PyObject` structure itself only contains the object's :term:`reference count` and a pointer to the object's "type object". This is where the action is; the type object determines which (C) functions get called by the interpreter when, for instance, an attribute gets looked up on an object, a method called, or it is multiplied by another object. These C functions are called "type methods".
fr: :term:`CPython` considère que tous les objets Python sont des variables de type :c:expr:`PyObject*`, qui sert de type de base pour tous les objets Python. La structure de :c:type:`PyObject` ne contient que le :term:`compteur de références <reference count>` et un pointeur vers un objet de type « type de l'objet ». C'est ici que tout se joue : l'objet type détermine quelle fonction C doit être appelée par l'interpréteur quand, par exemple, un attribut est recherché sur un objet, quand une méthode est appelée, ou quand l'objet est multiplié par un autre objet. Ces fonctions C sont appelées des « méthodes de type ».

source: So, if you want to define a new extension type, you need to create a new type object.
fr: Donc, pour définir un nouveau type dans une extension, vous devez créer un nouvel objet type.

source: This sort of thing can only be explained by example, so here's a minimal, but complete, module that defines a new type named :class:`Custom` inside a C extension module :mod:`custom`:
fr: Ce genre de chose ne s'explique correctement qu'avec des exemples, voici donc un module minimaliste mais suffisant qui définit un nouveau type nommé :class:`Custom` dans le module d'extension :mod:`custom` :

source: What we're showing here is the traditional way of defining *static* extension types. It should be adequate for most uses. The C API also allows defining heap-allocated extension types using the :c:func:`PyType_FromSpec` function, which isn't covered in this tutorial.
fr: ce qui est montré ici est la manière traditionnelle de définir des types d'extension *statiques*, et cela convient dans la majorité des cas. L'API C permet aussi de définir des types alloués sur le tas, via la fonction :c:func:`PyType_FromSpec`, mais ce n'est pas couvert par ce tutoriel.

source: Now that's quite a bit to take in at once, but hopefully bits will seem familiar from the previous chapter. This file defines three things:
fr: C'est un peu long, mais vous devez déjà reconnaître quelques morceaux expliqués au chapitre précédent. Ce fichier définit trois choses :

source: What a :class:`Custom` **object** contains: this is the ``CustomObject`` struct, which is allocated once for each :class:`Custom` instance.
fr: Ce qu'un **objet** :class:`Custom` contient : c'est la structure ``CustomObject``, qui est allouée une fois pour chaque instance de :class:`Custom`.

source: How the :class:`Custom` **type** behaves: this is the ``CustomType`` struct, which defines a set of flags and function pointers that the interpreter inspects when specific operations are requested.
fr: Comment le **type** :class:`Custom` se comporte : c'est la structure ``CustomType``, qui définit l'ensemble des options et pointeurs de fonction utilisés par l'interpréteur.

source: How to initialize the :mod:`custom` module: this is the ``PyInit_custom`` function and the associated ``custommodule`` struct.
fr: Comment initialiser le module :mod:`custom` : c'est la fonction ``PyInit_custom`` et la structure associée ``custommodule``.

source: The first bit is::
fr: Commençons par ::

source: This is what a Custom object will contain. ``PyObject_HEAD`` is mandatory at the start of each object struct and defines a field called ``ob_base`` of type :c:type:`PyObject`, containing a pointer to a type object and a reference count (these can be accessed using the macros :c:macro:`Py_TYPE` and :c:macro:`Py_REFCNT` respectively). The reason for the macro is to abstract away the layout and to enable additional fields in :ref:`debug builds <debug-build>`.
fr: C'est ce qu'un objet ``Custom`` contient. ``PyObject_HEAD`` est obligatoirement au début de chaque structure d'objet et définit un champ appelé ``ob_base`` de type :c:type:`PyObject`, contenant un pointeur vers un objet type et un compteur de références (on peut y accéder en utilisant les macros :c:macro:`Py_TYPE` et :c:macro:`Py_REFCNT`, respectivement). La raison d'être de ces macros est d'abstraire l'agencement de la structure, et ainsi de permettre l'ajout de champs en :ref:`mode débogage <debug-build>`.

source: There is no semicolon above after the :c:macro:`PyObject_HEAD` macro. Be wary of adding one by accident: some compilers will complain.
fr: il n'y a pas de point-virgule après la macro :c:macro:`PyObject_HEAD`. Attention à ne pas l'ajouter par accident : certains compilateurs pourraient s'en plaindre.

source: Of course, objects generally store additional data besides the standard ``PyObject_HEAD`` boilerplate; for example, here is the definition for standard Python floats::
fr: Bien sûr, les objets ajoutent généralement des données supplémentaires après l'entête standard ``PyObject_HEAD``. Par exemple voici la définition du type standard Python ``float`` ::

source: The second bit is the definition of the type object. ::
fr: La deuxième partie est la définition de l'objet type ::

source: We recommend using C99-style designated initializers as above, to avoid listing all the :c:type:`PyTypeObject` fields that you don't care about and also to avoid caring about the fields' declaration order.
fr: nous recommandons d'utiliser la syntaxe d'initialisation nommée (C99) pour remplir la structure, comme ci-dessus, afin d'éviter d'avoir à lister les champs de :c:type:`PyTypeObject` dont vous n'avez pas besoin, et de ne pas vous soucier de leur ordre.

source: The actual definition of :c:type:`PyTypeObject` in :file:`object.h` has many more :ref:`fields <type-structs>` than the definition above. The remaining fields will be filled with zeros by the C compiler, and it's common practice to not specify them explicitly unless you need them.
fr: La définition de :c:type:`PyTypeObject` dans :file:`object.h` contient en fait bien plus de :ref:`champs <type-structs>` que la définition ci-dessus. Les champs restants sont mis à zéro par le compilateur C, et c'est une pratique répandue de ne pas spécifier les champs dont vous n'avez pas besoin.

source: We're going to pick it apart, one field at a time::
fr: Regardons les champs de cette structure, un par un ::

source: This line is mandatory boilerplate to initialize the ``ob_base`` field mentioned above. ::
fr: Cette ligne, obligatoire, initialise le champ ``ob_base`` mentionné précédemment. ::

source: The name of our type. This will appear in the default textual representation of our objects and in some error messages, for example:
fr: C'est le nom de notre type. Il apparaît dans la représentation textuelle par défaut de nos objets, ainsi que dans quelques messages d'erreur, par exemple :

source: Note that the name is a dotted name that includes both the module name and the name of the type within the module. The module in this case is :mod:`custom` and the type is :class:`Custom`, so we set the type name to :class:`custom.Custom`. Using the real dotted import path is important to make your type compatible with the :mod:`pydoc` and :mod:`pickle` modules. ::
fr: Notez que le nom comporte un point : il inclut le nom du module et le nom du type. Dans ce cas le module est :mod:`custom` et le type est :class:`Custom`, donc nous donnons comme nom :class:`custom.Custom`. Nommer correctement son type, avec le point, est important pour le rendre compatible avec :mod:`pydoc` et :mod:`pickle`. ::

source: This is so that Python knows how much memory to allocate when creating new :class:`Custom` instances. :c:member:`~PyTypeObject.tp_itemsize` is only used for variable-sized objects and should otherwise be zero.
fr: C'est pour que Python sache combien de mémoire allouer à la création d'une nouvelle instance de :class:`Custom`. :c:member:`~PyTypeObject.tp_itemsize` n'est utilisé que pour les objets de taille variable, sinon il doit rester à zéro.

source: If you want your type to be subclassable from Python, and your type has the same :c:member:`~PyTypeObject.tp_basicsize` as its base type, you may have problems with multiple inheritance. A Python subclass of your type will have to list your type first in its :attr:`~class.__bases__`, or else it will not be able to call your type's :meth:`__new__` method without getting an error. You can avoid this problem by ensuring that your type has a larger value for :c:member:`~PyTypeObject.tp_basicsize` than its base type does. Most of the time, this will be true anyway, because either your base type will be :class:`object`, or else you will be adding data members to your base type, and therefore increasing its size.
fr: si vous voulez qu'une classe en Python puisse hériter de votre type, et que votre type a le même :c:member:`~PyTypeObject.tp_basicsize` que son parent, vous rencontrerez des problèmes avec l'héritage multiple. Une sous-classe Python de votre type devra lister votre type en premier dans son :attr:`~class.__bases__`, sans quoi elle ne sera pas capable d'appeler la méthode :meth:`__new__` de votre type sans erreur. Vous pouvez éviter ce problème en vous assurant que votre type a un :c:member:`~PyTypeObject.tp_basicsize` plus grand que son parent. La plupart du temps ce sera vrai (soit son parent sera :class:`object`, soit vous ajouterez des attributs à votre type, augmentant ainsi sa taille).

source: We set the class flags to :c:macro:`Py_TPFLAGS_DEFAULT`. ::
fr: Nous définissons les drapeaux de la classe à :c:macro:`Py_TPFLAGS_DEFAULT` ::

source: All types should include this constant in their flags. It enables all of the members defined until at least Python 3.3. If you need further members, you will need to OR the corresponding flags.
fr: Chaque type doit inclure cette constante dans ses options : elle active tous les membres définis jusqu'à au moins Python 3.3. Si vous avez besoin de plus de membres, vous pouvez la combiner à d'autres constantes avec un *OU* binaire.

source: We provide a doc string for the type in :c:member:`~PyTypeObject.tp_doc`. ::
fr: Nous fournissons une *docstring* pour ce type via le membre :c:member:`~PyTypeObject.tp_doc`. ::

source: To enable object creation, we have to provide a :c:member:`~PyTypeObject.tp_new` handler. This is the equivalent of the Python method :meth:`__new__`, but has to be specified explicitly. In this case, we can just use the default implementation provided by the API function :c:func:`PyType_GenericNew`. ::
fr: Pour permettre la création d'une instance, nous devons fournir un *handler* :c:member:`~PyTypeObject.tp_new`, qui est l'équivalent de la méthode Python :meth:`__new__`, mais elle a besoin d'être spécifiée explicitement. Dans ce cas, on se contente de l'implémentation par défaut fournie par la fonction :c:func:`PyType_GenericNew` de l'API. ::

source: Everything else in the file should be familiar, except for some code in :c:func:`PyInit_custom`::
fr: Le reste du fichier doit vous être familier, en dehors du code de :c:func:`PyInit_custom` ::

source: This initializes the :class:`Custom` type, filling in a number of members to the appropriate default values, including :attr:`ob_type` that we initially set to ``NULL``. ::
fr: Il initialise le type :class:`Custom`, en assignant quelques membres à leurs valeurs par défaut, tel que :attr:`ob_type` qui valait initialement ``NULL``. ::

source: This adds the type to the module dictionary. This allows us to create :class:`Custom` instances by calling the :class:`Custom` class:
fr: Ici on ajoute le type au dictionnaire du module. Cela permet de créer une instance de :class:`Custom` en appelant la classe :class:`Custom` :

source: That's it! All that remains is to build it; put the above code in a file called :file:`custom.c` and:
fr: C'est tout ! Il ne reste plus qu'à compiler, placez le code ci-dessus dans un fichier :file:`custom.c` et :

source: in a file called :file:`setup.py`; then typing
fr: dans un fichier appelé :file:`setup.py` ; puis en tapant

source: at a shell should produce a file :file:`custom.so` in a subdirectory; move to that directory and fire up Python --- you should be able to ``import custom`` and play around with Custom objects.
fr: à un shell doit produire un fichier :file:`custom.so` dans un sous-répertoire ; déplacez-vous dans ce répertoire et lancez Python — vous devriez pouvoir faire ``import custom`` et jouer avec des objets personnalisés.

source: That wasn't so hard, was it?
fr: Ce n'était pas si difficile, n'est-ce pas ?

source: Of course, the current Custom type is pretty uninteresting. It has no data and doesn't do anything. It can't even be subclassed.
fr: Bien sûr, le type personnalisé actuel est assez inintéressant. Il n'a pas de données et ne fait rien. Il ne peut même pas être sous-classé.

source: While this documentation showcases the standard :mod:`distutils` module for building C extensions, it is recommended in real-world use cases to use the newer and better-maintained ``setuptools`` library. Documentation on how to do this is out of scope for this document and can be found in the `Python Packaging User's Guide <https://packaging.python.org/tutorials/distributing-packages/>`_.
fr: Bien que cette documentation présente le module standard :mod:`distutils` pour la construction d'extensions C, il est recommandé dans les cas d'utilisation réels d'utiliser la bibliothèque ``setuptools`` plus récente et mieux entretenue. La documentation sur la façon de procéder est hors de portée de ce document et peut être trouvée dans le `Python Packaging User's Guide <https://packaging.python.org/tutorials/distributing-packages/>`_.

source: Adding data and methods to the Basic example
fr: ajout de données et de méthodes à l'exemple basique

source: Let's extend the basic example to add some data and methods. Let's also make the type usable as a base class. We'll create a new module, :mod:`custom2` that adds these capabilities:
fr: Étendons l'exemple de base pour ajouter des données et des méthodes. Rendons également le type utilisable comme classe de base. Nous allons créer un nouveau module, :mod:`custom2` qui ajoute ces fonctionnalités :

source: This version of the module has a number of changes.
fr: Cette version du module comporte un certain nombre de modifications.

source: We've added an extra include::
fr: Nous avons ajouté un nouvel *include* ::

source: This include provides declarations that we use to handle attributes, as described a bit later.
fr: Cet *include* fournit des déclarations que nous utilisons pour gérer les attributs, comme décrit un peu plus loin.

source: The :class:`Custom` type now has three data attributes in its C struct, *first*, *last*, and *number*. The *first* and *last* variables are Python strings containing first and last names. The *number* attribute is a C integer.
fr: Le type :class:`Custom` a maintenant trois attributs de données dans sa structure C, *first*, *last* et *number*. Les variables *first* et *last* sont des chaînes Python contenant les noms et prénoms. L'attribut *number* est un entier C.

source: The object structure is updated accordingly::
fr: La structure de l'objet est mise à jour en conséquence ::

source: Because we now have data to manage, we have to be more careful about object allocation and deallocation. At a minimum, we need a deallocation method::
fr: Comme nous avons maintenant des données à gérer, nous devons faire plus attention à l'allocation et à la libération d'objets. Au minimum, nous avons besoin d'une méthode de dés-allocation ::

source: which is assigned to the :c:member:`~PyTypeObject.tp_dealloc` member::
fr: qui est assignée au membre :c:member:`~PyTypeObject.tp_dealloc` ::

source: This method first clears the reference counts of the two Python attributes. :c:func:`Py_XDECREF` correctly handles the case where its argument is ``NULL`` (which might happen here if ``tp_new`` failed midway). It then calls the :c:member:`~PyTypeObject.tp_free` member of the object's type (computed by ``Py_TYPE(self)``) to free the object's memory. Note that the object's type might not be :class:`CustomType`, because the object may be an instance of a subclass.
fr: Cette méthode efface d'abord le nombre de références des deux attributs Python. :c:func:`Py_XDECREF` gère correctement le cas où son argument est ``NULL`` (ce qui peut arriver ici si ``tp_new`` échoue à mi-chemin). Elle appelle ensuite le membre :c:member:`~PyTypeObject.tp_free` du type de l'objet (calculé par ``Py_TYPE(self)``) pour libérer la mémoire de l'objet. Notez que le type de l'objet peut ne pas être :class:`CustomType`, car l'objet peut être une instance d'une sous-classe.

source: The explicit cast to ``destructor`` above is needed because we defined ``Custom_dealloc`` to take a ``CustomObject *`` argument, but the ``tp_dealloc`` function pointer expects to receive a ``PyObject *`` argument. Otherwise, the compiler will emit a warning. This is object-oriented polymorphism, in C!
fr: La conversion explicite en ``destructor`` ci-dessus est nécessaire car nous avons défini ``Custom_dealloc`` pour prendre un argument ``CustomObject *``, mais le pointeur de fonction ``tp_dealloc`` s'attend à recevoir un argument ``PyObject *``. Sinon, le compilateur émet un avertissement. C'est du polymorphisme orienté objet, en C !

source: We want to make sure that the first and last names are initialized to empty strings, so we provide a ``tp_new`` implementation::
fr: Nous voulons nous assurer que le prénom et le nom sont initialisés avec des chaînes vides, nous fournissons donc une implémentation ``tp_new`` ::

source: and install it in the :c:member:`~PyTypeObject.tp_new` member::
fr: et installez-le dans le membre :c:member:`~PyTypeObject.tp_new` ::

source: The ``tp_new`` handler is responsible for creating (as opposed to initializing) objects of the type. It is exposed in Python as the :meth:`__new__` method. It is not required to define a ``tp_new`` member, and indeed many extension types will simply reuse :c:func:`PyType_GenericNew` as done in the first version of the ``Custom`` type above. In this case, we use the ``tp_new`` handler to initialize the ``first`` and ``last`` attributes to non-``NULL`` default values.
fr: Le gestionnaire ``tp_new`` est responsable de la création (par opposition à l'initialisation) des objets du type. Il est exposé en Python en tant que méthode :meth:`__new__`. Il n'est pas nécessaire de définir un membre ``tp_new``, et en effet de nombreux types d'extension réutiliseront simplement :c:func:`PyType_GenericNew` comme cela a été fait dans la première version du type ``Custom`` ci-dessus. Dans ce cas, nous utilisons le gestionnaire ``tp_new`` pour initialiser les attributs ``first`` et ``last`` à des valeurs par défaut non ``NULL``.

source: ``tp_new`` is passed the type being instantiated (not necessarily ``CustomType``, if a subclass is instantiated) and any arguments passed when the type was called, and is expected to return the instance created. ``tp_new`` handlers always accept positional and keyword arguments, but they often ignore the arguments, leaving the argument handling to initializer (a.k.a. ``tp_init`` in C or ``__init__`` in Python) methods.
fr: ``tp_new`` reçoit le type en cours d'instanciation (pas nécessairement ``CustomType``, si une sous-classe est instanciée) et tous les arguments passés lorsque le type a été appelé, et devrait renvoyer l'instance créée. Les gestionnaires ``tp_new`` acceptent toujours les arguments positionnels et nommés, mais ils ignorent souvent les arguments, laissant la gestion des arguments aux méthodes d'initialisation (alias ``tp_init`` en C ou ``__init__`` en Python).

source: ``tp_new`` shouldn't call ``tp_init`` explicitly, as the interpreter will do it itself.
fr: ``tp_new`` ne doit pas appeler ``tp_init`` explicitement, car l'interpréteur le fera lui-même.

source: The ``tp_new`` implementation calls the :c:member:`~PyTypeObject.tp_alloc` slot to allocate memory::
fr: L'implémentation ``tp_new`` appelle l'emplacement :c:member:`~PyTypeObject.tp_alloc` pour allouer de la mémoire ::

source: Since memory allocation may fail, we must check the :c:member:`~PyTypeObject.tp_alloc` result against ``NULL`` before proceeding.
fr: Puisque l'allocation de mémoire peut échouer, nous devons vérifier le résultat :c:member:`~PyTypeObject.tp_alloc` par rapport à ``NULL`` avant de continuer.

source: We didn't fill the :c:member:`~PyTypeObject.tp_alloc` slot ourselves. Rather :c:func:`PyType_Ready` fills it for us by inheriting it from our base class, which is :class:`object` by default. Most types use the default allocation strategy.
fr: Nous n'avons pas rempli l'emplacement :c:member:`~PyTypeObject.tp_alloc` nous-mêmes. C'est :c:func:`PyType_Ready` qui le remplit pour nous car il en hérite de notre classe mère, qui est :class:`object` par défaut. La plupart des types utilisent la stratégie d'allocation par défaut.

source: If you are creating a co-operative :c:member:`~PyTypeObject.tp_new` (one that calls a base type's :c:member:`~PyTypeObject.tp_new` or :meth:`__new__`), you must *not* try to determine what method to call using method resolution order at runtime. Always statically determine what type you are going to call, and call its :c:member:`~PyTypeObject.tp_new` directly, or via ``type->tp_base->tp_new``. If you do not do this, Python subclasses of your type that also inherit from other Python-defined classes may not work correctly. (Specifically, you may not be able to create instances of such subclasses without getting a :exc:`TypeError`.)
fr: Si vous créez une :c:member:`~PyTypeObject.tp_new` coopérative (qui appelle :c:member:`~PyTypeObject.tp_new` ou :meth:`__new__` d'un type de base), vous ne devez *pas* essayer de déterminer quelle méthode appeler en utilisant l'ordre de résolution des méthodes au moment de l'exécution. Déterminez toujours statiquement quel type vous allez appeler, et appelez son :c:member:`~PyTypeObject.tp_new` directement, ou via ``type->tp_base->tp_new``. Si vous ne le faites pas, les sous-classes Python de votre type qui héritent également d'autres classes définies par Python risquent de ne pas fonctionner correctement. (Plus précisément, vous ne pourrez peut-être pas créer d'instances de telles sous-classes sans obtenir une :exc:`TypeError`.)

source: We also define an initialization function which accepts arguments to provide initial values for our instance::
fr: Nous définissons également une fonction d'initialisation qui accepte des arguments pour fournir des valeurs initiales pour notre instance ::

source: by filling the :c:member:`~PyTypeObject.tp_init` slot. ::
fr: en remplissant l'emplacement :c:member:`~PyTypeObject.tp_init`. ::
