Repository: python/python-docs-fr
Catalog: extending/newtypes_tutorial.po
Languages: fr

source: The :c:member:`~PyTypeObject.tp_init` slot is exposed in Python as the :meth:`__init__` method. It is used to initialize an object after it's created. Initializers always accept positional and keyword arguments, and they should return either ``0`` on success or ``-1`` on error.
fr: L'emplacement :c:member:`~PyTypeObject.tp_init` est exposé en Python en tant que méthode :meth:`__init__`. Il est utilisé pour initialiser un objet après sa création. Les constructeurs acceptent toujours les arguments positionnels et nommés, et ils doivent renvoyer soit ``0`` en cas de succès, soit ``-1`` en cas d'erreur.

source: Unlike the ``tp_new`` handler, there is no guarantee that ``tp_init`` is called at all (for example, the :mod:`pickle` module by default doesn't call :meth:`__init__` on unpickled instances). It can also be called multiple times. Anyone can call the :meth:`__init__` method on our objects. For this reason, we have to be extra careful when assigning the new attribute values. We might be tempted, for example to assign the ``first`` member like this::
fr: Contrairement au gestionnaire ``tp_new``, il n'y a aucune garantie que ``tp_init`` soit appelé (par exemple, le module :mod:`pickle` par défaut n'appelle pas :meth:`__init__` sur les instances *unpickled*). Il peut également être appelé plusieurs fois. N'importe qui peut appeler la méthode :meth:`__init__` sur nos objets. Pour cette raison, nous devons être très prudents lors de l'attribution des nouvelles valeurs d'attribut. On pourrait être tenté, par exemple, d'affecter le membre ``first`` comme ceci ::

source: But this would be risky. Our type doesn't restrict the type of the ``first`` member, so it could be any kind of object. It could have a destructor that causes code to be executed that tries to access the ``first`` member; or that destructor could release the :term:`Global interpreter Lock <GIL>` and let arbitrary code run in other threads that accesses and modifies our object.
fr: Mais ce serait risqué. Notre type ne limite pas le type du membre ``first``, il peut donc s'agir de n'importe quel type d'objet. Il pourrait avoir un destructeur qui provoque l'exécution de code essayant d'accéder au membre ``first`` ; ou ce destructeur pourrait libérer le :term:`Global interpreter Lock <GIL>` et laisser du code arbitraire s'exécuter dans d'autres threads qui accèdent et modifient notre objet.

source: To be paranoid and protect ourselves against this possibility, we almost always reassign members before decrementing their reference counts. When don't we have to do this?
fr: Dans une optique paranoïaque et se prémunir contre cette éventualité, on réaffecte presque toujours les membres avant de décrémenter leur compteur de références. Quand ne devons-nous pas faire cela ?

source: when we absolutely know that the reference count is greater than 1;
fr: lorsque l'on est sûr que le compteur de références est supérieur à 1 ;

source: when we know that deallocation of the object [#]_ will neither release the :term:`GIL` nor cause any calls back into our type's code;
fr: lorsque nous savons que la libération de la mémoire de l'objet [#]_ ne libérera pas le :term:`GIL` ni ne provoquera de rappel dans le code de notre type ;

source: when decrementing a reference count in a :c:member:`~PyTypeObject.tp_dealloc` handler on a type which doesn't support cyclic garbage collection [#]_.
fr: lors de la décrémentation d'un compteur de références dans un gestionnaire :c:member:`~PyTypeObject.tp_dealloc` sur un type qui ne prend pas en charge le ramasse-miettes cyclique [#]_.

source: We want to expose our instance variables as attributes. There are a number of ways to do that. The simplest way is to define member definitions::
fr: Nous voulons exposer nos variables d'instance en tant qu'attributs. Il existe plusieurs façons de le faire. Le moyen le plus simple consiste à définir des définitions de membres ::

source: and put the definitions in the :c:member:`~PyTypeObject.tp_members` slot::
fr: et placer les définitions dans l'emplacement :c:member:`~PyTypeObject.tp_members` ::

source: Each member definition has a member name, type, offset, access flags and documentation string. See the :ref:`Generic-Attribute-Management` section below for details.
fr: Chaque définition de membre possède un nom, un type, un décalage, des indicateurs d'accès et une chaîne de documentation. Voir la section :ref:`Generic-Attribute-Management` ci-dessous pour plus de détails.

source: A disadvantage of this approach is that it doesn't provide a way to restrict the types of objects that can be assigned to the Python attributes. We expect the first and last names to be strings, but any Python objects can be assigned. Further, the attributes can be deleted, setting the C pointers to ``NULL``. Even though we can make sure the members are initialized to non-``NULL`` values, the members can be set to ``NULL`` if the attributes are deleted.
fr: Un inconvénient de cette approche est qu'elle ne permet pas de restreindre les types d'objets pouvant être affectés aux attributs Python. Nous nous attendons à ce que le prénom et le nom soient des chaînes, mais tous les objets Python peuvent être affectés. De plus, les attributs peuvent être supprimés, en définissant les pointeurs C sur ``NULL``. Même si nous pouvons nous assurer que les membres sont initialisés avec des valeurs non ``NULL``, les membres peuvent être définis sur ``NULL`` si les attributs sont supprimés.

source: We define a single method, :meth:`Custom.name()`, that outputs the objects name as the concatenation of the first and last names. ::
fr: Nous définissons une seule méthode, :meth:`Custom.name()`, qui génère le nom des objets sous la forme de la concaténation des prénom et nom. ::

source: The method is implemented as a C function that takes a :class:`Custom` (or :class:`Custom` subclass) instance as the first argument. Methods always take an instance as the first argument. Methods often take positional and keyword arguments as well, but in this case we don't take any and don't need to accept a positional argument tuple or keyword argument dictionary. This method is equivalent to the Python method:
fr: La méthode est implémentée comme une fonction C qui prend une instance :class:`Custom` (ou une sous-classe de :class:`Custom`) comme premier argument. Les méthodes prennent toujours une instance comme premier argument. Les méthodes prennent souvent aussi des arguments positionnels et nommés, mais dans ce cas nous n'en prenons aucun et n'avons pas besoin d'accepter un *n*-uplet d'arguments positionnels ou un dictionnaire en argument nommé. Cette méthode est équivalente à la méthode Python :

source: Note that we have to check for the possibility that our :attr:`first` and :attr:`last` members are ``NULL``. This is because they can be deleted, in which case they are set to ``NULL``. It would be better to prevent deletion of these attributes and to restrict the attribute values to be strings. We'll see how to do that in the next section.
fr: Notez que nous devons vérifier la possibilité que nos membres :attr:`first` et :attr:`last` soient ``NULL``. En effet, ils peuvent être supprimés, auquel cas ils sont définis sur ``NULL``. Il serait préférable d'empêcher la suppression de ces attributs et de limiter les valeurs d'attribut à des chaînes. Nous verrons comment procéder dans la section suivante.

source: Now that we've defined the method, we need to create an array of method definitions::
fr: Maintenant que nous avons défini la méthode, nous devons créer un tableau de définitions de méthode ::

source: (note that we used the :c:macro:`METH_NOARGS` flag to indicate that the method is expecting no arguments other than *self*)
fr: (notez que nous avons utilisé le drapeau :c:macro:`METH_NOARGS` pour indiquer que la méthode n'attend aucun argument autre que *self*)

source: and assign it to the :c:member:`~PyTypeObject.tp_methods` slot::
fr: et assignons-le à l'emplacement :c:member:`~PyTypeObject.tp_methods` ::

source: Finally, we'll make our type usable as a base class for subclassing. We've written our methods carefully so far so that they don't make any assumptions about the type of the object being created or used, so all we need to do is to add the :c:macro:`Py_TPFLAGS_BASETYPE` to our class flag definition::
fr: Enfin, nous rendons notre type utilisable comme classe de base pour le sous-classement. Nous avons écrit nos méthodes avec soin jusqu'à présent afin qu'elles ne fassent aucune hypothèse sur le type de l'objet créé ou utilisé, donc tout ce que nous avons à faire est d'ajouter la macro :c:macro:`Py_TPFLAGS_BASETYPE` à notre définition d'indicateur de classe ::

source: We rename :c:func:`PyInit_custom` to :c:func:`PyInit_custom2`, update the module name in the :c:type:`PyModuleDef` struct, and update the full class name in the :c:type:`PyTypeObject` struct.
fr: Nous renommons :c:func:`PyInit_custom` en :c:func:`PyInit_custom2`, mettons à jour le nom du module dans la structure :c:type:`PyModuleDef` et mettons à jour le nom complet de la classe dans la structure :c:type:`PyTypeObject`.

source: Finally, we update our :file:`setup.py` file to build the new module:
fr: Enfin, nous mettons à jour notre fichier :file:`setup.py` pour construire le nouveau module :

source: Providing finer control over data attributes
fr: Contrôle précis sur les attributs de données

source: In this section, we'll provide finer control over how the :attr:`first` and :attr:`last` attributes are set in the :class:`Custom` example. In the previous version of our module, the instance variables :attr:`first` and :attr:`last` could be set to non-string values or even deleted. We want to make sure that these attributes always contain strings.
fr: Dans cette section, nous assurons un contrôle plus précis sur la façon dont les attributs :attr:`first` et :attr:`last` sont définis dans l'exemple :class:`Custom`. Dans la version précédente de notre module, les variables d'instance :attr:`first` et :attr:`last` pouvaient être définies sur des valeurs autres que des chaînes ou même supprimées. Nous voulons nous assurer que ces attributs contiennent toujours des chaînes.

source: To provide greater control, over the :attr:`first` and :attr:`last` attributes, we'll use custom getter and setter functions. Here are the functions for getting and setting the :attr:`first` attribute::
fr: Pour avoir un meilleur contrôle sur les attributs :attr:`first` et :attr:`last`, nous utilisons des fonctions accesseur (*getter*) et mutateur (*setter*) personnalisées. Voici les fonctions pour obtenir et définir l'attribut :attr:`first` ::

source: The getter function is passed a :class:`Custom` object and a "closure", which is a void pointer. In this case, the closure is ignored. (The closure supports an advanced usage in which definition data is passed to the getter and setter. This could, for example, be used to allow a single set of getter and setter functions that decide the attribute to get or set based on data in the closure.)
fr: L'accesseur reçoit un objet :class:`Custom` et une fermeture qui est un pointeur vide. Dans ce cas, la fermeture est ignorée. (La fermeture prend en charge une utilisation avancée dans laquelle les données de définition sont transmises à l'accesseur et au mutateur. Cela pourrait, par exemple, être utilisé pour autoriser un seul ensemble de fonctions accesseur et mutateur qui décident de l'attribut à obtenir ou à définir en fonction des données dans la fermeture.)

source: The setter function is passed the :class:`Custom` object, the new value, and the closure. The new value may be ``NULL``, in which case the attribute is being deleted. In our setter, we raise an error if the attribute is deleted or if its new value is not a string.
fr: Le mutateur reçoit l'objet :class:`Custom`, la nouvelle valeur et la fermeture. La nouvelle valeur peut être ``NULL``, auquel cas l'attribut est supprimé. Dans notre mutateur, nous levons une erreur si l'attribut est supprimé ou si sa nouvelle valeur n'est pas une chaîne.

source: We create an array of :c:type:`PyGetSetDef` structures::
fr: Nous créons un tableau de structures :c:type:`PyGetSetDef` ::

source: and register it in the :c:member:`~PyTypeObject.tp_getset` slot::
fr: et l'enregistrons dans l'emplacement :c:member:`~PyTypeObject.tp_getset` ::

source: The last item in a :c:type:`PyGetSetDef` structure is the "closure" mentioned above. In this case, we aren't using a closure, so we just pass ``NULL``.
fr: Le dernier élément d'une structure :c:type:`PyGetSetDef` est la fermeture mentionnée ci-dessus. Dans ce cas, nous n'utilisons pas de fermeture, nous passons donc simplement ``NULL``.

source: We also remove the member definitions for these attributes::
fr: Nous supprimons également les définitions de membre pour ces attributs :

source: We also need to update the :c:member:`~PyTypeObject.tp_init` handler to only allow strings [#]_ to be passed::
fr: Nous devons également mettre à jour le gestionnaire :c:member:`~PyTypeObject.tp_init` pour autoriser uniquement le passage des chaînes [#]_ ::

source: With these changes, we can assure that the ``first`` and ``last`` members are never ``NULL`` so we can remove checks for ``NULL`` values in almost all cases. This means that most of the :c:func:`Py_XDECREF` calls can be converted to :c:func:`Py_DECREF` calls. The only place we can't change these calls is in the ``tp_dealloc`` implementation, where there is the possibility that the initialization of these members failed in ``tp_new``.
fr: Avec ces modifications, nous pouvons garantir que les membres ``first`` et ``last`` ne sont jamais ``NULL``, nous pouvons donc supprimer les vérifications des valeurs ``NULL`` dans presque tous les cas. Cela signifie que la plupart des appels :c:func:`Py_XDECREF` peuvent être convertis en appels :c:func:`Py_DECREF`. Le seul endroit où nous ne pouvons pas modifier ces appels est dans l'implémentation de ``tp_dealloc``, où il est possible que l'initialisation de ces membres ait échoué dans ``tp_new``.

source: We also rename the module initialization function and module name in the initialization function, as we did before, and we add an extra definition to the :file:`setup.py` file.
fr: Nous renommons également la fonction d'initialisation du module et le nom du module dans la fonction d'initialisation, comme nous l'avons fait précédemment, et nous ajoutons une définition supplémentaire au fichier :file:`setup.py`.

source: Supporting cyclic garbage collection
fr: Prise en charge du ramasse-miettes cyclique

source: Python has a :term:`cyclic garbage collector (GC) <garbage collection>` that can identify unneeded objects even when their reference counts are not zero. This can happen when objects are involved in cycles. For example, consider:
fr: Python a un :term:`ramasse-miettes cyclique <garbage collection>` qui peut identifier les objets inutiles même lorsque leur compteur de références n'est pas nul. Cela peut se produire lorsque des objets sont impliqués dans des cycles. Par exemple, considérons :

source: In this example, we create a list that contains itself. When we delete it, it still has a reference from itself. Its reference count doesn't drop to zero. Fortunately, Python's cyclic garbage collector will eventually figure out that the list is garbage and free it.
fr: Dans cet exemple, nous créons une liste qui se contient elle-même. Lorsque nous la supprimons, il existe toujours une référence à elle-même. Son compteur de références ne tombe pas à zéro. Heureusement, le ramasse-miettes cyclique de Python finira par comprendre que la liste est un déchet et la libérera.

source: In the second version of the :class:`Custom` example, we allowed any kind of object to be stored in the :attr:`first` or :attr:`last` attributes [#]_. Besides, in the second and third versions, we allowed subclassing :class:`Custom`, and subclasses may add arbitrary attributes. For any of those two reasons, :class:`Custom` objects can participate in cycles:
fr: Dans la seconde version de l'exemple :class:`Custom`, nous avons autorisé le stockage de n'importe quel type d'objet dans les attributs :attr:`first` ou :attr:`last` [#]_. De plus, dans les deuxième et troisième versions, nous avons autorisé le sous-classement de :class:`Custom`, et les sous-classes peuvent ajouter des attributs arbitraires. Pour l'une de ces deux raisons, les objets :class:`Custom` peuvent produire des cycles :

source: To allow a :class:`Custom` instance participating in a reference cycle to be properly detected and collected by the cyclic GC, our :class:`Custom` type needs to fill two additional slots and to enable a flag that enables these slots:
fr: Pour permettre à une instance :class:`Custom` participant à des références cycliques d'être correctement détectée et collectée par le ramasse-miettes cyclique, notre type :class:`Custom` doit définir deux emplacements supplémentaires et activer un drapeau qui active ces emplacements :

source: First, the traversal method lets the cyclic GC know about subobjects that could participate in cycles::
fr: Tout d'abord, la méthode de parcours (*Custom_traverse*) permet au ramasse-miettes cyclique de connaître les sous-objets qui pourraient conduire à des cycles ::

source: For each subobject that can participate in cycles, we need to call the :c:func:`visit` function, which is passed to the traversal method. The :c:func:`visit` function takes as arguments the subobject and the extra argument *arg* passed to the traversal method. It returns an integer value that must be returned if it is non-zero.
fr: Pour chaque sous-objet pouvant conduire à des cycles, nous devons appeler la fonction :c:func:`visit`, qui est passée à la méthode de parcours. La fonction :c:func:`visit` prend comme arguments le sous-objet et l'argument supplémentaire *arg* passé à la méthode de parcours. Elle renvoie une valeur entière qui doit être renvoyée si elle est différente de zéro.

source: Python provides a :c:func:`Py_VISIT` macro that automates calling visit functions. With :c:func:`Py_VISIT`, we can minimize the amount of boilerplate in ``Custom_traverse``::
fr: Python fournit une macro :c:func:`Py_VISIT` qui automatise l'appel des fonctions de visite. Avec :c:func:`Py_VISIT`, nous pouvons minimiser la quantité de code générique dans ``Custom_traverse`` ::

source: The :c:member:`~PyTypeObject.tp_traverse` implementation must name its arguments exactly *visit* and *arg* in order to use :c:func:`Py_VISIT`.
fr: l'implémentation :c:member:`~PyTypeObject.tp_traverse` doit nommer ses arguments exactement *visit* et *arg* afin d'utiliser :c:func:`Py_VISIT`.

source: Second, we need to provide a method for clearing any subobjects that can participate in cycles::
fr: Deuxièmement, nous devons fournir une méthode pour effacer tous les sous-objets qui peuvent conduire à des cycles ::

source: Notice the use of the :c:func:`Py_CLEAR` macro. It is the recommended and safe way to clear data attributes of arbitrary types while decrementing their reference counts. If you were to call :c:func:`Py_XDECREF` instead on the attribute before setting it to ``NULL``, there is a possibility that the attribute's destructor would call back into code that reads the attribute again (*especially* if there is a reference cycle).
fr: Notez l'utilisation de la macro :c:func:`Py_CLEAR`. C'est le moyen recommandé et sûr d'effacer les attributs de données de types arbitraires tout en décrémentant leur compteur de références. Si vous deviez appeler :c:func:`Py_XDECREF` à la place sur l'attribut avant de le définir sur ``NULL``, il est possible que le destructeur de l'attribut appelle du code qui lit à nouveau l'attribut (*surtout* s'il existe un cycle de références).

source: You could emulate :c:func:`Py_CLEAR` by writing::
fr: vous pouvez émuler :c:func:`Py_CLEAR` en écrivant ::

source: Nevertheless, it is much easier and less error-prone to always use :c:func:`Py_CLEAR` when deleting an attribute. Don't try to micro-optimize at the expense of robustness!
fr: Néanmoins, il est beaucoup plus facile et moins sujet aux erreurs de toujours utiliser :c:func:`Py_CLEAR` lors de la suppression d'un attribut. N'essayez pas de micro-optimiser au détriment de la robustesse !

source: The deallocator ``Custom_dealloc`` may call arbitrary code when clearing attributes. It means the circular GC can be triggered inside the function. Since the GC assumes reference count is not zero, we need to untrack the object from the GC by calling :c:func:`PyObject_GC_UnTrack` before clearing members. Here is our reimplemented deallocator using :c:func:`PyObject_GC_UnTrack` and ``Custom_clear``::
fr: La fonction de libération de la mémoire ``Custom_dealloc`` peut appeler du code arbitraire lors de la suppression des attributs. Cela signifie que le ramasse-miettes cyclique peut être déclenché à l'intérieur de la fonction. Étant donné que le ramasse-miettes suppose que le nombre de références n'est pas nul, nous devons annuler le suivi de l'objet par le ramasse-miettes en appelant :c:func:`PyObject_GC_UnTrack` avant d'effacer les membres. Voici notre fonction de libération de la mémoire réimplémentée en utilisant :c:func:`PyObject_GC_UnTrack` et ``Custom_clear`` ::

source: Finally, we add the :c:macro:`Py_TPFLAGS_HAVE_GC` flag to the class flags::
fr: Enfin, nous ajoutons le drapeau :c:macro:`Py_TPFLAGS_HAVE_GC` aux drapeaux de la classe ::

source: That's pretty much it. If we had written custom :c:member:`~PyTypeObject.tp_alloc` or :c:member:`~PyTypeObject.tp_free` handlers, we'd need to modify them for cyclic garbage collection. Most extensions will use the versions automatically provided.
fr: C'est à peu près tout. Si nous avions écrit des gestionnaires personnalisés :c:member:`~PyTypeObject.tp_alloc` ou :c:member:`~PyTypeObject.tp_free`, nous aurions besoin de les modifier pour le ramasse-miettes cyclique. La plupart des extensions utilisent les versions fournies automatiquement.

source: Subclassing other types
fr: Sous-classement d'autres types

source: It is possible to create new extension types that are derived from existing types. It is easiest to inherit from the built in types, since an extension can easily use the :c:type:`PyTypeObject` it needs. It can be difficult to share these :c:type:`PyTypeObject` structures between extension modules.
fr: Il est possible de créer de nouveaux types d'extension dérivés de types existants. Il est plus facile d'hériter des types natifs, car une extension peut facilement utiliser le :c:type:`PyTypeObject` dont elle a besoin. Il peut être difficile de partager ces structures :c:type:`PyTypeObject` entre modules d'extension.

source: In this example we will create a :class:`SubList` type that inherits from the built-in :class:`list` type. The new type will be completely compatible with regular lists, but will have an additional :meth:`increment` method that increases an internal counter:
fr: Dans cet exemple, nous allons créer un type :class:`SubList` qui hérite du type intégré :class:`list`. Le nouveau type sera complètement compatible avec les listes natives, mais aura une méthode supplémentaire :meth:`increment` qui augmente un compteur interne :

source: As you can see, the source code closely resembles the :class:`Custom` examples in previous sections. We will break down the main differences between them. ::
fr: Comme vous pouvez le voir, le code source ressemble beaucoup aux exemples :class:`Custom` des sections précédentes. Analysons les principales différences ::
