Repository: python/python-docs-fr
Catalog: extending/newtypes.po
Languages: fr

source: Defining Extension Types: Assorted Topics
fr: Définir les types d'extension : divers sujets

source: This section aims to give a quick fly-by on the various type methods you can implement and what they do.
fr: Cette section vise à donner un aperçu rapide des différentes méthodes de type que vous pouvez implémenter et de ce qu'elles font.

source: Here is the definition of :c:type:`PyTypeObject`, with some fields only used in :ref:`debug builds <debug-build>` omitted:
fr: Voici la définition de :c:type:`PyTypeObject`, après avoir enlevé certains champs utilisés uniquement dans :ref:`debug builds <debug-build>` :

source: Now that's a *lot* of methods. Don't worry too much though -- if you have a type you want to define, the chances are very good that you will only implement a handful of these.
fr: Cela fait *beaucoup* de méthodes. Ne vous inquiétez pas trop cependant : si vous souhaitez définir un type, il y a de fortes chances que vous n'implémentiez qu'une petite partie d'entre elles.

source: As you probably expect by now, we're going to go over this and give more information about the various handlers. We won't go in the order they are defined in the structure, because there is a lot of historical baggage that impacts the ordering of the fields. It's often easiest to find an example that includes the fields you need and then change the values to suit your new type. ::
fr: Comme vous vous en doutez probablement maintenant, nous allons passer en revue cela et donner plus d'informations sur les différents gestionnaires. Nous ne suivrons pas l'ordre dans lequel ils sont définis dans la structure, car l'ordre des champs résulte d'un certain historique. Il est souvent plus facile de trouver un exemple qui inclut les champs dont vous avez besoin, puis de modifier les valeurs en fonction de votre nouveau type ::

source: The name of the type -- as mentioned in the previous chapter, this will appear in various places, almost entirely for diagnostic purposes. Try to choose something that will be helpful in such a situation! ::
fr: Le nom du type – comme mentionné dans le chapitre précédent, cela apparaîtra à divers endroits, presque entièrement à des fins de diagnostic. Essayez de choisir quelque chose qui sera utile dans une telle situation ! ::

source: These fields tell the runtime how much memory to allocate when new objects of this type are created. Python has some built-in support for variable length structures (think: strings, tuples) which is where the :c:member:`~PyTypeObject.tp_itemsize` field comes in. This will be dealt with later. ::
fr: Ces champs indiquent la quantité de mémoire à allouer à l'exécution lorsque de nouveaux objets de ce type sont créés. Python prend en charge nativement des structures de longueur variable (pensez : chaînes, *n*-uplets), c'est là que le champ :c:member:`~PyTypeObject.tp_itemsize` entre en jeu. Cela sera traité plus tard. ::

source: Here you can put a string (or its address) that you want returned when the Python script references ``obj.__doc__`` to retrieve the doc string.
fr: Ici vous pouvez mettre une chaîne (ou son adresse) que vous voulez renvoyer lorsque le script Python référence ``obj.__doc__`` pour récupérer le *docstring*.

source: Now we come to the basic type methods -- the ones most extension types will implement.
fr: Nous en arrivons maintenant aux méthodes de type basiques -- celles que la plupart des types d'extension mettront en œuvre.

source: Finalization and De-allocation
fr: Finalisation et libération de mémoire

source: This function is called when the reference count of the instance of your type is reduced to zero and the Python interpreter wants to reclaim it. If your type has memory to free or other clean-up to perform, you can put it here. The object itself needs to be freed here as well. Here is an example of this function::
fr: Cette fonction est appelée lorsque le compteur de références de l'instance de votre type tombe à zéro et que l'interpréteur Python veut récupérer la mémoire afférente. Si votre type a de la mémoire à libérer ou un autre nettoyage à effectuer, vous pouvez le mettre ici. L'objet lui-même doit être libéré ici aussi. Voici un exemple de cette fonction ::

source: If your type supports garbage collection, the destructor should call :c:func:`PyObject_GC_UnTrack` before clearing any member fields::
fr: Si votre type prend en charge le ramasse-miettes, le destructeur doit appeler :c:func:`PyObject_GC_UnTrack` avant d'effacer les champs membres ::

source: One important requirement of the deallocator function is that it leaves any pending exceptions alone. This is important since deallocators are frequently called as the interpreter unwinds the Python stack; when the stack is unwound due to an exception (rather than normal returns), nothing is done to protect the deallocators from seeing that an exception has already been set. Any actions which a deallocator performs which may cause additional Python code to be executed may detect that an exception has been set. This can lead to misleading errors from the interpreter. The proper way to protect against this is to save a pending exception before performing the unsafe action, and restoring it when done. This can be done using the :c:func:`PyErr_Fetch` and :c:func:`PyErr_Restore` functions::
fr: Une exigence importante de la fonction de libération de la mémoire est de ne pas s'occuper de toutes les exceptions en attente. C'est important car les fonctions de libération de la mémoire sont fréquemment appelées lorsque l'interpréteur remonte la pile d'appels Python ; lorsque la pile est remontée à cause d'une exception (plutôt que de retours normaux), les fonctions de libération peuvent voir qu'une exception a déjà été définie. Toute action effectuée par une fonction de libération de la mémoire pouvant entraîner l'exécution de code Python supplémentaire peut détecter qu'une exception a été définie. Cela peut conduire l’interpréteur à se tromper sur la nature de l'erreur. La bonne façon d'éviter cela est d'enregistrer une exception en attente avant d'effectuer l'action non sécurisée et à la restaurer une fois terminée. Cela peut être fait en utilisant les fonctions :c:func:`PyErr_Fetch` et :c:func:`PyErr_Restore` ::

source: There are limitations to what you can safely do in a deallocator function. First, if your type supports garbage collection (using :c:member:`~PyTypeObject.tp_traverse` and/or :c:member:`~PyTypeObject.tp_clear`), some of the object's members can have been cleared or finalized by the time :c:member:`~PyTypeObject.tp_dealloc` is called. Second, in :c:member:`~PyTypeObject.tp_dealloc`, your object is in an unstable state: its reference count is equal to zero. Any call to a non-trivial object or API (as in the example above) might end up calling :c:member:`~PyTypeObject.tp_dealloc` again, causing a double free and a crash.
fr: des limites existent à ce que vous pouvez faire en toute sécurité dans une fonction de libération de la mémoire. Tout d'abord, si votre type prend en charge le ramasse-miettes (en utilisant :c:member:`~PyTypeObject.tp_traverse` et/ou :c:member:`~PyTypeObject.tp_clear`), certains membres de l'objet peuvent avoir été effacés ou finalisés avant que :c:member:`~PyTypeObject.tp_dealloc` ne soit appelé. Deuxièmement, dans :c:member:`~PyTypeObject.tp_dealloc`, votre objet est dans un état instable : son compteur de références est égal à zéro. Tout appel à un objet non trivial ou à une API (comme dans l'exemple ci-dessus) peut finir par appeler :c:member:`~PyTypeObject.tp_dealloc` à nouveau, provoquant une double libération et un plantage.

source: Starting with Python 3.4, it is recommended not to put any complex finalization code in :c:member:`~PyTypeObject.tp_dealloc`, and instead use the new :c:member:`~PyTypeObject.tp_finalize` type method.
fr: À partir de Python 3.4, il est recommandé de ne pas mettre de code de finalisation complexe dans :c:member:`~PyTypeObject.tp_dealloc`, et d'utiliser à la place la nouvelle méthode de type :c:member:`~PyTypeObject.tp_finalize`.

source: :pep:`442` explains the new finalization scheme.
fr: :pep:`442` explique le nouveau schéma de finalisation.

source: Object Presentation
fr: Présentation de l'objet

source: In Python, there are two ways to generate a textual representation of an object: the :func:`repr` function, and the :func:`str` function. (The :func:`print` function just calls :func:`str`.) These handlers are both optional.
fr: En Python, il existe deux façons de générer une représentation textuelle d'un objet : la fonction :func:`repr` et la fonction :func:`str` (la fonction :func:`print` appelle simplement :func:`str`). Ces gestionnaires sont tous deux facultatifs.

source: The :c:member:`~PyTypeObject.tp_repr` handler should return a string object containing a representation of the instance for which it is called. Here is a simple example::
fr: Le gestionnaire :c:member:`~PyTypeObject.tp_repr` doit renvoyer un objet chaîne contenant une représentation de l'instance pour laquelle il est appelé. Voici un exemple simple ::

source: If no :c:member:`~PyTypeObject.tp_repr` handler is specified, the interpreter will supply a representation that uses the type's :c:member:`~PyTypeObject.tp_name` and a uniquely identifying value for the object.
fr: Si aucun gestionnaire :c:member:`~PyTypeObject.tp_repr` n'est spécifié, l'interpréteur fournira une représentation qui utilise le type :c:member:`~PyTypeObject.tp_name` et une valeur d'identification unique pour l'objet.

source: The :c:member:`~PyTypeObject.tp_str` handler is to :func:`str` what the :c:member:`~PyTypeObject.tp_repr` handler described above is to :func:`repr`; that is, it is called when Python code calls :func:`str` on an instance of your object. Its implementation is very similar to the :c:member:`~PyTypeObject.tp_repr` function, but the resulting string is intended for human consumption. If :c:member:`~PyTypeObject.tp_str` is not specified, the :c:member:`~PyTypeObject.tp_repr` handler is used instead.
fr: Le gestionnaire :c:member:`~PyTypeObject.tp_str` est à :func:`str` ce que le gestionnaire :c:member:`~PyTypeObject.tp_repr` décrit ci-dessus est à :func:`repr` ; c'est-à-dire qu'il est appelé lorsque le code Python appelle :func:`str` sur une instance de votre objet. Son implémentation est très similaire à la fonction :c:member:`~PyTypeObject.tp_repr`, mais la chaîne résultante est destinée à être lue par des utilisateurs. Si :c:member:`~PyTypeObject.tp_str` n'est pas spécifié, le gestionnaire :c:member:`~PyTypeObject.tp_repr` est utilisé à la place.

source: Here is a simple example::
fr: Voici un exemple simple ::

source: Attribute Management
fr: Gestion des attributs

source: For every object which can support attributes, the corresponding type must provide the functions that control how the attributes are resolved. There needs to be a function which can retrieve attributes (if any are defined), and another to set attributes (if setting attributes is allowed). Removing an attribute is a special case, for which the new value passed to the handler is ``NULL``.
fr: Pour chaque objet pouvant prendre en charge des attributs, le type correspondant doit fournir les fonctions qui contrôlent la façon dont les attributs sont résolus. Il doit y avoir une fonction qui peut récupérer les attributs (le cas échéant) et une autre pour définir les attributs (si la définition des attributs est autorisée). La suppression d'un attribut est un cas particulier, pour lequel la nouvelle valeur transmise au gestionnaire est ``NULL``.

source: Python supports two pairs of attribute handlers; a type that supports attributes only needs to implement the functions for one pair. The difference is that one pair takes the name of the attribute as a :c:expr:`char\*`, while the other accepts a :c:expr:`PyObject*`. Each type can use whichever pair makes more sense for the implementation's convenience. ::
fr: Python prend en charge deux paires de gestionnaires d'attributs ; un type qui prend en charge les attributs n'a besoin d'implémenter les fonctions que pour une paire. La différence est qu'une paire prend le nom de l'attribut en tant que :c:expr:`char\*`, tandis que l'autre accepte un :c:expr:`PyObject*`. Chaque type peut utiliser la paire la plus logique pour la commodité de l'implémentation. ::

source: If accessing attributes of an object is always a simple operation (this will be explained shortly), there are generic implementations which can be used to provide the :c:expr:`PyObject*` version of the attribute management functions. The actual need for type-specific attribute handlers almost completely disappeared starting with Python 2.2, though there are many examples which have not been updated to use some of the new generic mechanism that is available.
fr: Si accéder aux attributs d'un objet est toujours une opération simple (ceci sera expliqué brièvement), il existe des implémentations génériques qui peuvent être utilisées pour fournir la version :c:expr:`PyObject*` des fonctions de gestion des attributs. Le besoin réel de gestionnaires d'attributs spécifiques au type a presque complètement disparu à partir de Python 2.2, bien qu'il existe de nombreux exemples qui n'ont pas été mis à jour pour utiliser certains des nouveaux mécanismes génériques disponibles.

source: Generic Attribute Management
fr: Gestion des attributs génériques

source: Most extension types only use *simple* attributes. So, what makes the attributes simple? There are only a couple of conditions that must be met:
fr: La plupart des types d'extensions n'utilisent que des attributs *simples*. Alors, qu'est-ce qui rend les attributs simples ? Seules quelques conditions doivent être remplies :

source: The name of the attributes must be known when :c:func:`PyType_Ready` is called.
fr: le nom des attributs doit être déjà connu lorsqu'on lance :c:func:`PyType_Ready` ;

source: No special processing is needed to record that an attribute was looked up or set, nor do actions need to be taken based on the value.
fr: aucun traitement spécial n'est nécessaire pour enregistrer qu'un attribut a été recherché ou défini, et aucune action ne doit être entreprise en fonction de la valeur.

source: Note that this list does not place any restrictions on the values of the attributes, when the values are computed, or how relevant data is stored.
fr: Notez que cette liste n'impose aucune restriction sur les valeurs des attributs, le moment où les valeurs sont calculées ou la manière dont les données pertinentes sont stockées.

source: When :c:func:`PyType_Ready` is called, it uses three tables referenced by the type object to create :term:`descriptor`\s which are placed in the dictionary of the type object. Each descriptor controls access to one attribute of the instance object. Each of the tables is optional; if all three are ``NULL``, instances of the type will only have attributes that are inherited from their base type, and should leave the :c:member:`~PyTypeObject.tp_getattro` and :c:member:`~PyTypeObject.tp_setattro` fields ``NULL`` as well, allowing the base type to handle attributes.
fr: Lorsque :c:func:`PyType_Ready` est appelé, il utilise trois tableaux référencés par l'objet type pour créer des :term:`descripteurs <descriptor>` qui sont placés dans le dictionnaire de l'objet type. Chaque descripteur contrôle l'accès à un attribut de l'objet instance. Chacun des tableaux est facultatif ; si les trois sont ``NULL``, les instances du type n'auront que des attributs hérités de leur type de base et doivent laisser les champs :c:member:`~PyTypeObject.tp_getattro` et :c:member:`~PyTypeObject .tp_setattro` à ``NULL`` également, permettant au type de base de gérer les attributs.

source: The tables are declared as three fields of the type object::
fr: Les tableaux sont déclarés sous la forme de trois champs de type objet ::

source: If :c:member:`~PyTypeObject.tp_methods` is not ``NULL``, it must refer to an array of :c:type:`PyMethodDef` structures. Each entry in the table is an instance of this structure::
fr: Si :c:member:`~PyTypeObject.tp_methods` n'est pas ``NULL``, il doit faire référence à un tableau de structures :c:type:`PyMethodDef`. Chaque entrée du tableau est une instance de cette structure ::

source: The second table is used to define attributes which map directly to data stored in the instance. A variety of primitive C types are supported, and access may be read-only or read-write. The structures in the table are defined as::
fr: Le deuxième tableau est utilisé pour définir les attributs qui correspondent directement aux données stockées dans l'instance. Divers types C natifs sont pris en charge et l'accès peut être en lecture seule ou en lecture-écriture. Les structures du tableau sont définies comme suit :

source: Type-specific Attribute Management
fr: Gestion des attributs de type spécifiques

source: For simplicity, only the :c:expr:`char\*` version will be demonstrated here; the type of the name parameter is the only difference between the :c:expr:`char\*` and :c:expr:`PyObject*` flavors of the interface. This example effectively does the same thing as the generic example above, but does not use the generic support added in Python 2.2. It explains how the handler functions are called, so that if you do need to extend their functionality, you'll understand what needs to be done.
fr: Pour plus de simplicité, seule la version :c:expr:`char\*` est montrée ici ; le type du paramètre *name* est la seule différence entre les variations :c:expr:`char\*` et :c:expr:`PyObject*` de l'interface. Cet exemple fait effectivement la même chose que l'exemple générique ci-dessus, mais n'utilise pas le support générique ajouté dans Python 2.2. Il explique comment les fonctions de gestionnaire sont appelées, de sorte que si vous avez besoin d'étendre leurs fonctionnalités, vous comprendrez ce qui doit être fait.

source: Here is an example::
fr: Voici un exemple ::

source: Object Comparison
fr: Comparaison des objets

source: This function is called with two Python objects and the operator as arguments, where the operator is one of ``Py_EQ``, ``Py_NE``, ``Py_LE``, ``Py_GE``, ``Py_LT`` or ``Py_GT``. It should compare the two objects with respect to the specified operator and return ``Py_True`` or ``Py_False`` if the comparison is successful, ``Py_NotImplemented`` to indicate that comparison is not implemented and the other object's comparison method should be tried, or ``NULL`` if an exception was set.
fr: Cette fonction est appelée avec deux objets Python et l'opérateur comme arguments, où l'opérateur est ``Py_EQ``, ``Py_NE``, ``Py_LE``, ``Py_GE``, ``Py_LT`` ou ``Py_GT``. Elle doit comparer les deux objets conformément à l'opérateur spécifié et renvoyer ``Py_True`` ou ``Py_False`` si la comparaison a réussi, ``Py_NotImplemented`` pour indiquer que la comparaison n'est pas implémentée et que la méthode de comparaison de l'autre objet doit être essayée, ou ``NULL`` si une exception doit être levée.

source: Here is a sample implementation, for a datatype that is considered equal if the size of an internal pointer is equal::
fr: Voici un exemple d'implémentation, pour un type de données où l'égalité signifie que la taille d'un pointeur interne est égale :

source: Abstract Protocol Support
fr: Gestion de protocoles abstraits

source: Python supports a variety of *abstract* 'protocols;' the specific interfaces provided to use these interfaces are documented in :ref:`abstract`.
fr: Python prend en charge divers « protocoles » *abstraits* ; les interfaces spécifiques fournies pour utiliser ces interfaces sont documentées dans :ref:`abstract`.

source: A number of these abstract interfaces were defined early in the development of the Python implementation. In particular, the number, mapping, and sequence protocols have been part of Python since the beginning. Other protocols have been added over time. For protocols which depend on several handler routines from the type implementation, the older protocols have been defined as optional blocks of handlers referenced by the type object. For newer protocols there are additional slots in the main type object, with a flag bit being set to indicate that the slots are present and should be checked by the interpreter. (The flag bit does not indicate that the slot values are non-``NULL``. The flag may be set to indicate the presence of a slot, but a slot may still be unfilled.) ::
fr: Un certain nombre de ces interfaces abstraites ont été définies au début du développement de l'implémentation Python. En particulier, les protocoles de nombre, de correspondance et de séquence font partie de Python depuis le début. D'autres protocoles ont été ajoutés au fil du temps. Pour les protocoles qui dépendent de plusieurs routines de gestionnaire de l'implémentation du type, les anciens protocoles ont été définis comme des blocs facultatifs de gestionnaires référencés par l'objet type. Pour les protocoles plus récents, il existe des emplacements supplémentaires dans l'objet de type principal, avec un bit d'indicateur défini pour indiquer que les emplacements sont présents et doivent être vérifiés par l'interpréteur (le bit d'indicateur n'indique pas que les valeurs d'emplacement ne sont pas ``NULL`` ; il peut être défini pour indiquer la présence d'un emplacement, mais un emplacement peut toujours être vide). ::

source: If you wish your object to be able to act like a number, a sequence, or a mapping object, then you place the address of a structure that implements the C type :c:type:`PyNumberMethods`, :c:type:`PySequenceMethods`, or :c:type:`PyMappingMethods`, respectively. It is up to you to fill in this structure with appropriate values. You can find examples of the use of each of these in the :file:`Objects` directory of the Python source distribution. ::
fr: Si vous souhaitez que votre objet puisse agir comme un nombre, une séquence ou un tableau de correspondances, placez l'adresse d'une structure qui implémente le type C :c:type:`PyNumberMethods`, :c:type:`PySequenceMethods` ou :c:type:`PyMappingMethods`, respectivement. C'est à vous de remplir cette structure avec les valeurs appropriées. Vous pouvez trouver des exemples d'utilisation de chacun d'entre eux dans le répertoire :file:`Objects` de la distribution source de Python. ::

source: This function, if you choose to provide it, should return a hash number for an instance of your data type. Here is a simple example::
fr: Cette fonction, si vous la fournissez, doit renvoyer un condensat pour une instance de votre type de données. Voici un exemple simple ::

source: This function is called when an instance of your data type is "called", for example, if ``obj1`` is an instance of your data type and the Python script contains ``obj1('hello')``, the :c:member:`~PyTypeObject.tp_call` handler is invoked.
fr: Cette fonction est appelée lorsqu'une instance de votre type de données est « appelée », par exemple, si ``obj1`` est une instance de votre type de données et que le script Python contient ``obj1('hello')``, le gestionnaire :c:member:`~PyTypeObject.tp_call` est appelé.

source: This function takes three arguments:
fr: Cette fonction prend trois arguments :

source: *self* is the instance of the data type which is the subject of the call. If the call is ``obj1('hello')``, then *self* is ``obj1``.
fr: *self* est l'instance du type de données qui fait l'objet de l'appel. Si l'appel est ``obj1('hello')``, alors *self* est ``obj1``.

source: *args* is a tuple containing the arguments to the call. You can use :c:func:`PyArg_ParseTuple` to extract the arguments.
fr: *args* est un *n*-uplet contenant les arguments de l'appel. Vous pouvez utiliser :c:func:`PyArg_ParseTuple` pour extraire les arguments.
