Repository: python/python-docs-fr
Catalog: extending/newtypes_tutorial.po
Languages: fr

source: The primary difference for derived type objects is that the base type's object structure must be the first value. The base type will already include the :c:func:`PyObject_HEAD` at the beginning of its structure.
fr: La principale différence pour les objets d'un type dérivé est que la structure d'objet du type père doit être la première valeur. Le type père inclut déjà le :c:func:`PyObject_HEAD` au début de sa structure.

source: When a Python object is a :class:`SubList` instance, its ``PyObject *`` pointer can be safely cast to both ``PyListObject *`` and ``SubListObject *``::
fr: Lorsqu'un objet Python est une instance de :class:`SubList`, son pointeur ``PyObject *`` peut être trans-typé en toute sécurité vers ``PyListObject *`` et ``SubListObject *`` ::

source: We see above how to call through to the :attr:`__init__` method of the base type.
fr: Nous voyons ci-dessus comment appeler la méthode :attr:`__init__` du type père.

source: This pattern is important when writing a type with custom :c:member:`~PyTypeObject.tp_new` and :c:member:`~PyTypeObject.tp_dealloc` members. The :c:member:`~PyTypeObject.tp_new` handler should not actually create the memory for the object with its :c:member:`~PyTypeObject.tp_alloc`, but let the base class handle it by calling its own :c:member:`~PyTypeObject.tp_new`.
fr: Ce modèle est important lors de l'écriture d'un type avec des membres personnalisés :c:member:`~PyTypeObject.tp_new` et :c:member:`~PyTypeObject.tp_dealloc`. Le gestionnaire :c:member:`~PyTypeObject.tp_new` ne doit pas réellement allouer la mémoire pour l'objet avec son :c:member:`~PyTypeObject.tp_alloc`, mais laisser la classe mère gérer ça en appelant sa propre :c:member:`~PyTypeObject.tp_new`.

source: The :c:type:`PyTypeObject` struct supports a :c:member:`~PyTypeObject.tp_base` specifying the type's concrete base class. Due to cross-platform compiler issues, you can't fill that field directly with a reference to :c:type:`PyList_Type`; it should be done later in the module initialization function::
fr: La structure :c:type:`PyTypeObject` prend en charge un :c:member:`~PyTypeObject.tp_base` spécifiant la classe mère concrète du type. En raison de problèmes de compilateur multiplateformes, vous ne pouvez pas remplir ce champ directement avec une référence à :c:type:`PyList_Type` ; cela doit être fait plus tard dans la fonction d'initialisation du module ::

source: Before calling :c:func:`PyType_Ready`, the type structure must have the :c:member:`~PyTypeObject.tp_base` slot filled in. When we are deriving an existing type, it is not necessary to fill out the :c:member:`~PyTypeObject.tp_alloc` slot with :c:func:`PyType_GenericNew` -- the allocation function from the base type will be inherited.
fr: Avant d'appeler :c:func:`PyType_Ready`, la structure de type doit avoir l'emplacement :c:member:`~PyTypeObject.tp_base` rempli. Lorsque nous dérivons un type existant, il n'est pas nécessaire de remplir l'emplacement :c:member:`~PyTypeObject.tp_alloc` avec :c:func:`PyType_GenericNew` – la fonction d'allocation du type père sera héritée.

source: After that, calling :c:func:`PyType_Ready` and adding the type object to the module is the same as with the basic :class:`Custom` examples.
fr: Ensuite, appeler :c:func:`PyType_Ready` et ajouter l'objet type au module se fait de la même manière qu'avec les exemples de base :class:`Custom`.

source: Footnotes
fr: Notes

source: This is true when we know that the object is a basic type, like a string or a float.
fr: C'est vrai lorsque nous savons que l'objet est un type de base, comme une chaîne ou un flottant.

source: We relied on this in the :c:member:`~PyTypeObject.tp_dealloc` handler in this example, because our type doesn't support garbage collection.
fr: Nous nous sommes appuyés sur le gestionnaire :c:member:`~PyTypeObject.tp_dealloc` dans cet exemple, car notre type ne prend pas en charge le ramasse-miettes.

source: We now know that the first and last members are strings, so perhaps we could be less careful about decrementing their reference counts, however, we accept instances of string subclasses. Even though deallocating normal strings won't call back into our objects, we can't guarantee that deallocating an instance of a string subclass won't call back into our objects.
fr: Nous savons maintenant que les premier et dernier membres sont des chaînes, nous pourrions donc peut-être être moins prudents quant à la décrémentation de leur nombre de références, cependant, nous acceptons les instances de sous-classes de chaînes. Même si la libération de la mémoire des chaînes normales ne rappellera pas nos objets, nous ne pouvons pas garantir que la libération de mémoire d'une instance d'une sous-classe de chaîne ne rappellera pas nos objets.

source: Also, even with our attributes restricted to strings instances, the user could pass arbitrary :class:`str` subclasses and therefore still create reference cycles.
fr: De plus, même avec nos attributs limités aux instances de chaînes, l'utilisateur pourrait passer des sous-classes arbitraires :class:`str` et donc encore créer des références cycliques.
