Repository: python/python-docs-fr
Catalog: reference/compound_stmts.po
Languages: fr

source: Compound statements
fr: Instructions composées

source: Compound statements contain (groups of) other statements; they affect or control the execution of those other statements in some way. In general, compound statements span multiple lines, although in simple incarnations a whole compound statement may be contained in one line.
fr: Les instructions composées contiennent d'autres (groupes d’) instructions ; elles affectent ou contrôlent l'exécution de ces autres instructions d'une manière ou d'une autre. En général, une instruction composée couvre plusieurs lignes bien que, dans sa forme la plus simple, une instruction composée peut tenir sur une seule ligne.

source: The :keyword:`if`, :keyword:`while` and :keyword:`for` statements implement traditional control flow constructs. :keyword:`try` specifies exception handlers and/or cleanup code for a group of statements, while the :keyword:`with` statement allows the execution of initialization and finalization code around a block of code. Function and class definitions are also syntactically compound statements.
fr: Les instructions :keyword:`if`, :keyword:`while` et :keyword:`for` implémentent les constructions classiques de contrôle de flux. :keyword:`try` définit des gestionnaires d'exception et du code de nettoyage pour un groupe d'instructions, tandis que l'instruction :keyword:`with` permet l'exécution de code d'initialisation et de finalisation autour d'un bloc de code. Les définitions de fonctions et de classes sont également, au sens syntaxique, des instructions composées.

source: A compound statement consists of one or more 'clauses.' A clause consists of a header and a 'suite.' The clause headers of a particular compound statement are all at the same indentation level. Each clause header begins with a uniquely identifying keyword and ends with a colon. A suite is a group of statements controlled by a clause. A suite can be one or more semicolon-separated simple statements on the same line as the header, following the header's colon, or it can be one or more indented statements on subsequent lines. Only the latter form of a suite can contain nested compound statements; the following is illegal, mostly because it wouldn't be clear to which :keyword:`if` clause a following :keyword:`else` clause would belong::
fr: Une instruction composée comporte une ou plusieurs « clauses ». Une clause se compose d'un en-tête et d'une « suite ». Les en-têtes des clauses d'une instruction composée particulière sont toutes placées au même niveau d'indentation. Chaque en-tête de clause commence par un mot-clé spécifique et se termine par le caractère deux-points (``:``) ; une suite est un groupe d'instructions contrôlées par une clause ; une suite se compose, après les deux points de l'en-tête, soit d'une ou plusieurs instructions simples séparées par des points-virgules si elles sont sur la même ligne que l'en-tête, soit d'une ou plusieurs instructions en retrait sur les lignes suivantes. Seule cette dernière forme d'une suite peut contenir des instructions composées ; ce qui suit n'est pas licite, principalement parce qu'il ne serait pas clair de savoir à quelle clause :keyword:`if` se rapporterait une clause :keyword:`else` placée en fin de ligne ::

source: Also note that the semicolon binds tighter than the colon in this context, so that in the following example, either all or none of the :func:`print` calls are executed::
fr: Notez également que le point-virgule se lie plus étroitement que le deux-points dans ce contexte, de sorte que dans l'exemple suivant, soit tous les appels :func:`print` sont exécutés, soit aucun ne l'est ::

source: Summarizing:
fr: En résumé :

source: Note that statements always end in a ``NEWLINE`` possibly followed by a ``DEDENT``. Also note that optional continuation clauses always begin with a keyword that cannot start a statement, thus there are no ambiguities (the 'dangling :keyword:`else`' problem is solved in Python by requiring nested :keyword:`if` statements to be indented).
fr: Notez que ces instructions se terminent toujours par un lexème ``NEWLINE`` suivi éventuellement d'un ``DEDENT``. Notez également que les clauses facultatives qui suivent commencent toujours par un mot-clé qui ne peut pas commencer une instruction. Ainsi, il n'y a pas d'ambiguïté (le problème du :keyword:`else` dont on ne sait pas à quel ``if`` il est relié est résolu en Python en exigeant que des instructions :keyword:`if` imbriquées soient indentées les unes par rapport aux autres).

source: The formatting of the grammar rules in the following sections places each clause on a separate line for clarity.
fr: L'agencement des règles de grammaire dans les sections qui suivent place chaque clause sur une ligne séparée pour plus de clarté.

source: The :keyword:`!if` statement
fr: L'instruction :keyword:`!if`

source: The :keyword:`if` statement is used for conditional execution:
fr: L'instruction :keyword:`if` est utilisée pour exécuter des instructions en fonction d'une condition :

source: It selects exactly one of the suites by evaluating the expressions one by one until one is found to be true (see section :ref:`booleans` for the definition of true and false); then that suite is executed (and no other part of the :keyword:`if` statement is executed or evaluated). If all expressions are false, the suite of the :keyword:`else` clause, if present, is executed.
fr: Elle sélectionne exactement une des suites en évaluant les expressions une par une jusqu'à ce qu'une soit vraie (voir la section :ref:`booleans` pour la définition de vrai et faux) ; ensuite cette suite est exécutée (et aucune autre partie de l'instruction :keyword:`if` n'est exécutée ou évaluée). Si toutes les expressions sont fausses, la suite de la clause :keyword:`else`, si elle existe, est exécutée.

source: The :keyword:`!while` statement
fr: L'instruction :keyword:`!while`

source: The :keyword:`while` statement is used for repeated execution as long as an expression is true:
fr: L'instruction :keyword:`while` est utilisée pour exécuter des instructions de manière répétée tant qu'une expression est vraie :

source: This repeatedly tests the expression and, if it is true, executes the first suite; if the expression is false (which may be the first time it is tested) the suite of the :keyword:`!else` clause, if present, is executed and the loop terminates.
fr: Python évalue l'expression de manière répétée et, tant qu'elle est vraie, exécute la première suite ; si l'expression est fausse (ce qui peut arriver même lors du premier test), la suite de la clause :keyword:`!else`, si elle existe, est exécutée et la boucle se termine.

source: A :keyword:`break` statement executed in the first suite terminates the loop without executing the :keyword:`!else` clause's suite. A :keyword:`continue` statement executed in the first suite skips the rest of the suite and goes back to testing the expression.
fr: Une instruction :keyword:`break` exécutée dans la première suite termine la boucle sans exécuter la suite de la clause :keyword:`!else`. Une instruction :keyword:`continue` exécutée dans la première suite saute le reste de la suite et retourne au test de l'expression.

source: The :keyword:`!for` statement
fr: L'instruction :keyword:`!for`

source: The :keyword:`for` statement is used to iterate over the elements of a sequence (such as a string, tuple or list) or other iterable object:
fr: L'instruction :keyword:`for` est utilisée pour itérer sur les éléments d'une séquence (par exemple une chaîne, un *n*-uplet ou une liste) ou un autre objet itérable :

source: The ``starred_list`` expression is evaluated once; it should yield an :term:`iterable` object. An :term:`iterator` is created for that iterable. The first item provided by the iterator is then assigned to the target list using the standard rules for assignments (see :ref:`assignment`), and the suite is executed. This repeats for each item provided by the iterator. When the iterator is exhausted, the suite in the :keyword:`!else` clause, if present, is executed, and the loop terminates.
fr: L'expression ``starred_list`` n'est évaluée qu'une seule fois ; elle doit produire un objet :term:`iterable`. Un :term:`iterator` est créé pour cet itérable. Le premier élément produit par l'itérateur est assigné à la liste cible (*target_list* dans la grammaire ci-dessus) en utilisant les règles des affectations (voir :ref:`assignment`), puis la « suite » est exécutée. Lorsque les éléments de l'itérateur sont épuisés, la « suite » de la clause :keyword:`!else`, si elle existe, est exécutée et la boucle se termine.

source: A :keyword:`break` statement executed in the first suite terminates the loop without executing the :keyword:`!else` clause's suite. A :keyword:`continue` statement executed in the first suite skips the rest of the suite and continues with the next item, or with the :keyword:`!else` clause if there is no next item.
fr: Une instruction :keyword:`break` exécutée dans la première suite termine la boucle sans exécuter la suite de la clause :keyword:`!else`. Une instruction :keyword:`continue` exécutée dans la première suite saute le reste de la suite et continue avec l'élément suivant, ou avec la clause :keyword:`!else` s'il n'y a pas d'élément suivant.

source: The for-loop makes assignments to the variables in the target list. This overwrites all previous assignments to those variables including those made in the suite of the for-loop::
fr: La boucle ``for`` effectue des affectations aux variables de la liste cible, ce qui écrase toutes les affectations antérieures de ces variables, y compris celles effectuées dans la suite de la boucle ``for`` ::

source: Names in the target list are not deleted when the loop is finished, but if the sequence is empty, they will not have been assigned to at all by the loop. Hint: the built-in type :func:`range` represents immutable arithmetic sequences of integers. For instance, iterating ``range(3)`` successively yields 0, 1, and then 2.
fr: Les noms dans la liste cible ne sont pas supprimés lorsque la boucle est terminée mais, si la séquence est vide, ils n'auront pas du tout été assignés par la boucle. Petite astuce : le type natif :func:`range` représente des suites arithmétiques immuables de nombres entiers ; par exemple, itérer sur ``range(3)`` renvoie successivement les entiers 0, 1 et 2.

source: Starred elements are now allowed in the expression list.
fr: les éléments étoilés sont maintenant autorisés dans l'expression liste.

source: The :keyword:`!try` statement
fr: L'instruction :keyword:`!try`

source: The :keyword:`!try` statement specifies exception handlers and/or cleanup code for a group of statements:
fr: L'instruction :keyword:`!try` définit les gestionnaires d'exception ou le code de nettoyage pour un groupe d'instructions :

source: Additional information on exceptions can be found in section :ref:`exceptions`, and information on using the :keyword:`raise` statement to generate exceptions may be found in section :ref:`raise`.
fr: Vous trouvez des informations supplémentaires relatives aux exceptions dans la section :ref:`exceptions` et, dans la section :ref:`raise`, des informations relatives à l'utilisation de l'instruction :keyword:`raise` pour produire des exceptions.

source: :keyword:`!except` clause
fr: clause :keyword:`!except`

source: If no :keyword:`!except` clause matches the exception, the search for an exception handler continues in the surrounding code and on the invocation stack. [#]_
fr: Si aucune clause :keyword:`!except` ne correspond à l'exception, la recherche d'un gestionnaire d'exception se poursuit dans le code englobant et dans la pile d'appels. [#]_

source: If the evaluation of an expression in the header of an :keyword:`!except` clause raises an exception, the original search for a handler is canceled and a search starts for the new exception in the surrounding code and on the call stack (it is treated as if the entire :keyword:`try` statement raised the exception).
fr: Si l'évaluation d'une expression dans l'en-tête d'une clause :keyword:`!except` lève une exception, la recherche initiale d'un gestionnaire est annulée et une recherche commence pour la nouvelle exception dans le code englobant et dans la pile d'appels (c'est traité comme si l'instruction :keyword:`try` avait levé l'exception).

source: When a matching :keyword:`!except` clause is found, the exception is assigned to the target specified after the :keyword:`!as` keyword in that :keyword:`!except` clause, if present, and the :keyword:`!except` clause's suite is executed. All :keyword:`!except` clauses must have an executable block. When the end of this block is reached, execution continues normally after the entire :keyword:`try` statement. (This means that if two nested handlers exist for the same exception, and the exception occurs in the :keyword:`!try` clause of the inner handler, the outer handler will not handle the exception.)
fr: Lorsqu'une clause :keyword:`!except` correspond, l'exception est affectée à la cible précisée après le mot-clé :keyword:`!as` dans cette clause :keyword:`!except`, si cette cible existe, et la suite de clause :keyword:`!except` est exécutée. Toutes les clauses :keyword:`!except` doivent avoir un bloc exécutable. Lorsque la fin de ce bloc est atteinte, l'exécution continue normalement après l'ensemble de l'instruction :keyword:`try` (cela signifie que si deux gestionnaires imbriqués existent pour la même exception, et que l'exception se produit dans la clause :keyword:`!try` du gestionnaire interne, le gestionnaire externe ne gère pas l'exception).

source: When an exception has been assigned using ``as target``, it is cleared at the end of the :keyword:`!except` clause. This is as if ::
fr: Lorsqu'une exception a été affectée en utilisant ``as cible``, elle est effacée à la fin de la clause :keyword:`!except`. C'est comme si ::

source: was translated to ::
fr: avait été traduit en ::

source: This means the exception must be assigned to a different name to be able to refer to it after the :keyword:`!except` clause. Exceptions are cleared because with the traceback attached to them, they form a reference cycle with the stack frame, keeping all locals in that frame alive until the next garbage collection occurs.
fr: Cela veut dire que l'exception doit être assignée à un nom différent pour pouvoir s'y référer après la clause :keyword:`!except`. Les exceptions sont effacées parce qu'avec la trace de la pile d'appels qui leur est attachée, elles créent un cycle dans les pointeurs de références (avec le cadre de la pile), ce qui conduit à conserver tous les noms locaux de ce cadre en mémoire jusqu'au passage du ramasse-miettes.

source: Before an :keyword:`!except` clause's suite is executed, the exception is stored in the :mod:`sys` module, where it can be accessed from within the body of the :keyword:`!except` clause by calling :func:`sys.exception`. When leaving an exception handler, the exception stored in the :mod:`sys` module is reset to its previous value::
fr: Avant qu'une suite de clauses :keyword:`!except` ne soit exécutée, l'exception est stockée dans le module :mod:`sys`, où elle est accessible depuis le corps de la clause :keyword:`!except` en appelant :func:`sys.exception`. Lorsque vous quittez un gestionnaire d'exceptions, l'exception stockée dans le module :mod:`sys` est réinitialisée à sa valeur précédente ::

source: :keyword:`!except*` clause
fr: clause :keyword:`!except*`

source: The :keyword:`!except*` clause(s) are used for handling :exc:`ExceptionGroup`\s. The exception type for matching is interpreted as in the case of :keyword:`except`, but in the case of exception groups we can have partial matches when the type matches some of the exceptions in the group. This means that multiple :keyword:`!except*` clauses can execute, each handling part of the exception group. Each clause executes at most once and handles an exception group of all matching exceptions. Each exception in the group is handled by at most one :keyword:`!except*` clause, the first that matches it. ::
fr: Les clauses :keyword:`!except*` sont utilisées pour gérer des :exc:`ExceptionGroup`. Le type de l'exception pour la correspondance est interprété de la même manière que dans le cas d'un :keyword:`except` mais, dans le cas d'un groupe d'exceptions, il est possible d'avoir une correspondance partielle quand le type correspond à une ou plusieurs exceptions dans le groupe. Cela veut dire que plusieurs clauses :keyword:`!except*` peuvent être exécutées, chacune gérant une partie du groupe d'exceptions. Chaque clause ne s'exécute (au maximum) qu'une fois et gère un groupe d'exception constitué des exceptions qui correspondent. Chaque exception du groupe est gérée par une clause :keyword:`!except*` au plus, la première à laquelle elle correspond. ::

source: If the raised exception is not an exception group and its type matches one of the :keyword:`!except*` clauses, it is caught and wrapped by an exception group with an empty message string. ::
fr: Si l'exception levée n'est pas un groupe d'exceptions et que son type correspond à l'une des clauses :keyword:`!except*`, elle est interceptée et encapsulée par un groupe d'exceptions avec une chaîne de message vide. ::

source: :keyword:`!else` clause
fr: clause :keyword:`!else`

source: The optional :keyword:`!else` clause is executed if the control flow leaves the :keyword:`try` suite, no exception was raised, and no :keyword:`return`, :keyword:`continue`, or :keyword:`break` statement was executed. Exceptions in the :keyword:`!else` clause are not handled by the preceding :keyword:`except` clauses.
fr: La clause optionnelle :keyword:`!else` n'est exécutée que si l'exécution atteint la fin de la clause :keyword:`try`, aucune exception n'a été levée, et aucun :keyword:`return`, :keyword:`continue`, ou :keyword:`break` ont étés exécutés. Les exceptions dans la clause :keyword:`!else` ne sont pas gérées par les clauses :keyword:`except` précédentes.

source: :keyword:`!finally` clause
fr: clause :keyword:`!finally`

source: If :keyword:`!finally` is present, it specifies a 'cleanup' handler. The :keyword:`try` clause is executed, including any :keyword:`except` and :keyword:`else` clauses. If an exception occurs in any of the clauses and is not handled, the exception is temporarily saved. The :keyword:`!finally` clause is executed. If there is a saved exception it is re-raised at the end of the :keyword:`!finally` clause. If the :keyword:`!finally` clause raises another exception, the saved exception is set as the context of the new exception. If the :keyword:`!finally` clause executes a :keyword:`return`, :keyword:`break` or :keyword:`continue` statement, the saved exception is discarded::
fr: Si :keyword:`!finally` est présente, elle définit un gestionnaire de « nettoyage ». La clause :keyword:`try` est exécutée, y compris les clauses :keyword:`except` et :keyword:`else`. Si une exception se produit dans l'une des clauses et n'est pas traitée, l'exception est temporairement sauvegardée. La clause :keyword:`!finally` est exécutée. S'il y a une exception sauvegardée, elle est levée à nouveau à la fin de la clause :keyword:`!finally`. Si la clause :keyword:`!finally` lève une autre exception, l'exception sauvegardée est définie comme le contexte de la nouvelle exception. Si la clause :keyword:`!finally` exécute une instruction :keyword:`return`, :keyword:`break` ou :keyword:`continue`, l'exception sauvegardée est jetée ::

source: The exception information is not available to the program during execution of the :keyword:`!finally` clause.
fr: L'information relative à l'exception n'est pas disponible pour le programme pendant l'exécution de la clause :keyword:`!finally`.

source: When a :keyword:`return`, :keyword:`break` or :keyword:`continue` statement is executed in the :keyword:`try` suite of a :keyword:`!try`...\ :keyword:`!finally` statement, the :keyword:`!finally` clause is also executed 'on the way out.'
fr: Lorsqu'une instruction :keyword:`return`, :keyword:`break` ou :keyword:`continue` est exécutée dans la suite d'une instruction :keyword:`try` d'une construction :keyword:`!try`…\ :keyword:`!finally`, la clause :keyword:`!finally` est aussi exécutée « à la sortie ».

source: The return value of a function is determined by the last :keyword:`return` statement executed. Since the :keyword:`!finally` clause always executes, a :keyword:`!return` statement executed in the :keyword:`!finally` clause will always be the last one executed::
fr: La valeur de retour d'une fonction est déterminée par la dernière instruction :keyword:`return` exécutée. Puisque la clause :keyword:`!finally` s'exécute toujours, une instruction :keyword:`!return` exécutée dans le :keyword:`!finally` sera toujours la dernière clause exécutée ::

source: Prior to Python 3.8, a :keyword:`continue` statement was illegal in the :keyword:`!finally` clause due to a problem with the implementation.
fr: Avant Python 3.8, une instruction :keyword:`continue` n'était pas licite dans une clause :keyword:`!finally` en raison d'un problème dans l'implémentation.

source: The :keyword:`!with` statement
fr: L'instruction :keyword:`!with`

source: The :keyword:`with` statement is used to wrap the execution of a block with methods defined by a context manager (see section :ref:`context-managers`). This allows common :keyword:`try`...\ :keyword:`except`...\ :keyword:`finally` usage patterns to be encapsulated for convenient reuse.
fr: L'instruction :keyword:`with` est utilisée pour encapsuler l'exécution d'un bloc avec des méthodes définies par un gestionnaire de contexte (voir la section :ref:`context-managers`). Cela permet d'utiliser de manière simple le patron de conception classique :keyword:`try`…\ :keyword:`except`…\ :keyword:`finally`.

source: The execution of the :keyword:`with` statement with one "item" proceeds as follows:
fr: L'exécution de l'instruction :keyword:`with` avec un seul « élément » (*item* dans la grammaire) se déroule comme suit :

source: The context expression (the expression given in the :token:`~python-grammar:with_item`) is evaluated to obtain a context manager.
fr: L'expression de contexte (l'expression donnée dans le :token:`~python-grammar:with_item`) est évaluée pour obtenir un gestionnaire de contexte.

source: The suite is executed.
fr: La suite est exécutée.

source: The following code::
fr: Le code suivant ::

source: is semantically equivalent to::
fr: est sémantiquement équivalent à ::

source: With more than one item, the context managers are processed as if multiple :keyword:`with` statements were nested::
fr: Avec plus d'un élément, les gestionnaires de contexte sont traités comme si plusieurs instructions :keyword:`with` étaient imbriquées ::

source: You can also write multi-item context managers in multiple lines if the items are surrounded by parentheses. For example::
fr: Vous pouvez aussi écrire des gestionnaires de contexte sur plusieurs lignes pour plus d'un élément si ceux-ci sont placés entre parenthèses. Par exemple ::

source: Support for multiple context expressions.
fr: Prise en charge de multiples expressions de contexte.

source: Support for using grouping parentheses to break the statement in multiple lines.
fr: prise en charge des parenthèses pour pouvoir écrire l'instruction sur plusieurs lignes.

source: :pep:`343` - The "with" statement
fr: :pep:`343` — L'instruction « *with* »

source: The specification, background, and examples for the Python :keyword:`with` statement.
fr: La spécification, les motivations et des exemples de l'instruction :keyword:`with` en Python.

source: The :keyword:`!match` statement
fr: L'instruction :keyword:`!match`
