Repository: python/python-docs-fr
Catalog: reference/compound_stmts.po
Languages: fr

source: The match statement is used for pattern matching. Syntax:
fr: L'instruction *match* est utilisée pour le filtrage par motif. Sa syntaxe est :

source: This section uses single quotes to denote :ref:`soft keywords <soft-keywords>`.
fr: cette section utilise les guillemets simples pour désigner les :ref:`mots-clés ad-hoc <soft-keywords>`.

source: Pattern matching takes a pattern as input (following ``case``) and a subject value (following ``match``). The pattern (which may contain subpatterns) is matched against the subject value. The outcomes are:
fr: Le filtrage par motif prend un motif en entrée (``pattern`` après ``case``) et un champ de recherche (``subject_expr`` après ``match``). Le motif du filtre (qui peut contenir des sous-motifs de filtrage) est confronté au contenu du champ de recherche. La sortie est composée de :

source: A match success or failure (also termed a pattern success or failure).
fr: un indicateur de réussite ou d'échec pour le filtrage (on peut aussi dire que le motif a réussi ou échoué) ;

source: Possible binding of matched values to a name. The prerequisites for this are further discussed below.
fr: la possibilité de lier les valeurs filtrées à un nom. Les pré-requis sont indiqués plus bas.

source: The ``match`` and ``case`` keywords are :ref:`soft keywords <soft-keywords>`.
fr: Les mots-clés ``match`` et ``case`` sont des :ref:`mots-clés ad-hoc <soft-keywords>`.

source: :pep:`634` -- Structural Pattern Matching: Specification
fr: :pep:`634` — Spécifications pour le filtrage par motif

source: :pep:`636` -- Structural Pattern Matching: Tutorial
fr: :pep:`636` — Tutoriel pour le filtrage par motif

source: Overview
fr: Aperçu

source: Here's an overview of the logical flow of a match statement:
fr: Voici un aperçu du déroulement logique d'un filtrage par motif :

source: The subject expression ``subject_expr`` is evaluated and a resulting subject value obtained. If the subject expression contains a comma, a tuple is constructed using :ref:`the standard rules <typesseq-tuple>`.
fr: L'expression confrontée aux filtres, ``subject_expr``, est évaluée pour obtenir la valeur résultante. Si l'expression contient une virgule, un *n*-uplet est construit en utilisant les :ref:`règles classiques <typesseq-tuple>`.

source: Each pattern in a ``case_block`` is attempted to match with the subject value. The specific rules for success or failure are described below. The match attempt can also bind some or all of the standalone names within the pattern. The precise pattern binding rules vary per pattern type and are specified below. **Name bindings made during a successful pattern match outlive the executed block and can be used after the match statement**.
fr: Chaque filtre des blocs ``case_block`` est confronté à la valeur résultante du champ de recherche. Les règles particulières pour la réussite ou l'échec sont décrites plus bas. La confrontation du filtre peut aussi conduire à lier un ou plusieurs noms présents dans le motif. Les règles pour lier les noms des motifs dépendent du type de filtre et sont décrites plus bas. **Le nommage effectué lors d'un filtrage par motif qui a réussi persiste à l'extérieur du bloc et le nom peut être utilisé après l'instruction** ``match``.

source: During failed pattern matches, some subpatterns may succeed. Do not rely on bindings being made for a failed match. Conversely, do not rely on variables remaining unchanged after a failed match. The exact behavior is dependent on implementation and may vary. This is an intentional decision made to allow different implementations to add optimizations.
fr: en cas d'échec de la recherche, certains sous-filtres peuvent avoir réussi. Ne vous fiez pas aux nommages faits lors d'un filtrage qui a échoué. Inversement, ne vous fiez pas aux variables qui restent inchangées après un filtrage infructueux. Le comportement exact dépend de l'implémentation et peut varier. Il s'agit d'un choix intentionnel afin de permettre aux implémentations d'ajouter des optimisations.

source: If the pattern succeeds, the corresponding guard (if present) is evaluated. In this case all name bindings are guaranteed to have happened.
fr: Si la recherche réussit, la garde correspondante (si elle existe) est évaluée. Dans ce cas, on est sûr que les nommages ont bien eu lieu.

source: If the guard evaluates as true or is missing, the ``block`` inside ``case_block`` is executed.
fr: Si la garde s'évalue à vrai ou s'il n'y a pas de garde, le ``block`` à l'intérieur du ``case_block`` est exécuté.

source: Otherwise, the next ``case_block`` is attempted as described above.
fr: Sinon, le ``case_block`` est testé comme décrit ci-dessus.

source: If there are no further case blocks, the match statement is completed.
fr: S'il n'y a plus de bloc ``case_block``, l'instruction est terminée.

source: Users should generally never rely on a pattern being evaluated. Depending on implementation, the interpreter may cache values or use other optimizations which skip repeated evaluations.
fr: l'utilisateur ne doit jamais faire confiance à un filtre en cours d'évaluation. En fonction de l'implémentation, l'interpréteur peut mettre des valeurs en cache ou utiliser des optimisations qui évitent des réévaluations.

source: A sample match statement::
fr: Voici un exemple d'instruction de filtrage par motif ::

source: In this case, ``if flag`` is a guard. Read more about that in the next section.
fr: Dans cet exemple, ``if flag`` est une garde. Plus de détails sont fournis dans la prochaine section.

source: Guards
fr: Gardes

source: A ``guard`` (which is part of the ``case``) must succeed for code inside the ``case`` block to execute. It takes the form: :keyword:`if` followed by an expression.
fr: Une garde (``guard`` qui fait partie du ``case``) doit s'évaluer à vrai pour que le code à l'intérieur du bloc ``case`` soit exécuté. Elle s'écrit sous la forme du mot-clé :keyword:`if` suivi d'une expression.

source: The logical flow of a ``case`` block with a ``guard`` follows:
fr: Le déroulement logique d'un bloc ``case`` qui comprend une garde est le suivant :

source: Check that the pattern in the ``case`` block succeeded. If the pattern failed, the ``guard`` is not evaluated and the next ``case`` block is checked.
fr: Vérification que le filtrage dans le bloc ``case`` est fructueux. Si le filtrage échoue, la garde n'est pas évaluée et on passe au bloc ``case`` suivant.

source: If the pattern succeeded, evaluate the ``guard``.
fr: Si le filtrage est fructueux, évaluation de la garde.

source: If the ``guard`` condition evaluates as true, the case block is selected.
fr: Si la garde s'évalue à *vrai*, le bloc est sélectionné.

source: If the ``guard`` condition evaluates as false, the case block is not selected.
fr: Si la garde s'évalue à *faux*, le bloc n'est pas sélectionné.

source: If the ``guard`` raises an exception during evaluation, the exception bubbles up.
fr: Si une exception est levée lors de l'évaluation de la garde, cette exception est propagée.

source: Guards are allowed to have side effects as they are expressions. Guard evaluation must proceed from the first to the last case block, one at a time, skipping case blocks whose pattern(s) don't all succeed. (I.e., guard evaluation must happen in order.) Guard evaluation must stop once a case block is selected.
fr: Les gardes étant des expressions, il est possible qu'elles aient des effets secondaires. L'ordre d'évaluation des gardes est du premier au dernier bloc ``case``, un à la fois, en sautant les blocs ``case`` dont la recherche de motif échouent. L'évaluation des gardes s'arrête dès qu'un bloc ``case`` est sélectionné.

source: Irrefutable Case Blocks
fr: Bloc ``case`` attrape-tout

source: An irrefutable case block is a match-all case block. A match statement may have at most one irrefutable case block, and it must be last.
fr: Un bloc ``case`` attrape-tout est un bloc qui réussit toujours. Une instruction ``match`` ne peut avoir qu'un seul bloc attrape-tout, et ce doit être le dernier.

source: A case block is considered irrefutable if it has no guard and its pattern is irrefutable. A pattern is considered irrefutable if we can prove from its syntax alone that it will always succeed. Only the following patterns are irrefutable:
fr: Un bloc ``case`` est considéré attrape-tout s'il n'y a pas de garde et que le motif est attrape-tout. Un motif est attrape-tout si l'on peut déterminer, simplement à partir de sa syntaxe, qu'il correspond toujours. Seuls les motifs suivants sont attrape-tout :

source: :ref:`as-patterns` whose left-hand side is irrefutable
fr: Les :ref:`as-patterns` pour lesquels la partie gauche est attrape-tout

source: :ref:`or-patterns` containing at least one irrefutable pattern
fr: Les :ref:`or-patterns` contenant au moins un filtre attrape-tout

source: :ref:`capture-patterns`
fr: Les :ref:`capture-patterns`

source: :ref:`wildcard-patterns`
fr: Les :ref:`wildcard-patterns`

source: parenthesized irrefutable patterns
fr: les filtres attrape-tout entre parenthèses

source: Patterns
fr: Filtres

source: This section uses grammar notations beyond standard EBNF:
fr: Cette section utilise des notations grammaticales qui ne font pas partie du standard EBNF :

source: the notation ``SEP.RULE+`` is shorthand for ``RULE (SEP RULE)*``
fr: la notation ``SEP.REGLE+`` désigne ``REGLE (SEP REGLE)*``

source: the notation ``!RULE`` is shorthand for a negative lookahead assertion
fr: la notation ``!REGLE`` désigne la négation logique de l'assertion ``REGLE``

source: The top-level syntax for ``patterns`` is:
fr: La syntaxe générale pour les filtres ``patterns`` est :

source: The descriptions below will include a description "in simple terms" of what a pattern does for illustration purposes (credits to Raymond Hettinger for a document that inspired most of the descriptions). Note that these descriptions are purely for illustration purposes and **may not** reflect the underlying implementation. Furthermore, they do not cover all valid forms.
fr: Les explications ci-dessous décrivent « en termes simples » ce qu'un modèle fait (merci à Raymond Hettinger pour son document qui a inspiré la plupart des descriptions). Notez que ces descriptions sont purement à fin d'illustration et peuvent ne **pas** être strictement conformes à l'implémentation sous-jacente. De plus, nous ne couvrons pas toutes les formes valides.

source: OR Patterns
fr: Filtres OU

source: An OR pattern is two or more patterns separated by vertical bars ``|``. Syntax:
fr: Un filtre OU est composé de deux filtres ou plus séparés par des barres verticales ``|``. La syntaxe est :

source: Only the final subpattern may be :ref:`irrefutable <irrefutable_case>`, and each subpattern must bind the same set of names to avoid ambiguity.
fr: Seul le dernier sous-filtre peut être :ref:`attrape-tout <irrefutable_case>` et chaque sous-filtre doit être lié au même ensemble de noms pour éviter toute ambigüité.

source: An OR pattern matches each of its subpatterns in turn to the subject value, until one succeeds. The OR pattern is then considered successful. Otherwise, if none of the subpatterns succeed, the OR pattern fails.
fr: Un filtre OU confronte chacun des sous-filtres à tour de rôle à la valeur du champ de recherche, jusqu'à ce que l'un d'eux réussisse. Le filtre OU réussit si l'un des sous-filtres a réussi, sinon il échoue.

source: In simple terms, ``P1 | P2 | ...`` will try to match ``P1``, if it fails it will try to match ``P2``, succeeding immediately if any succeeds, failing otherwise.
fr: En termes plus simples, ``M1 | M2 | ...`` teste le filtre par motif ``M1``, s'il échoue il teste le filtre par motif ``M2``, réussit immédiatement si l'un d'eux réussit, échoue dans le cas contraire.

source: AS Patterns
fr: Filtres AS

source: An AS pattern matches an OR pattern on the left of the :keyword:`as` keyword against a subject. Syntax:
fr: Un filtre AS confronte un filtre OU sur la gauche du mot-clé :keyword:`as` au champ de recherche. La syntaxe est la suivante :

source: If the OR pattern fails, the AS pattern fails. Otherwise, the AS pattern binds the subject to the name on the right of the as keyword and succeeds. ``capture_pattern`` cannot be a ``_``.
fr: Si le filtre OU échoue, le filtre AS échoue. Sinon, le filtre AS lie le champ de recherche au nom sur la droite du mot-clé ``as`` et réussit. ``capture_pattern`` ne peut pas être un ``_``.

source: In simple terms ``P as NAME`` will match with ``P``, and on success it will set ``NAME = <subject>``.
fr: En termes simples, ``M as NOM`` filtre avec le motif ``M`` et, s'il réussit, définit ``NOM = <subject>``.

source: Literal Patterns
fr: Filtres littéraux

source: A literal pattern corresponds to most :ref:`literals <literals>` in Python. Syntax:
fr: Un filtre littéral effectue une correspondance avec la plupart des :ref:`littéraux <literals>` en Python. La syntaxe est la suivante :

source: The rule ``strings`` and the token ``NUMBER`` are defined in the :doc:`standard Python grammar <./grammar>`. Triple-quoted strings are supported. Raw strings and byte strings are supported. :ref:`f-strings` are not supported.
fr: La règle ``strings`` et le lexème ``NUMBER`` sont définis dans :doc:`la grammaire de Python standard <./grammar>`. Les chaînes avec triples guillemets sont gérées. Les chaînes brutes et les chaînes d'octets sont gérées. Les :ref:`f-strings` ne sont pas gérées.

source: The forms ``signed_number '+' NUMBER`` and ``signed_number '-' NUMBER`` are for expressing :ref:`complex numbers <imaginary>`; they require a real number on the left and an imaginary number on the right. E.g. ``3 + 4j``.
fr: Les formes ``signed_number '+' NUMBER`` et ``signed_number '-' NUMBER`` permettent d'exprimer des :ref:`nombres complexes <imaginary>` ; vous devez indiquer un nombre réel sur la gauche et un nombre imaginaire sur la droite. Par exemple, ``3 + 4j``.

source: In simple terms, ``LITERAL`` will succeed only if ``<subject> == LITERAL``. For the singletons ``None``, ``True`` and ``False``, the :keyword:`is` operator is used.
fr: En termes simples, ``LITERAL`` réussit seulement si ``<subject> == LITERAL``. Pour les singletons ``None``, ``True`` et ``False``, l'opérateur :keyword:`is` est utilisé.

source: Capture Patterns
fr: Filtres de capture

source: A capture pattern binds the subject value to a name. Syntax:
fr: Un filtre de capture lie la valeur du champ de recherche à un nom. La syntaxe est la suivante :

source: A single underscore ``_`` is not a capture pattern (this is what ``!'_'`` expresses). It is instead treated as a :token:`~python-grammar:wildcard_pattern`.
fr: Un simple caractère souligné ``_`` n'est pas un filtre de capture (c'est ce que ``!'_'`` veut dire). C'est le motif pour désigner un filtre attrape-tout (lexème :token:`~python-grammar:wilcard_pattern`, voir plus bas).

source: In a given pattern, a given name can only be bound once. E.g. ``case x, x: ...`` is invalid while ``case [x] | x: ...`` is allowed.
fr: Dans un filtre donné, un nom ne peut être lié qu'une seule fois. Par exemple, ``case x, x: ...`` est invalide mais ``case [x] | x: ...`` est autorisé.

source: Capture patterns always succeed. The binding follows scoping rules established by the assignment expression operator in :pep:`572`; the name becomes a local variable in the closest containing function scope unless there's an applicable :keyword:`global` or :keyword:`nonlocal` statement.
fr: Les filtres de capture réussissent toujours. La portée du lien est conforme aux règles définies pour l'opérateur d'affectation indiquées dans la :pep:`572` ; le nom devient une variable locale dans la fonction la plus intérieure à moins qu'il n'y ait une instruction :keyword:`global` ou :keyword:`nonlocal` qui s'applique.

source: In simple terms ``NAME`` will always succeed and it will set ``NAME = <subject>``.
fr: En termes simples, ``NAME`` réussit toujours et définit ``NAME = <subject>``.

source: Wildcard Patterns
fr: Filtres attrape-tout

source: A wildcard pattern always succeeds (matches anything) and binds no name. Syntax:
fr: Un filtre attrape-tout réussit toujours (quel que soit le champ de recherche) et ne lie aucun nom. La syntaxe est la suivante :

source: ``_`` is a :ref:`soft keyword <soft-keywords>` within any pattern, but only within patterns. It is an identifier, as usual, even within ``match`` subject expressions, ``guard``\ s, and ``case`` blocks.
fr: ``_`` est un :ref:`mot-clé ad-hoc <soft-keywords>` dans un filtre par motif, mais seulement dans un filtre. Ailleurs, c'est un identifiant, comme d'habitude, même à l'intérieur d'une expression champ de recherche de ``match``, d'une garde ou d'un bloc ``case``.

source: In simple terms, ``_`` will always succeed.
fr: En termes simples, ``_`` réussit toujours.

source: Value Patterns
fr: Filtres par valeurs

source: A value pattern represents a named value in Python. Syntax:
fr: Un filtre par valeur représente une valeur nommée de Python. Sa syntaxe est la suivante :

source: The dotted name in the pattern is looked up using standard Python :ref:`name resolution rules <resolve_names>`. The pattern succeeds if the value found compares equal to the subject value (using the ``==`` equality operator).
fr: Le nom qualifié dans le filtre est recherché en utilisant la :ref:`méthode de résolution des noms <resolve_names>` standard de Python. Le filtrage réussit si la valeur trouvée vérifie l'égalité avec la valeur du champ de recherche (en utilisant l'opérateur d'égalité ``==``).

source: In simple terms ``NAME1.NAME2`` will succeed only if ``<subject> == NAME1.NAME2``
fr: En termes plus simples, ``NOM1.NOM2`` réussit seulement si ``<subject> == NOM1.NOM2``

source: If the same value occurs multiple times in the same match statement, the interpreter may cache the first value found and reuse it rather than repeat the same lookup. This cache is strictly tied to a given execution of a given match statement.
fr: si la même valeur apparaît plusieurs fois dans la même instruction ``match``, l'interpréteur peut mettre en cache la première valeur trouvée et la réutiliser plutôt que de refaire une recherche. Ce cache est strictement limité à l'exécution de l'instruction ``match`` donnée.

source: Group Patterns
fr: Filtres de groupes

source: A group pattern allows users to add parentheses around patterns to emphasize the intended grouping. Otherwise, it has no additional syntax. Syntax:
fr: Un filtre de groupe permet au programmeur de souligner l’intention de regrouper des motifs en plaçant ceux-ci entre parenthèses. À part ça, il n’introduit aucune syntaxe supplémentaire. Sa syntaxe est la suivante :

source: In simple terms ``(P)`` has the same effect as ``P``.
fr: En termes plus simples, ``(P)`` équivaut à ``P``.

source: Sequence Patterns
fr: Filtres de séquences

source: A sequence pattern contains several subpatterns to be matched against sequence elements. The syntax is similar to the unpacking of a list or tuple.
fr: Un filtre de séquence contient des sous-filtres par motif dont chacun doit correspondre à un élément d’une séquence. La syntaxe est similaire au déballage d’une liste ou d’un *n*-uplet.

source: There is no difference if parentheses or square brackets are used for sequence patterns (i.e. ``(...)`` vs ``[...]`` ).
fr: Vous pouvez utiliser indifféremment des parenthèses ``(...)`` ou des crochets ``[...]`` pour encadrer les filtres à regrouper.

source: A single pattern enclosed in parentheses without a trailing comma (e.g. ``(3 | 4)``) is a :ref:`group pattern <group-patterns>`. While a single pattern enclosed in square brackets (e.g. ``[3 | 4]``) is still a sequence pattern.
fr: un filtre seul entre parenthèses qui ne se termine pas par une virgule (par exemple ``(3 | 4)``) est un :ref:`filtre de groupe <group-patterns>`. En revanche, un filtre seul entre crochets (par exemple ``[3 | 4]``) reste un filtre de séquence.

source: At most one star subpattern may be in a sequence pattern. The star subpattern may occur in any position. If no star subpattern is present, the sequence pattern is a fixed-length sequence pattern; otherwise it is a variable-length sequence pattern.
fr: Il peut y avoir au plus un sous-filtre étoilé (lexème ``star_pattern``) dans un filtre de séquence. Le filtre étoilé peut se trouver à n’importe quelle position. S’il n’y en a pas, le filtre de séquence est un filtre de séquence à longueur fixe, sinon c’est un filtre de séquence à longueur variable.

source: The following is the logical flow for matching a sequence pattern against a subject value:
fr: Voici le déroulement logique d’un filtrage par motif de séquence sur une valeur du champ de recherche :

source: If the subject value is not a sequence [#]_, the sequence pattern fails.
fr: Si la valeur du champ de recherche n’est pas une séquence [#]_, le filtre de séquence échoue.

source: If the subject value is an instance of ``str``, ``bytes`` or ``bytearray`` the sequence pattern fails.
fr: Si la valeur du champ de recherche est une instance de ``str``, ``bytes`` ou ``bytearray``, le filtre de séquence échoue.

source: The subsequent steps depend on whether the sequence pattern is fixed or variable-length.
fr: Les étapes suivantes dépendent de la longueur fixe ou non du filtre de séquence.

source: If the sequence pattern is fixed-length:
fr: Si le filtre de séquence est de longueur fixe :

source: If the length of the subject sequence is not equal to the number of subpatterns, the sequence pattern fails
fr: Si la longueur de la séquence champ de recherche n’est pas égale au nombre de sous-filtres, le filtre de séquence échoue.

source: Subpatterns in the sequence pattern are matched to their corresponding items in the subject sequence from left to right. Matching stops as soon as a subpattern fails. If all subpatterns succeed in matching their corresponding item, the sequence pattern succeeds.
fr: Les sous-filtres de la séquence sont confrontés aux éléments correspondants dans la séquence champ de recherche, de la gauche vers la droite. La recherche de correspondance s’arrête dès qu’un sous-filtre échoue. Si tous les sous-filtres réussissent la confrontation à l’élément du champ de recherche correspondant, le filtre de séquence réussit.

source: Otherwise, if the sequence pattern is variable-length:
fr: Sinon, si le filtre de séquence est de longueur variable :

source: If the length of the subject sequence is less than the number of non-star subpatterns, the sequence pattern fails.
fr: Si la longueur de la séquence champ de recherche est plus petite que le nombre de sous-filtres sans étoile, le filtre de séquence échoue.

source: The leading non-star subpatterns are matched to their corresponding items as for fixed-length sequences.
fr: Les sous-filtres sans étoile du début sont confrontés aux éléments correspondants comme pour un filtre de séquences de longueur fixe.

source: If the previous step succeeds, the star subpattern matches a list formed of the remaining subject items, excluding the remaining items corresponding to non-star subpatterns following the star subpattern.
fr: Si les étapes précédentes ont réussi, le sous-filtre étoilé correspond à une liste formée des éléments restants du champ de recherche, en excluant les éléments restants qui correspondent à des sous-filtres sans étoile qui suivent le sous-filtre étoilé.

source: Remaining non-star subpatterns are matched to their corresponding subject items, as for a fixed-length sequence.
fr: Les sous-filtres sans étoile qui restent sont confrontés aux éléments restants du champ de recherche, comme pour un filtre de séquences de longueur fixe.
