Repository: python/python-docs-fr
Catalog: reference/compound_stmts.po
Languages: fr

source: The length of the subject sequence is obtained via :func:`len` (i.e. via the :meth:`__len__` protocol). This length may be cached by the interpreter in a similar manner as :ref:`value patterns <value-patterns>`.
fr: la longueur de la séquence champ de recherche est obtenue par :func:`len` (c.-à-d. avec le protocole :meth:`__len__`). Cette longueur peut être mise en cache par l’interpréteur de la même manière que pour les :ref:`filtres par valeur <value-patterns>`.

source: In simple terms ``[P1, P2, P3,`` ... ``, P<N>]`` matches only if all the following happens:
fr: En termes plus simples, ``[M1, M2, M3,`` … ``, M<N>]`` réussit seulement si tout ce qui suit a lieu :

source: check ``<subject>`` is a sequence
fr: vérification que ``<subject>`` est une séquence,

source: ``P1`` matches ``<subject>[0]`` (note that this match can also bind names)
fr: ``M1`` correspond à ``<subject>[0]`` (notez que cette correspondance peut lier des noms),

source: ``P2`` matches ``<subject>[1]`` (note that this match can also bind names)
fr: ``M2`` correspond à ``<subject>[1]`` (notez que cette correspondance peut lier des noms),

source: ... and so on for the corresponding pattern/element.
fr: et ainsi de suite pour chaque filtre par motif / élément.

source: Mapping Patterns
fr: Filtres associatifs

source: A mapping pattern contains one or more key-value patterns. The syntax is similar to the construction of a dictionary. Syntax:
fr: Un filtre associatif contient un ou plusieurs motifs clé-valeur. La syntaxe est similaire à la construction d’un dictionnaire :

source: At most one double star pattern may be in a mapping pattern. The double star pattern must be the last subpattern in the mapping pattern.
fr: Un seul sous-filtre doublement étoilé peut être présent dans le filtre associatif. Le filtre doublement étoilé doit être le dernier sous-filtre du filtre associatif.

source: Duplicate keys in mapping patterns are disallowed. Duplicate literal keys will raise a :exc:`SyntaxError`. Two keys that otherwise have the same value will raise a :exc:`ValueError` at runtime.
fr: Il est interdit d’avoir des clés en double dans les filtres associatifs. Une clé en double sous forme littérale lève une :exc:`Syntax Error`. Deux clés qui ont la même valeur lèvent une :exc:`ValueError` à l’exécution.

source: The following is the logical flow for matching a mapping pattern against a subject value:
fr: Voici le déroulement d’un filtrage associatif sur la valeur du champ de recherche :

source: If the subject value is not a mapping [#]_,the mapping pattern fails.
fr: Si la valeur du champ de recherche n'est pas un tableau associatif [#]_, le filtre associatif échoue.

source: If every key given in the mapping pattern is present in the subject mapping, and the pattern for each key matches the corresponding item of the subject mapping, the mapping pattern succeeds.
fr: Si chaque clé donnée dans le filtre associatif est présente dans le tableau associatif du champ de recherche, et que le filtre pour chaque clé correspond aux éléments du tableau associatif champ de recherche, le filtre associatif réussit.

source: If duplicate keys are detected in the mapping pattern, the pattern is considered invalid. A :exc:`SyntaxError` is raised for duplicate literal values; or a :exc:`ValueError` for named keys of the same value.
fr: Si des clés identiques sont détectées dans le filtre par motif, le filtre est déclaré invalide. Une :exc:`SyntaxError` est levée pour les valeurs littérales dupliquées ou une :exc:`ValueError` pour des clés s'évaluant à la même valeur.

source: In simple terms ``{KEY1: P1, KEY2: P2, ... }`` matches only if all the following happens:
fr: En termes simples, ``{CLÉ1: M1, CLÉ2: M2, ... }`` réussit seulement si tout ce qui suit a lieu :

source: check ``<subject>`` is a mapping
fr: vérification que ``<subject>`` est un tableau associatif,

source: ``KEY1 in <subject>``
fr: ``CLÉ1 in <subject>``,

source: ``P1`` matches ``<subject>[KEY1]``
fr: ``M1`` correspond à ``<subject>[CLÉ1]``,

source: ... and so on for the corresponding KEY/pattern pair.
fr: et ainsi de suite pour chaque paire CLÉ/Motif.

source: Class Patterns
fr: Filtres de classes

source: A class pattern represents a class and its positional and keyword arguments (if any). Syntax:
fr: Un filtre de classe représente une classe et ses arguments positionnels et par mots-clés (s'il y en a). La syntaxe est la suivante :

source: The same keyword should not be repeated in class patterns.
fr: Le même mot-clé ne doit pas être répété dans les filtres de classes.

source: The following is the logical flow for matching a class pattern against a subject value:
fr: Voici le déroulement d’un filtrage de classe sur la valeur du champ de recherche :

source: If ``name_or_attr`` is not an instance of the builtin :class:`type` , raise :exc:`TypeError`.
fr: Si ``name_or_attr`` n'est pas une instance de la classe native :class:`type`, lève une :exc:`TypeError`.

source: If the subject value is not an instance of ``name_or_attr`` (tested via :func:`isinstance`), the class pattern fails.
fr: Si la valeur du champ de recherche n'est pas une instance de ``name_or_attr`` (testé *via* :func:`isinstance`), le filtre de classe échoue.

source: If no pattern arguments are present, the pattern succeeds. Otherwise, the subsequent steps depend on whether keyword or positional argument patterns are present.
fr: S'il n'y a pas d'argument au filtre, le filtre réussit. Sinon, les étapes suivantes dépendent de la présence ou non de motifs pour les arguments positionnels ou par mot-clé.

source: For a number of built-in types (specified below), a single positional subpattern is accepted which will match the entire subject; for these types keyword patterns also work as for other types.
fr: Pour un certain nombre de types natifs (indiqués ci-dessous), un motif positionnel seul est accepté, qui est confronté au champ de recherche en entier ; pour ces types, les motifs par mots-clés fonctionnent comme les autres types.

source: If only keyword patterns are present, they are processed as follows, one by one:
fr: S'il n'y a que des motifs par mot-clé (NdT : dans le sens « argument par mot-clé »), ils sont évalués comme ceci, un par un :

source: I. The keyword is looked up as an attribute on the subject.
fr: I. Le mot-clé est recherché en tant qu'attribut du champ de recherche.

source: If this raises an exception other than :exc:`AttributeError`, the exception bubbles up.
fr: Si cela lève une exception autre que :exc:`AttributeError`, l'exception est propagée vers le haut.

source: If this raises :exc:`AttributeError`, the class pattern has failed.
fr: Si cela lève l'exception :exc:`AttributeError`, le filtre échoue.

source: Else, the subpattern associated with the keyword pattern is matched against the subject's attribute value. If this fails, the class pattern fails; if this succeeds, the match proceeds to the next keyword.
fr: Sinon, le motif associé au mot-clé est confronté à la valeur de l'attribut du champ de recherche. Si cela échoue, le filtre de classe échoue ; si cela réussit, le filtre passe au mot-clé suivant.

source: II. If all keyword patterns succeed, the class pattern succeeds.
fr: II. Si tous les motifs par mot-clé ont réussi, le filtre de classe réussit.

source: If any positional patterns are present, they are converted to keyword patterns using the :data:`~object.__match_args__` attribute on the class ``name_or_attr`` before matching:
fr: Si des motifs positionnels sont présents, ils sont convertis en motifs par mot-clé en utilisant l'attribut :data:`~object.__match_args__` de la classe ``name_or_attr`` avant le filtrage :

source: I. The equivalent of ``getattr(cls, "__match_args__", ())`` is called.
fr: I. L'équivalent de ``getattr(cls, "__match_args__", ())`` est appelé.

source: If this raises an exception, the exception bubbles up.
fr: Si cela lève une exception, elle est propagée vers le haut.

source: If the returned value is not a tuple, the conversion fails and :exc:`TypeError` is raised.
fr: Si la valeur de retour n'est pas un *n*-uplet, la conversion échoue et une :exc:`TypeError` est levée.

source: If there are more positional patterns than ``len(cls.__match_args__)``, :exc:`TypeError` is raised.
fr: S'il y a plus de motifs positionnels que ``len(cls.__match_args__)``, une :exc:`TypeError` est levée.

source: Otherwise, positional pattern ``i`` is converted to a keyword pattern using ``__match_args__[i]`` as the keyword. ``__match_args__[i]`` must be a string; if not :exc:`TypeError` is raised.
fr: Sinon, le motif positionnel ``i`` est converti en motif par mot-clé (le mot-clé sera ``__match_args__[i]``). ``__match_args__[i]`` doit être une chaîne, sinon une :exc:`TypeError` est levée.

source: If there are duplicate keywords, :exc:`TypeError` is raised.
fr: Si un mot-clé est dupliqué, une :exc:`TypeError` est levée.

source: II. Once all positional patterns have been converted to keyword patterns,
fr: II. Une fois que tous les motifs positionnels ont été convertis en motifs par mot-clé,

source: the match proceeds as if there were only keyword patterns.
fr: le filtre se déroule comme si tous les motifs étaient des motifs par mots-clés.

source: For the following built-in types the handling of positional subpatterns is different:
fr: Pour les types natifs suivants, le traitement des motifs positionnels est différent :

source: These classes accept a single positional argument, and the pattern there is matched against the whole object rather than an attribute. For example ``int(0|1)`` matches the value ``0``, but not the value ``0.0``.
fr: Ces classes acceptent un argument positionnel seul et le filtre s'applique alors sur l'ensemble de l'objet plutôt que sur un simple attribut. Par exemple, ``int(0|1)`` réussit lorsqu'il est confronté à la valeur ``0``, mais pas lorsque c'est la valeur ``0.0``.

source: In simple terms ``CLS(P1, attr=P2)`` matches only if the following happens:
fr: En termes simples, ``CLS(P1, attr=P2)`` réussit seulement si la séquence suivante est déroulée :

source: convert ``P1`` to a keyword pattern using ``CLS.__match_args__``
fr: convertit ``P1`` vers un motif par mot-clé en utilisant ``CLS.__match_args__``

source: For each keyword argument ``attr=P2``:
fr: Pour chaque argument par mot-clé ``attr=P2`` :

source: ``P2`` matches ``<subject>.attr``
fr: ``P2`` correspond à ``<subject>.attr``

source: ... and so on for the corresponding keyword argument/pattern pair.
fr: … et ainsi de suite pour les paires motif/argument par mot-clé.

source: Function definitions
fr: Définition de fonctions

source: A function definition defines a user-defined function object (see section :ref:`types`):
fr: Une définition de fonction définit un objet fonction défini par l'utilisateur (voir la section :ref:`types`) :

source: A function definition is an executable statement. Its execution binds the function name in the current local namespace to a function object (a wrapper around the executable code for the function). This function object contains a reference to the current global namespace as the global namespace to be used when the function is called.
fr: Une définition de fonction est une instruction qui est exécutée. Son exécution lie le nom de la fonction, dans l'espace de nommage local courant, à un objet fonction (un objet qui encapsule le code exécutable de la fonction). Cet objet fonction contient une référence à l'espace des noms globaux courant comme espace des noms globaux à utiliser lorsque la fonction est appelée.

source: The function definition does not execute the function body; this gets executed only when the function is called. [#]_
fr: La définition de la fonction n'exécute pas le corps de la fonction ; elle n'est exécutée que lorsque la fonction est appelée. [#]_

source: A function definition may be wrapped by one or more :term:`decorator` expressions. Decorator expressions are evaluated when the function is defined, in the scope that contains the function definition. The result must be a callable, which is invoked with the function object as the only argument. The returned value is bound to the function name instead of the function object. Multiple decorators are applied in nested fashion. For example, the following code ::
fr: Une définition de fonction peut être encapsulée dans une ou plusieurs expressions :term:`decorator` ; les décorateurs sont évalués lorsque la fonction est définie, dans la portée qui contient la définition de fonction ; le résultat doit être un appelable, qui est invoqué avec l'objet fonction comme seul argument ; la valeur renvoyée est liée au nom de la fonction en lieu et place de l'objet fonction. Lorsqu'il y a plusieurs décorateurs, ils sont appliqués par imbrication ; par exemple, le code suivant ::

source: is roughly equivalent to ::
fr: est à peu près équivalent à ::

source: except that the original function is not temporarily bound to the name ``func``.
fr: sauf que la fonction originale n'est pas temporairement liée au nom ``func``.

source: Functions may be decorated with any valid :token:`~python-grammar:assignment_expression`. Previously, the grammar was much more restrictive; see :pep:`614` for details.
fr: les fonctions peuvent être décorées par toute :token:`expression d'affectation <~python-grammar:assignment_expression>` valide. Auparavant, la grammaire était beaucoup plus restrictive ; voir la :pep:`614` pour obtenir les détails.

source: When one or more :term:`parameters <parameter>` have the form *parameter* ``=`` *expression*, the function is said to have "default parameter values." For a parameter with a default value, the corresponding :term:`argument` may be omitted from a call, in which case the parameter's default value is substituted. If a parameter has a default value, all following parameters up until the "``*``" must also have a default value --- this is a syntactic restriction that is not expressed by the grammar.
fr: Lorsqu'un ou plusieurs :term:`paramètres <parameter>` sont de la forme *parameter* ``=`` *expression*, on dit que la fonction a des « valeurs de paramètres par défaut ». Pour un paramètre avec une valeur par défaut, l’:term:`argument` correspondant peut être omis lors de l'appel, la valeur par défaut du paramètre est alors utilisée. Si un paramètre a une valeur par défaut, tous les paramètres suivants jusqu'à "``*``" doivent aussi avoir une valeur par défaut — ceci est une restriction syntaxique qui n'est pas exprimée dans la grammaire.

source: **Default parameter values are evaluated from left to right when the function definition is executed.** This means that the expression is evaluated once, when the function is defined, and that the same "pre-computed" value is used for each call. This is especially important to understand when a default parameter value is a mutable object, such as a list or a dictionary: if the function modifies the object (e.g. by appending an item to a list), the default parameter value is in effect modified. This is generally not what was intended. A way around this is to use ``None`` as the default, and explicitly test for it in the body of the function, e.g.::
fr: **Les valeurs par défaut des paramètres sont évaluées de la gauche vers la droite quand la définition de la fonction est exécutée**. Cela signifie que l'expression est évaluée une fois, lorsque la fonction est définie, et que c'est la même valeur « pré-calculée » qui est utilisée à chaque appel. C'est particulièrement important à comprendre lorsque la valeur d'un paramètre par défaut est un objet mutable (cas d'une liste ou un dictionnaire par exemple) : si la fonction modifie l'objet (par exemple en ajoutant un élément à une liste), la valeur par défaut est modifiée. En général, ce n'est pas l'effet voulu. Une façon d'éviter cet écueil est d'utiliser ``None`` par défaut et de tester explicitement la valeur dans le corps de la fonction. Par exemple ::

source: Function call semantics are described in more detail in section :ref:`calls`. A function call always assigns values to all parameters mentioned in the parameter list, either from positional arguments, from keyword arguments, or from default values. If the form "``*identifier``" is present, it is initialized to a tuple receiving any excess positional parameters, defaulting to the empty tuple. If the form "``**identifier``" is present, it is initialized to a new ordered mapping receiving any excess keyword arguments, defaulting to a new empty mapping of the same type. Parameters after "``*``" or "``*identifier``" are keyword-only parameters and may only be passed by keyword arguments. Parameters before "``/``" are positional-only parameters and may only be passed by positional arguments.
fr: La sémantique de l'appel de fonction est décrite plus en détail dans la section :ref:`calls`. Un appel de fonction assigne toujours des valeurs à tous les paramètres mentionnés dans la liste des paramètres, soit à partir d'arguments positionnels, d'arguments par mots-clés ou de valeurs par défaut. S'il y a un paramètre de la forme ``*identifier``, il est initialisé à un *n*-uplet recevant les paramètres positionnels en surplus, la valeur par défaut étant le *n*-uplet vide. S'il y a un paramètre de la forme ``**identifier``, il est initialisé à un nouveau tableau associatif ordonné qui récupère tous les arguments par mot-clé en surplus, la valeur par défaut étant un tableau associatif vide du même type. Les paramètres après ``*`` ou ``*identifier`` sont forcément des paramètres par mot-clé et ne peuvent être passés qu'en utilisant des arguments par mot-clé. Au contraire, ceux avant ``/`` ne peuvent être passés qu'avec des arguments positionnels.

source: The ``/`` function parameter syntax may be used to indicate positional-only parameters. See :pep:`570` for details.
fr: ajout de la syntaxe avec ``/`` pour indiquer les paramètre exclusivement positionnels (voir la :pep:`570`).

source: It is also possible to create anonymous functions (functions not bound to a name), for immediate use in expressions. This uses lambda expressions, described in section :ref:`lambda`. Note that the lambda expression is merely a shorthand for a simplified function definition; a function defined in a ":keyword:`def`" statement can be passed around or assigned to another name just like a function defined by a lambda expression. The ":keyword:`!def`" form is actually more powerful since it allows the execution of multiple statements and annotations.
fr: Il est aussi possible de créer des fonctions anonymes (fonctions non liées à un nom), pour une utilisation immédiate dans des expressions. Utilisez alors des expressions lambda, décrites dans la section :ref:`lambda`. Notez qu'une expression lambda est simplement un raccourci pour définir une fonction simple ; une fonction définie par une instruction ":keyword:`def`" peut être passée (en argument) ou assignée à un autre nom, tout comme une fonction définie par une expression lambda. La forme ":keyword:`!def`" est en fait plus puissante puisqu'elle permet l'exécution de plusieurs instructions et les annotations.

source: **Programmer's note:** Functions are first-class objects. A "``def``" statement executed inside a function definition defines a local function that can be returned or passed around. Free variables used in the nested function can access the local variables of the function containing the def. See section :ref:`naming` for details.
fr: **Note pour les programmeurs :** les fonctions sont des objets de première classe. Une instruction "``def``" exécutée à l'intérieur d'une définition de fonction définit une fonction locale qui peut être renvoyée ou passée en tant qu'argument. Les variables libres utilisées dans la fonction imbriquée ont accès aux variables locales de la fonction contenant le "``def``". Voir la section :ref:`naming` pour plus de détails.

source: :pep:`3107` - Function Annotations
fr: :pep:`3107` — Annotations de fonctions

source: The original specification for function annotations.
fr: La spécification originale pour les annotations de fonctions.

source: :pep:`484` - Type Hints
fr: :pep:`484` — Indications de types

source: Definition of a standard meaning for annotations: type hints.
fr: Définition de la signification standard pour les annotations : indications de types.

source: :pep:`526` - Syntax for Variable Annotations
fr: :pep:`526` — Syntaxe pour les annotations de variables

source: :pep:`563` - Postponed Evaluation of Annotations
fr: :pep:`563` — Évaluation différée des annotations

source: Support for forward references within annotations by preserving annotations in a string form at runtime instead of eager evaluation.
fr: Gestion des références postérieures à l'intérieur des annotations en préservant les annotations sous forme de chaînes à l'exécution au lieu d'une évaluation directe.

source: Class definitions
fr: Définition de classes

source: A class definition defines a class object (see section :ref:`types`):
fr: Une définition de classe définit un objet classe (voir la section :ref:`types`) :

source: A class definition is an executable statement. The inheritance list usually gives a list of base classes (see :ref:`metaclasses` for more advanced uses), so each item in the list should evaluate to a class object which allows subclassing. Classes without an inheritance list inherit, by default, from the base class :class:`object`; hence, ::
fr: Une définition de classe est une instruction qui est exécutée. La liste d'héritage (*inheritance* entre crochets dans la grammaire ci-dessus) donne habituellement une liste de classes mères (voir :ref:`metaclasses` pour des utilisations plus avancées). Donc chaque élément de la liste doit pouvoir être évalué comme un objet classe qui autorise les sous-classes. Les classes sans liste d'héritage héritent, par défaut, de la classe mère :class:`object` ; d'où ::

source: is equivalent to ::
fr: est équivalente à ::

source: The class's suite is then executed in a new execution frame (see :ref:`naming`), using a newly created local namespace and the original global namespace. (Usually, the suite contains mostly function definitions.) When the class's suite finishes execution, its execution frame is discarded but its local namespace is saved. [#]_ A class object is then created using the inheritance list for the base classes and the saved local namespace for the attribute dictionary. The class name is bound to this class object in the original local namespace.
fr: La suite de la classe est ensuite exécutée dans un nouveau cadre d'exécution (voir :ref:`naming`), en utilisant un espace de nommage local nouvellement créé et l'espace de nommage global d'origine (habituellement, la suite contient principalement des définitions de fonctions). Lorsque la suite de la classe termine son exécution, son cadre d'exécution est abandonné mais son espace des noms locaux est sauvegardé [#]_. Un objet classe est alors créé en utilisant la liste d'héritage pour les classes mères et l'espace de nommage sauvegardé comme dictionnaire des attributs. Le nom de classe est lié à l'objet classe dans l'espace de nommage local original.

source: Class creation can be customized heavily using :ref:`metaclasses <metaclasses>`.
fr: La création de classes peut être fortement personnalisée en utilisant les :ref:`métaclasses <metaclasses>`.

source: Classes can also be decorated: just like when decorating functions, ::
fr: Les classes peuvent aussi être décorées. Comme pour les décorateurs de fonctions ::

source: The evaluation rules for the decorator expressions are the same as for function decorators. The result is then bound to the class name.
fr: Les règles d'évaluation pour les expressions de décorateurs sont les mêmes que pour les décorateurs de fonctions. Le résultat est alors lié au nom de la classe.
