Repository: python/python-docs-fr
Catalog: reference/compound_stmts.po
Languages: fr

source: Classes may be decorated with any valid :token:`~python-grammar:assignment_expression`. Previously, the grammar was much more restrictive; see :pep:`614` for details.
fr: les classes peuvent être décorées par toute :token:`expression d'affectation <~python-grammar:assignment_expression>` valide. Auparavant, la grammaire était beaucoup plus restrictive ; voir la :pep:`614` pour obtenir les détails.

source: **Programmer's note:** Variables defined in the class definition are class attributes; they are shared by instances. Instance attributes can be set in a method with ``self.name = value``. Both class and instance attributes are accessible through the notation "``self.name``", and an instance attribute hides a class attribute with the same name when accessed in this way. Class attributes can be used as defaults for instance attributes, but using mutable values there can lead to unexpected results. :ref:`Descriptors <descriptors>` can be used to create instance variables with different implementation details.
fr: **Note pour les programmeurs :** les variables définies dans la définition de classe sont des attributs de classe ; elles sont partagées par les instances. Les attributs d'instance peuvent être définis dans une méthode en utilisant ``self.name = value``. Les attributs de classe et d'instance sont accessibles par la notation "``self.name``", et un attribut d'instance masque un attribut de classe de même nom lorsqu'on y accède de cette façon. Les attributs de classe peuvent être utilisés comme valeurs par défaut pour les attributs d'instances, mais l'utilisation de valeurs mutables peut conduire à des résultats inattendus. Les :ref:`descripteurs <descriptors>` peuvent être utilisés pour créer des variables d'instances avec des détails d'implémentation différents.

source: :pep:`3115` - Metaclasses in Python 3000
fr: :pep:`3115` — Métaclasses dans Python 3000

source: The proposal that changed the declaration of metaclasses to the current syntax, and the semantics for how classes with metaclasses are constructed.
fr: La proposition qui a modifié la déclaration de métaclasses à la syntaxe actuelle, et la sémantique pour la façon dont les classes avec métaclasses sont construites.

source: :pep:`3129` - Class Decorators
fr: :pep:`3129` — Décorateurs de classes

source: The proposal that added class decorators. Function and method decorators were introduced in :pep:`318`.
fr: La proposition qui a ajouté des décorateurs de classe. Les décorateurs de fonction et de méthode ont été introduits dans :pep:`318`.

source: Coroutine function definition
fr: Définition de fonctions coroutines

source: Execution of Python coroutines can be suspended and resumed at many points (see :term:`coroutine`). :keyword:`await` expressions, :keyword:`async for` and :keyword:`async with` can only be used in the body of a coroutine function.
fr: L'exécution de coroutines Python peut être suspendue et reprise à plusieurs endroits (voir :term:`coroutine`). Les expressions :keyword:`await`, :keyword:`async for` et :keyword:`async with` ne peuvent être utilisées que dans les corps de coroutines.

source: Functions defined with ``async def`` syntax are always coroutine functions, even if they do not contain ``await`` or ``async`` keywords.
fr: Les fonctions définies avec la syntaxe ``async def`` sont toujours des fonctions coroutines, même si elles ne contiennent aucun mot-clé ``await`` ou ``async``.

source: It is a :exc:`SyntaxError` to use a ``yield from`` expression inside the body of a coroutine function.
fr: C'est une :exc:`SyntaxError` d'utiliser une expression ``yield from`` dans une coroutine.

source: An example of a coroutine function::
fr: Un exemple de fonction coroutine ::

source: ``await`` and ``async`` are now keywords; previously they were only treated as such inside the body of a coroutine function.
fr: ``await`` et ``async`` sont dorénavant des mots-clés ; auparavant, ils n'étaient traités comme tels que dans le corps d'une fonction coroutine.

source: The :keyword:`!async for` statement
fr: L'instruction :keyword:`!async for`

source: An :term:`asynchronous iterable` provides an ``__aiter__`` method that directly returns an :term:`asynchronous iterator`, which can call asynchronous code in its ``__anext__`` method.
fr: Un :term:`itérable asynchrone <asynchronous iterable>` fournit une méthode ``__aiter__`` qui renvoie directement un :term:`itérateur asynchrone <asynchronous iterator>`, celui-ci pouvant appeler du code asynchrone dans sa méthode ``__anext__``.

source: The ``async for`` statement allows convenient iteration over asynchronous iterables.
fr: L'instruction ``async for`` permet d'itérer facilement sur des itérables asynchrones.

source: Is semantically equivalent to::
fr: est sémantiquement équivalent à ::

source: See also :meth:`~object.__aiter__` and :meth:`~object.__anext__` for details.
fr: Voir aussi :meth:`~object.__aiter__` et :meth:`~object.__anext__` pour plus de détails.

source: It is a :exc:`SyntaxError` to use an ``async for`` statement outside the body of a coroutine function.
fr: C'est une :exc:`SyntaxError` d'utiliser une instruction ``async for`` en dehors d'une fonction coroutine.

source: The :keyword:`!async with` statement
fr: L'instruction :keyword:`!async with`

source: An :term:`asynchronous context manager` is a :term:`context manager` that is able to suspend execution in its *enter* and *exit* methods.
fr: Un :term:`gestionnaire de contexte asynchrone <asynchronous context manager>` est un :term:`gestionnaire de contexte <context manager>` qui est capable de suspendre l'exécution dans ses méthodes *enter* et *exit*.

source: See also :meth:`~object.__aenter__` and :meth:`~object.__aexit__` for details.
fr: Voir aussi :meth:`~object.__aenter__` et :meth:`~object.__aexit__` pour plus de détails.

source: It is a :exc:`SyntaxError` to use an ``async with`` statement outside the body of a coroutine function.
fr: C'est une :exc:`SyntaxError` d'utiliser l'instruction ``async with`` en dehors d'une fonction coroutine.

source: :pep:`492` - Coroutines with async and await syntax
fr: :pep:`492` — Coroutines avec les syntaxes *async* et *await*

source: The proposal that made coroutines a proper standalone concept in Python, and added supporting syntax.
fr: La proposition qui a fait que les coroutines soient un concept propre en Python, et a ajouté la syntaxe de prise en charge de celles-ci.

source: Footnotes
fr: Notes

source: The exception is propagated to the invocation stack unless there is a :keyword:`finally` clause which happens to raise another exception. That new exception causes the old one to be lost.
fr: L'exception est propagée à la pile d'appels à moins qu'il n'y ait une clause :keyword:`finally` qui lève une autre exception, ce qui entraîne la perte de l'ancienne exception. Cette nouvelle exception entraîne la perte pure et simple de l'ancienne.

source: In pattern matching, a sequence is defined as one of the following:
fr: Dans le filtrage par motif, une séquence est définie comme suit :

source: a class that inherits from :class:`collections.abc.Sequence`
fr: une classe qui hérite de :class:`collections.abc.Sequence`

source: a Python class that has been registered as :class:`collections.abc.Sequence`
fr: une classe Python qui a été enregistrée en tant que :class:`collections.abc.Sequence`

source: a builtin class that has its (CPython) :c:macro:`Py_TPFLAGS_SEQUENCE` bit set
fr: une classe native dont le bit (CPython) :c:macro:`Py_TPFLAGS_SEQUENCE` est à 1

source: a class that inherits from any of the above
fr: une classe qui hérite d'une classe citée ci-dessus

source: The following standard library classes are sequences:
fr: Les classes suivantes de la bibliothèque standard sont des séquences :

source: Subject values of type ``str``, ``bytes``, and ``bytearray`` do not match sequence patterns.
fr: Les champs de recherche du type ``str``, ``bytes`` et ``bytearray`` ne correspondent pas avec des filtres de séquence.

source: In pattern matching, a mapping is defined as one of the following:
fr: Dans le filtrage par motif, un tableau associatif est défini comme suit :

source: a class that inherits from :class:`collections.abc.Mapping`
fr: une classe qui hérite de :class:`collections.abc.Mapping`

source: a Python class that has been registered as :class:`collections.abc.Mapping`
fr: une classe Python qui a été enregistrée en tant que :class:`collections.abc.Mapping`

source: a builtin class that has its (CPython) :c:macro:`Py_TPFLAGS_MAPPING` bit set
fr: une classe native dont le bit (CPython) :c:macro:`Py_TPFLAGS_MAPPING` est à 1

source: The standard library classes :class:`dict` and :class:`types.MappingProxyType` are mappings.
fr: Les classes :class:`dict` et :class:`types.MappingProxyType` de la bibliothèque standard sont des tableaux associatifs.

source: compound
fr: composé

source: statement
fr: instruction

source: ; (semicolon)
fr: ; (point-virgule)

source: NEWLINE token
fr: lexème NEWLINE

source: DEDENT token
fr: lexème DEDENT

source: dangling
fr: fantôme

source: keyword
fr: mot-clé

source: : (colon)
fr: : (deux-points)

source: compound statement
fr: instruction composée

source: loop
fr: boucle

source: target
fr: cible

source: list
fr: liste

source: object
fr: objet

source: sequence
fr: séquence

source: built-in function
fr: fonction native

source: except clause
fr: clause except

source: traceback
fr: trace d'appels

source: with statement
fr: instruction *with*

source: , (comma)
fr: , (virgule)

source: pattern matching
fr: filtrage par motif

source: match statement
fr: instruction *match*

source: guard
fr: garde

source: irrefutable case block
fr: bloc attrape-tout

source: case block
fr: bloc *case*

source: ! patterns
fr: ! motifs

source: AS pattern, OR pattern, capture pattern, wildcard pattern
fr: motif AS, motif OR, motif de capture, motif attrape-tout

source: parameter
fr: paramètre

source: function definition
fr: définition de fonction

source: function
fr: fonction

source: definition
fr: définition

source: name
fr: nom

source: binding
fr: liaison

source: user-defined function
fr: fonction définie par l'utilisateur

source: () (parentheses)
fr: () (parenthèses)

source: parameter list
fr: liste de paramètres

source: @ (at)
fr: @ (arobase)

source: default
fr: par défaut

source: value
fr: valeur

source: = (equals)
fr: = (égal)

source: / (slash)
fr: / (barre oblique)

source: * (asterisk)
fr: * (astérisque)

source: function annotations
fr: annotations de fonction

source: class
fr: classe

source: execution
fr: exécution

source: frame
fr: cadre

source: inheritance
fr: héritage

source: docstring
fr: chaîne de documentation

source: class definition
fr: définition de classe

source: expression list
fr: liste d'expressions
