Repository: python/python-docs-fr
Catalog: reference/datamodel.po
Languages: fr

source: Special read-only attributes: :attr:`f_back` is to the previous stack frame (towards the caller), or ``None`` if this is the bottom stack frame; :attr:`f_code` is the code object being executed in this frame; :attr:`f_locals` is the dictionary used to look up local variables; :attr:`f_globals` is used for global variables; :attr:`f_builtins` is used for built-in (intrinsic) names; :attr:`f_lasti` gives the precise instruction (this is an index into the bytecode string of the code object).
fr: Attributs spéciaux en lecture seule : :attr:`f_back` pointe vers le cadre précédent (l'appelant) ou ``None`` si c'est le pied de la pile d'appel ; :attr:`f_code` est l'objet code en cours d'exécution dans ce cadre ; :attr:`f_locals` est le dictionnaire dans lequel sont cherchées les variables locales ; :attr:`f_globals` est utilisé pour les variables globales ; :attr:`f_builtins` est utilisé pour les noms natifs ; :attr:`f_lasti` donne l'instruction précise (c'est un indice dans la chaîne de *bytecode* de l'objet code).

source: Special writable attributes: :attr:`f_trace`, if not ``None``, is a function called for various events during code execution (this is used by the debugger). Normally an event is triggered for each new source line - this can be disabled by setting :attr:`f_trace_lines` to :const:`False`.
fr: Attributs spéciaux en lecture-écriture : :attr:`f_trace`, s'il n'est pas ``None``, c'est une fonction appelée à différentes occasions durant l'exécution du code (elle est utilisée par le débogueur). Normalement, un événement est déclenché pour chaque ligne de code source — ce comportement peut être désactivé en définissant :attr:`f_trace_lines` à :const:`False`.

source: Implementations *may* allow per-opcode events to be requested by setting :attr:`f_trace_opcodes` to :const:`True`. Note that this may lead to undefined interpreter behaviour if exceptions raised by the trace function escape to the function being traced.
fr: Une implémentation *peut* autoriser le déclenchement des événements *opcode* par *opcode* en définissant :attr:`f_trace_opcodes` à :const:`True`. Notez que cela peut conduire à un comportement erratique de l'interpréteur si des exceptions levées la fonction de traçage s'échappent vers la fonction en train d'être tracée.

source: :attr:`f_lineno` is the current line number of the frame --- writing to this from within a trace function jumps to the given line (only for the bottom-most frame). A debugger can implement a Jump command (aka Set Next Statement) by writing to f_lineno.
fr: :attr:`f_lineno` est le numéro de la ligne courante du cadre — écrire dedans depuis une fonction trace fait sauter à la ligne demandée (seulement pour le cadre le plus bas). Un débogueur peut implémenter une commande « sauter vers » (aussi appelée « Définir la prochaine instruction » ou *Set Next Statement* en anglais) en écrivant dans ``f_lineno``.

source: Frame objects support one method:
fr: Les objets cadres comprennent une méthode :

source: This method clears all references to local variables held by the frame. Also, if the frame belonged to a generator, the generator is finalized. This helps break reference cycles involving frame objects (for example when catching an exception and storing its traceback for later use).
fr: Cette méthode efface toutes les références aux variables locales conservées dans le cadre. Par ailleurs, si le cadre est celui d'un générateur, le générateur se termine. Ceci permet de casser des références cycliques qui incluent des objets cadres (par exemple, lors de la capture d'une exception et du stockage de la pile d'appels pour une utilisation future).

source: :exc:`RuntimeError` is raised if the frame is currently executing.
fr: :exc:`RuntimeError` est levée si le cadre est en cours d'exécution.

source: Traceback objects
fr: Objets traces

source: Traceback objects represent a stack trace of an exception. A traceback object is implicitly created when an exception occurs, and may also be explicitly created by calling :class:`types.TracebackType`.
fr: Les objets traces représentent la pile de traces d'une exception. Un objet trace est implicitement créé quand une exception apparaît et peut être explicitement créé en appelant :class:`types.TracebackType`.

source: For implicitly created tracebacks, when the search for an exception handler unwinds the execution stack, at each unwound level a traceback object is inserted in front of the current traceback. When an exception handler is entered, the stack trace is made available to the program. (See section :ref:`try`.) It is accessible as the third item of the tuple returned by ``sys.exc_info()``, and as the ``__traceback__`` attribute of the caught exception.
fr: Pour les traces créées implicitement, quand l'interpréteur recherche un gestionnaire d'exception en remontant la pile d'exécution, un objet trace est inséré devant l'objet trace courant à chaque nouveau niveau. Quand il entre dans le gestionnaire d'exception, la pile d'appels est rendue accessible au programme (voir la section :ref:`try`). Elle est accessible par le troisième élément du triplet renvoyé par ``sys.exc_info()`` et comme attribut ``__traceback__`` de l'exception qui est traitée.

source: When the program contains no suitable handler, the stack trace is written (nicely formatted) to the standard error stream; if the interpreter is interactive, it is also made available to the user as ``sys.last_traceback``.
fr: Quand le programme ne contient aucun gestionnaire adéquat, la pile de traces est écrite (joliment formatée) sur la sortie d'erreur standard ; si l'interpréteur est interactif, elle est rendue disponible pour l'utilisateur en tant que ``sys.last_traceback``.

source: For explicitly created tracebacks, it is up to the creator of the traceback to determine how the ``tb_next`` attributes should be linked to form a full stack trace.
fr: Pour les traces créées explicitement, il revient au créateur de la trace de déterminer comment les attributs ``tb_next`` doivent être liés pour former la pile complète des traces.

source: Special read-only attributes: :attr:`tb_frame` points to the execution frame of the current level; :attr:`tb_lineno` gives the line number where the exception occurred; :attr:`tb_lasti` indicates the precise instruction. The line number and last instruction in the traceback may differ from the line number of its frame object if the exception occurred in a :keyword:`try` statement with no matching except clause or with a finally clause.
fr: Attributs spéciaux en lecture seule : :attr:`tb_frame` pointe vers le cadre d'exécution du niveau courant ; :attr:`tb_lineno` donne le numéro de ligne où l'exception a été levée ; :attr:`tb_lasti` indique l'instruction précise. Le numéro de ligne et la dernière instruction dans la trace peuvent différer du numéro de ligne de l'objet cadre si l'exception a eu lieu dans une instruction :keyword:`try` sans qu'il n'y ait de clause :keyword:`!except` adéquate ou sans clause *finally*.

source: Special writable attribute: :attr:`tb_next` is the next level in the stack trace (towards the frame where the exception occurred), or ``None`` if there is no next level.
fr: Attributs spéciaux en lecture-écriture :attr:`tb_next` est le niveau suivant dans la pile d'exécution (en direction du cadre où l'exception a eu lieu) ou ``None`` s'il n'y a pas de niveau suivant.

source: Traceback objects can now be explicitly instantiated from Python code, and the ``tb_next`` attribute of existing instances can be updated.
fr: Les objets de traces d'appels peuvent maintenant être explicitement instanciés depuis le code Python et l'attribut ``tb_next`` des instances existantes peut être mis à jour.

source: Slice objects
fr: Objets tranches

source: Slice objects are used to represent slices for :meth:`__getitem__` methods. They are also created by the built-in :func:`slice` function.
fr: Un objet tranche est utilisé pour représenter des découpes des méthodes :meth:`__getitem__`. Ils sont aussi créés par la fonction native :func:`slice`.

source: Special read-only attributes: :attr:`~slice.start` is the lower bound; :attr:`~slice.stop` is the upper bound; :attr:`~slice.step` is the step value; each is ``None`` if omitted. These attributes can have any type.
fr: Attributs spéciaux en lecture seule : :attr:`~decoupe.start` est la borne inférieure ; :attr:`~decoupe.stop` est la borne supérieure ; :attr:`~decoupe.step` est la valeur du pas ; chaque attribut vaut ``None`` s'il est omis. Ces attributs peuvent être de n'importe quel type.

source: Slice objects support one method:
fr: Les objets tranches comprennent une méthode :

source: This method takes a single integer argument *length* and computes information about the slice that the slice object would describe if applied to a sequence of *length* items. It returns a tuple of three integers; respectively these are the *start* and *stop* indices and the *step* or stride length of the slice. Missing or out-of-bounds indices are handled in a manner consistent with regular slices.
fr: Cette méthode prend un argument entier *length* et calcule les informations de la tranche que l'objet découpe décrit s'il est appliqué à une séquence de *length* éléments. Elle renvoie un triplet d'entiers ; respectivement, ce sont les indices de *début* et *fin* ainsi que le *pas* de découpe. Les indices manquants ou en dehors sont gérés de manière cohérente avec les tranches normales.

source: Static method objects
fr: Objets méthodes statiques

source: Static method objects provide a way of defeating the transformation of function objects to method objects described above. A static method object is a wrapper around any other object, usually a user-defined method object. When a static method object is retrieved from a class or a class instance, the object actually returned is the wrapped object, which is not subject to any further transformation. Static method objects are not themselves callable, although the objects they wrap usually are. Static method objects are created by the built-in :func:`staticmethod` constructor.
fr: Les objets méthodes statiques permettent la transformation des objets fonctions en objets méthodes décrits au-dessus. Un objet méthode statique encapsule tout autre objet, souvent un objet méthode définie par l'utilisateur. Quand un objet méthode statique est récupéré depuis une classe ou une instance de classe, l'objet réellement renvoyé est un objet encapsulé, qui n'a pas vocation à être transformé encore une fois. Les objets méthodes statiques ne sont pas appelables en tant que tels, bien que les objets qu'ils encapsulent le soient souvent. Les objets méthodes statiques sont créés par le constructeur natif :func:`staticmethod`.

source: Class method objects
fr: Objets méthodes de classes

source: A class method object, like a static method object, is a wrapper around another object that alters the way in which that object is retrieved from classes and class instances. The behaviour of class method objects upon such retrieval is described above, under "User-defined methods". Class method objects are created by the built-in :func:`classmethod` constructor.
fr: Un objet méthode de classe, comme un objet méthode statique, encapsule un autre objet afin de modifier la façon dont cet objet est récupéré depuis les classes et instances de classes. Le comportement des objets méthodes de classes dans le cas d'une telle récupération est décrit plus haut, dans « méthodes définies par l'utilisateur ». Les objets méthodes de classes sont créés par le constructeur natif :func:`classmethod`.

source: Special method names
fr: Méthodes spéciales

source: A class can implement certain operations that are invoked by special syntax (such as arithmetic operations or subscripting and slicing) by defining methods with special names. This is Python's approach to :dfn:`operator overloading`, allowing classes to define their own behavior with respect to language operators. For instance, if a class defines a method named :meth:`__getitem__`, and ``x`` is an instance of this class, then ``x[i]`` is roughly equivalent to ``type(x).__getitem__(x, i)``. Except where mentioned, attempts to execute an operation raise an exception when no appropriate method is defined (typically :exc:`AttributeError` or :exc:`TypeError`).
fr: Une classe peut implémenter certaines opérations que l'on invoque par une syntaxe spéciale (telles que les opérations arithmétiques ou la découpe en tranches) en définissant des méthodes aux noms particuliers. C'est l'approche utilisée par Python pour la :dfn:`surcharge d'opérateur`, permettant à une classe de définir son propre comportement vis-à-vis des opérateurs du langage. Par exemple, si une classe définit une méthode :meth:`__getitem__` et que ``x`` est une instance de cette classe, alors ``x[i]`` est globalement équivalent à ``type(x).__getitem__(x, i)``. Sauf lorsque c'est mentionné, toute tentative d'appliquer une opération alors que la méthode appropriée n'est pas définie lève une exception (typiquement :exc:`AttributeError` ou :exc:`TypeError`).

source: Setting a special method to ``None`` indicates that the corresponding operation is not available. For example, if a class sets :meth:`__iter__` to ``None``, the class is not iterable, so calling :func:`iter` on its instances will raise a :exc:`TypeError` (without falling back to :meth:`__getitem__`). [#]_
fr: Définir une méthode spéciale à ``None`` indique que l'opération correspondante n'est pas disponible. Par exemple, si une classe assigne ``None`` à :meth:`__iter__`, vous ne pouvez pas itérer sur la classe et appeler :func:`iter` sur une instance lève :exc:`TypeError` (sans se replier sur :meth:`__getitem__`) [#]_.

source: When implementing a class that emulates any built-in type, it is important that the emulation only be implemented to the degree that it makes sense for the object being modelled. For example, some sequences may work well with retrieval of individual elements, but extracting a slice may not make sense. (One example of this is the :class:`~xml.dom.NodeList` interface in the W3C's Document Object Model.)
fr: Lorsque vous implémentez une classe qui émule un type natif, il est important que cette émulation n'implémente que ce qui fait sens pour l'objet qui est modélisé. Par exemple, la recherche d'éléments individuels d'une séquence peut faire sens, mais pas l'extraction d'une tranche (un exemple est l'interface de :class:`~xml.dom.NodeList` dans le modèle objet des documents W3C).

source: Basic customization
fr: Personnalisation de base

source: Called to create a new instance of class *cls*. :meth:`__new__` is a static method (special-cased so you need not declare it as such) that takes the class of which an instance was requested as its first argument. The remaining arguments are those passed to the object constructor expression (the call to the class). The return value of :meth:`__new__` should be the new object instance (usually an instance of *cls*).
fr: Appelée pour créer une nouvelle instance de la classe *cls*. La méthode :meth:`__new__` est statique (c'est un cas particulier, vous n'avez pas besoin de la déclarer comme telle) qui prend comme premier argument la classe pour laquelle on veut créer une instance. Les autres arguments sont ceux passés à l'expression de l'objet constructeur (l'appel à la classe). La valeur de retour de :meth:`__new__` doit être l'instance du nouvel objet (classiquement une instance de *cls*).

source: Typical implementations create a new instance of the class by invoking the superclass's :meth:`__new__` method using ``super().__new__(cls[, ...])`` with appropriate arguments and then modifying the newly-created instance as necessary before returning it.
fr: Une implémentation typique crée une nouvelle instance de la classe en invoquant la méthode :meth:`__new__` de la superclasse à l'aide de ``super().__new__(cls[, ...])`` avec les arguments adéquats, puis modifie l'instance nouvellement créée en tant que de besoin avant de la renvoyer.

source: If :meth:`__new__` is invoked during object construction and it returns an instance or subclass of *cls*, then the new instance’s :meth:`__init__` method will be invoked like ``__init__(self[, ...])``, where *self* is the new instance and the remaining arguments are the same as were passed to the object constructor.
fr: Si :meth:`__new__` est appelée pendant la construction de l'objet et renvoie une instance de *cls* ou d'une de ses sous-classes, alors la méthode :meth:`__init__` de la nouvelle instance est invoquée avec ``__init__(self[, ...])`` où *self* est la nouvelle instance et les autres arguments sont les mêmes que ceux passés au constructeur de l'objet.

source: If :meth:`__new__` does not return an instance of *cls*, then the new instance's :meth:`__init__` method will not be invoked.
fr: Si :meth:`__new__` ne renvoie pas une instance de *cls*, alors la méthode :meth:`__init__` de la nouvelle instance n'est pas invoquée.

source: :meth:`__new__` is intended mainly to allow subclasses of immutable types (like int, str, or tuple) to customize instance creation. It is also commonly overridden in custom metaclasses in order to customize class creation.
fr: L'objectif de :meth:`__new__` est principalement, pour les sous-classes de types immuables (comme ``int``, ``str`` ou ``tuple``), d'autoriser la création sur mesure des instances. Elle est aussi souvent surchargée dans les méta-classes pour particulariser la création des classes.

source: Called after the instance has been created (by :meth:`__new__`), but before it is returned to the caller. The arguments are those passed to the class constructor expression. If a base class has an :meth:`__init__` method, the derived class's :meth:`__init__` method, if any, must explicitly call it to ensure proper initialization of the base class part of the instance; for example: ``super().__init__([args...])``.
fr: Appelée après la création de l'instance (par :meth:`__new__`), mais avant le retour vers l'appelant. Les arguments sont ceux passés à l'expression du constructeur de classe. Si une classe de base possède une méthode :meth:`__init__`, la méthode :meth:`__init__` de la classe dérivée, si elle existe, doit explicitement appeler cette méthode pour assurer une initialisation correcte de la partie classe de base de l'instance ; par exemple : ``super().__init__([args...])``.

source: Because :meth:`__new__` and :meth:`__init__` work together in constructing objects (:meth:`__new__` to create it, and :meth:`__init__` to customize it), no non-``None`` value may be returned by :meth:`__init__`; doing so will cause a :exc:`TypeError` to be raised at runtime.
fr: Comme :meth:`__new__` et :meth:`__init__` travaillent ensemble pour créer des objets (:meth:`__new__` pour le créer, :meth:`__init__` pour le particulariser), :meth:`__init__` ne doit pas renvoyer de valeur ``None`` ; sinon une exception :exc:`TypeError` est levée à l'exécution.

source: Called when the instance is about to be destroyed. This is also called a finalizer or (improperly) a destructor. If a base class has a :meth:`__del__` method, the derived class's :meth:`__del__` method, if any, must explicitly call it to ensure proper deletion of the base class part of the instance.
fr: Appelée au moment où une instance est sur le point d'être détruite. On l'appelle aussi finaliseur ou (improprement) destructeur. Si une classe de base possède une méthode :meth:`__del__`, la méthode :meth:`__del__` de la classe dérivée, si elle existe, doit explicitement l'appeler pour s'assurer de l'effacement correct de la partie classe de base de l'instance.

source: It is possible (though not recommended!) for the :meth:`__del__` method to postpone destruction of the instance by creating a new reference to it. This is called object *resurrection*. It is implementation-dependent whether :meth:`__del__` is called a second time when a resurrected object is about to be destroyed; the current :term:`CPython` implementation only calls it once.
fr: Il est possible (mais pas recommandé) que la méthode :meth:`__del__` retarde la destruction de l'instance en créant une nouvelle référence vers cet objet. Python appelle ceci la *résurrection* d'objet. En fonction de l'implémentation, :meth:`__del__` peut être appelée une deuxième fois au moment où l'objet ressuscité va être détruit ; l'implémentation actuelle de :term:`CPython` ne l'appelle qu'une fois.

source: It is not guaranteed that :meth:`__del__` methods are called for objects that still exist when the interpreter exits.
fr: Il n'est pas garanti que soient appelées les méthodes :meth:`__del__` des objets qui existent toujours quand l'interpréteur termine.

source: ``del x`` doesn't directly call ``x.__del__()`` --- the former decrements the reference count for ``x`` by one, and the latter is only called when ``x``'s reference count reaches zero.
fr: ``del x`` n'appelle pas directement ``x.__del__()`` — la première décrémente le compteur de références de ``x``. La seconde n'est appelée que quand le compteur de références de ``x`` atteint zéro.

source: Documentation for the :mod:`gc` module.
fr: Documentation du module :mod:`gc`.

source: Due to the precarious circumstances under which :meth:`__del__` methods are invoked, exceptions that occur during their execution are ignored, and a warning is printed to ``sys.stderr`` instead. In particular:
fr: En raison des conditions particulières qui règnent quand :meth:`__del__` est appelée, les exceptions levées pendant son exécution sont ignorées et, à la place, un avertissement est affiché sur ``sys.stderr``. En particulier :

source: :meth:`__del__` can be invoked when arbitrary code is being executed, including from any arbitrary thread. If :meth:`__del__` needs to take a lock or invoke any other blocking resource, it may deadlock as the resource may already be taken by the code that gets interrupted to execute :meth:`__del__`.
fr: :meth:`__del__` peut être invoquée quand du code arbitraire est en cours d'exécution, et ce dans n'importe quel fil d'exécution. Si :meth:`__del__` a besoin de poser un verrou ou d'accéder à tout autre ressource bloquante, elle peut provoquer un blocage mutuel (*deadlock* en anglais) car la ressource peut être déjà utilisée par le code qui est interrompu pour exécuter la méthode :meth:`__del__`.

source: :meth:`__del__` can be executed during interpreter shutdown. As a consequence, the global variables it needs to access (including other modules) may already have been deleted or set to ``None``. Python guarantees that globals whose name begins with a single underscore are deleted from their module before other globals are deleted; if no other references to such globals exist, this may help in assuring that imported modules are still available at the time when the :meth:`__del__` method is called.
fr: :meth:`__del__` peut être exécutée pendant que l'interpréteur se ferme. En conséquence, les variables globales auxquelles elle souhaite accéder (y compris les autres modules) peuvent déjà être détruites ou assignées à ``None``. Python garantit que les variables globales dont le nom commence par un tiret bas sont supprimées de leur module avant que les autres variables globales ne le soient ; si aucune autre référence vers ces variables globales n'existe, cela peut aider à s'assurer que les modules importés soient toujours accessibles au moment où la méthode :meth:`__del__` est appelée.
