Repository: python/python-docs-fr
Catalog: reference/datamodel.po
Languages: fr

source: A built-in function object is a wrapper around a C function. Examples of built-in functions are :func:`len` and :func:`math.sin` (:mod:`math` is a standard built-in module). The number and type of the arguments are determined by the C function. Special read-only attributes: :attr:`__doc__` is the function's documentation string, or ``None`` if unavailable; :attr:`~definition.__name__` is the function's name; :attr:`__self__` is set to ``None`` (but see the next item); :attr:`__module__` is the name of the module the function was defined in or ``None`` if unavailable.
fr: Un objet fonction native est une enveloppe autour d'une fonction C. Nous pouvons citer :func:`len` et :func:`math.sin` (:mod:`math` est un module standard natif) comme fonctions natives. Le nombre et le type des arguments sont déterminés par la fonction C. Des attributs spéciaux en lecture seule existent : :attr:`__doc__` contient le texte de documentation de la fonction (ou ``None`` s'il n'y en a pas) ; :attr:`~definition.__name__` est le nom de la fonction ; :attr:`__self__` est défini à ``None`` ; :attr:`__module__` est le nom du module où la fonction est définie ou ``None`` s'il n'est pas disponible.

source: Built-in methods
fr: Méthodes natives

source: This is really a different disguise of a built-in function, this time containing an object passed to the C function as an implicit extra argument. An example of a built-in method is ``alist.append()``, assuming *alist* is a list object. In this case, the special read-only attribute :attr:`__self__` is set to the object denoted by *alist*.
fr: Ce sont des fonctions natives déguisées, contenant un objet passé à une fonction C en tant qu'argument supplémentaire implicite. Un exemple de méthode native est ``une_liste.append()`` (``une_liste`` étant un objet liste). Dans ce cas, l'attribut spécial en lecture seule :attr:`__self__` est défini à l'objet *une_liste*.

source: Classes are callable. These objects normally act as factories for new instances of themselves, but variations are possible for class types that override :meth:`__new__`. The arguments of the call are passed to :meth:`__new__` and, in the typical case, to :meth:`__init__` to initialize the new instance.
fr: Les classes sont des appelables. Ces objets sont normalement utilisés pour créer des instances d'elles-mêmes mais des variations sont possibles pour les types de classes qui surchargent :meth:`__new__`. Les arguments de l'appel sont passés à :meth:`__new__` et, dans le cas classique, :meth:`__new__` initialise une nouvelle instance.

source: Class Instances
fr: Instances de classe

source: Instances of arbitrary classes can be made callable by defining a :meth:`__call__` method in their class.
fr: Les instances d'une classe peuvent devenir des appelables si vous définissez la méthode :meth:`__call__` de leur classe.

source: Modules are a basic organizational unit of Python code, and are created by the :ref:`import system <importsystem>` as invoked either by the :keyword:`import` statement, or by calling functions such as :func:`importlib.import_module` and built-in :func:`__import__`. A module object has a namespace implemented by a dictionary object (this is the dictionary referenced by the ``__globals__`` attribute of functions defined in the module). Attribute references are translated to lookups in this dictionary, e.g., ``m.x`` is equivalent to ``m.__dict__["x"]``. A module object does not contain the code object used to initialize the module (since it isn't needed once the initialization is done).
fr: Les modules constituent l'organisation de base du code Python et sont créés par le :ref:`mécanisme d'import <importsystem>` soit avec l'instruction :keyword:`import`, soit en appelant des fonctions telles que :func:`importlib.import_module` ou la fonction native :func:`__import__`. Un objet module possède un espace de nommage implémenté par un objet dictionnaire (c'est le dictionnaire référencé par l'attribut ``__globals__`` des fonctions définies dans le module). Les références à un attribut sont traduites en recherches dans ce dictionnaire, par exemple ``m.x`` est équivalent à ``m.__dict__["x"]``. Un objet module ne contient pas l'objet code utilisé pour initialiser le module (puisque celui-ci n'est plus nécessaire une fois l'initialisation terminée).

source: Attribute assignment updates the module's namespace dictionary, e.g., ``m.x = 1`` is equivalent to ``m.__dict__["x"] = 1``.
fr: L'assignation d'un attribut met à jour le dictionnaire d'espace de nommage du module, par exemple ``m.x = 1`` est équivalent à ``m.__dict__["x"] = 1``.

source: Predefined (writable) attributes: :attr:`__name__` is the module's name; :attr:`__doc__` is the module's documentation string, or ``None`` if unavailable; :attr:`__annotations__` (optional) is a dictionary containing :term:`variable annotations <variable annotation>` collected during module body execution; :attr:`__file__` is the pathname of the file from which the module was loaded, if it was loaded from a file. The :attr:`__file__` attribute may be missing for certain types of modules, such as C modules that are statically linked into the interpreter; for extension modules loaded dynamically from a shared library, it is the pathname of the shared library file.
fr: Attributs prédéfinis (en lecture-écriture) : :attr:`__name__` est le nom du module ; :attr:`__doc__` est le texte de documentation du module (ou ``None`` s'il n'y en a pas) ; :attr:`__annotations__` (optionnel) est un dictionnaire contenant les :term:`annotations de variables <variable annotation>` collectées durant l'exécution du corps du module ; :attr:`__file__` est le chemin vers le fichier à partir duquel le module a été chargé, s'il a été chargé depuis un fichier. L'attribut :attr:`__file__` peut être manquant pour certains types de modules, tels que les modules C qui sont statiquement liés à l'interpréteur ; pour les modules d'extension chargés dynamiquement à partir d'une bibliothèque partagée, c'est le chemin vers le fichier de la bibliothèque partagée.

source: Special read-only attribute: :attr:`~object.__dict__` is the module's namespace as a dictionary object.
fr: Attribut spécial en lecture seule : :attr:`~object.__dict__` est l'objet dictionnaire répertoriant l'espace de nommage du module.

source: Because of the way CPython clears module dictionaries, the module dictionary will be cleared when the module falls out of scope even if the dictionary still has live references. To avoid this, copy the dictionary or keep the module around while using its dictionary directly.
fr: en raison de la manière dont CPython nettoie les dictionnaires de modules, le dictionnaire du module est effacé quand le module n'est plus visible, même si le dictionnaire possède encore des références actives. Pour éviter ceci, copiez le dictionnaire ou gardez le module dans votre champ de visibilité tant que vous souhaitez utiliser le dictionnaire directement.

source: Custom classes
fr: Classes déclarées par le développeur

source: Custom class types are typically created by class definitions (see section :ref:`class`). A class has a namespace implemented by a dictionary object. Class attribute references are translated to lookups in this dictionary, e.g., ``C.x`` is translated to ``C.__dict__["x"]`` (although there are a number of hooks which allow for other means of locating attributes). When the attribute name is not found there, the attribute search continues in the base classes. This search of the base classes uses the C3 method resolution order which behaves correctly even in the presence of 'diamond' inheritance structures where there are multiple inheritance paths leading back to a common ancestor. Additional details on the C3 MRO used by Python can be found in the documentation accompanying the 2.3 release at https://www.python.org/download/releases/2.3/mro/.
fr: Le type d'une classe déclarée par le développeur est créé au moment de la définition de la classe (voir la section :ref:`class`). Une classe possède un espace de nommage implémenté sous la forme d'un objet dictionnaire. Les références vers les attributs de la classe sont traduits en recherches dans ce dictionnaire, par exemple ``C.x`` est traduit en ``C.__dict__["x"]`` (bien qu'il existe un certain nombre de fonctions automatiques qui permettent de trouver des attributs par d'autres moyens). Si le nom d'attribut n'est pas trouvé dans ce dictionnaire, la recherche continue dans les classes de base. Les classes de base sont trouvées en utilisant l'ordre de résolution des méthodes (*method resolution order* en anglais, ou MRO) *C3* qui a un comportement cohérent même en présence d'héritages en "diamant", où différentes branches d'héritages conduisent vers un ancêtre commun. Vous trouverez plus de détails sur l'ordre de résolution des méthodes MRO *C3* utilisé par Python dans la documentation de la version 2.3 disponible sur https://www.python.org/download/releases/2.3/mro/.

source: When a class attribute reference (for class :class:`C`, say) would yield a class method object, it is transformed into an instance method object whose :attr:`__self__` attribute is :class:`C`. When it would yield a static method object, it is transformed into the object wrapped by the static method object. See section :ref:`descriptors` for another way in which attributes retrieved from a class may differ from those actually contained in its :attr:`~object.__dict__`.
fr: Quand une référence à un attribut de classe (disons la classe :class:`C`) pointe vers un objet méthode de classe, elle est transformée en objet méthode d'instance dont l'attribut :attr:`__self__` est :class:`C`. Quand elle pointe vers un objet méthode statique, elle est transformée en objet encapsulé par l'objet méthode statique. Reportez-vous à la section :ref:`descriptors` pour une autre manière dont les attributs d'une classe diffèrent de ceux réellement contenus dans son :attr:`~objet.__dict__`.

source: Class attribute assignments update the class's dictionary, never the dictionary of a base class.
fr: Les assignations d'un attribut de classe mettent à jour le dictionnaire de la classe, jamais le dictionnaire d'une classe de base.

source: A class object can be called (see above) to yield a class instance (see below).
fr: Un objet classe peut être appelé (voir ci-dessus) pour produire une instance de classe (voir ci-dessous).

source: Special attributes: :attr:`~definition.__name__` is the class name; :attr:`__module__` is the module name in which the class was defined; :attr:`~object.__dict__` is the dictionary containing the class's namespace; :attr:`~class.__bases__` is a tuple containing the base classes, in the order of their occurrence in the base class list; :attr:`__doc__` is the class's documentation string, or ``None`` if undefined; :attr:`__annotations__` (optional) is a dictionary containing :term:`variable annotations <variable annotation>` collected during class body execution.
fr: Attributs spéciaux : :attr:`~definition.__name__` est le nom de la classe ; :attr:`__module__` est le nom du module dans lequel la classe est définie ; :attr:`~object.__dict__` est le dictionnaire contenant l'espace de nommage de la classe ; :attr:`~class.__bases__` est un *n*-uplet contenant les classes de base, dans l'ordre d'apparition dans la liste des classes de base ; :attr:`__doc__` est le texte de documentation de la classe (ou ``None`` s’il n’y en a pas) ; :attr:`__annotations__` (optionnel) est un dictionnaire contenant les :term:`annotations de variables <variable annotation>` collectées durant l'exécution du corps de la classe.

source: Class instances
fr: Instances de classe

source: A class instance is created by calling a class object (see above). A class instance has a namespace implemented as a dictionary which is the first place in which attribute references are searched. When an attribute is not found there, and the instance's class has an attribute by that name, the search continues with the class attributes. If a class attribute is found that is a user-defined function object, it is transformed into an instance method object whose :attr:`__self__` attribute is the instance. Static method and class method objects are also transformed; see above under "Classes". See section :ref:`descriptors` for another way in which attributes of a class retrieved via its instances may differ from the objects actually stored in the class's :attr:`~object.__dict__`. If no class attribute is found, and the object's class has a :meth:`__getattr__` method, that is called to satisfy the lookup.
fr: Une instance de classe est créée en appelant un objet classe (voir ci-dessus). Une instance de classe possède un espace de nommage implémenté sous la forme d'un dictionnaire qui est le premier endroit où sont recherchées les références aux attributs. Quand un attribut n'est pas trouvé dans ce dictionnaire et que la classe de l'instance contient un attribut avec ce nom, la recherche continue avec les attributs de la classe. Si un attribut de classe est trouvé et que c'est un objet fonction définie par l'utilisateur, il est transformé en objet méthode d'instance dont l'attribut :attr:`__self__` est l'instance. Les objets méthodes statiques et méthodes de classe sont aussi transformés ; reportez-vous ci-dessous à « Classes ». Lisez la section :ref:`descriptors` pour une autre façon de récupérer les attributs d'une classe, où la récupération *via* ses instances peut différer des objets réellement stockés dans le :attr:`~object.__dict__` de la classe. Si aucun attribut de classe n'est trouvé et que la classe de l'objet possède une méthode :meth:`__getattr__`, cette méthode est appelée pour rechercher une correspondance.

source: Attribute assignments and deletions update the instance's dictionary, never a class's dictionary. If the class has a :meth:`__setattr__` or :meth:`__delattr__` method, this is called instead of updating the instance dictionary directly.
fr: Les assignations et suppressions d'attributs mettent à jour le dictionnaire de l'instance, jamais le dictionnaire de la classe. Si la classe possède une méthode :meth:`__setattr__` ou :meth:`__delattr__`, elle est appelée au lieu de mettre à jour le dictionnaire de l'instance directement.

source: Class instances can pretend to be numbers, sequences, or mappings if they have methods with certain special names. See section :ref:`specialnames`.
fr: Les instances de classes peuvent prétendre être des nombres, des séquences ou des tableaux de correspondance si elles ont des méthodes avec des noms spéciaux. Voir la section :ref:`specialnames`.

source: Special attributes: :attr:`~object.__dict__` is the attribute dictionary; :attr:`~instance.__class__` is the instance's class.
fr: Attributs spéciaux : :attr:`~object.__dict__` est le dictionnaire des attributs ; :attr:`~instance.__class__` est la classe de l'instance.

source: I/O objects (also known as file objects)
fr: Objets Entrées-Sorties (ou objets fichiers)

source: A :term:`file object` represents an open file. Various shortcuts are available to create file objects: the :func:`open` built-in function, and also :func:`os.popen`, :func:`os.fdopen`, and the :meth:`~socket.socket.makefile` method of socket objects (and perhaps by other functions or methods provided by extension modules).
fr: Un :term:`objet fichier` représente un fichier ouvert. Différents raccourcis existent pour créer des objets fichiers : la fonction native :func:`open` et aussi :func:`os.popen`, :func:`os.fdopen` ou la méthode :meth:`~socket.socket.makefile` des objets connecteurs (et sûrement d'autres fonctions ou méthodes fournies par les modules d'extensions).

source: The objects ``sys.stdin``, ``sys.stdout`` and ``sys.stderr`` are initialized to file objects corresponding to the interpreter's standard input, output and error streams; they are all open in text mode and therefore follow the interface defined by the :class:`io.TextIOBase` abstract class.
fr: Les objets ``sys.stdin``, ``sys.stdout`` et ``sys.stderr`` sont initialisés à des objets fichiers correspondant à l'entrée standard, la sortie standard et le flux d'erreurs de l'interpréteur ; ils sont tous ouverts en mode texte et se conforment donc à l'interface définie par la classe abstraite :class:`io.TextIOBase`.

source: Internal types
fr: Types internes

source: A few types used internally by the interpreter are exposed to the user. Their definitions may change with future versions of the interpreter, but they are mentioned here for completeness.
fr: Quelques types utilisés en interne par l'interpréteur sont accessibles à l'utilisateur. Leur définition peut changer dans les futures versions de l'interpréteur mais ils sont donnés ci-dessous à fin d'exhaustivité.

source: Code objects
fr: Objets Code

source: Code objects represent *byte-compiled* executable Python code, or :term:`bytecode`. The difference between a code object and a function object is that the function object contains an explicit reference to the function's globals (the module in which it was defined), while a code object contains no context; also the default argument values are stored in the function object, not in the code object (because they represent values calculated at run-time). Unlike function objects, code objects are immutable and contain no references (directly or indirectly) to mutable objects.
fr: Un objet code représente le code Python sous sa forme compilée en :term:`bytecode`. La différence entre un objet code et un objet fonction est que l'objet fonction contient une référence explicite vers les globales de la fonction (le module dans lequel elle est définie) alors qu'un objet code ne contient aucun contexte ; par ailleurs, les valeurs par défaut des arguments sont stockées dans l'objet fonction, pas dans l'objet code (parce que ce sont des valeurs calculées au moment de l'exécution). Contrairement aux objets fonctions, les objets codes sont immuables et ne contiennent aucune référence (directe ou indirecte) à des objets muables.

source: Special read-only attributes: :attr:`co_name` gives the function name; :attr:`co_argcount` is the total number of positional arguments (including positional-only arguments and arguments with default values); :attr:`co_posonlyargcount` is the number of positional-only arguments (including arguments with default values); :attr:`co_kwonlyargcount` is the number of keyword-only arguments (including arguments with default values); :attr:`co_nlocals` is the number of local variables used by the function (including arguments); :attr:`co_varnames` is a tuple containing the names of the local variables (starting with the argument names); :attr:`co_cellvars` is a tuple containing the names of local variables that are referenced by nested functions; :attr:`co_freevars` is a tuple containing the names of free variables; :attr:`co_code` is a string representing the sequence of bytecode instructions; :attr:`co_consts` is a tuple containing the literals used by the bytecode; :attr:`co_names` is a tuple containing the names used by the bytecode; :attr:`co_filename` is the filename from which the code was compiled; :attr:`co_firstlineno` is the first line number of the function; :attr:`co_lnotab` is a string encoding the mapping from bytecode offsets to line numbers (for details see the source code of the interpreter); :attr:`co_stacksize` is the required stack size; :attr:`co_flags` is an integer encoding a number of flags for the interpreter.
fr: Attributs spéciaux en lecture seule : :attr:`co_name` donne le nom de la fonction ; :attr:`co_argcount` est le nombre total d'arguments positionnels (y compris les arguments uniquement positionnels et les arguments avec des valeurs par défaut) ; :attr:`co_posonlyargcount` est le nombre d'arguments uniquement positionnels (y compris les arguments avec des valeurs par défaut) ; :attr:`co_kwonlyargcount` est le nombre d'arguments par mots-clés (y compris les arguments avec des valeurs par défaut) ; :attr:`co_nlocals` est le nombre de variables locales utilisées par la fonction (y compris les arguments) ; :attr:`co_varnames` est un *n*-uplet contenant les noms des variables locales (en commençant par les noms des arguments) ; :attr:`co_cellvars` est un *n*-uplet contenant les noms des variables locales qui sont référencées par des fonctions imbriquées ; :attr:`co_freevars` est un *n*-uplet contenant les noms des variables libres ; :attr:`co_code` est une chaîne représentant la séquence des instructions de code intermédiaire ; :attr:`co_consts` est un *n*-uplet contenant les littéraux utilisés par le code intermédiaire ; :attr:`co_names` est un *n*-uplet contenant les noms utilisés par le code intermédiaire ; :attr:`co_filename` est le nom de fichier à partir duquel le code a été compilé ; :attr:`co_firstlineno` est numéro de la première ligne de la fonction ; :attr:`co_lnotab` est une chaîne codant la correspondance entre les décalages du code intermédiaire et les numéros de ligne (pour plus de détails, voir le code source de l'interpréteur) ; :attr:`co_stacksize` est la taille de pile requise ; :attr:`co_flags` est un entier qui code différents drapeaux pour l'interpréteur.

source: The following flag bits are defined for :attr:`co_flags`: bit ``0x04`` is set if the function uses the ``*arguments`` syntax to accept an arbitrary number of positional arguments; bit ``0x08`` is set if the function uses the ``**keywords`` syntax to accept arbitrary keyword arguments; bit ``0x20`` is set if the function is a generator.
fr: Les drapeaux suivants sont codés par des bits dans :attr:`co_flags` : le bit ``0x04`` est positionné à 1 si la fonction utilise la syntaxe ``*arguments`` pour accepter un nombre arbitraire d'arguments positionnels ; le bit ``0x08`` est positionné à 1 si la fonction utilise la syntaxe ``**keywords`` pour accepter un nombre arbitraire d'arguments nommés ; le bit ``0x20`` est positionné à 1 si la fonction est un générateur.

source: Future feature declarations (``from __future__ import division``) also use bits in :attr:`co_flags` to indicate whether a code object was compiled with a particular feature enabled: bit ``0x2000`` is set if the function was compiled with future division enabled; bits ``0x10`` and ``0x1000`` were used in earlier versions of Python.
fr: Les déclarations de fonctionnalité future ``from __future__ import division`` utilisent aussi des bits dans :attr:`co_flags` pour indiquer si l'objet code a été compilé avec une fonctionnalité future : le bit ``0x2000`` est positionné à 1 si la fonction a été compilée avec la division future activée ; les bits ``0x10`` et ``0x1000`` étaient utilisés dans les versions antérieures de Python.

source: Other bits in :attr:`co_flags` are reserved for internal use.
fr: Les autres bits de :attr:`co_flags` sont réservés à un usage interne.

source: If a code object represents a function, the first item in :attr:`co_consts` is the documentation string of the function, or ``None`` if undefined.
fr: Si l'objet code représente une fonction, le premier élément dans :attr:`co_consts` est le texte de documentation de la fonction (ou ``None`` s'il n'y en a pas).

source: Frame objects
fr: Objets cadres

source: Frame objects represent execution frames. They may occur in traceback objects (see below), and are also passed to registered trace functions.
fr: Un objet cadre représente le cadre d'exécution. Il apparait dans des objets traces (voir plus loin) et est passé comme argument aux fonctions de traçage actives.
