Repository: python/python-docs-fr
Catalog: reference/datamodel.po
Languages: fr

source: If a base that appears in class definition is not an instance of :class:`type`, then an ``__mro_entries__`` method is searched on it. If found, it is called with the original bases tuple. This method must return a tuple of classes that will be used instead of this base. The tuple may be empty, in such case the original base is ignored.
fr: Si une classe de base qui apparaît dans la définition d'une classe n'est pas une instance de :class:`type`, alors Python y recherche une méthode ``__mro_entries__``. S'il la trouve, il l'appelle avec le *n*-uplet original des classes de bases. Cette méthode doit renvoyer un *n*-uplet de classes qui est utilisé à la place de la classe de base. Le *n*-uplet peut être vide, dans ce cas la classe de base originale est ignorée.

source: :pep:`560` - Core support for typing module and generic types
fr: :pep:`560` — Gestion de base pour les types modules et les types génériques

source: Determining the appropriate metaclass
fr: Détermination de la méta-classe appropriée

source: The appropriate metaclass for a class definition is determined as follows:
fr: La méta-classe appropriée pour une définition de classe est déterminée de la manière suivante :

source: if no bases and no explicit metaclass are given, then :func:`type` is used;
fr: si aucune classe et aucune métaclasse n'est donnée, alors :func:`type` est utilisée ;

source: if an explicit metaclass is given and it is *not* an instance of :func:`type`, then it is used directly as the metaclass;
fr: si une méta-classe explicite est donnée et que *ce n'est pas* une instance de :func:`type`, alors elle est utilisée directement en tant que méta-classe ;

source: if an instance of :func:`type` is given as the explicit metaclass, or bases are defined, then the most derived metaclass is used.
fr: Si une instance de :func:`type` est donnée comme méta-classe explicite ou si *bases* est définie, alors la méta-classe la plus dérivée est utilisée.

source: The most derived metaclass is selected from the explicitly specified metaclass (if any) and the metaclasses (i.e. ``type(cls)``) of all specified base classes. The most derived metaclass is one which is a subtype of *all* of these candidate metaclasses. If none of the candidate metaclasses meets that criterion, then the class definition will fail with ``TypeError``.
fr: La méta-classe la plus dérivée est choisie à partir des méta-classes explicitement spécifiées (s'il y en a) et les méta-classes (c'est-à-dire les ``type(cls)``) de toutes les classes de base spécifiées. La méta-classe la plus dérivée est celle qui est un sous-type de *toutes* ces méta-classes candidates. Si aucune des méta-classes candidates ne remplit ce critère, alors la définition de la classe échoue en levant ``TypeError``.

source: Preparing the class namespace
fr: Préparation de l'espace de nommage de la classe

source: Once the appropriate metaclass has been identified, then the class namespace is prepared. If the metaclass has a ``__prepare__`` attribute, it is called as ``namespace = metaclass.__prepare__(name, bases, **kwds)`` (where the additional keyword arguments, if any, come from the class definition). The ``__prepare__`` method should be implemented as a :func:`classmethod`. The namespace returned by ``__prepare__`` is passed in to ``__new__``, but when the final class object is created the namespace is copied into a new ``dict``.
fr: Une fois que la méta-classe appropriée est identifiée, l'espace de nommage de la classe est préparé. Si la méta-classe possède un attribut ``__prepare__``, il est appelé avec ``namespace = metaclass.__prepare__(name, bases, **kwds)`` (où les arguments nommés supplémentaires, s'il y en a, sont les arguments de la définition de la classe). La méthode ``__prepare__`` doit être implémentée comme une méthode de classe (:func:`classmethod`). L’espace de nommage renvoyé par ``__prepare__`` est passé à ``__new__``, mais quand l’instance finale est créée, l’espace de nommage est copié vers un nouveau ``dict``.

source: If the metaclass has no ``__prepare__`` attribute, then the class namespace is initialised as an empty ordered mapping.
fr: Si la méta-classe ne possède pas d'attribut ``__prepare__``, alors l'espace de nommage de la classe est initialisé en tant que tableau de correspondances ordonné.

source: :pep:`3115` - Metaclasses in Python 3000
fr: :pep:`3115` — Méta-classes dans Python 3000

source: Introduced the ``__prepare__`` namespace hook
fr: introduction de la fonction automatique ``__prepare__`` de l'espace de nommage

source: Executing the class body
fr: Exécution du corps de la classe

source: The class body is executed (approximately) as ``exec(body, globals(), namespace)``. The key difference from a normal call to :func:`exec` is that lexical scoping allows the class body (including any methods) to reference names from the current and outer scopes when the class definition occurs inside a function.
fr: Le corps de la classe est exécuté (approximativement) avec ``exec(body, globals(), namespace)``. La principale différence avec un appel normal à :func:`exec` est que la portée lexicale autorise le corps de la classe (y compris les méthodes) à faire référence aux noms de la portée courante et des portées externes lorsque la définition de classe a lieu dans une fonction.

source: However, even when the class definition occurs inside the function, methods defined inside the class still cannot see names defined at the class scope. Class variables must be accessed through the first parameter of instance or class methods, or through the implicit lexically scoped ``__class__`` reference described in the next section.
fr: Cependant, même quand une définition de classe intervient dans une fonction, les méthodes définies à l'intérieur de la classe ne peuvent pas voir les noms définis en dehors de la portée de la classe. On accède aux variables de la classe *via* le premier paramètre des méthodes d'instance ou de classe, ou *via* la référence implicite ``__class__`` incluse dans la portée lexicale et décrite dans la section suivante.

source: Creating the class object
fr: Création de l'objet classe

source: Once the class namespace has been populated by executing the class body, the class object is created by calling ``metaclass(name, bases, namespace, **kwds)`` (the additional keywords passed here are the same as those passed to ``__prepare__``).
fr: Quand l'espace de nommage a été rempli en exécutant le corps de la classe, l'objet classe est créé en appelant ``metaclass(name, bases, namespace, **kwds)`` (les arguments nommés supplémentaires passés ici sont les mêmes que ceux passés à ``__prepare__``).

source: This class object is the one that will be referenced by the zero-argument form of :func:`super`. ``__class__`` is an implicit closure reference created by the compiler if any methods in a class body refer to either ``__class__`` or ``super``. This allows the zero argument form of :func:`super` to correctly identify the class being defined based on lexical scoping, while the class or instance that was used to make the current call is identified based on the first argument passed to the method.
fr: Cet objet classe est celui qui est référencé par la forme sans argument de :func:`super`. ``__class__`` est une référence implicite créée par le compilateur si une méthode du corps de la classe fait référence soit à ``__class__``, soit à ``super``. Ceci permet que la forme sans argument de :func:`super` identifie la classe en cours de définition en fonction de la portée lexicale, tandis que la classe ou l'instance utilisée pour effectuer l'appel en cours est identifiée en fonction du premier argument transmis à la méthode.

source: In CPython 3.6 and later, the ``__class__`` cell is passed to the metaclass as a ``__classcell__`` entry in the class namespace. If present, this must be propagated up to the ``type.__new__`` call in order for the class to be initialised correctly. Failing to do so will result in a :exc:`RuntimeError` in Python 3.8.
fr: Dans CPython 3.6 et suivants, la cellule ``__class__`` est passée à la méta-classe en tant qu'entrée ``__classcell__`` dans l'espace de nommage de la classe. Si elle est présente, elle doit être propagée à l'appel ``type .__ new__`` pour que la classe soit correctement initialisée. Ne pas le faire se traduit par un :exc:`RuntimeError` dans Python 3.8.

source: When using the default metaclass :class:`type`, or any metaclass that ultimately calls ``type.__new__``, the following additional customisation steps are invoked after creating the class object:
fr: Quand vous utilisez la méta-classe par défaut :class:`type` ou toute autre méta-classe qui finit par appeler ``type.__new__``, les étapes de personnalisation supplémentaires suivantes sont suivies après la création de l'objet classe :

source: first, ``type.__new__`` collects all of the descriptors in the class namespace that define a :meth:`~object.__set_name__` method;
fr: d'abord, ``type.__new__`` récupère, dans l'espace de nommage de la classe, tous les descripteurs qui définissent une méthode :meth:`~object.__set_name__` ;

source: second, all of these ``__set_name__`` methods are called with the class being defined and the assigned name of that particular descriptor;
fr: ensuite, toutes ces méthodes ``__set_name__`` sont appelées avec la classe en cours de définition et le nom assigné à chaque descripteur ;

source: finally, the :meth:`~object.__init_subclass__` hook is called on the immediate parent of the new class in its method resolution order.
fr: finalement, la méthode automatique :meth:`~object.__init_subclass__` est appelée sur le parent immédiat de la nouvelle classe en utilisant l'ordre de résolution des méthodes.

source: After the class object is created, it is passed to the class decorators included in the class definition (if any) and the resulting object is bound in the local namespace as the defined class.
fr: Après la création de l'objet classe, il est passé aux décorateurs de la classe, y compris ceux inclus dans la définition de la classe (s'il y en a) et l'objet résultant est lié à l'espace de nommage local en tant que classe définie.

source: When a new class is created by ``type.__new__``, the object provided as the namespace parameter is copied to a new ordered mapping and the original object is discarded. The new copy is wrapped in a read-only proxy, which becomes the :attr:`~object.__dict__` attribute of the class object.
fr: Quand une nouvelle classe est créée *via* ``type.__new__``, l'objet fourni en tant que paramètre d'espace de nommage est copié vers un nouveau tableau de correspondances ordonné et l'objet original est laissé de côté. La nouvelle copie est encapsulée dans un mandataire en lecture seule qui devient l'attribut :attr:`~object.__dict__` de l'objet classe.

source: :pep:`3135` - New super
fr: :pep:`3135` — Nouvelle méthode super

source: Describes the implicit ``__class__`` closure reference
fr: Décrit la référence à la fermeture (*closure* en anglais) de la ``__class__`` implicite

source: Uses for metaclasses
fr: Cas d'utilisations des métaclasses

source: The potential uses for metaclasses are boundless. Some ideas that have been explored include enum, logging, interface checking, automatic delegation, automatic property creation, proxies, frameworks, and automatic resource locking/synchronization.
fr: Les utilisations possibles des méta-classes sont immenses. Quelques pistes ont déjà été explorées comme l'énumération, la gestion des traces, le contrôle des interfaces, la délégation automatique, la création automatique de propriétés, les mandataires, les *frameworks* ainsi que le verrouillage ou la synchronisation automatique de ressources.

source: Customizing instance and subclass checks
fr: Personnalisation des instances et vérification des sous-classes

source: The following methods are used to override the default behavior of the :func:`isinstance` and :func:`issubclass` built-in functions.
fr: Les méthodes suivantes sont utilisées pour surcharger le comportement par défaut des fonctions natives :func:`isinstance` et :func:`issubclass`.

source: In particular, the metaclass :class:`abc.ABCMeta` implements these methods in order to allow the addition of Abstract Base Classes (ABCs) as "virtual base classes" to any class or type (including built-in types), including other ABCs.
fr: En particulier, la méta-classe :class:`abc.ABCMeta` implémente ces méthodes pour autoriser l'ajout de classes de base abstraites (ABC pour *Abstract Base Classes* en anglais) en tant que « classes de base virtuelles » pour toute classe ou type (y compris les types natifs).

source: Return true if *instance* should be considered a (direct or indirect) instance of *class*. If defined, called to implement ``isinstance(instance, class)``.
fr: Renvoie ``True`` si *instance* doit être considérée comme une instance (directe ou indirecte) de *class*. Si elle est définie, elle est appelée pour implémenter ``isinstance(instance, class)``.

source: Return true if *subclass* should be considered a (direct or indirect) subclass of *class*. If defined, called to implement ``issubclass(subclass, class)``.
fr: Renvoie ``True`` si *subclass* doit être considérée comme une sous-classe (directe ou indirecte) de *class*. Si elle est définie, appelée pour implémenter ``issubclass(subclass, class)``.

source: Note that these methods are looked up on the type (metaclass) of a class. They cannot be defined as class methods in the actual class. This is consistent with the lookup of special methods that are called on instances, only in this case the instance is itself a class.
fr: Notez que ces méthodes sont recherchées dans le type (la méta-classe) d'une classe. Elles ne peuvent pas être définies en tant que méthodes de classe dans la classe réelle. C'est cohérent avec la recherche des méthodes spéciales qui sont appelées pour les instances, sauf qu'ici l'instance est elle-même une classe.

source: :pep:`3119` - Introducing Abstract Base Classes
fr: :pep:`3119` — Introduction aux classes de bases abstraites

source: Includes the specification for customizing :func:`isinstance` and :func:`issubclass` behavior through :meth:`~class.__instancecheck__` and :meth:`~class.__subclasscheck__`, with motivation for this functionality in the context of adding Abstract Base Classes (see the :mod:`abc` module) to the language.
fr: Inclut la spécification pour la personnalisation du comportement de :func:`isinstance` et :func:`issubclass` à travers :meth:`~class.__instancecheck__` et :meth:`~class.__subclasscheck__`, avec comme motivation pour cette fonctionnalité l'ajout les classes de base abstraites (voir le module :mod:`abc`) au langage.

source: Emulating generic types
fr: Émulation de types génériques

source: One can implement the generic class syntax as specified by :pep:`484` (for example ``List[int]``) by defining a special method:
fr: Vous pouvez implémenter la syntaxe générique des classes comme spécifié par la :pep:`484` (par exemple ``List[int]``) en définissant une méthode spéciale :

source: Return an object representing the specialization of a generic class by type arguments found in *key*.
fr: Renvoie un objet représentant la spécialisation d'une classe générique en fonction des arguments types trouvés dans *key*.

source: This method is looked up on the class object itself, and when defined in the class body, this method is implicitly a class method. Note, this mechanism is primarily reserved for use with static type hints, other usage is discouraged.
fr: Python recherche cette méthode dans l'objet de classe lui-même et, lorsqu'elle est définie dans le corps de la classe, cette méthode est implicitement une méthode de classe. Notez que ce mécanisme est principalement réservé à une utilisation avec des indications de type statiques, d'autres utilisations sont déconseillées.

source: Emulating callable objects
fr: Émulation d'objets appelables

source: Emulating container types
fr: Émulation de types conteneurs

source: The following methods can be defined to implement container objects. Containers usually are sequences (such as lists or tuples) or mappings (like dictionaries), but can represent other containers as well. The first set of methods is used either to emulate a sequence or to emulate a mapping; the difference is that for a sequence, the allowable keys should be the integers *k* for which ``0 <= k < N`` where *N* is the length of the sequence, or slice objects, which define a range of items. It is also recommended that mappings provide the methods :meth:`keys`, :meth:`values`, :meth:`items`, :meth:`get`, :meth:`clear`, :meth:`setdefault`, :meth:`pop`, :meth:`popitem`, :meth:`!copy`, and :meth:`update` behaving similar to those for Python's standard dictionary objects. The :mod:`collections.abc` module provides a :class:`~collections.abc.MutableMapping` abstract base class to help create those methods from a base set of :meth:`__getitem__`, :meth:`__setitem__`, :meth:`__delitem__`, and :meth:`keys`. Mutable sequences should provide methods :meth:`append`, :meth:`count`, :meth:`index`, :meth:`extend`, :meth:`insert`, :meth:`pop`, :meth:`remove`, :meth:`reverse` and :meth:`sort`, like Python standard list objects. Finally, sequence types should implement addition (meaning concatenation) and multiplication (meaning repetition) by defining the methods :meth:`__add__`, :meth:`__radd__`, :meth:`__iadd__`, :meth:`__mul__`, :meth:`__rmul__` and :meth:`__imul__` described below; they should not define other numerical operators. It is recommended that both mappings and sequences implement the :meth:`__contains__` method to allow efficient use of the ``in`` operator; for mappings, ``in`` should search the mapping's keys; for sequences, it should search through the values. It is further recommended that both mappings and sequences implement the :meth:`__iter__` method to allow efficient iteration through the container; for mappings, :meth:`__iter__` should iterate through the object's keys; for sequences, it should iterate through the values.
fr: Les fonctions suivantes peuvent être définies pour implémenter des objets conteneurs. Les conteneurs sont habituellement des séquences (telles que les *n*-uplets ou les listes) ou des tableaux de correspondances (comme les dictionnaires), mais ils peuvent aussi représenter d'autres conteneurs. Le premier ensemble de méthodes est utilisé soit pour émuler une séquence, soit pour émuler un tableau de correspondances ; la différence est que, pour une séquence, les clés doivent être soit des entiers *k* tels que ``0 <= k < N`` où *N* est la longueur de la séquence, soit des objets tranches qui définissent un intervalle d'éléments. Il est aussi recommandé que les tableaux de correspondances fournissent les méthodes :meth:`keys`, :meth:`values`, :meth:`items`, :meth:`get`, :meth:`clear`, :meth:`setdefault`, :meth:`pop`, :meth:`popitem`, :meth:`!copy` et :meth:`update` avec un comportement similaire aux objets dictionnaires standards de Python. Le module :mod:`collections.abc` fournit une classe de base abstraite :class:`~collections.abc.MutableMapping` pour aider à la création de ces méthodes à partir d'un ensemble de base composé de :meth:`__getitem__`, :meth:`__setitem__`, :meth:`__delitem__` et :meth:`keys`. Les séquences muables doivent fournir les méthodes :meth:`append`, :meth:`count`, :meth:`index`, :meth:`extend`, :meth:`insert`, :meth:`pop`, :meth:`remove`, :meth:`reverse` et :meth:`sort`, comme les objets listes standards de Python. Enfin, les types séquences doivent implémenter l'addition (dans le sens de la concaténation) et la multiplication (dans le sens de la répétition) en définissant les méthodes :meth:`__add__`, :meth:`__radd__`, :meth:`__iadd__`, :meth:`__mul__`, :meth:`__rmul__` et :meth:`__imul__` décrites ci-dessous ; ils ne doivent pas définir d'autres opérateurs numériques. Il est recommandé que les tableaux de correspondances et les séquences implémentent la méthode :meth:`__contains__` pour permettre l'utilisation efficace de l'opérateur ``in`` ; concernant les tableaux de correspondances, ``in`` doit rechercher dans les clés du tableau ; pour les séquences, il doit chercher dans les valeurs. Il est de plus recommandé que les tableaux de correspondances et les séquences implémentent la méthode :meth:`__iter__` pour permettre une itération efficace dans le conteneur ; pour les tableaux de correspondances, :meth:`__iter__` doit itérer sur les clés de l'objet ; pour les séquences, elle doit itérer sur les valeurs.

source: Called to implement the built-in function :func:`len`. Should return the length of the object, an integer ``>=`` 0. Also, an object that doesn't define a :meth:`__bool__` method and whose :meth:`__len__` method returns zero is considered to be false in a Boolean context.
fr: Appelée pour implémenter la fonction native :func:`len`. Elle doit renvoyer la longueur de l'objet, un entier ``>=`` 0. Par ailleurs, un objet qui ne définit pas de méthode :meth:`__bool__` et dont la méthode :meth:`__len__` renvoie zéro est considéré comme valant ``False`` dans un contexte booléen.

source: In CPython, the length is required to be at most :attr:`sys.maxsize`. If the length is larger than :attr:`!sys.maxsize` some features (such as :func:`len`) may raise :exc:`OverflowError`. To prevent raising :exc:`!OverflowError` by truth value testing, an object must define a :meth:`__bool__` method.
fr: En CPython, la longueur doit valoir au maximum :attr:`sys.maxsize`. Si la longueur est plus grande que :attr:`!sys.maxsize`, des propriétés (telles que :func:`len`) peuvent lever :exc:`OverflowError`. Afin d'éviter de lever :exc:`!OverflowError` lors de tests booléens, un objet doit définir la méthode :meth:`__bool__`.

source: Called to implement :func:`operator.length_hint`. Should return an estimated length for the object (which may be greater or less than the actual length). The length must be an integer ``>=`` 0. The return value may also be :const:`NotImplemented`, which is treated the same as if the ``__length_hint__`` method didn't exist at all. This method is purely an optimization and is never required for correctness.
fr: Appelée pour implémenter :func:`operator.length_hint`. Elle doit renvoyer une longueur estimée de l'objet (qui peut être plus grande ou plus petite que la longueur réelle). La longueur doit être un entier ``>=`` 0. La valeur de retour peut aussi être :const:`NotImplemented`, qui est traitée de la même façon que si la méthode ``__length_hint__`` n'existait pas. Cette méthode est utilisée uniquement pour optimiser les traitements et n'est jamais tenue de renvoyer un résultat exact.

source: Slicing is done exclusively with the following three methods. A call like ::
fr: Le découpage est effectué uniquement à l'aide des trois méthodes suivantes. Un appel comme ::

source: is translated to ::
fr: est traduit en ::

source: and so forth. Missing slice items are always filled in with ``None``.
fr: et ainsi de suite. Les éléments manquants sont remplacés par ``None``.
