Repository: python/python-docs-fr
Catalog: reference/datamodel.po
Languages: fr

source: Starts or resumes execution of the coroutine. If *value* is ``None``, this is equivalent to advancing the iterator returned by :meth:`__await__`. If *value* is not ``None``, this method delegates to the :meth:`~generator.send` method of the iterator that caused the coroutine to suspend. The result (return value, :exc:`StopIteration`, or other exception) is the same as when iterating over the :meth:`__await__` return value, described above.
fr: Démarre ou reprend l'exécution d'une coroutine. Si *value* est ``None``, c'est équivalent à avancer l'itérateur renvoyé par :meth:`__await__`. Si *value* ne vaut pas ``None``, cette méthode appelle la méthode :meth:`~generator.send` de l'itérateur qui a causé la suspension de la coroutine. Le résultat (valeur de retour, :exc:`StopIteration` ou une autre exception) est le même que lorsque vous itérez sur la valeur de retour de :meth:`__await__`, décrite ci-dessus.

source: Raises the specified exception in the coroutine. This method delegates to the :meth:`~generator.throw` method of the iterator that caused the coroutine to suspend, if it has such a method. Otherwise, the exception is raised at the suspension point. The result (return value, :exc:`StopIteration`, or other exception) is the same as when iterating over the :meth:`__await__` return value, described above. If the exception is not caught in the coroutine, it propagates back to the caller.
fr: Lève l'exception spécifiée dans la coroutine. Cette méthode délègue à la méthode :meth:`~generator.throw` de l'itérateur qui a causé la suspension de la coroutine, s'il possède une telle méthode. Sinon, l'exception est levée au point de suspension. Le résultat (valeur de retour, :exc:`StopIteration` ou une autre exception) est le même que lorsque vous itérez sur la valeur de retour de :meth:`__await__`, décrite ci-dessus. Si l'exception n'est pas gérée par la coroutine, elle est propagée à l'appelant.

source: Causes the coroutine to clean itself up and exit. If the coroutine is suspended, this method first delegates to the :meth:`~generator.close` method of the iterator that caused the coroutine to suspend, if it has such a method. Then it raises :exc:`GeneratorExit` at the suspension point, causing the coroutine to immediately clean itself up. Finally, the coroutine is marked as having finished executing, even if it was never started.
fr: Demande à la coroutine de faire le ménage et de se terminer. Si la coroutine est suspendue, cette méthode délègue d'abord à la méthode :meth:`~generator.close` de l'itérateur qui a causé la suspension de la coroutine, s'il possède une telle méthode. Ensuite, elle lève :exc:`GeneratorExit` au point de suspension, ce qui fait le ménage dans la coroutine immédiatement. Enfin, la coroutine est marquée comme ayant terminé son exécution, même si elle n'a jamais démarré.

source: Coroutine objects are automatically closed using the above process when they are about to be destroyed.
fr: Les objets coroutines sont automatiquement fermés en utilisant le processus décrit au-dessus au moment où ils sont détruits.

source: Asynchronous Iterators
fr: Itérateurs asynchrones

source: An *asynchronous iterator* can call asynchronous code in its ``__anext__`` method.
fr: Un *itérateur asynchrone* peut appeler du code asynchrone dans sa méthode ``__anext__``.

source: Asynchronous iterators can be used in an :keyword:`async for` statement.
fr: Les itérateurs asynchrones peuvent être utilisés dans des instructions :keyword:`async for`.

source: Must return an *asynchronous iterator* object.
fr: Doit renvoyer un objet *itérateur asynchrone*.

source: Must return an *awaitable* resulting in a next value of the iterator. Should raise a :exc:`StopAsyncIteration` error when the iteration is over.
fr: Doit renvoyer un *attendable* (*awaitable*) qui se traduit par la valeur suivante de l'itérateur. Doit lever une :exc:`StopAsyncIteration` quand l'itération est terminée.

source: An example of an asynchronous iterable object::
fr: Un exemple d'objet itérateur asynchrone ::

source: Prior to Python 3.7, ``__aiter__`` could return an *awaitable* that would resolve to an :term:`asynchronous iterator <asynchronous iterator>`.
fr: Avant Python 3.7, ``__aiter__`` pouvait renvoyer un *attendable* (*awaitable*) qui se résolvait potentiellement en un :term:`itérateur asynchrone <asynchronous iterator>`.

source: Starting with Python 3.7, ``__aiter__`` must return an asynchronous iterator object. Returning anything else will result in a :exc:`TypeError` error.
fr: À partir de Python 3.7, ``__aiter__`` doit renvoyer un objet itérateur asynchrone. Renvoyer autre chose entraine une erreur :exc:`TypeError`.

source: Asynchronous Context Managers
fr: Gestionnaires de contexte asynchrones

source: An *asynchronous context manager* is a *context manager* that is able to suspend execution in its ``__aenter__`` and ``__aexit__`` methods.
fr: Un *gestionnaire de contexte asynchrone* est un *gestionnaire de contexte* qui est capable de suspendre son exécution dans ses méthodes ``__aenter__`` et ``__aexit__``.

source: Asynchronous context managers can be used in an :keyword:`async with` statement.
fr: Les gestionnaires de contexte asynchrones peuvent être utilisés dans des instructions :keyword:`async with`.

source: Semantically similar to :meth:`__enter__`, the only difference being that it must return an *awaitable*.
fr: Sémantiquement équivalente à :meth:`__enter__`, à la seule différence près qu'elle doit renvoyer un *attendable* (*awaitable*).

source: Semantically similar to :meth:`__exit__`, the only difference being that it must return an *awaitable*.
fr: Sémantiquement équivalente à :meth:`__exit__`, à la seule différence près qu'elle doit renvoyer un *attendable* (*awaitable*).

source: An example of an asynchronous context manager class::
fr: Un exemple de classe de gestionnaire de contexte asynchrone ::

source: Footnotes
fr: Notes de bas de page

source: It *is* possible in some cases to change an object's type, under certain controlled conditions. It generally isn't a good idea though, since it can lead to some very strange behaviour if it is handled incorrectly.
fr: Il *est* possible, dans certains cas, de changer le type d'un objet, sous certaines conditions. Cependant, ce n'est généralement pas une bonne idée car cela peut conduire à un comportement très étrange si ce n'est pas géré correctement.

source: The :meth:`__hash__`, :meth:`__iter__`, :meth:`__reversed__`, and :meth:`__contains__` methods have special handling for this; others will still raise a :exc:`TypeError`, but may do so by relying on the behavior that ``None`` is not callable.
fr: Les méthodes :meth:`__hash__`, :meth:`__iter__`, :meth:`__reversed__` et :meth:`__contains__` ont une gestion particulière pour cela ; les autres lèvent toujours :exc:`TypeError`, mais le font en considérant que ``None`` n'est pas un appelable.

source: "Does not support" here means that the class has no such method, or the method returns ``NotImplemented``. Do not set the method to ``None`` if you want to force fallback to the right operand's reflected method—that will instead have the opposite effect of explicitly *blocking* such fallback.
fr: *n'autorise pas* signifie ici que la classe ne possède pas de méthode adéquate ou que la méthode renvoie ``NotImplemented``. N'assignez pas ``None`` à la méthode si vous voulez un repli vers la méthode symétrique de l'opérande de droite — cela aurait pour effet de *bloquer* un tel repli.
