Repository: python/python-docs-fr
Catalog: reference/datamodel.po
Languages: fr

source: Called to implement evaluation of ``self[key]``. For sequence types, the accepted keys should be integers and slice objects. Note that the special interpretation of negative indexes (if the class wishes to emulate a sequence type) is up to the :meth:`__getitem__` method. If *key* is of an inappropriate type, :exc:`TypeError` may be raised; if of a value outside the set of indexes for the sequence (after any special interpretation of negative values), :exc:`IndexError` should be raised. For mapping types, if *key* is missing (not in the container), :exc:`KeyError` should be raised.
fr: Appelée pour implémenter l'évaluation de ``self[key]``. Pour les types séquences, les clés autorisées sont les entiers et les objets tranches (*slice*). Notez que l'interprétation spéciale des indices négatifs (si la classe souhaite émuler un type séquence) est du ressort de la méthode :meth:`__getitem__`. Si *key* n'est pas du bon type, une :exc:`TypeError` peut être levée ; si la valeur est en dehors de l'ensemble des indices de la séquence (après interprétation éventuelle des valeurs négatives), une :exc:`IndexError` doit être levée. Pour les tableaux de correspondances, si *key* n'existe pas dans le conteneur, une :exc:`KeyError` doit être levée.

source: :keyword:`for` loops expect that an :exc:`IndexError` will be raised for illegal indexes to allow proper detection of the end of the sequence.
fr: :keyword:`for` s'attend à ce qu'une :exc:`IndexError` soit levée en cas d'indice illégal afin de détecter correctement la fin de la séquence.

source: Called to implement assignment to ``self[key]``. Same note as for :meth:`__getitem__`. This should only be implemented for mappings if the objects support changes to the values for keys, or if new keys can be added, or for sequences if elements can be replaced. The same exceptions should be raised for improper *key* values as for the :meth:`__getitem__` method.
fr: Appelée pour implémenter l'assignation à ``self[key]``. La même note que pour :meth:`__getitem__` s'applique. Elle ne doit être implémentée que pour les tableaux de correspondances qui autorisent les modifications de valeurs des clés, ceux pour lesquels on peut ajouter de nouvelles clés ou, pour les séquences, celles dont les éléments peuvent être remplacés. Les mêmes exceptions que pour la méthode :meth:`__getitem__` doivent être levées en cas de mauvaises valeurs de clés.

source: Called to implement deletion of ``self[key]``. Same note as for :meth:`__getitem__`. This should only be implemented for mappings if the objects support removal of keys, or for sequences if elements can be removed from the sequence. The same exceptions should be raised for improper *key* values as for the :meth:`__getitem__` method.
fr: Appelée pour implémenter la suppression de ``self[key]``. La même note que pour :meth:`__getitem__` s'applique. Elle ne doit être implémentée que pour les tableaux de correspondances qui autorisent les suppressions de clés ou pour les séquences dont les éléments peuvent être supprimés de la séquence. Les mêmes exceptions que pour la méthode :meth:`__getitem__` doivent être levées en cas de mauvaises valeurs de clés.

source: Called by :class:`dict`\ .\ :meth:`__getitem__` to implement ``self[key]`` for dict subclasses when key is not in the dictionary.
fr: Appelée par :class:`dict`\ .\ :meth:`__getitem__` pour implémenter ``self[key]`` dans les sous-classes de dictionnaires lorsque la clé n'est pas dans le dictionnaire.

source: This method is called when an iterator is required for a container. This method should return a new iterator object that can iterate over all the objects in the container. For mappings, it should iterate over the keys of the container.
fr: Cette méthode est appelée quand un itérateur est requis pour un conteneur. Cette méthode doit renvoyer un nouvel objet itérateur qui peut itérer sur tous les objets du conteneur. Pour les tableaux de correspondances, elle doit itérer sur les clés du conteneur.

source: Iterator objects also need to implement this method; they are required to return themselves. For more information on iterator objects, see :ref:`typeiter`.
fr: Les objets itérateurs doivent aussi implémenter cette méthode ; ils doivent alors se renvoyer eux-mêmes. Pour plus d'information sur les objets itérateurs, lisez :ref:`typeiter`.

source: Called (if present) by the :func:`reversed` built-in to implement reverse iteration. It should return a new iterator object that iterates over all the objects in the container in reverse order.
fr: Appelée (si elle existe) par la fonction native :func:`reversed` pour implémenter l'itération en sens inverse. Elle doit renvoyer un nouvel objet itérateur qui itère sur tous les objets du conteneur en sens inverse.

source: If the :meth:`__reversed__` method is not provided, the :func:`reversed` built-in will fall back to using the sequence protocol (:meth:`__len__` and :meth:`__getitem__`). Objects that support the sequence protocol should only provide :meth:`__reversed__` if they can provide an implementation that is more efficient than the one provided by :func:`reversed`.
fr: Si la méthode :meth:`__reversed__` n'est pas fournie, la fonction native :func:`reversed` se replie sur le protocole de séquence (:meth:`__len__` et :meth:`__getitem__`). Les objets qui connaissent le protocole de séquence ne doivent fournir :meth:`__reversed__` que si l'implémentation qu'ils proposent est plus efficace que celle de :func:`reversed`.

source: The membership test operators (:keyword:`in` and :keyword:`not in`) are normally implemented as an iteration through a container. However, container objects can supply the following special method with a more efficient implementation, which also does not require the object be iterable.
fr: Les opérateurs de tests d'appartenance (:keyword:`in` et :keyword:`not in`) sont normalement implémentés comme des itérations sur un conteneur. Cependant, les objets conteneurs peuvent fournir les méthodes spéciales suivantes avec une implémentation plus efficace, qui ne requièrent d'ailleurs pas que l'objet soit itérable.

source: Called to implement membership test operators. Should return true if *item* is in *self*, false otherwise. For mapping objects, this should consider the keys of the mapping rather than the values or the key-item pairs.
fr: Appelée pour implémenter les opérateurs de test d'appartenance. Elle doit renvoyer ``True`` si *item* est dans *self* et ``False`` sinon. Pour les tableaux de correspondances, seules les clés sont considérées (pas les valeurs des paires clés-valeurs).

source: For objects that don't define :meth:`__contains__`, the membership test first tries iteration via :meth:`__iter__`, then the old sequence iteration protocol via :meth:`__getitem__`, see :ref:`this section in the language reference <membership-test-details>`.
fr: Pour les objets qui ne définissent pas :meth:`__contains__`, les tests d'appartenance essaient d'abord d'itérer avec :meth:`__iter__` puis avec le vieux protocole d'itération sur les séquences *via* :meth:`__getitem__`, reportez-vous à :ref:`cette section dans la référence du langage <membership-test-details>`.

source: Emulating numeric types
fr: Émulation de types numériques

source: The following methods can be defined to emulate numeric objects. Methods corresponding to operations that are not supported by the particular kind of number implemented (e.g., bitwise operations for non-integral numbers) should be left undefined.
fr: Les méthodes suivantes peuvent être définies pour émuler des objets numériques. Les méthodes correspondant à des opérations qui ne sont pas autorisées pour la catégorie de nombres considérée (par exemple, les opérations bit à bit pour les nombres qui ne sont pas entiers) doivent être laissées indéfinies.

source: These methods are called to implement the binary arithmetic operations (``+``, ``-``, ``*``, ``@``, ``/``, ``//``, ``%``, :func:`divmod`, :func:`pow`, ``**``, ``<<``, ``>>``, ``&``, ``^``, ``|``). For instance, to evaluate the expression ``x + y``, where *x* is an instance of a class that has an :meth:`__add__` method, ``x.__add__(y)`` is called. The :meth:`__divmod__` method should be the equivalent to using :meth:`__floordiv__` and :meth:`__mod__`; it should not be related to :meth:`__truediv__`. Note that :meth:`__pow__` should be defined to accept an optional third argument if the ternary version of the built-in :func:`pow` function is to be supported.
fr: Ces méthodes sont appelées pour implémenter les opérations arithmétiques binaires (``+``, ``-``, ``*``, ``@``, ``/``, ``//``, ``%``, :func:`divmod`, :func:`pow`, ``**``, ``<<``, ``>>``, ``&``, ``^``, ``|``). Par exemple, pour évaluer l'expression ``x + y``, où *x* est une instance d'une classe qui possède une méthode :meth:`__add__`, ``x.__add__(y)`` est appelée. La méthode :meth:`__divmod__` doit être l'équivalent d'appeler :meth:`__floordiv__` et :meth:`__mod__` ; elle ne doit pas être reliée à :meth:`__truediv__`. Notez que :meth:`__pow__` doit être définie de manière à accepter un troisième argument optionnel si la version ternaire de la fonction native :func:`pow` est autorisée.

source: If one of those methods does not support the operation with the supplied arguments, it should return ``NotImplemented``.
fr: Si l'une de ces méthodes n'autorise pas l'opération avec les arguments donnés, elle doit renvoyer ``NotImplemented``.

source: These methods are called to implement the binary arithmetic operations (``+``, ``-``, ``*``, ``@``, ``/``, ``//``, ``%``, :func:`divmod`, :func:`pow`, ``**``, ``<<``, ``>>``, ``&``, ``^``, ``|``) with reflected (swapped) operands. These functions are only called if the left operand does not support the corresponding operation [#]_ and the operands are of different types. [#]_ For instance, to evaluate the expression ``x - y``, where *y* is an instance of a class that has an :meth:`__rsub__` method, ``y.__rsub__(x)`` is called if ``x.__sub__(y)`` returns *NotImplemented*.
fr: Ces méthodes sont appelées pour implémenter les opérations arithmétiques binaires (``+``, ``-``, ``*``, ``@``, ``/``, ``//``, ``%``, :func:`divmod`, :func:`pow`, ``**``, ``<<``, ``>>``, ``&``, ``^``, ``|``) avec des opérandes renversés (intervertis). Ces fonctions ne sont appelées que si l'opérande de gauche n'autorise pas l'opération correspondante [#]_ et si les opérandes sont de types différents [#]_. Par exemple, pour évaluer l'expression ``x - y``, où *y* est une instance d'une classe qui possède une méthode :meth:`__rsub__`, ``y.__rsub__(x)`` est appelée si ``x.__sub__(y)`` renvoie *NotImplemented*.

source: Note that ternary :func:`pow` will not try calling :meth:`__rpow__` (the coercion rules would become too complicated).
fr: Notez que la fonction ternaire :func:`pow` n'essaie pas d'appeler :meth:`__rpow__` (les règles de coercition seraient trop compliquées).

source: These methods are called to implement the augmented arithmetic assignments (``+=``, ``-=``, ``*=``, ``@=``, ``/=``, ``//=``, ``%=``, ``**=``, ``<<=``, ``>>=``, ``&=``, ``^=``, ``|=``). These methods should attempt to do the operation in-place (modifying *self*) and return the result (which could be, but does not have to be, *self*). If a specific method is not defined, the augmented assignment falls back to the normal methods. For instance, if *x* is an instance of a class with an :meth:`__iadd__` method, ``x += y`` is equivalent to ``x = x.__iadd__(y)`` . Otherwise, ``x.__add__(y)`` and ``y.__radd__(x)`` are considered, as with the evaluation of ``x + y``. In certain situations, augmented assignment can result in unexpected errors (see :ref:`faq-augmented-assignment-tuple-error`), but this behavior is in fact part of the data model.
fr: Ces méthodes sont appelées pour implémenter les assignations arithmétiques augmentées (``+=``, ``-=``, ``*=``, ``@=``, ``/=``, ``//=``, ``%=``, ``**=``, ``<<=``, ``>>=``, ``&=``, ``^=``, ``|=``). Ces méthodes doivent essayer d'effectuer l'opération « sur place » (c'est-à-dire de modifier *self*) et de renvoyer le résultat (qui peut être, mais pas nécessairement, *self*). Si une méthode spécifique n'est pas définie, l'assignation augmentée se replie vers la méthode normale correspondante. Par exemple, si *x* est une instance d'une classe qui possède une méthode :meth:`__iadd__`, ``x += y`` est équivalent à ``x = x.__iadd__(y)`` . Sinon, ``x.__add__(y)`` et ``y.__radd__(x)`` sont essayées, comme pour l'évaluation de ``x + y``. Dans certaines situations, les assignations augmentées peuvent causer des erreurs inattendues (voir :ref:`faq-augmented-assignment-tuple-error`), mais ce comportement est en fait partie intégrante du modèle de données.

source: Called to implement the unary arithmetic operations (``-``, ``+``, :func:`abs` and ``~``).
fr: Appelée pour implémenter les opérations arithmétiques unaires (``-``, ``+``, :func:`abs` et ``~``).

source: Called to implement the built-in functions :func:`complex`, :func:`int` and :func:`float`. Should return a value of the appropriate type.
fr: Appelées pour implémenter les fonctions natives :func:`complex`, :func:`int` et :func:`float`. Elles doivent renvoyer une valeur du type approprié.

source: Called to implement :func:`operator.index`, and whenever Python needs to losslessly convert the numeric object to an integer object (such as in slicing, or in the built-in :func:`bin`, :func:`hex` and :func:`oct` functions). Presence of this method indicates that the numeric object is an integer type. Must return an integer.
fr: Appelée pour implémenter :func:`operator.index` et lorsque Python a besoin de convertir sans perte un objet numérique en objet entier (pour un découpage ou dans les fonctions natives :func:`bin`, :func:`hex` et :func:`oct`). La présence de cette méthode indique que l'objet numérique est un type entier. Elle doit renvoyer un entier.

source: If :meth:`__int__`, :meth:`__float__` and :meth:`__complex__` are not defined then corresponding built-in functions :func:`int`, :func:`float` and :func:`complex` fall back to :meth:`__index__`.
fr: Si :meth:`__int__`, :meth:`__float__` et :meth:`__complex__` ne sont pas définies, alors les fonctions natives :func:`int`, :func:`float` et :func:`complex` redirigent par défaut vers :meth:`__index__`.

source: Called to implement the built-in function :func:`round` and :mod:`math` functions :func:`~math.trunc`, :func:`~math.floor` and :func:`~math.ceil`. Unless *ndigits* is passed to :meth:`!__round__` all these methods should return the value of the object truncated to an :class:`~numbers.Integral` (typically an :class:`int`).
fr: Appelée pour implémenter la fonction native :func:`round` et les fonctions du module :mod:`math` :func:`~math.trunc`, :func:`~math.floor` et :func:`~math.ceil`. À moins que *ndigits* ne soit passé à :meth:`!__round__`, toutes ces méthodes doivent renvoyer la valeur de l'objet tronquée pour donner un :class:`~numbers.Integral` (typiquement un :class:`int`).

source: If :meth:`__int__` is not defined then the built-in function :func:`int` falls back to :meth:`__trunc__`.
fr: Si :meth:`__int__` n'est pas définie, alors la fonction native :func:`int` se replie sur :meth:`__trunc__`.

source: With Statement Context Managers
fr: Gestionnaire de contexte With

source: A :dfn:`context manager` is an object that defines the runtime context to be established when executing a :keyword:`with` statement. The context manager handles the entry into, and the exit from, the desired runtime context for the execution of the block of code. Context managers are normally invoked using the :keyword:`!with` statement (described in section :ref:`with`), but can also be used by directly invoking their methods.
fr: Un :dfn:`gestionnaire de contexte` est un objet qui met en place un contexte prédéfini au moment de l'exécution de l'instruction :keyword:`with`. Le gestionnaire de contexte gère l'entrée et la sortie de ce contexte d'exécution pour tout un bloc de code. Les gestionnaires de contextes sont normalement invoqués en utilisant une instruction :keyword:`!with` (décrite dans la section :ref:`with`), mais ils peuvent aussi être directement invoqués par leurs méthodes.

source: Typical uses of context managers include saving and restoring various kinds of global state, locking and unlocking resources, closing opened files, etc.
fr: Les utilisations classiques des gestionnaires de contexte sont la sauvegarde et la restauration d'états divers, le verrouillage et le déverrouillage de ressources, la fermeture de fichiers ouverts, etc.

source: For more information on context managers, see :ref:`typecontextmanager`.
fr: Pour plus d'informations sur les gestionnaires de contexte, lisez :ref:`typecontextmanager`.

source: Enter the runtime context related to this object. The :keyword:`with` statement will bind this method's return value to the target(s) specified in the :keyword:`!as` clause of the statement, if any.
fr: Entre dans le contexte d'exécution relatif à cet objet. L'instruction :keyword:`with` lie la valeur de retour de cette méthode à une (ou plusieurs) cible spécifiée par la clause :keyword:`!as` de l'instruction, si elle est spécifiée.

source: Exit the runtime context related to this object. The parameters describe the exception that caused the context to be exited. If the context was exited without an exception, all three arguments will be :const:`None`.
fr: Sort du contexte d'exécution relatif à cet objet. Les paramètres décrivent l'exception qui a causé la sortie du contexte. Si l'on sort du contexte sans exception, les trois arguments sont à :const:`None`.

source: If an exception is supplied, and the method wishes to suppress the exception (i.e., prevent it from being propagated), it should return a true value. Otherwise, the exception will be processed normally upon exit from this method.
fr: Si une exception est indiquée et que la méthode souhaite supprimer l'exception (c'est-à-dire qu'elle ne veut pas que l'exception soit propagée), elle doit renvoyer ``True``. Sinon, l'exception est traitée normalement à la sortie de cette méthode.

source: Note that :meth:`__exit__` methods should not reraise the passed-in exception; this is the caller's responsibility.
fr: Notez qu'une méthode :meth:`__exit__` ne doit pas lever à nouveau l'exception qu'elle reçoit ; c'est du ressort de l'appelant.

source: :pep:`343` - The "with" statement
fr: :pep:`343` — L'instruction ``with``

source: The specification, background, and examples for the Python :keyword:`with` statement.
fr: La spécification, les motivations et des exemples de l'instruction :keyword:`with` en Python.

source: Special method lookup
fr: Recherche des méthodes spéciales

source: For custom classes, implicit invocations of special methods are only guaranteed to work correctly if defined on an object's type, not in the object's instance dictionary. That behaviour is the reason why the following code raises an exception::
fr: Pour les classes définies par le développeur, l'invocation implicite de méthodes spéciales n'est garantie que si ces méthodes sont définies par le type d'objet, pas dans le dictionnaire de l'objet instance. Ce comportement explique pourquoi le code suivant lève une exception ::

source: The rationale behind this behaviour lies with a number of special methods such as :meth:`__hash__` and :meth:`__repr__` that are implemented by all objects, including type objects. If the implicit lookup of these methods used the conventional lookup process, they would fail when invoked on the type object itself::
fr: La raison de ce comportement vient de certaines méthodes spéciales telles que :meth:`__hash__` et :meth:`__repr__` qui sont implémentées par tous les objets, y compris les objets types. Si la recherche effectuée par ces méthodes utilisait le processus normal de recherche, elles ne fonctionneraient pas si on les appelait sur l'objet type lui-même ::

source: Incorrectly attempting to invoke an unbound method of a class in this way is sometimes referred to as 'metaclass confusion', and is avoided by bypassing the instance when looking up special methods::
fr: Essayer d'invoquer une méthode non liée d'une classe de cette manière est parfois appelé « confusion de méta-classe » et se contourne en shuntant l'instance lors de la recherche des méthodes spéciales ::

source: In addition to bypassing any instance attributes in the interest of correctness, implicit special method lookup generally also bypasses the :meth:`__getattribute__` method even of the object's metaclass::
fr: En plus de shunter les attributs des instances pour fonctionner correctement, la recherche des méthodes spéciales implicites shunte aussi la méthode :meth:`__getattribute__` même dans la méta-classe de l'objet ::

source: Bypassing the :meth:`__getattribute__` machinery in this fashion provides significant scope for speed optimisations within the interpreter, at the cost of some flexibility in the handling of special methods (the special method *must* be set on the class object itself in order to be consistently invoked by the interpreter).
fr: En shuntant le mécanisme de :meth:`__getattribute__` de cette façon, cela permet d'optimiser la vitesse de l'interpréteur moyennant une certaine manœuvre dans la gestion des méthodes spéciales (la méthode spéciale *doit* être définie sur l'objet classe lui-même afin d'être invoquée de manière cohérente par l'interpréteur).

source: Awaitable Objects
fr: Objets *attendables* (*awaitable*)

source: The :term:`generator iterator` objects returned from generators decorated with :func:`types.coroutine` or :func:`asyncio.coroutine` are also awaitable, but they do not implement :meth:`__await__`.
fr: Les objets :term:`itérateur de générateur` renvoyés par les générateurs décorés par :func:`types.coroutine` ou :func:`asyncio.coroutine` sont aussi des *attendables* (*awaitable*), mais ils n'implémentent pas :meth:`__await__`.

source: Must return an :term:`iterator`. Should be used to implement :term:`awaitable` objects. For instance, :class:`asyncio.Future` implements this method to be compatible with the :keyword:`await` expression.
fr: Doit renvoyer un :term:`itérateur`. Doit être utilisé pour implémenter les objets :term:`awaitable`. Par exemple, :class:`asyncio.Future` implémente cette méthode pour être compatible avec les expressions :keyword:`await`.

source: :pep:`492` for additional information about awaitable objects.
fr: :pep:`492` pour les informations relatives aux objets *attendables* (*awaitable*).

source: Coroutine Objects
fr: Objets coroutines

source: Coroutines also have the methods listed below, which are analogous to those of generators (see :ref:`generator-methods`). However, unlike generators, coroutines do not directly support iteration.
fr: Les coroutines disposent aussi des méthodes listées ci-dessous, analogues à celles des générateurs (voir :ref:`generator-methods`). Cependant, au contraire des générateurs, vous ne pouvez pas itérer directement sur des coroutines.

source: It is a :exc:`RuntimeError` to await on a coroutine more than once.
fr: Utiliser *await* plus d'une fois sur une coroutine lève une :exc:`RuntimeError`.
