Repository: python/python-docs-fr
Catalog: reference/datamodel.po
Languages: fr

source: Called by the :func:`repr` built-in function to compute the "official" string representation of an object. If at all possible, this should look like a valid Python expression that could be used to recreate an object with the same value (given an appropriate environment). If this is not possible, a string of the form ``<...some useful description...>`` should be returned. The return value must be a string object. If a class defines :meth:`__repr__` but not :meth:`__str__`, then :meth:`__repr__` is also used when an "informal" string representation of instances of that class is required.
fr: Appelée par la fonction native :func:`repr` pour calculer la représentation « officielle » en chaîne de caractères d'un objet. Tout est fait pour que celle-ci ressemble à une expression Python valide pouvant être utilisée pour recréer un objet avec la même valeur (dans un environnement donné). Si ce n'est pas possible, une chaîne de la forme ``<...une description utile...>`` est renvoyée. La valeur renvoyée doit être un objet chaîne de caractères. Si une classe définit :meth:`__repr__` mais pas :meth:`__str__`, alors :meth:`__repr__` est aussi utilisée quand une représentation « informelle » en chaîne de caractères est demandée pour une instance de cette classe.

source: This is typically used for debugging, so it is important that the representation is information-rich and unambiguous.
fr: Cette fonction est principalement utilisée à fins de débogage, il est donc important que la représentation donne beaucoup d'informations et ne soit pas ambigüe.

source: Called by :func:`str(object) <str>` and the built-in functions :func:`format` and :func:`print` to compute the "informal" or nicely printable string representation of an object. The return value must be a :ref:`string <textseq>` object.
fr: Appelée par :func:`str(objet)<str>` ainsi que les fonctions natives :func:`format` et :func:`print` pour calculer une chaîne de caractères « informelle » ou joliment mise en forme de représentation de l'objet. La valeur renvoyée doit être un objet :ref:`string <textseq>`.

source: This method differs from :meth:`object.__repr__` in that there is no expectation that :meth:`__str__` return a valid Python expression: a more convenient or concise representation can be used.
fr: Cette méthode diffère de :meth:`object.__repr__` car il n'est pas attendu que :meth:`__str__` renvoie une expression Python valide : une représentation plus agréable à lire ou plus concise peut être utilisée.

source: The default implementation defined by the built-in type :class:`object` calls :meth:`object.__repr__`.
fr: C'est l'implémentation par défaut des appels à :meth:`object.__repr__` du type natif :class:`object`.

source: Called by :ref:`bytes <func-bytes>` to compute a byte-string representation of an object. This should return a :class:`bytes` object.
fr: Appelée par :ref:`bytes <func-bytes>` pour calculer une représentation en chaîne *bytes* d'un objet. Elle doit renvoyer un objet :class:`bytes`.

source: Called by the :func:`format` built-in function, and by extension, evaluation of :ref:`formatted string literals <f-strings>` and the :meth:`str.format` method, to produce a "formatted" string representation of an object. The *format_spec* argument is a string that contains a description of the formatting options desired. The interpretation of the *format_spec* argument is up to the type implementing :meth:`__format__`, however most classes will either delegate formatting to one of the built-in types, or use a similar formatting option syntax.
fr: Appelée par la fonction native :func:`format` et, par extension, lors de l'évaluation de :ref:`formatted string literals <f-strings>` et la méthode :meth:`str.format`. Elle produit une chaîne de caractères « formatée » représentant un objet. L'argument ``format_spec`` est une chaîne de caractères contenant la description des options de formatage voulues. L'interprétation de l'argument ``format_spec`` est laissée au type implémentant :meth:`__format__`. Cependant, la plupart des classes délèguent le formatage aux types natifs ou utilisent une syntaxe similaire d'options de formatage.

source: See :ref:`formatspec` for a description of the standard formatting syntax.
fr: Lisez :ref:`formatspec` pour une description de la syntaxe standard du formatage.

source: The return value must be a string object.
fr: La valeur renvoyée doit être un objet chaîne de caractères.

source: The __format__ method of ``object`` itself raises a :exc:`TypeError` if passed any non-empty string.
fr: La méthode ``__format__`` de ``object`` lui-même lève une :exc:`TypeError` si vous lui passez une chaîne non vide.

source: These are the so-called "rich comparison" methods. The correspondence between operator symbols and method names is as follows: ``x<y`` calls ``x.__lt__(y)``, ``x<=y`` calls ``x.__le__(y)``, ``x==y`` calls ``x.__eq__(y)``, ``x!=y`` calls ``x.__ne__(y)``, ``x>y`` calls ``x.__gt__(y)``, and ``x>=y`` calls ``x.__ge__(y)``.
fr: Ce sont les méthodes dites de « comparaisons riches ». La correspondance entre les symboles opérateurs et les noms de méthodes est la suivante : ``x<y`` appelle ``x.__lt__(y)``, ``x<=y`` appelle ``x.__le__(y)``, ``x==y`` appelle ``x.__eq__(y)``, ``x!=y`` appelle ``x.__ne__(y)``, ``x>y`` appelle ``x.__gt__(y)`` et ``x>=y`` appelle ``x.__ge__(y)``.

source: A rich comparison method may return the singleton ``NotImplemented`` if it does not implement the operation for a given pair of arguments. By convention, ``False`` and ``True`` are returned for a successful comparison. However, these methods can return any value, so if the comparison operator is used in a Boolean context (e.g., in the condition of an ``if`` statement), Python will call :func:`bool` on the value to determine if the result is true or false.
fr: Une méthode de comparaison riche peut renvoyer le singleton ``NotImplemented`` si elle n'implémente pas l'opération pour une paire donnée d'arguments. Par convention, ``False`` et ``True`` sont renvoyées pour une comparaison qui a réussi. Cependant, ces méthodes peuvent renvoyer n'importe quelle valeur donc, si l'opérateur de comparaison est utilisé dans un contexte booléen (par exemple dans une condition d'une instruction ``if``), Python appelle :func:`bool` sur la valeur pour déterminer si le résultat est faux ou vrai.

source: See the paragraph on :meth:`__hash__` for some important notes on creating :term:`hashable` objects which support custom comparison operations and are usable as dictionary keys.
fr: Lisez le paragraphe :meth:`__hash__` pour connaître certaines notions importantes relatives à la création d'objets :term:`hashable` qui acceptent les opérations de comparaison personnalisées et qui sont utilisables en tant que clés de dictionnaires.

source: There are no swapped-argument versions of these methods (to be used when the left argument does not support the operation but the right argument does); rather, :meth:`__lt__` and :meth:`__gt__` are each other's reflection, :meth:`__le__` and :meth:`__ge__` are each other's reflection, and :meth:`__eq__` and :meth:`__ne__` are their own reflection. If the operands are of different types, and right operand's type is a direct or indirect subclass of the left operand's type, the reflected method of the right operand has priority, otherwise the left operand's method has priority. Virtual subclassing is not considered.
fr: Il n'y a pas de versions avec les arguments interchangés de ces méthodes (qui seraient utilisées quand l'argument de gauche ne connaît pas l'opération alors que l'argument de droite la connaît) ; en lieu et place, :meth:`__lt__` et :meth:`__gt__` sont la réflexion l'une de l'autre, :meth:`__le__` et :meth:`__ge__` sont la réflexion l'une de l'autre et :meth:`__eq__` ainsi que :meth:`__ne__` sont réflexives. Si les opérandes sont de types différents et que l'opérande de droite est d'un type qui une sous-classe directe ou indirecte du type de l'opérande de gauche, alors la méthode symétrique de l'opérande de droite est prioritaire, sinon c'est la méthode de l'opérande de gauche qui est prioritaire. Les sous-classes virtuelles ne sont pas prises en compte.

source: Called by built-in function :func:`hash` and for operations on members of hashed collections including :class:`set`, :class:`frozenset`, and :class:`dict`. :meth:`__hash__` should return an integer. The only required property is that objects which compare equal have the same hash value; it is advised to mix together the hash values of the components of the object that also play a part in comparison of objects by packing them into a tuple and hashing the tuple. Example::
fr: Appelée par la fonction native :func:`hash` et par les opérations sur les membres de collections hachées (ce qui comprend :class:`set`, :class:`frozenset` et :class:`dict`). :meth:`__hash__` doit renvoyer un entier. La seule propriété requise est que les objets qui sont égaux pour la comparaison doivent avoir la même valeur de hachage ; il est conseillé de mélanger les valeurs de hachage des composants d'un objet qui jouent un rôle de la comparaison des objets, en les plaçant dans un *n*-uplet dont on calcule l'empreinte. Par exemple ::

source: :func:`hash` truncates the value returned from an object's custom :meth:`__hash__` method to the size of a :c:type:`Py_ssize_t`. This is typically 8 bytes on 64-bit builds and 4 bytes on 32-bit builds. If an object's :meth:`__hash__` must interoperate on builds of different bit sizes, be sure to check the width on all supported builds. An easy way to do this is with ``python -c "import sys; print(sys.hash_info.width)"``.
fr: :func:`hash` limite la valeur renvoyée d'un objet ayant une méthode :meth:`__hash__` personnalisée à la taille d'un :c:type:`Py_ssize_t`. C'est classiquement 8 octets pour une implémentation 64 bits et 4 octets sur une implémentation 32 bits. Si la méthode :meth:`__hash__` d'un objet doit être interopérable sur des plateformes ayant des implémentations différentes, assurez-vous de vérifier la taille du hachage sur toutes les plateformes. Une manière facile de le faire est la suivante : ``python -c "import sys; print(sys.hash_info.width)"``.

source: If a class does not define an :meth:`__eq__` method it should not define a :meth:`__hash__` operation either; if it defines :meth:`__eq__` but not :meth:`__hash__`, its instances will not be usable as items in hashable collections. If a class defines mutable objects and implements an :meth:`__eq__` method, it should not implement :meth:`__hash__`, since the implementation of hashable collections requires that a key's hash value is immutable (if the object's hash value changes, it will be in the wrong hash bucket).
fr: Si une classe ne définit pas de méthode :meth:`__eq__`, elle ne doit pas définir l'opération :meth:`__hash__` non plus ; si elle définit :meth:`__eq__` mais pas :meth:`__hash__`, les instances ne peuvent pas être utilisées en tant qu'élément dans une collection de hachables. Si une classe définit des objets mutables et implémente la méthode :meth:`__eq__`, elle ne doit pas implémenter :meth:`__hash__` puisque l'implémentation des collections hachables requiert que les clés soient des empreintes immuables (si l'empreinte d'un objet change, il ne sera plus trouvé correctement dans le stockage du dictionnaire).

source: User-defined classes have :meth:`__eq__` and :meth:`__hash__` methods by default; with them, all objects compare unequal (except with themselves) and ``x.__hash__()`` returns an appropriate value such that ``x == y`` implies both that ``x is y`` and ``hash(x) == hash(y)``.
fr: Les classes définies par l'utilisateur possèdent des méthodes :meth:`__eq__` et :meth:`__hash__` par défaut ; ces méthodes répondent que tous les objets sont différents (sauf avec eux-mêmes) et ``x.__hash__()`` renvoie une valeur telle que ``x == y`` implique à la fois ``x is y`` et ``hash(x) == hash(y)``.

source: A class that overrides :meth:`__eq__` and does not define :meth:`__hash__` will have its :meth:`__hash__` implicitly set to ``None``. When the :meth:`__hash__` method of a class is ``None``, instances of the class will raise an appropriate :exc:`TypeError` when a program attempts to retrieve their hash value, and will also be correctly identified as unhashable when checking ``isinstance(obj, collections.abc.Hashable)``.
fr: Une classe qui surcharge :meth:`__eq__` et qui ne définit pas :meth:`__hash__` a sa méthode :meth:`__hash__` implicitement assignée à ``None``. Quand la méthode :meth:`__hash__` d'une classe est ``None``, une instance de cette classe lève :exc:`TypeError` quand un programme essaie de demander son empreinte et elle est correctement identifiée comme *non hachable* quand on vérifie ``isinstance(obj, collections.abc.Hashable)``.

source: If a class that overrides :meth:`__eq__` needs to retain the implementation of :meth:`__hash__` from a parent class, the interpreter must be told this explicitly by setting ``__hash__ = <ParentClass>.__hash__``.
fr: Si une classe qui surcharge :meth:`__eq__` a besoin de conserver l'implémentation de :meth:`__hash__` de la classe parente, vous devez l'indiquer explicitement à l'interpréteur en définissant ``__hash__ = <ClasseParente>.__hash__``.

source: If a class that does not override :meth:`__eq__` wishes to suppress hash support, it should include ``__hash__ = None`` in the class definition. A class which defines its own :meth:`__hash__` that explicitly raises a :exc:`TypeError` would be incorrectly identified as hashable by an ``isinstance(obj, collections.abc.Hashable)`` call.
fr: Si une classe ne surcharge pas :meth:`__eq__` et veut supprimer le calcul des empreintes, elle doit inclure ``__hash__ = None`` dans la définition de la classe. Une classe qui définit sa propre méthode :meth:`__hash__` qui lève explicitement :exc:`TypeError` serait incorrectement identifiée comme hachable par un appel à ``isinstance(obj, collections.abc.Hashable)``.

source: By default, the :meth:`__hash__` values of str and bytes objects are "salted" with an unpredictable random value. Although they remain constant within an individual Python process, they are not predictable between repeated invocations of Python.
fr: Par défaut, les valeurs renvoyées par :meth:`__hash__` pour les chaînes et les *bytes* sont « salées » avec une valeur aléatoire non prévisible. Bien qu'une empreinte reste constante tout au long d'un processus Python, sa valeur n'est pas prévisible entre deux invocations de Python.

source: This is intended to provide protection against a denial-of-service caused by carefully-chosen inputs that exploit the worst case performance of a dict insertion, O(n^2) complexity. See http://www.ocert.org/advisories/ocert-2011-003.html for details.
fr: C'est un comportement voulu pour se protéger contre un déni de service qui utiliserait des entrées malicieusement choisies pour effectuer des insertions dans le dictionnaire dans le pire cas, avec une complexité en O(n^2). Lisez http://www.ocert.org/advisories/ocert-2011-003.html pour en obtenir les détails (article en anglais).

source: Changing hash values affects the iteration order of sets. Python has never made guarantees about this ordering (and it typically varies between 32-bit and 64-bit builds).
fr: Modifier les empreintes obtenues par hachage modifie l'ordre d'itération sur les *sets*. Python n'a jamais donné de garantie sur cet ordre (d'ailleurs, l'ordre n'est pas le même entre les implémentations 32 et 64 bits).

source: See also :envvar:`PYTHONHASHSEED`.
fr: Voir aussi :envvar:`PYTHONHASHSEED`.

source: Hash randomization is enabled by default.
fr: la randomisation des empreintes est activée par défaut.

source: Called to implement truth value testing and the built-in operation ``bool()``; should return ``False`` or ``True``. When this method is not defined, :meth:`__len__` is called, if it is defined, and the object is considered true if its result is nonzero. If a class defines neither :meth:`__len__` nor :meth:`__bool__`, all its instances are considered true.
fr: Appelée pour implémenter les tests booléens et l'opération native ``bool()`` ; elle doit renvoyer ``False`` ou ``True``. Quand cette méthode n'est pas définie, :meth:`__len__` est appelée, si elle est définie, et l'objet est considéré vrai si le résultat est non nul. Si une classe ne définit ni :meth:`__len__` ni :meth:`__bool__`, toutes ses instances sont considérées comme vraies.

source: Customizing attribute access
fr: Personnalisation de l'accès aux attributs

source: The following methods can be defined to customize the meaning of attribute access (use of, assignment to, or deletion of ``x.name``) for class instances.
fr: Les méthodes suivantes peuvent être définies pour personnaliser l'accès aux attributs (utilisation, assignation, suppression de ``x.name``) pour les instances de classes.

source: Called when the default attribute access fails with an :exc:`AttributeError` (either :meth:`__getattribute__` raises an :exc:`AttributeError` because *name* is not an instance attribute or an attribute in the class tree for ``self``; or :meth:`__get__` of a *name* property raises :exc:`AttributeError`). This method should either return the (computed) attribute value or raise an :exc:`AttributeError` exception.
fr: Appelée lorsque l'accès par défaut à l'attribut échoue en levant :exc:`AttributeError` (soit :meth:`__getattribute__` lève :exc:`AttributeError` car *name* n'est pas un attribut de l'instance ou un attribut dans l'arborescence de la classe de ``self`` ; ou :meth:`__get__` de la propriété *name* lève :exc:`AttributeError`). Cette méthode doit retourner soit la valeur (calculée) de l'attribut, soit lever une exception :exc:`AttributeError`.

source: Note that if the attribute is found through the normal mechanism, :meth:`__getattr__` is not called. (This is an intentional asymmetry between :meth:`__getattr__` and :meth:`__setattr__`.) This is done both for efficiency reasons and because otherwise :meth:`__getattr__` would have no way to access other attributes of the instance. Note that at least for instance variables, you can fake total control by not inserting any values in the instance attribute dictionary (but instead inserting them in another object). See the :meth:`__getattribute__` method below for a way to actually get total control over attribute access.
fr: Notez que si l'attribut est trouvé par le mécanisme normal, :meth:`__getattr__` n'est pas appelée (c'est une asymétrie voulue entre :meth:`__getattr__` et :meth:`__setattr__`). Ce comportement est adopté à la fois pour des raisons de performance et parce que, sinon, :meth:`__getattr__` n'aurait aucun moyen d'accéder aux autres attributs de l'instance. Notez que, au moins pour ce qui concerne les variables d'instance, vous pouvez simuler un contrôle total en n'insérant aucune valeur dans le dictionnaire des attributs de l'instance (mais en les insérant dans un autre objet à la place). Lisez la partie relative à la méthode :meth:`__getattribute__` ci-dessous pour obtenir un contrôle total effectif sur l'accès aux attributs.

source: Called unconditionally to implement attribute accesses for instances of the class. If the class also defines :meth:`__getattr__`, the latter will not be called unless :meth:`__getattribute__` either calls it explicitly or raises an :exc:`AttributeError`. This method should return the (computed) attribute value or raise an :exc:`AttributeError` exception. In order to avoid infinite recursion in this method, its implementation should always call the base class method with the same name to access any attributes it needs, for example, ``object.__getattribute__(self, name)``.
fr: Appelée de manière inconditionnelle pour implémenter l'accès aux attributs des instances de la classe. Si la classe définit également :meth:`__getattr__`, cette dernière n'est pas appelée à moins que :meth:`__getattribute__` ne l'appelle explicitement ou ne lève une exception :exc:`AttributeError`. Cette méthode doit renvoyer la valeur (calculée) de l'attribut ou lever une exception :exc:`AttributeError`. Afin d'éviter une récursion infinie sur cette méthode, son implémentation doit toujours appeler la méthode de la classe de base avec le même paramètre *name* pour accéder à n'importe quel attribut dont elle a besoin. Par exemple, ``object.__getattribute__(self, name)``.

source: This method may still be bypassed when looking up special methods as the result of implicit invocation via language syntax or built-in functions. See :ref:`special-lookup`.
fr: Cette méthode peut être shuntée lorsque la recherche porte sur les méthodes spéciales en tant que résultat d'une invocation implicite *via* la syntaxe du langage ou les fonctions natives. Lisez :ref:`special-lookup`.

source: Called when an attribute assignment is attempted. This is called instead of the normal mechanism (i.e. store the value in the instance dictionary). *name* is the attribute name, *value* is the value to be assigned to it.
fr: Appelée lors d'une assignation d'attribut. Elle est appelée à la place du mécanisme normal (c'est-à-dire stocker la valeur dans le dictionnaire de l'instance). *name* est le nom de l'attribut, *value* est la valeur à assigner à cet attribut.

source: If :meth:`__setattr__` wants to assign to an instance attribute, it should call the base class method with the same name, for example, ``object.__setattr__(self, name, value)``.
fr: Si :meth:`__setattr__` veut assigner un attribut d'instance, elle doit appeler la méthode de la classe de base avec le même nom, par exemple ``object.__setattr__(self, name, value)``.

source: Like :meth:`__setattr__` but for attribute deletion instead of assignment. This should only be implemented if ``del obj.name`` is meaningful for the object.
fr: Comme :meth:`__setattr__` mais pour supprimer un attribut au lieu de l'assigner. Elle ne doit être implémentée que si ``del obj.name`` a du sens pour cet objet.

source: Called when :func:`dir` is called on the object. A sequence must be returned. :func:`dir` converts the returned sequence to a list and sorts it.
fr: Appelée quand :func:`dir` est appelée sur l'objet. Elle doit renvoyer une séquence. :func:`dir` convertit la séquence renvoyée en liste et effectue le classement.

source: Customizing module attribute access
fr: Personnalisation de l'accès aux attributs d'un module

source: Special names ``__getattr__`` and ``__dir__`` can be also used to customize access to module attributes. The ``__getattr__`` function at the module level should accept one argument which is the name of an attribute and return the computed value or raise an :exc:`AttributeError`. If an attribute is not found on a module object through the normal lookup, i.e. :meth:`object.__getattribute__`, then ``__getattr__`` is searched in the module ``__dict__`` before raising an :exc:`AttributeError`. If found, it is called with the attribute name and the result is returned.
fr: Les noms spéciaux ``__getattr__`` et ``__dir__`` peuvent aussi être personnalisés pour accéder aux attributs du module. La fonction ``__getattr__`` au niveau du module doit accepter un argument qui est un nom d'attribut et doit renvoyer la valeur calculée ou lever une :exc:`AttributeError`. Si un attribut n'est pas trouvé dans l'objet module en utilisant la recherche normale, c'est-à-dire :meth:`object.__getattribute__`, alors Python recherche ``__getattr__`` dans le ``__dict__`` du module avant de lever une :exc:`AttributeError`. S'il la trouve, il l'appelle avec le nom de l'attribut et renvoie le résultat.
