Repository: python/python-docs-fr
Catalog: reference/datamodel.po
Languages: fr

source: Mutable sequences can be changed after they are created. The subscription and slicing notations can be used as the target of assignment and :keyword:`del` (delete) statements.
fr: Les séquences muables peuvent être modifiées après leur création. Les notations de tranches et de sous-ensembles peuvent être utilisées en tant que cibles d'une assignation ou de l'instruction :keyword:`del` (suppression).

source: There are currently two intrinsic mutable sequence types:
fr: Il existe aujourd'hui deux types intrinsèques de séquences muables :

source: Lists
fr: Listes

source: The items of a list are arbitrary Python objects. Lists are formed by placing a comma-separated list of expressions in square brackets. (Note that there are no special cases needed to form lists of length 0 or 1.)
fr: N'importe quel objet Python peut être élément d'une liste. Les listes sont créées en plaçant entre crochets une liste d'expressions dont les éléments sont séparés par des virgules (notez que les listes de longueur 0 ou 1 ne sont pas des cas particuliers).

source: Byte Arrays
fr: Tableaux d'octets

source: A bytearray object is a mutable array. They are created by the built-in :func:`bytearray` constructor. Aside from being mutable (and hence unhashable), byte arrays otherwise provide the same interface and functionality as immutable :class:`bytes` objects.
fr: Un objet *bytearray* est un tableau muable. Il est créé par la fonction native constructeur :func:`bytearray`. À part la propriété d'être muable (et donc de ne pas pouvoir calculer son empreinte par hachage), un tableau d'octets possède la même interface et les mêmes fonctionnalités qu'un objet immuable :class:`bytes`.

source: The extension module :mod:`array` provides an additional example of a mutable sequence type, as does the :mod:`collections` module.
fr: Le module d'extension :mod:`array` fournit un autre exemple de type de séquence muable, de même que le module :mod:`collections`.

source: Set types
fr: Ensembles

source: These represent unordered, finite sets of unique, immutable objects. As such, they cannot be indexed by any subscript. However, they can be iterated over, and the built-in function :func:`len` returns the number of items in a set. Common uses for sets are fast membership testing, removing duplicates from a sequence, and computing mathematical operations such as intersection, union, difference, and symmetric difference.
fr: Ils représentent les ensembles d'objets, non ordonnés, finis et dont les éléments sont uniques. Tels quels, ils ne peuvent pas être indicés. Cependant, il est possible d'itérer dessus et la fonction native :func:`len` renvoie le nombre d'éléments de l'ensemble. Les utilisations classiques des ensembles sont les tests d'appartenance rapides, la suppression de doublons dans une séquence et le calcul d'opérations mathématiques telles que l'intersection, l'union, la différence et le complémentaire.

source: For set elements, the same immutability rules apply as for dictionary keys. Note that numeric types obey the normal rules for numeric comparison: if two numbers compare equal (e.g., ``1`` and ``1.0``), only one of them can be contained in a set.
fr: Pour les éléments des ensembles, les mêmes règles concernant l'immuabilité s'appliquent que pour les clés de dictionnaires. Notez que les types numériques obéissent aux règles normales pour les comparaisons numériques : si deux nombres sont égaux (pour l'opération de comparaison, par exemple ``1`` et ``1.0``), un seul élément est conservé dans l'ensemble.

source: There are currently two intrinsic set types:
fr: Actuellement, il existe deux types d'ensembles natifs :

source: Sets
fr: Ensembles

source: These represent a mutable set. They are created by the built-in :func:`set` constructor and can be modified afterwards by several methods, such as :meth:`~set.add`.
fr: Ils représentent les ensembles muables. Un ensemble est créé par la fonction native constructeur :func:`set` et peut être modifié par la suite à l'aide de différentes méthodes, par exemple :meth:`~set.add`.

source: Frozen sets
fr: Ensembles figés

source: These represent an immutable set. They are created by the built-in :func:`frozenset` constructor. As a frozenset is immutable and :term:`hashable`, it can be used again as an element of another set, or as a dictionary key.
fr: Ils représentent les ensembles immuables. Ils sont créés par la fonction native constructeur :func:`frozenset`. Comme un ensemble figé est immuable et :term:`hachable`, il peut être utilisé comme élément d'un autre ensemble ou comme clé de dictionnaire.

source: Mappings
fr: Tableaux de correspondances

source: These represent finite sets of objects indexed by arbitrary index sets. The subscript notation ``a[k]`` selects the item indexed by ``k`` from the mapping ``a``; this can be used in expressions and as the target of assignments or :keyword:`del` statements. The built-in function :func:`len` returns the number of items in a mapping.
fr: Ils représentent les ensembles finis d'objets indicés par des ensembles index arbitraires. La notation ``a[k]`` sélectionne l'élément indicé par ``k`` dans le tableau de correspondance ``a`` ; elle peut être utilisée dans des expressions, comme cible d'une assignation ou avec l'instruction :keyword:`del`. La fonction native :func:`len` renvoie le nombre d'éléments du tableau de correspondances.

source: There is currently a single intrinsic mapping type:
fr: Il n'existe actuellement qu'un seul type natif pour les tableaux de correspondances :

source: Dictionaries
fr: Dictionnaires

source: These represent finite sets of objects indexed by nearly arbitrary values. The only types of values not acceptable as keys are values containing lists or dictionaries or other mutable types that are compared by value rather than by object identity, the reason being that the efficient implementation of dictionaries requires a key's hash value to remain constant. Numeric types used for keys obey the normal rules for numeric comparison: if two numbers compare equal (e.g., ``1`` and ``1.0``) then they can be used interchangeably to index the same dictionary entry.
fr: Ils représentent les ensembles finis d'objets indicés par des valeurs presque arbitraires. Les seuls types de valeurs non reconnus comme clés sont les valeurs contenant des listes, des dictionnaires ou les autres types muables qui sont comparés par valeur plutôt que par l'identifiant de l'objet. La raison de cette limitation est qu'une implémentation efficace de dictionnaire requiert que l'empreinte par hachage des clés reste constante dans le temps. Les types numériques obéissent aux règles normales pour les comparaisons numériques : si deux nombres sont égaux pour l'opération de comparaison, par exemple ``1`` et ``1.0``, alors ces deux nombres peuvent être utilisés indifféremment pour désigner la même entrée du dictionnaire.

source: Dictionaries preserve insertion order, meaning that keys will be produced in the same order they were added sequentially over the dictionary. Replacing an existing key does not change the order, however removing a key and re-inserting it will add it to the end instead of keeping its old place.
fr: Les dictionnaires préservent l’ordre d’insertion, ce qui signifie que les clés sont renvoyées séquentiellement dans le même ordre que celui de l’insertion. Remplacer une clé existante ne change pas l’ordre. Par contre, la retirer puis la réinsérer la met à la fin et non à sa précédente position.

source: Dictionaries are mutable; they can be created by the ``{...}`` notation (see section :ref:`dict`).
fr: Les dictionnaires sont muables : ils peuvent être créés par la notation ``{...}`` (reportez-vous à la section :ref:`dict`).

source: The extension modules :mod:`dbm.ndbm` and :mod:`dbm.gnu` provide additional examples of mapping types, as does the :mod:`collections` module.
fr: Les modules d'extensions :mod:`dbm.ndbm` et :mod:`dbm.gnu` apportent d'autres exemples de types tableaux de correspondances, de même que le module :mod:`collections`.

source: Dictionaries did not preserve insertion order in versions of Python before 3.6. In CPython 3.6, insertion order was preserved, but it was considered an implementation detail at that time rather than a language guarantee.
fr: Les dictionnaires ne conservaient pas l’ordre d’insertion dans les versions antérieures à Python 3.6. Dans CPython 3.6, l’ordre d’insertion était déjà conservé, mais considéré comme un détail d’implémentation et non comme une garantie du langage.

source: Callable types
fr: Types appelables

source: These are the types to which the function call operation (see section :ref:`calls`) can be applied:
fr: Ce sont les types sur lesquels on peut faire un appel de fonction (lisez la section :ref:`calls`) :

source: User-defined functions
fr: Fonctions allogènes

source: A user-defined function object is created by a function definition (see section :ref:`function`). It should be called with an argument list containing the same number of items as the function's formal parameter list.
fr: Un objet fonction allogène (ou fonction définie par l'utilisateur, mais ce n'est pas forcément l'utilisateur courant qui a défini cette fonction) est créé par la définition d'une fonction (voir la section :ref:`function`). Il doit être appelé avec une liste d'arguments contenant le même nombre d'éléments que la liste des paramètres formels de la fonction.

source: Special attributes:
fr: Attributs spéciaux :

source: Attribute
fr: Attribut

source: Meaning
fr: Signification

source: The function's documentation string, or ``None`` if unavailable; not inherited by subclasses.
fr: Texte de documentation de la fonction ou ``None`` s'il n'en existe pas ; n'est pas héritée par les sous-classes.

source: Writable
fr: Accessible en écriture

source: The function's name.
fr: Nom de la fonction.

source: The function's :term:`qualified name`.
fr: :term:`Nom qualifié <qualified name>` de la fonction.

source: The name of the module the function was defined in, or ``None`` if unavailable.
fr: Nom du module où la fonction est définie ou ``None`` si ce nom n'est pas disponible.

source: A tuple containing default argument values for those arguments that have defaults, or ``None`` if no arguments have a default value.
fr: Tuple contenant les valeurs des arguments par défaut pour ceux qui en sont dotés ou ``None`` si aucun argument n'a de valeur par défaut.

source: The code object representing the compiled function body.
fr: Objet code représentant le corps de la fonction compilée.

source: A reference to the dictionary that holds the function's global variables --- the global namespace of the module in which the function was defined.
fr: Référence pointant vers le dictionnaire contenant les variables globales de la fonction — l'espace de noms global du module dans lequel la fonction est définie.

source: Read-only
fr: Accessible en lecture seule

source: The namespace supporting arbitrary function attributes.
fr: Espace de nommage accueillant les attributs de la fonction.

source: ``None`` or a tuple of cells that contain bindings for the function's free variables. See below for information on the ``cell_contents`` attribute.
fr: ``None`` ou *n*-uplet de cellules qui contient un lien pour chaque variable libre de la fonction. Voir ci-dessous pour les informations relatives à l'attribut ``cell_contents``.

source: A dict containing annotations of parameters. The keys of the dict are the parameter names, and ``'return'`` for the return annotation, if provided.
fr: Dictionnaire contenant les annotations des paramètres. Les clés du dictionnaire sont les noms des paramètres et la clé ``"return"`` est utilisée pour les annotations de la valeur renvoyée. Les entrées du dictionnaire ne sont présentes que si les paramètres sont effectivement annotés.

source: A dict containing defaults for keyword-only parameters.
fr: Dictionnaire contenant les valeurs par défaut pour les paramètres passés par mot-clé.

source: Most of the attributes labelled "Writable" check the type of the assigned value.
fr: La plupart des attributs étiquetés « Accessible en écriture » vérifient le type de la valeur qu'on leur assigne.

source: Function objects also support getting and setting arbitrary attributes, which can be used, for example, to attach metadata to functions. Regular attribute dot-notation is used to get and set such attributes. *Note that the current implementation only supports function attributes on user-defined functions. Function attributes on built-in functions may be supported in the future.*
fr: Les objets fonctions acceptent également l'assignation et la lecture d'attributs arbitraires. Vous pouvez utiliser cette fonctionnalité pour, par exemple, associer des métadonnées aux fonctions. La notation classique par point est utilisée pour définir et lire de tels attributs. *Notez que l'implémentation actuelle accepte seulement les attributs de fonction sur les fonctions définies par l'utilisateur. Les attributs de fonction pour les fonctions natives seront peut-être acceptés dans le futur.*

source: A cell object has the attribute ``cell_contents``. This can be used to get the value of the cell, as well as set the value.
fr: Un objet cellule possède un attribut ``cell_contents``. Il peut être utilisé pour obtenir la valeur de la cellule et pour en définir la valeur.

source: Additional information about a function's definition can be retrieved from its code object; see the description of internal types below. The :data:`cell <types.CellType>` type can be accessed in the :mod:`types` module.
fr: Vous trouvez davantage d'informations sur la définition de fonctions dans le code de cet objet ; la description des types internes est donnée plus bas. Le type :data:`cell <types.CellType>` est accessible dans le module :mod:`types`.

source: Instance methods
fr: Méthodes d'instances

source: An instance method object combines a class, a class instance and any callable object (normally a user-defined function).
fr: Un objet méthode d'instance combine une classe, une instance de classe et tout objet appelable (normalement une fonction définie par l'utilisateur).

source: Special read-only attributes: :attr:`__self__` is the class instance object, :attr:`__func__` is the function object; :attr:`__doc__` is the method's documentation (same as ``__func__.__doc__``); :attr:`~definition.__name__` is the method name (same as ``__func__.__name__``); :attr:`__module__` is the name of the module the method was defined in, or ``None`` if unavailable.
fr: Attributs spéciaux en lecture seule : :attr:`__self__` est l'objet instance de classe, :attr:`__func__` est l'objet fonction ; :attr:`__doc__` est la documentation de la méthode (comme ``__func__.__doc__``) ; :attr:`~definition.__name__` est le nom de la méthode (comme ``__func__.__name__``) ; :attr:`__module__` est le nom du module où la méthode est définie ou ``None`` s'il n'est pas disponible.

source: Methods also support accessing (but not setting) the arbitrary function attributes on the underlying function object.
fr: Les méthodes savent aussi accéder (mais pas modifier) les attributs de la fonction de l'objet fonction sous-jacent.

source: User-defined method objects may be created when getting an attribute of a class (perhaps via an instance of that class), if that attribute is a user-defined function object or a class method object.
fr: Les objets méthodes définies par l'utilisateur peuvent être créés quand vous récupérez un attribut de classe (par exemple *via* une instance de cette classe) si cet attribut est un objet fonction définie par l'utilisateur ou un objet méthode de classe.

source: When an instance method object is created by retrieving a user-defined function object from a class via one of its instances, its :attr:`__self__` attribute is the instance, and the method object is said to be bound. The new method's :attr:`__func__` attribute is the original function object.
fr: Quand un objet méthode d'instance est créé à partir d'un objet fonction définie par l'utilisateur *via* une des instances, son attribut :attr:`__self__` est l'instance et l'objet méthode est réputé lié. Le nouvel attribut de la méthode :attr:`__func__` est l'objet fonction original.

source: When an instance method object is created by retrieving a class method object from a class or instance, its :attr:`__self__` attribute is the class itself, and its :attr:`__func__` attribute is the function object underlying the class method.
fr: Quand un objet méthode d'instance est créé à partir d'un autre objet méthode de la classe ou de l'instance, son attribut :attr:`__self__` est la classe elle-même et son attribut :attr:`__func__` est l'objet fonction sous-jacent la méthode de classe.

source: When an instance method object is called, the underlying function (:attr:`__func__`) is called, inserting the class instance (:attr:`__self__`) in front of the argument list. For instance, when :class:`C` is a class which contains a definition for a function :meth:`f`, and ``x`` is an instance of :class:`C`, calling ``x.f(1)`` is equivalent to calling ``C.f(x, 1)``.
fr: Quand un objet méthode d'instance est appelé, la fonction sous-jacente (:attr:`__func__`) est appelée et l'objet instance de la classe (:attr:`__self__`) est inséré en tête de liste des arguments. Par exemple, si :class:`C` est une classe qui contient la définition d'une fonction :meth:`f` et que ``x`` est une instance de :class:`C`, alors appeler ``x.f(1)`` est équivalent à appeler ``C.f(x, 1)``.

source: When an instance method object is derived from a class method object, the "class instance" stored in :attr:`__self__` will actually be the class itself, so that calling either ``x.f(1)`` or ``C.f(1)`` is equivalent to calling ``f(C,1)`` where ``f`` is the underlying function.
fr: Quand un objet méthode d'instance est dérivé à partir d'un objet méthode de classe, l'instance de classe stockée dans :attr:`__self__` est en fait la classe elle-même. Ainsi, appeler ``x.f(1)`` ou ``C.f(1)`` est équivalent à appeler ``f(C, 1)`` où ``f`` est la fonction sous-jacente.

source: Note that the transformation from function object to instance method object happens each time the attribute is retrieved from the instance. In some cases, a fruitful optimization is to assign the attribute to a local variable and call that local variable. Also notice that this transformation only happens for user-defined functions; other callable objects (and all non-callable objects) are retrieved without transformation. It is also important to note that user-defined functions which are attributes of a class instance are not converted to bound methods; this *only* happens when the function is an attribute of the class.
fr: Notez que la transformation d'objet fonction en objet méthode d'instance se produit à chaque fois que l'attribut est récupéré à partir de l'instance. Dans certains cas, assigner l'attribut à une variable locale et appeler cette variable locale constitue une bonne optimisation. Notez aussi que cette transformation n'a lieu que pour les fonctions définies par l'utilisateur : les autres objets appelables (et les objets non appelables) sont récupérés sans transformation. Il est aussi important de noter que les fonctions définies par l'utilisateur qui sont attributs d'une instance de classe ne sont pas converties en méthodes liées ; ceci n'a lieu que pour les fonctions qui sont attributs de la classe.

source: Generator functions
fr: Fonctions générateurs

source: A function or method which uses the :keyword:`yield` statement (see section :ref:`yield`) is called a :dfn:`generator function`. Such a function, when called, always returns an iterator object which can be used to execute the body of the function: calling the iterator's :meth:`iterator.__next__` method will cause the function to execute until it provides a value using the :keyword:`!yield` statement. When the function executes a :keyword:`return` statement or falls off the end, a :exc:`StopIteration` exception is raised and the iterator will have reached the end of the set of values to be returned.
fr: Une fonction ou une méthode qui utilise l'instruction :keyword:`yield` (voir la section :ref:`yield`) est appelée :dfn:`fonction générateur`. Une telle fonction, lorsqu'elle est appelée, retourne toujours un objet itérateur qui peut être utilisé pour exécuter le corps de la fonction : appeler la méthode :meth:`iterator.__next__` de l'itérateur exécute la fonction jusqu'à ce qu'elle renvoie une valeur à l'aide de l'instruction :keyword:`!yield`. Quand la fonction exécute l'instruction :keyword:`return` ou se termine, une exception :exc:`StopIteration` est levée et l'itérateur a atteint la fin de l'ensemble de valeurs qu'il peut renvoyer.

source: Coroutine functions
fr: Fonctions coroutines

source: A function or method which is defined using :keyword:`async def` is called a :dfn:`coroutine function`. Such a function, when called, returns a :term:`coroutine` object. It may contain :keyword:`await` expressions, as well as :keyword:`async with` and :keyword:`async for` statements. See also the :ref:`coroutine-objects` section.
fr: Une fonction ou méthode définie en utilisant :keyword:`async def` est appelée :dfn:`fonction coroutine`. Une telle fonction, quand elle est appelée, renvoie un objet :term:`coroutine`. Elle peut contenir des expressions :keyword:`await` ou :keyword:`async with` ou des instructions :keyword:`async for`. Voir également la section :ref:`coroutine-objects`.

source: Asynchronous generator functions
fr: Fonctions générateurs asynchrones

source: A function or method which is defined using :keyword:`async def` and which uses the :keyword:`yield` statement is called a :dfn:`asynchronous generator function`. Such a function, when called, returns an asynchronous iterator object which can be used in an :keyword:`async for` statement to execute the body of the function.
fr: Une fonction ou une méthode définie avec :keyword:`async def` et qui utilise l'instruction :keyword:`yield` est appelée :dfn:`fonction générateur asynchrone`. Une telle fonction, quand elle est appelée, renvoie un objet itérateur asynchrone qui peut être utilisé dans des instructions :keyword:`async for` pour exécuter le corps de la fonction.

source: Calling the asynchronous iterator's :meth:`aiterator.__anext__` method will return an :term:`awaitable` which when awaited will execute until it provides a value using the :keyword:`yield` expression. When the function executes an empty :keyword:`return` statement or falls off the end, a :exc:`StopAsyncIteration` exception is raised and the asynchronous iterator will have reached the end of the set of values to be yielded.
fr: Appeler la méthode :meth:`aiterator.__anext__` de l'itérateur asynchrone renvoie un :term:`awaitable` qui, lorsqu'on l'attend, s'exécute jusqu'à ce qu'il fournisse une valeur à l'aide de l'expression :keyword:`yield`. Quand la fonction exécute une instruction :keyword:`return` (sans valeur) ou arrive à la fin, une exception :exc:`StopAsynciteration` est levée et l'itérateur asynchrone a atteint la fin de l'ensemble des valeurs qu'il peut produire.

source: Built-in functions
fr: Fonctions natives
