Repository: python/python-docs-fr
Catalog: reference/datamodel.po
Languages: fr

source: The ``__dir__`` function should accept no arguments, and return a sequence of strings that represents the names accessible on module. If present, this function overrides the standard :func:`dir` search on a module.
fr: La fonction ``__dir__`` ne prend aucun argument et renvoie une séquence de chaînes qui représente les noms accessibles du module. Si elle existe, cette fonction surcharge la fonction de recherche standard :func:`dir` du module.

source: For a more fine grained customization of the module behavior (setting attributes, properties, etc.), one can set the ``__class__`` attribute of a module object to a subclass of :class:`types.ModuleType`. For example::
fr: Pour une personnalisation plus fine du comportement d'un module (assignation des attributs, propriétés, etc.), vous pouvez assigner l'attribut ``__class__`` d'un objet module à une sous-classe de :class:`types.ModuleType`. Par exemple ::

source: Defining module ``__getattr__`` and setting module ``__class__`` only affect lookups made using the attribute access syntax -- directly accessing the module globals (whether by code within the module, or via a reference to the module's globals dictionary) is unaffected.
fr: Définir ``__getattr__`` du module et ``__class__`` pour le module affecte uniquement les recherches qui utilisent la syntaxe d'accès aux attributs — accéder directement aux globales d'un module (soit par le code dans le module, soit *via* une référence au dictionnaire des variables globales du module) fonctionne toujours de la même façon.

source: ``__class__`` module attribute is now writable.
fr: l'attribut ``__class__`` du module est maintenant en lecture-écriture.

source: ``__getattr__`` and ``__dir__`` module attributes.
fr: attributs ``__getattr__`` et ``__dir__`` du module.

source: :pep:`562` - Module __getattr__ and __dir__
fr: :pep:`562` — ``__getattr__`` et ``__dir__`` pour un module

source: Describes the ``__getattr__`` and ``__dir__`` functions on modules.
fr: Décrit les fonctions ``__getattr__`` et ``__dir__`` des modules.

source: Implementing Descriptors
fr: Implémentation de descripteurs

source: The following methods only apply when an instance of the class containing the method (a so-called *descriptor* class) appears in an *owner* class (the descriptor must be in either the owner's class dictionary or in the class dictionary for one of its parents). In the examples below, "the attribute" refers to the attribute whose name is the key of the property in the owner class' :attr:`~object.__dict__`.
fr: Les méthodes qui suivent s'appliquent seulement quand une instance de la classe (dite classe *descripteur*) contenant la méthode apparaît dans une classe *propriétaire* (*owner* en anglais) ; la classe descripteur doit figurer dans le dictionnaire de la classe propriétaire ou dans le dictionnaire de la classe d'un des parents. Dans les exemples ci-dessous, « l'attribut » fait référence à l'attribut dont le nom est une clé du :attr:`~object.__dict__` de la classe propriétaire.

source: Called to get the attribute of the owner class (class attribute access) or of an instance of that class (instance attribute access). The optional *owner* argument is the owner class, while *instance* is the instance that the attribute was accessed through, or ``None`` when the attribute is accessed through the *owner*.
fr: Appelée pour obtenir l'attribut de la classe propriétaire (accès à un attribut de classe) ou d'une instance de cette classe (accès à un attribut d'instance). L'argument optionnel *owner* est la classe propriétaire alors que *instance* est l'instance par laquelle on accède à l'attribut ou ``None`` lorsque l'on accède par la classe *owner*.

source: This method should return the computed attribute value or raise an :exc:`AttributeError` exception.
fr: Il convient que cette méthode renvoie la valeur calculée de l'attribut ou lève une exception :exc:`AttributeError`.

source: :PEP:`252` specifies that :meth:`__get__` is callable with one or two arguments. Python's own built-in descriptors support this specification; however, it is likely that some third-party tools have descriptors that require both arguments. Python's own :meth:`__getattribute__` implementation always passes in both arguments whether they are required or not.
fr: La :pep:`252` spécifie que :meth:`__get__` soit un appelable avec un ou deux arguments. Les descripteurs natifs de Python suivent cette spécification ; cependant, il est probable que des outils tiers aient des descripteurs qui requièrent les deux arguments. L'implémentation de :meth:`__getattribute__` de Python passe toujours les deux arguments, qu'ils soient requis ou non.

source: Called to set the attribute on an instance *instance* of the owner class to a new value, *value*.
fr: Appelée pour définir l'attribut d'une instance *instance* de la classe propriétaire à la nouvelle valeur *value*.

source: Note, adding :meth:`__set__` or :meth:`__delete__` changes the kind of descriptor to a "data descriptor". See :ref:`descriptor-invocation` for more details.
fr: Notez que ajouter :meth:`__set__` ou :meth:`__delete__` modifie la nature du descripteur vers un « descripteur de donnée ». Reportez-vous à :ref:`descriptor-invocation` pour plus de détails.

source: Called to delete the attribute on an instance *instance* of the owner class.
fr: Appelée pour supprimer l'attribut de l'instance *instance* de la classe propriétaire.

source: Called at the time the owning class *owner* is created. The descriptor has been assigned to *name*.
fr: Appelée au moment où la classe propriétaire *owner* est créée. La classe descripteur a été assignée à *name*.

source: :meth:`__set_name__` is only called implicitly as part of the :class:`type` constructor, so it will need to be called explicitly with the appropriate parameters when a descriptor is added to a class after initial creation::
fr: :meth:`__set_name__` n'est appelée implicitement que par le constructeur de :class:`type`, vous devez donc l'appeler explicitement avec les paramètres adéquats quand un descripteur est ajouté à une classe après sa création ::

source: See :ref:`class-object-creation` for more details.
fr: Consultez :ref:`class-object-creation` pour davantage de détails.

source: The attribute :attr:`__objclass__` is interpreted by the :mod:`inspect` module as specifying the class where this object was defined (setting this appropriately can assist in runtime introspection of dynamic class attributes). For callables, it may indicate that an instance of the given type (or a subclass) is expected or required as the first positional argument (for example, CPython sets this attribute for unbound methods that are implemented in C).
fr: L'attribut :attr:`__objclass__` est interprété par le module :mod:`inspect` comme spécifiant la classe où cet objet a été défini (le définir correctement peut vous aider dans l'introspection des classes dynamiques à l'exécution). Pour les appelables, cela peut indiquer qu'une instance d'un certain type (ou d'une certaine sous-classe) est attendue ou requise comme premier argument positionnel (par exemple, CPython définit cet attribut pour les méthodes non liées qui sont implémentées en C).

source: Invoking Descriptors
fr: Invocation des descripteurs

source: In general, a descriptor is an object attribute with "binding behavior", one whose attribute access has been overridden by methods in the descriptor protocol: :meth:`__get__`, :meth:`__set__`, and :meth:`__delete__`. If any of those methods are defined for an object, it is said to be a descriptor.
fr: En général, un descripteur est un attribut d'objet dont le comportement est « lié » (*binding dehavior* en anglais), c'est-à-dire que les accès aux attributs ont été surchargés par des méthodes conformes au protocole des descripteurs : :meth:`__get__`, :meth:`__set__` et :meth:`__delete__`. Si l'une de ces méthodes est définie pour un objet, il est réputé être un descripteur.

source: The default behavior for attribute access is to get, set, or delete the attribute from an object's dictionary. For instance, ``a.x`` has a lookup chain starting with ``a.__dict__['x']``, then ``type(a).__dict__['x']``, and continuing through the base classes of ``type(a)`` excluding metaclasses.
fr: Le comportement par défaut pour la gestion d'un attribut est de définir, obtenir et supprimer cet attribut du dictionnaire de l'objet. Par exemple, pour ``a.x`` Python commence d'abord par rechercher ``a.__dict__['x']``, puis ``type(a).__dict__['x']`` ; ensuite Python continue en remontant les classes de base de ``type(a)``, en excluant les méta-classes.

source: However, if the looked-up value is an object defining one of the descriptor methods, then Python may override the default behavior and invoke the descriptor method instead. Where this occurs in the precedence chain depends on which descriptor methods were defined and how they were called.
fr: Cependant, si la valeur cherchée est un objet qui définit une des méthodes de descripteur, alors Python modifie son comportement et invoque la méthode du descripteur à la place. Le moment où cela intervient dans la recherche citée ci-dessus dépend de l'endroit où a été définie la méthode de descripteur et comment elle a été appelée.

source: The starting point for descriptor invocation is a binding, ``a.x``. How the arguments are assembled depends on ``a``:
fr: Le point de départ pour une invocation de descripteur est la liaison ``a.x``. La façon dont les arguments sont assemblés dépend de ``a`` :

source: Direct Call
fr: Appel direct

source: The simplest and least common call is when user code directly invokes a descriptor method: ``x.__get__(a)``.
fr: Le plus simple et le plus rare des appels est quand l'utilisateur code directement l'appel à la méthode du descripteur : ``x.__get__(a)``.

source: Instance Binding
fr: Liaison avec une instance

source: If binding to an object instance, ``a.x`` is transformed into the call: ``type(a).__dict__['x'].__get__(a, type(a))``.
fr: Si elle est liée à un objet instance, ``a.x`` est transformé en l'appel suivant : ``type(a).__dict__['x'].__get__(a, type(a))``.

source: Class Binding
fr: Liaison avec une classe

source: If binding to a class, ``A.x`` is transformed into the call: ``A.__dict__['x'].__get__(None, A)``.
fr: Si elle est liée à une classe, ``A.x`` est transformé en l'appel suivant : ``A.__dict__['x'].__get__(None, A)``.

source: Super Binding
fr: Liaison super

source: If ``a`` is an instance of :class:`super`, then the binding ``super(B, obj).m()`` searches ``obj.__class__.__mro__`` for the base class ``A`` immediately preceding ``B`` and then invokes the descriptor with the call: ``A.__dict__['m'].__get__(obj, obj.__class__)``.
fr: Si ``a`` est une instance de :class:`super`, alors ``super(B, obj).m()`` recherche ``obj.__class__.__mro__`` pour la classe de base ``A`` immédiatement avant ``B`` puis invoque le descripteur avec l'appel suivant : ``A.__dict__['m'].__get__(obj, obj.__class__)``.

source: Python methods (including :func:`staticmethod` and :func:`classmethod`) are implemented as non-data descriptors. Accordingly, instances can redefine and override methods. This allows individual instances to acquire behaviors that differ from other instances of the same class.
fr: Les méthodes Python (y compris :func:`staticmethod` et :func:`classmethod`) sont implémentées comme des descripteurs hors-donnée. De la même manière, les instances peuvent redéfinir et surcharger les méthodes. Ceci permet à chaque instance d'avoir un comportement qui diffère des autres instances de la même classe.

source: The :func:`property` function is implemented as a data descriptor. Accordingly, instances cannot override the behavior of a property.
fr: La fonction :func:`property` est implémentée en tant que descripteur de données. Ainsi, les instances ne peuvent pas surcharger le comportement d'une propriété.

source: *__slots__* allow us to explicitly declare data members (like properties) and deny the creation of *__dict__* and *__weakref__* (unless explicitly declared in *__slots__* or available in a parent.)
fr: Les ``__slots__`` vous permettent de déclarer des membres d'une donnée (comme une propriété) et d'interdire la création de *__dict__* ou de *__weakref__* (à moins qu'ils ne soient explicitement déclarés dans le ``__slots__`` ou présent dans le parent).

source: The space saved over using *__dict__* can be significant. Attribute lookup speed can be significantly improved as well.
fr: L'espace gagné par rapport à l'utilisation d'un *__dict__* peut être significatif. La recherche d'attribut peut aussi s'avérer beaucoup plus rapide.

source: This class variable can be assigned a string, iterable, or sequence of strings with variable names used by instances. *__slots__* reserves space for the declared variables and prevents the automatic creation of *__dict__* and *__weakref__* for each instance.
fr: Cette variable de classe peut être assignée avec une chaîne, un itérable ou une séquence de chaînes avec les noms de variables utilisés par les instances. *__slots__* réserve de la place pour ces variables déclarées et interdit la création automatique de *__dict__* et *__weakref__* pour chaque instance.

source: Notes on using *__slots__*
fr: Note sur l'utilisation de *__slots__*

source: When inheriting from a class without *__slots__*, the *__dict__* and *__weakref__* attribute of the instances will always be accessible.
fr: Lorsque vous héritez d'une classe sans *__slots__*, les attributs *__dict__* et *__weakref__* des instances sont toujours accessibles.

source: Without a *__dict__* variable, instances cannot be assigned new variables not listed in the *__slots__* definition. Attempts to assign to an unlisted variable name raises :exc:`AttributeError`. If dynamic assignment of new variables is desired, then add ``'__dict__'`` to the sequence of strings in the *__slots__* declaration.
fr: Sans variable *__dict__*, les instances ne peuvent pas assigner de nouvelles variables (non listées dans la définition de *__slots__*). Les tentatives d'assignation sur un nom de variable non listé lève :exc:`AttributeError`. Si l'assignation dynamique de nouvelles variables est nécessaire, ajoutez ``'__dict__'`` à la séquence de chaînes dans la déclaration *__slots__*.

source: Without a *__weakref__* variable for each instance, classes defining *__slots__* do not support weak references to its instances. If weak reference support is needed, then add ``'__weakref__'`` to the sequence of strings in the *__slots__* declaration.
fr: Sans variable *__weakref__* pour chaque instance, les classes qui définissent *__slots__* ne gèrent pas les références faibles vers leurs instances. Si vous avez besoin de gérer des références faibles, ajoutez ``'__weakref__'`` à la séquence de chaînes dans la déclaration de *__slots__*.

source: *__slots__* are implemented at the class level by creating descriptors (:ref:`descriptors`) for each variable name. As a result, class attributes cannot be used to set default values for instance variables defined by *__slots__*; otherwise, the class attribute would overwrite the descriptor assignment.
fr: Les *__slots__* sont implémentés au niveau de la classe en créant des descripteurs (:ref:`descriptors`) pour chaque nom de variable. Ainsi, les attributs de classe ne peuvent pas être utilisés pour des valeurs par défaut aux variables d'instances définies par *__slots__* ; sinon, l'attribut de classe surchargerait l'assignation par descripteur.

source: The action of a *__slots__* declaration is not limited to the class where it is defined. *__slots__* declared in parents are available in child classes. However, child subclasses will get a *__dict__* and *__weakref__* unless they also define *__slots__* (which should only contain names of any *additional* slots).
fr: L'action de la déclaration du *__slots__* ne se limite pas à la classe où il est défini. Les *__slots__* déclarés par les parents sont disponibles dans les classes enfants. Cependant, les sous-classes enfants ont un *__dict__* et un *__weakref__* à moins qu'elles ne définissent aussi un *__slots__* (qui ne doit contenir alors que les noms *supplémentaires* du *slot*).

source: If a class defines a slot also defined in a base class, the instance variable defined by the base class slot is inaccessible (except by retrieving its descriptor directly from the base class). This renders the meaning of the program undefined. In the future, a check may be added to prevent this.
fr: Si une classe définit un *slot* déjà défini dans une classe de base, la variable d'instance définie par la classe de base est inaccessible (sauf à utiliser le descripteur de la classe de base directement). Cela rend la signification du programme indéfinie. Dans le futur, une vérification sera ajoutée pour empêcher cela.

source: Nonempty *__slots__* does not work for classes derived from "variable-length" built-in types such as :class:`int`, :class:`bytes` and :class:`tuple`.
fr: Un *__slot__* non vide ne fonctionne pas pour les classes dérivées des types natifs à longueur variable tels que :class:`int`, :class:`bytes` et :class:`tuple`.

source: Any non-string iterable may be assigned to *__slots__*. Mappings may also be used; however, in the future, special meaning may be assigned to the values corresponding to each key.
fr: Tout itérable qui n'est pas une chaîne peut être assigné à un *__slots__*. Les tableaux de correspondance peuvent aussi être utilisés ; cependant, dans le futur, des significations spéciales pourraient être associées à chacune des clés.

source: *__class__* assignment works only if both classes have the same *__slots__*.
fr: Les assignations de *__class__* ne fonctionnent que si les deux classes ont le même *__slots__*.

source: Multiple inheritance with multiple slotted parent classes can be used, but only one parent is allowed to have attributes created by slots (the other bases must have empty slot layouts) - violations raise :exc:`TypeError`.
fr: L'héritage multiple avec plusieurs classes parentes qui ont des *__slots__* est possible, mais seul un parent peut avoir des attributs créés par *__slots__* (les autres classes parentes doivent avoir des *__slots__* vides). La violation de cette règle lève :exc:`TypeError`.

source: If an iterator is used for *__slots__* then a descriptor is created for each of the iterator's values. However, the *__slots__* attribute will be an empty iterator.
fr: Si un itérateur est utilisé pour *__slots__*, alors un descripteur est créé pour chacune des valeurs de l'itérateur. Cependant, l'attribut de *__slots__* est un itérateur vide.

source: Customizing class creation
fr: Personnalisation de la création de classes

source: Whenever a class inherits from another class, *__init_subclass__* is called on that class. This way, it is possible to write classes which change the behavior of subclasses. This is closely related to class decorators, but where class decorators only affect the specific class they're applied to, ``__init_subclass__`` solely applies to future subclasses of the class defining the method.
fr: Quand une classe hérite d'une classe parente, *__init_subclass__* de la classe parente est appelée. Ainsi, il est possible d'écrire des classes qui modifient le comportement des sous-classes. Ce comportement est corrélé aux décorateurs de classes mais, alors que les décorateurs de classes agissent seulement sur la classe qu'ils décorent, ``__init_subclass__`` agit uniquement sur les futures sous-classes de la classe qui définit cette méthode.

source: This method is called whenever the containing class is subclassed. *cls* is then the new subclass. If defined as a normal instance method, this method is implicitly converted to a class method.
fr: Cette méthode est appelée quand la classe est sous-classée. *cls* est alors la nouvelle sous-classe. Si elle est définie en tant que méthode d'instance normale, cette méthode est implicitement convertie en méthode de classe.

source: Keyword arguments which are given to a new class are passed to the parent's class ``__init_subclass__``. For compatibility with other classes using ``__init_subclass__``, one should take out the needed keyword arguments and pass the others over to the base class, as in::
fr: Les arguments nommés qui sont donnés à la nouvelle classe sont passés à ``__init_subclass__`` de la classe parente. Par souci de compatibilité avec les autres classes qui utilisent ``__init_subclass__``, vous devez enlever les arguments nommés dont vous avez besoin et passer les autres à la classe de base, comme ci-dessous ::

source: The default implementation ``object.__init_subclass__`` does nothing, but raises an error if it is called with any arguments.
fr: L'implémentation par défaut ``object.__init_subclass__`` ne fait rien mais lève une erreur si elle est appelée avec un argument.

source: The metaclass hint ``metaclass`` is consumed by the rest of the type machinery, and is never passed to ``__init_subclass__`` implementations. The actual metaclass (rather than the explicit hint) can be accessed as ``type(cls)``.
fr: L'indication de méta-classe ``metaclass`` est absorbée par le reste du mécanisme de types et n'est jamais passée à l'implémentation de ``__init_subclass__``. La méta-classe réelle (plutôt que l'indication explicite) peut être récupérée par ``type(cls)``.

source: Metaclasses
fr: Méta-classes

source: By default, classes are constructed using :func:`type`. The class body is executed in a new namespace and the class name is bound locally to the result of ``type(name, bases, namespace)``.
fr: Par défaut, les classes sont construites en utilisant :func:`type`. Le corps de la classe est exécuté dans un nouvel espace de nommage et le nom de la classe est lié localement au résultat de `type(name, bases, namespace)``.

source: The class creation process can be customized by passing the ``metaclass`` keyword argument in the class definition line, or by inheriting from an existing class that included such an argument. In the following example, both ``MyClass`` and ``MySubclass`` are instances of ``Meta``::
fr: Le déroulement de création de la classe peut être personnalisé en passant l'argument nommé ``metaclass`` dans la ligne de définition de la classe ou en héritant d'une classe existante qui comporte déjà un tel argument. Dans l'exemple qui suit, ``MyClass`` et ``MySubclass`` sont des instances de ``Meta`` ::

source: Any other keyword arguments that are specified in the class definition are passed through to all metaclass operations described below.
fr: Tout autre argument nommé spécifié dans la définition de la classe est passé aux opérations de méta-classes décrites auparavant.

source: When a class definition is executed, the following steps occur:
fr: Quand la définition d'une classe est exécutée, les différentes étapes suivies sont :

source: MRO entries are resolved;
fr: Les entrées MRO sont résolues ;

source: the appropriate metaclass is determined;
fr: la méta-classe appropriée est déterminée ;

source: the class namespace is prepared;
fr: l'espace de nommage de la classe est préparé ;

source: the class body is executed;
fr: le corps de la classe est exécuté ;

source: the class object is created.
fr: l'objet classe est crée.

source: Resolving MRO entries
fr: Résolution des entrées MRO
