Repository: python/python-docs-fr
Catalog: reference/datamodel.po
Languages: fr

source: Data model
fr: Modèle de données

source: Objects, values and types
fr: Objets, valeurs et types

source: :dfn:`Objects` are Python's abstraction for data. All data in a Python program is represented by objects or by relations between objects. (In a sense, and in conformance to Von Neumann's model of a "stored program computer", code is also represented by objects.)
fr: En Python, les données sont représentées sous forme :dfn:`d'objets`. Toutes les données d'un programme Python sont représentées par des objets ou par des relations entre les objets (dans un certain sens, et en conformité avec le modèle de Von Neumann d'« ordinateur à programme enregistré », le code est aussi représenté par des objets).

source: Every object has an identity, a type and a value. An object's *identity* never changes once it has been created; you may think of it as the object's address in memory. The ':keyword:`is`' operator compares the identity of two objects; the :func:`id` function returns an integer representing its identity.
fr: Chaque objet possède un identifiant, un type et une valeur. *L'identifiant* d'un objet ne change jamais après sa création ; vous pouvez vous le représenter comme l'adresse de l'objet en mémoire. L'opérateur :keyword:`is` compare les identifiants de deux objets ; la fonction :func:`id` renvoie un entier représentant cet identifiant.

source: For CPython, ``id(x)`` is the memory address where ``x`` is stored.
fr: en CPython, ``id(x)`` est l'adresse mémoire où est stocké ``x``.

source: An object's type determines the operations that the object supports (e.g., "does it have a length?") and also defines the possible values for objects of that type. The :func:`type` function returns an object's type (which is an object itself). Like its identity, an object's :dfn:`type` is also unchangeable. [#]_
fr: Le type de l'objet détermine les opérations que l'on peut appliquer à l'objet (par exemple, « a-t-il une longueur ? ») et définit aussi les valeurs possibles pour les objets de ce type. La fonction :func:`type` renvoie le type de l'objet (qui est lui-même un objet). Comme l'identifiant, le :dfn:`type` d'un objet ne peut pas être modifié [#]_.

source: The *value* of some objects can change. Objects whose value can change are said to be *mutable*; objects whose value is unchangeable once they are created are called *immutable*. (The value of an immutable container object that contains a reference to a mutable object can change when the latter's value is changed; however the container is still considered immutable, because the collection of objects it contains cannot be changed. So, immutability is not strictly the same as having an unchangeable value, it is more subtle.) An object's mutability is determined by its type; for instance, numbers, strings and tuples are immutable, while dictionaries and lists are mutable.
fr: La *valeur* de certains objets peut changer. Les objets dont la valeur peut changer sont dits *muables* (*mutable* en anglais) ; les objets dont la valeur est définitivement fixée à leur création sont dits *immuables* (*immutable* en anglais). La valeur d'un objet conteneur immuable qui contient une référence vers un objet muable peut varier lorsque la valeur de l'objet muable change ; cependant, le conteneur est quand même considéré comme immuable parce que l'ensemble des objets qu'il contient ne peut pas être modifié. Ainsi, l'immuabilité n'est pas strictement équivalente au fait d'avoir une valeur non modifiable, c'est plus subtil. La muabilité d'un objet est définie par son type ; par exemple, les nombres, les chaînes de caractères et les *n*-uplets sont immuables alors que les dictionnaires et les listes sont muables.

source: Objects are never explicitly destroyed; however, when they become unreachable they may be garbage-collected. An implementation is allowed to postpone garbage collection or omit it altogether --- it is a matter of implementation quality how garbage collection is implemented, as long as no objects are collected that are still reachable.
fr: Un objet n'est jamais explicitement détruit ; cependant, lorsqu'il ne peut plus être atteint, il a vocation à être supprimé par le ramasse-miettes (*garbage-collector* en anglais). L'implémentation peut retarder cette opération ou même ne pas la faire du tout — la façon dont fonctionne le ramasse-miette est particulière à chaque implémentation, l'important étant qu'il ne supprime pas d'objet qui peut encore être atteint.

source: CPython currently uses a reference-counting scheme with (optional) delayed detection of cyclically linked garbage, which collects most objects as soon as they become unreachable, but is not guaranteed to collect garbage containing circular references. See the documentation of the :mod:`gc` module for information on controlling the collection of cyclic garbage. Other implementations act differently and CPython may change. Do not depend on immediate finalization of objects when they become unreachable (so you should always close files explicitly).
fr: CPython utilise aujourd'hui un mécanisme de compteur de références avec une détection, en temps différé et optionnelle, des cycles d'objets. Ce mécanisme supprime la plupart des objets dès qu'ils ne sont plus accessibles mais il ne garantit pas la suppression des objets où il existe des références circulaires. Consultez la documentation du module :mod:`gc` pour tout ce qui concerne la suppression des cycles. D'autres implémentations agissent différemment et CPython pourrait évoluer. Ne vous reposez pas sur la finalisation immédiate des objets devenus inaccessibles (ainsi, vous devez toujours fermer les fichiers explicitement).

source: Note that the use of the implementation's tracing or debugging facilities may keep objects alive that would normally be collectable. Also note that catching an exception with a ':keyword:`try`...\ :keyword:`except`' statement may keep objects alive.
fr: Notez que si vous utilisez les fonctionnalités de débogage ou de trace de l'implémentation, il est possible que des références qui seraient normalement supprimées soient toujours présentes. Notez aussi que capturer une exception avec l'instruction :keyword:`try`...\ :keyword:`except` peut conserver des objets en vie.

source: Some objects contain references to "external" resources such as open files or windows. It is understood that these resources are freed when the object is garbage-collected, but since garbage collection is not guaranteed to happen, such objects also provide an explicit way to release the external resource, usually a :meth:`close` method. Programs are strongly recommended to explicitly close such objects. The ':keyword:`try`...\ :keyword:`finally`' statement and the ':keyword:`with`' statement provide convenient ways to do this.
fr: Certains objets font référence à des ressources « externes » telles que des fichiers ouverts ou des fenêtres. Ces objets libèrent ces ressources au moment où ils sont supprimés, mais comme le ramasse-miettes ne garantit pas qu'il supprime tous les objets, ces objets fournissent également un moyen explicite de libérer la ressource externe, généralement sous la forme d'une méthode :meth:`close`. Nous incitons fortement les programmeurs à fermer explicitement de tels objets. Les instructions :keyword:`try`...\ :keyword:`finally` et :keyword:`with` sont très pratiques pour cela.

source: Some objects contain references to other objects; these are called *containers*. Examples of containers are tuples, lists and dictionaries. The references are part of a container's value. In most cases, when we talk about the value of a container, we imply the values, not the identities of the contained objects; however, when we talk about the mutability of a container, only the identities of the immediately contained objects are implied. So, if an immutable container (like a tuple) contains a reference to a mutable object, its value changes if that mutable object is changed.
fr: Certains objets contiennent des références à d'autres objets ; on les appelle *conteneurs*. Comme exemples de conteneurs, nous pouvons citer les *n*-uplets, les listes et les dictionnaires. Les références sont parties intégrantes de la valeur d'un conteneur. Dans la plupart des cas, lorsque nous parlons de la valeur d'un conteneur, nous parlons des valeurs, pas des identifiants des objets contenus ; cependant, lorsque nous parlons de la muabilité d'un conteneur, seuls les identifiants des objets immédiatement contenus sont concernés. Ainsi, si un conteneur immuable (comme un *n*-uplet) contient une référence à un objet muable, sa valeur change si cet objet muable est modifié.

source: Types affect almost all aspects of object behavior. Even the importance of object identity is affected in some sense: for immutable types, operations that compute new values may actually return a reference to any existing object with the same type and value, while for mutable objects this is not allowed. E.g., after ``a = 1; b = 1``, ``a`` and ``b`` may or may not refer to the same object with the value one, depending on the implementation, but after ``c = []; d = []``, ``c`` and ``d`` are guaranteed to refer to two different, unique, newly created empty lists. (Note that ``c = d = []`` assigns the same object to both ``c`` and ``d``.)
fr: Presque tous les comportements d'un objet dépendent du type de l'objet. Même son identifiant est concerné dans un certain sens : pour les types immuables, les opérations qui calculent de nouvelles valeurs peuvent en fait renvoyer une référence à n'importe quel objet existant avec le même type et la même valeur, alors que pour les objets muables cela n'est pas autorisé. Par exemple, après ``a = 1 ; b = 1``, ``a`` et ``b`` peuvent ou non se référer au même objet avec la valeur un, en fonction de l'implémentation. Mais après ``c = [] ; d = []``, il est garanti que ``c`` et ``d`` font référence à deux listes vides distinctes nouvellement créées. Notez que ``c = d = []`` attribue le même objet à ``c`` et ``d``.

source: The standard type hierarchy
fr: Hiérarchie des types standards

source: Below is a list of the types that are built into Python. Extension modules (written in C, Java, or other languages, depending on the implementation) can define additional types. Future versions of Python may add types to the type hierarchy (e.g., rational numbers, efficiently stored arrays of integers, etc.), although such additions will often be provided via the standard library instead.
fr: Vous trouvez ci-dessous une liste des types natifs de Python. Des modules d'extension (écrits en C, Java ou d'autres langages) peuvent définir des types supplémentaires. Les futures versions de Python pourront ajouter des types à cette hiérarchie (par exemple les nombres rationnels, des tableaux d'entiers stockés efficacement, etc.), bien que de tels ajouts se trouvent souvent plutôt dans la bibliothèque standard.

source: Some of the type descriptions below contain a paragraph listing 'special attributes.' These are attributes that provide access to the implementation and are not intended for general use. Their definition may change in the future.
fr: Quelques descriptions des types ci-dessous contiennent un paragraphe listant des « attributs spéciaux ». Ces attributs donnent accès à l'implémentation et n'ont, en général, pas vocation à être utilisés. Leur définition peut changer dans le futur.

source: This type has a single value. There is a single object with this value. This object is accessed through the built-in name ``None``. It is used to signify the absence of a value in many situations, e.g., it is returned from functions that don't explicitly return anything. Its truth value is false.
fr: Ce type ne possède qu'une seule valeur. Il n'existe qu'un seul objet avec cette valeur. Vous accédez à cet objet avec le nom natif ``None``. Il est utilisé pour signifier l'absence de valeur dans de nombreux cas, par exemple pour des fonctions qui ne retournent rien explicitement. Sa valeur booléenne est fausse.

source: See :ref:`implementing-the-arithmetic-operations` for more details.
fr: Consultez :ref:`implementing-the-arithmetic-operations` pour davantage de détails.

source: Ellipsis
fr: Ellipse

source: This type has a single value. There is a single object with this value. This object is accessed through the literal ``...`` or the built-in name ``Ellipsis``. Its truth value is true.
fr: Ce type ne possède qu'une seule valeur. Il n'existe qu'un seul objet avec cette valeur. Vous accédez à cet objet avec le littéral ``...`` ou le nom natif ``Ellipsis``. Sa valeur booléenne est vraie.

source: These are created by numeric literals and returned as results by arithmetic operators and arithmetic built-in functions. Numeric objects are immutable; once created their value never changes. Python numbers are of course strongly related to mathematical numbers, but subject to the limitations of numerical representation in computers.
fr: Ces objets sont créés par les littéraux numériques et renvoyés en tant que résultats par les opérateurs et les fonctions arithmétiques natives. Les objets numériques sont immuables ; une fois créés, leur valeur ne change pas. Les nombres Python sont bien sûr très fortement corrélés aux nombres mathématiques mais ils sont soumis aux limitations des représentations numériques par les ordinateurs.

source: Python distinguishes between integers, floating point numbers, and complex numbers:
fr: Python distingue les entiers, les nombres à virgule flottante et les nombres complexes :

source: These represent elements from the mathematical set of integers (positive and negative).
fr: Ils représentent des éléments de l'ensemble mathématique des entiers (positifs ou négatifs).

source: There are two types of integers:
fr: Il existe deux types d'entiers :

source: Integers (:class:`int`)
fr: Entiers (:class:`int`)

source: These represent numbers in an unlimited range, subject to available (virtual) memory only. For the purpose of shift and mask operations, a binary representation is assumed, and negative numbers are represented in a variant of 2's complement which gives the illusion of an infinite string of sign bits extending to the left.
fr: Ils représentent les nombres, sans limite de taille, sous réserve de pouvoir être stockés en mémoire (virtuelle). Afin de pouvoir effectuer des décalages et appliquer des masques, on considère qu'ils ont une représentation binaire. Les nombres négatifs sont représentés comme une variante du complément à 2, qui donne l'illusion d'une chaîne infinie de bits de signe s'étendant vers la gauche.

source: Booleans (:class:`bool`)
fr: Booléens (:class:`bool`)

source: These represent the truth values False and True. The two objects representing the values ``False`` and ``True`` are the only Boolean objects. The Boolean type is a subtype of the integer type, and Boolean values behave like the values 0 and 1, respectively, in almost all contexts, the exception being that when converted to a string, the strings ``"False"`` or ``"True"`` are returned, respectively.
fr: Ils représentent les valeurs *faux* et *vrai*. Deux objets, ``False`` et ``True``, sont les seuls objets booléens. Le type booléen est un sous-type du type entier et les valeurs booléennes se comportent comme les valeurs 0 (pour ``False``) et 1 (pour ``True``) dans presque tous les contextes. L'exception concerne la conversion en chaîne de caractères où ``"False"`` et ``"True"`` sont renvoyées.

source: The rules for integer representation are intended to give the most meaningful interpretation of shift and mask operations involving negative integers.
fr: Les règles pour la représentation des entiers ont pour objet de donner l'interprétation la plus naturelle pour les opérations de décalage et masquage qui impliquent des entiers négatifs.

source: These represent machine-level double precision floating point numbers. You are at the mercy of the underlying machine architecture (and C or Java implementation) for the accepted range and handling of overflow. Python does not support single-precision floating point numbers; the savings in processor and memory usage that are usually the reason for using these are dwarfed by the overhead of using objects in Python, so there is no reason to complicate the language with two kinds of floating point numbers.
fr: Ils représentent les nombres à virgule flottante en double précision, tels que manipulés directement par la machine. Vous dépendez donc de l'architecture machine sous-jacente (et de l'implémentation C ou Java) pour les intervalles gérés et le traitement des débordements. Python ne gère pas les nombres à virgule flottante en précision simple ; les gains en puissance de calcul et mémoire, qui sont généralement la raison de l'utilisation des nombres en simple précision, sont annihilés par le fait que Python encapsule de toute façon ces nombres dans des objets. Il n'y a donc aucune raison de compliquer le langage avec deux types de nombres à virgule flottante.

source: These represent complex numbers as a pair of machine-level double precision floating point numbers. The same caveats apply as for floating point numbers. The real and imaginary parts of a complex number ``z`` can be retrieved through the read-only attributes ``z.real`` and ``z.imag``.
fr: Ils représentent les nombres complexes, sous la forme d'un couple de nombres à virgule flottante en double précision, tels que manipulés directement par la machine. Les mêmes restrictions s'appliquent que pour les nombres à virgule flottante. La partie réelle et la partie imaginaire d'un nombre complexe ``z`` peuvent être demandées par les attributs en lecture seule ``z.real`` et ``z.imag``.

source: Sequences
fr: Séquences

source: These represent finite ordered sets indexed by non-negative numbers. The built-in function :func:`len` returns the number of items of a sequence. When the length of a sequence is *n*, the index set contains the numbers 0, 1, ..., *n*-1. Item *i* of sequence *a* is selected by ``a[i]``.
fr: Ils représentent des ensembles de taille finie indicés par des entiers positifs ou nuls. La fonction native :func:`len` renvoie le nombre d'éléments de la séquence. Quand la longueur d'une séquence est *n*, l'ensemble des indices contient les entiers 0, 1 ..., *n-1*. On accède à l'élément d'indice *i* de la séquence *a* par ``a[i]``.

source: Sequences also support slicing: ``a[i:j]`` selects all items with index *k* such that *i* ``<=`` *k* ``<`` *j*. When used as an expression, a slice is a sequence of the same type. This implies that the index set is renumbered so that it starts at 0.
fr: Les séquences peuvent aussi être découpées en tranches (*slicing* en anglais) : ``a[i:j]`` sélectionne tous les éléments d'indice *k* tel que *i* ``<=`` *k* ``<`` *j*. Quand on l'utilise dans une expression, la tranche est du même type que la séquence. Ceci veut dire que l'ensemble des indices de la tranche est renuméroté de manière à partir de 0.

source: Some sequences also support "extended slicing" with a third "step" parameter: ``a[i:j:k]`` selects all items of *a* with index *x* where ``x = i + n*k``, *n* ``>=`` ``0`` and *i* ``<=`` *x* ``<`` *j*.
fr: Quelques séquences gèrent le « découpage étendu » (*extended slicing* en anglais) avec un troisième paramètre : ``a[i:j:k]`` sélectionne tous les éléments de *a* d'indice *x* où ``x = i + n*k``, avec *n* ``>=`` ``0`` et *i* ``<=`` *x* ``<`` *j*.

source: Sequences are distinguished according to their mutability:
fr: Les séquences se différencient en fonction de leur muabilité :

source: Immutable sequences
fr: Séquences immuables

source: An object of an immutable sequence type cannot change once it is created. (If the object contains references to other objects, these other objects may be mutable and may be changed; however, the collection of objects directly referenced by an immutable object cannot change.)
fr: Un objet de type de séquence immuable ne peut pas être modifié une fois qu'il a été créé. Si l'objet contient des références à d'autres objets, ces autres objets peuvent être muables et peuvent être modifiés ; cependant, les objets directement référencés par un objet immuable ne peuvent pas être modifiés.

source: The following types are immutable sequences:
fr: Les types suivants sont des séquences immuables :

source: Strings
fr: Chaînes de caractères

source: A string is a sequence of values that represent Unicode code points. All the code points in the range ``U+0000 - U+10FFFF`` can be represented in a string. Python doesn't have a :c:type:`char` type; instead, every code point in the string is represented as a string object with length ``1``. The built-in function :func:`ord` converts a code point from its string form to an integer in the range ``0 - 10FFFF``; :func:`chr` converts an integer in the range ``0 - 10FFFF`` to the corresponding length ``1`` string object. :meth:`str.encode` can be used to convert a :class:`str` to :class:`bytes` using the given text encoding, and :meth:`bytes.decode` can be used to achieve the opposite.
fr: Une chaîne de caractères (*string* en anglais) est une séquence de valeurs qui représentent des caractères Unicode. Tout caractère dont le code est dans l'intervalle ``U+0000 - U+10FFFF`` peut être représenté dans une chaîne. Python ne possède pas de type :c:type:`char` ; à la place, chaque caractère Unicode dans la chaîne est représenté par un objet chaîne de longueur ``1``. La fonction native :func:`ord` convertit un caractère Unicode de la représentation en chaîne vers un entier dans l'intervalle ``0 - 10FFFF`` ; la fonction :func:`chr` convertit un entier de l'intervalle ``0 - 10FFFF`` vers l'objet chaîne de longueur ``1`` correspondant. :meth:`str.encode` peut être utilisée pour convertir un objet :class:`str` vers :class:`bytes` selon l'encodage spécifié et :meth:`bytes.decode` effectue l'opération inverse.

source: Tuples
fr: *n*-uplets (*tuples* en anglais)

source: The items of a tuple are arbitrary Python objects. Tuples of two or more items are formed by comma-separated lists of expressions. A tuple of one item (a 'singleton') can be formed by affixing a comma to an expression (an expression by itself does not create a tuple, since parentheses must be usable for grouping of expressions). An empty tuple can be formed by an empty pair of parentheses.
fr: Les éléments d'un *n*-uplet peuvent être n'importe quel objet Python. Les *n*-uplets de deux éléments ou plus sont formés par une liste d'expressions dont les éléments sont séparés par des virgules. Un *n*-uplet composé d'un seul élément (un « singleton ») est formé en suffixant une expression avec une virgule (une expression en tant que telle ne crée pas un *n*-uplet car les parenthèses doivent rester disponibles pour grouper les expressions). Un *n*-uplet vide est formé à l'aide d'une paire de parenthèses vide.

source: Bytes
fr: Chaînes d'octets (ou *bytes*)

source: A bytes object is an immutable array. The items are 8-bit bytes, represented by integers in the range 0 <= x < 256. Bytes literals (like ``b'abc'``) and the built-in :func:`bytes()` constructor can be used to create bytes objects. Also, bytes objects can be decoded to strings via the :meth:`~bytes.decode` method.
fr: Les objets *bytes* sont des tableaux immuables. Les éléments sont des octets (donc composés de 8 bits), représentés par des entiers dans l'intervalle 0 à 255 inclus. Les littéraux *bytes* (tels que ``b'abc'``) et la fonction native constructeur :func:`bytes()` peuvent être utilisés pour créer des objets *bytes*. Aussi, un objet *bytes* peut être décodé vers une chaîne *via* la méthode :meth:`~bytes.decode`.

source: Mutable sequences
fr: Séquences muables
