Repository: python/python-docs-fr
Catalog: reference/expressions.po
Languages: fr

source: If a generator expression contains either :keyword:`!async for` clauses or :keyword:`await` expressions it is called an :dfn:`asynchronous generator expression`. An asynchronous generator expression returns a new asynchronous generator object, which is an asynchronous iterator (see :ref:`async-iterators`).
fr: Si une expression génératrice contient une ou des expressions :keyword:`!async for` ou :keyword:`await`, elle est appelée :dfn:`expression génératrice asynchrone <asynchronous generator expression>`. Une expression génératrice asynchrone produit un nouvel objet générateur asynchrone qui est un itérateur asynchrone (voir :ref:`async-iterators`).

source: Asynchronous generator expressions were introduced.
fr: les expressions génératrices asynchrones ont été introduites.

source: Prior to Python 3.7, asynchronous generator expressions could only appear in :keyword:`async def` coroutines. Starting with 3.7, any function can use asynchronous generator expressions.
fr: Avant Python 3.7, les expressions génératrices asynchrones ne pouvaient apparaître que dans les coroutines :keyword:`async def`. À partir de la version 3.7, toute fonction peut utiliser des expressions génératrices asynchrones.

source: Yield expressions
fr: Expressions ``yield``

source: The yield expression is used when defining a :term:`generator` function or an :term:`asynchronous generator` function and thus can only be used in the body of a function definition. Using a yield expression in a function's body causes that function to be a generator function, and using it in an :keyword:`async def` function's body causes that coroutine function to be an asynchronous generator function. For example::
fr: Une expression ``yield`` est utilisée pour définir une :term:`fonction génératrice <generator>` ou une :term:`fonction génératrice asynchrone <asynchronous generator>` et ne peut donc être utilisée que dans le corps de la définition d'une fonction. L'utilisation d'une expression ``yield`` dans le corps d'une fonction entraîne que cette fonction devient une fonction génératrice et son utilisation dans le corps d'une fonction :keyword:`async def` entraine que cette fonction coroutine devient une fonction génératrice asynchrone. Par exemple ::

source: Due to their side effects on the containing scope, ``yield`` expressions are not permitted as part of the implicitly defined scopes used to implement comprehensions and generator expressions.
fr: En raison des effets de bords sur la portée contenant, les expressions ``yield`` ne sont pas autorisées dans la portée implicite utilisée dans l'implémentation des compréhensions et des expressions génératrices.

source: Yield expressions prohibited in the implicitly nested scopes used to implement comprehensions and generator expressions.
fr: Les expressions ``yield`` sont interdites dans la portée implicite imbriquée utilisée dans l'implémentation des compréhensions et des expressions génératrices.

source: Generator functions are described below, while asynchronous generator functions are described separately in section :ref:`asynchronous-generator-functions`.
fr: Les fonctions génératrices sont décrites plus loin alors que les fonctions générateurs asynchrones sont décrites séparément dans la section :ref:`asynchronous-generator-functions`.

source: All of this makes generator functions quite similar to coroutines; they yield multiple times, they have more than one entry point and their execution can be suspended. The only difference is that a generator function cannot control where the execution should continue after it yields; the control is always transferred to the generator's caller.
fr: Tout ceci rend les fonctions génératrices très similaires aux coroutines : elles produisent plusieurs objets *via* des expressions ``yield``, elles possèdent plus qu'un seul point d'entrée et leur exécution peut être suspendue. La seule différence est qu'une fonction génératrice ne peut pas contrôler où l'exécution doit se poursuivre après une instruction ``yield`` ; ce contrôle est toujours du ressort de l'appelant au générateur.

source: Yield expressions are allowed anywhere in a :keyword:`try` construct. If the generator is not resumed before it is finalized (by reaching a zero reference count or by being garbage collected), the generator-iterator's :meth:`~generator.close` method will be called, allowing any pending :keyword:`finally` clauses to execute.
fr: Les expressions ``yield`` sont autorisées partout dans un bloc :keyword:`try`. Si l'exécution du générateur ne reprend pas avant qu'il ne soit finalisé (parce que son compteur de référence est tombé à zéro ou parce qu'il est nettoyé par le ramasse-miettes), la méthode :meth:`~generator.close` du générateur-itérateur est appelée, ce qui permet l'exécution de toutes les clauses :keyword:`finally` en attente.

source: When ``yield from <expr>`` is used, the supplied expression must be an iterable. The values produced by iterating that iterable are passed directly to the caller of the current generator's methods. Any values passed in with :meth:`~generator.send` and any exceptions passed in with :meth:`~generator.throw` are passed to the underlying iterator if it has the appropriate methods. If this is not the case, then :meth:`~generator.send` will raise :exc:`AttributeError` or :exc:`TypeError`, while :meth:`~generator.throw` will just raise the passed in exception immediately.
fr: L'expression passée à ``yield from <expr>`` doit être un itérateur. Toutes les valeurs produites par cet itérateur sont directement passées à l'appelant des méthodes du générateur courant. Toute valeur passée par :meth:`~generator.send` ou toute exception passée par :meth:`~generator.throw` est transmise à l'itérateur sous-jacent s'il possède les méthodes appropriées. Si ce n'est pas le cas, alors :meth:`~generator.send` lève une :exc:`AttributeError` ou une :exc:`TypeError`, alors que :meth:`~generator.throw` ne fait que propager l'exception immédiatement.

source: When the underlying iterator is complete, the :attr:`~StopIteration.value` attribute of the raised :exc:`StopIteration` instance becomes the value of the yield expression. It can be either set explicitly when raising :exc:`StopIteration`, or automatically when the subiterator is a generator (by returning a value from the subgenerator).
fr: Quand l'itérateur sous-jacent a terminé, l'attribut :attr:`~StopIteration.value` de l'instance :exc:`StopIteration` qui a été levée devient la valeur produite par l'expression ``yield``. Elle peut être définie explicitement quand vous levez :exc:`StopIteration` ou automatiquement que le sous-itérateur est un générateur (en renvoyant une valeur par le sous-générateur).

source: Added ``yield from <expr>`` to delegate control flow to a subiterator.
fr: ``yield from <expr>`` a été ajoutée pour déléguer le contrôle du flot d'exécution à un sous-itérateur.

source: The parentheses may be omitted when the yield expression is the sole expression on the right hand side of an assignment statement.
fr: Les parenthèses peuvent être omises quand l'expression ``yield`` est la seule expression à droite de l'instruction de l'instruction d'assignation.

source: :pep:`255` - Simple Generators
fr: :pep:`255` : générateurs simples

source: The proposal for adding generators and the :keyword:`yield` statement to Python.
fr: La proposition d'ajouter à Python des générateurs et l'instruction :keyword:`yield`.

source: :pep:`342` - Coroutines via Enhanced Generators
fr: :pep:`342` -- Coroutines *via* des générateurs améliorés

source: The proposal to enhance the API and syntax of generators, making them usable as simple coroutines.
fr: Proposition d'améliorer l'API et la syntaxe des générateurs, de manière à pouvoir les utiliser comme de simples coroutines.

source: :pep:`380` - Syntax for Delegating to a Subgenerator
fr: :pep:`380` -- Syntaxe pour déléguer à un sous-générateur

source: The proposal to introduce the :token:`~python-grammar:yield_from` syntax, making delegation to subgenerators easy.
fr: Proposition d'introduire la syntaxe :token:`~python-grammar:yield_from`, de manière à déléguer facilement l'exécution à un sous-générateur.

source: :pep:`525` - Asynchronous Generators
fr: :pep:`525` : Générateurs asynchrones

source: The proposal that expanded on :pep:`492` by adding generator capabilities to coroutine functions.
fr: La proposition qui a amélioré la :pep:`492` en ajoutant des capacités de générateur pour les coroutines.

source: Generator-iterator methods
fr: Méthodes des générateurs-itérateurs

source: This subsection describes the methods of a generator iterator. They can be used to control the execution of a generator function.
fr: Cette sous-section décrit les méthodes des générateurs-itérateurs. Elles peuvent être utilisées pour contrôler l'exécution des fonctions générateurs.

source: Note that calling any of the generator methods below when the generator is already executing raises a :exc:`ValueError` exception.
fr: Notez que l'appel à une méthode ci-dessous d'un générateur alors que le générateur est déjà en cours d'exécution lève une exception :exc:`ValueError`.

source: Starts the execution of a generator function or resumes it at the last executed yield expression. When a generator function is resumed with a :meth:`~generator.__next__` method, the current yield expression always evaluates to :const:`None`. The execution then continues to the next yield expression, where the generator is suspended again, and the value of the :token:`~python-grammar:expression_list` is returned to :meth:`__next__`'s caller. If the generator exits without yielding another value, a :exc:`StopIteration` exception is raised.
fr: Démarre l'exécution d'une fonction génératrice ou la reprend à la dernière expression ``yield`` exécutée. Quand une fonction génératrice est reprise par une méthode :meth:`~generator.__next__`, l'expression ``yield`` en cours s'évalue toujours à :const:`None`. L'exécution continue ensuite jusqu'à l'expression ``yield`` suivante, où le générateur est à nouveau suspendu et la valeur de :token:`~python-grammar:expression_list` est renvoyée à la méthode :meth:`__next__` de l'appelant. Si le générateur termine sans donner une autre valeur, une exception :exc:`StopIteration` est levée.

source: This method is normally called implicitly, e.g. by a :keyword:`for` loop, or by the built-in :func:`next` function.
fr: Cette méthode est normalement appelée implicitement, par exemple par une boucle :keyword:`for` ou par la fonction native :func:`next`.

source: Resumes the execution and "sends" a value into the generator function. The *value* argument becomes the result of the current yield expression. The :meth:`send` method returns the next value yielded by the generator, or raises :exc:`StopIteration` if the generator exits without yielding another value. When :meth:`send` is called to start the generator, it must be called with :const:`None` as the argument, because there is no yield expression that could receive the value.
fr: Reprend l'exécution et « envoie » une valeur à la fonction générateur. L'argument *value* devient le résultat de l'expression ``yield`` courante. La méthode :meth:`send` renvoie la valeur suivante produite par le générateur ou lève :exc:`StopIteration` si le générateur termine sans produire de nouvelle valeur. Quand :meth:`send` est utilisée pour démarrer le générateur, elle doit avoir :const:`None` comme argument, car il n'y a aucune expression ``yield`` qui peut recevoir la valeur.

source: Raises an exception at the point where the generator was paused, and returns the next value yielded by the generator function. If the generator exits without yielding another value, a :exc:`StopIteration` exception is raised. If the generator function does not catch the passed-in exception, or raises a different exception, then that exception propagates to the caller.
fr: Lève une exception à l'endroit où le générateur est en pause et renvoie la valeur suivante produite par la fonction génératrice. Si le générateur termine sans produire de nouvelle valeur, une exception :exc:`StopIteration` est levée. Si la fonction génératrice ne gère pas l'exception passée ou lève une autre exception, alors cette exception est propagée vers l'appelant.

source: In typical use, this is called with a single exception instance similar to the way the :keyword:`raise` keyword is used.
fr: Dans son utilisation typique, elle est appelée avec une seule instance d'exception, de façon similaire à l'utilisation du mot-clé :keyword:`raise`.

source: Raises a :exc:`GeneratorExit` at the point where the generator function was paused. If the generator function then exits gracefully, is already closed, or raises :exc:`GeneratorExit` (by not catching the exception), close returns to its caller. If the generator yields a value, a :exc:`RuntimeError` is raised. If the generator raises any other exception, it is propagated to the caller. :meth:`close` does nothing if the generator has already exited due to an exception or normal exit.
fr: Lève une :exc:`GeneratorExit` à l'endroit où la fonction génératrice a été mise en pause. Si la fonction génératrice termine, est déjà fermée ou lève :exc:`GeneratorExit` (parce qu'elle ne gère pas l'exception), *close* revient vers l'appelant. Si le générateur produit une valeur, une :exc:`RuntimeError` est levée. Si le générateur lève une autre exception, elle est propagée à l'appelant. La méthode :meth:`close` ne fait rien si le générateur a déjà terminé en raison d'une exception ou d'une fin normale.

source: Examples
fr: Exemples

source: Here is a simple example that demonstrates the behavior of generators and generator functions::
fr: Voici un exemple simple qui montre le comportement des générateurs et des fonctions génératrices ::

source: For examples using ``yield from``, see :ref:`pep-380` in "What's New in Python."
fr: Pour des exemples d'utilisation de ``yield from``, lisez la :ref:`pep-380` dans « Les nouveautés de Python ».

source: Asynchronous generator functions
fr: Fonctions génératrices asynchrones

source: The presence of a yield expression in a function or method defined using :keyword:`async def` further defines the function as an :term:`asynchronous generator` function.
fr: La présence d'une expression *yield* dans une fonction ou une méthode définie en utilisant :keyword:`async def` transforme cette fonction en fonction :term:`générateur asynchrone <asynchronous generator>`.

source: When an asynchronous generator function is called, it returns an asynchronous iterator known as an asynchronous generator object. That object then controls the execution of the generator function. An asynchronous generator object is typically used in an :keyword:`async for` statement in a coroutine function analogously to how a generator object would be used in a :keyword:`for` statement.
fr: Quand une fonction génératrice asynchrone est appelée, elle renvoie un itérateur asynchrone, autrement appelé objet générateur asynchrone. Cet objet contrôle l'exécution de la fonction génératrice. Un objet générateur asynchrone est typiquement utilisé dans une instruction :keyword:`async for` à l'intérieur d'une fonction coroutine de la même manière qu'un objet générateur serait utilisé dans une instruction :keyword:`for`.

source: Calling one of the asynchronous generator's methods returns an :term:`awaitable` object, and the execution starts when this object is awaited on. At that time, the execution proceeds to the first yield expression, where it is suspended again, returning the value of :token:`~python-grammar:expression_list` to the awaiting coroutine. As with a generator, suspension means that all local state is retained, including the current bindings of local variables, the instruction pointer, the internal evaluation stack, and the state of any exception handling. When the execution is resumed by awaiting on the next object returned by the asynchronous generator's methods, the function can proceed exactly as if the yield expression were just another external call. The value of the yield expression after resuming depends on the method which resumed the execution. If :meth:`~agen.__anext__` is used then the result is :const:`None`. Otherwise, if :meth:`~agen.asend` is used, then the result will be the value passed in to that method.
fr: L'appel d'une méthode du générateur asynchrone renvoie un objet :term:`awaitable` et l'exécution commence au moment où l'on atteint une instruction ``await`` le concernant. À ce moment, l'exécution se déroule jusqu'à la première expression ``yield``, où elle est suspendue et renvoie la valeur de :token:`~python-grammar:expression_list` à la coroutine en attente. Comme pour un générateur, la suspension signifie que tous les états locaux sont conservés, y compris les liaisons des variables locales, le pointeur d'instruction, la pile d'évaluation interne et l'état de tous les gestionnaires d'exceptions. Lorsque l'exécution reprend parce que l'appelant a atteint une instruction ``await`` sur l'objet suivant retourné par les méthodes du générateur asynchrone, la fonction s'exécute exactement comme si l'expression ``yield`` n'avait été qu'un simple appel externe. La valeur de l'expression ``yield`` au moment de la reprise dépend de la méthode qui a relancé l'exécution. Si c'est :meth:`~agen.__anext__` qui a été utilisée, alors le résultat est :const:`None`. Sinon, si c'est :meth:`~agen.asend` qui a été utilisée, alors le résultat est la valeur transmise à cette méthode.

source: If an asynchronous generator happens to exit early by :keyword:`break`, the caller task being cancelled, or other exceptions, the generator's async cleanup code will run and possibly raise exceptions or access context variables in an unexpected context--perhaps after the lifetime of tasks it depends, or during the event loop shutdown when the async-generator garbage collection hook is called. To prevent this, the caller must explicitly close the async generator by calling :meth:`~agen.aclose` method to finalize the generator and ultimately detach it from the event loop.
fr: Si un générateur asynchrone se termine précipitamment en raison d'un :keyword:`break`, de l'annulation de la tâche de l'appelant ou d'une exception, le code de nettoyage du générateur asynchrone est exécuté et lève possiblement des exceptions, accède à des variables de contexte dans un contexte inattendu — peut-être parce que la tâche de laquelle il dépend est finie, ou pendant la fermeture de la boucle d'événements quand le point d'entrée du ramasse-miettes a déjà été appelé. Afin d'éviter cette situation, l'appelant doit explicitement fermer le générateur asynchrone en appelant la méthode :meth:`~agen.aclose` pour « finaliser » le générateur et le détacher de la boucle d'événements.

source: In an asynchronous generator function, yield expressions are allowed anywhere in a :keyword:`try` construct. However, if an asynchronous generator is not resumed before it is finalized (by reaching a zero reference count or by being garbage collected), then a yield expression within a :keyword:`!try` construct could result in a failure to execute pending :keyword:`finally` clauses. In this case, it is the responsibility of the event loop or scheduler running the asynchronous generator to call the asynchronous generator-iterator's :meth:`~agen.aclose` method and run the resulting coroutine object, thus allowing any pending :keyword:`!finally` clauses to execute.
fr: Dans une fonction génératrice asynchrone, les expressions ``yield`` sont autorisées n'importe où dans une construction :keyword:`try`. Cependant, si l'exécution d'un générateur asynchrone n'a pas repris avant que le générateur ne soit finalisé (parce que son compteur de référence a atteint zéro ou parce qu'il est nettoyé par le ramasse-miettes), alors une expression ``yield`` dans une construction :keyword:`!try` pourrait ne pas atteindre la clause :keyword:`finally` en attente. Dans ce cas, c'est la responsabilité de la boucle d'événements ou du programmateur exécutant le générateur asynchrone d'appeler la méthode :meth:`~agen.aclose` du générateur asynchrone et d'exécuter l'objet coroutine résultant, permettant ainsi à toute clause :keyword:`!finally` en attente d'être exécutée.

source: The expression ``yield from <expr>`` is a syntax error when used in an asynchronous generator function.
fr: L'expression ``yield from <expr>`` produit une erreur de syntaxe quand elle est utilisée dans une fonction génératrice asynchrone.

source: Asynchronous generator-iterator methods
fr: Méthodes des générateurs-itérateurs asynchrones

source: This subsection describes the methods of an asynchronous generator iterator, which are used to control the execution of a generator function.
fr: Cette sous-section décrit les méthodes des générateurs-itérateurs asynchrones. Elles sont utilisées pour contrôler l’exécution des fonctions génératrices.

source: Returns an awaitable which when run starts to execute the asynchronous generator or resumes it at the last executed yield expression. When an asynchronous generator function is resumed with an :meth:`~agen.__anext__` method, the current yield expression always evaluates to :const:`None` in the returned awaitable, which when run will continue to the next yield expression. The value of the :token:`~python-grammar:expression_list` of the yield expression is the value of the :exc:`StopIteration` exception raised by the completing coroutine. If the asynchronous generator exits without yielding another value, the awaitable instead raises a :exc:`StopAsyncIteration` exception, signalling that the asynchronous iteration has completed.
fr: Renvoie un *awaitable* qui, quand il a la main, démarre l'exécution du générateur asynchrone ou reprend son exécution à l'endroit de la dernière expression ``yield`` exécutée. Quand une fonction génératrice asynchrone est reprise par une méthode :meth:`~agen.__anext__`, l’expression ``yield`` en cours s’évalue toujours à :const:`None` dans le *awaitable* renvoyé, et elle continue son exécution jusqu’à l’expression ``yield`` suivante. La valeur de :token:`~python-grammar:expression_list` de l'expression ``yield`` est la valeur de l'exception :exc:`StopIteration` levée par la coroutine qui termine. Si le générateur asynchrone termine sans produire d'autre valeur, le *awaitable* lève une exception :exc:`StopAsyncIteration` qui signale que l'itération asynchrone est terminée.

source: This method is normally called implicitly by a :keyword:`async for` loop.
fr: Cette méthode est normalement appelée implicitement par une boucle :keyword:`async for`.
