Repository: python/python-docs-fr
Catalog: reference/expressions.po
Languages: fr

source: This chapter explains the meaning of the elements of expressions in Python.
fr: Ce chapitre explique la signification des éléments des expressions en Python.

source: **Syntax Notes:** In this and the following chapters, extended BNF notation will be used to describe syntax, not lexical analysis. When (one alternative of) a syntax rule has the form
fr: **Notes sur la syntaxe :** dans ce chapitre et le suivant, nous utilisons la notation BNF étendue pour décrire la syntaxe, pas l'analyse lexicale. Quand une règle de syntaxe est de la forme

source: and no semantics are given, the semantics of this form of ``name`` are the same as for ``othername``.
fr: et qu'aucune sémantique n'est donnée, la sémantique de ``name`` est la même que celle de ``othername``.

source: Arithmetic conversions
fr: Conversions arithmétiques

source: When a description of an arithmetic operator below uses the phrase "the numeric arguments are converted to a common type", this means that the operator implementation for built-in types works as follows:
fr: Quand la description d'un opérateur arithmétique ci-dessous utilise la phrase « les arguments numériques sont convertis vers un type commun », cela signifie que l'implémentation de l'opérateur fonctionne de la manière suivante pour les types natifs :

source: If either argument is a complex number, the other is converted to complex;
fr: Si l'un des deux arguments est du type nombre complexe, l'autre est converti en nombre complexe ;

source: otherwise, if either argument is a floating point number, the other is converted to floating point;
fr: sinon, si l'un des arguments est un nombre à virgule flottante, l'autre est converti en nombre à virgule flottante ;

source: otherwise, both must be integers and no conversion is necessary.
fr: sinon, les deux doivent être des entiers et aucune conversion n'est nécessaire.

source: Some additional rules apply for certain operators (e.g., a string as a left argument to the '%' operator). Extensions must define their own conversion behavior.
fr: Des règles supplémentaires s'appliquent pour certains opérateurs (par exemple, une chaîne comme opérande de gauche pour l'opérateur ``%``). Les extensions doivent définir leurs propres règles de conversion.

source: Atoms
fr: Atomes

source: Atoms are the most basic elements of expressions. The simplest atoms are identifiers or literals. Forms enclosed in parentheses, brackets or braces are also categorized syntactically as atoms. The syntax for atoms is:
fr: Les atomes sont les éléments de base des expressions. Les atomes les plus simples sont les identifiants et les littéraux. Les expressions entre parenthèses, crochets ou accolades sont aussi classées syntaxiquement comme des atomes. La syntaxe pour les atomes est :

source: Identifiers (Names)
fr: Identifiants (noms)

source: An identifier occurring as an atom is a name. See section :ref:`identifiers` for lexical definition and section :ref:`naming` for documentation of naming and binding.
fr: Un identifiant qui apparaît en tant qu'atome est un nom. Lisez la section :ref:`identifiers` pour la définition lexicale et la section :ref:`naming` pour la documentation sur les noms et les liaisons afférentes.

source: When the name is bound to an object, evaluation of the atom yields that object. When a name is not bound, an attempt to evaluate it raises a :exc:`NameError` exception.
fr: Quand un nom est lié à un objet, l'évaluation de l'atome produit cet objet. Quand le nom n'est pas lié, toute tentative de l'évaluer lève une exception :exc:`NameError`.

source: **Private name mangling:** When an identifier that textually occurs in a class definition begins with two or more underscore characters and does not end in two or more underscores, it is considered a :dfn:`private name` of that class. Private names are transformed to a longer form before code is generated for them. The transformation inserts the class name, with leading underscores removed and a single underscore inserted, in front of the name. For example, the identifier ``__spam`` occurring in a class named ``Ham`` will be transformed to ``_Ham__spam``. This transformation is independent of the syntactical context in which the identifier is used. If the transformed name is extremely long (longer than 255 characters), implementation defined truncation may happen. If the class name consists only of underscores, no transformation is done.
fr: **Transformation des noms privés :** lorsqu'un identificateur qui apparaît textuellement dans la définition d'une classe commence par deux (ou plus) caractères de soulignement et ne se termine pas par deux (ou plus) caractères de soulignement, il est considéré comme un :dfn:`nom privé <private name>` de cette classe. Les noms privés sont transformés en une forme plus longue avant que le code ne soit généré pour eux. La transformation insère le nom de la classe, avec les soulignés enlevés et un seul souligné inséré devant le nom. Par exemple, l'identificateur ``__spam`` apparaissant dans une classe nommée ``Ham`` est transformé en ``_Ham__spam``. Cette transformation est indépendante du contexte syntaxique dans lequel l'identificateur est utilisé. Si le nom transformé est extrêmement long (plus de 255 caractères), l'implémentation peut le tronquer. Si le nom de la classe est constitué uniquement de traits de soulignement, aucune transformation n'est effectuée.

source: Literals
fr: Littéraux

source: Python supports string and bytes literals and various numeric literals:
fr: Python gère les littéraux de chaînes de caractères, de chaînes d'octets et de plusieurs autres types numériques :

source: Evaluation of a literal yields an object of the given type (string, bytes, integer, floating point number, complex number) with the given value. The value may be approximated in the case of floating point and imaginary (complex) literals. See section :ref:`literals` for details.
fr: L'évaluation d'un littéral produit un objet du type donné (chaîne de caractères, chaîne d'octets, entier, nombre à virgule flottante, nombre complexe) avec la valeur donnée. La valeur peut être approximée dans le cas des nombres à virgule flottante et des nombres imaginaires (complexes). Reportez-vous à la section :ref:`literals` pour les détails.

source: All literals correspond to immutable data types, and hence the object's identity is less important than its value. Multiple evaluations of literals with the same value (either the same occurrence in the program text or a different occurrence) may obtain the same object or a different object with the same value.
fr: Tous les littéraux sont de types immuables et donc l'identifiant de l'objet est moins important que sa valeur. Des évaluations multiples de littéraux avec la même valeur (soit la même occurrence dans le texte du programme, soit une autre occurrence) résultent dans le même objet ou un objet différent avec la même valeur.

source: Parenthesized forms
fr: Formes parenthésées

source: A parenthesized form is an optional expression list enclosed in parentheses:
fr: Une forme parenthésée est une liste d'expressions (cette liste est en fait optionnelle) placée à l'intérieur de parenthèses :

source: A parenthesized expression list yields whatever that expression list yields: if the list contains at least one comma, it yields a tuple; otherwise, it yields the single expression that makes up the expression list.
fr: Une liste d'expressions entre parenthèses produit ce que la liste de ces expressions produirait : si la liste contient au moins une virgule, elle produit un *n*-uplet (type *n*-uplet) ; sinon, elle produit l'expression elle-même (qui constitue donc elle-même la liste d'expressions).

source: An empty pair of parentheses yields an empty tuple object. Since tuples are immutable, the same rules as for literals apply (i.e., two occurrences of the empty tuple may or may not yield the same object).
fr: Une paire de parenthèses vide produit un objet *n*-uplet vide. Comme les n-uplets sont immuables, la même règle que pour les littéraux s'applique (c'est-à-dire que deux occurrences du *n*-uplet vide peuvent, ou pas, produire le même objet).

source: Note that tuples are not formed by the parentheses, but rather by use of the comma operator. The exception is the empty tuple, for which parentheses *are* required --- allowing unparenthesized "nothing" in expressions would cause ambiguities and allow common typos to pass uncaught.
fr: Notez que les *n*-uplets ne sont pas créés par les parenthèses mais par l'utilisation de la virgule. L'exception est le *n*-uplet vide, pour lequel les parenthèses *sont requises* (autoriser que « rien » ne soit pas parenthésé dans les expressions aurait généré des ambigüités et aurait permis à certaines coquilles de passer inaperçu).

source: Displays for lists, sets and dictionaries
fr: Agencements des listes, ensembles et dictionnaires

source: For constructing a list, a set or a dictionary Python provides special syntax called "displays", each of them in two flavors:
fr: Pour construire une liste, un ensemble ou un dictionnaire, Python fournit des syntaxes spéciales dites « agencements » (*displays* en anglais), chaque agencement comportant deux variantes :

source: either the container contents are listed explicitly, or
fr: soit le contenu du conteneur est listé explicitement,

source: they are computed via a set of looping and filtering instructions, called a :dfn:`comprehension`.
fr: soit il est calculé à l'aide de la combinaison d'une boucle et d'instructions de filtrage, appelée une :dfn:`compréhension` (dans le sens de ce qui sert à définir un concept, par opposition à *extension*).

source: Common syntax elements for comprehensions are:
fr: Les compréhensions sont constituées des éléments de syntaxe communs suivants :

source: The comprehension consists of a single expression followed by at least one :keyword:`!for` clause and zero or more :keyword:`!for` or :keyword:`!if` clauses. In this case, the elements of the new container are those that would be produced by considering each of the :keyword:`!for` or :keyword:`!if` clauses a block, nesting from left to right, and evaluating the expression to produce an element each time the innermost block is reached.
fr: Une compréhension est constituée par une seule expression suivie par au moins une clause :keyword:`!for` et zéro ou plus clauses :keyword:`!for` ou :keyword:`!if`. Dans ce cas, les éléments du nouveau conteneur sont ceux qui auraient été produits si l'on avait considéré toutes les clauses :keyword:`!for` ou :keyword:`!if` comme des blocs, imbriqués de la gauche vers la droite, et évalué l'expression pour produire un élément à chaque fois que le bloc le plus imbriqué était atteint.

source: However, aside from the iterable expression in the leftmost :keyword:`!for` clause, the comprehension is executed in a separate implicitly nested scope. This ensures that names assigned to in the target list don't "leak" into the enclosing scope.
fr: Cependant, à part l'expression de l'itérable dans la clause :keyword:`!for` la plus à gauche, la compréhension est exécutée dans une portée séparée, implicitement imbriquée. Ceci assure que les noms assignés dans la liste cible ne « fuient » pas en dehors de cette portée.

source: The iterable expression in the leftmost :keyword:`!for` clause is evaluated directly in the enclosing scope and then passed as an argument to the implicitly nested scope. Subsequent :keyword:`!for` clauses and any filter condition in the leftmost :keyword:`!for` clause cannot be evaluated in the enclosing scope as they may depend on the values obtained from the leftmost iterable. For example: ``[x*y for x in range(10) for y in range(x, x+10)]``.
fr: L'expression de l'itérable dans la clause :keyword:`!for` la plus à gauche est évaluée directement dans la portée englobante puis passée en tant qu'argument à la portée implicite imbriquée. Les clauses :keyword:`!for` suivantes et les filtres conditionnels de la clause :keyword:`!for` la plus à gauche ne peuvent pas être évalués dans la portée englobante, car ils peuvent dépendre de valeurs obtenues à partir de l'itérable le plus à gauche. Par exemple : ``[x*y for x in range(10) for y in range(x, x+10)]``.

source: To ensure the comprehension always results in a container of the appropriate type, ``yield`` and ``yield from`` expressions are prohibited in the implicitly nested scope.
fr: Pour assurer que le résultat de la compréhension soit un conteneur du type approprié, les expressions ``yield`` et ``yield from`` sont interdites dans la portée implicite imbriquée.

source: Since Python 3.6, in an :keyword:`async def` function, an :keyword:`!async for` clause may be used to iterate over a :term:`asynchronous iterator`. A comprehension in an :keyword:`!async def` function may consist of either a :keyword:`!for` or :keyword:`!async for` clause following the leading expression, may contain additional :keyword:`!for` or :keyword:`!async for` clauses, and may also use :keyword:`await` expressions. If a comprehension contains either :keyword:`!async for` clauses or :keyword:`!await` expressions it is called an :dfn:`asynchronous comprehension`. An asynchronous comprehension may suspend the execution of the coroutine function in which it appears. See also :pep:`530`.
fr: Depuis Python 3.6, dans une fonction :keyword:`async def`, une clause :keyword:`!async for` peut être utilisée pour itérer sur un :term:`itérateur asynchrone <asynchronous iterator>`. Une compréhension dans une fonction :keyword:`!async def` consiste alors à avoir une clause :keyword:`!for` or :keyword:`!async for` suivie par des clauses :keyword:`!for` ou :keyword:`!async for` additionnelles facultatives et, possiblement, des expressions :keyword:`await`. Si la compréhension contient soit des clauses :keyword:`!async for`, soit des expressions :keyword:`!await`, elle est appelée :dfn:`compréhension asynchrone`. Une compréhension asynchrone peut suspendre l'exécution de la fonction coroutine dans laquelle elle apparaît. Voir aussi la :pep:`530`.

source: Asynchronous comprehensions were introduced.
fr: Les compréhensions asynchrones ont été introduites.

source: ``yield`` and ``yield from`` prohibited in the implicitly nested scope.
fr: ``yield`` et ``yield from`` sont interdites dans la portée implicite imbriquée.

source: List displays
fr: Agencements de listes

source: A list display is a possibly empty series of expressions enclosed in square brackets:
fr: Un agencement de liste est une suite (possiblement vide) d'expressions à l'intérieur de crochets :

source: A list display yields a new list object, the contents being specified by either a list of expressions or a comprehension. When a comma-separated list of expressions is supplied, its elements are evaluated from left to right and placed into the list object in that order. When a comprehension is supplied, the list is constructed from the elements resulting from the comprehension.
fr: Un agencement de liste produit un nouvel objet liste, dont le contenu est spécifié soit par une liste d'expression soit par une compréhension. Quand une liste d'expressions (dont les éléments sont séparés par des virgules) est fournie, ces éléments sont évalués de la gauche vers la droite et placés dans l'objet liste, dans cet ordre. Quand c'est une compréhension qui est fournie, la liste est construite à partir des éléments produits par la compréhension.

source: Set displays
fr: Agencements d'ensembles

source: A set display is denoted by curly braces and distinguishable from dictionary displays by the lack of colons separating keys and values:
fr: Un agencement d'ensemble (type *set*) est délimité par des accolades et se distingue de l'agencement d'un dictionnaire par le fait qu'il n'y a pas de « deux points » ``:`` pour séparer les clés et les valeurs :

source: A set display yields a new mutable set object, the contents being specified by either a sequence of expressions or a comprehension. When a comma-separated list of expressions is supplied, its elements are evaluated from left to right and added to the set object. When a comprehension is supplied, the set is constructed from the elements resulting from the comprehension.
fr: Un agencement d'ensemble produit un nouvel objet ensemble muable, le contenu étant spécifié soit par une séquence d'expression, soit par une compréhension. Quand une liste (dont les éléments sont séparés par des virgules) est fournie, ses éléments sont évalués de la gauche vers la droite et ajoutés à l'objet ensemble. Quand une compréhension est fournie, l'ensemble est construit à partir des éléments produits par la compréhension.

source: An empty set cannot be constructed with ``{}``; this literal constructs an empty dictionary.
fr: Un ensemble vide ne peut pas être construit par ``{}`` ; cette écriture construit un dictionnaire vide.

source: Dictionary displays
fr: Agencements de dictionnaires

source: A dictionary display is a possibly empty series of key/datum pairs enclosed in curly braces:
fr: Un agencement de dictionnaire est une série (possiblement vide) de couples clés-valeurs entourée par des accolades :

source: A dictionary display yields a new dictionary object.
fr: Un agencement de dictionnaire produit un nouvel objet dictionnaire.

source: If a comma-separated sequence of key/datum pairs is given, they are evaluated from left to right to define the entries of the dictionary: each key object is used as a key into the dictionary to store the corresponding datum. This means that you can specify the same key multiple times in the key/datum list, and the final dictionary's value for that key will be the last one given.
fr: Si une séquence (dont les éléments sont séparés par des virgules) de couples clés-valeurs est fournie, les couples sont évalués de la gauche vers la droite pour définir les entrées du dictionnaire : chaque objet clé est utilisé comme clé dans le dictionnaire pour stocker la donnée correspondante. Cela signifie que vous pouvez spécifier la même clé plusieurs fois dans la liste des couples clés-valeurs et, dans ce cas, la valeur finalement stockée dans le dictionnaire est la dernière donnée.

source: A double asterisk ``**`` denotes :dfn:`dictionary unpacking`. Its operand must be a :term:`mapping`. Each mapping item is added to the new dictionary. Later values replace values already set by earlier key/datum pairs and earlier dictionary unpackings.
fr: Une double astérisque ``**`` demande de :dfn:`dépaqueter le dictionnaire`. L'opérande doit être un :term:`tableau de correspondances <mapping>`. Chaque élément du tableau de correspondances est ajouté au nouveau dictionnaire. Les valeurs les plus récentes remplacent les valeurs déjà définies par des couples clés-valeurs antérieurs ou par d'autres dépaquetages de dictionnaires antérieurs.

source: Unpacking into dictionary displays, originally proposed by :pep:`448`.
fr: le dépaquetage peut se faire vers un agencement de dictionnaire, proposé à l'origine par la :pep:`448`.

source: A dict comprehension, in contrast to list and set comprehensions, needs two expressions separated with a colon followed by the usual "for" and "if" clauses. When the comprehension is run, the resulting key and value elements are inserted in the new dictionary in the order they are produced.
fr: Une compréhension de dictionnaire, au contraire des compréhensions de listes ou d'ensembles, requiert deux expressions séparées par une virgule et suivies par les clauses usuelles "for" et "if". Quand la compréhension est exécutée, les éléments clés-valeurs sont insérés dans le nouveau dictionnaire dans l'ordre dans lequel ils sont produits.

source: Restrictions on the types of the key values are listed earlier in section :ref:`types`. (To summarize, the key type should be :term:`hashable`, which excludes all mutable objects.) Clashes between duplicate keys are not detected; the last datum (textually rightmost in the display) stored for a given key value prevails.
fr: Les restrictions relatives aux types des clés sont données dans la section :ref:`types` (pour résumer, le type de la clé doit être :term:`hachable <hashable>`, ce qui exclut tous les objets muables). Les collisions entre les clés dupliquées ne sont pas détectées ; la dernière valeur (celle qui apparaît le plus à droite dans l'agencement) stockée prévaut pour une clé donnée.

source: Prior to Python 3.8, in dict comprehensions, the evaluation order of key and value was not well-defined. In CPython, the value was evaluated before the key. Starting with 3.8, the key is evaluated before the value, as proposed by :pep:`572`.
fr: Avant Python 3.8, dans les compréhensions de dictionnaires, l'ordre d'évaluation entre les clés et les valeurs n'était pas bien défini. Dans CPython, la valeur était évaluée avant la clé. À partir de la version 3.8, la clé est évaluée avant la valeur, comme proposé par la :pep:`572`.

source: Generator expressions
fr: Expressions génératrices

source: A generator expression is a compact generator notation in parentheses:
fr: Une expression génératrice est une notation concise pour un générateur, entourée de parenthèses :

source: A generator expression yields a new generator object. Its syntax is the same as for comprehensions, except that it is enclosed in parentheses instead of brackets or curly braces.
fr: Une expression génératrice produit un nouvel objet générateur. Sa syntaxe est la même que celle des compréhensions, sauf qu'elle est entourée de parenthèses au lieu de crochets ou d'accolades.

source: Variables used in the generator expression are evaluated lazily when the :meth:`~generator.__next__` method is called for the generator object (in the same fashion as normal generators). However, the iterable expression in the leftmost :keyword:`!for` clause is immediately evaluated, so that an error produced by it will be emitted at the point where the generator expression is defined, rather than at the point where the first value is retrieved. Subsequent :keyword:`!for` clauses and any filter condition in the leftmost :keyword:`!for` clause cannot be evaluated in the enclosing scope as they may depend on the values obtained from the leftmost iterable. For example: ``(x*y for x in range(10) for y in range(x, x+10))``.
fr: Les variables utilisées dans une expression génératrice sont évaluées paresseusement, au moment où la méthode :meth:`~generator.__next__` de l'objet générateur est appelée (de la même manière que pour les générateurs classiques). Cependant, l'expression de l'itérable dans la clause :keyword:`!for` la plus à gauche est immédiatement évaluée, de manière à ce qu'une erreur dans cette partie soit signalée à l'endroit où l'expression génératrice est définie plutôt qu'à l'endroit où la première valeur est récupérée. Les clauses :keyword:`!for` suivantes ne peuvent pas être évaluées dans la portée implicite imbriquée car elles peuvent dépendre de valeurs obtenues à partir de boucles :keyword:`!for` plus à gauche. Par exemple, ``(x*y for x in range(10) for y in range(x, x+10))``.

source: The parentheses can be omitted on calls with only one argument. See section :ref:`calls` for details.
fr: Les parenthèses peuvent être omises pour les appels qui ne possèdent qu'un seul argument. Voir la section :ref:`calls` pour les détails.

source: To avoid interfering with the expected operation of the generator expression itself, ``yield`` and ``yield from`` expressions are prohibited in the implicitly defined generator.
fr: Pour éviter d'interférer avec l'opération attendue de l'expression génératrice elle-même, les expressions ``yield`` et ``yield from`` sont interdites dans les générateurs définis de manière implicite.
