Repository: python/python-docs-fr
Catalog: reference/expressions.po
Languages: fr

source: Python evaluates expressions from left to right. Notice that while evaluating an assignment, the right-hand side is evaluated before the left-hand side.
fr: Python évalue les expressions de la gauche vers la droite. Remarquez que lors de l'évaluation d'une assignation, la partie droite de l'assignation est évaluée avant la partie gauche.

source: In the following lines, expressions will be evaluated in the arithmetic order of their suffixes::
fr: Dans les lignes qui suivent, les expressions sont évaluées suivant l'ordre arithmétique de leurs suffixes ::

source: Operator precedence
fr: Priorités des opérateurs

source: The following table summarizes the operator precedence in Python, from highest precedence (most binding) to lowest precedence (least binding). Operators in the same box have the same precedence. Unless the syntax is explicitly given, operators are binary. Operators in the same box group left to right (except for exponentiation, which groups from right to left).
fr: Le tableau suivant résume les priorités des opérateurs en Python, du plus prioritaire (portée la plus courte) au moins prioritaire (portée la plus grande). Les opérateurs qui sont dans la même case ont la même priorité. À moins que la syntaxe ne soit explicitement indiquée, les opérateurs sont binaires. Les opérateurs dans la même case regroupent de la gauche vers la droite (sauf pour la puissance qui regroupe de la droite vers la gauche).

source: Note that comparisons, membership tests, and identity tests, all have the same precedence and have a left-to-right chaining feature as described in the :ref:`comparisons` section.
fr: Notez que les comparaisons, les tests d'appartenance et les tests d'identifiants possèdent tous la même priorité et s'enchaînent de la gauche vers la droite comme décrit dans la section :ref:`comparisons`.

source: Operator
fr: Opérateur

source: Binding or parenthesized expression, list display, dictionary display, set display
fr: Expression de liaison ou parenthèse, affichage de liste, affichage de dictionnaire, affichage de *set*

source: ``x[index]``, ``x[index:index]``, ``x(arguments...)``, ``x.attribute``
fr: ``x[indice]``, ``x[indice:indice]``, ``x(arguments…)``, ``x.attribut``

source: Subscription, slicing, call, attribute reference
fr: indiçage, tranches, appel, référence à un attribut

source: Exponentiation [#]_
fr: Puissance [#]_

source: Positive, negative, bitwise NOT
fr: NOT (positif, négatif, bit à bit)

source: Multiplication, matrix multiplication, division, floor division, remainder [#]_
fr: Multiplication, multiplication de matrices, division, division entière, reste [#]_

source: Addition and subtraction
fr: Addition et soustraction

source: Shifts
fr: décalages

source: Bitwise AND
fr: AND (bit à bit)

source: Bitwise XOR
fr: XOR (bit à bit)

source: Bitwise OR
fr: OR (bit à bit)

source: Comparisons, including membership tests and identity tests
fr: Comparaisons, y compris les tests d'appartenance et les tests d'identifiants

source: Boolean NOT
fr: NOT (booléen)

source: Boolean AND
fr: AND (booléen)

source: Boolean OR
fr: OR (booléen)

source: Conditional expression
fr: Expressions conditionnelles

source: Lambda expression
fr: Expression lambda

source: Assignment expression
fr: Expression d'affectation

source: Footnotes
fr: Notes

source: While ``abs(x%y) < abs(y)`` is true mathematically, for floats it may not be true numerically due to roundoff. For example, and assuming a platform on which a Python float is an IEEE 754 double-precision number, in order that ``-1e-100 % 1e100`` have the same sign as ``1e100``, the computed result is ``-1e-100 + 1e100``, which is numerically exactly equal to ``1e100``. The function :func:`math.fmod` returns a result whose sign matches the sign of the first argument instead, and so returns ``-1e-100`` in this case. Which approach is more appropriate depends on the application.
fr: Bien que ``abs(x%y) < abs(y)`` soit vrai mathématiquement, ce n'est pas toujours vrai pour les nombres à virgule flottante en raison des arrondis. Par exemple, en supposant que Python tourne sur une plateforme où les *float* sont des nombres à double précision IEEE 754, afin que ``-1e-100 % 1e100`` soit du même signe que ``1e100``, le résultat calculé est ``-1e-100 + 1e100``, qui vaut exactement ``1e100`` dans ce standard. Or, la fonction :func:`math.fmod` renvoie un résultat dont le signe est le signe du premier argument, c'est-à-dire ``-1e-100`` dans ce cas. La meilleure approche dépend de l'application.

source: If x is very close to an exact integer multiple of y, it's possible for ``x//y`` to be one larger than ``(x-x%y)//y`` due to rounding. In such cases, Python returns the latter result, in order to preserve that ``divmod(x,y)[0] * y + x % y`` be very close to ``x``.
fr: Si x est très proche d'un multiple entier de y, il est possible que ``x/y`` soit supérieur de un par rapport à ``(x-x%y)//y`` en raison des arrondis. Dans de tels cas, Python renvoie le second résultat afin d'avoir ``divmod(x,y)[0] * y + x % y`` le plus proche de ``x``.

source: The Unicode standard distinguishes between :dfn:`code points` (e.g. U+0041) and :dfn:`abstract characters` (e.g. "LATIN CAPITAL LETTER A"). While most abstract characters in Unicode are only represented using one code point, there is a number of abstract characters that can in addition be represented using a sequence of more than one code point. For example, the abstract character "LATIN CAPITAL LETTER C WITH CEDILLA" can be represented as a single :dfn:`precomposed character` at code position U+00C7, or as a sequence of a :dfn:`base character` at code position U+0043 (LATIN CAPITAL LETTER C), followed by a :dfn:`combining character` at code position U+0327 (COMBINING CEDILLA).
fr: Le standard Unicode distingue les :dfn:`points codes` (*code points* en anglais, par exemple *U+0041*) et les :dfn:`caractères abstraits` (*abstract characters* en anglais, par exemple « LATIN CAPITAL LETTER A »). Bien que la plupart des caractères abstraits de l'Unicode ne sont représentés que par un seul point code, il y a un certain nombre de caractères abstraits qui peuvent être représentés par une séquence de plus qu'un point code. Par exemple, le caractère abstrait « LATIN CAPITAL LETTER C WITH CEDILLA » peut être représenté comme un unique :dfn:`caractère précomposé` au point code *U+00C7*, ou en tant que séquence d'un :dfn:`caractère de base` à la position *U+0043* (LATIN CAPITAL LETTER C) du code, suivi par un :dfn:`caractère combiné` à la position *U+0327* (*COMBINING CEDILLA*) du code.

source: The comparison operators on strings compare at the level of Unicode code points. This may be counter-intuitive to humans. For example, ``"\u00C7" == "\u0043\u0327"`` is ``False``, even though both strings represent the same abstract character "LATIN CAPITAL LETTER C WITH CEDILLA".
fr: Les opérateurs de comparaison des chaînes opèrent au niveau des points codes Unicode. Cela peut être déroutant pour des humains. Par exemple, ``"\u00C7" == "\u0043\u0327"`` renvoie ``False``, bien que les deux chaînes représentent le même caractère abstrait "LATIN CAPITAL LETTER C WITH CEDILLA".

source: To compare strings at the level of abstract characters (that is, in a way intuitive to humans), use :func:`unicodedata.normalize`.
fr: Pour comparer des chaînes au niveau des caractères abstraits (afin d'avoir quelque chose d'intuitif pour les humains), utilisez :func:`unicodedata.normalize`.

source: Due to automatic garbage-collection, free lists, and the dynamic nature of descriptors, you may notice seemingly unusual behaviour in certain uses of the :keyword:`is` operator, like those involving comparisons between instance methods, or constants. Check their documentation for more info.
fr: En raison du ramasse-miettes automatique et de la nature dynamique des descripteurs, vous pouvez être confronté à un comportement semblant bizarre lors de certaines utilisations de l'opérateur :keyword:`is`, par exemple si cela implique des comparaisons entre des méthodes d'instances ou des constantes. Allez vérifier dans la documentation pour plus d'informations.

source: The power operator ``**`` binds less tightly than an arithmetic or bitwise unary operator on its right, that is, ``2**-1`` is ``0.5``.
fr: L'opérateur puissance ``**`` est moins prioritaire qu'un opérateur unaire arithmétique ou bit à bit sur sa droite. Ainsi, ``2**-1`` vaut ``0.5``.

source: The ``%`` operator is also used for string formatting; the same precedence applies.
fr: L'opérateur ``%`` est aussi utilisé pour formater les chaînes de caractères ; il y possède la même priorité.
