Repository: python/python-docs-fr
Catalog: reference/expressions.po
Languages: fr

source: The behavior of the default equality comparison, that instances with different identities are always unequal, may be in contrast to what types will need that have a sensible definition of object value and value-based equality. Such types will need to customize their comparison behavior, and in fact, a number of built-in types have done that.
fr: Le comportement du test d'égalité par défaut, à savoir que les instances avec des identités différentes ne sont jamais égales, peut être en contradiction avec les types qui définissent la « valeur » d'un objet et se basent sur cette « valeur » pour l'égalité. De tels types doivent personnaliser leurs tests de comparaison et, en fait, c'est ce qu'ont fait un certain nombre de types natifs.

source: The following list describes the comparison behavior of the most important built-in types.
fr: La liste suivante décrit le comportement des tests d'égalité pour les types natifs les plus importants.

source: Numbers of built-in numeric types (:ref:`typesnumeric`) and of the standard library types :class:`fractions.Fraction` and :class:`decimal.Decimal` can be compared within and across their types, with the restriction that complex numbers do not support order comparison. Within the limits of the types involved, they compare mathematically (algorithmically) correct without loss of precision.
fr: Beaucoup de types numériques natifs (:ref:`typesnumeric`) et de types de la bibliothèque standard :class:`fractions.Fraction` ainsi que :class:`decimal.decimal` peuvent être comparés, au sein de leur propre classe ou avec d'autres objets de classes différentes. Une exception notable concerne les nombres complexes qui ne gèrent pas la relation d'ordre. Dans les limites des types concernés, la comparaison mathématique équivaut à la comparaison algorithmique, sans perte de précision.

source: The not-a-number values ``float('NaN')`` and ``decimal.Decimal('NaN')`` are special. Any ordered comparison of a number to a not-a-number value is false. A counter-intuitive implication is that not-a-number values are not equal to themselves. For example, if ``x = float('NaN')``, ``3 < x``, ``x < 3`` and ``x == x`` are all false, while ``x != x`` is true. This behavior is compliant with IEEE 754.
fr: Les valeurs non numériques ``float('NaN')`` et ``decimal.Decimal('NaN')`` sont spéciales : toute comparaison entre un nombre et une valeur non numérique est fausse. Une implication contre-intuitive à cela est que les valeurs non numériques ne sont pas égales à elles-mêmes. Par exemple, avec ``x = float('NaN')``, les expressions ``3 < x``, ``x < 3`` et ``x == x`` sont toutes fausses, mais l’expression ``x != x`` est vraie. Ce comportement est en accord avec IEEE 754.

source: ``None`` and ``NotImplemented`` are singletons. :PEP:`8` advises that comparisons for singletons should always be done with ``is`` or ``is not``, never the equality operators.
fr: ``None`` et ``NotImplemented`` sont des singletons. :PEP:`8` conseille de toujours comparer les singletons en utilisant soit ``is`` soit ``is not``, jamais les autres opérateurs.

source: Binary sequences (instances of :class:`bytes` or :class:`bytearray`) can be compared within and across their types. They compare lexicographically using the numeric values of their elements.
fr: Les séquences binaires (instances du type :class:`bytes` ou :class:`bytearray`) peuvent être comparées au sein de la classe et entre classes. La comparaison est lexicographique, en utilisant la valeur numérique des éléments.

source: Strings (instances of :class:`str`) compare lexicographically using the numerical Unicode code points (the result of the built-in function :func:`ord`) of their characters. [#]_
fr: Les chaînes de caractères (instances de :class:`str`) respectent l'ordre lexicographique en utilisant la valeur Unicode (le résultat de la fonction native :func:`ord`) des caractères [#]_.

source: Strings and binary sequences cannot be directly compared.
fr: Les chaînes de caractères et les séquences binaires ne peuvent pas être comparées directement.

source: Sequences (instances of :class:`tuple`, :class:`list`, or :class:`range`) can be compared only within each of their types, with the restriction that ranges do not support order comparison. Equality comparison across these types results in inequality, and ordering comparison across these types raises :exc:`TypeError`.
fr: Les séquences (instances de :class:`tuple`, :class:`list` ou :class:`range`) peuvent être comparées uniquement entre instances de même type, en sachant que les intervalles (*range*) ne gèrent pas la relation d'ordre. Le test d'égalité entre ces types renvoie faux et une comparaison entre instances de types différents lève une :exc:`TypeError`.

source: Sequences compare lexicographically using comparison of corresponding elements. The built-in containers typically assume identical objects are equal to themselves. That lets them bypass equality tests for identical objects to improve performance and to maintain their internal invariants.
fr: Les séquences se comparent lexicographiquement en comparant les éléments correspondants. Les conteneurs natifs supposent généralement que les objets identiques sont égaux à eux-mêmes. Cela leur permet d'économiser les tests d’égalité pour des objets identiques afin d’améliorer les performances et de conserver leurs invariants internes.

source: Lexicographical comparison between built-in collections works as follows:
fr: L'ordre lexicographique pour les collections natives fonctionne comme suit :

source: For two collections to compare equal, they must be of the same type, have the same length, and each pair of corresponding elements must compare equal (for example, ``[1,2] == (1,2)`` is false because the type is not the same).
fr: Deux collections sont égales si elles sont du même type, ont la même longueur et si les éléments correspondants de chaque paire sont égaux. Par exemple, ``[1,2] == (1,2)`` est faux car les types sont différents.

source: Collections that support order comparison are ordered the same as their first unequal elements (for example, ``[1,2,x] <= [1,2,y]`` has the same value as ``x <= y``). If a corresponding element does not exist, the shorter collection is ordered first (for example, ``[1,2] < [1,2,3]`` is true).
fr: Les collections qui gèrent la relation d'ordre sont ordonnées comme leur premier élément différent (par exemple, ``[1,2,x] <= [1,2,y]`` a la même valeur que ``x <= y``). Si un élément n'a pas de correspondant, la collection la plus courte est la plus petite (par exemple, ``[1,2] < [1,2,3]`` est vrai).

source: Order comparisons (``<``, ``>``, ``<=``, and ``>=``) raise :exc:`TypeError`.
fr: Les comparaisons (``<``, ``>``, ``<=`` et ``>=``) lèvent :exc:`TypeError`.

source: Sets (instances of :class:`set` or :class:`frozenset`) can be compared within and across their types.
fr: Les ensembles (instances de :class:`set` ou :class:`frozenset`) peuvent être comparés au sein de leur propre type et entre types différents.

source: They define order comparison operators to mean subset and superset tests. Those relations do not define total orderings (for example, the two sets ``{1,2}`` and ``{2,3}`` are not equal, nor subsets of one another, nor supersets of one another). Accordingly, sets are not appropriate arguments for functions which depend on total ordering (for example, :func:`min`, :func:`max`, and :func:`sorted` produce undefined results given a list of sets as inputs).
fr: Les opérateurs d'inclusion et de sur-ensemble sont définis. Ces relations ne sont pas des relations d'ordre total (par exemple, les deux ensembles ``{1,2}`` et ``{2,3}`` ne sont pas égaux, l'un n'est pas inclus dans l'autre, l'un n'est pas un sur-ensemble de l'autre). Ainsi, les ensembles ne sont pas des arguments appropriés pour les fonctions qui dépendent d'un ordre total (par exemple, les fonctions :func:`min`, :func:`max` et :func:`sorted` produisent des résultats indéfinis si on leur donne des listes d'ensembles en entrée).

source: Comparison of sets enforces reflexivity of its elements.
fr: La comparaison des ensembles met en œuvre la réflexivité des éléments.

source: Most other built-in types have no comparison methods implemented, so they inherit the default comparison behavior.
fr: La plupart des autres types natifs n'implémentent pas de méthodes de comparaisons, ils héritent donc du comportement par défaut.

source: User-defined classes that customize their comparison behavior should follow some consistency rules, if possible:
fr: Les classes allogènes qui particularisent les opérations de comparaison doivent, si possible, respecter quelques règles pour la cohérence :

source: Equality comparison should be reflexive. In other words, identical objects should compare equal:
fr: Le test d'égalité doit être réflexif. En d'autres termes, des objets identiques doivent être égaux :

source: ``x is y`` implies ``x == y``
fr: ``x is y`` implique ``x == y``

source: Comparison should be symmetric. In other words, the following expressions should have the same result:
fr: La comparaison doit être symétrique. En d'autres termes, les expressions suivantes doivent donner le même résultat :

source: ``x == y`` and ``y == x``
fr: ``x == y`` et ``y == x``

source: ``x != y`` and ``y != x``
fr: ``x != y`` et ``y != x``

source: ``x < y`` and ``y > x``
fr: ``x < y`` et ``y > x``

source: ``x <= y`` and ``y >= x``
fr: ``x <= y`` et ``y >= x``

source: Comparison should be transitive. The following (non-exhaustive) examples illustrate that:
fr: La comparaison doit être transitive. Les exemples suivants (liste non exhaustive) illustrent ce concept :

source: ``x > y and y > z`` implies ``x > z``
fr: ``x > y and y > z`` implique ``x > z``

source: ``x < y and y <= z`` implies ``x < z``
fr: ``x < y and y <= z`` implique ``x < z``

source: Inverse comparison should result in the boolean negation. In other words, the following expressions should have the same result:
fr: Si vous inversez la comparaison, cela doit en produire la négation booléenne. En d'autres termes, les expressions suivantes doivent produire le même résultat :

source: ``x == y`` and ``not x != y``
fr: ``x == y`` et ``not x != y``

source: ``x < y`` and ``not x >= y`` (for total ordering)
fr: ``x < y`` et ``not x >= y`` (pour une relation d'ordre total)

source: ``x > y`` and ``not x <= y`` (for total ordering)
fr: ``x > y`` et ``not x <= y`` (pour une relation d'ordre total)

source: The last two expressions apply to totally ordered collections (e.g. to sequences, but not to sets or mappings). See also the :func:`~functools.total_ordering` decorator.
fr: Ces deux dernières expressions s'appliquent pour les collections totalement ordonnées (par exemple, les séquences mais pas les ensembles ou les tableaux de correspondances). Regardez aussi le décorateur :func:`~functools.total_ordering`.

source: The :func:`hash` result should be consistent with equality. Objects that are equal should either have the same hash value, or be marked as unhashable.
fr: Le résultat de :func:`hash` doit être cohérent avec l'égalité. Les objets qui sont égaux doivent avoir la même empreinte ou être marqués comme non-hachables.

source: Python does not enforce these consistency rules. In fact, the not-a-number values are an example for not following these rules.
fr: Python ne vérifie pas ces règles de cohérence. En fait, l'utilisation de valeurs non numériques est un exemple de non-respect de ces règles.

source: Membership test operations
fr: Opérations de tests d’appartenance à un ensemble

source: The operators :keyword:`in` and :keyword:`not in` test for membership. ``x in s`` evaluates to ``True`` if *x* is a member of *s*, and ``False`` otherwise. ``x not in s`` returns the negation of ``x in s``. All built-in sequences and set types support this as well as dictionary, for which :keyword:`!in` tests whether the dictionary has a given key. For container types such as list, tuple, set, frozenset, dict, or collections.deque, the expression ``x in y`` is equivalent to ``any(x is e or x == e for e in y)``.
fr: Les opérateurs :keyword:`in` et :keyword:`not in` testent l’appartenance. ``x in s`` s’évalue à ``True`` si *x* appartient à *s* et à ``False`` sinon. ``x not in s`` renvoie la négation de ``x in s``. Tous les types séquences et ensembles natifs gèrent ces opérateurs, ainsi que les dictionnaires pour lesquels :keyword:`!in` teste si dictionnaire possède une clé donnée. Pour les types conteneurs tels que les listes, *n*-uplets (*tuple*), ensembles (*set*), ensembles figés (*frozen set*), dictionnaires (*dict*) ou *collections.deque*, l’expression ``x in y`` est équivalente à ``any(x is e or x == e for e in y)``.

source: For the string and bytes types, ``x in y`` is ``True`` if and only if *x* is a substring of *y*. An equivalent test is ``y.find(x) != -1``. Empty strings are always considered to be a substring of any other string, so ``"" in "abc"`` will return ``True``.
fr: Pour les chaînes de caractères et chaînes d'octets, ``x in y`` vaut ``True`` si et seulement si *x* est une sous-chaîne de *y*. Un test équivalent est ``y.find(x) != -1``. Une chaîne vide est considérée comme une sous-chaîne de toute autre chaîne, ainsi ``"" in "abc"`` renvoie ``True``.

source: For user-defined classes which define the :meth:`__contains__` method, ``x in y`` returns ``True`` if ``y.__contains__(x)`` returns a true value, and ``False`` otherwise.
fr: Pour les classes allogènes qui définissent la méthode :meth:`__contains__`, ``x in y`` renvoie ``True`` si ``y.__contains__(x)`` renvoie vrai, et ``False`` sinon.

source: For user-defined classes which do not define :meth:`__contains__` but do define :meth:`__iter__`, ``x in y`` is ``True`` if some value ``z``, for which the expression ``x is z or x == z`` is true, is produced while iterating over ``y``. If an exception is raised during the iteration, it is as if :keyword:`in` raised that exception.
fr: Pour les classes allogènes qui ne définissent pas :meth:`__contains__` mais qui définissent :meth:`__iter__`, ``x in y`` vaut ``True`` s'il existe une valeur ``z`` telle que l'expression ``x is z or x == z`` renvoie vrai lors de l'itération sur ``y``. Si une exception est levée pendant l'itération, c'est comme si :keyword:`in` avait levé cette exception.

source: Lastly, the old-style iteration protocol is tried: if a class defines :meth:`__getitem__`, ``x in y`` is ``True`` if and only if there is a non-negative integer index *i* such that ``x is y[i] or x == y[i]``, and no lower integer index raises the :exc:`IndexError` exception. (If any other exception is raised, it is as if :keyword:`in` raised that exception).
fr: Enfin, le protocole d'itération « à l'ancienne » est essayé : si la classe définit :meth:`__getitem__`, ``x in y`` est ``True`` si et seulement si il existe un entier positif ou nul *i*, représentant l'indice, tel que ``x is y[i] or x == y[i]`` et qu'aucun indice inférieur ne lève d'exception :exc:`IndexError` (si toute autre exception est levée, c'est comme si :keyword:`in` avait levé cette exception).

source: The operator :keyword:`not in` is defined to have the inverse truth value of :keyword:`in`.
fr: L'opérateur :keyword:`not in` est défini comme produisant le contraire de :keyword:`in`.

source: Identity comparisons
fr: Comparaisons d'identifiants

source: The operators :keyword:`is` and :keyword:`is not` test for an object's identity: ``x is y`` is true if and only if *x* and *y* are the same object. An Object's identity is determined using the :meth:`id` function. ``x is not y`` yields the inverse truth value. [#]_
fr: Les opérateurs :keyword:`is` et :keyword:`is not` testent l'égalité des identifiants des objets : ``x is y`` est vrai si et seulement si *x* et *y* sont le même objet. L'identifiant d'un objet est déterminé en utilisant la fonction :meth:`id`. ``x is not y`` renvoie le résultat contraire de l'égalité des identifiants [#]_.

source: Boolean operations
fr: Opérations booléennes

source: In the context of Boolean operations, and also when expressions are used by control flow statements, the following values are interpreted as false: ``False``, ``None``, numeric zero of all types, and empty strings and containers (including strings, tuples, lists, dictionaries, sets and frozensets). All other values are interpreted as true. User-defined objects can customize their truth value by providing a :meth:`__bool__` method.
fr: Dans le contexte des opérations booléennes et quand des expressions sont utilisées par des instructions de contrôle du flux d'exécution, les valeurs suivantes sont considérées comme fausses : ``False``, ``None``, zéro quel que soit le type, la chaîne vide et tout conteneur vide (y compris les chaînes, *n*-uplets, listes, dictionnaires, ensembles, ensembles figés). Toutes les autres valeurs sont considérées comme vraies. Les objets allogènes peuvent personnaliser leur table de vérité en implémentant une méthode :meth:`__bool__`.

source: The operator :keyword:`not` yields ``True`` if its argument is false, ``False`` otherwise.
fr: L'opérateur :keyword:`not` produit ``True`` si son argument est faux, ``False`` sinon.

source: The expression ``x and y`` first evaluates *x*; if *x* is false, its value is returned; otherwise, *y* is evaluated and the resulting value is returned.
fr: L'expression ``x and y`` commence par évaluer *x* ; si *x* est faux, sa valeur est renvoyée ; sinon, *y* est évalué et la valeur résultante est renvoyée.

source: The expression ``x or y`` first evaluates *x*; if *x* is true, its value is returned; otherwise, *y* is evaluated and the resulting value is returned.
fr: L'expression ``x or y`` commence par évaluer *x* ; si *x* est vrai, sa valeur est renvoyée ; sinon, *y* est évalué et la valeur résultante est renvoyée.

source: Note that neither :keyword:`and` nor :keyword:`or` restrict the value and type they return to ``False`` and ``True``, but rather return the last evaluated argument. This is sometimes useful, e.g., if ``s`` is a string that should be replaced by a default value if it is empty, the expression ``s or 'foo'`` yields the desired value. Because :keyword:`not` has to create a new value, it returns a boolean value regardless of the type of its argument (for example, ``not 'foo'`` produces ``False`` rather than ``''``.)
fr: Notez que ni :keyword:`and` ni :keyword:`or` ne restreignent la valeur et le type qu'ils renvoient à ``False`` et ``True`` : ils renvoient le dernier argument évalué. Ceci peut être utile, par exemple : si une chaîne ``s`` doit être remplacée par une valeur par défaut si elle est vide, l'expression ``s or 'truc'`` produit la valeur voulue. Comme :keyword:`not` doit créer une nouvelle valeur, il renvoie une valeur booléenne quel que soit le type de son argument (par exemple, ``not 'truc'`` produit ``False`` plutôt que ``''``.

source: Assignment expressions
fr: Expressions d'affectation

source: An assignment expression (sometimes also called a "named expression" or "walrus") assigns an :token:`~python-grammar:expression` to an :token:`~python-grammar:identifier`, while also returning the value of the :token:`~python-grammar:expression`.
fr: Une expression d'affectation (parfois aussi appelée « expression nommée » ou « expression morse ») affecte l':token:`expression <~python-grammar:expression>` à un :token:`identifiant<~python-grammar:identifier>` et renvoie la valeur de l':token:`~python-grammar:expression`.

source: One common use case is when handling matched regular expressions:
fr: Une utilisation classique concerne les correspondances d'expressions rationnelles :

source: Or, when processing a file stream in chunks:
fr: Ou lorsqu'on traite le contenu d'un fichier par morceaux :

source: See :pep:`572` for more details about assignment expressions.
fr: Voir la :pep:`572` pour plus de détails sur les expressions d’affectation.

source: Conditional expressions
fr: Expressions conditionnelles

source: Conditional expressions (sometimes called a "ternary operator") have the lowest priority of all Python operations.
fr: Les expressions conditionnelles (parfois appelées « opérateur ternaire ») sont les moins prioritaires de toutes les opérations Python.

source: The expression ``x if C else y`` first evaluates the condition, *C* rather than *x*. If *C* is true, *x* is evaluated and its value is returned; otherwise, *y* is evaluated and its value is returned.
fr: L'expression ``x if C else y`` commence par évaluer la condition *C*. Si *C* est vrai, alors *x* est évalué et sa valeur est renvoyée ; sinon, *y* est évalué et sa valeur est renvoyée.

source: See :pep:`308` for more details about conditional expressions.
fr: Voir la :pep:`308` pour plus de détails sur les expressions conditionnelles.

source: Lambdas
fr: Expressions lambda

source: Lambda expressions (sometimes called lambda forms) are used to create anonymous functions. The expression ``lambda parameters: expression`` yields a function object. The unnamed object behaves like a function object defined with:
fr: Les expressions lambda sont utilisées pour créer des fonctions anonymes. L'expression ``lambda parameters: expression`` produit un objet fonction. Cet objet anonyme se comporte comme un objet fonction défini par :

source: See section :ref:`function` for the syntax of parameter lists. Note that functions created with lambda expressions cannot contain statements or annotations.
fr: Voir la section :ref:`function` pour la syntaxe des listes de paramètres. Notez que les fonctions créées par des expressions lambda ne peuvent pas contenir d'instructions ou d'annotations.

source: Expression lists
fr: Listes d'expressions

source: Except when part of a list or set display, an expression list containing at least one comma yields a tuple. The length of the tuple is the number of expressions in the list. The expressions are evaluated from left to right.
fr: Sauf lorsqu'elle fait partie d'un agencement de liste ou d'ensemble, une liste d'expressions qui contient au moins une virgule produit un *n*-uplet. La longueur du *n*-uplet est le nombre d'expressions dans la liste. Les expressions sont évaluées de la gauche vers la droite.

source: An asterisk ``*`` denotes :dfn:`iterable unpacking`. Its operand must be an :term:`iterable`. The iterable is expanded into a sequence of items, which are included in the new tuple, list, or set, at the site of the unpacking.
fr: Un astérisque ``*`` indique :dfn:`dépaquetage d'itérable` (*iterable unpacking* en anglais). Son opérande doit être un :term:`iterable`. L'itérable est développé en une séquence d'éléments qui sont inclus dans un nouvel objet *n*-uplet, liste ou ensemble à l'emplacement du dépaquetage.

source: Iterable unpacking in expression lists, originally proposed by :pep:`448`.
fr: dépaquetage d'itérables dans les listes d'expressions, proposé à l'origine par la :pep:`448`.

source: The trailing comma is required only to create a single tuple (a.k.a. a *singleton*); it is optional in all other cases. A single expression without a trailing comma doesn't create a tuple, but rather yields the value of that expression. (To create an empty tuple, use an empty pair of parentheses: ``()``.)
fr: La virgule finale est nécessaire pour créer un singleton (c'est-à-dire un n-uplet composé d'un seul élément) : elle est optionnelle dans tous les autres cas. Une expression seule sans virgule finale ne crée pas un *n*-uplet mais produit la valeur de cette expression (pour créer un *n*-uplet vide, utilisez une paire de parenthèses vide : ``()``).

source: Evaluation order
fr: Ordre d'évaluation
