Repository: python/python-docs-fr
Catalog: reference/expressions.po
Languages: fr

source: Returns an awaitable which when run resumes the execution of the asynchronous generator. As with the :meth:`~generator.send()` method for a generator, this "sends" a value into the asynchronous generator function, and the *value* argument becomes the result of the current yield expression. The awaitable returned by the :meth:`asend` method will return the next value yielded by the generator as the value of the raised :exc:`StopIteration`, or raises :exc:`StopAsyncIteration` if the asynchronous generator exits without yielding another value. When :meth:`asend` is called to start the asynchronous generator, it must be called with :const:`None` as the argument, because there is no yield expression that could receive the value.
fr: Renvoie un *awaitable* qui, lorsqu'il a la main, reprend l'exécution du générateur asynchrone. Comme pour la méthode :meth:`~generator.send()` d'un générateur, elle « envoie » une valeur *value* à la fonction générateur asynchrone et cet argument devient le résultat de l'expression ``yield`` courante. Le *awaitable* renvoyé par la méthode :meth:`asend` renvoie la valeur suivante produite par le générateur comme valeur de l'exception :exc:`StopIteration` levée ou lève :exc:`StopAsyncIteration` si le générateur asynchrone termine sans produire de nouvelle valeur. Quand :meth:`asend` est appelée pour démarrer le générateur asynchrone, l'argument doit être :const:`None` car il n'y a pas d'expression ``yield`` pour recevoir la valeur.

source: Returns an awaitable that raises an exception of type ``type`` at the point where the asynchronous generator was paused, and returns the next value yielded by the generator function as the value of the raised :exc:`StopIteration` exception. If the asynchronous generator exits without yielding another value, a :exc:`StopAsyncIteration` exception is raised by the awaitable. If the generator function does not catch the passed-in exception, or raises a different exception, then when the awaitable is run that exception propagates to the caller of the awaitable.
fr: Renvoie un *awaitable* qui lève une exception du type ``type`` à l'endroit où le générateur asynchrone a été mis en pause et renvoie la valeur suivante produite par la fonction génératrice comme valeur de l'exception :exc:`StopIteration` qui a été levée. Si le générateur asynchrone termine sans produire de nouvelle valeur, une exception :exc:`StopAsyncIteration` est levée par le *awaitable*. Si la fonction génératrice ne traite pas l'exception reçue ou lève une autre exception alors, quand le *awaitable* est lancé, cette exception est propagée vers l'appelant du *awaitable*.

source: Returns an awaitable that when run will throw a :exc:`GeneratorExit` into the asynchronous generator function at the point where it was paused. If the asynchronous generator function then exits gracefully, is already closed, or raises :exc:`GeneratorExit` (by not catching the exception), then the returned awaitable will raise a :exc:`StopIteration` exception. Any further awaitables returned by subsequent calls to the asynchronous generator will raise a :exc:`StopAsyncIteration` exception. If the asynchronous generator yields a value, a :exc:`RuntimeError` is raised by the awaitable. If the asynchronous generator raises any other exception, it is propagated to the caller of the awaitable. If the asynchronous generator has already exited due to an exception or normal exit, then further calls to :meth:`aclose` will return an awaitable that does nothing.
fr: Renvoie un *awaitable* qui, quand il s'exécute, lève une exception :exc:`GeneratorExit` dans la fonction génératrice asynchrone à l'endroit où le générateur était en pause. Si la fonction génératrice asynchrone termine normalement, est déjà fermée ou lève :exc:`GeneratorExit` (parce qu'elle ne gère pas l'exception), alors le *awaitable* renvoyé lève une exception :exc:`StopIteration`. Tout nouveau *awaitable* produit par un appel postérieur au générateur asynchrone lève une exception :exc:`StopAsyncIteration`. Si le générateur asynchrone produit une valeur, une :exc:`RuntimeError` est levée par le *awaitable*. Si le générateur asynchrone lève une autre exception, elle est propagée à l'appelant du *awaitable*. Si le générateur asynchrone a déjà terminé (soit par une exception, soit normalement), alors tout nouvel appel à :meth:`aclose` renvoie un *awaitable* qui ne fait rien.

source: Primaries
fr: Primaires

source: Primaries represent the most tightly bound operations of the language. Their syntax is:
fr: Les primaires (*primary* dans la grammaire formelle ci-dessous) représentent les opérations qui se lient au plus proche dans le langage. Leur syntaxe est :

source: Attribute references
fr: Références à des attributs

source: An attribute reference is a primary followed by a period and a name:
fr: Une référence à un attribut (*attributeref* dans la grammaire formelle ci-dessous) est une primaire suivie par un point et un nom :

source: The primary must evaluate to an object of a type that supports attribute references, which most objects do. This object is then asked to produce the attribute whose name is the identifier. This production can be customized by overriding the :meth:`__getattr__` method. If this attribute is not available, the exception :exc:`AttributeError` is raised. Otherwise, the type and value of the object produced is determined by the object. Multiple evaluations of the same attribute reference may yield different objects.
fr: La primaire doit s'évaluer à un objet d'un type qui gère les références aux attributs, ce qui est le cas de la plupart des objets. Cet objet doit alors produire l'attribut dont le nom est « identifier ». Cette production peut être personnalisée en surchargeant la méthode :meth:`__getattr__`. Si l'attribut n'est pas disponible, une exception :exc:`AttributeError` est levée. Sinon, le type et la valeur de l'objet produit sont déterminés par l'objet. Plusieurs évaluations successives d'une référence à un même attribut peuvent produire différents objets.

source: Subscriptions
fr: Sélections

source: The subscription of an instance of a :ref:`container class <sequence-types>` will generally select an element from the container. The subscription of a :term:`generic class <generic type>` will generally return a :ref:`GenericAlias <types-genericalias>` object.
fr: L'indiçage d'une instance de :ref:`classe containeur <sequence-types>` sélectionne généralement un élément du conteneur. L'indiçage d'une :term:`classe générique <generic type>` renvoie généralement un objet :ref:`GenericAlias <types-genericalias>`.

source: When an object is subscripted, the interpreter will evaluate the primary and the expression list.
fr: Lorsqu'on accède à l'indice d'un objet, l'interpréteur évalue la primaire et la liste d'expressions.

source: The primary must evaluate to an object that supports subscription. An object may support subscription through defining one or both of :meth:`~object.__getitem__` and :meth:`~object.__class_getitem__`. When the primary is subscripted, the evaluated result of the expression list will be passed to one of these methods. For more details on when ``__class_getitem__`` is called instead of ``__getitem__``, see :ref:`classgetitem-versus-getitem`.
fr: L'évaluation de la primaire doit produire un objet qui gère l'indiçage. Un objet est susceptible de gérer l'indiçage s'il définit la ou les deux méthodes :meth:`~object.__getitem__` et :meth:`~object.__class_getitem__`. Quand on spécifie un indice du primaire, le résultat de l'évaluation de la liste d'expression est passé à l'une de ces méthodes. Pour plus de détails sur le choix de ``__class_getitem__`` ou ``__getitem__`` pour l'appel, lisez :ref:`classgetitem-versus-getitem`.

source: If the expression list contains at least one comma, it will evaluate to a :class:`tuple` containing the items of the expression list. Otherwise, the expression list will evaluate to the value of the list's sole member.
fr: Si la liste d'expressions contient au moins une virgule, elle est considérée comme un :class:`n-uplet <tuple>` contenant les éléments de la liste d'expressions. Sinon, la liste d'expressions est évaluée à la valeur du seul membre de la liste.

source: For built-in objects, there are two types of objects that support subscription via :meth:`~object.__getitem__`:
fr: Pour les objets natifs, deux types d'objets gèrent la sélection *via* :meth:`~object.__getitem__` :

source: Mappings. If the primary is a :term:`mapping`, the expression list must evaluate to an object whose value is one of the keys of the mapping, and the subscription selects the value in the mapping that corresponds to that key. An example of a builtin mapping class is the :class:`dict` class.
fr: Si la primaire est un :term:`tableau de correspondances <mapping>`, la liste d'expressions (*expression_list* dans la grammaire formelle ci-dessous) doit pouvoir être évaluée comme un objet dont la valeur est une des clés du tableau de correspondances et la sélection désigne la valeur qui correspond à cette clé. Un exemple de classe implémentant le concept de tableau de correspondances est la classe :class:`dict`.

source: Sequences. If the primary is a :term:`sequence`, the expression list must evaluate to an :class:`int` or a :class:`slice` (as discussed in the following section). Examples of builtin sequence classes include the :class:`str`, :class:`list` and :class:`tuple` classes.
fr: Si la primaire est une :term:`séquence <sequence>`, la liste d'expressions (*expression_list* dans la grammaire) doit pouvoir être évaluée comme un :class:`entier <int>` ou une :class:`tranche <slice>` (comme expliqué dans la section suivante). Des exemples de classes natives implémentant le concept de séquence sont les :class:`chaînes <str>`, :class:`listes <list>` et les :class:`n-uplets <tuple>`.

source: The formal syntax makes no special provision for negative indices in :term:`sequences <sequence>`. However, built-in sequences all provide a :meth:`~object.__getitem__` method that interprets negative indices by adding the length of the sequence to the index so that, for example, ``x[-1]`` selects the last item of ``x``. The resulting value must be a nonnegative integer less than the number of items in the sequence, and the subscription selects the item whose index is that value (counting from zero). Since the support for negative indices and slicing occurs in the object's :meth:`__getitem__` method, subclasses overriding this method will need to explicitly add that support.
fr: La syntaxe formelle ne traite pas des cas d'indices négatifs dans les :term:`séquences <sequence>` ; cependant, toutes les séquences natives possèdent une méthode :meth:`~object.__getitem__` qui interprète les indices négatifs en ajoutant la longueur de la séquence à l'indice (de manière à ce que ``x[-1]`` sélectionne le dernier élément de ``x``). La valeur résultante doit être un entier positif ou nul, inférieur au nombre d'éléments dans la séquence ; la sélection désigne alors l'élément dont l'indice est cette valeur (en comptant à partir de zéro). Comme la gestion des indices négatifs et des tranches est faite par la méthode :meth:`__getitem__`, les sous-classes qui surchargent cette méthode doivent aussi savoir les gérer, de manière explicite.

source: A :class:`string <str>` is a special kind of sequence whose items are *characters*. A character is not a separate data type but a string of exactly one character.
fr: Une :class:`chaîne <str>` est une espèce particulière de séquence dont les éléments sont des *caractères*. Un caractère n'est pas un type en tant que tel, c'est une chaîne de longueur un.

source: Slicings
fr: Tranches

source: A slicing selects a range of items in a sequence object (e.g., a string, tuple or list). Slicings may be used as expressions or as targets in assignment or :keyword:`del` statements. The syntax for a slicing:
fr: Une tranche (*slicing* dans la grammaire formelle ci-dessous) sélectionne un intervalle d'éléments d'un objet séquence (par exemple une chaîne, un n-uplet ou une liste, respectivement les types *string*, *tuple* et *list*). Les tranches peuvent être utilisées comme des expressions ou des cibles dans les assignations ou les instructions :keyword:`del`. La syntaxe est la suivante :

source: There is ambiguity in the formal syntax here: anything that looks like an expression list also looks like a slice list, so any subscription can be interpreted as a slicing. Rather than further complicating the syntax, this is disambiguated by defining that in this case the interpretation as a subscription takes priority over the interpretation as a slicing (this is the case if the slice list contains no proper slice).
fr: Il existe une ambigüité dans la syntaxe formelle ci-dessus : tout ce qui ressemble à une liste d'expressions (*expression_list* vue avant) ressemble aussi à une liste de tranches (*slice_list* dans la grammaire ci-dessus). En conséquence, toute sélection (*subscription* dans la grammaire) peut être interprétée comme une tranche. Plutôt que de compliquer encore la syntaxe, l'ambigüité est levée en disant que, dans ce cas, l'interprétation en tant que sélection (*subscription*) est prioritaire sur l'interprétation en tant que tranche (c'est le cas si la liste de tranches (*slice_list*) ne contient aucune tranche en tant que telle).

source: The semantics for a slicing are as follows. The primary is indexed (using the same :meth:`__getitem__` method as normal subscription) with a key that is constructed from the slice list, as follows. If the slice list contains at least one comma, the key is a tuple containing the conversion of the slice items; otherwise, the conversion of the lone slice item is the key. The conversion of a slice item that is an expression is that expression. The conversion of a proper slice is a slice object (see section :ref:`types`) whose :attr:`~slice.start`, :attr:`~slice.stop` and :attr:`~slice.step` attributes are the values of the expressions given as lower bound, upper bound and stride, respectively, substituting ``None`` for missing expressions.
fr: La sémantique pour une tranche est définie comme suit. La primaire est indicée (en utilisant la même méthode :meth:`__getitem__` que pour les sélections normales) avec une clé qui est construite à partir de la liste de tranches (*slice_list* dans la grammaire), de cette manière : si la liste de tranches contient au moins une virgule (``,``), la clé est un *n*-uplet contenant la conversion des éléments de la tranche ; sinon, la conversion du seul élément de la tranche est la clé. La conversion d'un élément de tranche qui est une expression est cette expression. La conversion d'une tranche en tant que telle est un objet *slice* (voir la section :ref:`types`) dont les attributs :attr:`~slice.start`, :attr:`~slice.stop` et :attr:`~slice.step` sont les valeurs des expressions données pour la borne inférieure (*lower_bound* dans la grammaire), la borne supérieure (*upper_bound* dans la grammaire) et le pas (*stride* dans la grammaire), respectivement. En cas d'expression manquante, la valeur par défaut est ``None``.

source: Calls
fr: Appels

source: A call calls a callable object (e.g., a :term:`function`) with a possibly empty series of :term:`arguments <argument>`:
fr: Un appel (*call* dans la grammaire ci-dessous) appelle un objet appelable (par exemple, une :term:`fonction <function>`) avec, possiblement, une liste d'\ :term:`arguments <argument>` :

source: An optional trailing comma may be present after the positional and keyword arguments but does not affect the semantics.
fr: Une virgule finale (optionnelle) peut être présente, après les arguments positionnels et nommés, mais elle n'affecte pas la sémantique.

source: The primary must evaluate to a callable object (user-defined functions, built-in functions, methods of built-in objects, class objects, methods of class instances, and all objects having a :meth:`__call__` method are callable). All argument expressions are evaluated before the call is attempted. Please refer to section :ref:`function` for the syntax of formal :term:`parameter` lists.
fr: La primaire doit s'évaluer à un objet appelable (une fonction définie par l'utilisateur, une fonction native, une méthode d'objet natif, un objet de classe, une méthode d'instance de classe ou tout objet possédant une méthode :meth:`__call__` est un appelable). Toutes les expressions des arguments sont évaluées avant que l'appel ne soit exécuté. Référez-vous à la section :ref:`function` pour la syntaxe des listes de :term:`paramètres <parameter>` formels.

source: If keyword arguments are present, they are first converted to positional arguments, as follows. First, a list of unfilled slots is created for the formal parameters. If there are N positional arguments, they are placed in the first N slots. Next, for each keyword argument, the identifier is used to determine the corresponding slot (if the identifier is the same as the first formal parameter name, the first slot is used, and so on). If the slot is already filled, a :exc:`TypeError` exception is raised. Otherwise, the value of the argument is placed in the slot, filling it (even if the expression is ``None``, it fills the slot). When all arguments have been processed, the slots that are still unfilled are filled with the corresponding default value from the function definition. (Default values are calculated, once, when the function is defined; thus, a mutable object such as a list or dictionary used as default value will be shared by all calls that don't specify an argument value for the corresponding slot; this should usually be avoided.) If there are any unfilled slots for which no default value is specified, a :exc:`TypeError` exception is raised. Otherwise, the list of filled slots is used as the argument list for the call.
fr: Si des arguments par mots-clés sont présents, ils sont d'abord convertis en arguments positionnels, comme suit. Pour commencer, une liste de *slots* vides est créée pour les paramètres formels. S'il y a N arguments positionnels, ils sont placés dans les N premiers *slots*. Ensuite, pour chaque argument par mot-clé, l'identifiant est utilisé pour déterminer le *slot* correspondant (si l'identifiant est le même que le nom du premier paramètre formel, le premier *slot* est utilisé, et ainsi de suite). Si le *slot* est déjà rempli, une exception :exc:`TypeError` est levée. Sinon, la valeur de l'argument est placée dans le *slot*, ce qui le remplit (même si l'expression est ``None``, cela remplit le *slot*). Quand tous les arguments ont été traités, les *slots* qui sont toujours vides sont remplis avec la valeur par défaut correspondante dans la définition de la fonction (les valeurs par défaut sont calculées, une seule fois, lorsque la fonction est définie ; ainsi, un objet mutable tel qu'une liste ou un dictionnaire utilisé en tant valeur par défaut sera partagé entre tous les appels qui ne spécifient pas de valeur d argument pour ce *slot* ; on évite généralement de faire ça). S'il reste des *slots* pour lesquels aucune valeur par défaut n'est définie, une exception :exc:`TypeError` est levée. Sinon, la liste des *slots* remplie est utilisée en tant que liste des arguments pour l'appel.

source: An implementation may provide built-in functions whose positional parameters do not have names, even if they are 'named' for the purpose of documentation, and which therefore cannot be supplied by keyword. In CPython, this is the case for functions implemented in C that use :c:func:`PyArg_ParseTuple` to parse their arguments.
fr: Une implémentation peut fournir des fonctions natives dont les paramètres positionnels n'ont pas de nom, même s'ils sont « nommés » pour les besoins de la documentation. Ils ne peuvent donc pas être spécifiés par mot-clé. En CPython, les fonctions implémentées en C qui utilisent :c:func:`PyArg_ParseTuple` pour analyser leurs arguments en font partie.

source: If there are more positional arguments than there are formal parameter slots, a :exc:`TypeError` exception is raised, unless a formal parameter using the syntax ``*identifier`` is present; in this case, that formal parameter receives a tuple containing the excess positional arguments (or an empty tuple if there were no excess positional arguments).
fr: S'il y a plus d'arguments positionnels que de *slots* de paramètres formels, une exception :exc:`TypeError` est levée, à moins qu'un paramètre formel n'utilise la syntaxe ``*identifier`` ; dans ce cas, le paramètre formel reçoit un *n*-uplet contenant les arguments positionnels en supplément (ou un *n*-uplet vide s'il n'y avait pas d'argument positionnel en trop).

source: If any keyword argument does not correspond to a formal parameter name, a :exc:`TypeError` exception is raised, unless a formal parameter using the syntax ``**identifier`` is present; in this case, that formal parameter receives a dictionary containing the excess keyword arguments (using the keywords as keys and the argument values as corresponding values), or a (new) empty dictionary if there were no excess keyword arguments.
fr: Si un argument par mot-clé ne correspond à aucun nom de paramètre formel, une exception :exc:`TypeError` est levée, à moins qu'un paramètre formel n'utilise la syntaxe ``**identifier`` ; dans ce cas, le paramètre formel reçoit un dictionnaire contenant les arguments par mot-clé en trop (en utilisant les mots-clés comme clés et les arguments comme valeurs pour ce dictionnaire), ou un (nouveau) dictionnaire vide s'il n'y a pas d'argument par mot-clé en trop.

source: If the syntax ``*expression`` appears in the function call, ``expression`` must evaluate to an :term:`iterable`. Elements from these iterables are treated as if they were additional positional arguments. For the call ``f(x1, x2, *y, x3, x4)``, if *y* evaluates to a sequence *y1*, ..., *yM*, this is equivalent to a call with M+4 positional arguments *x1*, *x2*, *y1*, ..., *yM*, *x3*, *x4*.
fr: Si la syntaxe ``*expression`` apparaît dans l'appel de la fonction, ``expression`` doit pouvoir s'évaluer à un :term:`itérable <iterable>`. Les éléments de ces itérables sont traités comme s'ils étaient des arguments positionnels supplémentaires. Pour l'appel ``f(x1, x2, *y, x3, x4)``, si *y* s'évalue comme une séquence *y1* … *yM*, c'est équivalent à un appel avec M+4 arguments positionnels *x1*, *x2*, *y1* … *yM*, *x3*, *x4*.

source: A consequence of this is that although the ``*expression`` syntax may appear *after* explicit keyword arguments, it is processed *before* the keyword arguments (and any ``**expression`` arguments -- see below). So::
fr: Une conséquence est que bien que la syntaxe ``*expression`` puisse apparaître *après* les arguments par nommés explicites, ils sont traités *avant* les arguments nommés (et avant tout argument ``**expression`` -- voir ci-dessous). Ainsi ::

source: It is unusual for both keyword arguments and the ``*expression`` syntax to be used in the same call, so in practice this confusion does not arise.
fr: Il est inhabituel que les syntaxes d'arguments par mots-clés et ``*expression`` soient utilisés simultanément dans un même appel, ce qui fait que la confusion reste hypothétique.

source: Formal parameters using the syntax ``*identifier`` or ``**identifier`` cannot be used as positional argument slots or as keyword argument names.
fr: Les paramètres formels qui utilisent la syntaxe ``*identifier`` ou ``**identifier`` ne peuvent pas être utilisés comme arguments positionnels ou comme noms d'arguments par mots-clés.
