Repository: python/python-docs-fr
Catalog: reference/expressions.po
Languages: fr

source: Function calls accept any number of ``*`` and ``**`` unpackings, positional arguments may follow iterable unpackings (``*``), and keyword arguments may follow dictionary unpackings (``**``). Originally proposed by :pep:`448`.
fr: Les appels de fonction acceptent n'importe quel nombre de dépaquetages par ``*`` ou ``**``. Des arguments positionnels peuvent suivre les dépaquetages d'itérables (``*``) et les arguments par mots-clés peuvent suivre les dépaquetages de dictionnaires (``**``). Proposé pour la première fois par la :pep:`448`.

source: A call always returns some value, possibly ``None``, unless it raises an exception. How this value is computed depends on the type of the callable object.
fr: Un appel renvoie toujours une valeur, possiblement ``None``, à moins qu'il ne lève une exception. La façon dont celle valeur est calculée dépend du type de l'objet appelable.

source: If it is---
fr: Si c'est ---

source: a user-defined function:
fr: une fonction définie par l'utilisateur :

source: The code block for the function is executed, passing it the argument list. The first thing the code block will do is bind the formal parameters to the arguments; this is described in section :ref:`function`. When the code block executes a :keyword:`return` statement, this specifies the return value of the function call.
fr: le bloc de code de la fonction est exécuté, il reçoit la liste des arguments. La première chose que le bloc de code fait est de lier les paramètres formels aux arguments ; ceci est décrit dans la section :ref:`function`. Quand le bloc de code exécute l'instruction :keyword:`return`, cela spécifie la valeur de retour de l'appel de la fonction.

source: a built-in function or method:
fr: une fonction ou une méthode native :

source: The result is up to the interpreter; see :ref:`built-in-funcs` for the descriptions of built-in functions and methods.
fr: le résultat dépend de l'interpréteur ; lisez :ref:`built-in-funcs` pour une description des fonctions et méthodes natives.

source: a class object:
fr: un objet classe :

source: A new instance of that class is returned.
fr: une nouvelle instance de cette classe est renvoyée.

source: a class instance method:
fr: une méthode d'instance de classe :

source: The corresponding user-defined function is called, with an argument list that is one longer than the argument list of the call: the instance becomes the first argument.
fr: la fonction correspondante définie par l'utilisateur est appelée, avec la liste d'arguments qui est plus grande d'un élément que la liste des arguments de l'appel : l'instance est placée en tête des arguments.

source: a class instance:
fr: une instance de classe :

source: The class must define a :meth:`__call__` method; the effect is then the same as if that method was called.
fr: la classe doit définir une méthode :meth:`__call__` ; l'effet est le même que si cette méthode était appelée.

source: Await expression
fr: Expression ``await``

source: Suspend the execution of :term:`coroutine` on an :term:`awaitable` object. Can only be used inside a :term:`coroutine function`.
fr: Suspend l'exécution de la :term:`coroutine` sur un objet :term:`awaitable`. Ne peut être utilisée qu'à l'intérieur d'une :term:`coroutine function`.

source: The power operator
fr: L'opérateur puissance

source: The power operator binds more tightly than unary operators on its left; it binds less tightly than unary operators on its right. The syntax is:
fr: L'opérateur puissance est plus prioritaire que les opérateurs unaires sur sa gauche ; il est moins prioritaire que les opérateurs unaires sur sa droite. La syntaxe est :

source: Thus, in an unparenthesized sequence of power and unary operators, the operators are evaluated from right to left (this does not constrain the evaluation order for the operands): ``-1**2`` results in ``-1``.
fr: Ainsi, dans une séquence sans parenthèse de puissance et d'opérateurs unaires, les opérateurs sont évalués de droite à gauche (ceci ne contraint pas l'ordre d'évaluation des opérandes) : ``-1**2`` donne ``-1``.

source: The power operator has the same semantics as the built-in :func:`pow` function, when called with two arguments: it yields its left argument raised to the power of its right argument. The numeric arguments are first converted to a common type, and the result is of that type.
fr: L'opérateur puissance possède la même sémantique que la fonction native :func:`pow` lorsqu'elle est appelée avec deux arguments : il produit son argument de gauche élevé à la puissance de son argument de droite. Les arguments numériques sont d'abord convertis vers un type commun et le résultat est de ce type.

source: For int operands, the result has the same type as the operands unless the second argument is negative; in that case, all arguments are converted to float and a float result is delivered. For example, ``10**2`` returns ``100``, but ``10**-2`` returns ``0.01``.
fr: Pour les opérandes entiers, le résultat est du même type à moins que le deuxième argument ne soit négatif ; dans ce cas, tous les arguments sont convertis en nombres à virgule flottante et le résultat est un nombre à virgule flottante. Par exemple, ``10**2`` renvoie ``100`` mais ``10**-2`` renvoie ``0.01``.

source: Raising ``0.0`` to a negative power results in a :exc:`ZeroDivisionError`. Raising a negative number to a fractional power results in a :class:`complex` number. (In earlier versions it raised a :exc:`ValueError`.)
fr: Élever ``0.0`` à une puissance négative entraîne une :exc:`ZeroDivisionError`. Élever un nombre négatif à une puissance fractionnaire renvoie un nombre :class:`complexe <complex>` (dans les versions antérieures, cela levait une :exc:`ValueError`).

source: This operation can be customized using the special :meth:`__pow__` method.
fr: La méthode spéciale qui permet de surcharger cet opérateur est :meth:`__pow__`.

source: Unary arithmetic and bitwise operations
fr: Arithmétique unaire et opérations sur les bits

source: All unary arithmetic and bitwise operations have the same priority:
fr: Toute l'arithmétique unaire et les opérations sur les bits ont la même priorité :

source: The unary ``-`` (minus) operator yields the negation of its numeric argument; the operation can be overridden with the :meth:`__neg__` special method.
fr: L'opérateur unaire ``-`` (moins) produit l'opposé de son argument numérique (la méthode spéciale qui le surcharge est :meth:`__neg__`) ;

source: The unary ``+`` (plus) operator yields its numeric argument unchanged; the operation can be overridden with the :meth:`__pos__` special method.
fr: L'opérateur unaire ``+`` (plus) produit son argument numérique inchangé (surcharge par la méthode :meth:`__pos__`) ;

source: The unary ``~`` (invert) operator yields the bitwise inversion of its integer argument. The bitwise inversion of ``x`` is defined as ``-(x+1)``. It only applies to integral numbers or to custom objects that override the :meth:`__invert__` special method.
fr: L'opérateur unaire ``~`` (inversion) produit l'inversion bit à bit de son argument entier. L'inversion bit à bit de ``x`` est définie comme ``-(x+1)``. Elle ne s'applique qu'aux nombres entiers et aux objets allogènes qui surchargent la méthode spéciale :meth:`__invert__`.

source: In all three cases, if the argument does not have the proper type, a :exc:`TypeError` exception is raised.
fr: Dans ces trois cas, si l'argument n'est pas du bon type, une exception :exc:`TypeError` est levée.

source: Binary arithmetic operations
fr: Opérations arithmétiques binaires

source: The binary arithmetic operations have the conventional priority levels. Note that some of these operations also apply to certain non-numeric types. Apart from the power operator, there are only two levels, one for multiplicative operators and one for additive operators:
fr: Les opérations arithmétiques binaires suivent les conventions pour les priorités. Notez que certaines de ces opérations s'appliquent aussi à des types non numériques. À part l'opérateur puissance, il n'y a que deux niveaux, le premier pour les opérateurs multiplicatifs et le second pour les opérateurs additifs :

source: The ``*`` (multiplication) operator yields the product of its arguments. The arguments must either both be numbers, or one argument must be an integer and the other must be a sequence. In the former case, the numbers are converted to a common type and then multiplied together. In the latter case, sequence repetition is performed; a negative repetition factor yields an empty sequence.
fr: L'opérateur ``*`` (multiplication) produit le produit de ses arguments. Les deux arguments doivent être des nombres ou alors le premier argument doit être un entier et l'autre doit être une séquence. Dans le premier cas, les nombres sont convertis dans un type commun puis sont multipliés entre eux. Dans le dernier cas, la séquence est répétée ; une répétition négative produit une séquence vide.

source: This operation can be customized using the special :meth:`__mul__` and :meth:`__rmul__` methods.
fr: Les méthodes spéciales qui permettent de surcharger cet opérateur sont :meth:`__mul__` et :meth:`__rmul__`.

source: The ``@`` (at) operator is intended to be used for matrix multiplication. No builtin Python types implement this operator.
fr: L'opérateur ``@`` (prononcé *at* en anglais) a vocation à multiplier des matrices. Aucun type Python natif n'implémente cet opérateur.

source: The ``/`` (division) and ``//`` (floor division) operators yield the quotient of their arguments. The numeric arguments are first converted to a common type. Division of integers yields a float, while floor division of integers results in an integer; the result is that of mathematical division with the 'floor' function applied to the result. Division by zero raises the :exc:`ZeroDivisionError` exception.
fr: Les opérateurs ``/`` (division) et ``//`` (division entière ou *floor division* en anglais) produisent le quotient de leurs arguments. Les arguments numériques sont d'abord convertis vers un type commun. La division d'entiers produit un nombre à virgule flottante alors que la division entière d'entiers produit un entier ; le résultat est celui de la division mathématique suivie de la fonction ``floor`` appliquée au résultat. Une division par zéro lève une exception :exc:`ZeroDivisionError`.

source: This operation can be customized using the special :meth:`__truediv__` and :meth:`__floordiv__` methods.
fr: Les méthodes spéciales qui permettent de surcharger ces opérations sont :meth:`__truediv__` et :meth:`__floordiv__`.

source: The ``%`` (modulo) operator yields the remainder from the division of the first argument by the second. The numeric arguments are first converted to a common type. A zero right argument raises the :exc:`ZeroDivisionError` exception. The arguments may be floating point numbers, e.g., ``3.14%0.7`` equals ``0.34`` (since ``3.14`` equals ``4*0.7 + 0.34``.) The modulo operator always yields a result with the same sign as its second operand (or zero); the absolute value of the result is strictly smaller than the absolute value of the second operand [#]_.
fr: L'opérateur ``%`` (modulo) produit le reste de la division entière du premier argument par le second. Les arguments numériques sont d'abord convertis vers un type commun. Un zéro en second argument lève une exception :exc:`ZeroDivisionError`. Les arguments peuvent être des nombres à virgule flottante, par exemple ``3.14%0.7`` vaut ``0.34`` (puisque ``3.14`` égale ``4*0.7+0.34``). L'opérateur modulo produit toujours un résultat du même signe que le second opérande (ou zéro) ; la valeur absolue du résultat est strictement inférieure à la valeur absolue du second opérande [#]_.

source: The floor division and modulo operators are connected by the following identity: ``x == (x//y)*y + (x%y)``. Floor division and modulo are also connected with the built-in function :func:`divmod`: ``divmod(x, y) == (x//y, x%y)``. [#]_.
fr: Les opérateurs division entière et modulo sont liés par la relation suivante : ``x == (x//y)*y + (x%y)``. La division entière et le module sont aussi liés à la fonction native :func:`divmod` : ``divmod(x, y) == (x//y, x%y)`` [#]_.

source: In addition to performing the modulo operation on numbers, the ``%`` operator is also overloaded by string objects to perform old-style string formatting (also known as interpolation). The syntax for string formatting is described in the Python Library Reference, section :ref:`old-string-formatting`.
fr: En plus de calculer le modulo sur les nombres, l'opérateur ``%`` est aussi surchargé par les objets chaînes de caractères pour effectuer le formatage de chaîne « à l'ancienne ». La syntaxe pour le formatage de chaînes est décrit dans la référence de la bibliothèque Python, dans la section :ref:`old-string-formatting`.

source: The *modulo* operation can be customized using the special :meth:`__mod__` method.
fr: La méthode spéciale qui permet de surcharger cette opération est :meth:`__mod__`.

source: The floor division operator, the modulo operator, and the :func:`divmod` function are not defined for complex numbers. Instead, convert to a floating point number using the :func:`abs` function if appropriate.
fr: L'opérateur de division entière, l'opérateur modulo et la fonction :func:`divmod` ne sont pas définis pour les nombres complexes. À la place, vous pouvez, si cela a du sens pour ce que vous voulez faire, les convertir vers des nombres à virgule flottante en utilisant la fonction :func:`abs`.

source: The ``+`` (addition) operator yields the sum of its arguments. The arguments must either both be numbers or both be sequences of the same type. In the former case, the numbers are converted to a common type and then added together. In the latter case, the sequences are concatenated.
fr: L'opérateur ``+`` (addition) produit la somme de ses arguments. Les arguments doivent être tous les deux des nombres ou des séquences du même type. Dans le premier cas, les nombres sont convertis vers un type commun puis sont additionnés entre eux. Dans le dernier cas, les séquences sont concaténées.

source: This operation can be customized using the special :meth:`__add__` and :meth:`__radd__` methods.
fr: Les méthodes spéciales qui permettent de surcharger cette opération sont :meth:`__add__` et :meth:`__radd__`.

source: The ``-`` (subtraction) operator yields the difference of its arguments. The numeric arguments are first converted to a common type.
fr: L'opérateur ``-`` (soustraction) produit la différence entre ses arguments. Les arguments numériques sont d'abord convertis vers un type commun.

source: This operation can be customized using the special :meth:`__sub__` method.
fr: La méthode spéciale qui permet de surcharger cette opération est :meth:`__sub__`.

source: Shifting operations
fr: Opérations de décalage

source: The shifting operations have lower priority than the arithmetic operations:
fr: Les opérations de décalage sont moins prioritaires que les opérations arithmétiques :

source: These operators accept integers as arguments. They shift the first argument to the left or right by the number of bits given by the second argument.
fr: Ces opérateurs prennent des entiers comme arguments. Ils décalent le premier argument vers la gauche ou vers la droite du nombre de bits donné par le deuxième argument.

source: This operation can be customized using the special :meth:`__lshift__` and :meth:`__rshift__` methods.
fr: Les méthodes spéciales qui permettent de surcharger ces opérations sont :meth:`__lshift__` et :meth:`__rshift__`.

source: A right shift by *n* bits is defined as floor division by ``pow(2,n)``. A left shift by *n* bits is defined as multiplication with ``pow(2,n)``.
fr: Un décalage à droite de *n* bits est défini comme la division entière par ``pow(2,n)``. Un décalage à gauche de *n* bits est défini comme la multiplication par ``pow(2,n)``.

source: Binary bitwise operations
fr: Opérations binaires bit à bit

source: Each of the three bitwise operations has a different priority level:
fr: Chacune des trois opérations binaires bit à bit possède une priorité différente :

source: The ``&`` operator yields the bitwise AND of its arguments, which must be integers or one of them must be a custom object overriding :meth:`__and__` or :meth:`__rand__` special methods.
fr: L'opérateur ``&`` produit le ET logique de ses arguments. Ils doivent être des entiers, sauf si celui de gauche surcharge la méthode spéciale :meth:`__and__`, ou celui de droite la méthode :meth:`__rand__`.

source: The ``^`` operator yields the bitwise XOR (exclusive OR) of its arguments, which must be integers or one of them must be a custom object overriding :meth:`__xor__` or :meth:`__rxor__` special methods.
fr: L'opérateur ``^`` produit le OU EXCLUSIF (XOR) logique de ses arguments. Ils doivent être des entiers, sauf à surcharger :meth:`__xor__` ou :meth:`__rxor__`.

source: The ``|`` operator yields the bitwise (inclusive) OR of its arguments, which must be integers or one of them must be a custom object overriding :meth:`__or__` or :meth:`__ror__` special methods.
fr: L'opérateur ``|`` produit le OU logique de ses arguments. Ils doivent être des entiers, sauf à surcharger :meth:`__or__` ou :meth:`__ror__`.

source: Comparisons
fr: Comparaisons

source: Unlike C, all comparison operations in Python have the same priority, which is lower than that of any arithmetic, shifting or bitwise operation. Also unlike C, expressions like ``a < b < c`` have the interpretation that is conventional in mathematics:
fr: Au contraire du C, toutes les opérations de comparaison en Python possèdent la même priorité, qui est plus faible que celle des opérations arithmétiques, décalages ou binaires bit à bit. Toujours contrairement au C, les expressions telles que ``a < b < c`` sont interprétées comme elles le seraient conventionnellement en mathématiques :

source: Comparisons yield boolean values: ``True`` or ``False``. Custom :dfn:`rich comparison methods` may return non-boolean values. In this case Python will call :func:`bool` on such value in boolean contexts.
fr: Les comparaisons donnent des valeurs booléennes (``True`` ou ``False``). Cependant, les :dfn:`méthodes de comparaison riche` définies par l'utilisateur peuvent renvoyer des non-booléens. Dans ce cas, le résultat de la comparaison est converti en booléen avec :func:`bool` dans les contextes qui attendent un booléen.

source: Comparisons can be chained arbitrarily, e.g., ``x < y <= z`` is equivalent to ``x < y and y <= z``, except that ``y`` is evaluated only once (but in both cases ``z`` is not evaluated at all when ``x < y`` is found to be false).
fr: Les comparaisons peuvent être enchaînées arbitrairement, par exemple ``x < y <= z`` est équivalent à ``x < y and y <= z``, sauf que ``y`` est évalué seulement une fois (mais dans les deux cas, ``z`` n'est pas évalué du tout si ``x < y`` s'avère être faux).

source: Formally, if *a*, *b*, *c*, ..., *y*, *z* are expressions and *op1*, *op2*, ..., *opN* are comparison operators, then ``a op1 b op2 c ... y opN z`` is equivalent to ``a op1 b and b op2 c and ... y opN z``, except that each expression is evaluated at most once.
fr: Formellement, si *a*, *b*, *c* … *y*, *z* sont des expressions et *op1*, *op2* … *opN* sont des opérateurs de comparaison, alors ``a op1 b op2 c … y opN z`` est équivalent à ``a op1 b and b op2 c and … y opN z``, sauf que chaque expression est évaluée au maximum une fois.

source: Note that ``a op1 b op2 c`` doesn't imply any kind of comparison between *a* and *c*, so that, e.g., ``x < y > z`` is perfectly legal (though perhaps not pretty).
fr: Notez que ``a op1 b op2 c`` n'implique aucune comparaison entre *a* et *c*. Ainsi, par exemple, ``x < y > z`` est parfaitement légal (mais peut-être pas très élégant).

source: Value comparisons
fr: Comparaisons de valeurs

source: The operators ``<``, ``>``, ``==``, ``>=``, ``<=``, and ``!=`` compare the values of two objects. The objects do not need to have the same type.
fr: Les opérateurs ``<``, ``>``, ``==``, ``>=``, ``<=`` et ``!=`` comparent les valeurs de deux objets. Les objets n'ont pas besoin d'être du même type.

source: Chapter :ref:`objects` states that objects have a value (in addition to type and identity). The value of an object is a rather abstract notion in Python: For example, there is no canonical access method for an object's value. Also, there is no requirement that the value of an object should be constructed in a particular way, e.g. comprised of all its data attributes. Comparison operators implement a particular notion of what the value of an object is. One can think of them as defining the value of an object indirectly, by means of their comparison implementation.
fr: Le chapitre :ref:`objects` indique que les objets ont une valeur (en plus d'un type et d'un identifiant). La valeur d'un objet est une notion plutôt abstraite en Python : par exemple, il n'existe pas de méthode canonique pour accéder à la valeur d'un objet. De la même manière, il n'y a aucune obligation concernant la construction de la valeur d'un objet, par exemple qu'elle prenne en compte toutes les données de ses attributs. Les opérateurs de comparaison implémentent une notion particulière de ce qu'est la valeur d'un objet. Vous pouvez vous le représenter comme une définition indirecte de la valeur d'un objet, *via* l'implémentation de leur comparaison.

source: Because all types are (direct or indirect) subtypes of :class:`object`, they inherit the default comparison behavior from :class:`object`. Types can customize their comparison behavior by implementing :dfn:`rich comparison methods` like :meth:`__lt__`, described in :ref:`customization`.
fr: Comme tous les types sont des sous-types (directs ou indirects) de la classe :class:`object`, ils héritent du comportement de comparaison par défaut de :class:`object`. Les types peuvent personnaliser le comportement des comparaisons en implémentant des :dfn:`méthodes de comparaisons riches`, comme :meth:`__lt__`, décrites dans :ref:`customization`.

source: The default behavior for equality comparison (``==`` and ``!=``) is based on the identity of the objects. Hence, equality comparison of instances with the same identity results in equality, and equality comparison of instances with different identities results in inequality. A motivation for this default behavior is the desire that all objects should be reflexive (i.e. ``x is y`` implies ``x == y``).
fr: Le comportement par défaut pour le test d'égalité (``==`` et ``!=``) se base sur les identifiants des objets. Ainsi, un test d'égalité entre deux instances qui ont le même identifiant est vrai, un test d'égalité entre deux instances qui ont des identifiants différents est faux. La raison de ce choix est que Python souhaite que tous les objets soient réflexifs, c'est-à-dire que ``x is y`` implique ``x == y``.

source: A default order comparison (``<``, ``>``, ``<=``, and ``>=``) is not provided; an attempt raises :exc:`TypeError`. A motivation for this default behavior is the lack of a similar invariant as for equality.
fr: La relation d'ordre (``<``, ``>``, ``<=`` et ``>=``) n'est pas fournie par défaut ; une tentative se solde par une :exc:`TypeError`. La raison de ce choix est qu'il n'existe pas d'invariant similaire à celui de l'égalité.
