Repository: python/python-docs-fr
Catalog: reference/import.po
Languages: fr

source: The ``__spec__`` attribute must be set to the module spec that was used when importing the module. Setting ``__spec__`` appropriately applies equally to :ref:`modules initialized during interpreter startup <programs>`. The one exception is ``__main__``, where ``__spec__`` is :ref:`set to None in some cases <main_spec>`.
fr: L'attribut ``__spec__`` doit contenir un lien vers le spécificateur de module qui a été utilisé lors de l'importation du module. Définir ``__spec__`` correctement s'applique aussi pour :ref:`l'initialisation des modules au démarrage de l'interpréteur <programs>`. La seule exception concerne ``__main__`` où la valeur de ``__spec__`` est :ref:`None dans certains cas <main_spec>`.

source: When ``__package__`` is not defined, ``__spec__.parent`` is used as a fallback.
fr: Quand ``__package__`` n'est pas défini, ``__spec__.parent`` est utilisé par défaut.

source: ``__spec__.parent`` is used as a fallback when ``__package__`` is not defined.
fr: ``__spec__.parent`` est utilisé par défaut quand ``__package__`` n'est pas défini.

source: If the module is a package (either regular or namespace), the module object's ``__path__`` attribute must be set. The value must be iterable, but may be empty if ``__path__`` has no further significance. If ``__path__`` is not empty, it must produce strings when iterated over. More details on the semantics of ``__path__`` are given :ref:`below <package-path-rules>`.
fr: Si le module est un paquet (classique ou espace de nommage), l'attribut ``__path__`` de l'objet module doit être défini. La valeur doit être un itérable mais peut être vide si ``__path__`` n'a pas de sens dans le contexte. Si ``__path__`` n'est pas vide, il doit produire des chaînes lorsque l'on itère dessus. Vous trouvez plus de détails sur la sémantique de ``__path__`` :ref:`plus loin ci-dessous <package-path-rules>`.

source: Non-package modules should not have a ``__path__`` attribute.
fr: Les modules qui ne sont pas des paquets ne doivent pas avoir d'attribut ``__path__``.

source: ``__file__`` is optional. If set, this attribute's value must be a string. The import system may opt to leave ``__file__`` unset if it has no semantic meaning (e.g. a module loaded from a database).
fr: ``__file__`` est optionnel. S'il est défini, la valeur de cet attribut doit être une chaîne. Le système d'importation peut décider de laisser ``__file__`` indéfini si cela ne fait pas sens de le définir (par exemple, lorsqu'on charge un module depuis une base de données).

source: If ``__file__`` is set, it may also be appropriate to set the ``__cached__`` attribute which is the path to any compiled version of the code (e.g. byte-compiled file). The file does not need to exist to set this attribute; the path can simply point to where the compiled file would exist (see :pep:`3147`).
fr: Si ``__file__`` est défini, il peut être judicieux de définir l'attribut ``__cached__`` dont la valeur est le chemin vers une version compilée du code (par exemple, le fichier *bytecode*). Le fichier n'a pas besoin d'exister pour définir cet attribut : le chemin peut simplement pointer vers l'endroit où le fichier compilé aurait été placé (voir la :pep:`3147`).

source: It is also appropriate to set ``__cached__`` when ``__file__`` is not set. However, that scenario is quite atypical. Ultimately, the loader is what makes use of ``__file__`` and/or ``__cached__``. So if a loader can load from a cached module but otherwise does not load from a file, that atypical scenario may be appropriate.
fr: Vous pouvez aussi définir ``__cached__`` quand ``__file__`` n'est pas défini. Cependant, ce scénario semble rare. Au final, c'est le chargeur qui utilise les valeurs de ``__file__`` ou ``__cached__``. Donc, si le chargeur peut charger depuis un module mis en cache mais ne peut pas charger depuis un fichier, ce scénario a du sens.

source: By definition, if a module has a ``__path__`` attribute, it is a package.
fr: Par définition, si un module possède un attribut ``__path__``, c'est un paquet.

source: A package's ``__path__`` attribute is used during imports of its subpackages. Within the import machinery, it functions much the same as :data:`sys.path`, i.e. providing a list of locations to search for modules during import. However, ``__path__`` is typically much more constrained than :data:`sys.path`.
fr: L'attribut ``__path__`` d'un paquet est utilisé pendant l'importation des sous-paquets. Dans le mécanisme d'importation, son fonctionnement ressemble beaucoup à :data:`sys.path`, c'est-à-dire qu'il fournit une liste d'emplacements où rechercher les modules pendant l'importation. Cependant, ``__path__`` est beaucoup plus contraint que :data:`sys.path`.

source: ``__path__`` must be an iterable of strings, but it may be empty. The same rules used for :data:`sys.path` also apply to a package's ``__path__``, and :data:`sys.path_hooks` (described below) are consulted when traversing a package's ``__path__``.
fr: ``__path__`` doit être un itérable de chaînes de caractères, mais il peut être vide. Les mêmes règles que pour :data:`sys.path` s'appliquent au ``__path__`` d'un paquet et :data:`sys.path_hooks` (dont la description est donnée plus bas) est consulté pendant le parcours de ``__path__`` du paquet.

source: A package's ``__init__.py`` file may set or alter the package's ``__path__`` attribute, and this was typically the way namespace packages were implemented prior to :pep:`420`. With the adoption of :pep:`420`, namespace packages no longer need to supply ``__init__.py`` files containing only ``__path__`` manipulation code; the import machinery automatically sets ``__path__`` correctly for the namespace package.
fr: Le fichier ``__init__.py`` d'un paquet peut définir ou modifier l'attribut ``__path__`` d'un paquet, et c'est ainsi qu'étaient implémentés les paquets-espaces de nommage avant la :pep:`420`. Depuis l'adoption de la :pep:`420`, les paquets-espaces de nommage n'ont plus besoin d'avoir des fichiers ``__init__.py`` qui ne font que de la manipulation de ``__path__`` ; le mécanisme d'importation définit automatiquement ``__path__`` correctement pour un paquet-espace de nommage.

source: Module reprs
fr: Représentation textuelle d'un module

source: By default, all modules have a usable repr, however depending on the attributes set above, and in the module's spec, you can more explicitly control the repr of module objects.
fr: Par défaut, tous les modules ont une représentation textuelle utilisable. Cependant, en utilisant les attributs définis ci-dessus et dans le spécificateur de module, vous pouvez explicitement mieux contrôler l'affichage des objets modules.

source: If the module has a spec (``__spec__``), the import machinery will try to generate a repr from it. If that fails or there is no spec, the import system will craft a default repr using whatever information is available on the module. It will try to use the ``module.__name__``, ``module.__file__``, and ``module.__loader__`` as input into the repr, with defaults for whatever information is missing.
fr: Si le module possède un spécificateur (``__spec__``), le mécanisme d'importation essaie de générer une représentation avec celui-ci. S'il échoue ou s'il n'y a pas de spécificateur, le système d'importation construit une représentation par défaut en utilisant toute information disponible sur le module. Il tente d'utiliser ``module.__name__``, ``module.__file__`` et ``module.__loader__`` comme entrées pour la représentation, avec des valeurs par défaut lorsque l'information est manquante.

source: Here are the exact rules used:
fr: Les règles exactes utilisées sont :

source: If the module has a ``__spec__`` attribute, the information in the spec is used to generate the repr. The "name", "loader", "origin", and "has_location" attributes are consulted.
fr: Si le module possède un attribut ``__spec__``, la valeur est utilisée pour générer la représentation. Les attributs *name*, *loader*, *origin* et *has_location* sont consultés.

source: If the module has a ``__file__`` attribute, this is used as part of the module's repr.
fr: Si le module possède un attribut ``__file__``, il est utilisé pour construire la représentation du module.

source: If the module has no ``__file__`` but does have a ``__loader__`` that is not ``None``, then the loader's repr is used as part of the module's repr.
fr: Si le module ne possède pas d'attribut ``__file__`` mais possède un ``__loader__`` qui n'est pas ``None``, alors la représentation du chargeur est utilisée pour construire la représentation du module.

source: Otherwise, just use the module's ``__name__`` in the repr.
fr: Sinon, il utilise juste le ``__name__`` du module dans la représentation.

source: Use of :meth:`loader.module_repr() <importlib.abc.Loader.module_repr>` has been deprecated and the module spec is now used by the import machinery to generate a module repr.
fr: L'utilisation de :meth:`loader.module_repr() <importlib.abc.Loader.module_repr>` est devenue obsolète et le spécificateur de module est utilisé dorénavant par le mécanisme d'importation pour générer la représentation textuelle du module.

source: For backward compatibility with Python 3.3, the module repr will be generated by calling the loader's :meth:`~importlib.abc.Loader.module_repr` method, if defined, before trying either approach described above. However, the method is deprecated.
fr: Par compatibilité descendante avec Python 3.3, la représentation textuelle du module est générée en appelant la méthode :meth:`~importlib.abc.Loader.module_repr` du chargeur, si elle est définie, avant même d'essayer l'approche décrite ci-dessus. Cependant, cette méthode est obsolète.

source: Cached bytecode invalidation
fr: Invalidation de *bytecode* mis en cache

source: Before Python loads cached bytecode from ``.pyc`` file, it checks whether the cache is up-to-date with the source ``.py`` file. By default, Python does this by storing the source's last-modified timestamp and size in the cache file when writing it. At runtime, the import system then validates the cache file by checking the stored metadata in the cache file against the source's metadata.
fr: Avant que Python ne charge du *bytecode* en cache à partir d'un fichier ``.pyc``, il vérifie si ce cache est bien à jour par rapport au fichier source ``.py``. Python effectue cette vérification en stockant l'horodatage de la dernière modification de la source ainsi que sa taille dans le fichier cache au moment où il l'écrit. À l'exécution, le système d'importation valide le fichier cache en comparant les métadonnées que le cache contient avec les métadonnées de la source.

source: Python also supports "hash-based" cache files, which store a hash of the source file's contents rather than its metadata. There are two variants of hash-based ``.pyc`` files: checked and unchecked. For checked hash-based ``.pyc`` files, Python validates the cache file by hashing the source file and comparing the resulting hash with the hash in the cache file. If a checked hash-based cache file is found to be invalid, Python regenerates it and writes a new checked hash-based cache file. For unchecked hash-based ``.pyc`` files, Python simply assumes the cache file is valid if it exists. Hash-based ``.pyc`` files validation behavior may be overridden with the :option:`--check-hash-based-pycs` flag.
fr: Python gère également les fichiers caches "avec empreintes", qui stockent une empreinte (*hash* en anglais) du contenu de la source plutôt que des métadonnées. Il existe deux variations des fichiers ``.pyc`` avec empreintes : vérifiés et non-vérifiés. Pour les fichiers ``.pyc`` avec empreinte vérifiés, Python valide le fichier cache en calculant l'empreinte du fichier source et compare les empreintes. Si l'empreinte stockée dans le fichier cache est invalide, Python la recalcule et écrit un nouveau fichier cache avec empreinte. Pour les fichiers ``.pyc`` avec empreinte non vérifiés, Python considère simplement que le fichier cache est valide s'il existe. La validation (ou non) des fichiers ``.pyc`` avec empreinte peut être définie avec l'option :option:`--check-hash-based-pycs`.

source: Added hash-based ``.pyc`` files. Previously, Python only supported timestamp-based invalidation of bytecode caches.
fr: Ajout des fichiers ``.pyc`` avec empreinte. Auparavant, Python gérait les caches de *bytecode* sur la base de l'horodatage.

source: The Path Based Finder
fr: Le chercheur dans *path*

source: As mentioned previously, Python comes with several default meta path finders. One of these, called the :term:`path based finder` (:class:`~importlib.machinery.PathFinder`), searches an :term:`import path`, which contains a list of :term:`path entries <path entry>`. Each path entry names a location to search for modules.
fr: Comme indiqué précédemment, Python est livré par défaut avec plusieurs chercheurs dans les méta-chemins. L'un deux, appelé :term:`chercheur dans path <path based finder>` (:class:`~importlib.machinery.PathFinder`), recherche dans le :term:`chemin des importations <import path>` qui contient une liste :term:`d'entrées dans path <path entry>`. Chaque entrée désigne un emplacement où rechercher des modules.

source: The path based finder itself doesn't know how to import anything. Instead, it traverses the individual path entries, associating each of them with a path entry finder that knows how to handle that particular kind of path.
fr: Le chercheur dans *path* en tant que tel ne sait pas comment importer quoi que ce soit. Il ne fait que parcourir chaque entrée de *path* et associe à chacune d'elle un "chercheur d'entrée dans *path*" qui sait comment gérer le type particulier de chemin considéré.

source: The default set of path entry finders implement all the semantics for finding modules on the file system, handling special file types such as Python source code (``.py`` files), Python byte code (``.pyc`` files) and shared libraries (e.g. ``.so`` files). When supported by the :mod:`zipimport` module in the standard library, the default path entry finders also handle loading all of these file types (other than shared libraries) from zipfiles.
fr: L'ensemble par défaut des "chercheurs d'entrée dans *path*" implémente toute la sémantique pour trouver des modules dans le système de fichiers, gérer des fichiers spéciaux tels que le code source Python (fichiers ``.py``), le *bytecode* Python (fichiers ``.pyc``) et les bibliothèques partagées (par exemple les fichiers ``.so``). Quand le module :mod:`zipimport` de la bibliothèque standard le permet, les "chercheurs d'entrée dans *path*" par défaut savent aussi gérer tous ces types de fichiers (autres que les bibliothèques partagées) encapsulés dans des fichiers zip.

source: Path entries need not be limited to file system locations. They can refer to URLs, database queries, or any other location that can be specified as a string.
fr: Les chemins ne sont pas limités au système de fichiers. Ils peuvent faire référence à des URL, des requêtes dans des bases de données ou tout autre emplacement qui peut être spécifié dans une chaîne de caractères.

source: The path based finder provides additional hooks and protocols so that you can extend and customize the types of searchable path entries. For example, if you wanted to support path entries as network URLs, you could write a hook that implements HTTP semantics to find modules on the web. This hook (a callable) would return a :term:`path entry finder` supporting the protocol described below, which was then used to get a loader for the module from the web.
fr: Le chercheur dans *path* fournit aussi des points d'entrées (ou *hooks*) et des protocoles de manière à pouvoir étendre et personnaliser les types de chemins dans lesquels chercher. Par exemple, si vous voulez pouvoir chercher dans des URL réseau, vous pouvez écrire une fonction « point d'entrée » qui implémente la sémantique HTTP pour chercher des modules sur la toile. Ce point d'entrée (qui doit être un appelable) doit renvoyer un :term:`chercheur d'entrée dans path <path entry finder>` qui gère le protocole décrit plus bas et qui sera utilisé pour obtenir un chargeur de module sur la toile.

source: A word of warning: this section and the previous both use the term *finder*, distinguishing between them by using the terms :term:`meta path finder` and :term:`path entry finder`. These two types of finders are very similar, support similar protocols, and function in similar ways during the import process, but it's important to keep in mind that they are subtly different. In particular, meta path finders operate at the beginning of the import process, as keyed off the :data:`sys.meta_path` traversal.
fr: Avertissement : cette section et la précédente utilisent toutes les deux le terme *chercheur*, dans un cas :term:`chercheur dans les méta-chemins <meta path finder>` et dans l'autre :term:`chercheur d'entrée dans path <path entry finder>`. Ces deux types de chercheurs sont très similaires, gèrent des protocoles similaires et fonctionnent de manière semblable pendant le processus d'importation, mais il est important de garder à l'esprit qu'ils sont subtilement différents. En particulier, les chercheurs dans les méta-chemins opèrent au début du processus d'importation, comme clé de parcours de :data:`sys.meta_path`.

source: By contrast, path entry finders are in a sense an implementation detail of the path based finder, and in fact, if the path based finder were to be removed from :data:`sys.meta_path`, none of the path entry finder semantics would be invoked.
fr: Au contraire, les "chercheurs d'entrée dans *path*" sont, dans un sens, un détail d'implémentation du chercheur dans *path* et, en fait, si le chercheur dans *path* était enlevé de :data:`sys.meta_path`, aucune des sémantiques des "chercheurs d'entrée dans *path*" ne serait invoquée.

source: Path entry finders
fr: Chercheurs d'entrée dans *path*

source: The :term:`path based finder` is responsible for finding and loading Python modules and packages whose location is specified with a string :term:`path entry`. Most path entries name locations in the file system, but they need not be limited to this.
fr: Le :term:`chercheur dans path <path based finder>` (*path based finder* en anglais) est responsable de trouver et charger les modules et les paquets Python dont l'emplacement est spécifié par une chaîne dite :term:`d'entrée dans path <path entry>`. La plupart de ces entrées désignent des emplacements sur le système de fichiers, mais il n'y a aucune raison de les limiter à ça.

source: As a meta path finder, the :term:`path based finder` implements the :meth:`~importlib.abc.MetaPathFinder.find_spec` protocol previously described, however it exposes additional hooks that can be used to customize how modules are found and loaded from the :term:`import path`.
fr: En tant que chercheur dans les méta-chemins, un :term:`chercheur dans path <path based finder>` implémente le protocole :meth:`~importlib.abc.MetaPathFinder.find_spec` décrit précédemment. Cependant, il autorise des points d'entrée (*hooks* en anglais) supplémentaires qui peuvent être utilisés pour personnaliser la façon dont les modules sont trouvés et chargés depuis le :term:`chemin des importations <import path>`.

source: Three variables are used by the :term:`path based finder`, :data:`sys.path`, :data:`sys.path_hooks` and :data:`sys.path_importer_cache`. The ``__path__`` attributes on package objects are also used. These provide additional ways that the import machinery can be customized.
fr: Trois variables sont utilisées par le :term:`chercheur dans path <path based finder>` : :data:`sys.path`, :data:`sys.path_hooks` et :data:`sys.path_importer_cache`. L'attribut ``__path__`` des objets paquets est aussi utilisé. Il permet de personnaliser encore davantage le mécanisme d'importation.

source: :data:`sys.path` contains a list of strings providing search locations for modules and packages. It is initialized from the :data:`PYTHONPATH` environment variable and various other installation- and implementation-specific defaults. Entries in :data:`sys.path` can name directories on the file system, zip files, and potentially other "locations" (see the :mod:`site` module) that should be searched for modules, such as URLs, or database queries. Only strings and bytes should be present on :data:`sys.path`; all other data types are ignored. The encoding of bytes entries is determined by the individual :term:`path entry finders <path entry finder>`.
fr: :data:`sys.path` contient une liste de chaînes de caractères indiquant des emplacements où chercher des modules ou des paquets. Elle est initialisée à partir de la variable d'environnement :data:`PYTHONPATH` et de plusieurs autres valeurs par défaut qui dépendent de l'installation et de l'implémentation. Les entrées de :data:`sys.path` désignent des répertoires du système de fichiers, des fichiers zip et possiblement d'autres "endroits" (lisez le module :mod:`site`) tels que des URL ou des requêtes dans des bases de données où Python doit rechercher des modules. :data:`sys.path` ne doit contenir que des chaînes de caractères ou d'octets ; tous les autres types sont ignorés. L'encodage des entrées de chaînes d'octets est déterminé par chaque :term:`chercheur d'entrée dans path <path entry finder>`.

source: The :term:`path based finder` is a :term:`meta path finder`, so the import machinery begins the :term:`import path` search by calling the path based finder's :meth:`~importlib.machinery.PathFinder.find_spec` method as described previously. When the ``path`` argument to :meth:`~importlib.machinery.PathFinder.find_spec` is given, it will be a list of string paths to traverse - typically a package's ``__path__`` attribute for an import within that package. If the ``path`` argument is ``None``, this indicates a top level import and :data:`sys.path` is used.
fr: Le :term:`chercheur dans path <path based finder>` est un :term:`chercheur dans les méta-chemins <meta path finder>`, donc le mécanisme d'importation commence la recherche dans le :term:`chemin des importations <import path>` par un appel à la méthode :meth:`~importlib.machinery.PathFinder.find_spec` du chercheur dans *path*, comme décrit précédemment. Quand l'argument *path* de :meth:`~importlib.machinery.PathFinder.find_spec` est donné, c'est une liste de chemins à parcourir, typiquement un attribut ``__path__`` pour une importation à l'intérieur d'un paquet. Si l'argument *path* est ``None``, cela indique une importation de niveau le plus haut et :data:`sys.path` est utilisée.
