Repository: python/python-docs-fr
Catalog: reference/import.po
Languages: fr

source: The import system
fr: Le système d'importation

source: Python code in one :term:`module` gains access to the code in another module by the process of :term:`importing` it. The :keyword:`import` statement is the most common way of invoking the import machinery, but it is not the only way. Functions such as :func:`importlib.import_module` and built-in :func:`__import__` can also be used to invoke the import machinery.
fr: Le code Python d'un :term:`module` peut accéder à du code d'un autre module par un mécanisme qui consiste à :term:`importer` cet autre module. L'instruction :keyword:`import` est la façon la plus courante faire appel à ce système d'importation, mais ce n'est pas la seule. Les fonctions telles que :func:`importlib.import_module` et :func:`__import__` peuvent aussi être utilisées pour mettre en œuvre le mécanisme d'importation.

source: The :keyword:`import` statement combines two operations; it searches for the named module, then it binds the results of that search to a name in the local scope. The search operation of the :keyword:`!import` statement is defined as a call to the :func:`__import__` function, with the appropriate arguments. The return value of :func:`__import__` is used to perform the name binding operation of the :keyword:`!import` statement. See the :keyword:`!import` statement for the exact details of that name binding operation.
fr: L'instruction :keyword:`import` effectue deux opérations ; elle cherche le module dont le nom a été donné puis elle lie le résultat de cette recherche à un nom dans la portée locale. L'opération de recherche de l'instruction :keyword:`!import` consiste à appeler la fonction :func:`__import__` avec les arguments adéquats. La valeur renvoyée par :func:`__import__` est utilisée pour effectuer l'opération de liaison avec le nom fourni à l'instruction :keyword:`!import`. Reportez-vous à l'instruction :keyword:`!import` pour les détails exacts de l'opération de liaison avec le nom.

source: A direct call to :func:`__import__` performs only the module search and, if found, the module creation operation. While certain side-effects may occur, such as the importing of parent packages, and the updating of various caches (including :data:`sys.modules`), only the :keyword:`import` statement performs a name binding operation.
fr: Un appel direct à :func:`__import__` effectue seulement la recherche du module et, s'il est trouvé, l'opération de création du module. Bien que des effets collatéraux puissent se produire, tels que l'importation de paquets parents et la mise à jour de divers caches (y compris :data:`sys.modules`), il n'y a que l'instruction :keyword:`import` qui déclenche l'opération de liaison avec le nom.

source: When an :keyword:`import` statement is executed, the standard builtin :func:`__import__` function is called. Other mechanisms for invoking the import system (such as :func:`importlib.import_module`) may choose to bypass :func:`__import__` and use their own solutions to implement import semantics.
fr: Quand une instruction :keyword:`import` est exécutée, la fonction native :func:`__import__` est appelée. D'autres mécanismes d'appel au système d'importation (tels que :func:`importlib.import_module`) peuvent choisir d'ignorer :func:`__import__` et utiliser leurs propres solutions pour implémenter la sémantique d'importation.

source: When a module is first imported, Python searches for the module and if found, it creates a module object [#fnmo]_, initializing it. If the named module cannot be found, a :exc:`ModuleNotFoundError` is raised. Python implements various strategies to search for the named module when the import machinery is invoked. These strategies can be modified and extended by using various hooks described in the sections below.
fr: Quand un module est importé pour la première fois, Python recherche le module et, s'il est trouvé, créé un objet module [#fnmo]_ en l'initialisant. Si le module n'est pas trouvé, une :exc:`ModuleNotFoundError` est levée. Python implémente plusieurs stratégies pour rechercher le module d'un nom donné quand le mécanisme d'import est invoqué. Ces stratégies peuvent être modifiées et étendues par divers moyens décrits dans les sections suivantes.

source: The import system has been updated to fully implement the second phase of :pep:`302`. There is no longer any implicit import machinery - the full import system is exposed through :data:`sys.meta_path`. In addition, native namespace package support has been implemented (see :pep:`420`).
fr: Le système d'importation a été mis à jour pour implémenter complètement la deuxième partie de la :pep:`302`. Il n'existe plus de mécanisme implicite d'importation (le système d'importation complet est exposé *via* :data:`sys.meta_path`). En complément, la gestion du paquet des noms natifs a été implémenté (voir la :pep:`420`).

source: The :mod:`importlib` module provides a rich API for interacting with the import system. For example :func:`importlib.import_module` provides a recommended, simpler API than built-in :func:`__import__` for invoking the import machinery. Refer to the :mod:`importlib` library documentation for additional detail.
fr: Le module :mod:`importlib` fournit une API riche pour interagir avec le système d'import. Par exemple, :func:`importlib.import_module` fournit une API (que nous vous recommandons) plus simple que la fonction native :func:`__import__` pour mettre en œuvre le mécanisme d'import. Reportez-vous à la documentation de la bibliothèque :mod:`importlib` pour obtenir davantage de détails.

source: Packages
fr: Les paquets

source: Python has only one type of module object, and all modules are of this type, regardless of whether the module is implemented in Python, C, or something else. To help organize modules and provide a naming hierarchy, Python has a concept of :term:`packages <package>`.
fr: Python ne connait qu'un seul type d'objet module et tous les modules sont donc de ce type, que le module soit implémenté en Python, en C ou quoi que ce soit d'autre. Pour aider à l'organisation des modules et fournir une hiérarchie des noms, Python développe le concept de :term:`paquets <package>`.

source: You can think of packages as the directories on a file system and modules as files within directories, but don't take this analogy too literally since packages and modules need not originate from the file system. For the purposes of this documentation, we'll use this convenient analogy of directories and files. Like file system directories, packages are organized hierarchically, and packages may themselves contain subpackages, as well as regular modules.
fr: Vous pouvez vous représenter les paquets comme des répertoires dans le système de fichiers et les modules comme des fichiers dans ces répertoires. Mais ne prenez pas trop cette analogie au pied de la lettre car les paquets et les modules ne proviennent pas obligatoirement du système de fichiers. Dans le cadre de cette documentation, nous utilisons cette analogie bien pratique des répertoires et des fichiers. Comme les répertoires du système de fichiers, les paquets sont organisés de manière hiérarchique et les paquets peuvent eux-mêmes contenir des sous-paquets ou des modules.

source: It's important to keep in mind that all packages are modules, but not all modules are packages. Or put another way, packages are just a special kind of module. Specifically, any module that contains a ``__path__`` attribute is considered a package.
fr: Il est important de garder à l'esprit que tous les paquets sont des modules mais que tous les modules ne sont pas des paquets. Formulé autrement, les paquets sont juste un certain type de modules. Spécifiquement, tout module qui contient un attribut ``__path__`` est réputé être un paquet.

source: All modules have a name. Subpackage names are separated from their parent package name by dots, akin to Python's standard attribute access syntax. Thus you might have a module called :mod:`sys` and a package called :mod:`email`, which in turn has a subpackage called :mod:`email.mime` and a module within that subpackage called :mod:`email.mime.text`.
fr: Tous les modules ont un nom. Les noms des sous-paquets sont séparés du nom du paquet parent par des points (`.`), à l'instar de la syntaxe standard d'accès aux attributs en Python. Ainsi, vous pouvez avoir un module nommé :mod:`sys` et un paquet nommé :mod:`email`, qui à son tour possède un sous-paquet nommé :mod:`email.mime` avec un module dans ce sous-paquet nommé :mod:`email.mime.text`.

source: Regular packages
fr: Paquets classiques

source: Python defines two types of packages, :term:`regular packages <regular package>` and :term:`namespace packages <namespace package>`. Regular packages are traditional packages as they existed in Python 3.2 and earlier. A regular package is typically implemented as a directory containing an ``__init__.py`` file. When a regular package is imported, this ``__init__.py`` file is implicitly executed, and the objects it defines are bound to names in the package's namespace. The ``__init__.py`` file can contain the same Python code that any other module can contain, and Python will add some additional attributes to the module when it is imported.
fr: Python définit deux types de paquets, les :term:`paquets classiques <regular package>` et les :term:`paquets espaces de nommage <namespace package>`. Les paquets classiques sont les paquets traditionnels tels qu'ils existaient dans Python 3.2 et antérieurs. Un paquet classique est typiquement implémenté sous la forme d'un répertoire contenant un fichier ``__init__.py``. Quand un paquet classique est importé, ce fichier ``__init__.py`` est implicitement exécuté.

source: For example, the following file system layout defines a top level ``parent`` package with three subpackages::
fr: Par exemple, l'arborescence suivante définit un paquet ``parent`` au niveau le plus haut avec trois sous-paquets ::

source: Importing ``parent.one`` will implicitly execute ``parent/__init__.py`` and ``parent/one/__init__.py``. Subsequent imports of ``parent.two`` or ``parent.three`` will execute ``parent/two/__init__.py`` and ``parent/three/__init__.py`` respectively.
fr: Importer ``parent.one`` exécute implicitement ``parent/__init__.py`` et ``parent/one/__init__.py``. Les importations postérieures de ``parent.two`` ou ``parent.three`` respectivement exécutent ``parent/two/__init__.py`` ou ``parent/three/__init__.py`` respectivement.

source: Namespace packages
fr: Paquets espaces de nommage

source: A namespace package is a composite of various :term:`portions <portion>`, where each portion contributes a subpackage to the parent package. Portions may reside in different locations on the file system. Portions may also be found in zip files, on the network, or anywhere else that Python searches during import. Namespace packages may or may not correspond directly to objects on the file system; they may be virtual modules that have no concrete representation.
fr: Un paquet-espace de nommage est la combinaison de plusieurs :term:`portions <portion>` où chaque portion fournit un sous-paquet au paquet parent. Les portions peuvent être situées à différents endroits du système de fichiers. Les portions peuvent aussi être stockées dans des fichiers zip, sur le réseau ou à tout autre endroit dans lequel Python cherche pendant l'importation. Les paquets-espaces de nommage peuvent correspondre directement à des objets du système de fichiers, ou pas ; ils peuvent être des modules virtuels qui n'ont aucune représentation concrète.

source: Namespace packages do not use an ordinary list for their ``__path__`` attribute. They instead use a custom iterable type which will automatically perform a new search for package portions on the next import attempt within that package if the path of their parent package (or :data:`sys.path` for a top level package) changes.
fr: Les paquets-espaces de nommage n'utilisent pas une liste ordinaire pour leur attribut ``__path__``. Ils utilisent en lieu et place un type itérable personnalisé qui effectue automatiquement une nouvelle recherche de portions de paquets à la tentative suivante d'importation dans le paquet si le chemin de leur paquet parent (ou :data:`sys.path` pour les paquets de plus haut niveau) change.

source: With namespace packages, there is no ``parent/__init__.py`` file. In fact, there may be multiple ``parent`` directories found during import search, where each one is provided by a different portion. Thus ``parent/one`` may not be physically located next to ``parent/two``. In this case, Python will create a namespace package for the top-level ``parent`` package whenever it or one of its subpackages is imported.
fr: Pour les paquets-espaces de nommage, il n'existe pas de fichier ``parent/__init__.py``. En fait, il peut y avoir plusieurs répertoires ``parent`` trouvés pendant le processus d'importation, où chacun est apporté par une portion différente. Ainsi, ``parent/one`` n'est pas forcément physiquement à côté de ``parent/two``. Dans ce cas, Python crée un paquet-espace de nommage pour le paquet de plus haut niveau ``parent`` dès que lui ou l'un de ses sous-paquet est importé.

source: See also :pep:`420` for the namespace package specification.
fr: Voir aussi la :pep:`420` pour les spécifications des paquets-espaces de nommage.

source: Searching
fr: Recherche

source: To begin the search, Python needs the :term:`fully qualified <qualified name>` name of the module (or package, but for the purposes of this discussion, the difference is immaterial) being imported. This name may come from various arguments to the :keyword:`import` statement, or from the parameters to the :func:`importlib.import_module` or :func:`__import__` functions.
fr: Pour commencer la recherche, Python a besoin du :term:`nom qualifié <qualified name>` du module (ou du paquet, mais ici cela ne fait pas de différence) que vous souhaitez importer. Le nom peut être donné en argument à l'instruction :keyword:`import` ou comme paramètre aux fonctions :func:`importlib.import_module` ou :func:`__import__`.

source: This name will be used in various phases of the import search, and it may be the dotted path to a submodule, e.g. ``foo.bar.baz``. In this case, Python first tries to import ``foo``, then ``foo.bar``, and finally ``foo.bar.baz``. If any of the intermediate imports fail, a :exc:`ModuleNotFoundError` is raised.
fr: Le nom est utilisé dans plusieurs phases de la recherche et peut être un chemin séparé par des points pour un sous-module, par exemple ``truc.machin.bidule``. Dans ce cas, Python essaie d'abord d'importer ``truc`` puis ``truc.machin`` et enfin ``truc.machin.bidule``. Si n'importe laquelle des importations intermédiaires échoue, une :exc:`ModuleNotFoundError` est levée.

source: The module cache
fr: Cache des modules

source: The first place checked during import search is :data:`sys.modules`. This mapping serves as a cache of all modules that have been previously imported, including the intermediate paths. So if ``foo.bar.baz`` was previously imported, :data:`sys.modules` will contain entries for ``foo``, ``foo.bar``, and ``foo.bar.baz``. Each key will have as its value the corresponding module object.
fr: Le premier endroit vérifié pendant la recherche d'une importation est :data:`sys.modules`. Ce tableau de correspondances est utilisé comme cache de tous les modules déjà importés, y compris les chemins intermédiaires. Ainsi, si ``truc.machin.bidule`` a déjà été importé, :data:`sys.modules` contient les entrées correspondantes à ``truc``, ``truc.machin`` et ``truc.machin.bidule``. À chaque chemin correspond une clé.

source: During import, the module name is looked up in :data:`sys.modules` and if present, the associated value is the module satisfying the import, and the process completes. However, if the value is ``None``, then a :exc:`ModuleNotFoundError` is raised. If the module name is missing, Python will continue searching for the module.
fr: Pendant l'importation, le nom de module est cherché dans :data:`sys.modules` et, s'il est trouvé, la valeur associée est le module recherché et le processus est fini. Cependant, si la valeur est ``None``, alors une :exc:`ModuleNotFoundError` est levée. Si le nom du module n'est pas trouvé, Python continue la recherche du module.

source: :data:`sys.modules` is writable. Deleting a key may not destroy the associated module (as other modules may hold references to it), but it will invalidate the cache entry for the named module, causing Python to search anew for the named module upon its next import. The key can also be assigned to ``None``, forcing the next import of the module to result in a :exc:`ModuleNotFoundError`.
fr: :data:`sys.modules` est accessible en lecture-écriture. Supprimer une clé peut ne pas détruire le module associé (car d'autres modules contiennent possiblement des références vers ce module), mais cela invalide l'entrée du cache pour ce nom de module. Python cherche alors un nouveau module pour ce nom. La clé peut aussi être assignée à ``None`` de manière à forcer une :exc:`ModuleNotFoundError` lors de la prochaine importation du module.

source: Beware though, as if you keep a reference to the module object, invalidate its cache entry in :data:`sys.modules`, and then re-import the named module, the two module objects will *not* be the same. By contrast, :func:`importlib.reload` will reuse the *same* module object, and simply reinitialise the module contents by rerunning the module's code.
fr: Attention cependant : s'il reste une référence à l'objet module et que vous invalidez l'entrée dans le cache de :data:`sys.modules` puis ré-importez le module, les deux objets modules ne seront pas les mêmes. À l'inverse, :func:`importlib.reload` ré-utilise le *même* objet module et ré-initialise simplement le contenu du module en ré-exécutant le code du module.

source: Finders and loaders
fr: Chercheurs et chargeurs

source: If the named module is not found in :data:`sys.modules`, then Python's import protocol is invoked to find and load the module. This protocol consists of two conceptual objects, :term:`finders <finder>` and :term:`loaders <loader>`. A finder's job is to determine whether it can find the named module using whatever strategy it knows about. Objects that implement both of these interfaces are referred to as :term:`importers <importer>` - they return themselves when they find that they can load the requested module.
fr: Si le module n'est pas trouvé dans :data:`sys.modules`, alors Python utilise son protocole d'importation pour chercher et charger le module. Ce protocole se compose de deux objets conceptuels : les :term:`chercheurs <finder>` et les :term:`chargeurs <loader>`. Le travail du chercheur consiste à trouver, à l'aide de différentes stratégies, le module dont le nom a été fourni. Les objets qui implémentent ces deux interfaces sont connus sous le vocable ":term:`importateurs <importer>`" (ils renvoient une référence vers eux-mêmes quand ils trouvent un module qui répond aux attentes).

source: Python includes a number of default finders and importers. The first one knows how to locate built-in modules, and the second knows how to locate frozen modules. A third default finder searches an :term:`import path` for modules. The :term:`import path` is a list of locations that may name file system paths or zip files. It can also be extended to search for any locatable resource, such as those identified by URLs.
fr: Python inclut plusieurs chercheurs et importateurs par défaut. Le premier sait comment trouver les modules natifs et le deuxième sait comment trouver les modules gelés. Un troisième chercheur recherche les modules dans :term:`import path`. :term:`import path` est une énumération sous forme de liste de chemins ou de fichiers zip. Il peut être étendu pour rechercher aussi dans toute ressource qui dispose d'un identifiant pour la localiser, une URL par exemple.

source: The import machinery is extensible, so new finders can be added to extend the range and scope of module searching.
fr: Le mécanisme d'importation est extensible, vous pouvez donc ajouter de nouveaux chercheurs pour étendre le domaine de recherche des modules.

source: Finders do not actually load modules. If they can find the named module, they return a :dfn:`module spec`, an encapsulation of the module's import-related information, which the import machinery then uses when loading the module.
fr: Les chercheurs ne chargent pas les modules. S'il trouve le module demandé, un chercheur renvoie un :dfn:`spécificateur de module`, qui contient toutes les informations nécessaires pour importer le module ; celui-ci sera alors utilisé par le mécanisme d'importation pour charger le module.

source: The following sections describe the protocol for finders and loaders in more detail, including how you can create and register new ones to extend the import machinery.
fr: Les sections suivantes décrivent plus en détail le protocole utilisé par les chercheurs et les chargeurs, y compris la manière de les créer et les enregistrer pour étendre le mécanisme d'importation.

source: In previous versions of Python, finders returned :term:`loaders <loader>` directly, whereas now they return module specs which *contain* loaders. Loaders are still used during import but have fewer responsibilities.
fr: Dans les versions précédentes de Python, les chercheurs renvoyaient directement les :term:`chargeurs <loader>`. Dorénavant, ils renvoient des spécificateurs de modules qui *contiennent* les chargeurs. Les chargeurs sont encore utilisés lors de l'importation mais ont moins de responsabilités.

source: Import hooks
fr: Points d'entrées automatiques pour l'importation

source: The import machinery is designed to be extensible; the primary mechanism for this are the *import hooks*. There are two types of import hooks: *meta hooks* and *import path hooks*.
fr: Le mécanisme d'importation est conçu pour être extensible ; vous pouvez y insérer des *points d'entrée automatique* (*hooks* en anglais). Il existe deux types de points d'entrée automatique pour l'importation : les *méta-points d'entrée* et les *points d'entrée sur le chemin des importations*.

source: Meta hooks are called at the start of import processing, before any other import processing has occurred, other than :data:`sys.modules` cache look up. This allows meta hooks to override :data:`sys.path` processing, frozen modules, or even built-in modules. Meta hooks are registered by adding new finder objects to :data:`sys.meta_path`, as described below.
fr: Les méta-points d'entrée sont appelés au début du processus d'importation, juste après la vérification dans le cache :data:`sys.modules` mais avant tout le reste. Ceci permet aux méta-points d'entrée de surcharger le traitement effectué sur :data:`sys.path`, les modules gelés ou même les modules natifs. L'enregistrement des méta-points d'entrée se fait en ajoutant de nouveaux objets chercheurs à :data:`sys.meta_path`, comme décrit ci-dessous.

source: Import path hooks are called as part of :data:`sys.path` (or ``package.__path__``) processing, at the point where their associated path item is encountered. Import path hooks are registered by adding new callables to :data:`sys.path_hooks` as described below.
fr: Les points d'entrée sur le chemin des importations sont appelés pendant le traitement de :data:`sys.path` (ou ``package.__path__``), au moment où le chemin qui leur correspond est atteint. Les points d'entrée sur le chemin des importations sont enregistrés en ajoutant de nouveaux appelables à :data:`sys.path_hooks`, comme décrit ci-dessous.

source: The meta path
fr: Méta-chemins
