Repository: python/python-docs-fr
Catalog: reference/import.po
Languages: fr

source: When the named module is not found in :data:`sys.modules`, Python next searches :data:`sys.meta_path`, which contains a list of meta path finder objects. These finders are queried in order to see if they know how to handle the named module. Meta path finders must implement a method called :meth:`~importlib.abc.MetaPathFinder.find_spec()` which takes three arguments: a name, an import path, and (optionally) a target module. The meta path finder can use any strategy it wants to determine whether it can handle the named module or not.
fr: Quand le module demandé n'est pas trouvé dans :data:`sys.modules`, Python recherche alors dans :data:`sys.meta_path` qui contient une liste d'objets chercheurs dans des méta-chemins. Ces chercheurs sont interrogés dans l'ordre pour voir s'ils savent prendre en charge le module passé en paramètre. Les chercheurs dans les méta-chemins implémentent une méthode :meth:`~importlib.abc.MetaPathFinder.find_spec()` qui prend trois arguments : un nom, un chemin d'import et (optionnellement) un module cible. Un chercheur dans les méta-chemins peut utiliser n'importe quelle stratégie pour déterminer s'il est apte à prendre en charge le module.

source: If the meta path finder knows how to handle the named module, it returns a spec object. If it cannot handle the named module, it returns ``None``. If :data:`sys.meta_path` processing reaches the end of its list without returning a spec, then a :exc:`ModuleNotFoundError` is raised. Any other exceptions raised are simply propagated up, aborting the import process.
fr: Si un chercheur dans les méta-chemins sait prendre en charge le module donné, il renvoie un objet spécificateur. S'il ne sait pas, il renvoie ``None``. Si le traitement de :data:`sys.meta_path` arrive à la fin de la liste sans qu'aucun chercheur n'a renvoyé un objet spécificateur, alors une :exc:`ModuleNotFoundError` est levée. Toute autre exception levée est simplement propagée à l'appelant, mettant fin au processus d'importation.

source: The :meth:`~importlib.abc.MetaPathFinder.find_spec()` method of meta path finders is called with two or three arguments. The first is the fully qualified name of the module being imported, for example ``foo.bar.baz``. The second argument is the path entries to use for the module search. For top-level modules, the second argument is ``None``, but for submodules or subpackages, the second argument is the value of the parent package's ``__path__`` attribute. If the appropriate ``__path__`` attribute cannot be accessed, a :exc:`ModuleNotFoundError` is raised. The third argument is an existing module object that will be the target of loading later. The import system passes in a target module only during reload.
fr: La méthode :meth:`~importlib.abc.MetaPathFinder.find_spec()` des chercheurs dans les méta-chemins est appelée avec deux ou trois arguments. Le premier est le nom complètement qualifié du module à importer, par exemple ``truc.machin.bidule``. Le deuxième argument est l'ensemble des chemins dans lesquels chercher. Pour les modules de plus haut niveau, le deuxième argument est ``None`` mais pour les sous-modules ou les paquets, le deuxième argument est la valeur de l'attribut ``__path__`` du paquet parent. Si l'attribut ``__path__`` approprié n'est pas accessible, une :exc:`ModuleNotFoundError` est levée. Le troisième argument est un objet module existant qui va être la cible du chargement (plus tard). Le système d'importation ne passe le module cible en paramètre que lors d'un rechargement.

source: The meta path may be traversed multiple times for a single import request. For example, assuming none of the modules involved has already been cached, importing ``foo.bar.baz`` will first perform a top level import, calling ``mpf.find_spec("foo", None, None)`` on each meta path finder (``mpf``). After ``foo`` has been imported, ``foo.bar`` will be imported by traversing the meta path a second time, calling ``mpf.find_spec("foo.bar", foo.__path__, None)``. Once ``foo.bar`` has been imported, the final traversal will call ``mpf.find_spec("foo.bar.baz", foo.bar.__path__, None)``.
fr: Le méta-chemin peut être parcouru plusieurs fois pour une seule requête d'importation. Par exemple, si nous supposons qu'aucun des modules concernés n'a déjà été mis en cache, importer ``truc.machin.bidule`` effectue une première importation au niveau le plus haut, en appelant ``c_m_c.find_spec("truc", None, None)`` pour chaque chercheur dans les méta-chemins (``c_m_c``). Après que ``truc`` a été importé, ``truc.machin`` est importé en parcourant le méta-chemin une deuxième fois, appelant ``c_m_c.find_spec("truc.machin", truc.__path__, None)``. Une fois ``truc.machin`` importé, le parcours final appelle ``c_m_c.find_spec("truc.machin.bidule", truc.machin.__path__, None)``.

source: Some meta path finders only support top level imports. These importers will always return ``None`` when anything other than ``None`` is passed as the second argument.
fr: Quelques chercheurs dans les méta-chemins ne gèrent que les importations de plus haut niveau. Ces importateurs renvoient toujours ``None`` si on leur passe un deuxième argument autre que ``None``.

source: Python's default :data:`sys.meta_path` has three meta path finders, one that knows how to import built-in modules, one that knows how to import frozen modules, and one that knows how to import modules from an :term:`import path` (i.e. the :term:`path based finder`).
fr: Le :data:`sys.meta_path` de Python comprend trois chercheurs par défaut : un qui sait importer les modules natifs, un qui sait importer les modules gelés et un qui sait importer les modules depuis un :term:`chemin des importations <import path>` (c'est le :term:`chercheur dans path <path based finder>`).

source: The :meth:`~importlib.abc.MetaPathFinder.find_spec` method of meta path finders replaced :meth:`~importlib.abc.MetaPathFinder.find_module`, which is now deprecated. While it will continue to work without change, the import machinery will try it only if the finder does not implement ``find_spec()``.
fr: La méthode :meth:`~importlib.abc.MetaPathFinder.find_spec` des chercheurs dans les méta-chemins a remplacé :meth:`~importlib.abc.MetaPathFinder.find_module`, devenue obsolète. Bien qu'elle continue de fonctionner comme avant, le mécanisme d'importation essaie ``find_module()`` uniquement si le chercheur n'implémente pas ``find_spec()``.

source: Loading
fr: Chargement

source: If and when a module spec is found, the import machinery will use it (and the loader it contains) when loading the module. Here is an approximation of what happens during the loading portion of import::
fr: Quand un spécificateur de module est trouvé, le mécanisme d'importation l'utilise (et le chargeur qu'il contient) pour charger le module. Voici à peu près ce qui se passe au sein de l'importation pendant la phase de chargement ::

source: Note the following details:
fr: Notez les détails suivants :

source: If there is an existing module object with the given name in :data:`sys.modules`, import will have already returned it.
fr: S'il existe un objet module dans :data:`sys.modules` avec le même nom, import l'aurait déjà renvoyé.

source: The module will exist in :data:`sys.modules` before the loader executes the module code. This is crucial because the module code may (directly or indirectly) import itself; adding it to :data:`sys.modules` beforehand prevents unbounded recursion in the worst case and multiple loading in the best.
fr: Le module existe dans :data:`sys.modules` avant que le chargeur exécute le code du module. C'est crucial car le code du module peut (directement ou indirectement) s'importer lui-même ; l'ajouter à :data:`sys.modules` avant évite les récursions infinies dans le pire cas et le chargement multiple dans le meilleur des cas.

source: If loading fails, the failing module -- and only the failing module -- gets removed from :data:`sys.modules`. Any module already in the :data:`sys.modules` cache, and any module that was successfully loaded as a side-effect, must remain in the cache. This contrasts with reloading where even the failing module is left in :data:`sys.modules`.
fr: Si le chargement échoue, le module en cause (et seulement ce module) est enlevé de :data:`sys.modules`. Tout module déjà dans le cache de :data:`sys.modules` et tout module qui a été chargé avec succès par effet de bord doit rester dans le cache. C'est différent dans le cas d'un rechargement où même le module qui a échoué est conservé dans :data:`sys.modules`.

source: After the module is created but before execution, the import machinery sets the import-related module attributes ("_init_module_attrs" in the pseudo-code example above), as summarized in a :ref:`later section <import-mod-attrs>`.
fr: Après que le module est créé mais avant son exécution, le mécanisme d'importation définit les attributs relatifs à l'importation (``_init_module_attrs`` dans l'exemple de pseudo-code ci-dessus), comme indiqué brièvement dans une :ref:`section <import-mod-attrs>` que nous abordons ensuite.

source: Module execution is the key moment of loading in which the module's namespace gets populated. Execution is entirely delegated to the loader, which gets to decide what gets populated and how.
fr: L'exécution du module est le moment clé du chargement dans lequel l'espace de nommage du module est peuplé. L'exécution est entièrement déléguée au chargeur qui doit décider ce qui est peuplé et comment.

source: The module created during loading and passed to exec_module() may not be the one returned at the end of import [#fnlo]_.
fr: Le modulé créé pendant le chargement et passé à ``exec_module()`` peut ne pas être celui qui est renvoyé à la fin de l'importation [#fnlo]_.

source: The import system has taken over the boilerplate responsibilities of loaders. These were previously performed by the :meth:`importlib.abc.Loader.load_module` method.
fr: Le système d'importation a pris en charge les responsabilités des chargeurs. Celles-ci étaient auparavant effectuées par la méthode :meth:`importlib.abc.Loader.load_module`.

source: Loaders
fr: Chargeurs

source: Module loaders provide the critical function of loading: module execution. The import machinery calls the :meth:`importlib.abc.Loader.exec_module` method with a single argument, the module object to execute. Any value returned from :meth:`~importlib.abc.Loader.exec_module` is ignored.
fr: Les chargeurs de modules fournissent la fonction critique du chargement : l'exécution du module. Le mécanisme d'importation appelle la méthode :meth:`importlib.abc.Loader.exec_module` avec un unique argument, l'objet module à exécuter. Toute valeur renvoyée par :meth:`~importlib.abc.Loader.exec_module` est ignorée.

source: Loaders must satisfy the following requirements:
fr: Les chargeurs doivent satisfaire les conditions suivantes :

source: If the module is a Python module (as opposed to a built-in module or a dynamically loaded extension), the loader should execute the module's code in the module's global name space (``module.__dict__``).
fr: Si le module est un module Python (par opposition aux modules natifs ou aux extensions chargées dynamiquement), le chargeur doit exécuter le code du module dans l'espace des noms globaux du module (``module.__dict__``).

source: If the loader cannot execute the module, it should raise an :exc:`ImportError`, although any other exception raised during :meth:`~importlib.abc.Loader.exec_module` will be propagated.
fr: Si le chargeur ne peut pas exécuter le module, il doit lever une :exc:`ImportError`, alors que toute autre exception levée durant :meth:`~importlib.abc.Loader.exec_module` est propagée.

source: In many cases, the finder and loader can be the same object; in such cases the :meth:`~importlib.abc.MetaPathFinder.find_spec` method would just return a spec with the loader set to ``self``.
fr: Souvent, le chercheur et le chargeur sont le même objet ; dans ce cas, la méthode :meth:`~importlib.abc.MetaPathFinder.find_spec` doit juste renvoyer un spécificateur avec le chargeur défini à ``self``.

source: Module loaders may opt in to creating the module object during loading by implementing a :meth:`~importlib.abc.Loader.create_module` method. It takes one argument, the module spec, and returns the new module object to use during loading. ``create_module()`` does not need to set any attributes on the module object. If the method returns ``None``, the import machinery will create the new module itself.
fr: Les chargeurs de modules peuvent choisir de créer l'objet module pendant le chargement en implémentant une méthode :meth:`~importlib.abc.Loader.create_module`. Elle prend un argument, l'objet spécificateur du module et renvoie le nouvel objet du module à utiliser pendant le chargement. Notez que ``create_module()`` n'a besoin de définir aucun attribut sur l'objet module. Si cette méthode renvoie ``None``, le mécanisme d'importation crée le nouveau module lui-même.

source: The :meth:`~importlib.abc.Loader.create_module` method of loaders.
fr: La méthode :meth:`~importlib.abc.Loader.create_module` des chargeurs.

source: The :meth:`~importlib.abc.Loader.load_module` method was replaced by :meth:`~importlib.abc.Loader.exec_module` and the import machinery assumed all the boilerplate responsibilities of loading.
fr: La méthode :meth:`~importlib.abc.Loader.load_module` a été remplacée par :meth:`~importlib.abc.Loader.exec_module` et le mécanisme d'import assume toutes les responsabilités du chargement.

source: For compatibility with existing loaders, the import machinery will use the ``load_module()`` method of loaders if it exists and the loader does not also implement ``exec_module()``. However, ``load_module()`` has been deprecated and loaders should implement ``exec_module()`` instead.
fr: Par compatibilité avec les chargeurs existants, le mécanisme d'importation utilise la méthode ``load_module()`` des chargeurs si elle existe et si le chargeur n'implémente pas ``exec_module()``. Cependant, ``load_module()`` est déclarée obsolète et les chargeurs doivent implémenter ``exec_module()`` à la place.

source: The ``load_module()`` method must implement all the boilerplate loading functionality described above in addition to executing the module. All the same constraints apply, with some additional clarification:
fr: La méthode ``load_module()`` *doit* implémenter toutes les fonctionnalités de chargement décrites ci-dessus en plus de l'exécution du module. Toutes les contraintes s'appliquent aussi, avec quelques précisions supplémentaires :

source: If there is an existing module object with the given name in :data:`sys.modules`, the loader must use that existing module. (Otherwise, :func:`importlib.reload` will not work correctly.) If the named module does not exist in :data:`sys.modules`, the loader must create a new module object and add it to :data:`sys.modules`.
fr: S'il y a un objet module existant avec le même nom dans :data:`sys.modules`, le chargeur doit utiliser le module existant (sinon, :func:`importlib.reload` ne fonctionnera pas correctement). Si le module considéré n'est pas trouvé dans :data:`sys.modules`, le chargeur doit créer un nouvel objet module et l'ajouter à :data:`sys.modules`.

source: The module *must* exist in :data:`sys.modules` before the loader executes the module code, to prevent unbounded recursion or multiple loading.
fr: Le module *doit* exister dans :data:`sys.modules` avant que le chargeur n'exécute le code du module, afin d'éviter les récursions infinies ou le chargement multiple.

source: If loading fails, the loader must remove any modules it has inserted into :data:`sys.modules`, but it must remove **only** the failing module(s), and only if the loader itself has loaded the module(s) explicitly.
fr: Si le chargement échoue, le chargeur ne doit enlever de :data:`sys.modules` **que** le (ou les) module ayant échoué et seulement si le chargeur lui-même a chargé le module explicitement.

source: A :exc:`DeprecationWarning` is raised when ``exec_module()`` is defined but ``create_module()`` is not.
fr: Un avertissement :exc:`DeprecationWarning` est levé quand ``exec_module()`` est définie mais ``create_module()`` ne l'est pas.

source: An :exc:`ImportError` is raised when ``exec_module()`` is defined but ``create_module()`` is not.
fr: Une exception :exc:`ImportError` est levée quand ``exec_module()`` est définie mais ``create_module()`` ne l'est pas.

source: Submodules
fr: Sous-modules

source: When a submodule is loaded using any mechanism (e.g. ``importlib`` APIs, the ``import`` or ``import-from`` statements, or built-in ``__import__()``) a binding is placed in the parent module's namespace to the submodule object. For example, if package ``spam`` has a submodule ``foo``, after importing ``spam.foo``, ``spam`` will have an attribute ``foo`` which is bound to the submodule. Let's say you have the following directory structure::
fr: Quand un sous-module est chargé, quel que soit le mécanisme (par exemple avec les instructions ``import``, ``import-from`` ou avec la fonction native ``__import__()``), une liaison est créée dans l'espace de nommage du module parent vers l'objet sous-module. Par exemple, si le paquet ``spam`` possède un sous-module ``foo``, après l'importation de ``spam.foo``, ``spam`` possède un attribut ``foo`` qui est lié au sous-module. Supposons que nous ayons l'arborescence suivante ::

source: and ``spam/__init__.py`` has the following lines in it::
fr: et que le contenu de ``spam/__init__.py`` soit ::

source: then executing the following puts a name binding to ``foo`` and ``bar`` in the ``spam`` module::
fr: alors exécuter les lignes suivantes crée des liens vers ``foo`` et ``bar`` dans le module ``spam`` ::

source: Given Python's familiar name binding rules this might seem surprising, but it's actually a fundamental feature of the import system. The invariant holding is that if you have ``sys.modules['spam']`` and ``sys.modules['spam.foo']`` (as you would after the above import), the latter must appear as the ``foo`` attribute of the former.
fr: Connaissant la façon habituelle dont Python effectue les liens, cela peut sembler surprenant. Mais c'est en fait une fonctionnalité fondamentale du système d'importation. Si vous avez quelque part ``sys.modules['spam']`` et ``sys.modules['spam.foo']`` (comme dans c'est le cas ci-dessus après l'importation), alors le dernier doit apparaître comme l'attribut ``foo`` du premier.

source: Module spec
fr: Spécificateurs de modules

source: The import machinery uses a variety of information about each module during import, especially before loading. Most of the information is common to all modules. The purpose of a module's spec is to encapsulate this import-related information on a per-module basis.
fr: Le mécanisme d'importation utilise diverses informations de chaque module pendant l'importation, spécialement avant le chargement. La plupart de ces informations sont communes à tous les modules. Le but d'un spécificateur de module est d'encapsuler ces informations relatives à l'importation au sein de chaque module.

source: Using a spec during import allows state to be transferred between import system components, e.g. between the finder that creates the module spec and the loader that executes it. Most importantly, it allows the import machinery to perform the boilerplate operations of loading, whereas without a module spec the loader had that responsibility.
fr: Utiliser un spécificateur pendant l'importation permet de transférer l'état entre les composants du système d'importation, par exemple entre le chercheur qui crée le spécificateur de module et le chargeur qui l'exécute. Surtout, cela permet au mécanisme d'importation d'effectuer toutes les opérations classiques de chargement, alors que c'était le chargeur qui en avait la responsabilité quand il n'y avait pas de spécificateur.

source: The module's spec is exposed as the ``__spec__`` attribute on a module object. See :class:`~importlib.machinery.ModuleSpec` for details on the contents of the module spec.
fr: Le spécificateur de module est accessible par l'attribut ``__spec__`` de l'objet module. Lisez :class:`~importlib.machinery.ModuleSpec` pour davantage d'informations sur le contenu du spécificateur de module.

source: Import-related module attributes
fr: Attributs des modules importés

source: The import machinery fills in these attributes on each module object during loading, based on the module's spec, before the loader executes the module.
fr: Le mécanisme d'importation renseigne ces attributs pour chaque objet module pendant le chargement, sur la base du spécificateur de module et avant que le chargeur n'exécute le module.

source: The ``__name__`` attribute must be set to the fully-qualified name of the module. This name is used to uniquely identify the module in the import system.
fr: L'attribut ``__name__`` doit contenir le nom complètement qualifié du module. Ce nom est utilisé pour identifier de manière non équivoque le module dans le mécanisme d'importation.

source: The ``__loader__`` attribute must be set to the loader object that the import machinery used when loading the module. This is mostly for introspection, but can be used for additional loader-specific functionality, for example getting data associated with a loader.
fr: L'attribut ``__loader__`` doit pointer vers l'objet chargeur que le mécanisme d'importation a utilisé pour charger le module. L'utilisation principale concerne l'introspection, mais il peut être utilisé pour d'autres fonctionnalités relatives au chargement. Par exemple, obtenir des données par l'intermédiaire du chargeur.

source: The module's ``__package__`` attribute must be set. Its value must be a string, but it can be the same value as its ``__name__``. When the module is a package, its ``__package__`` value should be set to its ``__name__``. When the module is not a package, ``__package__`` should be set to the empty string for top-level modules, or for submodules, to the parent package's name. See :pep:`366` for further details.
fr: L'attribut ``__package__`` du module doit être défini. Sa valeur doit être une chaîne de caractères, qui peut être la même que son attribut ``__name__``. Quand le module est un paquet, la valeur de ``__package__`` doit être définie à la même valeur que son ``__name__``. Quand le module n'est pas un paquet, ``__package__`` doit être la chaîne vide pour les modules de niveau le plus haut, et le nom du paquet parent pour les sous-modules. Voir la :pep:`366` pour plus de détails.

source: This attribute is used instead of ``__name__`` to calculate explicit relative imports for main modules, as defined in :pep:`366`. It is expected to have the same value as ``__spec__.parent``.
fr: Cet attribut est utilisé à la place de ``__name__`` pour calculer les importations relatives explicites des modules principaux, comme défini dans la :pep:`366`. Il devrait avoir la même valeur que ``__spec__.parent``.

source: The value of ``__package__`` is expected to be the same as ``__spec__.parent``.
fr: La valeur de ``__package__`` devrait être la même que celle de ``__spec__.parent``.
