Repository: python/python-docs-fr
Catalog: reference/import.po
Languages: fr

source: The path based finder iterates over every entry in the search path, and for each of these, looks for an appropriate :term:`path entry finder` (:class:`~importlib.abc.PathEntryFinder`) for the path entry. Because this can be an expensive operation (e.g. there may be `stat()` call overheads for this search), the path based finder maintains a cache mapping path entries to path entry finders. This cache is maintained in :data:`sys.path_importer_cache` (despite the name, this cache actually stores finder objects rather than being limited to :term:`importer` objects). In this way, the expensive search for a particular :term:`path entry` location's :term:`path entry finder` need only be done once. User code is free to remove cache entries from :data:`sys.path_importer_cache` forcing the path based finder to perform the path entry search again [#fnpic]_.
fr: Le chercheur dans *path* itère sur chaque entrée dans le *path* et, pour chacune, regarde s'il trouve un :term:`chercheur d'entrée dans path <path entry finder>` (:class:`~importlib.abc.PathEntryFinder`) approprié à cette entrée. Comme cette opération est coûteuse (elle peut faire appel à plusieurs `stat()` pour cela), le chercheur dans *path* maintient un cache de correspondance entre les entrées et les "chercheurs d'entrée dans *path*". Ce cache est géré par :data:`sys.path_importer_cache` (en dépit de son nom, ce cache stocke les objets chercheurs plutôt que les simples objets :term:`importateurs <importer>`). Ainsi, la recherche coûteuse pour une :term:`entrée de path <path entry>` spécifique n'a besoin d'être effectuée qu'une seule fois par le :term:`chercheur d'entrée dans path <path entry finder>`. Le code de l'utilisateur peut très bien supprimer les entrées du cache :data:`sys.path_importer_cache`, forçant ainsi le chercheur dans *path* à effectuer une nouvelle fois la recherche sur chaque entrée [#fnpic]_.

source: If the path entry is not present in the cache, the path based finder iterates over every callable in :data:`sys.path_hooks`. Each of the :term:`path entry hooks <path entry hook>` in this list is called with a single argument, the path entry to be searched. This callable may either return a :term:`path entry finder` that can handle the path entry, or it may raise :exc:`ImportError`. An :exc:`ImportError` is used by the path based finder to signal that the hook cannot find a :term:`path entry finder` for that :term:`path entry`. The exception is ignored and :term:`import path` iteration continues. The hook should expect either a string or bytes object; the encoding of bytes objects is up to the hook (e.g. it may be a file system encoding, UTF-8, or something else), and if the hook cannot decode the argument, it should raise :exc:`ImportError`.
fr: Si une entrée n'est pas présente dans le cache, le chercheur dans *path* itère sur chaque *callable* de :data:`sys.path_hooks`. Chaque :term:`point d'entrée sur une entrée de path <path entry hook>` de cette liste est appelé avec un unique argument, l'entrée dans laquelle chercher. L'appelable peut soit renvoyer un :term:`chercheur d'entrée dans path <path entry finder>` apte à prendre en charge l'entrée ou lever une :exc:`ImportError`. Une :exc:`ImportError` est utilisée par le chercheur dans *path* pour signaler que le point d'entrée n'a pas trouvé de :term:`chercheur d'entrée dans path <path entry finder>` pour cette :term:`entrée <path entry>`. L'exception est ignorée et l'itération sur le :term:`chemin des importations <import path>` se poursuit. Le point d'entrée doit attendre qu'on lui passe soit une chaîne de caractères soit une chaîne d'octets ; l'encodage des chaînes d'octets est à la main du point d'entrée (par exemple, ce peut être l'encodage du système de fichiers, de l'UTF-8 ou autre chose) et, si le point d'entrée n'arrive pas à décoder l'argument, il doit lever une :exc:`ImportError`.

source: If :data:`sys.path_hooks` iteration ends with no :term:`path entry finder` being returned, then the path based finder's :meth:`~importlib.machinery.PathFinder.find_spec` method will store ``None`` in :data:`sys.path_importer_cache` (to indicate that there is no finder for this path entry) and return ``None``, indicating that this :term:`meta path finder` could not find the module.
fr: Si l'itération sur :data:`sys.path_hooks` se termine sans qu'aucun :term:`chercheur d'entrée dans path <path entry finder>` ne soit renvoyé, alors la méthode :meth:`~importlib.machinery.PathFinder.find_spec` du chercheur dans *path* stocke ``None`` dans le :data:`sys.path_importer_cache` (pour indiquer qu'il n'y a pas de chercheur pour cette entrée) et renvoie ``None``, indiquant que ce :term:`chercheur dans les méta-chemins <meta path finder>` n'a pas trouvé le module.

source: If a :term:`path entry finder` *is* returned by one of the :term:`path entry hook` callables on :data:`sys.path_hooks`, then the following protocol is used to ask the finder for a module spec, which is then used when loading the module.
fr: Si un :term:`chercheur d'entrée dans path <path entry finder>` *est* renvoyé par un des :term:`points d'entrée <path entry hook>` de :data:`sys.path_hooks`, alors le protocole suivant est utilisé pour demander un spécificateur de module au chercheur, spécificateur qui sera utilisé pour charger le module.

source: The current working directory -- denoted by an empty string -- is handled slightly differently from other entries on :data:`sys.path`. First, if the current working directory is found to not exist, no value is stored in :data:`sys.path_importer_cache`. Second, the value for the current working directory is looked up fresh for each module lookup. Third, the path used for :data:`sys.path_importer_cache` and returned by :meth:`importlib.machinery.PathFinder.find_spec` will be the actual current working directory and not the empty string.
fr: Le répertoire de travail courant — noté sous la forme d'une chaîne de caractères vide — est géré d'une manière légèrement différente des autres entrées de :data:`sys.path`. D'abord, si le répertoire de travail courant s'avère ne pas exister, aucune valeur n'est stockée dans :data:`sys.path_importer_cache`. Ensuite, la valeur pour le répertoire de travail courant est vérifiée à chaque recherche de module. Enfin, le chemin utilisé pour :data:`sys.path_importer_cache` et renvoyée par :meth:`importlib.machinery.PathFinder.find_spec` est le nom réel du répertoire de travail courant et non pas la chaîne vide.

source: Path entry finder protocol
fr: Protocole des chercheurs d'entrée dans *path*

source: In order to support imports of modules and initialized packages and also to contribute portions to namespace packages, path entry finders must implement the :meth:`~importlib.abc.PathEntryFinder.find_spec` method.
fr: Afin de gérer les importations de modules, l'initialisation des paquets et d'être capables de contribuer aux portions des paquets-espaces de nommage, les chercheurs d'entrée dans *path* doivent implémenter la méthode :meth:`~importlib.abc.PathEntryFinder.find_spec`.

source: :meth:`~importlib.abc.PathEntryFinder.find_spec` takes two arguments: the fully qualified name of the module being imported, and the (optional) target module. ``find_spec()`` returns a fully populated spec for the module. This spec will always have "loader" set (with one exception).
fr: La méthode :meth:`~importlib.abc.PathEntryFinder.find_spec` prend deux arguments : le nom complètement qualifié du module en cours d'importation et (optionnellement) le module cible. ``find_spec()`` renvoie un spécificateur de module pleinement peuplé. Ce spécificateur doit avoir son chargeur (attribut `loader`) défini, à une exception près.

source: To indicate to the import machinery that the spec represents a namespace :term:`portion`. the path entry finder sets "loader" on the spec to ``None`` and "submodule_search_locations" to a list containing the portion.
fr: Pour indiquer au mécanisme d'importation que le spécificateur représente une :term:`portion <portion>` d'un espace de nommage, le chercheur d'entrée dans *path* définit le chargeur du spécificateur à ``None`` et l'attribut *submodule_search_locations* à une liste contenant la portion.

source: :meth:`~importlib.abc.PathEntryFinder.find_spec` replaced :meth:`~importlib.abc.PathEntryFinder.find_loader` and :meth:`~importlib.abc.PathEntryFinder.find_module`, both of which are now deprecated, but will be used if ``find_spec()`` is not defined.
fr: La méthode :meth:`~importlib.abc.PathEntryFinder.find_spec` remplace :meth:`~importlib.abc.PathEntryFinder.find_loader` et :meth:`~importlib.abc.PathEntryFinder.find_module`, ces deux méthodes étant dorénavant obsolètes mais restant utilisées si ``find_spec()`` n'est pas définie.

source: Older path entry finders may implement one of these two deprecated methods instead of ``find_spec()``. The methods are still respected for the sake of backward compatibility. However, if ``find_spec()`` is implemented on the path entry finder, the legacy methods are ignored.
fr: Les vieux chercheurs d'entrée dans *path* peuvent implémenter une des deux méthodes obsolètes à la place de ``find_spec()``. Ces méthodes sont toujours prises en compte dans le cadre de la compatibilité descendante. Cependant, si ``find_spec()`` est implémentée par le chercheur d'entrée dans *path*, les méthodes historiques sont ignorées.

source: :meth:`~importlib.abc.PathEntryFinder.find_loader` takes one argument, the fully qualified name of the module being imported. ``find_loader()`` returns a 2-tuple where the first item is the loader and the second item is a namespace :term:`portion`. When the first item (i.e. the loader) is ``None``, this means that while the path entry finder does not have a loader for the named module, it knows that the path entry contributes to a namespace portion for the named module. This will almost always be the case where Python is asked to import a namespace package that has no physical presence on the file system. When a path entry finder returns ``None`` for the loader, the second item of the 2-tuple return value must be a sequence, although it can be empty.
fr: La méthode :meth:`~importlib.abc.PathEntryFinder.find_loader` prend un argument, le nom complètement qualifié du module en cours d'importation. ``find_loader()`` renvoie un couple dont le premier élément est le chargeur et le second est une :term:`portion <portion>` d'espace de nommage. Quand le premier élément (c'est-à-dire le chargeur) est ``None``, cela signifie que, bien que le chercheur d'entrée dans *path* n'a pas de chargeur pour le module considéré, il sait que cette entrée contribue à une portion d'espace de nommage pour le module considéré. C'est presque toujours le cas quand vous demandez à Python d'importer un paquet-espace de nommage qui n'est pas présent physiquement sur le système de fichiers. Quand un chercheur d'entrée dans *path* renvoie ``None`` pour le chargeur, la valeur du second élément du couple renvoyé doit être une séquence, éventuellement vide.

source: If ``find_loader()`` returns a non-``None`` loader value, the portion is ignored and the loader is returned from the path based finder, terminating the search through the path entries.
fr: Si ``find_loader()`` renvoie une valeur de chargeur qui n'est pas ``None``, la portion est ignorée et le chargeur est renvoyé par le chercheur dans *path*, mettant un terme à la recherche dans les chemins.

source: For backwards compatibility with other implementations of the import protocol, many path entry finders also support the same, traditional ``find_module()`` method that meta path finders support. However path entry finder ``find_module()`` methods are never called with a ``path`` argument (they are expected to record the appropriate path information from the initial call to the path hook).
fr: À fin de compatibilité descendante avec d'autres implémentations du protocole d'importation, beaucoup de chercheurs d'entrée dans *path* gèrent aussi la méthode traditionnelle ``find_module()`` que l'on trouve dans les chercheurs dans les méta-chemins. Cependant, les méthodes ``find_module()`` des chercheurs d'entrée dans *path* ne sont jamais appelées avec un argument *path* (il est convenu qu'elles enregistrent les informations relatives au chemin approprié au moment de leur appel initial au point d'entrée).

source: The ``find_module()`` method on path entry finders is deprecated, as it does not allow the path entry finder to contribute portions to namespace packages. If both ``find_loader()`` and ``find_module()`` exist on a path entry finder, the import system will always call ``find_loader()`` in preference to ``find_module()``.
fr: La méthode ``find_module()`` des chercheurs d'entrée dans *path* est obsolète car elle n'autorise pas le chercheur d'entrée dans *path* à contribuer aux portions d'espaces de nommage des paquets-espaces de nommage. Si à la fois ``find_loader()`` et ``find_module()`` sont définies pour un chercheur d'entrée dans *path*, le système d'importation utilise toujours ``find_loader()`` plutôt que ``find_module()``.

source: Replacing the standard import system
fr: Remplacement du système d'importation standard

source: The most reliable mechanism for replacing the entire import system is to delete the default contents of :data:`sys.meta_path`, replacing them entirely with a custom meta path hook.
fr: La manière la plus fiable de remplacer tout le système d'importation est de supprimer le contenu par défaut de :data:`sys.meta_path` et de le remplacer complètement par un chercheur dans les méta-chemins sur mesure.

source: If it is acceptable to only alter the behaviour of import statements without affecting other APIs that access the import system, then replacing the builtin :func:`__import__` function may be sufficient. This technique may also be employed at the module level to only alter the behaviour of import statements within that module.
fr: S'il convient juste de modifier le comportement de l'instruction import sans affecter les autres API qui utilisent le système d'importation, alors remplacer la fonction native :func:`__import__` peut être suffisant. Cette technique peut aussi être employée au niveau d'un module pour n'altérer le comportement des importations qu'à l'intérieur de ce module.

source: To selectively prevent the import of some modules from a hook early on the meta path (rather than disabling the standard import system entirely), it is sufficient to raise :exc:`ModuleNotFoundError` directly from :meth:`~importlib.abc.MetaPathFinder.find_spec` instead of returning ``None``. The latter indicates that the meta path search should continue, while raising an exception terminates it immediately.
fr: Pour empêcher sélectivement l'importation de certains modules par un point d'entrée placé en tête dans le méta-chemin (plutôt que de désactiver complètement le système d'importation), il suffit de lever une :exc:`ModuleNotFoundError` directement depuis :meth:`~importlib.abc.MetaPathFinder.find_spec` au lieu de renvoyer ``None``. En effet, ce dernier indique que la recherche dans le méta-chemin peut continuer alors que la levée de l'exception termine immédiatement la recherche.

source: Package Relative Imports
fr: Importations relatives au paquet

source: Relative imports use leading dots. A single leading dot indicates a relative import, starting with the current package. Two or more leading dots indicate a relative import to the parent(s) of the current package, one level per dot after the first. For example, given the following package layout::
fr: Les importations relatives commencent par une suite de points. Un seul point avant indique une importation relative, démarrant avec le paquet actuel. Deux points ou plus avant indiquent une importation relative au parent du paquet actuel, un niveau par point avant le premier. Par exemple, en ayant le contenu suivant ::

source: In either ``subpackage1/moduleX.py`` or ``subpackage1/__init__.py``, the following are valid relative imports::
fr: Dans ``subpackage1/moduleX.py`` ou ``subpackage1/__init__.py``, les importations suivantes sont des importations relatives valides ::

source: Absolute imports may use either the ``import <>`` or ``from <> import <>`` syntax, but relative imports may only use the second form; the reason for this is that::
fr: Les importations absolues peuvent utiliser soit la syntaxe ``import <>``, soit ``from <> import <>``, mais les importations relatives doivent seulement utiliser la deuxième forme, la raison étant ::

source: should expose ``XXX.YYY.ZZZ`` as a usable expression, but .moduleY is not a valid expression.
fr: devrait exposer ``XXX.YYY.ZZZ`` comme une expression utilisable, mais ``.moduleY`` n’est pas une expression valide.

source: Special considerations for __main__
fr: Cas particulier de ``__main__``

source: The :mod:`__main__` module is a special case relative to Python's import system. As noted :ref:`elsewhere <programs>`, the ``__main__`` module is directly initialized at interpreter startup, much like :mod:`sys` and :mod:`builtins`. However, unlike those two, it doesn't strictly qualify as a built-in module. This is because the manner in which ``__main__`` is initialized depends on the flags and other options with which the interpreter is invoked.
fr: Le module :mod:`__main__` est un cas particulier pour le système d'importation de Python. Comme indiqué par :ref:`ailleurs <programs>`, le module ``__main__`` est initialisé directement au démarrage de l'interpréteur, un peu comme :mod:`sys` et :mod:`builtins`. Cependant, au contraire des deux cités précédemment, ce n'est pas vraiment un module natif. Effectivement, la manière dont est initialisé ``__main__`` dépend des drapeaux et options avec lesquels l'interpréteur est lancé.

source: Depending on how :mod:`__main__` is initialized, ``__main__.__spec__`` gets set appropriately or to ``None``.
fr: En fonction de la manière dont :mod:`__main__` est initialisé, ``__main__.__spec__`` est défini de manière conforme ou mis à ``None``.

source: When Python is started with the :option:`-m` option, ``__spec__`` is set to the module spec of the corresponding module or package. ``__spec__`` is also populated when the ``__main__`` module is loaded as part of executing a directory, zipfile or other :data:`sys.path` entry.
fr: Quand Python est démarré avec l'option :option:`-m`, ``__spec__`` est défini à la valeur du spécificateur du module ou paquet correspondant. Python peuple aussi ``__spec__`` quand le module ``__main__`` est chargé en tant que partie de l'exécution d'un répertoire, d'un fichier zip ou d'une entrée de :data:`sys.path`.

source: In :ref:`the remaining cases <using-on-interface-options>` ``__main__.__spec__`` is set to ``None``, as the code used to populate the :mod:`__main__` does not correspond directly with an importable module:
fr: Dans :ref:`les autres cas <using-on-interface-options>`, ``__main__.__spec__`` est mis à ``None``, car le code qui peuple :mod:`__main__` ne trouve pas de correspondance directe avec un module que l'on importe :

source: interactive prompt
fr: invite de commande interactive

source: :option:`-c` option
fr: l'option :option:`-c`

source: running from stdin
fr: lecture depuis l'entrée standard

source: running directly from a source or bytecode file
fr: lecture depuis un fichier de code source ou de *bytecode*

source: Note that ``__main__.__spec__`` is always ``None`` in the last case, *even if* the file could technically be imported directly as a module instead. Use the :option:`-m` switch if valid module metadata is desired in :mod:`__main__`.
fr: Notez que ``__main__.__spec__`` vaut toujours ``None`` dans le dernier cas, *même si* le fichier pourrait techniquement être importé directement en tant que module. Utilisez l'option :option:`-m` si vous souhaitez disposer de métadonnées valides du module dans :mod:`__main__`.

source: Note also that even when ``__main__`` corresponds with an importable module and ``__main__.__spec__`` is set accordingly, they're still considered *distinct* modules. This is due to the fact that blocks guarded by ``if __name__ == "__main__":`` checks only execute when the module is used to populate the ``__main__`` namespace, and not during normal import.
fr: Notez aussi que même quand ``__main__`` correspond à un module importable et que ``__main__.__spec__`` est défini en conséquence, ils seront toujours considérés comme des modules *distincts*. Cela est dû au fait que le bloc encadré par ``if __name__ == "__main__":`` ne s'exécute que quand le module est utilisé pour peupler l'espace de nommage de ``__main__``, et pas durant une importation normale.

source: Open issues
fr: Idées d'amélioration

source: XXX It would be really nice to have a diagram.
fr: XXX Ce serait vraiment bien de disposer d'un diagramme.

source: XXX * (import_machinery.rst) how about a section devoted just to the attributes of modules and packages, perhaps expanding upon or supplanting the related entries in the data model reference page?
fr: XXX * (``import_machinery.rst``) Pourquoi pas une section dédiée aux attributs des modules et paquets, développant ou remplaçant les entrées associées dans la page de référence du modèle de données ?

source: XXX runpy, pkgutil, et al in the library manual should all get "See Also" links at the top pointing to the new import system section.
fr: XXX *runpy*, *pkgutil* et autres dans le manuel de la bibliothèque devraient comporter un lien "Lisez aussi" en début de page pointant vers la section du nouveau mécanisme d'import.

source: XXX Add more explanation regarding the different ways in which ``__main__`` is initialized?
fr: XXX Ajouter des explications sur les différentes manières dont ``__main__`` est initialisé ?

source: XXX Add more info on ``__main__`` quirks/pitfalls (i.e. copy from :pep:`395`).
fr: XXX Ajouter des informations sur les pièges et bizarreries de ``__main__`` (c.-à-d. des extraits de la :pep:`395`).

source: References
fr: Références

source: The import machinery has evolved considerably since Python's early days. The original `specification for packages <https://www.python.org/doc/essays/packages/>`_ is still available to read, although some details have changed since the writing of that document.
fr: Le mécanisme d'importation a considérablement évolué depuis les débuts de Python. La `spécification des paquets <https://www.python.org/doc/essays/packages/>`_ originale est toujours disponible, bien que quelques détails ont changé depuis l'écriture de ce document.

source: The original specification for :data:`sys.meta_path` was :pep:`302`, with subsequent extension in :pep:`420`.
fr: La spécification originale de :data:`sys.meta_path` se trouve dans la :pep:`302`. La :pep:`420` contient des extensions significatives.

source: :pep:`420` introduced :term:`namespace packages <namespace package>` for Python 3.3. :pep:`420` also introduced the :meth:`find_loader` protocol as an alternative to :meth:`find_module`.
fr: La :pep:`420` a introduit les :term:`paquets-espaces de nommage <namespace package>` pour Python 3.3. La :pep:`420` a aussi introduit le protocole :meth:`recherche du chargeur <find_loader>` comme une alternative à :meth:`find_module`.

source: :pep:`366` describes the addition of the ``__package__`` attribute for explicit relative imports in main modules.
fr: La :pep:`366` décrit l'ajout de l'attribut ``__package__`` pour les importations relatives explicites dans les modules principaux.
