Repository: python/python-docs-fr
Catalog: reference/import.po
Languages: fr

source: :pep:`328` introduced absolute and explicit relative imports and initially proposed ``__name__`` for semantics :pep:`366` would eventually specify for ``__package__``.
fr: La :pep:`328` a introduit les importations absolues et les importations relatives explicites. Elle a aussi proposé ``__name__`` pour la sémantique que la :pep:`366` attribuait à ``__package__``.

source: :pep:`338` defines executing modules as scripts.
fr: :pep:`338` définit l'exécution de modules en tant que scripts.

source: :pep:`451` adds the encapsulation of per-module import state in spec objects. It also off-loads most of the boilerplate responsibilities of loaders back onto the import machinery. These changes allow the deprecation of several APIs in the import system and also addition of new methods to finders and loaders.
fr: :pep:`451` ajoute l'encapsulation dans les objets spécificateurs de l'état des importations, module par module. Elle reporte aussi la majorité des responsabilités des chargeurs vers le mécanisme d'import. Ces changements permettent de supprimer plusieurs API dans le système d'importation et d'ajouter de nouvelles méthodes aux chercheurs et chargeurs.

source: Footnotes
fr: Notes

source: See :class:`types.ModuleType`.
fr: Voir :class:`types.ModuleType`.

source: The importlib implementation avoids using the return value directly. Instead, it gets the module object by looking the module name up in :data:`sys.modules`. The indirect effect of this is that an imported module may replace itself in :data:`sys.modules`. This is implementation-specific behavior that is not guaranteed to work in other Python implementations.
fr: L'implémentation de *importlib* évite d'utiliser directement la valeur de retour. À la place, elle récupère l'objet module en recherchant le nom du module dans :data:`sys.modules`. L'effet indirect est que le module importé peut remplacer le module de même nom dans :data:`sys.modules`. C'est un comportement spécifique à l'implémentation dont le résultat n'est pas garanti pour les autres implémentations de Python.

source: In legacy code, it is possible to find instances of :class:`imp.NullImporter` in the :data:`sys.path_importer_cache`. It is recommended that code be changed to use ``None`` instead. See :ref:`portingpythoncode` for more details.
fr: Dans du code historique, il est possible de trouver des instances de :class:`imp.NullImporter` dans :data:`sys.path_importer_cache`. Il est recommandé de modifier ce code afin d'utiliser ``None`` à la place. Lisez :ref:`portingpythoncode` pour plus de détails.
