Repository: python/python-docs-fr
Catalog: reference/introduction.po
Languages: fr

source: This reference manual describes the Python programming language. It is not intended as a tutorial.
fr: Ce manuel de référence décrit le langage de programmation Python. Il n'a pas vocation à être un tutoriel.

source: While I am trying to be as precise as possible, I chose to use English rather than formal specifications for everything except syntax and lexical analysis. This should make the document more understandable to the average reader, but will leave room for ambiguities. Consequently, if you were coming from Mars and tried to re-implement Python from this document alone, you might have to guess things and in fact you would probably end up implementing quite a different language. On the other hand, if you are using Python and wonder what the precise rules about a particular area of the language are, you should definitely be able to find them here. If you would like to see a more formal definition of the language, maybe you could volunteer your time --- or invent a cloning machine :-).
fr: Nous essayons d'être le plus précis possible et nous utilisons le français (NdT : ou l’anglais pour les parties qui ne sont pas encore traduites) plutôt que des spécifications formelles, sauf pour la syntaxe et l’analyse lexicale. Nous espérons ainsi rendre ce document plus compréhensible pour un grand nombre de lecteurs, même si cela laisse un peu de place à l’ambiguïté. En conséquence, si vous arrivez de Mars et que vous essayez de ré-implémenter Python à partir de cet unique document, vous devrez faire des hypothèses et, finalement, vous aurez certainement implémenté un langage sensiblement différent. D’un autre côté, si vous utilisez Python et que vous vous demandez quelles règles s’appliquent pour telle partie du langage, vous devriez trouver une réponse satisfaisante ici. Si vous souhaitez voir une définition plus formelle du langage, nous acceptons toutes les bonnes volontés (ou bien inventez une machine pour nous cloner ☺).

source: It is dangerous to add too many implementation details to a language reference document --- the implementation may change, and other implementations of the same language may work differently. On the other hand, CPython is the one Python implementation in widespread use (although alternate implementations continue to gain support), and its particular quirks are sometimes worth being mentioned, especially where the implementation imposes additional limitations. Therefore, you'll find short "implementation notes" sprinkled throughout the text.
fr: S’agissant du manuel de référence d’un langage, il est dangereux de rentrer profondément dans les détails d’implémentation ; l’implémentation peut changer et d’autres implémentations du même langage peuvent fonctionner différemment. En même temps, CPython est l’implémentation de Python la plus répandue (bien que d’autres implémentations gagnent en popularité) et certaines de ses bizarreries méritent parfois d’être mentionnées, en particulier lorsque l’implémentation impose des limitations supplémentaires. Par conséquent, vous trouvez de courtes "notes d’implémentation" saupoudrées dans le texte.

source: Every Python implementation comes with a number of built-in and standard modules. These are documented in :ref:`library-index`. A few built-in modules are mentioned when they interact in a significant way with the language definition.
fr: Chaque implémentation de Python est livrée avec un certain nombre de modules natifs. Ceux-ci sont documentés dans :ref:`library-index`. Quelques modules natifs sont mentionnés quand ils interagissent significativement avec la définition du langage.

source: Alternate Implementations
fr: Autres implémentations

source: Though there is one Python implementation which is by far the most popular, there are some alternate implementations which are of particular interest to different audiences.
fr: Bien qu’il existe une implémentation Python qui soit de loin la plus populaire, il existe d’autres implémentations qui présentent un intérêt particulier pour différents publics.

source: Known implementations include:
fr: Parmi les implémentations les plus connues, nous pouvons citer :

source: This is the original and most-maintained implementation of Python, written in C. New language features generally appear here first.
fr: C’est l’implémentation originelle et la plus entretenue de Python, écrite en C. Elle implémente généralement en premier les nouvelles fonctionnalités du langage.

source: Python implemented in Java. This implementation can be used as a scripting language for Java applications, or can be used to create applications using the Java class libraries. It is also often used to create tests for Java libraries. More information can be found at `the Jython website <http://www.jython.org/>`_.
fr: Python implémenté en Java. Cette implémentation peut être utilisée comme langage de script pour les applications Java ou pour créer des applications utilisant des bibliothèques Java. Elle est également souvent utilisée pour créer des tests de bibliothèques Java. Plus d’informations peuvent être trouvées sur `the Jython website <http://www.jython.org/>`_ (site en anglais).

source: Python for .NET
fr: Python pour .NET

source: This implementation actually uses the CPython implementation, but is a managed .NET application and makes .NET libraries available. It was created by Brian Lloyd. For more information, see the `Python for .NET home page <https://pythonnet.github.io/>`_.
fr: Cette implémentation utilise en fait l’implémentation CPython, mais c’est une application .NET et permet un accès aux bibliothèques .NET. Elle a été créée par Brian Lloyd. Pour plus d’informations, consultez la page d’accueil `Python pour .NET <https://pythonnet.github.io/>`_ (site en anglais).

source: An alternate Python for .NET. Unlike Python.NET, this is a complete Python implementation that generates IL, and compiles Python code directly to .NET assemblies. It was created by Jim Hugunin, the original creator of Jython. For more information, see `the IronPython website <http://ironpython.net/>`_.
fr: Un autre Python pour .NET. Contrairement à Python.NET, il s’agit d’une implémentation Python complète qui génère du code intermédiaire (IL) .NET et compile le code Python directement en assemblages .NET. Il a été créé par Jim Hugunin, le programmeur à l’origine de Jython. Pour plus d’informations, voir `the IronPython website <http://ironpython.net/>`_ (site en anglais).

source: An implementation of Python written completely in Python. It supports several advanced features not found in other implementations like stackless support and a Just in Time compiler. One of the goals of the project is to encourage experimentation with the language itself by making it easier to modify the interpreter (since it is written in Python). Additional information is available on `the PyPy project's home page <http://pypy.org/>`_.
fr: Une implémentation de Python complètement écrite en Python. Elle apporte des fonctionnalités avancées introuvables dans d'autres implémentations, telles que le fonctionnement sans pile (*stackless* en anglais) et un compilateur à la volée (*Just in Time compiler* en anglais). L'un des objectifs du projet est d'encourager l'expérimentation du langage lui-même en facilitant la modification de l'interpréteur (puisqu'il est écrit en Python). Des informations complémentaires sont disponibles sur la `page d'accueil du projet PyPy <http://pypy.org/>`_ (site en anglais).

source: Each of these implementations varies in some way from the language as documented in this manual, or introduces specific information beyond what's covered in the standard Python documentation. Please refer to the implementation-specific documentation to determine what else you need to know about the specific implementation you're using.
fr: Chacune de ces implémentations diffère d'une manière ou d'une autre par rapport au langage décrit dans ce manuel, ou comporte des spécificités que la documentation standard de Python ne couvre pas. Reportez-vous à la documentation spécifique à l'implémentation pour déterminer ce que vous devez savoir sur l'implémentation que vous utilisez.

source: Notation
fr: Notations

source: The descriptions of lexical analysis and syntax use a modified BNF grammar notation. This uses the following style of definition:
fr: Les descriptions de l'analyse lexicale et de la syntaxe utilisent une notation de grammaire BNF modifiée. Le style utilisé est le suivant :

source: The first line says that a ``name`` is an ``lc_letter`` followed by a sequence of zero or more ``lc_letter``\ s and underscores. An ``lc_letter`` in turn is any of the single characters ``'a'`` through ``'z'``. (This rule is actually adhered to for the names defined in lexical and grammar rules in this document.)
fr: La première ligne indique qu'un ``name`` est un ``lc_letter`` suivi d'une suite de zéro ou plus ``lc_letter``\s ou tiret bas. Un ``lc_letter`` est, à son tour, l'un des caractères ``'a'`` à ``'z'`` (cette règle est effectivement respectée pour les noms définis dans les règles lexicales et grammaticales de ce document).

source: Each rule begins with a name (which is the name defined by the rule) and ``::=``. A vertical bar (``|``) is used to separate alternatives; it is the least binding operator in this notation. A star (``*``) means zero or more repetitions of the preceding item; likewise, a plus (``+``) means one or more repetitions, and a phrase enclosed in square brackets (``[ ]``) means zero or one occurrences (in other words, the enclosed phrase is optional). The ``*`` and ``+`` operators bind as tightly as possible; parentheses are used for grouping. Literal strings are enclosed in quotes. White space is only meaningful to separate tokens. Rules are normally contained on a single line; rules with many alternatives may be formatted alternatively with each line after the first beginning with a vertical bar.
fr: Chaque règle commence par un nom (qui est le nom que la règle définit) et ``::=``. Une barre verticale (``|``) est utilisée pour séparer les alternatives ; c'est l'opérateur le moins prioritaire de cette notation. Une étoile (``*``) signifie zéro ou plusieurs répétitions de l'élément précédent ; de même, un plus (``+``) signifie une ou plusieurs répétitions, et une expression entre crochets (``[ ]``) signifie zéro ou une occurrence (en d'autres termes, l'expression encadrée est facultative). Les opérateurs ``*`` et ``+`` agissent aussi étroitement que possible ; les parenthèses sont utilisées pour le regroupement. Les chaînes littérales sont entourées de guillemets anglais ``"``. L'espace n'est utilisée que pour séparer les lexèmes. Les règles sont normalement contenues sur une seule ligne ; les règles avec de nombreuses alternatives peuvent être formatées avec chaque ligne représentant une alternative (et donc débutant par une barre verticale, sauf la première).

source: In lexical definitions (as the example above), two more conventions are used: Two literal characters separated by three dots mean a choice of any single character in the given (inclusive) range of ASCII characters. A phrase between angular brackets (``<...>``) gives an informal description of the symbol defined; e.g., this could be used to describe the notion of 'control character' if needed.
fr: Dans les définitions lexicales (comme dans l'exemple ci-dessus), deux autres conventions sont utilisées : deux caractères littéraux séparés par des points de suspension signifient le choix d'un seul caractère dans la plage donnée (en incluant les bornes) de caractères ASCII. Une phrase entre les signes inférieur et supérieur (``<...>``) donne une description informelle du symbole défini ; par exemple, pour décrire la notion de "caractère de contrôle" si nécessaire.

source: Even though the notation used is almost the same, there is a big difference between the meaning of lexical and syntactic definitions: a lexical definition operates on the individual characters of the input source, while a syntax definition operates on the stream of tokens generated by the lexical analysis. All uses of BNF in the next chapter ("Lexical Analysis") are lexical definitions; uses in subsequent chapters are syntactic definitions.
fr: Même si la notation utilisée est presque la même, il existe une grande différence entre la signification des définitions lexicales et syntaxiques : une définition lexicale opère sur les caractères individuels de l'entrée, tandis qu'une définition syntaxique opère sur le flux de lexèmes générés par l'analyse lexicale. Toutes les notations sous la forme BNF dans le chapitre suivant (« Analyse lexicale ») sont des définitions lexicales ; les notations dans les chapitres suivants sont des définitions syntaxiques.
