Repository: python/python-docs-fr
Catalog: reference/lexical_analysis.po
Languages: fr

source: Underscores are ignored for determining the numeric value of the literal. They can be used to group digits for enhanced readability. One underscore can occur between digits, and after base specifiers like ``0x``.
fr: Les tirets bas sont ignorés pour déterminer la valeur numérique du littéral. Ils peuvent être utilisés pour grouper les chiffres afin de faciliter la lecture. Un souligné peut être placé entre des chiffres ou après la spécification de la base telle que ``0x``.

source: Note that leading zeros in a non-zero decimal number are not allowed. This is for disambiguation with C-style octal literals, which Python used before version 3.0.
fr: Notez que placer des zéros en tête de nombre pour un nombre décimal différent de zéro n'est pas autorisé. Cela permet d'éviter l’ambigüité avec les littéraux en base octale selon le style C que Python utilisait avant la version 3.0.

source: Some examples of integer literals::
fr: Quelques exemples d'entiers littéraux ::

source: Underscores are now allowed for grouping purposes in literals.
fr: Les tirets bas ne sont pas autorisés pour grouper les littéraux.

source: Floating point literals
fr: Nombres à virgule flottante littéraux

source: Floating point literals are described by the following lexical definitions:
fr: Les nombres à virgule flottante littéraux sont décrits par les définitions lexicales suivantes :

source: Note that the integer and exponent parts are always interpreted using radix 10. For example, ``077e010`` is legal, and denotes the same number as ``77e10``. The allowed range of floating point literals is implementation-dependent. As in integer literals, underscores are supported for digit grouping.
fr: Notez que la partie entière et l'exposant sont toujours interprétés comme étant en base 10. Par exemple, ``077e010`` est licite et désigne le même nombre que ``77e10``. La plage autorisée pour les littéraux de nombres à virgule flottante dépend de l'implémentation. Comme pour les entiers littéraux, les soulignés permettent de grouper des chiffres.

source: Some examples of floating point literals::
fr: Quelques exemples de nombres à virgule flottante littéraux ::

source: Imaginary literals
fr: Imaginaires littéraux

source: Imaginary literals are described by the following lexical definitions:
fr: Les nombres imaginaires sont décrits par les définitions lexicales suivantes :

source: An imaginary literal yields a complex number with a real part of 0.0. Complex numbers are represented as a pair of floating point numbers and have the same restrictions on their range. To create a complex number with a nonzero real part, add a floating point number to it, e.g., ``(3+4j)``. Some examples of imaginary literals::
fr: Un littéral imaginaire produit un nombre complexe dont la partie réelle est ``0.0``. Les nombres complexes sont représentés comme une paire de nombres à virgule flottante et possèdent les mêmes restrictions concernant les plages autorisées. Pour créer un nombre complexe dont la partie réelle est non nulle, ajoutez un nombre à virgule flottante à votre littéral imaginaire. Par exemple ``(3+4j)``. Voici d'autres exemples de littéraux imaginaires ::

source: Operators
fr: Opérateurs

source: The following tokens are operators:
fr: Les lexèmes suivants sont des opérateurs :

source: Delimiters
fr: Délimiteurs

source: The following tokens serve as delimiters in the grammar:
fr: Les lexèmes suivants servent de délimiteurs dans la grammaire :

source: The period can also occur in floating-point and imaginary literals. A sequence of three periods has a special meaning as an ellipsis literal. The second half of the list, the augmented assignment operators, serve lexically as delimiters, but also perform an operation.
fr: Le point peut aussi apparaître dans les littéraux de nombres à virgule flottante et imaginaires. Une suite de trois points possède une signification spéciale : c'est une ellipse littérale. La deuxième partie de la liste, les opérateurs d'assignation augmentés, servent de délimiteurs pour l'analyseur lexical mais sont aussi des opérateurs.

source: The following printing ASCII characters have special meaning as part of other tokens or are otherwise significant to the lexical analyzer:
fr: Les caractères ASCII suivants ont une signification spéciale en tant que partie d'autres lexèmes ou ont une signification particulière pour l'analyseur lexical :

source: The following printing ASCII characters are not used in Python. Their occurrence outside string literals and comments is an unconditional error:
fr: Les caractères ASCII suivants ne sont pas utilisés en Python. S'ils apparaissent en dehors de chaines littérales ou de commentaires, ils produisent une erreur :

source: Footnotes
fr: Notes
