Repository: python/python-docs-fr
Catalog: reference/lexical_analysis.po
Languages: fr

source: System-defined names. These names are defined by the interpreter and its implementation (including the standard library). Current system names are discussed in the :ref:`specialnames` section and elsewhere. More will likely be defined in future versions of Python. *Any* use of ``__*__`` names, in any context, that does not follow explicitly documented use, is subject to breakage without warning.
fr: Noms définis par le système. Ces noms sont définis par l'interpréteur et son implémentation (y compris la bibliothèque standard). Les noms actuels définis par le système sont abordés dans la section :ref:`specialnames`, mais aussi ailleurs. D'autres noms seront probablement définis dans les futures versions de Python. Toute utilisation de noms de la forme ``__*__``, dans n'importe quel contexte, qui n'est pas conforme à ce qu'indique explicitement la documentation, est sujette à des mauvaises surprises sans avertissement.

source: Class-private names. Names in this category, when used within the context of a class definition, are re-written to use a mangled form to help avoid name clashes between "private" attributes of base and derived classes. See section :ref:`atom-identifiers`.
fr: Noms privés pour une classe. Les noms de cette forme, lorsqu'ils sont utilisés dans le contexte d'une définition de classe, sont réécrits sous une forme modifiée pour éviter les conflits de noms entre les attributs « privés » des classes de base et les classes dérivées. Voir la section :ref:`atom-identifiers`.

source: Literals
fr: Littéraux

source: Literals are notations for constant values of some built-in types.
fr: Les littéraux sont des notations pour indiquer des valeurs constantes de certains types natifs.

source: String and Bytes literals
fr: Littéraux de chaînes de caractères et de suites d'octets

source: String literals are described by the following lexical definitions:
fr: Les chaînes de caractères littérales sont définies par les définitions lexicales suivantes :

source: One syntactic restriction not indicated by these productions is that whitespace is not allowed between the :token:`stringprefix` or :token:`bytesprefix` and the rest of the literal. The source character set is defined by the encoding declaration; it is UTF-8 if no encoding declaration is given in the source file; see section :ref:`encodings`.
fr: Une restriction syntaxique non indiquée par ces règles est qu'aucun blanc n'est autorisé entre le :token:`stringprefix` ou :token:`bytesprefix` et le reste du littéral. Le jeu de caractères source est défini par la déclaration d'encodage ; il vaut UTF-8 si aucune déclaration d'encodage n'est donnée dans le fichier source ; voir la section :ref:`encodings`.

source: In plain English: Both types of literals can be enclosed in matching single quotes (``'``) or double quotes (``"``). They can also be enclosed in matching groups of three single or double quotes (these are generally referred to as *triple-quoted strings*). The backslash (``\``) character is used to escape characters that otherwise have a special meaning, such as newline, backslash itself, or the quote character.
fr: Description en français : les deux types de littéraux peuvent être encadrés par une paire de guillemets simples (``'``) ou doubles (``"``). Ils peuvent aussi être encadrés par une paire de trois guillemets simples ou une paire de trois guillemets doubles (on appelle alors généralement ces chaînes *entre triples guillemets*). La barre oblique inversée peut être utilisée pour échapper des caractères qui auraient sinon une signification spéciale, tels que le retour à la ligne, la barre oblique inversée elle-même ou le guillemet utilisé pour délimiter la chaîne.

source: Bytes literals are always prefixed with ``'b'`` or ``'B'``; they produce an instance of the :class:`bytes` type instead of the :class:`str` type. They may only contain ASCII characters; bytes with a numeric value of 128 or greater must be expressed with escapes.
fr: Les littéraux de suites d'octets sont toujours préfixés par ``'b'`` ou ``'B'`` ; cela crée une instance de type :class:`bytes` au lieu du type :class:`str`. Ils ne peuvent contenir que des caractères ASCII ; les octets dont la valeur est supérieure ou égale à 128 doivent être exprimés à l'aide d'échappements.

source: Both string and bytes literals may optionally be prefixed with a letter ``'r'`` or ``'R'``; such strings are called :dfn:`raw strings` and treat backslashes as literal characters. As a result, in string literals, ``'\U'`` and ``'\u'`` escapes in raw strings are not treated specially. Given that Python 2.x's raw unicode literals behave differently than Python 3.x's the ``'ur'`` syntax is not supported.
fr: Les chaînes et suites d'octets littérales peuvent être préfixées par la lettre ``'r'`` ou ``'R'`` ; de telles chaînes sont appelées :dfn:`chaines brutes` (*raw strings* en anglais) et traitent la barre oblique inversée comme un caractère normal. En conséquence, les chaînes littérales ``'\U'`` et ``'\u'`` ne sont pas considérées comme spéciales. Comme les littéraux Unicode de Python 2.x se comportent différemment, la syntaxe ``'ur'`` n'est pas reconnue en Python 3.x.

source: The ``'rb'`` prefix of raw bytes literals has been added as a synonym of ``'br'``.
fr: le préfixe ``'rb'`` a été ajouté comme synonyme de ``'br'`` pour les littéraux de suites d'octets.

source: Support for the unicode legacy literal (``u'value'``) was reintroduced to simplify the maintenance of dual Python 2.x and 3.x codebases. See :pep:`414` for more information.
fr: le support du préfixe historique pour les chaînes Unicode a été réintroduit afin de simplifier la maintenance de code compatible Python 2.x et 3.x. Voir la :pep:`414` pour davantage d'informations.

source: A string literal with ``'f'`` or ``'F'`` in its prefix is a :dfn:`formatted string literal`; see :ref:`f-strings`. The ``'f'`` may be combined with ``'r'``, but not with ``'b'`` or ``'u'``, therefore raw formatted strings are possible, but formatted bytes literals are not.
fr: Une chaîne littérale qui contient ``'f'`` ou ``'F'`` dans le préfixe est une :dfn:`chaîne de caractères littérale formatée` ; lisez :ref:`f-strings`. Le ``'f'`` peut être combiné avec ``'r'`` mais pas avec ``'b'`` ou ``'u'``, donc les chaînes de caractères formatées sont possibles mais les littéraux de suites d'octets ne peuvent pas l'être.

source: In triple-quoted literals, unescaped newlines and quotes are allowed (and are retained), except that three unescaped quotes in a row terminate the literal. (A "quote" is the character used to open the literal, i.e. either ``'`` or ``"``.)
fr: Dans les chaînes entre triples guillemets, les sauts de ligne et guillemets peuvent ne pas être échappés (et sont donc pris en compte), mais trois guillemets non échappés à la suite terminent le littéral (on entend par guillemet le caractère utilisé pour commencer le littéral, c'est-à-dire ``'`` ou ``"``).

source: Unless an ``'r'`` or ``'R'`` prefix is present, escape sequences in string and bytes literals are interpreted according to rules similar to those used by Standard C. The recognized escape sequences are:
fr: À moins que le préfixe ``'r'`` ou ``'R'`` ne soit présent, les séquences d'échappement dans les littéraux de chaînes et suites d'octets sont interprétées comme elles le seraient par le C Standard. Les séquences d'échappement reconnues sont :

source: Escape Sequence
fr: Séquence d'échappement

source: Meaning
fr: Signification

source: Backslash and newline ignored
fr: barre oblique inversée et retour à la ligne ignorés

source: Backslash (``\``)
fr: barre oblique inversée (``\``)

source: Single quote (``'``)
fr: guillemet simple (``'``)

source: Double quote (``"``)
fr: guillemet double (``"``)

source: ASCII Bell (BEL)
fr: cloche ASCII (BEL)

source: ASCII Backspace (BS)
fr: retour arrière ASCII (BS)

source: ASCII Formfeed (FF)
fr: saut de page ASCII (FF)

source: ASCII Linefeed (LF)
fr: saut de ligne ASCII (LF)

source: ASCII Carriage Return (CR)
fr: retour à la ligne ASCII (CR)

source: ASCII Horizontal Tab (TAB)
fr: tabulation horizontale ASCII (TAB)

source: ASCII Vertical Tab (VT)
fr: tabulation verticale ASCII (VT)

source: Character with octal value *ooo*
fr: caractère dont le code est *ooo* en octal

source: Character with hex value *hh*
fr: caractère dont le code est *ooo* en hexadécimal

source: Escape sequences only recognized in string literals are:
fr: Les séquences d'échappement reconnues seulement dans les chaînes littérales sont :

source: Character named *name* in the Unicode database
fr: caractère dont le nom est *name* dans la base de données Unicode

source: Character with 16-bit hex value *xxxx*
fr: caractère dont le code est *xxxx* en hexadécimal

source: Character with 32-bit hex value *xxxxxxxx*
fr: caractère dont le code est *xxxxxxxx* en hexadécimal sur 32 bits

source: As in Standard C, up to three octal digits are accepted.
fr: Comme dans le C Standard, jusqu'à trois chiffres en base huit sont acceptés.

source: Unlike in Standard C, exactly two hex digits are required.
fr: Contrairement au C Standard, il est obligatoire de fournir deux chiffres hexadécimaux.

source: In a bytes literal, hexadecimal and octal escapes denote the byte with the given value. In a string literal, these escapes denote a Unicode character with the given value.
fr: Dans un littéral de suite d'octets, un échappement hexadécimal ou octal est un octet dont la valeur est donnée. Dans une chaîne littérale, un échappement est un caractère Unicode dont le code est donné.

source: Support for name aliases [#]_ has been added.
fr: Ajout du support pour les alias de noms [#]_.

source: Exactly four hex digits are required.
fr: Exactement quatre chiffres hexadécimaux sont requis.

source: Any Unicode character can be encoded this way. Exactly eight hex digits are required.
fr: N'importe quel caractère Unicode peut être encodé de cette façon. Exactement huit chiffres hexadécimaux sont requis.

source: Unlike Standard C, all unrecognized escape sequences are left in the string unchanged, i.e., *the backslash is left in the result*. (This behavior is useful when debugging: if an escape sequence is mistyped, the resulting output is more easily recognized as broken.) It is also important to note that the escape sequences only recognized in string literals fall into the category of unrecognized escapes for bytes literals.
fr: Contrairement au C standard, toutes les séquences d'échappement non reconnues sont laissées inchangées dans la chaîne, c'est-à-dire que *la barre oblique inversée est laissée dans le résultat* (ce comportement est utile en cas de débogage : si une séquence d'échappement est mal tapée, la sortie résultante est plus facilement reconnue comme source de l'erreur). Notez bien également que les séquences d'échappement reconnues uniquement dans les littéraux de chaînes de caractères ne sont pas reconnues pour les littéraux de suites d'octets.

source: Unrecognized escape sequences produce a :exc:`DeprecationWarning`. In a future Python version they will be a :exc:`SyntaxWarning` and eventually a :exc:`SyntaxError`.
fr: Les séquences d'échappement non reconnues produisent une :exc:`DeprecationWarning`. Dans les futures versions de Python, elles génèreront une :exc:`SyntaxWarning` et éventuellement une :exc:`SyntaxError`.

source: Even in a raw literal, quotes can be escaped with a backslash, but the backslash remains in the result; for example, ``r"\""`` is a valid string literal consisting of two characters: a backslash and a double quote; ``r"\"`` is not a valid string literal (even a raw string cannot end in an odd number of backslashes). Specifically, *a raw literal cannot end in a single backslash* (since the backslash would escape the following quote character). Note also that a single backslash followed by a newline is interpreted as those two characters as part of the literal, *not* as a line continuation.
fr: Même dans une chaîne littérale brute, les guillemets peuvent être échappés avec une barre oblique inversée mais la barre oblique inversée reste dans le résultat ; par exemple, ``r"\""`` est une chaîne de caractères valide composée de deux caractères : une barre oblique inversée et un guillemet double ; ``r"\"`` n'est pas une chaîne de caractères valide (même une chaîne de caractères brute ne peut pas se terminer par un nombre impair de barres obliques inversées). Plus précisément, *une chaîne littérale brute ne peut pas se terminer par une seule barre oblique inversée* (puisque la barre oblique inversée échappe le guillemet suivant). Notez également qu'une simple barre oblique inversée suivie d'un saut de ligne est interprétée comme deux caractères faisant partie du littéral et *non* comme une continuation de ligne.

source: String literal concatenation
fr: Concaténation de chaînes de caractères

source: Multiple adjacent string or bytes literals (delimited by whitespace), possibly using different quoting conventions, are allowed, and their meaning is the same as their concatenation. Thus, ``"hello" 'world'`` is equivalent to ``"helloworld"``. This feature can be used to reduce the number of backslashes needed, to split long strings conveniently across long lines, or even to add comments to parts of strings, for example::
fr: Plusieurs chaînes de caractères ou suites d'octets adjacentes (séparées par des blancs), utilisant éventuellement des conventions de guillemets différentes, sont autorisées. La signification est la même que leur concaténation. Ainsi, ``"hello" 'world'`` est l'équivalent de ``"helloworld"``. Cette fonctionnalité peut être utilisée pour réduire le nombre de barres obliques inverses, pour diviser de longues chaînes de caractères sur plusieurs lignes ou même pour ajouter des commentaires à des portions de chaînes de caractères. Par exemple ::

source: Note that this feature is defined at the syntactical level, but implemented at compile time. The '+' operator must be used to concatenate string expressions at run time. Also note that literal concatenation can use different quoting styles for each component (even mixing raw strings and triple quoted strings), and formatted string literals may be concatenated with plain string literals.
fr: Notez que cette fonctionnalité agit au niveau syntaxique mais est implémentée au moment de la compilation. Pour concaténer les expressions des chaînes de caractères au moment de l'exécution, vous devez utiliser l'opérateur ``+``. Notez également que la concaténation littérale peut utiliser un style différent de guillemets pour chaque composant (et même mélanger des chaînes de caractères brutes et des chaînes de caractères entre triples guillemets). Enfin, les chaînes de caractères formatées peuvent être concaténées avec des chaînes de caractères ordinaires.

source: Formatted string literals
fr: Chaînes de caractères formatées littérales

source: A :dfn:`formatted string literal` or :dfn:`f-string` is a string literal that is prefixed with ``'f'`` or ``'F'``. These strings may contain replacement fields, which are expressions delimited by curly braces ``{}``. While other string literals always have a constant value, formatted strings are really expressions evaluated at run time.
fr: Une :dfn:`chaine de caractères formatée littérale` ou :dfn:`f-string` est une chaine de caractères littérale préfixée par ``'f'`` ou ``'F'``. Ces chaines peuvent contenir des champs à remplacer, c'est-à-dire des expressions délimitées par des accolades ``{}``. Alors que les autres littéraux de chaines ont des valeurs constantes, les chaines formatées sont de vraies expressions évaluées à l'exécution.

source: Escape sequences are decoded like in ordinary string literals (except when a literal is also marked as a raw string). After decoding, the grammar for the contents of the string is:
fr: Les séquences d'échappement sont décodées comme à l'intérieur des chaînes de caractères ordinaires (sauf lorsqu'une chaîne de caractères est également marquée comme une chaîne brute). Après décodage, la grammaire s'appliquant au contenu de la chaîne de caractères est :

source: The parts of the string outside curly braces are treated literally, except that any doubled curly braces ``'{{'`` or ``'}}'`` are replaced with the corresponding single curly brace. A single opening curly bracket ``'{'`` marks a replacement field, which starts with a Python expression. After the expression, there may be a conversion field, introduced by an exclamation point ``'!'``. A format specifier may also be appended, introduced by a colon ``':'``. A replacement field ends with a closing curly bracket ``'}'``.
fr: Les portions qui sont en dehors des accolades sont traitées comme les littéraux, sauf les doubles accolades ``'{{'`` ou ``'}}'`` qui sont remplacées par la simple accolade correspondante. Une simple accolade ouvrante ``'{'`` marque le début du champ à remplacer, qui commence par une expression Python. Après l'expression, il peut y avoir un champ de conversion, introduit par un point d'exclamation ``'!'``. Une spécification de format peut aussi être ajoutée, introduite par le caractère deux-points ``':'``. Le champ à remplacer se termine par une accolade fermante ``'}'``.

source: Expressions in formatted string literals are treated like regular Python expressions surrounded by parentheses, with a few exceptions. An empty expression is not allowed, and both :keyword:`lambda` and assignment expressions ``:=`` must be surrounded by explicit parentheses. Replacement expressions can contain line breaks (e.g. in triple-quoted strings), but they cannot contain comments. Each expression is evaluated in the context where the formatted string literal appears, in order from left to right.
fr: Les expressions dans les chaînes de caractères formatées littérales sont traitées comme des expressions Python normales entourées de parenthèses, à quelques exceptions près. Une expression vide n'est pas autorisée et les expressions :keyword:`lambda` comme les assignations ``:=`` doivent être explicitement entourées de parenthèses. Les expressions de remplacement peuvent contenir des sauts de ligne (par exemple dans les chaînes de caractères entre triples guillemets) mais elles ne peuvent pas contenir de commentaire. Chaque expression est évaluée dans le contexte où la chaîne de caractères formatée apparaît, de gauche à droite.

source: If a conversion is specified, the result of evaluating the expression is converted before formatting. Conversion ``'!s'`` calls :func:`str` on the result, ``'!r'`` calls :func:`repr`, and ``'!a'`` calls :func:`ascii`.
fr: Si une conversion est spécifiée, le résultat de l'évaluation de l'expression est converti avant d'être formaté. La conversion ``'!s'`` appelle :func:`str` sur le résultat, ``'!r'`` appelle :func:`repr` et ``'!a'`` appelle :func:`ascii`.

source: The result is then formatted using the :func:`format` protocol. The format specifier is passed to the :meth:`__format__` method of the expression or conversion result. An empty string is passed when the format specifier is omitted. The formatted result is then included in the final value of the whole string.
fr: Le résultat est ensuite formaté en utilisant le protocole de :func:`format`. La spécification du format est passée à la méthode :meth:`__format__` de l'expression ou du résultat de la conversion. Une chaîne vide est passée lorsque la spécification de format est omise. Le résultat formaté est alors inclus dans la valeur finale de la chaîne complète.

source: Top-level format specifiers may include nested replacement fields. These nested fields may include their own conversion fields and :ref:`format specifiers <formatspec>`, but may not include more deeply-nested replacement fields. The :ref:`format specifier mini-language <formatspec>` is the same as that used by the string .format() method.
fr: Les spécifications de format peuvent inclure des champs de remplacement imbriqués. Ces champs imbriqués peuvent inclure leurs propres champs de conversion et :ref:`spécifications de format <formatspec>` mais l'imbrication ne doit pas aller plus profond. Le :ref:`mini-langage de spécification de format <formatspec>` est le même que celui utilisé par la méthode ``.format()`` du type ``str``.

source: Formatted string literals may be concatenated, but replacement fields cannot be split across literals.
fr: Les chaînes formatées littérales peuvent être concaténées mais les champs à remplacer ne peuvent pas être divisés entre les littéraux.

source: Some examples of formatted string literals::
fr: Quelques exemples de chaines formatées littérales ::

source: A consequence of sharing the same syntax as regular string literals is that characters in the replacement fields must not conflict with the quoting used in the outer formatted string literal::
fr: Une conséquence de partager la même syntaxe avec les chaînes littérales normales est que les caractères dans les champs à remplacer ne doivent pas entrer en conflit avec le guillemet utilisé pour encadrer la chaine formatée littérale ::

source: Backslashes are not allowed in format expressions and will raise an error::
fr: La barre oblique inversée (ou antislash) n'est pas autorisée dans les expressions des champs à remplacer et son utilisation génère une erreur ::

source: To include a value in which a backslash escape is required, create a temporary variable.
fr: Pour inclure une valeur où l'échappement par barre oblique inversée est nécessaire, vous devez créer une variable temporaire.

source: Formatted string literals cannot be used as docstrings, even if they do not include expressions.
fr: Une chaine formatée littérale ne peut pas être utilisée en tant que *docstring*, même si elle ne comporte pas d'expression.

source: See also :pep:`498` for the proposal that added formatted string literals, and :meth:`str.format`, which uses a related format string mechanism.
fr: Consultez aussi la :pep:`498` qui propose l'ajout des chaines formatées littérales et :meth:`str.format` qui utilise un mécanisme similaire pour formater les chaînes de caractères.

source: Numeric literals
fr: Littéraux numériques

source: There are three types of numeric literals: integers, floating point numbers, and imaginary numbers. There are no complex literals (complex numbers can be formed by adding a real number and an imaginary number).
fr: Il existe trois types de littéraux numériques : les entiers, les nombres à virgule flottante et les nombres imaginaires. Il n'y a pas de littéraux complexes (les nombres complexes peuvent être construits en ajoutant un nombre réel et un nombre imaginaire).

source: Note that numeric literals do not include a sign; a phrase like ``-1`` is actually an expression composed of the unary operator '``-``' and the literal ``1``.
fr: Notez que les littéraux numériques ne comportent pas de signe ; une phrase telle que ``-1`` est en fait une expression composée de l'opérateur unitaire ``-`` et du littéral ``1``.

source: Integer literals
fr: Entiers littéraux

source: Integer literals are described by the following lexical definitions:
fr: Les entiers littéraux sont décrits par les définitions lexicales suivantes :

source: There is no limit for the length of integer literals apart from what can be stored in available memory.
fr: Il n'y a pas de limite pour la longueur des entiers littéraux, sauf celle relative à la capacité mémoire.
