Repository: python/python-docs-fr
Catalog: reference/lexical_analysis.po
Languages: fr

source: Lexical analysis
fr: Analyse lexicale

source: A Python program is read by a *parser*. Input to the parser is a stream of *tokens*, generated by the *lexical analyzer*. This chapter describes how the lexical analyzer breaks a file into tokens.
fr: Un programme Python est lu par un analyseur syntaxique (*parser* en anglais). En entrée de cet analyseur syntaxique, nous trouvons des lexèmes (*tokens* en anglais), produits par un analyseur lexical. Ce chapitre décrit comment l'analyseur lexical découpe le fichier en lexèmes.

source: Python reads program text as Unicode code points; the encoding of a source file can be given by an encoding declaration and defaults to UTF-8, see :pep:`3120` for details. If the source file cannot be decoded, a :exc:`SyntaxError` is raised.
fr: Python lit le texte du programme comme des suites de caractères Unicode ; l'encodage du fichier source peut être spécifié par une déclaration d'encodage et vaut par défaut UTF-8, voir la :pep:`3120` pour les détails. Si le fichier source ne peut pas être décodé, une exception :exc:`SyntaxError` (erreur de syntaxe) est levée.

source: Line structure
fr: Structure des lignes

source: A Python program is divided into a number of *logical lines*.
fr: Un programme en Python est divisé en *lignes logiques*.

source: Logical lines
fr: Lignes logiques

source: The end of a logical line is represented by the token NEWLINE. Statements cannot cross logical line boundaries except where NEWLINE is allowed by the syntax (e.g., between statements in compound statements). A logical line is constructed from one or more *physical lines* by following the explicit or implicit *line joining* rules.
fr: La fin d'une ligne logique est représentée par le lexème NEWLINE. Les instructions ne peuvent pas traverser les limites des lignes logiques, sauf quand NEWLINE est autorisé par la syntaxe (par exemple, entre les instructions des instructions composées). Une ligne logique est constituée d'une ou plusieurs *lignes physiques* en fonction des règles, explicites ou implicites, de *continuation de ligne*.

source: Physical lines
fr: Lignes physiques

source: A physical line is a sequence of characters terminated by an end-of-line sequence. In source files and strings, any of the standard platform line termination sequences can be used - the Unix form using ASCII LF (linefeed), the Windows form using the ASCII sequence CR LF (return followed by linefeed), or the old Macintosh form using the ASCII CR (return) character. All of these forms can be used equally, regardless of platform. The end of input also serves as an implicit terminator for the final physical line.
fr: Une ligne physique est une suite de caractères terminée par une séquence de fin de ligne. Dans les fichiers sources et les chaînes de caractères, n'importe quelle séquence de fin de ligne des plateformes standards peut être utilisée ; Unix utilise le caractère ASCII LF (pour *linefeed*, saut de ligne en français), Windows utilise la séquence CR LF (*carriage return* suivi de *linefeed*) et Macintosh utilisait le caractère ASCII CR. Toutes ces séquences peuvent être utilisées, quelle que soit la plateforme. La fin de l'entrée est aussi une fin de ligne physique implicite.

source: When embedding Python, source code strings should be passed to Python APIs using the standard C conventions for newline characters (the ``\n`` character, representing ASCII LF, is the line terminator).
fr: Lorsque vous encapsulez Python, les chaînes de code source doivent être passées à l'API Python en utilisant les conventions du C standard pour les caractères de fin de ligne : le caractère ``\n``, dont le code ASCII est LF.

source: Comments
fr: Commentaires

source: A comment starts with a hash character (``#``) that is not part of a string literal, and ends at the end of the physical line. A comment signifies the end of the logical line unless the implicit line joining rules are invoked. Comments are ignored by the syntax.
fr: Un commentaire commence par le caractère croisillon (``#``, *hash* en anglais et qui ressemble au symbole musical dièse, c'est pourquoi il est souvent improprement appelé caractère dièse) situé en dehors d'une chaine de caractères littérale et se termine à la fin de la ligne physique. Un commentaire signifie la fin de la ligne logique à moins qu'une règle de continuation de ligne implicite ne s'applique. Les commentaires sont ignorés au niveau syntaxique, ce ne sont pas des lexèmes.

source: Encoding declarations
fr: Déclaration d'encodage

source: If a comment in the first or second line of the Python script matches the regular expression ``coding[=:]\s*([-\w.]+)``, this comment is processed as an encoding declaration; the first group of this expression names the encoding of the source code file. The encoding declaration must appear on a line of its own. If it is the second line, the first line must also be a comment-only line. The recommended forms of an encoding expression are ::
fr: Si un commentaire placé sur la première ou deuxième ligne du script Python correspond à l'expression rationnelle ``coding[=:]\s*([-\w.]+)``, ce commentaire est analysé comme une déclaration d'encodage ; le premier groupe de cette expression désigne l'encodage du fichier source. Cette déclaration d'encodage doit être seule sur sa ligne et, si elle est sur la deuxième ligne, la première ligne doit aussi être une ligne composée uniquement d'un commentaire. Les formes recommandées pour l'expression de l'encodage sont ::

source: which is recognized also by GNU Emacs, and ::
fr: qui est reconnue aussi par GNU Emacs et ::

source: which is recognized by Bram Moolenaar's VIM.
fr: qui est reconnue par VIM de Bram Moolenaar.

source: If no encoding declaration is found, the default encoding is UTF-8. In addition, if the first bytes of the file are the UTF-8 byte-order mark (``b'\xef\xbb\xbf'``), the declared file encoding is UTF-8 (this is supported, among others, by Microsoft's :program:`notepad`).
fr: Si aucune déclaration d'encodage n'est trouvée, l'encodage par défaut est utilisé : UTF-8. En plus, si les premiers octets du fichier sont l'indicateur d'ordre des octets UTF-8 (``b'\xef\xbb\xbf'``, *BOM* en anglais pour *byte order mark*), le fichier est considéré comme étant en UTF-8 (cette convention est reconnue, entre autres, par :program:`notepad` de Microsoft).

source: If an encoding is declared, the encoding name must be recognized by Python. The encoding is used for all lexical analysis, including string literals, comments and identifiers.
fr: Si un encodage est déclaré, le nom de l'encodage doit être reconnu par Python. L'encodage est utilisé pour toute l'analyse lexicale, y compris les chaînes de caractères, les commentaires et les identifiants.

source: Explicit line joining
fr: Continuation de ligne explicite

source: Two or more physical lines may be joined into logical lines using backslash characters (``\``), as follows: when a physical line ends in a backslash that is not part of a string literal or comment, it is joined with the following forming a single logical line, deleting the backslash and the following end-of-line character. For example::
fr: Deux lignes physiques, ou plus, peuvent être jointes pour former une seule ligne logique en utilisant la barre oblique inversée (``\``) selon la règle suivante : quand la ligne physique se termine par une barre oblique inversée qui ne fait pas partie d'une chaine de caractères ou d'un commentaire, la ligne immédiatement suivante lui est adjointe pour former une seule ligne logique, en supprimant la barre oblique inversée et le caractère de fin de ligne. Par exemple ::

source: A line ending in a backslash cannot carry a comment. A backslash does not continue a comment. A backslash does not continue a token except for string literals (i.e., tokens other than string literals cannot be split across physical lines using a backslash). A backslash is illegal elsewhere on a line outside a string literal.
fr: Une ligne que se termine par une barre oblique inversée ne peut pas avoir de commentaire. La barre oblique inversée ne permet pas de continuer un commentaire. La barre oblique inversée ne permet pas de continuer un lexème, sauf s'il s'agit d'une chaîne de caractères (par exemple, les lexèmes autres que les chaînes de caractères ne peuvent pas être répartis sur plusieurs lignes en utilisant une barre oblique inversée). La barre oblique inversée n'est pas autorisée ailleurs sur la ligne, en dehors d'une chaîne de caractères.

source: Implicit line joining
fr: Continuation de ligne implicite

source: Expressions in parentheses, square brackets or curly braces can be split over more than one physical line without using backslashes. For example::
fr: Les expressions entre parenthèses, crochets ou accolades peuvent être réparties sur plusieurs lignes sans utiliser de barre oblique inversée. Par exemple ::

source: Implicitly continued lines can carry comments. The indentation of the continuation lines is not important. Blank continuation lines are allowed. There is no NEWLINE token between implicit continuation lines. Implicitly continued lines can also occur within triple-quoted strings (see below); in that case they cannot carry comments.
fr: Les lignes continuées implicitement peuvent avoir des commentaires. L'indentation des lignes de continuation n'est pas importante. Une ligne blanche est autorisée comme ligne de continuation. Il ne doit pas y avoir de lexème NEWLINE entre des lignes implicitement continuées. Les lignes continuées implicitement peuvent être utilisées dans des chaînes entre triples guillemets (voir ci-dessous) ; dans ce cas, elles ne peuvent pas avoir de commentaires.

source: Blank lines
fr: Lignes vierges

source: A logical line that contains only spaces, tabs, formfeeds and possibly a comment, is ignored (i.e., no NEWLINE token is generated). During interactive input of statements, handling of a blank line may differ depending on the implementation of the read-eval-print loop. In the standard interactive interpreter, an entirely blank logical line (i.e. one containing not even whitespace or a comment) terminates a multi-line statement.
fr: Une ligne logique qui ne contient que des espaces, tabulations, caractères de saut de page (*formfeed* en anglais) ou commentaires est ignorée (c'est-à-dire que le lexème NEWLINE n'est pas produit). Pendant l'édition interactive d'instructions, la gestion des lignes vierges peut différer en fonction de l'implémentation de la boucle REPL. Dans l'interpréteur standard, une ligne complètement vierge (c'est-à-dire ne contenant strictement rien, même pas une espace ou un commentaire) termine une instruction multi-lignes.

source: Leading whitespace (spaces and tabs) at the beginning of a logical line is used to compute the indentation level of the line, which in turn is used to determine the grouping of statements.
fr: Des espaces ou tabulations au début d’une ligne logique sont utilisées pour connaître le niveau d’indentation de la ligne, qui est ensuite utilisé pour déterminer comment les instructions sont groupées.

source: Tabs are replaced (from left to right) by one to eight spaces such that the total number of characters up to and including the replacement is a multiple of eight (this is intended to be the same rule as used by Unix). The total number of spaces preceding the first non-blank character then determines the line's indentation. Indentation cannot be split over multiple physical lines using backslashes; the whitespace up to the first backslash determines the indentation.
fr: Les tabulations sont remplacées (de la gauche vers la droite) par une à huit espaces de manière à ce que le nombre de caractères remplacés soit un multiple de huit (nous avons ainsi la même règle que celle d'Unix). Le nombre total d'espaces précédant le premier caractère non blanc détermine alors le niveau d'indentation de la ligne. L'indentation ne peut pas être répartie sur plusieurs lignes physiques à l'aide de barres obliques inversées ; les espaces jusqu'à la première barre oblique inversée déterminent l'indentation.

source: Indentation is rejected as inconsistent if a source file mixes tabs and spaces in a way that makes the meaning dependent on the worth of a tab in spaces; a :exc:`TabError` is raised in that case.
fr: L'indentation est déclarée inconsistante et rejetée si, dans un même fichier source, le mélange des tabulations et des espaces est tel que la signification dépend du nombre d'espaces que représente une tabulation. Une exception :exc:`TabError` est levée dans ce cas.

source: **Cross-platform compatibility note:** because of the nature of text editors on non-UNIX platforms, it is unwise to use a mixture of spaces and tabs for the indentation in a single source file. It should also be noted that different platforms may explicitly limit the maximum indentation level.
fr: **Note de compatibilité entre les plateformes :** en raison de la nature des éditeurs de texte sur les plateformes non Unix, il n'est pas judicieux d'utiliser un mélange d'espaces et de tabulations pour l'indentation dans un seul fichier source. Il convient également de noter que des plateformes peuvent explicitement limiter le niveau d'indentation maximal.

source: A formfeed character may be present at the start of the line; it will be ignored for the indentation calculations above. Formfeed characters occurring elsewhere in the leading whitespace have an undefined effect (for instance, they may reset the space count to zero).
fr: Un caractère de saut de page peut être présent au début de la ligne ; il est ignoré pour les calculs d'indentation ci-dessus. Les caractères de saut de page se trouvant ailleurs avec les espaces en tête de ligne ont un effet indéfini (par exemple, ils peuvent remettre à zéro le nombre d'espaces).

source: The indentation levels of consecutive lines are used to generate INDENT and DEDENT tokens, using a stack, as follows.
fr: Les niveaux d'indentation de lignes consécutives sont utilisés pour générer les lexèmes INDENT et DEDENT, en utilisant une pile, de cette façon :

source: Before the first line of the file is read, a single zero is pushed on the stack; this will never be popped off again. The numbers pushed on the stack will always be strictly increasing from bottom to top. At the beginning of each logical line, the line's indentation level is compared to the top of the stack. If it is equal, nothing happens. If it is larger, it is pushed on the stack, and one INDENT token is generated. If it is smaller, it *must* be one of the numbers occurring on the stack; all numbers on the stack that are larger are popped off, and for each number popped off a DEDENT token is generated. At the end of the file, a DEDENT token is generated for each number remaining on the stack that is larger than zero.
fr: Avant que la première ligne du fichier ne soit lue, un « zéro » est posé sur la pile ; il ne sera plus jamais enlevé. Les nombres empilés sont toujours strictement croissants de bas en haut. Au début de chaque ligne logique, le niveau d'indentation de la ligne est comparé au sommet de la pile. S'ils sont égaux, il ne se passe rien. S'il est plus grand, il est empilé et un lexème INDENT est produit. S'il est plus petit, il *doit* être l'un des nombres présents dans la pile ; tous les nombres de la pile qui sont plus grands sont retirés et, pour chaque nombre retiré, un lexème DEDENT est produit. À la fin du fichier, un lexème DEDENT est produit pour chaque nombre supérieur à zéro restant sur la pile.

source: Here is an example of a correctly (though confusingly) indented piece of Python code::
fr: Voici un exemple de code Python correctement indenté (bien que très confus) ::

source: The following example shows various indentation errors::
fr: L'exemple suivant montre plusieurs erreurs d'indentation ::

source: (Actually, the first three errors are detected by the parser; only the last error is found by the lexical analyzer --- the indentation of ``return r`` does not match a level popped off the stack.)
fr: En fait, les trois premières erreurs sont détectées par l'analyseur syntaxique ; seule la dernière erreur est trouvée par l'analyseur lexical (l'indentation de ``return r`` ne correspond à aucun niveau dans la pile).

source: Whitespace between tokens
fr: Espaces entre lexèmes

source: Except at the beginning of a logical line or in string literals, the whitespace characters space, tab and formfeed can be used interchangeably to separate tokens. Whitespace is needed between two tokens only if their concatenation could otherwise be interpreted as a different token (e.g., ab is one token, but a b is two tokens).
fr: Sauf au début d'une ligne logique ou dans les chaînes de caractères, les caractères « blancs » espace, tabulation et saut de page peuvent être utilisés de manière interchangeable pour séparer les lexèmes. Un blanc n'est nécessaire entre deux lexèmes que si leur concaténation pourrait être interprétée comme un lexème différent (par exemple, ab est un lexème, mais a b comporte deux lexèmes).

source: Other tokens
fr: Autres lexèmes

source: Besides NEWLINE, INDENT and DEDENT, the following categories of tokens exist: *identifiers*, *keywords*, *literals*, *operators*, and *delimiters*. Whitespace characters (other than line terminators, discussed earlier) are not tokens, but serve to delimit tokens. Where ambiguity exists, a token comprises the longest possible string that forms a legal token, when read from left to right.
fr: Outre NEWLINE, INDENT et DEDENT, il existe les catégories de lexèmes suivantes : *identifiants*, *mots clés*, *littéraux*, *opérateurs* et *délimiteurs*. Les blancs (autres que les fins de lignes, vus auparavant) ne sont pas des lexèmes mais servent à délimiter les lexèmes. Quand une ambiguïté existe, le lexème correspond à la plus grande chaîne possible qui forme un lexème licite, en lisant de la gauche vers la droite.

source: Identifiers and keywords
fr: Identifiants et mots-clés

source: Identifiers (also referred to as *names*) are described by the following lexical definitions.
fr: Les identifiants (aussi appelés *noms*) sont décrits par les définitions lexicales suivantes.

source: The syntax of identifiers in Python is based on the Unicode standard annex UAX-31, with elaboration and changes as defined below; see also :pep:`3131` for further details.
fr: La syntaxe des identifiants en Python est basée sur l'annexe UAX-31 du standard Unicode avec les modifications définies ci-dessous ; consultez la :pep:`3131` pour plus de détails.

source: Within the ASCII range (U+0001..U+007F), the valid characters for identifiers are the same as in Python 2.x: the uppercase and lowercase letters ``A`` through ``Z``, the underscore ``_`` and, except for the first character, the digits ``0`` through ``9``.
fr: Dans l'intervalle ASCII (*U+0001..U+007F*), les caractères licites pour les identifiants sont les mêmes que pour Python 2.x : les lettres minuscules et majuscules de ``A`` à ``Z``, le souligné (ou *underscore*) ``_`` et, sauf pour le premier caractère, les chiffres de ``0`` à ``9``.

source: Python 3.0 introduces additional characters from outside the ASCII range (see :pep:`3131`). For these characters, the classification uses the version of the Unicode Character Database as included in the :mod:`unicodedata` module.
fr: Python 3.0 introduit des caractères supplémentaires en dehors de l'intervalle ASCII (voir la :pep:`3131`). Pour ces caractères, la classification utilise la version de la « base de données des caractères Unicode » telle qu'incluse dans le module :mod:`unicodedata`.

source: Identifiers are unlimited in length. Case is significant.
fr: Les identifiants n'ont pas de limite de longueur. La casse est prise en compte.

source: The Unicode category codes mentioned above stand for:
fr: Les codes de catégories Unicode cités ci-dessus signifient :

source: *Lu* - uppercase letters
fr: *Lu* — lettres majuscules

source: *Ll* - lowercase letters
fr: *Ll* — lettres minuscules

source: *Lt* - titlecase letters
fr: *Lt* — lettres majuscules particulières (catégorie *titlecase* de l'Unicode)

source: *Lm* - modifier letters
fr: *Lm* — lettres modificatives avec chasse

source: *Lo* - other letters
fr: *Lo* — autres lettres

source: *Nl* - letter numbers
fr: *Nl* — nombres lettres (par exemple, les nombres romains)

source: *Mn* - nonspacing marks
fr: *Mn* — symboles que l'on combine avec d'autres (accents ou autres) sans générer d'espace (*nonspacing marks* en anglais)

source: *Mc* - spacing combining marks
fr: *Mc* — symboles que l'on combine avec d'autres en générant une espace (*spacing combining marks* en anglais)

source: *Nd* - decimal numbers
fr: *Nd* — chiffres (arabes et autres)

source: *Pc* - connector punctuations
fr: *Pc* — connecteurs (tirets et autres lignes)

source: *Other_ID_Start* - explicit list of characters in `PropList.txt <http://www.unicode.org/Public/12.1.0/ucd/PropList.txt>`_ to support backwards compatibility
fr: *Other_ID_Start* — liste explicite des caractères de `PropList.txt <http://www.unicode.org/Public/12.1.0/ucd/PropList.txt>`_ pour la compatibilité descendante

source: *Other_ID_Continue* - likewise
fr: *Other_ID_Continue* — pareillement

source: All identifiers are converted into the normal form NFKC while parsing; comparison of identifiers is based on NFKC.
fr: Tous les identifiants sont convertis dans la forme normale NFKC pendant l'analyse syntaxique : la comparaison des identifiants se base sur leur forme NFKC.

source: A non-normative HTML file listing all valid identifier characters for Unicode 4.1 can be found at https://www.dcl.hpi.uni-potsdam.de/home/loewis/table-3131.html.
fr: Un fichier HTML, ne faisant pas référence, listant tous les caractères valides pour Unicode 4.1 se trouve à https://www.dcl.hpi.uni-potsdam.de/home/loewis/table-3131.html.

source: Keywords
fr: Mots-clés

source: The following identifiers are used as reserved words, or *keywords* of the language, and cannot be used as ordinary identifiers. They must be spelled exactly as written here:
fr: Les identifiants suivants sont des mots réservés par le langage et ne peuvent pas être utilisés en tant qu'identifiants normaux. Ils doivent être écrits exactement comme ci-dessous :

source: Reserved classes of identifiers
fr: Classes réservées pour les identifiants

source: Certain classes of identifiers (besides keywords) have special meanings. These classes are identified by the patterns of leading and trailing underscore characters:
fr: Certaines classes d'identifiants (outre les mots-clés) ont une signification particulière. Ces classes se reconnaissent par des caractères de soulignement en tête et en queue d'identifiant :

source: Not imported by ``from module import *``. The special identifier ``_`` is used in the interactive interpreter to store the result of the last evaluation; it is stored in the :mod:`builtins` module. When not in interactive mode, ``_`` has no special meaning and is not defined. See section :ref:`import`.
fr: L'identifiant spécial ``_`` n'est pas importé par ``from module import *``. Il est utilisé dans l'interpréteur interactif pour stocker le résultat de la dernière évaluation ; il est stocké dans le module :mod:`builtins`. Lorsque vous n'êtes pas en mode interactif, ``_`` n'a pas de signification particulière et n'est pas défini. Voir la section :ref:`import`.

source: The name ``_`` is often used in conjunction with internationalization; refer to the documentation for the :mod:`gettext` module for more information on this convention.
fr: Le nom ``_`` est souvent utilisé pour internationaliser l'affichage ; reportez-vous à la documentation du module :mod:`gettext` pour plus d'informations sur cette convention.
