Repository: python/python-docs-fr
Catalog: reference/simple_stmts.po
Languages: fr

source: When specifying what module to import you do not have to specify the absolute name of the module. When a module or package is contained within another package it is possible to make a relative import within the same top package without having to mention the package name. By using leading dots in the specified module or package after :keyword:`from` you can specify how high to traverse up the current package hierarchy without specifying exact names. One leading dot means the current package where the module making the import exists. Two dots means up one package level. Three dots is up two levels, etc. So if you execute ``from . import mod`` from a module in the ``pkg`` package then you will end up importing ``pkg.mod``. If you execute ``from ..subpkg2 import mod`` from within ``pkg.subpkg1`` you will import ``pkg.subpkg2.mod``. The specification for relative imports is contained within :pep:`328`.
fr: Quand vous spécifiez les modules à importer, vous n'avez pas besoin de spécifier les noms absolus des modules. Quand un module ou un paquet est contenu dans un autre paquet, il est possible d'effectuer une importation relative à l'intérieur du même paquet de plus haut niveau sans avoir à mentionner le nom du paquet. En utilisant des points en entête du module ou du paquet spécifié après :keyword:`from`, vous pouvez spécifier combien de niveaux vous souhaitez remonter dans la hiérarchie du paquet courant sans spécifier de nom exact. Un seul point en tête signifie le paquet courant où se situe le module qui effectue l'importation. Deux points signifient de remonter d'un niveau. Trois points, remonter de deux niveaux et ainsi de suite. Ainsi, si vous exécutez ``from . import mod`` dans un module du paquet ``pkg``, vous importez finalement ``pkg.mod``. Et si vous exécutez ``from ..souspkg2 import mod`` depuis ``pkg.souspkg1``, vous importez finalement ``pkg.souspkg2.mod``. La spécification des importations relatives se situe dans la :pep:`328`.

source: :func:`importlib.import_module` is provided to support applications that determine dynamically the modules to be loaded.
fr: :func:`importlib.import_module` est fournie pour gérer les applications qui déterminent dynamiquement les modules à charger.

source: Future statements
fr: L'instruction future

source: A :dfn:`future statement` is a directive to the compiler that a particular module should be compiled using syntax or semantics that will be available in a specified future release of Python where the feature becomes standard.
fr: Une :dfn:`instruction future` est une directive à l'attention du compilateur afin qu'un module particulier soit compilé en utilisant une syntaxe ou une sémantique qui sera disponible dans une future version de Python où cette fonctionnalité est devenue un standard.

source: The future statement is intended to ease migration to future versions of Python that introduce incompatible changes to the language. It allows use of the new features on a per-module basis before the release in which the feature becomes standard.
fr: L'instruction *future* a vocation à faciliter les migrations vers les futures versions de Python qui introduisent des changements incompatibles au langage. Cela permet l'utilisation de nouvelles fonctionnalités module par module avant qu'une version n'officialise cette fonctionnalité comme un standard.

source: A future statement must appear near the top of the module. The only lines that can appear before a future statement are:
fr: Une instruction *future* doit apparaître en haut du module. Les seules lignes autorisées avant une instruction *future* sont :

source: the module docstring (if any),
fr: la chaîne de documentation du module (si elle existe),

source: comments,
fr: des commentaires,

source: blank lines, and
fr: des lignes vides et

source: other future statements.
fr: d'autres instructions *future*.

source: The only feature in Python 3.7 that requires using the future statement is ``annotations``.
fr: La seule fonctionnalité dans Python 3.7 qui nécessite l'utilisation de l'instruction `future` est ``annotations``.

source: All historical features enabled by the future statement are still recognized by Python 3. The list includes ``absolute_import``, ``division``, ``generators``, ``generator_stop``, ``unicode_literals``, ``print_function``, ``nested_scopes`` and ``with_statement``. They are all redundant because they are always enabled, and only kept for backwards compatibility.
fr: Toutes les fonctionnalités (*feature* dans la grammaire ci-dessus) autorisées par l'instruction `future` sont toujours reconnues par Python 3. Cette liste comprend ``absolute_import``, ``division``, ``generators``, ``generator_stop``, ``unicode_literals``, ``print_function``, ``nested_scopes`` et ``with_statement``. Elles sont toutes redondantes car elles sont de toute manière activées ; elles ne sont conservées que par souci de compatibilité descendante.

source: A future statement is recognized and treated specially at compile time: Changes to the semantics of core constructs are often implemented by generating different code. It may even be the case that a new feature introduces new incompatible syntax (such as a new reserved word), in which case the compiler may need to parse the module differently. Such decisions cannot be pushed off until runtime.
fr: Une instruction *future* est reconnue et traitée spécialement au moment de la compilation : les modifications à la sémantique des constructions de base sont souvent implémentées en générant un code différent. Il peut même arriver qu'une nouvelle fonctionnalité ait une syntaxe incompatible (tel qu'un nouveau mot réservé) ; dans ce cas, le compilateur a besoin d'analyser le module de manière différente. De telles décisions ne peuvent pas être différées au moment de l'exécution.

source: For any given release, the compiler knows which feature names have been defined, and raises a compile-time error if a future statement contains a feature not known to it.
fr: Pour une version donnée, le compilateur sait quelles fonctionnalités ont été définies et lève une erreur à la compilation si une instruction *future* contient une fonctionnalité qui lui est inconnue.

source: The direct runtime semantics are the same as for any import statement: there is a standard module :mod:`__future__`, described later, and it will be imported in the usual way at the time the future statement is executed.
fr: La sémantique à l'exécution est la même que pour toute autre instruction d'importation : il existe un module standard :mod:`__future__`, décrit plus loin, qui est importé comme les autres au moment ou l'instruction *future* est exécutée.

source: The interesting runtime semantics depend on the specific feature enabled by the future statement.
fr: La sémantique particulière à l'exécution dépend des fonctionnalités apportées par l'instruction *future*.

source: Note that there is nothing special about the statement::
fr: Notez que l'instruction suivante est tout à fait normale ::

source: That is not a future statement; it's an ordinary import statement with no special semantics or syntax restrictions.
fr: Ce n'est pas une instruction *future* ; c'est une instruction d'importation ordinaire qui n'a aucune sémantique particulière ou restriction de syntaxe.

source: Code compiled by calls to the built-in functions :func:`exec` and :func:`compile` that occur in a module :mod:`M` containing a future statement will, by default, use the new syntax or semantics associated with the future statement. This can be controlled by optional arguments to :func:`compile` --- see the documentation of that function for details.
fr: Le code compilé par des appels aux fonctions natives :func:`exec` et :func:`compile` dans un module :mod:`M` comportant une instruction *future* utilise, par défaut, la nouvelle syntaxe ou sémantique associée à l'instruction *future*. Ceci peut être contrôle par des arguments optionnels à :func:`compile` --- voir la documentation de cette fonction pour les détails.

source: A future statement typed at an interactive interpreter prompt will take effect for the rest of the interpreter session. If an interpreter is started with the :option:`-i` option, is passed a script name to execute, and the script includes a future statement, it will be in effect in the interactive session started after the script is executed.
fr: Une instruction *future* entrée à l'invite de l'interpréteur interactif est effective pour le reste de la session de l'interpréteur. Si l'interpréteur est démarré avec l'option :option:`-i`, qu'un nom de script est passé pour être exécuté et que ce script contient une instruction *future*, elle est effective pour la session interactive qui démarre après l'exécution du script.

source: :pep:`236` - Back to the __future__
fr: :pep:`236` -- retour vers le __future__

source: The original proposal for the __future__ mechanism.
fr: La proposition originale pour le mécanisme de __future__.

source: The :keyword:`!global` statement
fr: L'instruction :keyword:`!global`

source: The :keyword:`global` statement is a declaration which holds for the entire current code block. It means that the listed identifiers are to be interpreted as globals. It would be impossible to assign to a global variable without :keyword:`!global`, although free variables may refer to globals without being declared global.
fr: L'instruction :keyword:`global` est une déclaration qui couvre l'ensemble du bloc de code courant. Elle signifie que les noms (*identifier* dans la grammaire ci-dessus) listés doivent être interprétés comme globaux. Il est impossible d'assigner une variable globale sans :keyword:`!global`, mais rappelez-vous que les variables libres peuvent faire référence à des variables globales sans avoir été déclarées en tant que telles.

source: Names listed in a :keyword:`global` statement must not be used in the same code block textually preceding that :keyword:`!global` statement.
fr: Les noms listés dans l'instruction :keyword:`global` ne doivent pas être utilisés, dans le même bloc de code, avant l'instruction :keyword:`!global`.

source: Names listed in a :keyword:`global` statement must not be defined as formal parameters or in a :keyword:`for` loop control target, :keyword:`class` definition, function definition, :keyword:`import` statement, or variable annotation.
fr: Les noms listés dans l'instruction :keyword:`global` ne doivent pas être définis en tant que paramètre formel, cible d'une boucle :keyword:`for`, dans une définition de :keyword:`class`, de fonction, d'instruction :keyword:`import` ou une annotation de variable.

source: The current implementation does not enforce some of these restrictions, but programs should not abuse this freedom, as future implementations may enforce them or silently change the meaning of the program.
fr: L'implémentation actuelle ne vérifie pas toutes ces interdictions mais n'abusez pas de cette liberté car les implémentations futures pourraient faire la vérification ou modifier le comportement du programme sans vous avertir.

source: **Programmer's note:** :keyword:`global` is a directive to the parser. It applies only to code parsed at the same time as the :keyword:`!global` statement. In particular, a :keyword:`!global` statement contained in a string or code object supplied to the built-in :func:`exec` function does not affect the code block *containing* the function call, and code contained in such a string is unaffected by :keyword:`!global` statements in the code containing the function call. The same applies to the :func:`eval` and :func:`compile` functions.
fr: **Note pour les programmeurs :** :keyword:`global` est une directive à l'attention de l'analyseur syntaxique. Elle s'applique uniquement au code analysé en même temps que l'instruction :keyword:`!global`. En particulier, une instruction :keyword:`!global` contenue dans une chaîne ou un objet code fourni à la fonction native :func:`exec` n'affecte pas le code *contenant* cet appel et le code contenu dans un telle chaîne n'est pas affecté par une instruction :keyword:`!global` placée dans le code contenant l'appel. Il en est de même pour les fonctions :func:`eval` et :func:`compile`.

source: The :keyword:`!nonlocal` statement
fr: L'instruction :keyword:`!nonlocal`

source: The :keyword:`nonlocal` statement causes the listed identifiers to refer to previously bound variables in the nearest enclosing scope excluding globals. This is important because the default behavior for binding is to search the local namespace first. The statement allows encapsulated code to rebind variables outside of the local scope besides the global (module) scope.
fr: L'instruction :keyword:`nonlocal` fait que les noms listés font référence aux variables liées précédemment, dans la portée la plus petite entourant l'instruction, à l'exception des variables globales. C'est important car le comportement par défaut pour les liaisons consiste à chercher d'abord dans l'espace des noms locaux. Cette instruction permet à du code encapsulé de se lier à des variables en dehors de la portée locale du code mais sans avoir de portée globale (c'est-à-dire de niveau module).

source: Names listed in a :keyword:`nonlocal` statement, unlike those listed in a :keyword:`global` statement, must refer to pre-existing bindings in an enclosing scope (the scope in which a new binding should be created cannot be determined unambiguously).
fr: Les noms (*identifier* dans la grammaire ci-dessus) listés dans l'instruction :keyword:`nonlocal`, au contraire de ceux listés dans une instruction :keyword:`global`, doivent faire référence à des liaisons pré-existantes dans les portées englobantes (en effet, la portée dans laquelle devrait être créée la liaison ne peut pas être déterminée *a priori*).

source: Names listed in a :keyword:`nonlocal` statement must not collide with pre-existing bindings in the local scope.
fr: Les noms listés dans l'instruction :keyword:`nonlocal` ne doivent entrer en collision avec des liaisons déjà établies dans la portée locale.

source: :pep:`3104` - Access to Names in Outer Scopes
fr: :pep:`3104` -- Accès à des noms en dehors de la portée locale

source: The specification for the :keyword:`nonlocal` statement.
fr: Les spécifications pour l'instruction :keyword:`nonlocal`.
