Repository: python/python-docs-fr
Catalog: reference/simple_stmts.po
Languages: fr

source: These equivalences assume that :const:`__debug__` and :exc:`AssertionError` refer to the built-in variables with those names. In the current implementation, the built-in variable :const:`__debug__` is ``True`` under normal circumstances, ``False`` when optimization is requested (command line option :option:`-O`). The current code generator emits no code for an assert statement when optimization is requested at compile time. Note that it is unnecessary to include the source code for the expression that failed in the error message; it will be displayed as part of the stack trace.
fr: Ces équivalences supposent que :const:`__debug__` et :exc:`AssertionError` font référence aux variables natives ainsi nommées. Dans l'implémentation actuelle, la variable native :const:`__debug__` vaut ``True`` dans des circonstances normales, ``False`` quand les optimisations sont demandées (ligne de commande avec l'option :option:`-O`). Le générateur de code actuel ne produit aucun code pour une instruction ``assert`` quand vous demandez les optimisations à la compilation. Notez qu'il est superflu d'inclure le code source dans le message d'erreur pour l'expression qui a échoué : il est affiché dans la pile d'appels.

source: Assignments to :const:`__debug__` are illegal. The value for the built-in variable is determined when the interpreter starts.
fr: Assigner vers :const:`__debug__` est illégal. La valeur de cette variable native est déterminée au moment où l'interpréteur démarre.

source: The :keyword:`!pass` statement
fr: L'instruction :keyword:`!pass`

source: :keyword:`pass` is a null operation --- when it is executed, nothing happens. It is useful as a placeholder when a statement is required syntactically, but no code needs to be executed, for example::
fr: :keyword:`pass` est une opération vide --- quand elle est exécutée, rien ne se passe. Elle est utile comme bouche-trou lorsqu'une instruction est syntaxiquement requise mais qu'aucun code ne doit être exécuté. Par exemple ::

source: The :keyword:`!del` statement
fr: L'instruction :keyword:`!del`

source: Deletion is recursively defined very similar to the way assignment is defined. Rather than spelling it out in full details, here are some hints.
fr: La suppression est récursivement définie de la même manière que l'assignation. Plutôt que de détailler cela de manière approfondie, voici quelques indices.

source: Deletion of a target list recursively deletes each target, from left to right.
fr: La suppression d'une liste cible (*target_list* dans la grammaire ci-dessus) supprime récursivement chaque cible, de la gauche vers la droite.

source: Deletion of a name removes the binding of that name from the local or global namespace, depending on whether the name occurs in a :keyword:`global` statement in the same code block. If the name is unbound, a :exc:`NameError` exception will be raised.
fr: La suppression d'un nom détruit le lien entre ce nom dans l'espace des noms locaux, ou l'espace des noms globaux si ce nom apparaît dans une instruction :keyword:`global` dans le même bloc de code. Si le nom n'est pas lié, une exception :exc:`NameError` est levée.

source: Deletion of attribute references, subscriptions and slicings is passed to the primary object involved; deletion of a slicing is in general equivalent to assignment of an empty slice of the right type (but even this is determined by the sliced object).
fr: La suppression d'une référence à un attribut, une sélection ou une tranche est passée à l'objet primaire concerné : la suppression d'une tranche est en général équivalente à l'assignation d'une tranche vide du type adéquat (mais ceci est au final déterminé par l'objet que l'on tranche).

source: Previously it was illegal to delete a name from the local namespace if it occurs as a free variable in a nested block.
fr: Auparavant, il était illégal de supprimer un nom dans l'espace des noms locaux si celui-ci apparaissait comme variable libre dans un bloc imbriqué.

source: The :keyword:`!return` statement
fr: L'instruction :keyword:`!return`

source: :keyword:`return` may only occur syntactically nested in a function definition, not within a nested class definition.
fr: :keyword:`return` ne peut être placée qu'à l'intérieur d'une définition de fonction, pas à l'intérieur d'une définition de classe.

source: If an expression list is present, it is evaluated, else ``None`` is substituted.
fr: Si une liste d'expressions (*expression_list* dans la grammaire ci-dessus) est présente, elle est évaluée, sinon ``None`` est utilisée comme valeur par défaut.

source: :keyword:`return` leaves the current function call with the expression list (or ``None``) as return value.
fr: :keyword:`return` quitte l'appel à la fonction courante avec la liste d'expressions (ou ``None``) comme valeur de retour.

source: When :keyword:`return` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`!finally` clause is executed before really leaving the function.
fr: Quand :keyword:`return` fait sortir d'une instruction :keyword:`try` avec une clause :keyword:`finally`, cette clause :keyword:`!finally` est exécutée avant de réellement quitter la fonction.

source: In a generator function, the :keyword:`return` statement indicates that the generator is done and will cause :exc:`StopIteration` to be raised. The returned value (if any) is used as an argument to construct :exc:`StopIteration` and becomes the :attr:`StopIteration.value` attribute.
fr: Dans une fonction générateur, l'instruction :keyword:`return` indique que le générateur est terminé et provoque la levée d'une :exc:`StopIteration`. La valeur de retour (s'il y en a une) est utilisée comme argument pour construire l'exception :exc:`StopIteration` et devient l'attribut :attr:`StopIteration.value`.

source: In an asynchronous generator function, an empty :keyword:`return` statement indicates that the asynchronous generator is done and will cause :exc:`StopAsyncIteration` to be raised. A non-empty :keyword:`!return` statement is a syntax error in an asynchronous generator function.
fr: Dans une fonction générateur asynchrone, une instruction :keyword:`return` vide indique que le générateur asynchrone est terminé et provoque la levée d'une :exc:`StopAsyncIteration`. Une instruction :keyword:`!return` non vide est une erreur de syntaxe dans une fonction générateur asynchrone.

source: The :keyword:`!yield` statement
fr: L'instruction :keyword:`!yield`

source: A :keyword:`yield` statement is semantically equivalent to a :ref:`yield expression <yieldexpr>`. The yield statement can be used to omit the parentheses that would otherwise be required in the equivalent yield expression statement. For example, the yield statements ::
fr: L'instruction :keyword:`yield` est sémantiquement équivalente à une :ref:`expression yield <yieldexpr>`. L'instruction *yield* peut être utilisée pour omettre les parenthèses qui seraient autrement requises dans l'instruction équivalente d'expression *yield*. Par exemple, les instructions *yield* ::

source: are equivalent to the yield expression statements ::
fr: sont équivalentes aux instructions expressions *yield* ::

source: Yield expressions and statements are only used when defining a :term:`generator` function, and are only used in the body of the generator function. Using yield in a function definition is sufficient to cause that definition to create a generator function instead of a normal function.
fr: Les expressions et les instructions *yield* sont utilisées seulement dans la définition des fonctions :term:`générateurs <generator>` et apparaissent uniquement dans le corps de la fonction générateur. L'utilisation de *yield* dans la définition d'une fonction est suffisant pour que cette définition crée une fonction générateur au lieu d'une fonction normale.

source: For full details of :keyword:`yield` semantics, refer to the :ref:`yieldexpr` section.
fr: Pour tous les détails sur la sémantique de :keyword:`yield`, reportez-vous à la section :ref:`yieldexpr`.

source: The :keyword:`!raise` statement
fr: L'instruction :keyword:`!raise`

source: If no expressions are present, :keyword:`raise` re-raises the last exception that was active in the current scope. If no exception is active in the current scope, a :exc:`RuntimeError` exception is raised indicating that this is an error.
fr: Si aucune expression n'est présente, :keyword:`raise` propage la dernière exception active dans la portée courante. Si aucune exception n'est active dans la portée courante, une exception :exc:`RuntimeError` est levée, indiquant que c'est une erreur.

source: Otherwise, :keyword:`raise` evaluates the first expression as the exception object. It must be either a subclass or an instance of :class:`BaseException`. If it is a class, the exception instance will be obtained when needed by instantiating the class with no arguments.
fr: Sinon, :keyword:`raise` évalue la première expression en tant qu'objet exception. Ce doit être une sous-classe ou une instance de :class:`BaseException`. Si c'est une classe, l'instance de l'exception est obtenue en instanciant la classe sans argument (au moment voulu).

source: The :dfn:`type` of the exception is the exception instance's class, the :dfn:`value` is the instance itself.
fr: Le :dfn:`type` de l'exception est la classe de l'instance de l'exception, la :dfn:`value` est l'instance elle-même.

source: A traceback object is normally created automatically when an exception is raised and attached to it as the :attr:`__traceback__` attribute, which is writable. You can create an exception and set your own traceback in one step using the :meth:`with_traceback` exception method (which returns the same exception instance, with its traceback set to its argument), like so::
fr: Normalement, un objet *trace d'appels* est créé automatiquement quand une exception est levée et il lui est rattaché comme attribut :attr:`__traceback__`, en lecture-écriture. Vous pouvez créer une exception et définir votre propre trace d'appels d'un seul coup en utilisant la méthode des exceptions :meth:`with_traceback` (qui renvoie la même instance d'exception avec sa trace d'appels passée en argument), comme ceci ::

source: The ``from`` clause is used for exception chaining: if given, the second *expression* must be another exception class or instance, which will then be attached to the raised exception as the :attr:`__cause__` attribute (which is writable). If the raised exception is not handled, both exceptions will be printed::
fr: La clause ``from`` est utilisée pour chaîner les exceptions : si vous la fournissez, la seconde "expression" doit être une autre classe ou instance d'exception, qui est rattachée à l'exception levée en tant qu'attribut :attr:`__cause__` (en lecture-écriture). Si l'exception levée n'est pas gérée, les deux exceptions sont affichées ::

source: A similar mechanism works implicitly if an exception is raised inside an exception handler or a :keyword:`finally` clause: the previous exception is then attached as the new exception's :attr:`__context__` attribute::
fr: Un mécanisme similaire est mis en œuvre implicitement si une exception est levée à l'intérieur d'un gestionnaire d'exception ou d'une clause :keyword:`finally` : la première exception est rattachée à l'attribut :attr:`__context__` de la nouvelle exception ::

source: Exception chaining can be explicitly suppressed by specifying :const:`None` in the ``from`` clause::
fr: Le chaînage d'exceptions peut être explicitement supprimé en spécifiant :const:`None` dans la clause ``from`` ::

source: Additional information on exceptions can be found in section :ref:`exceptions`, and information about handling exceptions is in section :ref:`try`.
fr: Des informations complémentaires sur les exceptions sont disponibles dans la section :ref:`exceptions` et sur la gestion des exceptions dans la section :ref:`try`.

source: :const:`None` is now permitted as ``Y`` in ``raise X from Y``.
fr: :const:`None` est dorénavant autorisée en tant que ``Y`` dans ``raise X from Y``.

source: The ``__suppress_context__`` attribute to suppress automatic display of the exception context.
fr: L'attribut ``__suppress_context__`` pour supprimer l'affichage automatique du contexte de l'exception.

source: The :keyword:`!break` statement
fr: L'instruction :keyword:`!break`

source: :keyword:`break` may only occur syntactically nested in a :keyword:`for` or :keyword:`while` loop, but not nested in a function or class definition within that loop.
fr: Une instruction :keyword:`break` ne peut apparaître qu'à l'intérieur d'une boucle :keyword:`for` ou :keyword:`while`, mais pas dans une définition de fonction ou de classe à l'intérieur de cette boucle.

source: It terminates the nearest enclosing loop, skipping the optional :keyword:`!else` clause if the loop has one.
fr: Elle termine la boucle la plus imbriquée, shuntant l'éventuelle clause :keyword:`!else` de la boucle.

source: If a :keyword:`for` loop is terminated by :keyword:`break`, the loop control target keeps its current value.
fr: Si une boucle :keyword:`for` est terminée par un :keyword:`break`, la cible qui contrôle la boucle garde sa valeur.

source: When :keyword:`break` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`!finally` clause is executed before really leaving the loop.
fr: Quand :keyword:`break` passe le contrôle en dehors d'une instruction :keyword:`try` qui comporte une clause :keyword:`finally`, cette clause :keyword:`!finally` est exécutée avant de quitter la boucle.

source: The :keyword:`!continue` statement
fr: L'instruction :keyword:`!continue`

source: :keyword:`continue` may only occur syntactically nested in a :keyword:`for` or :keyword:`while` loop, but not nested in a function or class definition or :keyword:`finally` clause within that loop. It continues with the next cycle of the nearest enclosing loop.
fr: L'instruction :keyword:`continue` ne peut apparaître qu'à l'intérieur d'une boucle :keyword:`for` ou :keyword:`while`, mais pas dans une définition de fonction ou de classe ni dans une clause :keyword:`finally`, à l'intérieur de cette boucle. Elle fait continuer le flot d'exécution au prochain cycle de la boucle la plus imbriquée.

source: When :keyword:`continue` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`!finally` clause is executed before really starting the next loop cycle.
fr: Quand :keyword:`continue` passe le contrôle en dehors d'une instruction :keyword:`try` qui comporte une clause :keyword:`finally`, cette clause :keyword:`!finally` est exécutée avant de commencer le cycle suivant de la boucle.

source: The :keyword:`!import` statement
fr: L'instruction :keyword:`!import`

source: The basic import statement (no :keyword:`from` clause) is executed in two steps:
fr: L'instruction de base *import* (sans clause :keyword:`from`) est exécutée en deux étapes :

source: find a module, loading and initializing it if necessary
fr: trouve un module, le charge et l'initialise si nécessaire

source: define a name or names in the local namespace for the scope where the :keyword:`import` statement occurs.
fr: définit un ou des noms (*name* dans la grammaire ci-dessus) dans l'espace des noms locaux de la portée où l'instruction :keyword:`import` apparaît.

source: When the statement contains multiple clauses (separated by commas) the two steps are carried out separately for each clause, just as though the clauses had been separated out into individual import statements.
fr: Quand l'instruction contient plusieurs clauses (séparées par des virgules), les deux étapes sont menées séparément pour chaque clause, comme si les clauses étaient séparées dans des instructions d'importations individuelles.

source: The details of the first step, finding and loading modules are described in greater detail in the section on the :ref:`import system <importsystem>`, which also describes the various types of packages and modules that can be imported, as well as all the hooks that can be used to customize the import system. Note that failures in this step may indicate either that the module could not be located, *or* that an error occurred while initializing the module, which includes execution of the module's code.
fr: Les détails de la première étape, de recherche et de chargement des modules sont décrits largement dans la section relative au :ref:`système d'importation <importsystem>`, qui décrit également les différents types de paquets et modules qui peuvent être importés, de même que les points d'entrée pouvant être utilisés pour personnaliser le système d'importation. Notez que des erreurs dans cette étape peuvent indiquer soit que le module n'a pas été trouvé, soit qu'une erreur s'est produite lors de l'initialisation du module, ce qui comprend l'exécution du code du module.

source: If the requested module is retrieved successfully, it will be made available in the local namespace in one of three ways:
fr: Si le module requis est bien récupéré, il est mis à disposition de l'espace de noms locaux suivant l'une des trois façons suivantes :

source: If the module name is followed by :keyword:`!as`, then the name following :keyword:`!as` is bound directly to the imported module.
fr: Si le nom du module est suivi par :keyword:`!as`, alors le nom suivant :keyword:`!as` est directement lié au module importé.

source: If no other name is specified, and the module being imported is a top level module, the module's name is bound in the local namespace as a reference to the imported module
fr: si aucun autre nom n'est spécifié et que le module en cours d'importation est un module de niveau le plus haut, le nom du module est lié dans l'espace des noms locaux au module importé ;

source: If the module being imported is *not* a top level module, then the name of the top level package that contains the module is bound in the local namespace as a reference to the top level package. The imported module must be accessed using its full qualified name rather than directly
fr: si le module en cours d'importation n'est *pas* un module de plus haut niveau, alors le nom du paquet de plus haut niveau qui contient ce module est lié dans l'espace des noms locaux au paquet de plus haut niveau. Vous pouvez accéder au module importé en utilisant son nom pleinement qualifié et non directement.

source: The :keyword:`from` form uses a slightly more complex process:
fr: La forme :keyword:`from` utilise un processus un peu plus complexe :

source: find the module specified in the :keyword:`from` clause, loading and initializing it if necessary;
fr: trouve le module spécifié dans la clause :keyword:`from`, le charge et l'initialise si nécessaire ;

source: for each of the identifiers specified in the :keyword:`import` clauses:
fr: pour chaque nom spécifié dans les clauses :keyword:`import` :

source: check if the imported module has an attribute by that name
fr: vérifie si le module importé possède un attribut avec ce nom ;

source: if not, attempt to import a submodule with that name and then check the imported module again for that attribute
fr: si non, essaie d'importer un sous-module avec ce nom puis vérifie si le module importé possède lui-même cet attribut ;

source: if the attribute is not found, :exc:`ImportError` is raised.
fr: si l'attribut n'est pas trouvé, une :exc:`ImportError` est levée.

source: otherwise, a reference to that value is stored in the local namespace, using the name in the :keyword:`!as` clause if it is present, otherwise using the attribute name
fr: sinon, une référence à cette valeur est stockée dans l'espace des noms locaux, en utilisant le nom de la clause :keyword:`!as` si elle est présente, sinon en utilisant le nom de l'attribut.

source: Examples::
fr: Exemples : ::

source: If the list of identifiers is replaced by a star (``'*'``), all public names defined in the module are bound in the local namespace for the scope where the :keyword:`import` statement occurs.
fr: Si la liste des noms est remplacée par une étoile (``'*'``), tous les noms publics définis dans le module sont liés dans l'espace des noms locaux de la portée où apparaît l'instruction :keyword:`import`.

source: The *public names* defined by a module are determined by checking the module's namespace for a variable named ``__all__``; if defined, it must be a sequence of strings which are names defined or imported by that module. The names given in ``__all__`` are all considered public and are required to exist. If ``__all__`` is not defined, the set of public names includes all names found in the module's namespace which do not begin with an underscore character (``'_'``). ``__all__`` should contain the entire public API. It is intended to avoid accidentally exporting items that are not part of the API (such as library modules which were imported and used within the module).
fr: Les *noms publics* définis par un module sont déterminés en cherchant dans l'espace de noms du module une variable nommée ``__all__`` ; Si elle est définie, elle doit être une séquence de chaînes désignant les noms définis ou importés par ce module. Les noms donnés dans ``__all__`` sont tous considérés publics et doivent exister. Si ``__all__`` n'est pas définie, l'ensemble des noms publics contient tous les noms trouvés dans l'espace des noms du module qui ne commencent pas par un caractère souligné (``_``). ``__all__`` doit contenir toute l'API publique. Elle est destinée à éviter l'export accidentel d'éléments qui ne font pas partie de l'API (tels que des modules de bibliothèques qui ont été importés et utilisé à l'intérieur du module).

source: The wild card form of import --- ``from module import *`` --- is only allowed at the module level. Attempting to use it in class or function definitions will raise a :exc:`SyntaxError`.
fr: La forme d'\ *import* avec astérisque --- ``from module import *`` --- est autorisée seulement au niveau du module. Si vous essayez de l'utiliser dans une définition de classe ou de fonction, cela lève une :exc:`SyntaxError`.
