Repository: python/python-docs-fr
Catalog: reference/simple_stmts.po
Languages: fr

source: Simple statements
fr: Les instructions simples

source: A simple statement is comprised within a single logical line. Several simple statements may occur on a single line separated by semicolons. The syntax for simple statements is:
fr: Une instruction simple est contenue dans une seule ligne logique. Plusieurs instructions simples peuvent être écrites sur une seule ligne, séparées par des points-virgules. La syntaxe d'une instruction simple est :

source: Expression statements
fr: Les expressions

source: Expression statements are used (mostly interactively) to compute and write a value, or (usually) to call a procedure (a function that returns no meaningful result; in Python, procedures return the value ``None``). Other uses of expression statements are allowed and occasionally useful. The syntax for an expression statement is:
fr: Les expressions sont utilisées (généralement de manière interactive) comme instructions pour calculer et écrire des valeurs, appeler une procédure (une fonction dont le résultat renvoyé n'a pas d'importance ; en Python, les procédures renvoient la valeur ``None``). D'autres utilisations des expressions sont autorisées et parfois utiles. La syntaxe pour une expression en tant qu'instruction est :

source: An expression statement evaluates the expression list (which may be a single expression).
fr: Ce genre d'instruction évalue la liste d'expressions (qui peut se limiter à une seule expression).

source: In interactive mode, if the value is not ``None``, it is converted to a string using the built-in :func:`repr` function and the resulting string is written to standard output on a line by itself (except if the result is ``None``, so that procedure calls do not cause any output.)
fr: En mode interactif, si la valeur n'est pas ``None``, elle est convertie en chaîne en utilisant la fonction native :func:`repr` et la chaîne résultante est écrite sur la sortie standard sur sa propre ligne. Si le résultat est ``None``, rien n'est écrit ce qui est usuel pour les appels de procédures.

source: Assignment statements
fr: Les assignations

source: Assignment statements are used to (re)bind names to values and to modify attributes or items of mutable objects:
fr: Les assignations sont utilisées pour lier ou relier des noms à des valeurs et modifier des attributs ou des éléments d'objets muables :

source: (See section :ref:`primaries` for the syntax definitions for *attributeref*, *subscription*, and *slicing*.)
fr: Voir la section :ref:`primaries` pour la définition des syntaxes de *attributeref*, *subscription* et *slicing*.

source: An assignment statement evaluates the expression list (remember that this can be a single expression or a comma-separated list, the latter yielding a tuple) and assigns the single resulting object to each of the target lists, from left to right.
fr: Une assignation évalue la liste d'expressions (gardez en mémoire que ce peut être une simple expression ou une liste dont les éléments sont séparés par des virgules, cette dernière produisant un n-uplet) et assigne l'unique objet résultant à chaque liste cible, de la gauche vers la droite.

source: Assignment is defined recursively depending on the form of the target (list). When a target is part of a mutable object (an attribute reference, subscription or slicing), the mutable object must ultimately perform the assignment and decide about its validity, and may raise an exception if the assignment is unacceptable. The rules observed by various types and the exceptions raised are given with the definition of the object types (see section :ref:`types`).
fr: Une assignation est définie récursivement en fonction de la forme de la cible (une liste). Quand la cible est une partie d'un objet muable (une référence à un attribut, une sélection ou une tranche), l'objet muable doit effectuer l'assignation au final et décider de sa validité, voire lever une exception si l'assignation n'est pas acceptable. Les règles suivies par les différents types et les exceptions levées sont données dans les définitions des types d'objets (voir la section :ref:`types`).

source: Assignment of an object to a target list, optionally enclosed in parentheses or square brackets, is recursively defined as follows.
fr: L'assignation d'un objet à une liste cible, optionnellement entourée par des parenthèses ou des crochets, est définie récursivement comme suit.

source: If the target list is a single target with no trailing comma, optionally in parentheses, the object is assigned to that target.
fr: Si la liste cible est une cible unique sans virgule de fin, optionnellement entre parenthèses, l'objet est assigné à cette cible.

source: Else: The object must be an iterable with the same number of items as there are targets in the target list, and the items are assigned, from left to right, to the corresponding targets.
fr: Sinon : l'objet doit être un itérable avec le même nombre d'éléments qu'il y a de cibles dans la liste cible ; les éléments sont assignés, de la gauche vers la droite, vers les cibles correspondantes.

source: If the target list contains one target prefixed with an asterisk, called a "starred" target: The object must be an iterable with at least as many items as there are targets in the target list, minus one. The first items of the iterable are assigned, from left to right, to the targets before the starred target. The final items of the iterable are assigned to the targets after the starred target. A list of the remaining items in the iterable is then assigned to the starred target (the list can be empty).
fr: Si la liste cible contient une cible préfixée par un astérisque, appelée cible *étoilée* (*starred target* en anglais) : l'objet doit être un itérable avec au moins autant d'éléments qu'il y a de cibles dans la liste cible, moins un. Les premiers éléments de l'itérable sont assignés, de la gauche vers la droite, aux cibles avant la cible étoilée. Les éléments de queue de l'itérable sont assignés aux cibles après la cible étoilée. Une liste des éléments restants dans l'itérable est alors assignée à la cible étoilée (cette liste peut être vide).

source: Assignment of an object to a single target is recursively defined as follows.
fr: L'assignation d'un objet vers une cible unique est définie récursivement comme suit.

source: If the target is an identifier (name):
fr: Si la cible est une variable (un nom) :

source: If the name does not occur in a :keyword:`global` or :keyword:`nonlocal` statement in the current code block: the name is bound to the object in the current local namespace.
fr: si le nom n'apparaît pas dans une instruction :keyword:`global` ou :keyword:`nonlocal` (respectivement) du bloc de code courant : le nom est lié à l'objet dans l'espace courant des noms locaux.

source: Otherwise: the name is bound to the object in the global namespace or the outer namespace determined by :keyword:`nonlocal`, respectively.
fr: Sinon : le nom est lié à l'objet dans l'espace des noms globaux ou dans un espace de noms plus large déterminé par :keyword:`nonlocal`, respectivement.

source: The name is rebound if it was already bound. This may cause the reference count for the object previously bound to the name to reach zero, causing the object to be deallocated and its destructor (if it has one) to be called.
fr: Le lien du nom est modifié si le nom était déjà lié. Ceci peut faire que le compteur de références de l'objet auquel le nom était précédemment lié tombe à zéro, entrainant la dé-allocation de l'objet et l'appel de son destructeur (s'il existe).

source: If the target is an attribute reference: The primary expression in the reference is evaluated. It should yield an object with assignable attributes; if this is not the case, :exc:`TypeError` is raised. That object is then asked to assign the assigned object to the given attribute; if it cannot perform the assignment, it raises an exception (usually but not necessarily :exc:`AttributeError`).
fr: Si la cible est une référence à un attribut : l'expression primaire de la référence est évaluée. Elle doit produire un objet avec des attributs que l'on peut assigner : si ce n'est pas le cas, une :exc:`TypeError` est levée. Python demande alors à cet objet d'assigner l'attribut donné ; si ce n'est pas possible, une exception est levée (habituellement, mais pas nécessairement, :exc:`AttributeError`).

source: Note: If the object is a class instance and the attribute reference occurs on both sides of the assignment operator, the RHS expression, ``a.x`` can access either an instance attribute or (if no instance attribute exists) a class attribute. The LHS target ``a.x`` is always set as an instance attribute, creating it if necessary. Thus, the two occurrences of ``a.x`` do not necessarily refer to the same attribute: if the RHS expression refers to a class attribute, the LHS creates a new instance attribute as the target of the assignment::
fr: Note : si l'objet est une instance de classe et que la référence à l'attribut apparaît des deux côtés de l'opérateur d'assignation, l'expression "à droite", ``a.x`` peut accéder soit à l'attribut d'instance ou (si cet attribut d'instance n'existe pas) à l'attribut de classe. L'expression cible "à gauche" ``a.x`` est toujours définie comme un attribut d'instance, en le créant si nécessaire. Ainsi, les deux occurrences de ``a.x`` ne font pas nécessairement référence au même attribut : si l'expression "à droite" fait référence à un attribut de classe, l'expression "à gauche" crée un nouvel attribut d'instance comme cible de l'assignation ::

source: This description does not necessarily apply to descriptor attributes, such as properties created with :func:`property`.
fr: Cette description ne s'applique pas nécessairement aux attributs des descripteurs, telles que les propriétés créées avec :func:`property`.

source: If the target is a subscription: The primary expression in the reference is evaluated. It should yield either a mutable sequence object (such as a list) or a mapping object (such as a dictionary). Next, the subscript expression is evaluated.
fr: Si la cible est une sélection : l'expression primaire de la référence est évaluée. Elle doit produire soit un objet séquence mutable (telle qu'une liste) ou un objet tableau de correspondances (tel qu'un dictionnaire). Ensuite, l'expression de la sélection est évaluée.

source: If the primary is a mutable sequence object (such as a list), the subscript must yield an integer. If it is negative, the sequence's length is added to it. The resulting value must be a nonnegative integer less than the sequence's length, and the sequence is asked to assign the assigned object to its item with that index. If the index is out of range, :exc:`IndexError` is raised (assignment to a subscripted sequence cannot add new items to a list).
fr: Si la primaire est un objet séquence mutable (telle qu'une liste), la sélection doit produire un entier. S'il est négatif, la longueur de la séquence lui est ajoutée. La valeur résultante doit être un entier positif ou nul, plus petit que la longueur de la séquence, et Python demande à la séquence d'assigner l'objet à l'élément se trouvant à cet indice. Si l'indice est hors limites, une :exc:`IndexError` est levée (une assignation à une sélection dans une séquence ne peut pas ajouter de nouveaux éléments à une liste).

source: If the primary is a mapping object (such as a dictionary), the subscript must have a type compatible with the mapping's key type, and the mapping is then asked to create a key/datum pair which maps the subscript to the assigned object. This can either replace an existing key/value pair with the same key value, or insert a new key/value pair (if no key with the same value existed).
fr: Si la primaire est un objet tableau de correspondances (tel qu'un dictionnaire), la sélection doit être d'un type compatible avec le type des clés ; Python demande alors au tableau de correspondances de créer un couple clé-valeur qui associe la sélection à l'objet assigné. Ceci peut remplacer une correspondance déjà existante pour une clé donnée ou insérer un nouveau couple clé-valeur.

source: For user-defined objects, the :meth:`__setitem__` method is called with appropriate arguments.
fr: Pour les objets allogènes, la méthode :meth:`__setitem__` est appelée avec les arguments appropriés.

source: If the target is a slicing: The primary expression in the reference is evaluated. It should yield a mutable sequence object (such as a list). The assigned object should be a sequence object of the same type. Next, the lower and upper bound expressions are evaluated, insofar they are present; defaults are zero and the sequence's length. The bounds should evaluate to integers. If either bound is negative, the sequence's length is added to it. The resulting bounds are clipped to lie between zero and the sequence's length, inclusive. Finally, the sequence object is asked to replace the slice with the items of the assigned sequence. The length of the slice may be different from the length of the assigned sequence, thus changing the length of the target sequence, if the target sequence allows it.
fr: Si la cible est une tranche : l'expression primaire de la référence est évaluée. Elle doit produire un objet séquence mutable (telle qu'une liste). L'objet assigné doit être un objet séquence du même type. Ensuite, les expressions de la borne inférieure et de la borne supérieure sont évaluées, dans la mesure où elles sont spécifiées (les valeurs par défaut sont zéro et la longueur de la séquence). Les bornes doivent être des entiers. Si une borne est négative, la longueur de la séquence lui est ajoutée. Les bornes résultantes sont coupées pour être dans l'intervalle zéro -- longueur de la séquence, inclus. Finalement, Python demande à l'objet séquence de remplacer la tranche avec les éléments de la séquence à assigner. La longueur de la tranche peut être différent de la longueur de la séquence à assigner, ce qui modifie alors la longueur de la séquence cible, si celle-ci le permet.

source: In the current implementation, the syntax for targets is taken to be the same as for expressions, and invalid syntax is rejected during the code generation phase, causing less detailed error messages.
fr: Dans l'implémentation actuelle, la syntaxe pour les cibles est similaire à celle des expressions. Toute syntaxe invalide est rejetée pendant la phase de génération de code, ce qui produit des messages d'erreurs moins détaillés.

source: Although the definition of assignment implies that overlaps between the left-hand side and the right-hand side are 'simultaneous' (for example ``a, b = b, a`` swaps two variables), overlaps *within* the collection of assigned-to variables occur left-to-right, sometimes resulting in confusion. For instance, the following program prints ``[0, 2]``::
fr: Bien que la définition de l'assignation implique que le passage entre le côté gauche et le côté droit soient "simultanés" (par exemple, ``a, b = b, a`` permute les deux variables), le passage *à l'intérieur* des collections de variables que l'on assigne intervient de la gauche vers la droite, ce qui peut entraîner quelques confusions. Par exemple, le programme suivant affiche ``[0, 2]`` ::

source: :pep:`3132` - Extended Iterable Unpacking
fr: :pep:`3132` -- dépaquetage étendu d'itérable

source: The specification for the ``*target`` feature.
fr: Spécification de la fonctionnalité ``*cible``.

source: Augmented assignment statements
fr: Les assignations augmentées

source: Augmented assignment is the combination, in a single statement, of a binary operation and an assignment statement:
fr: Une assignation augmentée est la combinaison, dans une seule instruction, d'une opération binaire et d'une assignation :

source: (See section :ref:`primaries` for the syntax definitions of the last three symbols.)
fr: Voir la section :ref:`primaries` pour la définition des syntaxes des trois derniers symboles.

source: An augmented assignment evaluates the target (which, unlike normal assignment statements, cannot be an unpacking) and the expression list, performs the binary operation specific to the type of assignment on the two operands, and assigns the result to the original target. The target is only evaluated once.
fr: Une assignation augmentée évalue la cible (qui, au contraire des assignations normales, ne peut pas être un dépaquetage) et la liste d'expressions, effectue l'opération binaire (spécifique au type d'assignation) sur les deux opérandes et assigne le résultat à la cible originale. La cible n'est évaluée qu'une seule fois.

source: An augmented assignment expression like ``x += 1`` can be rewritten as ``x = x + 1`` to achieve a similar, but not exactly equal effect. In the augmented version, ``x`` is only evaluated once. Also, when possible, the actual operation is performed *in-place*, meaning that rather than creating a new object and assigning that to the target, the old object is modified instead.
fr: Une assignation augmentée comme ``x += 1`` peut être ré-écrite en ``x = x + 1`` pour obtenir un effet similaire, mais pas exactement équivalent. Dans la version augmentée. ``x`` n'est évalué qu'une seule fois. Aussi, lorsque c'est possible, l'opération concrète est effectuée *sur place*, c'est-à-dire que plutôt que de créer un nouvel objet et l'assigner à la cible, c'est le vieil objet qui est modifié.

source: Unlike normal assignments, augmented assignments evaluate the left-hand side *before* evaluating the right-hand side. For example, ``a[i] += f(x)`` first looks-up ``a[i]``, then it evaluates ``f(x)`` and performs the addition, and lastly, it writes the result back to ``a[i]``.
fr: Au contraire des assignations normales, les assignations augmentées évaluent la partie gauche *avant* d'évaluer la partie droite. Par exemple, ``a[i] += f(x)`` commence par s'intéresser à ``a[i]``, puis Python évalue ``f(x)``, effectue l'addition et, enfin, écrit le résultat dans ``a[i]``.

source: With the exception of assigning to tuples and multiple targets in a single statement, the assignment done by augmented assignment statements is handled the same way as normal assignments. Similarly, with the exception of the possible *in-place* behavior, the binary operation performed by augmented assignment is the same as the normal binary operations.
fr: À l'exception de l'assignation de tuples et de cibles multiples dans une seule instruction, l'assignation effectuée par une assignation augmentée est traitée de la même manière qu'une assignation normale. De même, à l'exception du comportement possible *sur place*, l'opération binaire effectuée par assignation augmentée est la même que les opérations binaires normales.

source: For targets which are attribute references, the same :ref:`caveat about class and instance attributes <attr-target-note>` applies as for regular assignments.
fr: Pour les cibles qui sont des références à des attributs, la même :ref:`mise en garde sur les attributs de classe et d'instances <attr-target-note>` s'applique que pour les assignations normales.

source: Annotated assignment statements
fr: Les assignations annotées

source: :term:`Annotation <variable annotation>` assignment is the combination, in a single statement, of a variable or attribute annotation and an optional assignment statement:
fr: Une assignation :term:`annotée <variable annotation>` est la combinaison, dans une seule instruction, d'une annotation de variable ou d'attribut et d'une assignation optionnelle :

source: The difference from normal :ref:`assignment` is that only single target and only single right hand side value is allowed.
fr: La différence avec une assignation normale (voir :ref:`ci-dessus <assignment>`) est qu'une seule cible et qu'une seule valeur à droite ne sont autorisées.

source: For simple names as assignment targets, if in class or module scope, the annotations are evaluated and stored in a special class or module attribute :attr:`__annotations__` that is a dictionary mapping from variable names (mangled if private) to evaluated annotations. This attribute is writable and is automatically created at the start of class or module body execution, if annotations are found statically.
fr: Pour des noms simples en tant que cibles d'assignation, dans une portée de classe ou de module, les annotations sont évaluées et stockées dans un attribut de classe ou de module spécial, :attr:`__annotations__`, qui est un dictionnaire dont les clés sont les noms de variables (réécrits si le nom est privé) et les valeurs sont les annotations. Cet attribut est accessible en écriture et est automatiquement créé au démarrage de l'exécution du corps de la classe ou du module, si les annotations sont trouvées statiquement.

source: For expressions as assignment targets, the annotations are evaluated if in class or module scope, but not stored.
fr: Pour les expressions en tant que cibles d'assignations, les annotations sont évaluées dans la portée de la classe ou du module, mais ne sont pas stockées.

source: If a name is annotated in a function scope, then this name is local for that scope. Annotations are never evaluated and stored in function scopes.
fr: Si le nom est annoté dans la portée d'une fonction, alors ce nom est local à cette portée. Les annotations ne sont jamais évaluées et stockées dans les portées des fonctions.

source: If the right hand side is present, an annotated assignment performs the actual assignment before evaluating annotations (where applicable). If the right hand side is not present for an expression target, then the interpreter evaluates the target except for the last :meth:`__setitem__` or :meth:`__setattr__` call.
fr: Si la partie droite est présente, une assignation annotée effectue l'assignation en tant que telle avant d'évaluer les annotations (là où c'est possible). Si la partie droite n'est pas présente pour une cible d'expression, alors l'interpréteur évalue la cible sauf pour le dernier appel à :meth:`__setitem__` ou :meth:`__setattr__`.

source: :pep:`526` - Syntax for Variable Annotations
fr: :pep:`526` -- Syntaxe pour les annotations de variables

source: The proposal that added syntax for annotating the types of variables (including class variables and instance variables), instead of expressing them through comments.
fr: La proposition qui a ajouté la syntaxe pour annoter les types de variables (y compris les variables de classe et les variables d'instance), au lieu de les exprimer par le biais de commentaires.

source: :pep:`484` - Type hints
fr: :pep:`484` -- Indices de type

source: The proposal that added the :mod:`typing` module to provide a standard syntax for type annotations that can be used in static analysis tools and IDEs.
fr: La proposition qui a ajouté le module :mod:`typing` pour fournir une syntaxe standard pour les annotations de type qui peuvent être utilisées dans les outils d'analyse statique et les EDIs.

source: The :keyword:`!assert` statement
fr: L'instruction :keyword:`!assert`

source: Assert statements are a convenient way to insert debugging assertions into a program:
fr: Les instructions ``assert`` sont une manière pratique d'insérer des tests de débogage au sein d'un programme :

source: The simple form, ``assert expression``, is equivalent to ::
fr: La forme la plus simple, ``assert expression``, est équivalente à ::

source: The extended form, ``assert expression1, expression2``, is equivalent to ::
fr: La forme étendue, ``assert expression1, expression2``, est équivalente à ::
