Repository: python/python-docs-fr
Catalog: reference/toplevel_components.po
Languages: fr

source: Top-level components
fr: Composants de plus haut niveau

source: The Python interpreter can get its input from a number of sources: from a script passed to it as standard input or as program argument, typed in interactively, from a module source file, etc. This chapter gives the syntax used in these cases.
fr: L'entrée de l'interpréteur Python peut provenir d'un certain nombre de sources : d'un script passé en entrée standard ou en argument de programme, tapée de manière interactive, à partir d'un fichier source de module, etc. Ce chapitre donne la syntaxe utilisée dans ces différents cas.

source: Complete Python programs
fr: Programmes Python complets

source: While a language specification need not prescribe how the language interpreter is invoked, it is useful to have a notion of a complete Python program. A complete Python program is executed in a minimally initialized environment: all built-in and standard modules are available, but none have been initialized, except for :mod:`sys` (various system services), :mod:`builtins` (built-in functions, exceptions and ``None``) and :mod:`__main__`. The latter is used to provide the local and global namespace for execution of the complete program.
fr: Bien que les spécifications d'un langage n'ont pas à préciser comment l'interpréteur du langage est invoqué, il est utile d'avoir des notions sur ce qu'est un programme Python complet. Un programme Python complet est exécuté dans un environnement dont l'initialisation est minimale : tous les modules intégrés et standard sont disponibles mais aucun n'a été initialisé, à l'exception de :mod:`sys` (divers services système), :mod:`builtins` (fonctions natives, exceptions et ``None``) et :mod:`__main__`. Ce dernier est utilisé pour avoir des espaces de nommage locaux et globaux pour l'exécution du programme complet.

source: The syntax for a complete Python program is that for file input, described in the next section.
fr: La syntaxe d'un programme Python complet est celle d'un fichier d'entrée, dont la description est donnée dans la section suivante.

source: The interpreter may also be invoked in interactive mode; in this case, it does not read and execute a complete program but reads and executes one statement (possibly compound) at a time. The initial environment is identical to that of a complete program; each statement is executed in the namespace of :mod:`__main__`.
fr: L'interpréteur peut également être invoqué en mode interactif ; dans ce cas, il ne lit et n'exécute pas un programme complet mais lit et exécute une seule instruction (éventuellement composée) à la fois. L'environnement initial est identique à celui d'un programme complet ; chaque instruction est exécutée dans l'espace de nommage de :mod:`__main__`.

source: A complete program can be passed to the interpreter in three forms: with the :option:`-c` *string* command line option, as a file passed as the first command line argument, or as standard input. If the file or standard input is a tty device, the interpreter enters interactive mode; otherwise, it executes the file as a complete program.
fr: Un programme complet peut être transmis à l'interpréteur sous trois formes : avec l'option :option:`-c` *chaîne* en ligne de commande, avec un fichier passé comme premier argument de ligne de commande ou comme entrée standard. Si le fichier ou l'entrée standard est un périphérique tty, l'interpréteur entre en mode interactif ; sinon, il exécute le fichier comme un programme complet.

source: File input
fr: Fichier d'entrée

source: All input read from non-interactive files has the same form:
fr: Toutes les entrées lues à partir de fichiers non interactifs sont de la même forme :

source: This syntax is used in the following situations:
fr: Cette syntaxe est utilisée dans les situations suivantes :

source: when parsing a complete Python program (from a file or from a string);
fr: lors de l'analyse d'un programme Python complet (à partir d'un fichier ou d'une chaîne de caractères) ;

source: when parsing a module;
fr: lors de l'analyse d'un module ;

source: when parsing a string passed to the :func:`exec` function;
fr: lors de l'analyse d'une chaîne de caractères passée à la fonction :func:`exec`.

source: Interactive input
fr: Entrée interactive

source: Input in interactive mode is parsed using the following grammar:
fr: L'entrée en mode interactif est analysée à l'aide de la grammaire suivante :

source: Note that a (top-level) compound statement must be followed by a blank line in interactive mode; this is needed to help the parser detect the end of the input.
fr: Notez qu'une instruction composée (de niveau supérieur) doit être suivie d'une ligne blanche en mode interactif ; c'est nécessaire pour aider l'analyseur à détecter la fin de l'entrée.

source: Expression input
fr: Entrée d'expression

source: :func:`eval` is used for expression input. It ignores leading whitespace. The string argument to :func:`eval` must have the following form:
fr: :func:`eval` est utilisée pour évaluer les expressions entrées. Elle ignore les espaces en tête. L'argument de :func:`eval`, de type chaîne de caractères, doit être de la forme suivante :
