Repository: python/python-docs-fr
Catalog: library/*.po
Languages: ast

source: :mod:`ast` --- Abstract Syntax Trees
ast: :mod:`ast` — Arbres Syntaxiques Abstraits

source: **Source code:** :source:`Lib/ast.py`
ast: **Code source :** :source:`Lib/ast.py`

source: The :mod:`ast` module helps Python applications to process trees of the Python abstract syntax grammar. The abstract syntax itself might change with each Python release; this module helps to find out programmatically what the current grammar looks like.
ast: Le module :mod:`ast` permet aux applications Python de traiter les arbres syntaxiques, dérivés directement de la grammaire abstraite du langage. On peut notamment déterminer dans un programme la forme de chaque élément de grammaire, qui est susceptible d'être modifiée par les nouvelles versions de Python.

source: An abstract syntax tree can be generated by passing :data:`ast.PyCF_ONLY_AST` as a flag to the :func:`compile` built-in function, or using the :func:`parse` helper provided in this module. The result will be a tree of objects whose classes all inherit from :class:`ast.AST`. An abstract syntax tree can be compiled into a Python code object using the built-in :func:`compile` function.
ast: Un arbre syntaxique abstrait peut être généré en passant l'option :data:`ast.PyCF_ONLY_AST` à la fonction native :func:`compile`, ou à l'aide de la fonction auxiliaire :func:`parse` fournie par ce module. Le résultat est un arbre composé d'objets dont les classes héritent toutes de :class:`ast.AST`. On peut compiler les arbres en code objet Python à l'aide de la fonction native :func:`compile`.

source: Abstract Grammar
ast: Grammaire abstraite

source: The abstract grammar is currently defined as follows:
ast: La grammaire abstraite est actuellement définie comme suit :

source: Node classes
ast: Classes de nœuds

source: There is one class defined for each left-hand side symbol in the abstract grammar (for example, :class:`ast.stmt` or :class:`ast.expr`). In addition, there is one class defined for each constructor on the right-hand side; these classes inherit from the classes for the left-hand side trees. For example, :class:`ast.BinOp` inherits from :class:`ast.expr`. For production rules with alternatives (aka "sums"), the left-hand side class is abstract: only instances of specific constructor nodes are ever created.
ast: Il y a une classe définie pour chacun des symboles présents à gauche dans la grammaire abstraite (par exemple :class:`ast.stmt` ou :class:`ast.expr`). En plus de cela, une classe est définie pour chacun des constructeurs présentés à droite ; ces classes héritent des classes situées à leur gauche dans l'arbre. Par exemple, la classe :class:`ast.BinOp` hérite de la classe :class:`ast.expr`. Pour les règles de réécriture avec alternatives (les « sommes »), la classe de la partie gauche est abstraite : seules les classes de nœuds à droite sont instanciées.

source: Each concrete class has an attribute :attr:`_fields` which gives the names of all child nodes.
ast: Chaque classe concrète possède un attribut :attr:`_fields` donnant les noms de tous les nœuds enfants.

source: Each instance of a concrete class has one attribute for each child node, of the type as defined in the grammar. For example, :class:`ast.BinOp` instances have an attribute :attr:`left` of type :class:`ast.expr`.
ast: Chaque instance d'une classe concrète possède un attribut pour chaque nœud enfant, du type défini par la grammaire. Par exemple, les instances :class:`ast.BinOp` possèdent un attribut :attr:`left` de type :class:`ast.expr`.

source: If these attributes are marked as optional in the grammar (using a question mark), the value might be ``None``. If the attributes can have zero-or-more values (marked with an asterisk), the values are represented as Python lists. All possible attributes must be present and have valid values when compiling an AST with :func:`compile`.
ast: Si un attribut est marqué comme optionnel dans la grammaire (avec un point d'interrogation ``?``), sa valeur peut être ``None``. S'il peut avoir zéro, une ou plusieurs valeurs (ce qui est marqué par un astérisque ``*``), elles sont regroupées dans une liste Python. Tous les attributs possibles doivent être présents et avoir une valeur valide pour compiler un arbre syntaxique avec :func:`compile`.

source: Note that the end positions are not required by the compiler and are therefore optional. The end offset is *after* the last symbol, for example one can get the source segment of a one-line expression node using ``source_line[node.col_offset : node.end_col_offset]``.
ast: Les décalages *end…* ne sont pas obligatoires ni nécessaires au compilateur. *end_col_offset* pointe *après* le dernier lexème. On peut donc obtenir la partie du code source ayant donné lieu à une expression avec ``ligne_source[nœud.col_offset : nœud.end_col_offset]``.

source: The constructor of a class :class:`ast.T` parses its arguments as follows:
ast: Le constructeur d'une classe nommée :class:`ast.T` analyse ses arguments comme suit :

source: If there are positional arguments, there must be as many as there are items in :attr:`T._fields`; they will be assigned as attributes of these names.
ast: S'il y a des arguments positionnels, il doit y avoir autant de termes dans :attr:`T._fields` ; ils sont assignés comme attributs portant ces noms.

source: If there are keyword arguments, they will set the attributes of the same names to the given values.
ast: S'il y a des arguments nommés, ils définissent les attributs de mêmes noms avec les valeurs données.

source: For example, to create and populate an :class:`ast.UnaryOp` node, you could use ::
ast: Par exemple, pour créer et peupler un nœud :class:`ast.UnaryOp`, on peut utiliser ::

source: or the more compact ::
ast: ou, plus compact ::

source: Class :class:`ast.Constant` is now used for all constants.
ast: toutes les constantes sont désormais représentées par des instances de :class:`ast.Constant`.

source: Old classes :class:`ast.Num`, :class:`ast.Str`, :class:`ast.Bytes`, :class:`ast.NameConstant` and :class:`ast.Ellipsis` are still available, but they will be removed in future Python releases. In the meantime, instantiating them will return an instance of a different class.
ast: les classes :class:`ast.Num`, :class:`ast.Str`, :class:`ast.Bytes`, :class:`ast.NameConstant` et :class:`ast.Ellipsis` sont toujours présentes, mais seront supprimées dans une version future. Pour l'instant, leurs constructeurs renvoient des instances de classes différentes.

source: Old classes :class:`ast.Index` and :class:`ast.ExtSlice` are still available, but they will be removed in future Python releases. In the meantime, instantiating them will return an instance of a different class.
ast: les classes :class:`ast.Index` et :class:`ast.ExtSlice` seront retirées à l'avenir. Pour l'instant, elles sont toujours disponibles mais leurs constructeurs renvoient des instances de classes différentes.

source: The descriptions of the specific node classes displayed here were initially adapted from the fantastic `Green Tree Snakes <https://greentreesnakes.readthedocs.io/en/latest/>`__ project and all its contributors.
ast: Les descriptions individuelles des classes de nœuds dans la prochaine section sont au départ adaptées du merveilleux projet `Green Tree Snakes <https://greentreesnakes.readthedocs.io/en/latest/>`_, porté par de nombreux contributeurs.

source: Literals
ast: Littéraux

source: A constant value. The ``value`` attribute of the ``Constant`` literal contains the Python object it represents. The values represented can be simple types such as a number, string or ``None``, but also immutable container types (tuples and frozensets) if all of their elements are constant.
ast: Valeur constante, contenue dans le champ *value*. Les valeurs possibles sont celles de types simples comme les nombres, les chaînes de caractères, ou encore ``None``, mais aussi certains conteneurs immuables (*n*-uplets et ensembles figés) lorsque tous leurs éléments sont constants.

source: Node representing a single formatting field in an f-string. If the string contains a single formatting field and nothing else the node can be isolated otherwise it appears in :class:`JoinedStr`.
ast: Champ de formatage dans une chaîne littérale formatée (*f-string*). Ce nœud peut être isolé si la chaîne contient un unique champ et rien d'autre. Sinon, il apparaît dans :class:`JoinedStr`.

source: ``value`` is any expression node (such as a literal, a variable, or a function call).
ast: *value* est un nœud d'expression quelconque (comme un littéral, une variable, ou encore un appel de fonction).

source: ``conversion`` is an integer:
ast: *conversion* est un entier parmi les valeurs suivantes :

source: -1: no formatting
ast: -1, aucun formatage ;

source: 115: ``!s`` string formatting
ast: 115, pour le formatage par ``str()`` correspondant à ``!s`` ;

source: 114: ``!r`` repr formatting
ast: 114, pour le formatage par ``repr()`` correspondant à ``!r`` ;

source: 97: ``!a`` ascii formatting
ast: 97, pour le formatage par ``ascii()`` correspondant à ``!a``.

source: ``format_spec`` is a :class:`JoinedStr` node representing the formatting of the value, or ``None`` if no format was specified. Both ``conversion`` and ``format_spec`` can be set at the same time.
ast: *format_spec* est un nœud :class:`JoinedStr` qui précise la manière de formater la valeur. Si aucun formatage particulier n'a été donné, *format_spec* vaut ``None``. *conversion* et *format_spec* peuvent tout à fait coexister.

source: An f-string, comprising a series of :class:`FormattedValue` and :class:`Constant` nodes.
ast: Chaîne littérale formatée (*f-string*), qui contient une liste de nœuds :class:`FormattedValue` et :class:`Constant`.

source: A list or tuple. ``elts`` holds a list of nodes representing the elements. ``ctx`` is :class:`Store` if the container is an assignment target (i.e. ``(x,y)=something``), and :class:`Load` otherwise.
ast: Liste ou *n*-uplet, dont les éléments sont rassemblés dans la liste *elts*. *ctx* est une instance de :class:`Store` si la liste ou le *n*-uplet est la cible d'une affectation (par exemple ``(x, y) = quelque_chose``). Sinon, c'est une instance de :class:`Load`.

source: A set. ``elts`` holds a list of nodes representing the set's elements.
ast: Ensemble. *elts* est la liste de ses éléments.

source: A dictionary. ``keys`` and ``values`` hold lists of nodes representing the keys and the values respectively, in matching order (what would be returned when calling :code:`dictionary.keys()` and :code:`dictionary.values()`).
ast: Dictionnaire. Les listes *keys* et *values* contiennent respectivement les clés et les valeurs. Leurs ordres se correspondent, c'est-à-dire que la valeur associée à l'élément d'indice *i* dans *keys* est à chercher à l'indice *i* de *values*. *keys* et *values* sont donc des équivalents à ``dictionnaire.keys()`` et ``dictionnaire.values()``.

source: When doing dictionary unpacking using dictionary literals the expression to be expanded goes in the ``values`` list, with a ``None`` at the corresponding position in ``keys``.
ast: Si un dictionnaire littéral contient une expression doublement étoilée à déballer, elle est intégrée dans *values*, et ``None`` est mis à la place correspondante dans *keys*.

source: A variable name. ``id`` holds the name as a string, and ``ctx`` is one of the following types.
ast: Variable, dont le nom est *id* (une chaîne de caractères). *ctx* est de l'un des trois types :

source: Variable references can be used to load the value of a variable, to assign a new value to it, or to delete it. Variable references are given a context to distinguish these cases.
ast: Ces types de contexte distinguent les variables selon qu'elles sont utilisées pour lire la valeur, mettre la variable à une nouvelle valeur, ou supprimer la variable.

source: A ``*var`` variable reference. ``value`` holds the variable, typically a :class:`Name` node. This type must be used when building a :class:`Call` node with ``*args``.
ast: Élément étoilé. *value* est le nœud auquel s'applique l'étoile. Le plus souvent, *value* est une instance de :class:`Name`. Ce type est notamment nécessaire pour les appels de fonction avec déballage d'arguments (par exemple ``fonction(*args)`` ; voir aussi :class:`Call`).

source: When an expression, such as a function call, appears as a statement by itself with its return value not used or stored, it is wrapped in this container. ``value`` holds one of the other nodes in this section, a :class:`Constant`, a :class:`Name`, a :class:`Lambda`, a :class:`Yield` or :class:`YieldFrom` node.
ast: Lorsque une expression, comme l'appel d'une fonction, apparaît comme une instruction à elle seule, sans que la valeur ne soit utilisée ou sauvegardée, l'expression est insérée dans ce conteneur. Le type de *value* peut être l'un des autres nœuds décrits dans cette section, ou bien parmi :class:`Constant`, :class:`Name`, :class:`Lambda`, :class:`Yield` et :class:`YieldFrom`.

source: A unary operation. ``op`` is the operator, and ``operand`` any expression node.
ast: Unité lexicale désignant une opération unaire. L'opérateur est *op*, l'opérande *operand* est un nœud d'expression quelconque.

source: Unary operator tokens. :class:`Not` is the ``not`` keyword, :class:`Invert` is the ``~`` operator.
ast: Unités lexicales désignant des opérations unaires. :class:`Not` correspond au mot-clé ``not``, :class:`Invert` à l'opérateur ``~``.

source: A binary operation (like addition or division). ``op`` is the operator, and ``left`` and ``right`` are any expression nodes.
ast: Opération binaire (comme l'addition ou la division). L'opérateur est *op*, les opérandes *left* et *right* sont des nœuds d'expression quelconques.

source: Binary operator tokens.
ast: Unités lexicales pour les opérations binaires.

source: A boolean operation, 'or' or 'and'. ``op`` is :class:`Or` or :class:`And`. ``values`` are the values involved. Consecutive operations with the same operator, such as ``a or b or c``, are collapsed into one node with several values.
ast: Opération booléenne, c'est-à-dire ``and`` ou ``or``, entre *op* et les éléments de *values*. Les deux opérateurs sont distingués par le type de *op*, à savoir :class:`And` ou :class:`Or`. Les applications successives du même opérateur (comme ``a or b or c``) sont regroupées dans un nœud unique avec plusieurs éléments dans la liste *values*.

source: This doesn't include ``not``, which is a :class:`UnaryOp`.
ast: L'opérateur ``not`` n'est pas implémenté ici, mais bien dans :class:`UnaryOp`.

source: Boolean operator tokens.
ast: Unités lexicales pour les opérations booléennes.

source: A comparison of two or more values. ``left`` is the first value in the comparison, ``ops`` the list of operators, and ``comparators`` the list of values after the first element in the comparison.
ast: Comparaison de deux valeurs ou plus. *left* est le premier élément de la comparaison, *ops* la liste des opérateurs, et *comparators* la liste des éléments restants de la comparaison.

source: Comparison operator tokens.
ast: Unités lexicales pour les comparaisons.

source: A function call. ``func`` is the function, which will often be a :class:`Name` or :class:`Attribute` object. Of the arguments:
ast: Appel d'une fonction. Le nœud *func*, représentant la fonction appelée, est habituellement de type :class:`Name` ou :class:`Attribute`. Les arguments sont contenus dans :

source: ``args`` holds a list of the arguments passed by position.
ast: *args*, la liste des arguments passés sans les nommer (arguments positionnels) ;

source: ``keywords`` holds a list of :class:`keyword` objects representing arguments passed by keyword.
ast: *keywords*, la liste des arguments nommés sous forme de nœuds :class:`keyword`.

source: When creating a ``Call`` node, ``args`` and ``keywords`` are required, but they can be empty lists. ``starargs`` and ``kwargs`` are optional.
ast: Les arguments *args* et *keywords* du constructeur de ``Call`` sont obligatoires (mais peuvent être des listes vides). *starargs* (arguments étoilés) et *kwargs* (arguments nommés) sont facultatifs.

source: An expression such as ``a if b else c``. Each field holds a single node, so in the following example, all three are :class:`Name` nodes.
ast: Expression ternaire (``a if b else c``). Chaque champ contient un unique nœud. Dans l'exemple suivant, les trois sont de la classe :class:`Name`.

source: Attribute access, e.g. ``d.keys``. ``value`` is a node, typically a :class:`Name`. ``attr`` is a bare string giving the name of the attribute, and ``ctx`` is :class:`Load`, :class:`Store` or :class:`Del` according to how the attribute is acted on.
ast: Accès à un attribut (comme ``d.keys``). *value* est un nœud, souvent de la classe :class:`Name`. *attr* est le nom de l'attribut, sous forme de chaîne de caractères. *ctx* est de classe :class:`Load`, :class:`Store` ou :class:`Del` selon le type de l'action effectuée sur l'attribut.

source: A named expression. This AST node is produced by the assignment expressions operator (also known as the walrus operator). As opposed to the :class:`Assign` node in which the first argument can be multiple nodes, in this case both ``target`` and ``value`` must be single nodes.
ast: Expression d'affectation. Ces nœuds proviennent de l'opérateur « morse » ``:=``. Contrairement à :class:`Assign`, dont le premier argument est une liste qui peut contenir plusieurs cibles, les arguments *target* et *value* sont ici des nœuds simples.

source: Subscripting
ast: Indiçage

source: A subscript, such as ``l[1]``. ``value`` is the subscripted object (usually sequence or mapping). ``slice`` is an index, slice or key. It can be a :class:`Tuple` and contain a :class:`Slice`. ``ctx`` is :class:`Load`, :class:`Store` or :class:`Del` according to the action performed with the subscript.
ast: Accès à un indice, par exemple ``liste[1]``. *value* est l'objet où l'indice est pris, donc la plupart du temps une séquence ou une table associative. *slice* est soit un indice, soit une tranche, soit une clé. Les instances de :class:`Tuple` pour *slice* peuvent contenir des objets :class:`Slice`. *ctx* est de type :class:`Load`, :class:`Store` ou :class:`Del` selon l'action appliquée à l'indice.

source: Regular slicing (on the form ``lower:upper`` or ``lower:upper:step``). Can occur only inside the *slice* field of :class:`Subscript`, either directly or as an element of :class:`Tuple`.
ast: Tranches normales (de la forme ``début:fin`` ou ``début:fin:pas``). Les instances de cette classe ne peuvent apparaître que dans le champ *slice* d'un :class:`Subscript`, que ce soit directement ou en tant qu'élément d'un :class:`Tuple`.

source: Comprehensions
ast: Compréhensions

source: List and set comprehensions, generator expressions, and dictionary comprehensions. ``elt`` (or ``key`` and ``value``) is a single node representing the part that will be evaluated for each item.
ast: Liste, ensemble ou dictionnaire en compréhension, ou expression génératrice. *elt* est l'expression avant le premier ``for``, évaluée à chaque itération. Il est remplacé par *key* (expression pour la clé) et *value* (expression pour la valeur) dans le cas des dictionnaires.

source: ``generators`` is a list of :class:`comprehension` nodes.
ast: *generators* est une liste de nœuds :class:`comprehension`.

source: One ``for`` clause in a comprehension. ``target`` is the reference to use for each element - typically a :class:`Name` or :class:`Tuple` node. ``iter`` is the object to iterate over. ``ifs`` is a list of test expressions: each ``for`` clause can have multiple ``ifs``.
ast: Une clause ``for`` à l'intérieur d'une compréhension. *iter* est l'objet à parcourir, *target* est la cible de l'affectation qui se produit à chaque itération (la plupart du temps un nœud :class:`Name` ou :class:`Tuple`). *ifs* contient les tests qui décident si l'élément doit être inséré. C'est une liste, car chaque ``for`` peut être suivi de plusieurs ``if``.

source: ``is_async`` indicates a comprehension is asynchronous (using an ``async for`` instead of ``for``). The value is an integer (0 or 1).
ast: *is_async* est une valeur booléenne sous forme d'entier, 0 ou 1, qui indique si la compréhension est asynchrone, c'est-à-dire qu'elle a été écrite avec ``async for`` au lieu de ``for``.

source: Statements
ast: Instructions

source: An assignment. ``targets`` is a list of nodes, and ``value`` is a single node.
ast: Affectation. *targets* est une liste de nœuds, *value* est simplement un nœud.

source: Multiple nodes in ``targets`` represents assigning the same value to each. Unpacking is represented by putting a :class:`Tuple` or :class:`List` within ``targets``.
ast: S'il y a plusieurs nœuds dans *targets*, ils sont tous pris comme des cibles auxquelles est affectée la même expression. Le déballage de séquences est représenté par des nœuds :class:`Tuple` ou :class:`List` comme éléments de *targets*.

source: ``type_comment`` is an optional string with the type annotation as a comment.
ast: Le champ facultatif *type_comment* contient une annotation de type fournie par un commentaire, et ce sous la forme d'une chaîne de caractères.

source: An assignment with a type annotation. ``target`` is a single node and can be a :class:`Name`, a :class:`Attribute` or a :class:`Subscript`. ``annotation`` is the annotation, such as a :class:`Constant` or :class:`Name` node. ``value`` is a single optional node. ``simple`` is a boolean integer set to True for a :class:`Name` node in ``target`` that do not appear in between parenthesis and are hence pure names and not expressions.
ast: Affectation accompagnée d'une annotation de type. La cible *target* est un nœud de type :class:`Name`, :class:`Attribute` ou :class:`Subscript`. *annotation* est le contenu de l'annotation, par exemple un nœud :class:`Constant` ou :class:`Name`. Le champ *value* est facultatif et peut contenir un nœud, la valeur affectée à la cible. *simple* est une valeur booléenne sous forme d'entier, 0 ou 1, qui vaut 1 si et seulement si *target* est de type :class:`Name` et provient d'un nom sans parenthèses, donc un nom simple plutôt qu'une expression.

source: Augmented assignment, such as ``a += 1``. In the following example, ``target`` is a :class:`Name` node for ``x`` (with the :class:`Store` context), ``op`` is :class:`Add`, and ``value`` is a :class:`Constant` with value for 1.
ast: Affectation incrémentale, par exemple ``a += 1``. Dans l'exemple qui suit, *target* est un nœud de type :class:`Name` avec le nom ``'x'`` (de contexte :class:`Store`), *op* est une instance de :class:`Add`, et *value* est un nœud :class:`Constant` contenant la valeur 1.

source: A ``raise`` statement. ``exc`` is the exception object to be raised, normally a :class:`Call` or :class:`Name`, or ``None`` for a standalone ``raise``. ``cause`` is the optional part for ``y`` in ``raise x from y``.
ast: Instruction ``raise``. *exc* est l'exception à lever, la plupart du temps un nœud de type :class:`Call` ou :class:`Name`. Ce champ vaut ``None`` dans le cas d'un ``raise`` sans rien d'autre. Le champ facultatif *cause* correspond à la partie après le ``from`` dans ``raise ... from ...``.

source: An assertion. ``test`` holds the condition, such as a :class:`Compare` node. ``msg`` holds the failure message.
ast: Assertion. *test* est la condition, par exemple un nœud :class:`Compare`. *msg* est le message d'erreur affiché si le test s'évalue comme faux.

source: Represents a ``del`` statement. ``targets`` is a list of nodes, such as :class:`Name`, :class:`Attribute` or :class:`Subscript` nodes.
ast: Instruction ``del``. Les éléments à supprimer sont rassemblés dans la liste *target*. Ce sont généralement des nœuds de type :class:`Name`, :class:`Attribute` ou :class:`Subscript`.
