Repository: python/python-docs-fr
Catalog: library/*.po
Languages: ast

source: Keep in mind that if the node you're operating on has child nodes you must either transform the child nodes yourself or call the :meth:`generic_visit` method for the node first.
ast: Gardez en tête que si un nœud sur lequel vous travaillez a des nœuds enfants, vous devez transformer également ces nœuds enfants vous-même ou appeler d'abord la méthode :meth:`generic_visit` sur le nœud.

source: For nodes that were part of a collection of statements (that applies to all statement nodes), the visitor may also return a list of nodes rather than just a single node.
ast: Pour les nœuds qui font partie d'un groupe (notamment toutes les instructions), le visiteur peut aussi renvoyer une liste des nœuds plutôt qu'un seul nœud.

source: If :class:`NodeTransformer` introduces new nodes (that weren't part of original tree) without giving them location information (such as :attr:`lineno`), :func:`fix_missing_locations` should be called with the new sub-tree to recalculate the location information::
ast: Si :class:`NodeTransformer` ajoute de nouveaux nœuds à l'original sans leur donner les attributs de position dans la source (:attr:`lineno` et consorts), il faut passer le nouvel arbre (ou la nouvelle partie de l'arbre) à :func:`fix_missing_locations` pour calculer les positions manquantes :

source: Usually you use the transformer like this::
ast: Utilisation typique des transformations ::

source: Return a formatted dump of the tree in *node*. This is mainly useful for debugging purposes. If *annotate_fields* is true (by default), the returned string will show the names and the values for fields. If *annotate_fields* is false, the result string will be more compact by omitting unambiguous field names. Attributes such as line numbers and column offsets are not dumped by default. If this is wanted, *include_attributes* can be set to true.
ast: Renvoie une représentation sous forme de chaîne de caractères de l'arbre contenu dans *node*. Ceci est principalement utile à des fins de débogage. Par défaut, les champs sont passés comme paramètres nommés aux constructeurs des classes d'arbre syntaxiques. Cependant, si *annotate_fields* est mis à ``False``, les valeurs sont passées, lorsque cela est possible, comme arguments positionnels, rendant la représentation plus compacte. Les attributs comme les numéros de lignes et positions sur les lignes sont masqués par défaut, mais on peut les inclure en mettant *include_attributes* à ``True``.

source: If *indent* is a non-negative integer or string, then the tree will be pretty-printed with that indent level. An indent level of 0, negative, or ``""`` will only insert newlines. ``None`` (the default) selects the single line representation. Using a positive integer indent indents that many spaces per level. If *indent* is a string (such as ``"\t"``), that string is used to indent each level.
ast: La représentation peut comprendre une indentation afin d'être plus lisible. Si *indent* est une chaîne de caractères (par exemple une tabulation ``"\t"``), elle est insérée au début des lignes en la répétant autant de fois que le niveau d'indentation. Un entier positif équivaut à un certain nombre d'espaces. Un entier strictement négatif produit un effet identique à 0 ou la chaîne vide, c'est-à-dire des retours à la ligne sans indentation. Avec la valeur par défaut de ``None``, la sortie tient sur une seule ligne.

source: Added the *indent* option.
ast: ajout du paramètre *indent*.

source: Compiler Flags
ast: Options du compilateur

source: The following flags may be passed to :func:`compile` in order to change effects on the compilation of a program:
ast: Les options suivantes sont prises en charge par la fonction :func:`compile`. Elles permettent de modifier le comportement de la compilation.

source: Enables support for top-level ``await``, ``async for``, ``async with`` and async comprehensions.
ast: Active la reconnaissance de ``await``, ``async for``, ``async with`` et des compréhensions asynchrones au niveau le plus haut.

source: Generates and returns an abstract syntax tree instead of returning a compiled code object.
ast: Génère et renvoie un arbre syntaxique au lieu d'un objet de code compilé.

source: Enables support for :pep:`484` and :pep:`526` style type comments (``# type: <type>``, ``# type: ignore <stuff>``).
ast: Ajoute la prise en charge des commentaires de types tels que définis dans la :pep:`484` et la :pep:`526` (``# type: un_type`` et ``# type: ignore``).

source: Command-Line Usage
ast: Utilisation en ligne de commande

source: The :mod:`ast` module can be executed as a script from the command line. It is as simple as:
ast: Le module :mod:`ast` peut être exécuté en tant que script en ligne de commande. C'est aussi simple que ceci :

source: The following options are accepted:
ast: Les options suivantes sont acceptées :

source: Show the help message and exit.
ast: Affiche un message d'aide et quitte.

source: Specify what kind of code must be compiled, like the *mode* argument in :func:`parse`.
ast: Précise le type de code à compiler, comme l'argument *mode* de la fonction :func:`parse`.

source: Don't parse type comments.
ast: Désactive la reconnaissance des commentaires de type.

source: Include attributes such as line numbers and column offsets.
ast: Affiche les attributs comme les numéros de lignes et les décalages par rapport aux débuts des lignes.

source: Indentation of nodes in AST (number of spaces).
ast: Nombre d'espaces pour chaque niveau d'indentation dans la sortie.

source: If :file:`infile` is specified its contents are parsed to AST and dumped to stdout. Otherwise, the content is read from stdin.
ast: L'entrée est lue dans le fichier :file:`infile`, s'il est donné, ou l'entrée standard sinon. Le code source est transformé en un arbre syntaxique, qui est affiché sur la sortie standard.

source: `Green Tree Snakes <https://greentreesnakes.readthedocs.io/>`_, an external documentation resource, has good details on working with Python ASTs.
ast: `Green Tree Snakes <https://greentreesnakes.readthedocs.io/>`_, une ressource documentaire externe, qui possède plus de détails pour travailler avec des arbres syntaxiques Python.

source: `ASTTokens <https://asttokens.readthedocs.io/en/latest/user-guide.html>`_ annotates Python ASTs with the positions of tokens and text in the source code that generated them. This is helpful for tools that make source code transformations.
ast: `ASTTokens <https://asttokens.readthedocs.io/en/latest/user-guide.html>`_ annote les arbres syntaxiques Python avec les positions des lexèmes et les extraits de code source à partir desquels ils sont produits. Ceci est utile pour les outils qui transforment du code source.

source: `LibCST <https://libcst.readthedocs.io/>`_ parses code as a Concrete Syntax Tree that looks like an ast tree and keeps all formatting details. It's useful for building automated refactoring (codemod) applications and linters.
ast: `LibCST <https://libcst.readthedocs.io/>`_ produit à partir du code source des arbres syntaxiques concrets, qui ressemblent à leurs homologues abstraits et conservent tous les détails du formatage. Cette bibliothèque est utile aux outils de réusinage et d'analyse de code.

source: `Parso <https://parso.readthedocs.io>`_ is a Python parser that supports error recovery and round-trip parsing for different Python versions (in multiple Python versions). Parso is also able to list multiple syntax errors in your python file.
ast: `Parso <https://parso.readthedocs.io>`_ est un analyseur syntaxique de code Python qui gère la récupération d'erreurs et la génération de code (de l'arbre syntaxique vers le code source), le tout pour les grammaires de différentes versions de Python et en utilisant différentes versions. Il sait également donner plusieurs erreurs de syntaxe en une seule fois.
