Repository: python/python-docs-fr
Catalog: library/*.po
Languages: ast

source: A ``pass`` statement.
ast: Instruction ``pass``.

source: Other statements which are only applicable inside functions or loops are described in other sections.
ast: Il existe d'autres instructions, qui ne peuvent apparaître que dans certains contextes spécifiques comme l'intérieur d'une fonction ou d'une boucle. Elles sont décrites dans d'autres sections de ce document.

source: Imports
ast: Importations

source: An import statement. ``names`` is a list of :class:`alias` nodes.
ast: Instruction ``import``. *names* prend la forme d'une liste de nœuds :class:`alias`.

source: Represents ``from x import y``. ``module`` is a raw string of the 'from' name, without any leading dots, or ``None`` for statements such as ``from . import foo``. ``level`` is an integer holding the level of the relative import (0 means absolute import).
ast: Instruction ``from ... import ...``. La partie après ``from`` est mise dans *module* comme une simple chaîne de caractères. Dans le cas des importations relatives, comme ``from ..module import quelque_chose``, *module* ne contient pas les points au début. Dans les instructions de la forme ``from . import toto``, *module* vaut ``None``. *level* est le niveau d'importation relative sous forme d'entier (0 pour les importations absolues).

source: Both parameters are raw strings of the names. ``asname`` can be ``None`` if the regular name is to be used.
ast: Correspond à ``... as ...`` dans une importation. *name* et *asname* sont de simples chaînes de caractères, qui correspondent aux deux parties de ``... as ...``. Dans les instructions sans ``as`` (où le module n'est pas renommé), *asname* vaut ``None``.

source: Control flow
ast: Contrôle de l'exécution

source: Optional clauses such as ``else`` are stored as an empty list if they're not present.
ast: Si une clause facultative comme ``else`` est absente, le champ correspondant dans l'arbre est une liste vide.

source: An ``if`` statement. ``test`` holds a single node, such as a :class:`Compare` node. ``body`` and ``orelse`` each hold a list of nodes.
ast: Instruction ``if``. La condition, *test*, est un nœud, par exemple une instance de :class:`Compare`. *body* est la liste des instructions du bloc. *orelse* contient les instructions dans le ``else`` (liste vide s'il n'y a pas de ``else``).

source: ``elif`` clauses don't have a special representation in the AST, but rather appear as extra :class:`If` nodes within the ``orelse`` section of the previous one.
ast: Les clauses ``elif`` ne possèdent pas de représentation particulière. Elles sont simplement mises dans le *orelse* du ``if`` ou ``elif`` précédent, comme nœuds de type :class:`If`.

source: A ``for`` loop. ``target`` holds the variable(s) the loop assigns to, as a single :class:`Name`, :class:`Tuple` or :class:`List` node. ``iter`` holds the item to be looped over, again as a single node. ``body`` and ``orelse`` contain lists of nodes to execute. Those in ``orelse`` are executed if the loop finishes normally, rather than via a ``break`` statement.
ast: Boucle ``for``. Elle porte sur l'itérable donné par le nœud *iter*. La cible des affectations successives est *target*, qui est un nœud de type :class:`Name`, :class:`Tuple` ou :class:`List`. Les instructions du bloc ``for`` forment la liste *body*. Celles de la liste *orelse* proviennent d'une éventuelle clause ``else`` et sont exécutées si la boucle se termine par épuisement de l'itérable, et non pas par un ``break``.

source: A ``while`` loop. ``test`` holds the condition, such as a :class:`Compare` node.
ast: Boucle ``while``. *test* est la condition évaluée à chaque itération, par exemple un nœud :class:`Compare`. *body* contient les instructions du bloc, et *orelse* celles d'un éventuel bloc ``else``, exécuté lorsque la boucle termine parce que la condition devient fausse et non pas à cause d'une instruction ``break``.

source: The ``break`` and ``continue`` statements.
ast: Instructions ``break`` et ``continue``.

source: ``try`` blocks. All attributes are list of nodes to execute, except for ``handlers``, which is a list of :class:`ExceptHandler` nodes.
ast: Bloc ``try``. Les nœuds de la liste *body* sont les instructions à exécuter sous contrôle des exceptions. La liste *handlers* contient des nœuds :class:`ExceptHandler`, un par ``except``. Les listes *orelse* et *finalbody* contiennent respectivement les instructions se trouvant dans d'éventuels blocs ``else`` et ``finally``.

source: A single ``except`` clause. ``type`` is the exception type it will match, typically a :class:`Name` node (or ``None`` for a catch-all ``except:`` clause). ``name`` is a raw string for the name to hold the exception, or ``None`` if the clause doesn't have ``as foo``. ``body`` is a list of nodes.
ast: Une clause ``except``. Elle intercepte les exceptions de types donnés par *type*, qui est le plus souvent un nœud :class:`Name` ou bien ``None`` (cette dernière valeur pour les clauses fourre-tout ``except:``). Le nom éventuel de la variable à laquelle affecter l'exception est dans la chaîne de caractères *name* (``None`` s'il n'y a pas de ``as``). Les instructions sous le ``except`` sont dans la liste *body*.

source: A ``with`` block. ``items`` is a list of :class:`withitem` nodes representing the context managers, and ``body`` is the indented block inside the context.
ast: Bloc ``with``. Les gestionnaires de contexte sont stockés dans *items* comme instances de :class:`withitem`. Les instructions sous le ``with`` forment la liste *body*.

source: A single context manager in a ``with`` block. ``context_expr`` is the context manager, often a :class:`Call` node. ``optional_vars`` is a :class:`Name`, :class:`Tuple` or :class:`List` for the ``as foo`` part, or ``None`` if that isn't used.
ast: Gestionnaire de contexte dans un bloc ``with``. Le gestionnaire est donné par le nœud *context_expr*, souvent une instance de :class:`Call`. S'il y a affectation avec ``as``, *optional_vars* contient sa cible, qui est un nœud de type :class:`Name`, :class:`Tuple` ou :class:`List`. Sinon, *optional_vars* vaut ``None``.

source: Function and class definitions
ast: Définition de fonctions et de classes

source: A function definition.
ast: Définition d'une fonction.

source: ``name`` is a raw string of the function name.
ast: *name* donne le nom de la fonction sous forme d'une chaîne de caractères.

source: ``body`` is the list of nodes inside the function.
ast: *body* est la liste des instructions dans le corps de la fonction.

source: ``decorator_list`` is the list of decorators to be applied, stored outermost first (i.e. the first in the list will be applied last).
ast: *decorators_list* est une liste de décorateurs appliqués à la fonction. Ils sont rangés dans leur ordre d'apparition, c'est-à-dire que le premier de la liste est appliqué en dernier.

source: ``returns`` is the return annotation.
ast: *returns* est l'annotation de renvoi éventuelle.

source: ``lambda`` is a minimal function definition that can be used inside an expression. Unlike :class:`FunctionDef`, ``body`` holds a single node.
ast: Fonction anonyme. Elle est créée avec le mot-clé ``lambda``, limitée à renvoyer une simple expression, et peut être intégrée à une expression plus large. Contrairement à :class:`FunctionDef`, *body* est ici un nœud unique. *args* est une instance de ``arguments`` qui contient les arguments de la signature.

source: The arguments for a function.
ast: Arguments d'une fonction.

source: ``posonlyargs``, ``args`` and ``kwonlyargs`` are lists of :class:`arg` nodes.
ast: *posonlyargs*, *args* et *kwonlyargs* sont des listes de nœuds :class:`arg` qui correspondent respectivement aux arguments obligatoirement positionnels, positionnels ou nommés et obligatoirement nommés.

source: ``vararg`` and ``kwarg`` are single :class:`arg` nodes, referring to the ``*args, **kwargs`` parameters.
ast: *varargs* et *kwargs* sont des nœuds :class:`arg` qui apparaissent avec la capture des arguments restants, positionnels (``*arguments_positionnels``) et nommés (``**arguments_nommés``).

source: ``kw_defaults`` is a list of default values for keyword-only arguments. If one is ``None``, the corresponding argument is required.
ast: *kw_defaults* est la liste des valeurs par défaut pour les arguments obligatoirement nommés. Si l'un des éléments n'est pas un nœud mais ``None``, il n'y a pas de valeur par défaut et l'argument correspondant doit être passé obligatoirement à la fonction.

source: ``defaults`` is a list of default values for arguments that can be passed positionally. If there are fewer defaults, they correspond to the last n arguments.
ast: *defaults* est, quant à elle, la liste des valeurs par défauts pour les arguments qui peuvent être passés de manière positionnelle (obligatoirement ou non). S'il y a moins d'éléments dans la liste que d'arguments positionnels, ces éléments donnent les valeurs par défaut des *n* derniers arguments positionnels (avec *n* la longueur de *defaults*).

source: ``type_comment`` is an optional string with the type annotation as a comment
ast: Le champ facultatif *type_comment* est, sous forme de chaîne, une annotation de type fournie par un commentaire.

source: A ``return`` statement.
ast: Instruction ``return``, qui renvoie *value*.

source: A ``yield`` or ``yield from`` expression. Because these are expressions, they must be wrapped in a :class:`Expr` node if the value sent back is not used.
ast: Expression ``yield`` ou ``yield from``. Ce sont bien des expressions, non pas des instructions. Il faut donc les placer dans un nœud :class:`Expr` si la valeur qu'elles renvoient n'est pas utilisée dans une expression plus large.

source: ``global`` and ``nonlocal`` statements. ``names`` is a list of raw strings.
ast: Instruction ``global`` ou ``nonlocal``. Elle s'applique aux noms de variables donnés dans *names*, une liste de chaînes de caractères.

source: A class definition.
ast: Définition d'une classe.

source: ``name`` is a raw string for the class name
ast: *name* est le nom de la classe sous forme de chaîne de caractères ;

source: ``bases`` is a list of nodes for explicitly specified base classes.
ast: *bases* est la liste des classes mères données explicitement ;

source: ``body`` is a list of nodes representing the code within the class definition.
ast: *body* est la liste des instructions contenues dans la définition de classe ;

source: ``decorator_list`` is a list of nodes, as in :class:`FunctionDef`.
ast: *decorators_list* est une liste de nœuds, comme pour :class:`FunctionDef`.

source: Async and await
ast: ``async`` et ``await``

source: An ``async def`` function definition. Has the same fields as :class:`FunctionDef`.
ast: Fonction déclarée avec ``async def``. Les champs sont les mêmes que dans :class:`FunctionDef`.

source: An ``await`` expression. ``value`` is what it waits for. Only valid in the body of an :class:`AsyncFunctionDef`.
ast: Expression ``await``, qui attend *value*. Ces nœuds ne peuvent apparaître qu'à l'intérieur de :class:`AsyncFunctionDef`.

source: ``async for`` loops and ``async with`` context managers. They have the same fields as :class:`For` and :class:`With`, respectively. Only valid in the body of an :class:`AsyncFunctionDef`.
ast: Instruction ``async for`` ou ``async with``. Les champs sont les mêmes que ceux de :class:`For` et :class:`With`. Ces nœuds ne peuvent apparaître qu'à l'intérieur de :class:`AsyncFunctionDef`.

source: When a string is parsed by :func:`ast.parse`, operator nodes (subclasses of :class:`ast.operator`, :class:`ast.unaryop`, :class:`ast.cmpop`, :class:`ast.boolop` and :class:`ast.expr_context`) on the returned tree will be singletons. Changes to one will be reflected in all other occurrences of the same value (e.g. :class:`ast.Add`).
ast: Lorsqu'une chaîne contenant du code est transformée en arbre syntaxique par :func:`ast.parse`, les nœuds représentants les opérateurs (classes filles de :class:`ast.operator`, :class:`ast.unaryop`, :class:`ast.cmpop`, :class:`ast.boolop` et :class:`ast.expr_context`) sont des singletons à l'intérieur de l'arbre renvoyé. Si l'un, par exemple une instance de :class:`ast.Add`, est muté, la modification sera visible sur toutes les autres apparitions de l'opérateur.

source: :mod:`ast` Helpers
ast: Outils du module :mod:`ast`

source: Apart from the node classes, the :mod:`ast` module defines these utility functions and classes for traversing abstract syntax trees:
ast: À part les classes de nœuds, le module :mod:`ast` définit plusieurs fonctions et classes utilitaires pour traverser les arbres syntaxiques abstraits.

source: Parse the source into an AST node. Equivalent to ``compile(source, filename, mode, ast.PyCF_ONLY_AST)``.
ast: Analyse le code source et renvoie un arbre syntaxique. Équivalent à ``compile(source, filename, mode, ast.PyCF_ONLY_AST)``.

source: If ``type_comments=True`` is given, the parser is modified to check and return type comments as specified by :pep:`484` and :pep:`526`. This is equivalent to adding :data:`ast.PyCF_TYPE_COMMENTS` to the flags passed to :func:`compile()`. This will report syntax errors for misplaced type comments. Without this flag, type comments will be ignored, and the ``type_comment`` field on selected AST nodes will always be ``None``. In addition, the locations of ``# type: ignore`` comments will be returned as the ``type_ignores`` attribute of :class:`Module` (otherwise it is always an empty list).
ast: Si *type_comments* est mis à ``True``, l'analyseur syntaxique reconnaît les commentaires de type et les ajoute à l'arbre, comme décrit dans la :pep:`484` et la :pep:`526`. Ceci revient à ajouter :data:`ast.PyCF_TYPE_COMMENTS` à l'argument *flags* de :func:`compile`. Une erreur de syntaxe est levée si un commentaire de type est placé au mauvais endroit. Les commentaires ``# type: ignore`` sont également détectés et leurs positions dans la source sont placées dans l'attribut *type_ignores* du nœud :class:`Module`. Sans cette option, les commentaires de type sont ignorés tout comme les commentaires ordinaires, et l'attribut *type_comment* des nœuds dont le type possède ce champ sera toujours mis à ``None``.

source: Also, setting ``feature_version`` to a tuple ``(major, minor)`` will attempt to parse using that Python version's grammar. Currently ``major`` must equal to ``3``. For example, setting ``feature_version=(3, 4)`` will allow the use of ``async`` and ``await`` as variable names. The lowest supported version is ``(3, 4)``; the highest is ``sys.version_info[0:2]``.
ast: Si *feature_version* est défini à une version de Python, sous la forme d'un couple ``(version_majeure, version_mineure)``, l'analyseur tentera de lire la source en se conformant à la syntaxe de cette version. Ainsi, avec ``feature_version=(3, 4)``, les noms ``async`` et ``await`` peuvent nommer des variables. La version la plus ancienne prise en charge est actuellement ``(3, 4)`` ; la plus récente est ``sys.version_info[0:2]``.

source: It is possible to crash the Python interpreter with a sufficiently large/complex string due to stack depth limitations in Python's AST compiler.
ast: Il est possible de faire planter l'interpréteur Python avec des chaînes suffisamment grandes ou complexes lors de la compilation d'un arbre syntaxique en raison de la limitation de la profondeur de la pile d'appels.

source: Added ``type_comments``, ``mode='func_type'`` and ``feature_version``.
ast: ajout des paramètres *type_comments* et *feature_version* ainsi que de la valeur ``'func_type'`` pour *mode*.

source: Unparse an :class:`ast.AST` object and generate a string with code that would produce an equivalent :class:`ast.AST` object if parsed back with :func:`ast.parse`.
ast: À partir d'un arbre syntaxique :class:`ast.AST`, reconstruit un code sous forme de chaîne de caractères. S'il est passé à :func:`ast.parse`, le résultat produit un arbre :class:`ast.AST` équivalent à l'original.

source: Trying to unparse a highly complex expression would result with :exc:`RecursionError`.
ast: Une :exc:`RecursionError` est levée si l'expression comporte de très nombreux niveaux d'imbrication.

source: Now allows bytes and set literals.
ast: accepte maintenant les octets et ensembles littéraux.

source: Now supports creating empty sets with ``'set()'``.
ast: accepte ``set()`` pour les ensembles vides.

source: Return the docstring of the given *node* (which must be a :class:`FunctionDef`, :class:`AsyncFunctionDef`, :class:`ClassDef`, or :class:`Module` node), or ``None`` if it has no docstring. If *clean* is true, clean up the docstring's indentation with :func:`inspect.cleandoc`.
ast: Renvoie la *docstring* du nœud *node* (de type :class:`FunctionDef`, :class:`AsyncFunctionDef`, :class:`ClassDef` or :class:`Module`), ou ``None`` s'il n'a pas de *docstring*. Si *clean* est vrai, cette fonction nettoie l'indentation de la *docstring* avec :func:`inspect.cleandoc`.

source: :class:`AsyncFunctionDef` is now supported.
ast: :class:`AsyncFunctionDef` est maintenant gérée.

source: Get source code segment of the *source* that generated *node*. If some location information (:attr:`lineno`, :attr:`end_lineno`, :attr:`col_offset`, or :attr:`end_col_offset`) is missing, return ``None``.
ast: Donne la partie de *source* (le code source) qui a donné lieu à *node*. Si l'un des attributs de localisation du nœud (:attr:`lineno`, :attr:`end_lineno`, :attr:`col_offset` et :attr:`end_col_offset`) n'est pas rempli, cette fonction renvoie ``None``.

source: When you compile a node tree with :func:`compile`, the compiler expects :attr:`lineno` and :attr:`col_offset` attributes for every node that supports them. This is rather tedious to fill in for generated nodes, so this helper adds these attributes recursively where not already set, by setting them to the values of the parent node. It works recursively starting at *node*.
ast: Lorsque l'on compile un arbre avec :func:`compile`, le compilateur attend les attributs :attr:`lineno` et :attr:`col_offset` pour tous les nœuds qui les prennent en charge. Il est fastidieux de les remplir pour les nœuds générés par du code. Cette fonction utilitaire ajoute ces attributs de manière récursive là où ils ne sont pas déjà définis, en les définissant comme les valeurs du nœud parent. Elle fonctionne récursivement en démarrant de *node*.

source: Increment the line number and end line number of each node in the tree starting at *node* by *n*. This is useful to "move code" to a different location in a file.
ast: Incrémente de *n* les numéros des lignes de début et ligne de fin de chaque nœud dans l'arbre, en commençant par le nœud *node*. C'est utile pour « déplacer du code » à un endroit différent dans un fichier.

source: Copy source location (:attr:`lineno`, :attr:`col_offset`, :attr:`end_lineno`, and :attr:`end_col_offset`) from *old_node* to *new_node* if possible, and return *new_node*.
ast: Copie la position dans la source (attributs :attr:`lineno`, :attr:`col_offset`, :attr:`end_lineno` et :attr:`end_col_offset`) de l'ancien nœud *old_node* vers le nouveau nœud *new_node*, si possible, et renvoie *new_node*.

source: Yield a tuple of ``(fieldname, value)`` for each field in ``node._fields`` that is present on *node*.
ast: Produit un *n*-uplet de couples ``(nom_du_champ, valeur)`` pour chaque champ de ``node._fields`` qui est présent dans *node*.

source: Yield all direct child nodes of *node*, that is, all fields that are nodes and all items of fields that are lists of nodes.
ast: Produit tous les nœuds enfants directs de *node*, c'est-à-dire tous les champs qui sont des nœuds et tous les éléments des champs qui sont des listes de nœuds.

source: Recursively yield all descendant nodes in the tree starting at *node* (including *node* itself), in no specified order. This is useful if you only want to modify nodes in place and don't care about the context.
ast: Produit récursivement tous les nœuds enfants dans l'arbre en commençant par *node* (*node* lui-même est inclus), sans ordre spécifique. C'est utile lorsque l'on souhaite modifier les nœuds sur place sans prêter attention au contexte.

source: A node visitor base class that walks the abstract syntax tree and calls a visitor function for every node found. This function may return a value which is forwarded by the :meth:`visit` method.
ast: Classe de base pour un visiteur de nœud, qui parcourt l'arbre syntaxique abstrait et appelle une fonction de visite pour chacun des nœuds trouvés. Cette fonction peut renvoyer une valeur, qui est transmise par la méthode :meth:`visit`.

source: This class is meant to be subclassed, with the subclass adding visitor methods.
ast: Cette classe est faite pour être dérivée, en ajoutant des méthodes de visite à la sous-classe.

source: Visit a node. The default implementation calls the method called :samp:`self.visit_{classname}` where *classname* is the name of the node class, or :meth:`generic_visit` if that method doesn't exist.
ast: Visite un nœud. L'implémentation par défaut appelle la méthode :samp:`self.visit_{classe}` où *classe* représente le nom de la classe du nœud, ou :meth:`generic_visit` si cette méthode n'existe pas.

source: This visitor calls :meth:`visit` on all children of the node.
ast: Le visiteur appelle la méthode :meth:`visit` de tous les enfants du nœud.

source: Note that child nodes of nodes that have a custom visitor method won't be visited unless the visitor calls :meth:`generic_visit` or visits them itself.
ast: Notons que les nœuds enfants qui possèdent une méthode de visite spéciale ne sont pas visités à moins que le visiteur n'appelle la méthode :meth:`generic_visit` ou ne les visite lui-même.

source: Don't use the :class:`NodeVisitor` if you want to apply changes to nodes during traversal. For this a special visitor exists (:class:`NodeTransformer`) that allows modifications.
ast: N'utilisez pas :class:`NodeVisitor` si vous souhaitez appliquer des changements sur les nœuds lors du parcours. Pour cela, un visiteur spécial existe (:class:`NodeTransformer`) qui permet les modifications.

source: Methods :meth:`visit_Num`, :meth:`visit_Str`, :meth:`visit_Bytes`, :meth:`visit_NameConstant` and :meth:`visit_Ellipsis` are deprecated now and will not be called in future Python versions. Add the :meth:`visit_Constant` method to handle all constant nodes.
ast: les méthodes :meth:`visit_Num`, :meth:`visit_Str`, :meth:`visit_Bytes`, :meth:`visit_NameConstant` et :meth:`visit_Ellipsis` sont devenues obsolètes et cesseront d'être appelées dans une version ultérieure de Python. Écrivez une méthode :meth:`visit_Constant` pour traiter tous les nœuds qui représentent des valeurs constantes.

source: A :class:`NodeVisitor` subclass that walks the abstract syntax tree and allows modification of nodes.
ast: Une sous-classe de :class:`NodeVisitor` qui traverse l'arbre syntaxique abstrait et permet de modifier les nœuds.

source: The :class:`NodeTransformer` will walk the AST and use the return value of the visitor methods to replace or remove the old node. If the return value of the visitor method is ``None``, the node will be removed from its location, otherwise it is replaced with the return value. The return value may be the original node in which case no replacement takes place.
ast: Le :class:`NodeTransformer` traverse l'arbre syntaxique et utilise la valeur renvoyée par les méthodes du visiteur pour remplacer ou supprimer l'ancien nœud. Si la valeur renvoyée par la méthode du visiteur est ``None``, le nœud est supprimé de sa position, sinon il est remplacé par cette valeur. Elle peut être le nœud original, auquel cas il n'y a pas de remplacement.

source: Here is an example transformer that rewrites all occurrences of name lookups (``foo``) to ``data['foo']``::
ast: Voici un exemple de transformation qui réécrit tous les accès à la valeur d'une variable ``toto`` en ``data['toto']`` ::
