Repository: python/python-docs-fr
Catalog: library/argparse.po
Languages: fr

source: conflict_handler
fr: Le paramètre *conflict_handler*

source: :class:`ArgumentParser` objects do not allow two actions with the same option string. By default, :class:`ArgumentParser` objects raise an exception if an attempt is made to create an argument with an option string that is already in use::
fr: Les objets :class:`ArgumentParser` ne peuvent pas avoir plus d'une option avec la même chaîne d'option. Par défaut, les objets :class:`ArgumentParser` lèvent une exception si on essaie de créer un argument avec une chaîne d'option qui est déjà utilisée ::

source: Sometimes (e.g. when using parents_) it may be useful to simply override any older arguments with the same option string. To get this behavior, the value ``'resolve'`` can be supplied to the ``conflict_handler=`` argument of :class:`ArgumentParser`::
fr: Parfois, par exemple si on utilise des analyseurs parents_, il est souhaitable de surcharger les anciens arguments qui partagent la même chaîne d'option. Pour obtenir ce comportement, vous devez passer ``'resolve'`` à l'argument ``conflict_handler=`` du constructeur d':class:`ArgumentParser` ::

source: Note that :class:`ArgumentParser` objects only remove an action if all of its option strings are overridden. So, in the example above, the old ``-f/--foo`` action is retained as the ``-f`` action, because only the ``--foo`` option string was overridden.
fr: Prenez note que les objets :class:`ArgumentParser` n'enlèvent une action que si toutes ses chaînes d'options sont surchargées. Ainsi dans l'exemple ci-dessus, l'action ``-f/--foo`` du parent est conservée comme l'action ``-f`` puisque ``--foo`` est la seule chaîne d'options qui a été surchargée.

source: add_help
fr: Le paramètre *add_help*

source: By default, ArgumentParser objects add an option which simply displays the parser's help message. For example, consider a file named ``myprogram.py`` containing the following code::
fr: Par défaut, les objets ``ArgumentParser`` ajoutent une option qui offre l'affichage du message d'aide de l'analyseur. Par exemple, prenons le fichier ``myprogram.py`` qui contient le code suivant ::

source: If ``-h`` or ``--help`` is supplied at the command line, the ArgumentParser help will be printed:
fr: Si ``-h`` ou ``--help`` est passé sur la ligne de commande, le message d'aide de l'``ArgumentParser`` sera affiché :

source: Occasionally, it may be useful to disable the addition of this help option. This can be achieved by passing ``False`` as the ``add_help=`` argument to :class:`ArgumentParser`::
fr: Il est parfois utile de désactiver l'ajout de cette option d'aide. Pour ce faire, vous devez passer ``False`` à l'argument ``add_help=`` du constructeur d':class:`ArgumentParser` ::

source: The help option is typically ``-h/--help``. The exception to this is if the ``prefix_chars=`` is specified and does not include ``-``, in which case ``-h`` and ``--help`` are not valid options. In this case, the first character in ``prefix_chars`` is used to prefix the help options::
fr: En général, l'option d'aide est ``-h/--help``. L'exception à cette règle est quand une valeur est passée à ``prefix_chars=`` et qu'elle n'inclue pas ``-``, auquel cas, ``-h`` et ``--help`` ne sont pas des options valides. Dans ce cas, le premier caractère de ``prefix_chars`` est utilisé comme préfixe des options d'aide ::

source: exit_on_error
fr: Le paramètre *exit_on_error*

source: Normally, when you pass an invalid argument list to the :meth:`~ArgumentParser.parse_args` method of an :class:`ArgumentParser`, it will exit with error info.
fr: En général, quand vous passez une liste d'arguments dont au moins un est invalide à la méthode :meth:`~ArgumentParser.parse_args` d'une instance d':class:`ArgumentParser`, l'exécution se termine avec un message d'erreur.

source: If the user would like to catch errors manually, the feature can be enabled by setting ``exit_on_error`` to ``False``::
fr: Si vous souhaitez intercepter les erreurs manuellement, la fonctionnalité peut être activée en assignant ``False`` à ``exit_on_error`` ::

source: The add_argument() method
fr: La méthode *add_argument()*

source: Define how a single command-line argument should be parsed. Each parameter has its own more detailed description below, but in short they are:
fr: Définie comment une option de ligne de commande doit être analysée. Chacun des paramètres est décrit plus en détails ci-bas, mais en résumé ils sont :

source: `name or flags`_ - Either a name or a list of option strings, e.g. ``foo`` or ``-f, --foo``.
fr: `name_or_flags`_ – Nom ou liste de chaînes d'options. Par exemple : ``foo`` ou ``-f, --foo`` ;

source: action_ - The basic type of action to be taken when this argument is encountered at the command line.
fr: action_ – Type élémentaire de l'action à entreprendre quand cet argument est reconnu sur la ligne de commande ;

source: nargs_ - The number of command-line arguments that should be consumed.
fr: nargs_ – Nombre d'arguments de la ligne de commande à capturer ;

source: const_ - A constant value required by some action_ and nargs_ selections.
fr: const_ – Valeur constante requise par certains choix d'action_ et de nargs_ ;

source: default_ - The value produced if the argument is absent from the command line and if it is absent from the namespace object.
fr: default_ – Valeur produite si l'argument est absent de la ligne de commande et absent de l'objet ``namespace`` ;

source: type_ - The type to which the command-line argument should be converted.
fr: type_ – Type vers lequel l'argument sur la ligne de commande doit être converti ;

source: choices_ - A sequence of the allowable values for the argument.
fr: choices_ – La séquence de valeurs autorisées pour cet argument ;

source: required_ - Whether or not the command-line option may be omitted (optionals only).
fr: required_ – ``True`` si l'option sur la ligne de commande est obligatoire (ne s'applique qu'aux arguments optionnels) ;

source: help_ - A brief description of what the argument does.
fr: help_ – Brève description de ce que fait l'argument ;

source: metavar_ - A name for the argument in usage messages.
fr: metavar_ – Nom de l'argument dans les messages d'utilisations ;

source: dest_ - The name of the attribute to be added to the object returned by :meth:`parse_args`.
fr: dest_ – Nom de l'attribut qui sera ajouté à l'objet retourné par :meth:`parse_args`.

source: name or flags
fr: Le paramètre *name_or_flags*

source: The :meth:`~ArgumentParser.add_argument` method must know whether an optional argument, like ``-f`` or ``--foo``, or a positional argument, like a list of filenames, is expected. The first arguments passed to :meth:`~ArgumentParser.add_argument` must therefore be either a series of flags, or a simple argument name. For example, an optional argument could be created like::
fr: La méthode :meth:`~ArgumentParser.add_argument` doit savoir si c'est un argument optionnel (tel que ``-f`` ou ``--foo``) ou plutôt un argument positionnel (tel qu'une liste de noms de fichiers) qui est attendu. Le premier argument passé à :meth:`~ArgumentParser.add_argument` doit donc être soit une série de noms d'options tels qu'ils apparaissent sur la ligne de commande, soit simplement un nom si on désire un argument positionnel. Par exemple, un argument optionnel est créé comme suit ::

source: while a positional argument could be created like::
fr: alors qu'un argument positionnel est créé comme suit ::

source: When :meth:`~ArgumentParser.parse_args` is called, optional arguments will be identified by the ``-`` prefix, and the remaining arguments will be assumed to be positional::
fr: Lors le l'appel de :meth:`~ArgumentParser.parse_args`, les arguments qui commencent par le préfixe ``-`` sont présumés optionnels et tous les autres sont présumés positionnels ::

source: action
fr: Le paramètre *action*

source: :class:`ArgumentParser` objects associate command-line arguments with actions. These actions can do just about anything with the command-line arguments associated with them, though most actions simply add an attribute to the object returned by :meth:`~ArgumentParser.parse_args`. The ``action`` keyword argument specifies how the command-line arguments should be handled. The supplied actions are:
fr: Les objets :class:`ArgumentParser` associent les arguments de la ligne de commande avec des actions. Ces actions peuvent soumettre les arguments de la ligne de commande auxquels elles sont associées à un traitement arbitraire, mais la majorité des actions se contentent d'ajouter un attribut à l'objet renvoyé par :meth:`~ArgumentParser.parse_args`. L'argument nommé ``action`` indique comment l'argument de la ligne de commande sera traité. Les actions natives sont :

source: ``'store'`` - This just stores the argument's value. This is the default action. For example::
fr: ``'store'`` – Stocke la valeur de l'argument sans autre traitement. Ceci est l'action par défaut. Par exemple ::

source: ``'store_const'`` - This stores the value specified by the const_ keyword argument. The ``'store_const'`` action is most commonly used with optional arguments that specify some sort of flag. For example::
fr: ``'store_const'`` – Stocke la valeur passée à l'argument nommé const_. L'action ``'store_const'`` est typiquement utilisée avec des arguments optionnels qui représentent un drapeau ou une condition similaire. Par exemple ::

source: ``'store_true'`` and ``'store_false'`` - These are special cases of ``'store_const'`` used for storing the values ``True`` and ``False`` respectively. In addition, they create default values of ``False`` and ``True`` respectively. For example::
fr: ``'store_true'`` et ``'store_false'`` – Ces actions sont des cas particuliers de ``'store_const'`` pour lesquelles la valeur stockée est ``True`` et ``False``, respectivement. Aussi, ces actions ont comme valeur par défaut ``False`` et ``True``, respectivement. Par exemple ::

source: ``'append'`` - This stores a list, and appends each argument value to the list. This is useful to allow an option to be specified multiple times. Example usage::
fr: ``'append'`` – Stocke une liste et ajoute la valeur de l'argument à la liste. Ceci est pratique pour les options qui peuvent être répétées sur la ligne de commande ::

source: ``'append_const'`` - This stores a list, and appends the value specified by the const_ keyword argument to the list. (Note that the const_ keyword argument defaults to ``None``.) The ``'append_const'`` action is typically useful when multiple arguments need to store constants to the same list. For example::
fr: ``'append_const'`` – Stocke une liste et ajoute la valeur passée à l'argument nommé const_ à la fin de la liste. Notez que la valeur par défaut de l'argument nommé const_ est ``None``. L'action ``'append_const'`` est pratique quand plusieurs arguments ont besoin de stocker des constantes dans la même liste. Par exemple ::

source: ``'count'`` - This counts the number of times a keyword argument occurs. For example, this is useful for increasing verbosity levels::
fr: ``'count'`` – Compte le nombre d'occurrences de l'argument nommé. Ceci est pratique, par exemple, pour augmenter le niveau de verbosité ::

source: Note, the *default* will be ``None`` unless explicitly set to *0*.
fr: Prenez note que la valeur de *default* sera ``None`` à moins qu'elle soit explicitement définie à ``0``.

source: ``'help'`` - This prints a complete help message for all the options in the current parser and then exits. By default a help action is automatically added to the parser. See :class:`ArgumentParser` for details of how the output is created.
fr: ``'help'`` – Affiche le message d'aide complet pour toutes les options de l'analyseur puis termine l'exécution. Une action ``help`` est automatiquement ajoutée à l'analyseur par défaut. Consultez :class:`ArgumentParser` pour les détails de la création du contenu de l'aide.

source: ``'version'`` - This expects a ``version=`` keyword argument in the :meth:`~ArgumentParser.add_argument` call, and prints version information and exits when invoked::
fr: ``'version'`` – Affiche la version du programme puis termine l'exécution. Cette action requiert l'argument nommé ``version=`` dans l'appel à :meth:`~ArgumentParser.add_argument` ::

source: ``'extend'`` - This stores a list, and extends each argument value to the list. Example usage::
fr: ``'extend'`` – Stock une liste et ajoute à la liste chacune des valeurs de l'argument reçues. Voici un exemple de son utilisation ::

source: You may also specify an arbitrary action by passing an Action subclass or other object that implements the same interface. The ``BooleanOptionalAction`` is available in ``argparse`` and adds support for boolean actions such as ``--foo`` and ``--no-foo``::
fr: Vous pouvez aussi spécifier une action arbitraire en passant une sous-classe d'``Action`` ou un objet qui implémente la même interface. La classe ``BooleanOptionalAction`` est disponible dans ``argparse`` et elle ajoute la gestion des options booléennes telles que ``--foo`` et ``--no-foo`` ::

source: The recommended way to create a custom action is to extend :class:`Action`, overriding the ``__call__`` method and optionally the ``__init__`` and ``format_usage`` methods.
fr: La façon recommandée pour créer une action personnalisée est d'hériter d':class:`Action` en surchargeant la méthode ``__call__``. Vous avez également l'option de surcharger les méthodes ``__init__`` et ``format_usage``.

source: An example of a custom action::
fr: Un exemple d'action personnalisée ::

source: For more details, see :class:`Action`.
fr: Pour plus d'information, voir :class:`Action`.

source: nargs
fr: Le paramètre *nargs*

source: ArgumentParser objects usually associate a single command-line argument with a single action to be taken. The ``nargs`` keyword argument associates a different number of command-line arguments with a single action. The supported values are:
fr: En général, les objets ``ArgumentParser`` associent un seul argument de la ligne de commande à une seule action à entreprendre. L'argument nommé ``nargs`` associe un nombre différent d'arguments de la ligne de commande à une action. Les valeurs reconnues sont :

source: ``N`` (an integer). ``N`` arguments from the command line will be gathered together into a list. For example::
fr: ``N`` (un entier). ``N`` arguments de la ligne de commande seront capturés ensemble et stockés dans une liste. Par exemple ::

source: Note that ``nargs=1`` produces a list of one item. This is different from the default, in which the item is produced by itself.
fr: Prenez note que ``nargs=1`` produit une liste avec un seul élément. Ceci est différent du comportement par défaut qui produit l'élément directement (comme un scalaire).

source: ``'?'``. One argument will be consumed from the command line if possible, and produced as a single item. If no command-line argument is present, the value from default_ will be produced. Note that for optional arguments, there is an additional case - the option string is present but not followed by a command-line argument. In this case the value from const_ will be produced. Some examples to illustrate this::
fr: ``'?'``. Un argument sera capturé de la ligne de commande et produit directement. Si aucun argument n'est présent sur la ligne de commande, la valeur de default_ est produite. Prenez note que pour les arguments optionnels, il est aussi possible que la chaîne d'option soit présente mais qu'elle ne soit pas suivie d'un argument. Dans ce cas, la valeur de const_ est produite. Voici quelques exemples pour illustrer ceci ::

source: One of the more common uses of ``nargs='?'`` is to allow optional input and output files::
fr: ``nargs='?'`` est fréquemment utilisé pour accepter des fichiers d'entrée et de sortie optionnels ::

source: ``'*'``. All command-line arguments present are gathered into a list. Note that it generally doesn't make much sense to have more than one positional argument with ``nargs='*'``, but multiple optional arguments with ``nargs='*'`` is possible. For example::
fr: ``'*'``. Tous les arguments présents sur la ligne de commande sont capturés dans une liste. Prenez note qu'il n'est pas logique d'avoir plus d'un argument positionnel avec ``nargs='*'``, mais il est par contre possible d'avoir plusieurs arguments optionnels qui spécifient ``nargs='*'``. Par exemple ::

source: ``'+'``. Just like ``'*'``, all command-line args present are gathered into a list. Additionally, an error message will be generated if there wasn't at least one command-line argument present. For example::
fr: ``'+'``. Comme pour ``'*'``, tous les arguments présents sur la ligne de commande sont capturés dans une liste. De plus, un message d'erreur est produit s'il n'y a pas au moins un argument présent sur la ligne de commande. Par exemple ::

source: If the ``nargs`` keyword argument is not provided, the number of arguments consumed is determined by the action_. Generally this means a single command-line argument will be consumed and a single item (not a list) will be produced.
fr: Si l'argument nommé ``nargs`` n'est pas fourni, le nombre d'arguments capturés est déterminé par l'action_. En général, c'est un seul argument de la ligne de commande qui est capturé et il est produit directement.

source: const
fr: Le paramètre *const*

source: The ``const`` argument of :meth:`~ArgumentParser.add_argument` is used to hold constant values that are not read from the command line but are required for the various :class:`ArgumentParser` actions. The two most common uses of it are:
fr: L'argument ``const`` d':meth:`~ArgumentParser.add_argument` est utilisé pour stocker une constante qui n'est pas lue depuis la ligne de commande mais qui est requise par certaines actions d':class:`ArgumentParser`. Les deux utilisations les plus communes sont :

source: When :meth:`~ArgumentParser.add_argument` is called with ``action='store_const'`` or ``action='append_const'``. These actions add the ``const`` value to one of the attributes of the object returned by :meth:`~ArgumentParser.parse_args`. See the action_ description for examples.
fr: quand :meth:`~ArgumentParser.add_argument` est appelée avec ``action='store_const'`` ou ``action='append_const'``. Ces actions ajoutent la valeur de ``const`` à l'un des attributs de l'objet renvoyé par :meth:`~ArgumentParser.parse_args`. Consultez la description d'action_ pour voir quelques exemples ;

source: When :meth:`~ArgumentParser.add_argument` is called with option strings (like ``-f`` or ``--foo``) and ``nargs='?'``. This creates an optional argument that can be followed by zero or one command-line arguments. When parsing the command line, if the option string is encountered with no command-line argument following it, the value of ``const`` will be assumed instead. See the nargs_ description for examples.
fr: Quand la méthode :meth:`~ArgumentParser.add_argument` est appelée avec des chaînes d'options (telles que ``-f`` ou ``--foo``) et ``nargs='?'``. Ceci crée un argument optionnel qui peut être suivi de zéro ou un argument de ligne de commande. Quand la ligne de commande est analysée, si la chaîne d'option est trouvée mais qu'elle n'est pas suivie par un argument, la valeur de ``const`` est utilisée. Consultez la description de nargs_ pour voir quelques exemples.

source: With the ``'store_const'`` and ``'append_const'`` actions, the ``const`` keyword argument must be given. For other actions, it defaults to ``None``.
fr: Pour les actions ``'store_const'`` et ``'append_const'``, l'argument nommé ``const`` doit être spécifié. Pour toutes les autres actions, il est optionnel et sa valeur par défaut est ``None``.

source: default
fr: Le paramètre *default*

source: All optional arguments and some positional arguments may be omitted at the command line. The ``default`` keyword argument of :meth:`~ArgumentParser.add_argument`, whose value defaults to ``None``, specifies what value should be used if the command-line argument is not present. For optional arguments, the ``default`` value is used when the option string was not present at the command line::
fr: Tous les arguments optionnels et certains arguments positionnels peuvent être omis à la ligne de commande. L'argument nommé ``default`` de la méthode :meth:`~ArgumentParser.add_argument` (qui vaut ``None`` par défaut), indique quelle valeur sera utilisé si l'argument est absent de la ligne de commande. Pour les arguments optionnels, la valeur de ``default`` est utilisée si la chaîne d'option n'est pas présente sur la ligne de commande ::

source: If the target namespace already has an attribute set, the action *default* will not over write it::
fr: Si l'objet ``namespace`` cible a déjà un attribut assigné, l'action *default* ne l'écrase pas ::

source: If the ``default`` value is a string, the parser parses the value as if it were a command-line argument. In particular, the parser applies any type_ conversion argument, if provided, before setting the attribute on the :class:`Namespace` return value. Otherwise, the parser uses the value as is::
fr: Si la valeur de ``default`` est une chaîne, l'analyseur analyse cette valeur comme si c'était un argument de la ligne de commande. En particulier, l'analyseur applique la conversion spécifiée par l'argument type_ (si elle est fournie) avant d'affecter l'attribut à l'objet :class:`Namespace` renvoyé. Autrement, l'analyseur utilise la valeur telle qu'elle ::

source: For positional arguments with nargs_ equal to ``?`` or ``*``, the ``default`` value is used when no command-line argument was present::
fr: Pour les arguments positionnels pour lesquels nargs_ est ``?`` ou ``*``, la valeur de ``default`` est utilisée quand l'argument est absent de la ligne de commande ::

source: Providing ``default=argparse.SUPPRESS`` causes no attribute to be added if the command-line argument was not present::
fr: Si vous passez ``default=argparse.SUPPRESS``, aucun attribut ne sera ajouté à l'objet ``Namespace`` quand l'argument est absent de la ligne de commande ::

source: type
fr: Le paramètre *type*

source: By default, the parser reads command-line arguments in as simple strings. However, quite often the command-line string should instead be interpreted as another type, such as a :class:`float` or :class:`int`. The ``type`` keyword for :meth:`~ArgumentParser.add_argument` allows any necessary type-checking and type conversions to be performed.
fr: Par défaut, l'analyseur capture les arguments de la ligne de commande comme des chaînes. Très souvent par contre, on désire interpréter les chaînes de la ligne de commande comme un autre type, tel que :class:`float` ou :class:`int`. L'argument nommé ``type`` d':meth:`~ArgumentParser.add_argument` nous permet de faire les vérifications et les conversions de type nécessaires.

source: If the type_ keyword is used with the default_ keyword, the type converter is only applied if the default is a string.
fr: Si l'argument nommé type_ est utilisé en conjonction avec l'argument nommé default_, le convertisseur de type n'est appliqué que si la valeur par défaut est une chaîne.

source: The argument to ``type`` can be any callable that accepts a single string. If the function raises :exc:`ArgumentTypeError`, :exc:`TypeError`, or :exc:`ValueError`, the exception is caught and a nicely formatted error message is displayed. No other exception types are handled.
fr: La valeur de l'argument ``type`` peut être n'importe quel appelable qui accepte une seule chaîne. Si la fonction lance :exc:`ArgumentTypeError`, :exc:`TypeError` ou :exc:`ValueError`, l'exception est traitée et un message d'erreur agréablement formaté est affiché. Aucun autre type d'exception n'est géré.
