Repository: python/python-docs-fr
Catalog: library/argparse.po
Languages: fr

source: Simple class used by default by :meth:`~ArgumentParser.parse_args` to create an object holding attributes and return it.
fr: Classe rudimentaire utilisée par défaut par :meth:`~ArgumentParser.parse_args` pour créer un objet qui stocke les attributs. Cet objet est renvoyé par ``ArgumentParser.parse_args``.

source: This class is deliberately simple, just an :class:`object` subclass with a readable string representation. If you prefer to have dict-like view of the attributes, you can use the standard Python idiom, :func:`vars`::
fr: Cette classe est délibérément rudimentaire : une sous-classe d':class:`object` avec une représentation textuelle intelligible. Si vous préférez une vue *dict-compatible*, vous devez utiliser :func:`vars` (un idiome Python classique) ::

source: It may also be useful to have an :class:`ArgumentParser` assign attributes to an already existing object, rather than a new :class:`Namespace` object. This can be achieved by specifying the ``namespace=`` keyword argument::
fr: Il est parfois utile de demander à :class:`ArgumentParser` de faire l'affectation des attributs sur un objet existant plutôt que de faire la création d'un nouvel objet :class:`Namespace`. Ceci peut être réalisé avec l'argument nommé ``namespace=`` ::

source: Other utilities
fr: Autres outils

source: Sub-commands
fr: Sous commandes

source: Many programs split up their functionality into a number of sub-commands, for example, the ``svn`` program can invoke sub-commands like ``svn checkout``, ``svn update``, and ``svn commit``. Splitting up functionality this way can be a particularly good idea when a program performs several different functions which require different kinds of command-line arguments. :class:`ArgumentParser` supports the creation of such sub-commands with the :meth:`add_subparsers` method. The :meth:`add_subparsers` method is normally called with no arguments and returns a special action object. This object has a single method, :meth:`~ArgumentParser.add_parser`, which takes a command name and any :class:`ArgumentParser` constructor arguments, and returns an :class:`ArgumentParser` object that can be modified as usual.
fr: Certains programmes divisent leurs fonctionnalités entre un nombre de sous-commandes. Par exemple : le programme ``svn`` peut être invoqué comme ``svn checkout``, ``svn update`` et ``svn commit``. Séparer les fonctionnalités de cette façon est judicieux quand le programme effectue plusieurs fonctions différentes qui requièrent différents types de lignes de commandes. :class:`ArgumentParser` prend en charge la création de ce genre de sous-commandes grâce à la méthode :meth:`add_subparsers`. La méthode :meth:`add_subparsers` est généralement appelée sans argument et elle renvoie un objet ``Action`` spécial. Cet objet possède une seule méthode, :meth:`~ArgumentParser.add_parser`, qui prend le nom d'une commande et n'importe quels arguments du constructeur d':class:`ArgumentParser` ; elle renvoie un objet :class:`ArgumentParser` qui peut être modifié normalement.

source: Description of parameters:
fr: Description des paramètres :

source: title - title for the sub-parser group in help output; by default "subcommands" if description is provided, otherwise uses title for positional arguments
fr: ``title`` – titre du groupe de ce sous-analyseur dans la sortie d'aide ; par défaut : ``"subcommands"`` si ``description`` est fournie, sinon utilise la valeur de ``title`` de la section sur les arguments positionnels ;

source: description - description for the sub-parser group in help output, by default ``None``
fr: ``description`` – description du groupe de ce sous-analyseur dans la sortie d'aide ; par défaut : ``None`` ;

source: prog - usage information that will be displayed with sub-command help, by default the name of the program and any positional arguments before the subparser argument
fr: ``prog`` – nom du programme dans le message d'utilisation de l'aide des sous-commandes ; par défaut : le nom du programme et les arguments positionnels qui arrivent avant l'argument de ce sous-analyseur ;

source: parser_class - class which will be used to create sub-parser instances, by default the class of the current parser (e.g. ArgumentParser)
fr: ``parser_class`` – classe utilisée pour créer les instances de sous-analyseurs ; par défaut : la classe de l'analyseur courant (par exemple ``ArgumentParser``) ;

source: action_ - the basic type of action to be taken when this argument is encountered at the command line
fr: action_ – action à entreprendre quand cet argument est reconnu sur la ligne de commande ;

source: dest_ - name of the attribute under which sub-command name will be stored; by default ``None`` and no value is stored
fr: dest_ – nom de l'attribut sous lequel la sous-commande est stockée ; par défaut : ``None`` et aucune valeur n'est stockée ;

source: required_ - Whether or not a subcommand must be provided, by default ``False`` (added in 3.7)
fr: required_ – ``True`` si la sous-commande est obligatoire ; par défaut : ``False`` (ajouté dans 3.7) ;

source: help_ - help for sub-parser group in help output, by default ``None``
fr: help_ – message d'aide pour le groupe du sous-analyseur dans la sortie d'aide ; par défaut : ``None`` ;

source: metavar_ - string presenting available sub-commands in help; by default it is ``None`` and presents sub-commands in form {cmd1, cmd2, ..}
fr: metavar_ – chaîne qui représente les sous-commandes disponibles dans les messages d'aide ; par défaut : ``None``, ce qui entraine la génération d'une chaîne suivant le format ``'{cmd1, cmd2, …}'``.

source: Some example usage::
fr: Quelques exemples d'utilisation ::

source: Note that the object returned by :meth:`parse_args` will only contain attributes for the main parser and the subparser that was selected by the command line (and not any other subparsers). So in the example above, when the ``a`` command is specified, only the ``foo`` and ``bar`` attributes are present, and when the ``b`` command is specified, only the ``foo`` and ``baz`` attributes are present.
fr: Prenez note que l'objet renvoyé par :meth:`parse_args` ne contient que les attributs reconnus par l'analyseur principal et le sous-analyseur sélectionné par la ligne de commande. Les autres sous-analyseurs n'ont pas d'influence sur l'objet renvoyé. Ainsi dans l'exemple précédent, quand la commande ``a`` est spécifiée, seuls les attributs ``foo`` et ``bar`` sont présents ; quand la commande ``b`` est spécifiée, seuls les attributs ``foo`` et ``baz`` sont présents.

source: Similarly, when a help message is requested from a subparser, only the help for that particular parser will be printed. The help message will not include parent parser or sibling parser messages. (A help message for each subparser command, however, can be given by supplying the ``help=`` argument to :meth:`add_parser` as above.)
fr: De même, quand le message d'aide est demandé depuis l'un des sous-analyseurs, seul le message d'aide de cet analyseur est affiché. Le message d'aide n'inclut pas le message de l'analyseur parent ni celui des sous-analyseurs au même niveau. Il est toutefois possible de fournir un message d'aide pour chacun des sous-analyseurs grâce à l'argument ``help=`` d':meth:`add_parser` tel qu'illustré ci-dessus.

source: The :meth:`add_subparsers` method also supports ``title`` and ``description`` keyword arguments. When either is present, the subparser's commands will appear in their own group in the help output. For example::
fr: La méthode :meth:`add_subparsers` accepte les arguments nommés ``title`` et ``description``. Quand au moins l'un des deux est présent, les commandes du sous-analyseur sont affichées dans leur propre groupe dans la sortie d'aide. Par exemple ::

source: Furthermore, ``add_parser`` supports an additional ``aliases`` argument, which allows multiple strings to refer to the same subparser. This example, like ``svn``, aliases ``co`` as a shorthand for ``checkout``::
fr: De plus, ``add_parser`` accepte l'argument additionnel ``aliases`` qui permet à plusieurs chaînes de faire référence au même sous-analyseur. L'exemple suivant, à la manière de ``svn``, utilise ``co`` comme une abréviation de ``checkout`` ::

source: One particularly effective way of handling sub-commands is to combine the use of the :meth:`add_subparsers` method with calls to :meth:`set_defaults` so that each subparser knows which Python function it should execute. For example::
fr: Une façon efficace de traiter les sous-commandes est de combiner l'utilisation de la méthode :meth:`add_subparsers` avec des appels à :meth:`set_defaults` pour que chaque sous-analyseur sache quelle fonction Python doit être exécutée. Par exemple ::

source: This way, you can let :meth:`parse_args` do the job of calling the appropriate function after argument parsing is complete. Associating functions with actions like this is typically the easiest way to handle the different actions for each of your subparsers. However, if it is necessary to check the name of the subparser that was invoked, the ``dest`` keyword argument to the :meth:`add_subparsers` call will work::
fr: Ainsi, vous pouvez laisser à :meth:`parse_args` la responsabilité de faire l'appel à la bonne fonction après avoir analysé les arguments. Associer fonctions et actions est en général la façon la plus facile de gérer des actions différentes pour chacun de vos sous-analyseurs. Par contre, si vous avez besoin de consulter le nom de du sous-analyseur qui a été invoqué, vous pouvez utiliser l'argument nommé ``dest`` d':meth:`add_subparsers` ::

source: New *required* keyword argument.
fr: Introduction des arguments nommés obligatoires.

source: FileType objects
fr: Objets ``FileType``

source: The :class:`FileType` factory creates objects that can be passed to the type argument of :meth:`ArgumentParser.add_argument`. Arguments that have :class:`FileType` objects as their type will open command-line arguments as files with the requested modes, buffer sizes, encodings and error handling (see the :func:`open` function for more details)::
fr: Le type fabrique :class:`FileType` crée des objets qui peuvent être passés à l'argument ``type`` d':meth:`ArgumentParser.add_argument`. Les arguments qui ont comme ``type`` un objet :class:`FileType` ouvrent les arguments de la ligne de commande en tant que fichiers avec les options spécifiées : mode, taille du tampon, encodage et gestion des erreurs (voir la fonction :func:`open` pour plus de détails) ::

source: FileType objects understand the pseudo-argument ``'-'`` and automatically convert this into :data:`sys.stdin` for readable :class:`FileType` objects and :data:`sys.stdout` for writable :class:`FileType` objects::
fr: Les objets ``FileType`` reconnaissent le pseudo-argument ``'-'`` et le convertissent automatiquement vers :data:`sys.stdin` pour les objets :class:`FileType` ouverts en lecture, et vers :data:`sys.stdout` pour les objets :class:`FileType` ouverts en écriture ::

source: The *encodings* and *errors* keyword arguments.
fr: Les arguments nommés ``encodings`` et ``errors``.

source: Argument groups
fr: Groupes d'arguments

source: By default, :class:`ArgumentParser` groups command-line arguments into "positional arguments" and "optional arguments" when displaying help messages. When there is a better conceptual grouping of arguments than this default one, appropriate groups can be created using the :meth:`add_argument_group` method::
fr: Par défaut, :class:`ArgumentParser` sépare les arguments de la ligne de commande entre les groupes « arguments positionnels » et « arguments optionnels » au moment d'afficher les messages d'aide. S'il existe un meilleur regroupement conceptuel des arguments, les groupes adéquats peuvent être créés avec la méthode :meth:`add_argument_group` ::

source: The :meth:`add_argument_group` method returns an argument group object which has an :meth:`~ArgumentParser.add_argument` method just like a regular :class:`ArgumentParser`. When an argument is added to the group, the parser treats it just like a normal argument, but displays the argument in a separate group for help messages. The :meth:`add_argument_group` method accepts *title* and *description* arguments which can be used to customize this display::
fr: La méthode :meth:`add_argument_group` renvoie un objet représentant le groupe d'arguments. Cet objet possède une méthode :meth:`~ArgumentParser.add_argument` semblable à celle d':class:`ArgumentParser`. Quand un argument est ajouté au groupe, l'analyseur le traite comme un argument normal, mais il affiche le nouvel argument dans un groupe séparé dans les messages d'aide. Afin de personnaliser l'affichage, la méthode :meth:`add_argument_group` accepte les arguments ``title`` et ``description`` ::

source: Note that any arguments not in your user-defined groups will end up back in the usual "positional arguments" and "optional arguments" sections.
fr: Prenez note que tout argument qui n'est pas dans l'un de vos groupes est affiché dans l'une des sections usuelles *positional arguments* et *optional arguments*.

source: Mutual exclusion
fr: Exclusion mutuelle

source: Create a mutually exclusive group. :mod:`argparse` will make sure that only one of the arguments in the mutually exclusive group was present on the command line::
fr: Crée un groupe mutuellement exclusif. Le module :mod:`argparse` vérifie qu'au plus un des arguments du groupe mutuellement exclusif est présent sur la ligne de commande ::

source: The :meth:`add_mutually_exclusive_group` method also accepts a *required* argument, to indicate that at least one of the mutually exclusive arguments is required::
fr: La méthode :meth:`add_mutually_exclusive_group` accepte aussi l'argument ``required`` pour indiquer qu'au moins un des arguments mutuellement exclusifs est nécessaire ::

source: Note that currently mutually exclusive argument groups do not support the *title* and *description* arguments of :meth:`~ArgumentParser.add_argument_group`.
fr: Prenez note que présentement les groupes d'arguments mutuellement exclusifs n'acceptent pas les arguments ``title`` et ``description`` d':meth:`~ArgumentParser.add_argument_group`.

source: Parser defaults
fr: Valeurs par défaut de l'analyseur

source: Most of the time, the attributes of the object returned by :meth:`parse_args` will be fully determined by inspecting the command-line arguments and the argument actions. :meth:`set_defaults` allows some additional attributes that are determined without any inspection of the command line to be added::
fr: Dans la majorité des cas, les attributs de l'objet renvoyé par :meth:`parse_args` sont entièrement définis par l'inspection des arguments de la ligne de commande et par les actions des arguments. La méthode :meth:`set_defaults` permet l'ajout d'attributs additionnels qui sont définis sans nécessiter l'inspection de la ligne de commande ::

source: Note that parser-level defaults always override argument-level defaults::
fr: Prenez note que les valeurs par défaut au niveau de l'analyseur ont précédence sur les valeurs par défaut au niveau de l'argument ::

source: Parser-level defaults can be particularly useful when working with multiple parsers. See the :meth:`~ArgumentParser.add_subparsers` method for an example of this type.
fr: Les valeurs par défaut au niveau de l'analyseur sont particulièrement utiles quand on travaille avec plusieurs analyseurs. Voir la méthode :meth:`~ArgumentParser.add_subparsers` pour un exemple de cette utilisation.

source: Get the default value for a namespace attribute, as set by either :meth:`~ArgumentParser.add_argument` or by :meth:`~ArgumentParser.set_defaults`::
fr: Renvoie la valeur par défaut d'un attribut de l'objet ``Namespace`` tel qu'il a été défini soit par :meth:`~ArgumentParser.add_argument` ou par :meth:`~ArgumentParser.set_defaults` ::

source: Printing help
fr: Afficher l'aide

source: In most typical applications, :meth:`~ArgumentParser.parse_args` will take care of formatting and printing any usage or error messages. However, several formatting methods are available:
fr: Pour la majorité des applications, :meth:`~ArgumentParser.parse_args` se charge du formatage et de l'affichage des messages d'erreur et d'utilisation. Plusieurs méthodes de formatage sont toutefois disponibles :

source: Print a brief description of how the :class:`ArgumentParser` should be invoked on the command line. If *file* is ``None``, :data:`sys.stdout` is assumed.
fr: Affiche une brève description sur la façon d'invoquer l':class:`ArgumentParser` depuis la ligne de commande. Si ``file`` est ``None``, utilise :data:`sys.stdout`.

source: Print a help message, including the program usage and information about the arguments registered with the :class:`ArgumentParser`. If *file* is ``None``, :data:`sys.stdout` is assumed.
fr: Affiche un message d'aide qui inclut l'utilisation du programme et l'information sur les arguments répertoriés dans l':class:`ArgumentParser`. Si ``file`` est ``None``, utilise :data:`sys.stdout`.

source: There are also variants of these methods that simply return a string instead of printing it:
fr: Des variantes de ces méthodes sont fournies pour renvoyer la chaîne plutôt que de l'afficher :

source: Return a string containing a brief description of how the :class:`ArgumentParser` should be invoked on the command line.
fr: Renvoie une chaîne contenant une brève description sur la façon d'invoquer l':class:`ArgumentParser` depuis la ligne de commande.

source: Return a string containing a help message, including the program usage and information about the arguments registered with the :class:`ArgumentParser`.
fr: Renvoie une chaîne représentant un message d'aide qui inclut des informations sur l'utilisation du programme et sur les arguments définis dans l':class:`ArgumentParser`.

source: Partial parsing
fr: Analyse partielle

source: Sometimes a script may only parse a few of the command-line arguments, passing the remaining arguments on to another script or program. In these cases, the :meth:`~ArgumentParser.parse_known_args` method can be useful. It works much like :meth:`~ArgumentParser.parse_args` except that it does not produce an error when extra arguments are present. Instead, it returns a two item tuple containing the populated namespace and the list of remaining argument strings.
fr: Parfois, un script n'analyse que de quelques-uns des arguments de la ligne de commande avant de passer les arguments non-traités à un autre script ou un autre programme. La méthode :meth:`~ArgumentParser.parse_known_args` est utile dans ces cas. Elle fonctionne similairement à :meth:`~ArgumentParser.parse_args`, mais elle ne lève pas d'erreur quand des arguments non-reconnus sont présents. Au lieu, elle renvoie une paire de valeurs : l'objet ``Namespace`` rempli et la liste des arguments non-traités.

source: :ref:`Prefix matching <prefix-matching>` rules apply to :meth:`parse_known_args`. The parser may consume an option even if it's just a prefix of one of its known options, instead of leaving it in the remaining arguments list.
fr: Les règles d':ref:`acceptation des abréviations <prefix-matching>` sont applicables à :meth:`parse_known_args`. L'analyseur peut ainsi capturer une option même si elle n'est que le préfixe d'une option reconnue plutôt que de la laisser dans la liste des arguments non-traités.

source: Customizing file parsing
fr: Personnaliser le *parsing* de fichiers

source: Arguments that are read from a file (see the *fromfile_prefix_chars* keyword argument to the :class:`ArgumentParser` constructor) are read one argument per line. :meth:`convert_arg_line_to_args` can be overridden for fancier reading.
fr: Les arguments qui proviennent d'un fichier sont lus un par ligne. La méthode :meth:`convert_arg_line_to_args` peut être surchargée pour accomplir un traitement plus élaboré. Voir aussi l'argument nommé ``fromfile_prefix_chars`` du constructeur d':class:`ArgumentParser`.

source: This method takes a single argument *arg_line* which is a string read from the argument file. It returns a list of arguments parsed from this string. The method is called once per line read from the argument file, in order.
fr: La méthode ``convert_arg_line_to_args`` accepte un seul argument, ``arg_line``, qui est une chaîne lue dans le fichier d'arguments. Elle renvoie une liste d'arguments analysés dans cette chaîne. La méthode est appelée une fois pour chaque ligne lue du fichier d'arguments. L'ordre est préservé.

source: A useful override of this method is one that treats each space-separated word as an argument. The following example demonstrates how to do this::
fr: Une surcharge utile de cette méthode est de permettre à chaque mot délimité par des espaces d'être traité comme un argument. L'exemple suivant illustre comment réaliser ceci ::

source: Exiting methods
fr: Méthodes d'interruptions

source: This method terminates the program, exiting with the specified *status* and, if given, it prints a *message* before that. The user can override this method to handle these steps differently::
fr: Cette méthode interrompt l'exécution du programme et renvoie ``status`` comme valeur de retour du processus. Si ``message`` est fourni, la chaîne est affichée avant la fin de l'exécution. Vous pouvez surcharger cette méthode pour traiter ces étapes différemment ::

source: This method prints a usage message including the *message* to the standard error and terminates the program with a status code of 2.
fr: Cette méthode affiche un message d'utilisation qui inclut la chaîne ``message`` sur la sortie d'erreur standard puis termine l'exécution avec le code de fin d'exécution 2.

source: Intermixed parsing
fr: Analyse entremêlée

source: A number of Unix commands allow the user to intermix optional arguments with positional arguments. The :meth:`~ArgumentParser.parse_intermixed_args` and :meth:`~ArgumentParser.parse_known_intermixed_args` methods support this parsing style.
fr: De nombreuses commandes Unix permettent à l'utilisateur d'entremêler les arguments optionnels et les arguments positionnels. Les méthodes :meth:`~ArgumentParser.parse_intermixed_args` et :meth:`~ArgumentParser.parse_known_intermixed_args` permettent ce style d'analyse.

source: These parsers do not support all the argparse features, and will raise exceptions if unsupported features are used. In particular, subparsers, ``argparse.REMAINDER``, and mutually exclusive groups that include both optionals and positionals are not supported.
fr: Ces analyseurs n'offrent pas toutes les fonctionnalités d'``argparse`` et ils lèvent une exception si une fonctionnalité non prise en charge est utilisée. En particulier, les sous-analyseurs, ``argparse.REMAINDER`` et les groupes mutuellement exclusifs qui contiennent à la fois des arguments optionnels et des arguments positionnels ne sont pas pris en charge.

source: The following example shows the difference between :meth:`~ArgumentParser.parse_known_args` and :meth:`~ArgumentParser.parse_intermixed_args`: the former returns ``['2', '3']`` as unparsed arguments, while the latter collects all the positionals into ``rest``. ::
fr: L'exemple suivant illustre la différence entre :meth:`~ArgumentParser.parse_known_args` et :meth:`~ArgumentParser.parse_intermixed_args` : le premier renvoie ``['2', '3']`` comme arguments non-traités alors que le second capture tous les arguments positionnels dans ``rest`` ::
