Repository: python/python-docs-fr
Catalog: library/argparse.po
Languages: fr

source: :mod:`argparse` --- Parser for command-line options, arguments and sub-commands
fr: :mod:`argparse` -- Parseur d'arguments, d'options, et de sous-commandes de ligne de commande

source: **Source code:** :source:`Lib/argparse.py`
fr: **Code source:** :source:`Lib/argparse.py`

source: Tutorial
fr: Tutoriel

source: This page contains the API reference information. For a more gentle introduction to Python command-line parsing, have a look at the :ref:`argparse tutorial <argparse-tutorial>`.
fr: Cette page est la référence de l'API. Pour une introduction plus en douceur à l'analyse des arguments de la ligne de commande, regardez :ref:`le tutoriel argparse <argparse-tutorial>`.

source: The :mod:`argparse` module makes it easy to write user-friendly command-line interfaces. The program defines what arguments it requires, and :mod:`argparse` will figure out how to parse those out of :data:`sys.argv`. The :mod:`argparse` module also automatically generates help and usage messages and issues errors when users give the program invalid arguments.
fr: Le module :mod:`argparse` facilite l'écriture d'interfaces en ligne de commande agréables à l'emploi. Le programme définit les arguments requis et :mod:`argparse` s'arrange pour analyser ceux provenant de :data:`sys.argv`. Le module :mod:`argparse` génère aussi automatiquement les messages d'aide, le mode d'emploi, et lève des erreurs lorsque les utilisateurs fournissent au programme des arguments invalides.

source: Example
fr: Exemple

source: The following code is a Python program that takes a list of integers and produces either the sum or the max::
fr: Le code suivant est un programme Python acceptant une liste de nombre entiers et en donnant soit la somme, soit le maximum ::

source: Assuming the Python code above is saved into a file called ``prog.py``, it can be run at the command line and provides useful help messages:
fr: En supposant que le code Python ci-dessus est sauvegardé dans un fichier nommé ``prog.py``, il peut être lancé en ligne de commande et fournit des messages d'aide utiles :

source: When run with the appropriate arguments, it prints either the sum or the max of the command-line integers:
fr: Lorsqu'il est lancé avec les arguments appropriés, il affiche la somme ou le maximum des entiers fournis en ligne de commande :

source: If invalid arguments are passed in, it will issue an error:
fr: Si des arguments invalides sont passés, il lève une erreur :

source: The following sections walk you through this example.
fr: Les sections suivantes vous guident au travers de cet exemple.

source: Creating a parser
fr: Créer un analyseur (*parser* en anglais)

source: The first step in using the :mod:`argparse` is creating an :class:`ArgumentParser` object::
fr: La première étape dans l'utilisation de :mod:`argparse` est de créer un objet :class:`ArgumentParser` ::

source: The :class:`ArgumentParser` object will hold all the information necessary to parse the command line into Python data types.
fr: L'objet :class:`ArgumentParser` contiendra toutes les informations nécessaires pour interpréter la ligne de commande comme des types de données de Python.

source: Adding arguments
fr: Ajouter des arguments

source: Filling an :class:`ArgumentParser` with information about program arguments is done by making calls to the :meth:`~ArgumentParser.add_argument` method. Generally, these calls tell the :class:`ArgumentParser` how to take the strings on the command line and turn them into objects. This information is stored and used when :meth:`~ArgumentParser.parse_args` is called. For example::
fr: Alimenter un :class:`ArgumentParser` avec des informations sur les arguments du programme s'effectue en faisant des appels à la méthode :meth:`~ArgumentParser.add_argument`. En général ces appels disent à l':class:`ArgumentParser` comment prendre les chaînes de caractères de la ligne de commande et les transformer en objets. Cette information est stockée et utilisée lorsque :meth:`~ArgumentParser.parse_args` est appelée. Par exemple ::

source: Later, calling :meth:`~ArgumentParser.parse_args` will return an object with two attributes, ``integers`` and ``accumulate``. The ``integers`` attribute will be a list of one or more ints, and the ``accumulate`` attribute will be either the :func:`sum` function, if ``--sum`` was specified at the command line, or the :func:`max` function if it was not.
fr: Ensuite, appeler :meth:`~ArgumentParser.parse_args` va renvoyer un objet avec deux attributs, ``integers`` et ``accumulate``. L'attribut ``integers`` est une liste d'un ou plusieurs entiers, et l'attribut ``accumulate`` est soit la fonction :func:`sum`, si ``--sum`` était fourni à la ligne de commande, soit la fonction :func:`max` dans le cas contraire.

source: Parsing arguments
fr: Analyse des arguments

source: :class:`ArgumentParser` parses arguments through the :meth:`~ArgumentParser.parse_args` method. This will inspect the command line, convert each argument to the appropriate type and then invoke the appropriate action. In most cases, this means a simple :class:`Namespace` object will be built up from attributes parsed out of the command line::
fr: :class:`ArgumentParser` analyse les arguments avec la méthode :meth:`~ArgumentParser.parse_args`. Cette méthode inspecte la ligne de commande, convertit chaque argument au type approprié et invoque l'action requise. Dans la plupart des cas, le résultat est la construction d'un objet :class:`Namespace` à partir des attributs analysés dans la ligne de commande ::

source: In a script, :meth:`~ArgumentParser.parse_args` will typically be called with no arguments, and the :class:`ArgumentParser` will automatically determine the command-line arguments from :data:`sys.argv`.
fr: Dans un script, :meth:`~ArgumentParser.parse_args` est généralement appelée sans arguments et l'objet :class:`ArgumentParser` détermine automatiquement les arguments de la ligne de commande à partir de :data:`sys.argv`.

source: ArgumentParser objects
fr: Objets ``ArgumentParser``

source: Create a new :class:`ArgumentParser` object. All parameters should be passed as keyword arguments. Each parameter has its own more detailed description below, but in short they are:
fr: Crée un nouvel objet :class:`ArgumentParser`. Tous les paramètres doivent être passés en arguments nommés. Chaque paramètre a sa propre description détaillée ci-dessous, mais en résumé ils sont :

source: prog_ - The name of the program (default: ``os.path.basename(sys.argv[0])``)
fr: prog_ – Nom du programme (par défaut : ``os.path.basename(sys.argv[0])``) ;

source: usage_ - The string describing the program usage (default: generated from arguments added to parser)
fr: usage_ – Chaîne décrivant l'utilisation du programme (par défaut : générée à partir des arguments ajoutés à l'analyseur) ;

source: description_ - Text to display before the argument help (by default, no text)
fr: description_ – Texte à afficher au dessus de l'aide pour les arguments (vide par défaut) ;

source: epilog_ - Text to display after the argument help (by default, no text)
fr: epilog_ – Texte à afficher après l'aide des arguments (vide par défaut) ;

source: parents_ - A list of :class:`ArgumentParser` objects whose arguments should also be included
fr: parents_ – Liste d'objets :class:`ArgumentParser` contenant des arguments qui devraient aussi être inclus ;

source: formatter_class_ - A class for customizing the help output
fr: formatter_class_ – Classe pour personnaliser la sortie du message d'aide ;

source: prefix_chars_ - The set of characters that prefix optional arguments (default: '-')
fr: prefix_chars_ – Jeu de caractères qui précède les arguments optionnels (par défaut : ``'-'``) ;

source: fromfile_prefix_chars_ - The set of characters that prefix files from which additional arguments should be read (default: ``None``)
fr: fromfile_prefix_chars_ – Jeu de caractères qui précède les fichiers d'où des arguments additionnels doivent être lus (par défaut : ``None``) ;

source: argument_default_ - The global default value for arguments (default: ``None``)
fr: argument_default_ – Valeur globale par défaut pour les arguments (par défaut : ``None``) ;

source: conflict_handler_ - The strategy for resolving conflicting optionals (usually unnecessary)
fr: conflict_handler_ – Stratégie pour résoudre les conflits entre les arguments optionnels (non-nécessaire en général) ;

source: add_help_ - Add a ``-h/--help`` option to the parser (default: ``True``)
fr: add_help_ – Ajoute une option d'aide ``-h/--help`` à l'analyseur (par défaut : ``True``) ;

source: allow_abbrev_ - Allows long options to be abbreviated if the abbreviation is unambiguous. (default: ``True``)
fr: allow_abbrev_ – Permet l'acceptation d'abréviations non-ambigües pour les options longues (par défaut : ``True``) ;

source: exit_on_error_ - Determines whether or not ArgumentParser exits with error info when an error occurs. (default: ``True``)
fr: exit_on_error_ – Détermine si l'objet ``ArgumentParser`` termine l'exécution avec un message d'erreur quand une erreur est rencontrée (par défaut : ``True``).

source: *allow_abbrev* parameter was added.
fr: Le paramètre *allow_abbrev* est ajouté.

source: In previous versions, *allow_abbrev* also disabled grouping of short flags such as ``-vv`` to mean ``-v -v``.
fr: Dans les versions précédentes, *allow_abbrev* désactivait aussi le regroupement de plusieurs options courtes telles que ``-vv`` pour signifier ``-v -v``.

source: *exit_on_error* parameter was added.
fr: Le paramètre *exit_on_error* est ajouté.

source: The following sections describe how each of these are used.
fr: Les sections suivantes décrivent comment chacune de ces options sont utilisées.

source: prog
fr: Le paramètre *prog*

source: By default, :class:`ArgumentParser` objects use ``sys.argv[0]`` to determine how to display the name of the program in help messages. This default is almost always desirable because it will make the help messages match how the program was invoked on the command line. For example, consider a file named ``myprogram.py`` with the following code::
fr: Par défaut, l'objet :class:`ArgumentParser` utilise ``sys.argv[0]`` pour déterminer comment afficher le nom du programme dans les messages d'aide. Cette valeur par défaut est presque toujours souhaitable, car elle produit un message d'aide qui correspond à la méthode utilisée pour lancer le programme sur la ligne de commande. Par exemple, si on a un fichier nommé ``myprogram.py`` avec le code suivant ::

source: The help for this program will display ``myprogram.py`` as the program name (regardless of where the program was invoked from):
fr: Le message d'aide pour ce programme affiche ``myprogram.py`` pour le nom du programme (peu importe d'où le programme est lancé) :

source: To change this default behavior, another value can be supplied using the ``prog=`` argument to :class:`ArgumentParser`::
fr: Pour changer ce comportement par défaut, une valeur alternative est passée par l'argument ``prog=`` du constructeur d':class:`ArgumentParser` ::

source: Note that the program name, whether determined from ``sys.argv[0]`` or from the ``prog=`` argument, is available to help messages using the ``%(prog)s`` format specifier.
fr: Prenez note que le nom du programme, peu importe s'il provient de ``sys.argv[0]`` ou de l'argument ``prog=``, est accessible aux messages d'aide grâce au spécificateur de formatage ``%(prog)s``.

source: usage
fr: Le paramètre *usage*

source: By default, :class:`ArgumentParser` calculates the usage message from the arguments it contains::
fr: Par défaut, l'objet :class:`ArgumentParser` construit le message relatif à l'utilisation à partir des arguments qu'il contient ::

source: The default message can be overridden with the ``usage=`` keyword argument::
fr: Le message par défaut peut être remplacé grâce à l'argument nommé ``usage=`` ::

source: The ``%(prog)s`` format specifier is available to fill in the program name in your usage messages.
fr: Le spécificateur de formatage ``%(prog)s`` est disponible pour insérer le nom du programme dans vos messages d'utilisation.

source: description
fr: Le paramètre *description*

source: Most calls to the :class:`ArgumentParser` constructor will use the ``description=`` keyword argument. This argument gives a brief description of what the program does and how it works. In help messages, the description is displayed between the command-line usage string and the help messages for the various arguments::
fr: La plupart des appels au constructeur d':class:`ArgumentParser` utilisent l'argument nommé ``description=``. Cet argument donne une brève description de ce que fait le programme et de comment il fonctionne. Dans les messages d'aide, cette description est affichée entre le prototype de ligne de commande et les messages d'aide des arguments ::

source: By default, the description will be line-wrapped so that it fits within the given space. To change this behavior, see the formatter_class_ argument.
fr: Par défaut, la description est sujette au retour à la ligne automatique pour se conformer à l'espace disponible. Pour changer ce comportement, voyez l'argument formatter_class_.

source: epilog
fr: Le paramètre *epilog*

source: Some programs like to display additional description of the program after the description of the arguments. Such text can be specified using the ``epilog=`` argument to :class:`ArgumentParser`::
fr: Certains programmes aiment afficher un texte supplémentaire après la description des arguments. Un tel texte peut être spécifié grâce à l'argument ``epilog=`` du constructeur d':class:`ArgumentParser` ::

source: As with the description_ argument, the ``epilog=`` text is by default line-wrapped, but this behavior can be adjusted with the formatter_class_ argument to :class:`ArgumentParser`.
fr: De même que pour l'argument description_, le texte passé à ``epilog=`` est sujet au retour à la ligne automatique. Ce comportement peut être ajusté grâce à l'argument formatter_class_ du constructeur d':class:`ArgumentParser`.

source: parents
fr: Le paramètre *parents*

source: Sometimes, several parsers share a common set of arguments. Rather than repeating the definitions of these arguments, a single parser with all the shared arguments and passed to ``parents=`` argument to :class:`ArgumentParser` can be used. The ``parents=`` argument takes a list of :class:`ArgumentParser` objects, collects all the positional and optional actions from them, and adds these actions to the :class:`ArgumentParser` object being constructed::
fr: Parfois, plusieurs analyseurs partagent un jeu commun d'arguments. Plutôt que de répéter les définitions de ces arguments, un analyseur commun qui contient tous les arguments partagés peut être utilisé, puis passé à l'argument ``parents=`` du constructeur d':class:`ArgumentParser`. L'argument ``parents=`` accepte une liste d'objets :class:`ArgumentParser`, accumule toutes les actions positionnelles et optionnelles de ces objets, puis les ajoute à l'instance d':class:`ArgumentParser` en cours de création ::

source: Note that most parent parsers will specify ``add_help=False``. Otherwise, the :class:`ArgumentParser` will see two ``-h/--help`` options (one in the parent and one in the child) and raise an error.
fr: Prenez note que la majorité des analyseurs parents doivent spécifier ``add_help=False``. Autrement, le constructeur d':class:`ArgumentParser` va voir plus d'une option ``-h/--help`` (une pour le parent et une pour l'instance en cours de création) et va lever une erreur.

source: You must fully initialize the parsers before passing them via ``parents=``. If you change the parent parsers after the child parser, those changes will not be reflected in the child.
fr: Vous devez initialiser complètement les analyseurs avant de les passer à ``parents=``. Si vous changez les analyseurs parents après la création de l'analyseur enfant, ces changements ne seront pas répercutés sur l'enfant.

source: formatter_class
fr: Le paramètre *formatter_class*

source: :class:`ArgumentParser` objects allow the help formatting to be customized by specifying an alternate formatting class. Currently, there are four such classes:
fr: Les objets :class:`ArgumentParser` permettent la personnalisation de la mise en page des messages d'aide en spécifiant une classe de formatage alternative. Il y a actuellement quatre classes de formatage :

source: :class:`RawDescriptionHelpFormatter` and :class:`RawTextHelpFormatter` give more control over how textual descriptions are displayed. By default, :class:`ArgumentParser` objects line-wrap the description_ and epilog_ texts in command-line help messages::
fr: :class:`RawDescriptionHelpFormatter` et :class:`RawTextHelpFormatter` vous donnent plus de contrôle sur comment les descriptions textuelles sont affichées. Par défaut, les contenus de description_ et epilog_ des objets :class:`ArgumentParser` font l'objet du retour à la ligne automatique dans les messages d'aide ::

source: Passing :class:`RawDescriptionHelpFormatter` as ``formatter_class=`` indicates that description_ and epilog_ are already correctly formatted and should not be line-wrapped::
fr: Passer :class:`RawDescriptionHelpFormatter` à ``formatter_class=`` indique que les textes de description_ et d'epilog_ ont déjà été formatés correctement et qu'ils ne doivent pas faire l'objet d'un retour à la ligne automatique ::

source: :class:`RawTextHelpFormatter` maintains whitespace for all sorts of help text, including argument descriptions. However, multiple new lines are replaced with one. If you wish to preserve multiple blank lines, add spaces between the newlines.
fr: :class:`RawTextHelpFormatter` conserve les espaces pour toutes les catégories de textes d'aide, y compris les descriptions des arguments. Notez bien que plusieurs retours à la ligne consécutifs sont remplacés par un seul. Si vous voulez garder plusieurs sauts de ligne, ajoutez des espaces entre les caractères de changement de ligne.

source: :class:`ArgumentDefaultsHelpFormatter` automatically adds information about default values to each of the argument help messages::
fr: :class:`ArgumentDefaultsHelpFormatter` ajoute automatiquement l'information sur les valeurs par défaut aux messages d'aide de tous les arguments ::

source: :class:`MetavarTypeHelpFormatter` uses the name of the type_ argument for each argument as the display name for its values (rather than using the dest_ as the regular formatter does)::
fr: :class:`MetavarTypeHelpFormatter` utilise le nom du type_ de l'argument pour chacun des arguments comme nom d'affichage pour leurs valeurs (contrairement au formateur standard qui utilise dest_) ::

source: prefix_chars
fr: Le paramètre *prefix_chars*

source: Most command-line options will use ``-`` as the prefix, e.g. ``-f/--foo``. Parsers that need to support different or additional prefix characters, e.g. for options like ``+f`` or ``/foo``, may specify them using the ``prefix_chars=`` argument to the ArgumentParser constructor::
fr: La majorité des options sur la ligne de commande utilisent ``-`` comme préfixe (par exemple : ``-f/--foo``). Pour les analyseurs qui doivent accepter des caractères préfixes autres ou additionnels (par exemple pour les options ``+f`` ou ``/foo``), vous devez les spécifier en utilisant l'argument ``prefix_chars=`` du constructeur d'``ArgumentParser`` ::

source: The ``prefix_chars=`` argument defaults to ``'-'``. Supplying a set of characters that does not include ``-`` will cause ``-f/--foo`` options to be disallowed.
fr: La valeur par défaut de ``prefix_chars=`` est ``'-'``. Passer un jeu de caractères qui n'inclut pas ``-`` provoquera le refus des options comme ``-f/--foo``.

source: fromfile_prefix_chars
fr: Le paramètre *fromfile_prefix_chars*

source: Sometimes, for example when dealing with a particularly long argument list, it may make sense to keep the list of arguments in a file rather than typing it out at the command line. If the ``fromfile_prefix_chars=`` argument is given to the :class:`ArgumentParser` constructor, then arguments that start with any of the specified characters will be treated as files, and will be replaced by the arguments they contain. For example::
fr: Parfois, par exemple quand on traite une liste d'arguments particulièrement longue, il est logique de stocker la liste d'arguments dans un fichier plutôt que de la saisir sur la ligne de commande. Si un jeu de caractères est passé à l'argument ``fromfile_prefix_chars=`` du constructeur de :class:`ArgumentParser`, alors les arguments qui commencent par l'un des caractères spécifiés seront traités comme des fichiers et seront remplacés par les arguments contenus dans ces fichiers. Par exemple ::

source: Arguments read from a file must by default be one per line (but see also :meth:`~ArgumentParser.convert_arg_line_to_args`) and are treated as if they were in the same place as the original file referencing argument on the command line. So in the example above, the expression ``['-f', 'foo', '@args.txt']`` is considered equivalent to the expression ``['-f', 'foo', '-f', 'bar']``.
fr: Par défaut, les arguments lus à partir d'un fichier doivent être chacun sur une nouvelle ligne (voir aussi :meth:`~ArgumentParser.convert_arg_line_to_args`) et ils sont traités comme s'ils étaient au même emplacement que le fichier original référençant les arguments de la ligne de commande. Ainsi dans l'exemple ci-dessus, l'expression ``['-f', 'foo', '@args.txt']`` est équivalente à l'expression ``['-f', 'foo', '-f', 'bar']``.

source: The ``fromfile_prefix_chars=`` argument defaults to ``None``, meaning that arguments will never be treated as file references.
fr: Par défaut, l'argument ``fromfile_prefix_chars=`` est ``None``, ce qui signifie que les arguments ne seront pas traités en tant que références à des fichiers.

source: argument_default
fr: Le paramètre *argument_default*

source: Generally, argument defaults are specified either by passing a default to :meth:`~ArgumentParser.add_argument` or by calling the :meth:`~ArgumentParser.set_defaults` methods with a specific set of name-value pairs. Sometimes however, it may be useful to specify a single parser-wide default for arguments. This can be accomplished by passing the ``argument_default=`` keyword argument to :class:`ArgumentParser`. For example, to globally suppress attribute creation on :meth:`~ArgumentParser.parse_args` calls, we supply ``argument_default=SUPPRESS``::
fr: Généralement, les valeurs par défaut des arguments sont spécifiées soit en passant la valeur désirée à :meth:`~ArgumentParser.add_argument` soit par un appel à la méthode :meth:`~ArgumentParser.set_defaults`. Cette méthode accepte un ensemble de paires nom-valeur. Il est parfois pertinent de configurer une valeur par défaut pour tous les arguments d'un analyseur. On peut activer ce comportement en passant la valeur désirée à l'argument nommé ``argument_default=`` du constructeur de :class:`ArgumentParser`. Par exemple, pour supprimer globalement la création d'attributs pendant l'appel de :meth:`~ArgumentParser.parse_args`, on fournit ``argument_default=SUPPRESS`` ::

source: allow_abbrev
fr: Le paramètre *allow_abbrev*

source: Normally, when you pass an argument list to the :meth:`~ArgumentParser.parse_args` method of an :class:`ArgumentParser`, it :ref:`recognizes abbreviations <prefix-matching>` of long options.
fr: En temps normal, lorsque vous passez une liste d'arguments à la méthode :meth:`~ArgumentParser.parse_args` d':class:`ArgumentParser` :ref:`elle accepte les abréviations <prefix-matching>` des options longues.

source: This feature can be disabled by setting ``allow_abbrev`` to ``False``::
fr: Cette fonctionnalité peut être désactivée en passant ``False`` à ``allow_abbrev`` ::
