Repository: python/python-docs-fr
Catalog: library/argparse.po
Languages: fr

source: Common built-in types and functions can be used as type converters:
fr: Les types et les fonctions natives peuvent être utilisés comme convertisseurs de types :

source: User defined functions can be used as well:
fr: Des fonctions définies par l'utilisateur peuvent aussi être utilisées :

source: The :func:`bool` function is not recommended as a type converter. All it does is convert empty strings to ``False`` and non-empty strings to ``True``. This is usually not what is desired.
fr: La fonction :func:`bool` est déconseillée comme convertisseur de type. Son comportement se limite à convertir les chaînes vides à ``False`` et les chaînes non-vides à ``True``. Ce n'est généralement pas le résultat désiré.

source: In general, the ``type`` keyword is a convenience that should only be used for simple conversions that can only raise one of the three supported exceptions. Anything with more interesting error-handling or resource management should be done downstream after the arguments are parsed.
fr: En général, l'argument nommé ``type`` est un raccourci qui ne devrait être utilisé que pour les conversions simples qui ne peuvent lever qu'une des trois exceptions gérées. Les conversions qui demandent un traitement d'erreurs plus intéressant ou une gestion de ressources devraient être effectuées plus tard dans l’exécution suite à l'analyse des arguments.

source: For example, JSON or YAML conversions have complex error cases that require better reporting than can be given by the ``type`` keyword. A :exc:`~json.JSONDecodeError` would not be well formatted and a :exc:`FileNotFound` exception would not be handled at all.
fr: Par exemple, les conversions de documents *JSON* ou *YAML* ont des cas d'erreurs complexes qui requièrent un meilleur signalement que ce qui est fourni par l'argument nommé ``type``. Une exception :exc:`~json.JSONDecodeError` ne serait pas adéquatement formatée et une exception :exc:`FileNotFound` ne serait pas du tout traitée.

source: Even :class:`~argparse.FileType` has its limitations for use with the ``type`` keyword. If one argument uses *FileType* and then a subsequent argument fails, an error is reported but the file is not automatically closed. In this case, it would be better to wait until after the parser has run and then use the :keyword:`with`-statement to manage the files.
fr: Même la classe :class:`~argparse.FileType` a ses limitations quand elle est utilisée pour l'argument nommé ``type``. Si un argument utilise *FileType* et qu'un argument ultérieur échoue, une erreur est annoncée mais le fichier n'est pas automatiquement fermé. Dans ce cas, il serait mieux d'attendre la fin de l'exécution de l'analyseur puis de gérer les fichiers à l'aide d'un bloc :keyword:`with`.

source: For type checkers that simply check against a fixed set of values, consider using the choices_ keyword instead.
fr: Pour les vérificateurs de types qui ne font que tester l'appartenance à un ensemble de valeurs, pensez plutôt à utiliser l'argument nommé choices_.

source: choices
fr: Le paramètre *choices*

source: Some command-line arguments should be selected from a restricted set of values. These can be handled by passing a sequence object as the *choices* keyword argument to :meth:`~ArgumentParser.add_argument`. When the command line is parsed, argument values will be checked, and an error message will be displayed if the argument was not one of the acceptable values::
fr: Certains arguments de la ligne de commande doivent être choisis parmi un ensemble prédéfini de valeurs. Celles-ci doivent être déclarées dans la séquence passée à l'argument *choices* de la méthode :meth:`~ArgumentParser.add_argument`. Un message d'erreur est alors affiché si l'utilisateur passe un argument qui n'est pas parmi les valeurs acceptables ::

source: Note that inclusion in the *choices* sequence is checked after any type_ conversions have been performed, so the type of the objects in the *choices* sequence should match the type_ specified::
fr: Prenez note que le test d'inclusion dans le conteneur *choices* est fait après la conversion de type_. Le type des objets dans le conteneur *choices* doit donc correspondre au type_ spécifié ::

source: Any sequence can be passed as the *choices* value, so :class:`list` objects, :class:`tuple` objects, and custom sequences are all supported.
fr: N'importe quel séquence peut être utilisée comme valeur de *choices*, dont les objets de type :class:`list`, :class:`set` ou des conteneurs personnalisés.

source: Use of :class:`enum.Enum` is not recommended because it is difficult to control its appearance in usage, help, and error messages.
fr: L'utilisation d':class:`enum.Enum` est déconseillée, car il est difficile de contrôler son apparence dans les messages d'usage, d'aide et d'erreur.

source: Formatted choices overrides the default *metavar* which is normally derived from *dest*. This is usually what you want because the user never sees the *dest* parameter. If this display isn't desirable (perhaps because there are many choices), just specify an explicit metavar_.
fr: Les choix formatés écrasent la valeur par défaut de *metavar* qui est normalement dérivée de *dest*. C'est en général le comportement recherché car l'utilisateur ne voit jamais le paramètre *dest*. Si cet affichage n'est pas souhaité (comme lorsque les choix sont nombreux) spécifiez simplement metavar_ de façon explicite.

source: required
fr: Le paramètre *required*

source: In general, the :mod:`argparse` module assumes that flags like ``-f`` and ``--bar`` indicate *optional* arguments, which can always be omitted at the command line. To make an option *required*, ``True`` can be specified for the ``required=`` keyword argument to :meth:`~ArgumentParser.add_argument`::
fr: En général, le module :mod:`argparse` prend pour acquis que les drapeaux comme ``-f`` et ``--bar`` annoncent un argument *optionnel* qui peut toujours être omis de la ligne de commande. Pour rendre une option *obligatoire*, ``True`` peut être passé à l'argument nommé ``required=`` d':meth:`~ArgumentParser.add_argument` ::

source: As the example shows, if an option is marked as ``required``, :meth:`~ArgumentParser.parse_args` will report an error if that option is not present at the command line.
fr: Tel qu'illustré' dans l'exemple, quand l'option est marquée comme ``required``, :meth:`~ArgumentParser.parse_args` mentionne une erreur si l'option est absente de la ligne de commande.

source: Required options are generally considered bad form because users expect *options* to be *optional*, and thus they should be avoided when possible.
fr: En général, les options obligatoires manifestent un style boiteux, car les utilisateurs s'attendent que les *options* soient *optionnelles*. Elles devraient donc être évitées si possible.

source: help
fr: Le paramètre *help*

source: The ``help`` value is a string containing a brief description of the argument. When a user requests help (usually by using ``-h`` or ``--help`` at the command line), these ``help`` descriptions will be displayed with each argument::
fr: La valeur de ``help`` est une chaîne qui contient une brève description de l'argument. Quand un utilisateur demande de l'aide (en général par l'utilisation de ``-h`` ou ``--help`` sur la ligne de commande), ces descriptions d'aide seront affichées pour chacun des arguments ::

source: The ``help`` strings can include various format specifiers to avoid repetition of things like the program name or the argument default_. The available specifiers include the program name, ``%(prog)s`` and most keyword arguments to :meth:`~ArgumentParser.add_argument`, e.g. ``%(default)s``, ``%(type)s``, etc.::
fr: La chaîne ``help`` peut contenir des spécificateurs de formatage afin d'éviter la répétition de contenu tel que le nom du programme et la valeur par défaut de l'argument (voir default_). Les spécificateurs de formatage disponibles incluent entre autres le nom du programme, ``%(prog)s``, et la plupart des arguments nommés d':meth:`~ArgumentParser.add_argument`, tels que ``%(default)s``, ``%(type)s``, etc. ::

source: As the help string supports %-formatting, if you want a literal ``%`` to appear in the help string, you must escape it as ``%%``.
fr: Comme la chaîne d'aide utilise le caractère ``%`` pour le formatage, si vous désirez afficher un ``%`` littéral dans la chaîne d'aide, vous devez en faire l’échappement avec ``%%``.

source: :mod:`argparse` supports silencing the help entry for certain options, by setting the ``help`` value to ``argparse.SUPPRESS``::
fr: :mod:`argparse` peut supprimer la rubrique d'aide de certaines options. Pour ce faire, passez ``argparse.SUPPRESS`` à ``help`` ::

source: metavar
fr: Le paramètre *metavar*

source: When :class:`ArgumentParser` generates help messages, it needs some way to refer to each expected argument. By default, ArgumentParser objects use the dest_ value as the "name" of each object. By default, for positional argument actions, the dest_ value is used directly, and for optional argument actions, the dest_ value is uppercased. So, a single positional argument with ``dest='bar'`` will be referred to as ``bar``. A single optional argument ``--foo`` that should be followed by a single command-line argument will be referred to as ``FOO``. An example::
fr: Quand un objet :class:`ArgumentParser` construit le message d'aide, il doit pouvoir faire référence à chacun des arguments attendus. Par défaut, les objets ``ArgumentParser`` utilisent la valeur de dest_ pour le nom de chaque objet. Par défaut, la valeur de dest_ est utilisée telle quelle pour les actions d'arguments positionnels et elle (dest_) est convertie en majuscules pour les actions d'arguments optionnels. Ainsi, un argument positionnel unique avec ``dest='bar'`` sera affiché comme ``bar`` et un argument positionnel unique ``--foo`` qui prend un seul argument sur la ligne de commande sera affiché comme ``FOO``. Par exemple ::

source: An alternative name can be specified with ``metavar``::
fr: Un nom alternatif peut être fourni à ``metavar`` ::

source: Note that ``metavar`` only changes the *displayed* name - the name of the attribute on the :meth:`~ArgumentParser.parse_args` object is still determined by the dest_ value.
fr: Prenez note que ``metavar`` ne change que le nom *affiché*. Le nom de l'attribut ajouté à l'objet renvoyé par :meth:`~ArgumentParser.parse_args` est toujours déterminé par la valeur de dest_.

source: Different values of ``nargs`` may cause the metavar to be used multiple times. Providing a tuple to ``metavar`` specifies a different display for each of the arguments::
fr: Certaines valeurs de ``nargs`` peuvent provoquer l'affichage de ``metavar`` plus d'une fois. Passer un *n-uplet* à ``metavar`` indique les différents noms à afficher pour chacun des arguments ::

source: dest
fr: Le paramètre *dest*

source: Most :class:`ArgumentParser` actions add some value as an attribute of the object returned by :meth:`~ArgumentParser.parse_args`. The name of this attribute is determined by the ``dest`` keyword argument of :meth:`~ArgumentParser.add_argument`. For positional argument actions, ``dest`` is normally supplied as the first argument to :meth:`~ArgumentParser.add_argument`::
fr: La plupart des actions d':class:`ArgumentParser` ajoutent une valeur dans un attribut de l'objet renvoyé par :meth:`~ArgumentParser.parse_args`. Le nom de l'attribut est déterminé par l'argument nommé ``dest`` d':meth:`~ArgumentParser.add_argument`. Pour les arguments positionnels, ``dest`` est généralement le premier argument d':meth:`~ArgumentParser.add_argument` ::

source: For optional argument actions, the value of ``dest`` is normally inferred from the option strings. :class:`ArgumentParser` generates the value of ``dest`` by taking the first long option string and stripping away the initial ``--`` string. If no long option strings were supplied, ``dest`` will be derived from the first short option string by stripping the initial ``-`` character. Any internal ``-`` characters will be converted to ``_`` characters to make sure the string is a valid attribute name. The examples below illustrate this behavior::
fr: Pour les actions d'arguments optionnels, la valeur de ``dest`` est généralement inférée à partir des chaînes d'options. :class:`ArgumentParser` génère la valeur de ``dest`` en prenant la première chaîne d'option longue et en retirant le préfixe ``--``. Si une chaîne d'option longue n'est pas fournie, ``dest`` est dérivée de la première chaîne d'option courte sans le préfixe ``-``. Tous les ``-`` subséquents seront convertis en ``_`` pour s'assurer que la chaîne est un nom d'attribut valide. Les exemples suivants illustrent ce comportement ::

source: ``dest`` allows a custom attribute name to be provided::
fr: ``dest`` vous permet de fournir un nom d'attribut personnalisé ::

source: Action classes
fr: Classes Action

source: Action classes implement the Action API, a callable which returns a callable which processes arguments from the command-line. Any object which follows this API may be passed as the ``action`` parameter to :meth:`add_argument`.
fr: Les classes ``Action`` implémentent l'API Action, un appelable qui retourne un appelable qui traite les arguments de la ligne de commande. Tout objet qui suit cette API peut être passé comme paramètre ``action`` d':meth:`add_argument`.

source: Action objects are used by an ArgumentParser to represent the information needed to parse a single argument from one or more strings from the command line. The Action class must accept the two positional arguments plus any keyword arguments passed to :meth:`ArgumentParser.add_argument` except for the ``action`` itself.
fr: Les objets ``Action`` sont utilisés par un ``ArgumentParser`` pour représenter l'information nécessaire à l'analyse d'un seul argument à partir d'une ou plusieurs chaînes de la ligne de commande. La classe ``Action`` doit accepter les deux arguments positionnels d':meth:`ArgumentParser.add_argument` ainsi que tous ses arguments nommés, sauf ``action``.

source: Instances of Action (or return value of any callable to the ``action`` parameter) should have attributes "dest", "option_strings", "default", "type", "required", "help", etc. defined. The easiest way to ensure these attributes are defined is to call ``Action.__init__``.
fr: Les instances d'``Action`` (ou la valeur de retour de l'appelable passé au paramètre ``action``) doivent définir les attributs nécessaires : *dest*, *option_strings*, *default*, *type*, *required*, *help*, etc. La façon la plus simple de s'assurer que ces attributs sont définis est d'appeler ``Action.__init__``.

source: Action instances should be callable, so subclasses must override the ``__call__`` method, which should accept four parameters:
fr: Les instances d'``Action`` doivent être appelables et donc les sous-classes doivent surcharger la méthode ``__call__``. Cette méthode doit accepter quatre paramètres :

source: ``parser`` - The ArgumentParser object which contains this action.
fr: ``parser`` – L'objet ``ArgumentParser`` qui contient cette action ;

source: ``namespace`` - The :class:`Namespace` object that will be returned by :meth:`~ArgumentParser.parse_args`. Most actions add an attribute to this object using :func:`setattr`.
fr: ``namespace`` – L'objet :class:`Namespace` qui sera renvoyé par :meth:`~ArgumentParser.parse_args`. La majorité des actions ajoutent un attribut à cet objet avec :func:`setattr` ;

source: ``values`` - The associated command-line arguments, with any type conversions applied. Type conversions are specified with the type_ keyword argument to :meth:`~ArgumentParser.add_argument`.
fr: ``values`` – Les arguments de la ligne de commande associés à l'action après les avoir soumis à la conversion de type. Les conversions de types sont spécifiées grâce à l’argument nommé type_ d':meth:`~ArgumentParser.add_argument` ;

source: ``option_string`` - The option string that was used to invoke this action. The ``option_string`` argument is optional, and will be absent if the action is associated with a positional argument.
fr: ``option_string`` – La chaîne d'option utilisée pour invoquer cette action. L'argument ``option_string`` est optionnel et est absent si l'action est associée à un argument positionnel.

source: The ``__call__`` method may perform arbitrary actions, but will typically set attributes on the ``namespace`` based on ``dest`` and ``values``.
fr: La méthode ``__call__`` peut réaliser un traitement arbitraire, mais en général elle affecte des attributs sur le ``namespace`` en fonction de ``dest`` et de ``values``.

source: Action subclasses can define a ``format_usage`` method that takes no argument and return a string which will be used when printing the usage of the program. If such method is not provided, a sensible default will be used.
fr: Les classes dérivées d'``Action`` peuvent définir une méthode ``format_usage`` qui ne prend aucun argument et qui renvoie une chaîne utilisée lors de l'affichage du message d'utilisation du programme. Si cette méthode n'est pas fournie, une valeur raisonnable est utilisée par défaut.

source: The parse_args() method
fr: La méthode *parse_args()*

source: Convert argument strings to objects and assign them as attributes of the namespace. Return the populated namespace.
fr: Convertie les chaînes d'arguments en objets et les assigne comme attributs de l'objet ``namespace``. Retourne l'objet ``namespace`` rempli.

source: Previous calls to :meth:`add_argument` determine exactly what objects are created and how they are assigned. See the documentation for :meth:`add_argument` for details.
fr: Les appels à :meth:`add_argument` qui ont été faits déterminent exactement quels objets sont créés et comment ils sont affectés. Consultez la rubrique d':meth:`add_argument` pour les détails.

source: args_ - List of strings to parse. The default is taken from :data:`sys.argv`.
fr: args_ – Liste de chaînes à analyser. La valeur par défaut est récupérée dans : :data:`sys.argv`.

source: namespace_ - An object to take the attributes. The default is a new empty :class:`Namespace` object.
fr: namespace_ – Un objet pour recevoir les attributs. Par défaut : une nouvelle instance (vide) de :class:`Namespace`.

source: Option value syntax
fr: Syntaxe de la valeur des options

source: The :meth:`~ArgumentParser.parse_args` method supports several ways of specifying the value of an option (if it takes one). In the simplest case, the option and its value are passed as two separate arguments::
fr: La méthode :meth:`~ArgumentParser.parse_args` offre plusieurs façons d'indiquer la valeur d'une option si elle en prend une. Dans le cas le plus simple, l'option et sa valeur sont passées en tant que deux arguments distincts ::

source: For long options (options with names longer than a single character), the option and value can also be passed as a single command-line argument, using ``=`` to separate them::
fr: Pour les options longues (les options qui ont un nom plus long qu'un seul caractère), l'option et sa valeur peuvent être passées comme un seul argument de la ligne de commande en utilisant ``=`` comme séparateur ::

source: For short options (options only one character long), the option and its value can be concatenated::
fr: Pour les options courtes (les options qui utilisent un seul caractère), l'option et sa valeur peuvent être concaténées ::

source: Several short options can be joined together, using only a single ``-`` prefix, as long as only the last option (or none of them) requires a value::
fr: Plusieurs options courtes peuvent être groupées ensemble après un seul préfixe ``-`` pour autant que seule la dernière (ou aucune) nécessite une valeur ::

source: Invalid arguments
fr: Arguments invalides

source: While parsing the command line, :meth:`~ArgumentParser.parse_args` checks for a variety of errors, including ambiguous options, invalid types, invalid options, wrong number of positional arguments, etc. When it encounters such an error, it exits and prints the error along with a usage message::
fr: Quand elle fait l'analyse de la ligne de commande, la méthode :meth:`~ArgumentParser.parse_args` vérifie plusieurs erreurs possibles : entre autres, options ambigües, types invalides, options invalides, nombre incorrect d'arguments positionnels, etc. Quand une erreur est rencontrée, elle affiche l'erreur accompagnée du message d'aide puis termine l'exécution ::

source: Arguments containing ``-``
fr: Arguments contenant ``-``

source: The :meth:`~ArgumentParser.parse_args` method attempts to give errors whenever the user has clearly made a mistake, but some situations are inherently ambiguous. For example, the command-line argument ``-1`` could either be an attempt to specify an option or an attempt to provide a positional argument. The :meth:`~ArgumentParser.parse_args` method is cautious here: positional arguments may only begin with ``-`` if they look like negative numbers and there are no options in the parser that look like negative numbers::
fr: La méthode :meth:`~ArgumentParser.parse_args` tente de signaler une erreur quand l'utilisateur s'est clairement trompé. Par contre, certaines situations sont intrinsèquement ambigües. Par exemple, l'argument de la ligne de commande ``-1`` peut aussi bien être une tentative de spécifier une option qu'une tentative de passer un argument positionnel. La méthode :meth:`~ArgumentParser.parse_args` est prudente : les arguments positionnels ne peuvent commencer par ``-`` que s'ils ont l'apparence d'un nombre négatif et que l'analyseur ne contient aucune option qui a l'apparence d'un nombre négatif ::

source: If you have positional arguments that must begin with ``-`` and don't look like negative numbers, you can insert the pseudo-argument ``'--'`` which tells :meth:`~ArgumentParser.parse_args` that everything after that is a positional argument::
fr: Si l'utilisateur a des arguments positionnels qui commencent par ``-`` et qui n'ont pas l'apparence d'un nombre négatif, il peut insérer le pseudo-argument ``'--'`` qui indique à :meth:`~ArgumentParser.parse_args` de traiter tout ce qui suit comme un argument positionnel ::

source: Argument abbreviations (prefix matching)
fr: Arguments abrégés (Par comparaison de leurs préfixes)

source: The :meth:`~ArgumentParser.parse_args` method :ref:`by default <allow_abbrev>` allows long options to be abbreviated to a prefix, if the abbreviation is unambiguous (the prefix matches a unique option)::
fr: Par défaut, la méthode :meth:`~ArgumentParser.parse_args` accepte que les options longues soient :ref:`abrégées <allow_abbrev>` par un préfixe pour autant que l’abréviation soit non-ambigüe, c'est-à-dire qu'elle ne corresponde qu'à une seule option ::

source: An error is produced for arguments that could produce more than one options. This feature can be disabled by setting :ref:`allow_abbrev` to ``False``.
fr: Une erreur est générée pour les arguments qui peuvent produire plus d'une option. Ce comportement peut être désactivé en passant ``False`` à :ref:`allow_abbrev`.

source: Beyond ``sys.argv``
fr: Au-delà de ``sys.argv``

source: Sometimes it may be useful to have an ArgumentParser parse arguments other than those of :data:`sys.argv`. This can be accomplished by passing a list of strings to :meth:`~ArgumentParser.parse_args`. This is useful for testing at the interactive prompt::
fr: Il est parfois désirable de demander à un objet ``ArgumentParser`` de faire l'analyse d'arguments autres que ceux de :data:`sys.argv`. On peut faire ce traitement en passant une liste de chaînes à :meth:`~ArgumentParser.parse_args`. Cette approche est pratique pour faire des tests depuis l'invite de commande ::

source: The Namespace object
fr: L'objet ``Namespace``
