Repository: python/python-docs-fr
Catalog: library/argparse.po
Languages: fr

source: :meth:`~ArgumentParser.parse_known_intermixed_args` returns a two item tuple containing the populated namespace and the list of remaining argument strings. :meth:`~ArgumentParser.parse_intermixed_args` raises an error if there are any remaining unparsed argument strings.
fr: :meth:`~ArgumentParser.parse_known_intermixed_args` renvoie une paire de valeurs : l'objet ``Namespace`` rempli et une liste de chaînes d'arguments non-traités. :meth:`~ArgumentParser.parse_intermixed_args` lève une erreur s'il reste des chaînes d'arguments non-traités.

source: Upgrading optparse code
fr: Mettre à jour du code ``optparse``

source: Originally, the :mod:`argparse` module had attempted to maintain compatibility with :mod:`optparse`. However, :mod:`optparse` was difficult to extend transparently, particularly with the changes required to support the new ``nargs=`` specifiers and better usage messages. When most everything in :mod:`optparse` had either been copy-pasted over or monkey-patched, it no longer seemed practical to try to maintain the backwards compatibility.
fr: Initialement, le module :mod:`argparse` tentait de rester compatible avec :mod:`optparse`. Hélas, il était difficile de faire des améliorations à :mod:`optparse` de façon transparente, en particulier pour les changements requis pour gérer les nouveaux spécificateurs de ``nargs=`` et les messages d'utilisation améliorés. Après avoir porté ou surchargé tout le code d':mod:`optparse`, la rétro-compatibilité pouvait difficilement être conservée.

source: The :mod:`argparse` module improves on the standard library :mod:`optparse` module in a number of ways including:
fr: Le module :mod:`argparse` fournit plusieurs améliorations par rapport au module :mod:`optparse` de la bibliothèque standard :

source: Handling positional arguments.
fr: Gère les arguments positionnels ;

source: Supporting sub-commands.
fr: Prise en charge des sous commandes ;

source: Allowing alternative option prefixes like ``+`` and ``/``.
fr: Permet d'utiliser les alternatives ``+`` ou ``/`` comme préfixes d'option ;

source: Handling zero-or-more and one-or-more style arguments.
fr: Prend en charge la répétition de valeurs (zéro ou plus, un ou plus) ;

source: Producing more informative usage messages.
fr: Fournit des messages d'aide plus complets ;

source: Providing a much simpler interface for custom ``type`` and ``action``.
fr: Fournit une interface plus simple pour les types et les actions personnalisés.

source: A partial upgrade path from :mod:`optparse` to :mod:`argparse`:
fr: Le portage partiel d':mod:`optparse` à :mod:`argparse` :

source: Replace all :meth:`optparse.OptionParser.add_option` calls with :meth:`ArgumentParser.add_argument` calls.
fr: Remplacer tous les appels à :meth:`optparse.OptionParser.add_option` par des appels à :meth:`ArgumentParser.add_argument` ;

source: Replace ``(options, args) = parser.parse_args()`` with ``args = parser.parse_args()`` and add additional :meth:`ArgumentParser.add_argument` calls for the positional arguments. Keep in mind that what was previously called ``options``, now in the :mod:`argparse` context is called ``args``.
fr: Remplacer ``(options, args) = parser.parse_args()`` par ``args = parser.parse_args()`` et ajouter des appels à :meth:`ArgumentParser.add_argument` pour les arguments positionnels. Prenez note que les valeurs précédemment appelées ``options`` sont appelées ``args`` dans le contexte d':mod:`argparse` ;

source: Replace :meth:`optparse.OptionParser.disable_interspersed_args` by using :meth:`~ArgumentParser.parse_intermixed_args` instead of :meth:`~ArgumentParser.parse_args`.
fr: Remplacer :meth:`optparse.OptionParser.disable_interspersed_args` en appelant :meth:`~ArgumentParser.parse_intermixed_args` plutôt que :meth:`~ArgumentParser.parse_args` ;

source: Replace callback actions and the ``callback_*`` keyword arguments with ``type`` or ``action`` arguments.
fr: Remplacer les actions de rappel (*callback actions* en anglais) et les arguments nommés ``callback_*`` par des arguments ``type`` et ``actions`` ;

source: Replace string names for ``type`` keyword arguments with the corresponding type objects (e.g. int, float, complex, etc).
fr: Remplacer les chaînes représentant le nom des types pour l'argument nommé ``type`` par les objets types correspondants (par exemple : ``int``, ``float``, ``complex``, etc) ;

source: Replace :class:`optparse.Values` with :class:`Namespace` and :exc:`optparse.OptionError` and :exc:`optparse.OptionValueError` with :exc:`ArgumentError`.
fr: Remplacer :class:`optparse.Values` par :class:`Namespace` ; et :exc:`optparse.OptionError` et :exc:`optparse.OptionValueError` par :exc:`ArgumentError` ;

source: Replace strings with implicit arguments such as ``%default`` or ``%prog`` with the standard Python syntax to use dictionaries to format strings, that is, ``%(default)s`` and ``%(prog)s``.
fr: Remplacer les chaînes avec des arguments de formatage implicite (tels que ``%default`` ou ``%prog``) par la syntaxe standard de Python pour l'interpolation d'un dictionnaire dans les chaînes de formatage (c'est-à-dire ``%(default)s`` et ``%(prog)s``) ;

source: Replace the OptionParser constructor ``version`` argument with a call to ``parser.add_argument('--version', action='version', version='<the version>')``.
fr: Remplacer l'argument ``version`` du constructeur d'``OptionParser`` par un appel à ``parser.add_argument('--version', action='version', version='<la version>')``.
