Repository: python/python-docs-fr
Catalog: library/asyncio-task.po
Languages: fr

source: Coroutines and Tasks
fr: Coroutines et tâches

source: This section outlines high-level asyncio APIs to work with coroutines and Tasks.
fr: Cette section donne un aperçu des API de haut-niveau du module *asyncio* pour utiliser les coroutines et les tâches.

source: **Source code:** :source:`Lib/asyncio/coroutines.py`
fr: **Code source :** :source:`Lib/asyncio/coroutines.py`

source: :term:`Coroutines <coroutine>` declared with the async/await syntax is the preferred way of writing asyncio applications. For example, the following snippet of code prints "hello", waits 1 second, and then prints "world"::
fr: Les :term:`coroutines <coroutine>` déclarées avec la syntaxe *async/await* sont la manière privilégiée d’écrire des applications asynchrones. Par exemple, l’extrait de code suivant affiche « hello », attend une seconde et affiche ensuite « world » ::

source: Note that simply calling a coroutine will not schedule it to be executed::
fr: Remarquez que simplement appeler une coroutine ne la planifie pas pour exécution ::

source: To actually run a coroutine, asyncio provides the following mechanisms:
fr: Pour réellement exécuter une coroutine, *asyncio* fournit les mécanismes suivants :

source: The :func:`asyncio.run` function to run the top-level entry point "main()" function (see the above example.)
fr: La fonction :func:`asyncio.run` pour exécuter la fonction « main() », le point d'entrée de haut-niveau (voir l'exemple ci-dessus).

source: Awaiting on a coroutine. The following snippet of code will print "hello" after waiting for 1 second, and then print "world" after waiting for *another* 2 seconds::
fr: Attendre une coroutine. Le morceau de code suivant attend une seconde, affiche « hello », attend 2 secondes *supplémentaires*, puis affiche enfin « world » ::

source: Expected output::
fr: Sortie attendue ::

source: The :func:`asyncio.create_task` function to run coroutines concurrently as asyncio :class:`Tasks <Task>`.
fr: La fonction :func:`asyncio.create_task` pour exécuter de manière concurrente des coroutines en tant que :class:`tâches <Task>` *asyncio*.

source: Let's modify the above example and run two ``say_after`` coroutines *concurrently*::
fr: Modifions l'exemple ci-dessus et lançons deux coroutines ``say_after`` *de manière concurrente* ::

source: Note that expected output now shows that the snippet runs 1 second faster than before::
fr: La sortie attendue montre à présent que ce code s'exécute une seconde plus rapidement que le précédent ::

source: The :class:`asyncio.TaskGroup` class provides a more modern alternative to :func:`create_task`. Using this API, the last example becomes::
fr: La classe :class:`asyncio.TaskGroup` fournit une alternative plus moderne à :func:`create_task`. En utilisant cette API, le dernier exemple devient ::

source: The timing and output should be the same as for the previous version.
fr: Le temps d'exécution et la sortie doivent être les mêmes que pour la version précédente.

source: Awaitables
fr: *Attendables*

source: We say that an object is an **awaitable** object if it can be used in an :keyword:`await` expression. Many asyncio APIs are designed to accept awaitables.
fr: Un objet est dit *attendable* (*awaitable* en anglais, c.-à-d. qui peut être attendu) s'il peut être utilisé dans une expression :keyword:`await`. Beaucoup d'API d'*asyncio* sont conçues pour accepter des *attendables*.

source: There are three main types of *awaitable* objects: **coroutines**, **Tasks**, and **Futures**.
fr: Il existe trois types principaux d'*attendables* : les **coroutines**, les **tâches** et les **futurs**.

source: Python coroutines are *awaitables* and therefore can be awaited from other coroutines::
fr: Les coroutines sont des *awaitables* et peuvent donc être attendues par d'autres coroutines ::

source: In this documentation the term "coroutine" can be used for two closely related concepts:
fr: dans cette documentation, le terme « coroutine » est utilisé pour désigner deux concepts voisins :

source: a *coroutine function*: an :keyword:`async def` function;
fr: une *fonction coroutine* : une fonction :keyword:`async def` ;

source: a *coroutine object*: an object returned by calling a *coroutine function*.
fr: un *objet coroutine* : un objet renvoyé par une *fonction coroutine*.

source: Tasks
fr: Tâches

source: *Tasks* are used to schedule coroutines *concurrently*.
fr: Les *tâches* servent à planifier des coroutines de façon à ce qu'elles s'exécutent de manière concurrente.

source: When a coroutine is wrapped into a *Task* with functions like :func:`asyncio.create_task` the coroutine is automatically scheduled to run soon::
fr: Lorsqu'une coroutine est encapsulée dans une *tâche* à l'aide de fonctions comme :func:`asyncio.create_task`, la coroutine est automatiquement planifiée pour s'exécuter prochainement ::

source: Futures
fr: Futurs

source: A :class:`Future` is a special **low-level** awaitable object that represents an **eventual result** of an asynchronous operation.
fr: Un :class:`Future` est un objet *attendable* spécial de **bas-niveau**, qui représente le **résultat final** d'une opération asynchrone.

source: When a Future object is *awaited* it means that the coroutine will wait until the Future is resolved in some other place.
fr: Quand un objet *Future* est *attendu*, cela signifie que la coroutine attendra que ce futur soit résolu à un autre endroit.

source: Future objects in asyncio are needed to allow callback-based code to be used with async/await.
fr: Les objets *Future* d'*asyncio* sont nécessaires pour permettre l'exécution de code basé sur les fonctions de rappel avec la syntaxe *async* / *await*.

source: Normally **there is no need** to create Future objects at the application level code.
fr: Il est normalement **inutile** de créer des objets *Future* dans la couche applicative du code.

source: Future objects, sometimes exposed by libraries and some asyncio APIs, can be awaited::
fr: Les objets *Future*, parfois exposés par des bibliothèques et quelques API d'*asyncio*, peuvent être attendus ::

source: A good example of a low-level function that returns a Future object is :meth:`loop.run_in_executor`.
fr: :meth:`loop.run_in_executor` est l'exemple typique d'une fonction bas-niveau renvoyant un objet *Future*.

source: Creating Tasks
fr: Création de tâches

source: **Source code:** :source:`Lib/asyncio/tasks.py`
fr: **Code source :** :source:`Lib/asyncio/tasks.py`

source: Wrap the *coro* :ref:`coroutine <coroutine>` into a :class:`Task` and schedule its execution. Return the Task object.
fr: Encapsule la :ref:`coroutine <coroutine>` *coro* dans une tâche et la planifie pour exécution. Renvoie l'objet :class:`Task`.

source: If *name* is not ``None``, it is set as the name of the task using :meth:`Task.set_name`.
fr: Si *name* n’est pas ``None``, il est défini comme le nom de la tâche en utilisant :meth:`Task.set_name`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *coro* to run in. The current context copy is created when no *context* is provided.
fr: L'argument (uniquement nommé) facultatif *context* permet de spécifier un :class:`contextvars.Context` personnalisé pour la coroutine à exécuter. La copie de contexte actuelle est créée lorsqu'aucun *context* n'est fourni.

source: The task is executed in the loop returned by :func:`get_running_loop`, :exc:`RuntimeError` is raised if there is no running loop in current thread.
fr: La tâche est exécutée dans la boucle renvoyée par :func:`get_running_loop` ; :exc:`RuntimeError` est levée s'il n'y a pas de boucle en cours d'exécution dans le fil actuel.

source: Save a reference to the result of this function, to avoid a task disappearing mid-execution. The event loop only keeps weak references to tasks. A task that isn't referenced elsewhere may get garbage collected at any time, even before it's done. For reliable "fire-and-forget" background tasks, gather them in a collection::
fr: gardez une référence au résultat de cette fonction, pour éviter qu'une tâche ne disparaisse en cours d'exécution. La boucle d'événements ne conserve que les références faibles aux tâches. Une tâche qui n'est pas référencée ailleurs peut être supprimée par le ramasse-miettes à tout moment, même avant qu'elle ne soit terminée. Pour créer des tâches d'arrière-plan fiables de type « lance et oublie », rassemblez-les dans une collection ::

source: Added the *name* parameter.
fr: ajout du paramètre *name*.

source: Added the *context* parameter.
fr: ajout du paramètre *context*.

source: Task Cancellation
fr: Annulation de tâche

source: Tasks can easily and safely be cancelled. When a task is cancelled, :exc:`asyncio.CancelledError` will be raised in the task at the next opportunity.
fr: Les tâches peuvent être annulées facilement et en toute sécurité. Lorsqu'une tâche est annulée, :exc:`asyncio.CancelledError` est levée dans la tâche à la première occasion.

source: It is recommended that coroutines use ``try/finally`` blocks to robustly perform clean-up logic. In case :exc:`asyncio.CancelledError` is explicitly caught, it should generally be propagated when clean-up is complete. :exc:`asyncio.CancelledError` directly subclasses :exc:`BaseException` so most code will not need to be aware of it.
fr: Il est recommandé que les coroutines utilisent des blocs ``try/finally`` pour exécuter de manière robuste la logique de nettoyage. Dans le cas où :exc:`asyncio.CancelledError` est explicitement interceptée, elle devrait généralement être propagée lorsque le nettoyage est terminé. :exc:`asyncio.CancelledError` sous-classe directement :exc:`BaseException` donc la plupart du code n'a pas besoin d'en être conscient.

source: The asyncio components that enable structured concurrency, like :class:`asyncio.TaskGroup` and :func:`asyncio.timeout`, are implemented using cancellation internally and might misbehave if a coroutine swallows :exc:`asyncio.CancelledError`. Similarly, user code should not generally call :meth:`uncancel <asyncio.Task.uncancel>`. However, in cases when suppressing :exc:`asyncio.CancelledError` is truly desired, it is necessary to also call ``uncancel()`` to completely remove the cancellation state.
fr: Les composants *asyncio* qui permettent la concurrence structurée, comme :class:`asyncio.TaskGroup` et :func:`asyncio.timeout`, sont implémentés en utilisant l'annulation en interne et peuvent mal se comporter si une coroutine ne propage pas :exc:`asyncio.CancelledError`. De même, le code utilisateur ne doit généralement pas appeler :meth:`uncancel<asyncio.Task.uncancel>`. Cependant, dans les cas où la suppression de :exc:`asyncio.CancelledError` est vraiment souhaitée, il est également nécessaire d'appeler ``uncancel()`` pour supprimer complètement l'état d'annulation.

source: Task Groups
fr: Groupes de tâches

source: Task groups combine a task creation API with a convenient and reliable way to wait for all tasks in the group to finish.
fr: Les groupes de tâches combinent une API de création de tâches avec un moyen pratique et fiable d'attendre la fin de toutes les tâches du groupe.

source: An :ref:`asynchronous context manager <async-context-managers>` holding a group of tasks. Tasks can be added to the group using :meth:`create_task`. All tasks are awaited when the context manager exits.
fr: :ref:`Gestionnaire de contexte asynchrone <async-context-managers>` responsable d’un groupe de tâches. Des tâches peuvent être ajoutées au groupe en utilisant :meth:`create_task`. Toutes les tâches sont attendues à la sortie du gestionnaire de contexte.

source: Example::
fr: Exemple ::

source: The ``async with`` statement will wait for all tasks in the group to finish. While waiting, new tasks may still be added to the group (for example, by passing ``tg`` into one of the coroutines and calling ``tg.create_task()`` in that coroutine). Once the last task has finished and the ``async with`` block is exited, no new tasks may be added to the group.
fr: L'instruction ``async with`` attend la fin de toutes les tâches du groupe. Lors de l'attente, de nouvelles tâches peuvent encore être ajoutées au groupe (par exemple, en passant ``tg`` dans l'une des coroutines et en appelant ``tg.create_task()`` dans cette coroutine). Une fois que la dernière tâche est terminée et que le bloc ``async with`` est quitté, aucune nouvelle tâche ne peut être ajoutée au groupe.

source: The first time any of the tasks belonging to the group fails with an exception other than :exc:`asyncio.CancelledError`, the remaining tasks in the group are cancelled. No further tasks can then be added to the group. At this point, if the body of the ``async with`` statement is still active (i.e., :meth:`~object.__aexit__` hasn't been called yet), the task directly containing the ``async with`` statement is also cancelled. The resulting :exc:`asyncio.CancelledError` will interrupt an ``await``, but it will not bubble out of the containing ``async with`` statement.
fr: La première fois que l'une des tâches appartenant au groupe échoue avec une exception autre que :exc:`asyncio.CancelledError`, les tâches restantes du groupe sont annulées. Aucune autre tâche ne peut alors être ajoutée au groupe. À ce stade, si le corps de l'instruction ``async with`` est toujours actif (par exemple, :meth:`~object.__aexit__` n'a pas encore été appelé), la tâche contenant directement l'instruction ``async with`` est également annulée. Le résultat :exc:`asyncio.CancelledError` interrompt un ``await``, mais il ne sort pas de l'instruction ``async with`` englobante.

source: Once all tasks have finished, if any tasks have failed with an exception other than :exc:`asyncio.CancelledError`, those exceptions are combined in an :exc:`ExceptionGroup` or :exc:`BaseExceptionGroup` (as appropriate; see their documentation) which is then raised.
fr: Une fois toutes les tâches terminées, si des tâches ont échoué avec une exception autre que :exc:`asyncio.CancelledError`, ces exceptions sont combinées dans un :exc:`ExceptionGroup` ou :exc:`BaseExceptionGroup` (selon le cas ; voir leur documentation) qui est ensuite levé.

source: Two base exceptions are treated specially: If any task fails with :exc:`KeyboardInterrupt` or :exc:`SystemExit`, the task group still cancels the remaining tasks and waits for them, but then the initial :exc:`KeyboardInterrupt` or :exc:`SystemExit` is re-raised instead of :exc:`ExceptionGroup` or :exc:`BaseExceptionGroup`.
fr: Deux exceptions de base sont traitées spécialement : si une tâche échoue avec :exc:`KeyboardInterrupt` ou :exc:`SystemExit`, le groupe de tâches annule toujours les tâches restantes et les attend, mais alors la :exc:`KeyboardInterrupt` ou la :exc:`SystemExit` initiale est levée à nouveau au lieu de :exc:`ExceptionGroup` ou :exc:`BaseExceptionGroup`.

source: If the body of the ``async with`` statement exits with an exception (so :meth:`~object.__aexit__` is called with an exception set), this is treated the same as if one of the tasks failed: the remaining tasks are cancelled and then waited for, and non-cancellation exceptions are grouped into an exception group and raised. The exception passed into :meth:`~object.__aexit__`, unless it is :exc:`asyncio.CancelledError`, is also included in the exception group. The same special case is made for :exc:`KeyboardInterrupt` and :exc:`SystemExit` as in the previous paragraph.
fr: Si le corps de l'instruction ``async with`` se termine avec une exception (donc :meth:`~object.__aexit__` est appelé avec un ensemble d'exceptions), cela est traité de la même manière que si l'une des tâches échouait : les tâches restantes sont annulées puis attendues, et les exceptions de non-annulation sont regroupées dans un groupe d'exceptions et levées. L'exception transmise à :meth:`~object.__aexit__`, à moins qu'il ne s'agisse de :exc:`asyncio.CancelledError`, est également incluse dans le groupe d'exceptions. Le même cas spécial concerne :exc:`KeyboardInterrupt` et :exc:`SystemExit` comme dans le paragraphe précédent.

source: Sleeping
fr: Attente

source: Block for *delay* seconds.
fr: Attend pendant *delay* secondes.

source: If *result* is provided, it is returned to the caller when the coroutine completes.
fr: Si *result* est spécifié, il est renvoyé à l'appelant quand la coroutine se termine.

source: ``sleep()`` always suspends the current task, allowing other tasks to run.
fr: ``sleep()`` suspend systématiquement la tâche courante, ce qui permet aux autres tâches de s'exécuter.

source: Setting the delay to 0 provides an optimized path to allow other tasks to run. This can be used by long-running functions to avoid blocking the event loop for the full duration of the function call.
fr: Définir le délai sur 0 fournit un chemin optimisé pour permettre à d'autres tâches de s'exécuter. Cela peut être utilisé par les fonctions de longue durée pour éviter de bloquer la boucle d'événements pendant toute la durée de l'appel de fonction.

source: Example of coroutine displaying the current date every second for 5 seconds::
fr: Exemple d'une coroutine affichant la date toutes les secondes pendant 5 secondes ::

source: Removed the *loop* parameter.
fr: le paramètre *loop* a été enlevé.

source: Running Tasks Concurrently
fr: Exécution de tâches de manière concurrente

source: Run :ref:`awaitable objects <asyncio-awaitables>` in the *aws* sequence *concurrently*.
fr: Exécute les objets :ref:`awaitable <asyncio-awaitables>` de la séquence *aws*, *de manière concurrente*.

source: If any awaitable in *aws* is a coroutine, it is automatically scheduled as a Task.
fr: Si un *attendable* de *aws* est une coroutine, celui-ci est automatiquement planifié comme une tâche *Task*.

source: If all awaitables are completed successfully, the result is an aggregate list of returned values. The order of result values corresponds to the order of awaitables in *aws*.
fr: Si tous les *awaitables* s'achèvent avec succès, le résultat est la liste des valeurs renvoyées. L'ordre de cette liste correspond à l'ordre des *awaitables* dans *aws*.

source: If *return_exceptions* is ``False`` (default), the first raised exception is immediately propagated to the task that awaits on ``gather()``. Other awaitables in the *aws* sequence **won't be cancelled** and will continue to run.
fr: Si *return_exceptions* vaut ``False`` (valeur par défaut), la première exception levée est immédiatement propagée vers la tâche en attente dans le ``gather()``. Les autres *attendables* dans la séquence *aws* **ne sont pas annulés** et poursuivent leur exécution.

source: If *return_exceptions* is ``True``, exceptions are treated the same as successful results, and aggregated in the result list.
fr: Si *return_exceptions* vaut ``True``, les exceptions sont traitées de la même manière que les exécutions normales, et incluses dans la liste des résultats.

source: If ``gather()`` is *cancelled*, all submitted awaitables (that have not completed yet) are also *cancelled*.
fr: Si ``gather()`` est *annulé*, tous les *awaitables* en cours (ceux qui n'ont pas encore fini de s'exécuter) sont également *annulés*.

source: If any Task or Future from the *aws* sequence is *cancelled*, it is treated as if it raised :exc:`CancelledError` -- the ``gather()`` call is **not** cancelled in this case. This is to prevent the cancellation of one submitted Task/Future to cause other Tasks/Futures to be cancelled.
fr: Si n'importe quel *Task* ou *Future* de la séquence *aws* est *annulé*, il est traité comme s'il avait levé :exc:`CancelledError` — l'appel à ``gather()`` n'est alors **pas** annulé. Ceci permet d'empêcher que l'annulation d'une tâche ou d'un futur entraîne l'annulation des autres tâches ou futurs.

source: If the *gather* itself is cancelled, the cancellation is propagated regardless of *return_exceptions*.
fr: Si *gather* est lui-même annulé, l'annulation est propagée indépendamment de *return_exceptions*.

source: Deprecation warning is emitted if no positional arguments are provided or not all positional arguments are Future-like objects and there is no running event loop.
fr: Un avertissement d'obsolescence est émis si aucun argument positionnel n'est fourni ou si tous les arguments positionnels ne sont pas des objets de type Future et qu'il n'y a pas de boucle d'événements en cours d'exécution.

source: Shielding From Cancellation
fr: Protection contre l'annulation

source: Protect an :ref:`awaitable object <asyncio-awaitables>` from being :meth:`cancelled <Task.cancel>`.
fr: Empêche qu'un objet :ref:`awaitable <asyncio-awaitables>` puisse être :meth:`annulé <Task.cancel>`.

source: If *aw* is a coroutine it is automatically scheduled as a Task.
fr: Si *aw* est une coroutine, elle est planifiée automatiquement comme une tâche.

source: The statement::
fr: L'instruction ::

source: is equivalent to::
fr: est équivalente à ::

source: *except* that if the coroutine containing it is cancelled, the Task running in ``something()`` is not cancelled. From the point of view of ``something()``, the cancellation did not happen. Although its caller is still cancelled, so the "await" expression still raises a :exc:`CancelledError`.
fr: *à la différence près* que, si la coroutine qui la contient est annulée, la tâche s'exécutant dans ``something()`` n'est pas annulée. Du point de vue de ``something()``, il n'y a pas eu d'annulation. Cependant, son appelant est bien annulé, donc l'expression *await* lève bien une :exc:`CancelledError`.

source: If ``something()`` is cancelled by other means (i.e. from within itself) that would also cancel ``shield()``.
fr: Si ``something()`` est annulée d'une autre façon (c.-à-d. depuis elle-même) ceci annule également ``shield()``.

source: If it is desired to completely ignore cancellation (not recommended) the ``shield()`` function should be combined with a try/except clause, as follows::
fr: Pour ignorer complètement l'annulation (déconseillé), la fonction ``shield()`` peut être combinée à une clause *try* / *except*, comme dans le code ci-dessous ::

source: Save a reference to tasks passed to this function, to avoid a task disappearing mid-execution. The event loop only keeps weak references to tasks. A task that isn't referenced elsewhere may get garbage collected at any time, even before it's done.
fr: sauvegardez une référence aux tâches passées à cette fonction, pour éviter qu'une tâche ne disparaisse en cours d'exécution. La boucle d'événements ne conserve que les références faibles aux tâches. Une tâche qui n'est pas référencée ailleurs peut faire l'objet d'une suppression par le ramasse-miettes à tout moment, même avant qu'elle ne soit terminée.

source: Deprecation warning is emitted if *aw* is not Future-like object and there is no running event loop.
fr: un avertissement d'obsolescence est émis si *aw* n'est pas un objet de type *future* et qu'il n'y a pas de boucle d'événement en cours d'exécution.

source: Timeouts
fr: Délais d'attente

source: *delay* can either be ``None``, or a float/int number of seconds to wait. If *delay* is ``None``, no time limit will be applied; this can be useful if the delay is unknown when the context manager is created.
fr: *delay* peut-être soit ``None``, soit le nombre de secondes (entier ou décimal) d'attente. Si *delay* vaut ``None``, aucune limite n'est appliquée ; cela peut être utile lorsque le délai d'attente est inconnu au moment de la création du gestionnaire de contexte.

source: In either case, the context manager can be rescheduled after creation using :meth:`Timeout.reschedule`.
fr: Dans les deux cas, le gestionnaire de contexte peut être redéfini après sa création en utilisant :meth:`Timeout.reschedule`.
