Repository: python/python-docs-fr
Catalog: library/asyncio-future.po
Languages: fr

source: **Source code:** :source:`Lib/asyncio/futures.py`, :source:`Lib/asyncio/base_futures.py`
fr: **Code source :** :source:`Lib/asyncio/futures.py`, :source:`Lib/asyncio/base_futures.py`

source: *Future* objects are used to bridge **low-level callback-based code** with high-level async/await code.
fr: Les objets *Future* sont utilisés comme passerelles entre du **code bas niveau basé sur des fonctions de rappel** et du code haut niveau utilisant *async* et *await*.

source: Future Functions
fr: Fonctions pour *Future*

source: Return ``True`` if *obj* is either of:
fr: Renvoie ``True`` si *obj* est soit :

source: an instance of :class:`asyncio.Future`,
fr: une instance de :class:`asyncio.Future` ;

source: an instance of :class:`asyncio.Task`,
fr: une instance de :class:`asyncio.Task` ;

source: a Future-like object with a ``_asyncio_future_blocking`` attribute.
fr: un objet se comportant comme *Future* et possédant un attribut ``_asyncio_future_blocking``.

source: Return:
fr: Renvoie :

source: *obj* argument as is, if *obj* is a :class:`Future`, a :class:`Task`, or a Future-like object (:func:`isfuture` is used for the test.)
fr: l'objet *obj* tel quel si c'est un objet :class:`Future`, :class:`Task` ou se comportant comme un *Future*. :func:`isfuture` est utilisée pour le test ;

source: a :class:`Task` object wrapping *obj*, if *obj* is a coroutine (:func:`iscoroutine` is used for the test); in this case the coroutine will be scheduled by ``ensure_future()``.
fr: un objet :class:`Task` encapsulant *obj* si ce dernier est une coroutine (:func:`iscoroutine` est utilisée pour le test). Dans ce cas, l’exécution de la coroutine sera planifiée par ``ensure_future()`` ;

source: a :class:`Task` object that would await on *obj*, if *obj* is an awaitable (:func:`inspect.isawaitable` is used for the test.)
fr: un objet :class:`Task` qui attendra (*await*) *obj* si ce dernier peut être attendu (*awaitable*). :func:`iscoroutine` est utilisée pour le test.

source: If *obj* is neither of the above a :exc:`TypeError` is raised.
fr: Si *obj* ne correspond à aucun des critères ci-dessus, une exception :exc:`TypeError` est levée.

source: See also the :func:`create_task` function which is the preferred way for creating new Tasks.
fr: Voir aussi la fonction :func:`create_task` qui est la manière privilégiée pour créer des nouvelles tâches.

source: The function accepts any :term:`awaitable` object.
fr: La fonction accepte n'importe quel objet :term:`awaitable`.

source: Deprecation warning is emitted if *obj* is not a Future-like object and *loop* is not specified and there is no running event loop.
fr: Un ``DeprecationWarning`` est levé si *obj* n'est pas un objet se comportant comme un *Future*, si *loop* n'est pas spécifié et s'il n'y a pas de boucle d'évènements en cours d'exécution.

source: Wrap a :class:`concurrent.futures.Future` object in a :class:`asyncio.Future` object.
fr: Encapsule un objet :class:`concurrent.futures.Future` dans un objet :class:`asyncio.Future`.

source: Deprecation warning is emitted if *future* is not a Future-like object and *loop* is not specified and there is no running event loop.
fr: Un ``DeprecationWarning`` est levé si *future* n'est pas un objet se comportant comme un *Future*, si *loop* n'est pas spécifié et s'il n'y a pas de boucle d'évènements en cours d'exécution.

source: Future Object
fr: Objet *Future*

source: A Future represents an eventual result of an asynchronous operation. Not thread-safe.
fr: Un *Future* représente le résultat final d'une opération asynchrone. Il n'est pas conçu pour pouvoir être utilisé par plusieurs fils d'exécution.

source: Typically Futures are used to enable low-level callback-based code (e.g. in protocols implemented using asyncio :ref:`transports <asyncio-transports-protocols>`) to interoperate with high-level async/await code.
fr: Les *Futures* sont habituellement utilisés pour permettre à du code bas niveau basé sur des fonctions de rappel (par exemple : les protocoles utilisant *asyncio* :ref:`transports <asyncio-transports-protocols>`) d'interagir avec du code haut niveau utilisant *async* et *await*.

source: The rule of thumb is to never expose Future objects in user-facing APIs, and the recommended way to create a Future object is to call :meth:`loop.create_future`. This way alternative event loop implementations can inject their own optimized implementations of a Future object.
fr: Une bonne règle empirique est de ne jamais exposer des objets *Future* dans des *API* destinées à l'utilisateur. La façon privilégiée de créer des objets *Future* est d'appeler la méthode :meth:`loop.create_future`. Cela permet aux implémentations alternatives de la boucle d'évènements d'utiliser leur propre implémentation de l'objet *Future*.

source: Added support for the :mod:`contextvars` module.
fr: Ajout du support du module :mod:`contextvars`.

source: Deprecation warning is emitted if *loop* is not specified and there is no running event loop.
fr: Un ``DeprecationWarning`` est levé si *loop* n'est pas spécifié et s'il n'y a pas de boucle d'évènements en cours d'exécution.

source: Return the result of the Future.
fr: Renvoie le résultat du *Future*.

source: If the Future is *done* and has a result set by the :meth:`set_result` method, the result value is returned.
fr: Si le *Future* est « terminé » et a un résultat défini par la méthode :meth:`set_result`, ce résultat est renvoyé.

source: If the Future is *done* and has an exception set by the :meth:`set_exception` method, this method raises the exception.
fr: Si le *Future* est « terminé » et a une exception définie par la méthode :meth:`set_exception`, cette méthode lève l'exception.

source: If the Future has been *cancelled*, this method raises a :exc:`CancelledError` exception.
fr: Si le *Future* a été *annulé*, cette méthode lève une exception :exc:`CancelledError`.

source: If the Future's result isn't yet available, this method raises a :exc:`InvalidStateError` exception.
fr: Si le résultat de la tâche n'est pas encore disponible, cette méthode lève une exception :exc:`InvalidStateError`.

source: Mark the Future as *done* and set its result.
fr: Marque le *Future* comme « terminé » et définit son résultat.

source: Raises a :exc:`InvalidStateError` error if the Future is already *done*.
fr: Lève une erreur :exc:`InvalidStateError` si le *Future* est déjà « terminé ».

source: Mark the Future as *done* and set an exception.
fr: Marque le *Future* comme « terminé » et définit une exception.

source: Return ``True`` if the Future is *done*.
fr: Renvoie ``True`` si le *Future* est « terminé ».

source: A Future is *done* if it was *cancelled* or if it has a result or an exception set with :meth:`set_result` or :meth:`set_exception` calls.
fr: Un *Future* est « terminé » s'il a été « annulé » ou si un résultat ou une exception a été définie par les méthodes :meth:`set_result` ou :meth:`set_exception`.

source: Return ``True`` if the Future was *cancelled*.
fr: Renvoie ``True`` si le *Future* a été « annulé ».

source: The method is usually used to check if a Future is not *cancelled* before setting a result or an exception for it::
fr: Cette méthode est habituellement utilisée pour vérifier qu'un *Future* n'est pas « annulé » avant de définir un résultat ou une exception pour celui-ci ::

source: Add a callback to be run when the Future is *done*.
fr: Ajoute une fonction de rappel à exécuter lorsque le *Future* est « terminé ».

source: The *callback* is called with the Future object as its only argument.
fr: L'argument *callback* est appelé avec l'objet *Future* comme seul argument.

source: If the Future is already *done* when this method is called, the callback is scheduled with :meth:`loop.call_soon`.
fr: Si le *Future* est déjà « terminé » lorsque la méthode est appelée, l'exécution de la fonction de rappel est planifiée avec :meth:`loop.call_soon`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *callback* to run in. The current context is used when no *context* is provided.
fr: L'argument nommé optionnel *context* permet de spécifier une classe :class:`contextvars.Context` personnalisée dans laquelle la fonction de rappel s’exécutera. Le contexte actuel est utilisé si *context* n'est pas fourni.

source: :func:`functools.partial` can be used to pass parameters to the callback, e.g.::
fr: :func:`functools.partial` peut être utilisée pour passer des paramètres à la fonction de rappel ::

source: The *context* keyword-only parameter was added. See :pep:`567` for more details.
fr: Ajout de l'argument nommé *context*. Voir :pep:`567` pour plus de détails.

source: Remove *callback* from the callbacks list.
fr: Retire *callback* de la liste de fonctions de rappel.

source: Returns the number of callbacks removed, which is typically 1, unless a callback was added more than once.
fr: Renvoie le nombre de fonctions de rappel retiré. La méthode renvoie généralement 1, à moins que la fonction ait été ajoutée plus d'une fois.

source: Cancel the Future and schedule callbacks.
fr: Annule le *Future* et planifie l'exécution des fonctions de rappel.

source: If the Future is already *done* or *cancelled*, return ``False``. Otherwise, change the Future's state to *cancelled*, schedule the callbacks, and return ``True``.
fr: Si le *Future* est déjà « terminé » ou « annulé », renvoie ``False``. Autrement, change l'état du *Future* à « annulé », planifie l'exécution des fonctions de rappel et renvoie ``True``.

source: Added the *msg* parameter.
fr: Ajout du paramètre *msg*.

source: Return the exception that was set on this Future.
fr: Renvoie l'exception définie pour ce *Future*.

source: The exception (or ``None`` if no exception was set) is returned only if the Future is *done*.
fr: L'exception, ou ``None`` si aucune exception n'a été définie, est renvoyé seulement si le *Future* est « terminé ».

source: If the Future isn't *done* yet, this method raises an :exc:`InvalidStateError` exception.
fr: Si le *Future* n'est pas encore « terminé », cette méthode lève une exception :exc:`InvalidStateError`.

source: Return the event loop the Future object is bound to.
fr: Renvoie la boucle d'évènements à laquelle le *Future* est attaché.

source: This example creates a Future object, creates and schedules an asynchronous Task to set result for the Future, and waits until the Future has a result::
fr: Cet exemple crée un objet *Future*, puis crée et planifie l’exécution d'une tâche asynchrone qui définira le résultat du *Future* et attend jusqu'à ce que le *Future* ait un résultat ::

source: The Future object was designed to mimic :class:`concurrent.futures.Future`. Key differences include:
fr: L'objet *Future* est conçu pour imiter la classe :class:`concurrent.futures.Future`. Les principales différences sont :

source: unlike asyncio Futures, :class:`concurrent.futures.Future` instances cannot be awaited.
fr: contrairement au *Future asyncio*, les instances de :class:`concurrent.futures.Future` ne peuvent pas être attendues ;

source: :meth:`asyncio.Future.result` and :meth:`asyncio.Future.exception` do not accept the *timeout* argument.
fr: :meth:`asyncio.Future.result` et :meth:`asyncio.Future.exception` n'acceptent pas d'argument *timeout* ;

source: :meth:`asyncio.Future.result` and :meth:`asyncio.Future.exception` raise an :exc:`InvalidStateError` exception when the Future is not *done*.
fr: :meth:`asyncio.Future.result` et :meth:`asyncio.Future.exception` lèvent une exception :exc:`InvalidStateError` lorsque le *Future* n'est pas « terminé » ;

source: Callbacks registered with :meth:`asyncio.Future.add_done_callback` are not called immediately. They are scheduled with :meth:`loop.call_soon` instead.
fr: les fonctions de rappel enregistrées à l'aide de :meth:`asyncio.Future.add_done_callback` ne sont pas exécutées immédiatement mais planifiées avec :meth:`loop.call_soon` ;

source: asyncio Future is not compatible with the :func:`concurrent.futures.wait` and :func:`concurrent.futures.as_completed` functions.
fr: les *Future asyncio* ne sont pas compatibles avec les fonctions :func:`concurrent.futures.wait` et :func:`concurrent.futures.as_completed` ;

source: :meth:`asyncio.Future.cancel` accepts an optional ``msg`` argument, but :func:`concurrent.futures.cancel` does not.
fr: :meth:`asyncio.Future.cancel` accepte un argument optionnel ``msg`` mais pas :func:`concurrent.futures.cancel`.
