Repository: python/python-docs-fr
Catalog: library/asyncio-sync.po
Languages: fr

source: Synchronization Primitives
fr: Primitives de synchronisation

source: **Source code:** :source:`Lib/asyncio/locks.py`
fr: **Code source :** :source:`Lib/asyncio/locks.py`

source: asyncio synchronization primitives are designed to be similar to those of the :mod:`threading` module with two important caveats:
fr: Les primitives de synchronisation *asyncio* sont conçues pour être similaires à celles du module :mod:`threading` avec deux mises en garde importantes :

source: asyncio primitives are not thread-safe, therefore they should not be used for OS thread synchronization (use :mod:`threading` for that);
fr: les primitives *asyncio* ne sont pas *thread-safe*, elles ne doivent donc pas être utilisées pour la synchronisation des fils d'exécution du système d'exploitation (utilisez :mod:`threading` pour cela) ;

source: methods of these synchronization primitives do not accept the *timeout* argument; use the :func:`asyncio.wait_for` function to perform operations with timeouts.
fr: les méthodes de ces primitives de synchronisation n'acceptent pas l'argument *timeout* ; utilisez la fonction :func:`asyncio.wait_for` pour effectuer des opérations avec des délais d'attente.

source: asyncio has the following basic synchronization primitives:
fr: *asyncio* possède les primitives de synchronisation de base suivantes :

source: Lock
fr: Verrou (*lock*)

source: Implements a mutex lock for asyncio tasks. Not thread-safe.
fr: Implémente un verrou exclusif (*mutex*) pour les tâches asynchrones. Ce n'est pas compatible avec les programmes à fils d'exécution multiples.

source: An asyncio lock can be used to guarantee exclusive access to a shared resource.
fr: Un verrou *asyncio* peut être utilisé pour garantir un accès exclusif à une ressource partagée.

source: The preferred way to use a Lock is an :keyword:`async with` statement::
fr: La meilleure façon d'utiliser un verrou est une instruction :keyword:`async with` ::

source: which is equivalent to::
fr: ce qui équivaut à ::

source: Removed the *loop* parameter.
fr: suppression du paramètre *loop*.

source: Acquire the lock.
fr: Verrouille (ou acquiert) le verrou.

source: This method waits until the lock is *unlocked*, sets it to *locked* and returns ``True``.
fr: Cette méthode attend que le verrou soit déverrouillé (*unlocked*), le verrouille (positionné sur *locked*) et renvoie ``True``.

source: When more than one coroutine is blocked in :meth:`acquire` waiting for the lock to be unlocked, only one coroutine eventually proceeds.
fr: Lorsque plus d'une coroutine est bloquée dans :meth:`acquire` en attendant que le verrou soit déverrouillé, seule une coroutine continue finalement.

source: Acquiring a lock is *fair*: the coroutine that proceeds will be the first coroutine that started waiting on the lock.
fr: L'acquisition d'un verrou est *équitable* : la coroutine qui acquiert le verrou est celle qui était la première à attendre le verrou.

source: Release the lock.
fr: Libère le verrou.

source: When the lock is *locked*, reset it to *unlocked* and return.
fr: Lorsque le verrou est verrouillé, le déverrouille et termine.

source: If the lock is *unlocked*, a :exc:`RuntimeError` is raised.
fr: Si le verrou est déjà déverrouillé, une :exc:`RuntimeError` est levée.

source: Return ``True`` if the lock is *locked*.
fr: Renvoie ``True`` si le verrou est verrouillé.

source: Event
fr: Événement (*Event*)

source: An event object. Not thread-safe.
fr: Objet événement. Non compatible avec les programmes à plusieurs fils d'exécution.

source: An asyncio event can be used to notify multiple asyncio tasks that some event has happened.
fr: Un événement asynchrone peut être utilisé pour notifier plusieurs tâches asynchrones qu'un événement s'est produit.

source: An Event object manages an internal flag that can be set to *true* with the :meth:`~Event.set` method and reset to *false* with the :meth:`clear` method. The :meth:`~Event.wait` method blocks until the flag is set to *true*. The flag is set to *false* initially.
fr: Un objet *Event* gère un drapeau interne qui peut être activé (ou mis à *vrai*) avec la méthode :meth:`~Event.set` et désactivé (ou mis à *faux*) avec la méthode :meth:`clear`. La méthode :meth:`~Event.wait` se bloque jusqu'à ce que l'indicateur soit activé. L'indicateur est initialement désactivé.

source: Example::
fr: Exemple ::

source: Wait until the event is set.
fr: Attend que l'évènement soit activé.

source: If the event is set, return ``True`` immediately. Otherwise block until another task calls :meth:`~Event.set`.
fr: Si l'événement est activé (*vrai*), renvoie ``True`` immédiatement. Sinon bloque jusqu'à ce qu'une autre tâche appelle :meth:`~Event.set`.

source: Set the event.
fr: Active l'événement.

source: All tasks waiting for event to be set will be immediately awakened.
fr: Toutes les tâches en attente de l'événement sont immédiatement réveillées.

source: Clear (unset) the event.
fr: Efface (désactive) l'événement.

source: Tasks awaiting on :meth:`~Event.wait` will now block until the :meth:`~Event.set` method is called again.
fr: Les tâches en attente sur :meth:`~Event.wait` seront désormais bloquées jusqu'à ce que la méthode :meth:`~Event.set` soit à nouveau appelée.

source: Return ``True`` if the event is set.
fr: Renvoie ``True`` si l'évènement est actif.

source: A Condition object. Not thread-safe.
fr: Objet Condition. Non compatible avec les programmes à plusieurs fils d'exécution.

source: An asyncio condition primitive can be used by a task to wait for some event to happen and then get exclusive access to a shared resource.
fr: Une primitive de condition asynchrone peut être utilisée par une tâche pour attendre qu'un événement se produise, puis obtenir un accès exclusif à une ressource partagée.

source: In essence, a Condition object combines the functionality of an :class:`Event` and a :class:`Lock`. It is possible to have multiple Condition objects share one Lock, which allows coordinating exclusive access to a shared resource between different tasks interested in particular states of that shared resource.
fr: Essentiellement, un objet *Condition* combine les fonctionnalités d'un :class:`Event` et d'un :class:`Lock`. Il est possible que plusieurs objets *Condition* partagent un seul verrou, ce qui permet de coordonner l'accès exclusif à une ressource partagée entre différentes tâches intéressées par des états particuliers de cette ressource partagée.

source: The optional *lock* argument must be a :class:`Lock` object or ``None``. In the latter case a new Lock object is created automatically.
fr: L'argument optionnel *lock* doit être un objet :class:`Lock` ou ``None``. Dans ce dernier cas, un nouvel objet *Lock* est créé automatiquement.

source: The preferred way to use a Condition is an :keyword:`async with` statement::
fr: La meilleure façon d'utiliser une *Condition* est une instruction :keyword:`async with` ::

source: Acquire the underlying lock.
fr: Verrouille le verrou sous-jacent.

source: This method waits until the underlying lock is *unlocked*, sets it to *locked* and returns ``True``.
fr: Cette méthode attend que le verrou sous-jacent soit déverrouillé, le verrouille et renvoie ``True``.

source: The lock must be acquired before this method is called and released shortly after. If called with an *unlocked* lock a :exc:`RuntimeError` error is raised.
fr: Le verrou doit être verrouillé avant que cette méthode ne soit appelée et libéré peu de temps après. S'il est appelé avec un verrou déverrouillé, une erreur :exc:`RuntimeError` est levée.

source: Return ``True`` if the underlying lock is acquired.
fr: Renvoie ``True`` si le verrou sous-jacent est verrouillé.

source: Wake up all tasks waiting on this condition.
fr: Réveille toutes les tâches en attente sur cette condition.

source: This method acts like :meth:`notify`, but wakes up all waiting tasks.
fr: Cette méthode agit comme :meth:`notify`, mais réveille toutes les tâches en attente.

source: Release the underlying lock.
fr: Libère le verrou sous-jacent.

source: When invoked on an unlocked lock, a :exc:`RuntimeError` is raised.
fr: Lorsqu'elle est invoquée sur un verrou déverrouillé, une :exc:`RuntimeError` est levée.

source: Wait until notified.
fr: Attend d'être notifié.

source: If the calling task has not acquired the lock when this method is called, a :exc:`RuntimeError` is raised.
fr: Si la tâche appelante n'a pas verrouillé le verrou lorsque cette méthode est appelée, une :exc:`RuntimeError` est levée.

source: This method releases the underlying lock, and then blocks until it is awakened by a :meth:`notify` or :meth:`notify_all` call. Once awakened, the Condition re-acquires its lock and this method returns ``True``.
fr: Cette méthode libère le verrou sous-jacent, puis se bloque jusqu'à ce qu'elle soit réveillée par un appel :meth:`notify` ou :meth:`notify_all`. Une fois réveillée, la *Condition* verrouille à nouveau son verrou et cette méthode renvoie ``True``.

source: Wait until a predicate becomes *true*.
fr: Attend jusqu'à ce qu'un prédicat devienne vrai.

source: Semaphore
fr: Sémaphore

source: A Semaphore object. Not thread-safe.
fr: Objet *Sémaphore*. Non compatible avec les programmes à plusieurs fils d'exécution.

source: A semaphore manages an internal counter which is decremented by each :meth:`acquire` call and incremented by each :meth:`release` call. The counter can never go below zero; when :meth:`acquire` finds that it is zero, it blocks, waiting until some task calls :meth:`release`.
fr: Un sémaphore gère un compteur interne qui est décrémenté à chaque appel :meth:`acquire` et incrémenté à chaque appel :meth:`release`. Le compteur ne peut jamais descendre en dessous de zéro ; quand :meth:`acquire` trouve qu'il est égal à zéro, il se bloque, en attendant qu'une tâche appelle :meth:`release`.

source: The optional *value* argument gives the initial value for the internal counter (``1`` by default). If the given value is less than ``0`` a :exc:`ValueError` is raised.
fr: L'argument optionnel *value* donne la valeur initiale du compteur interne (``1`` par défaut). Si la valeur donnée est inférieure à ``0`` une :exc:`ValueError` est levée.

source: The preferred way to use a Semaphore is an :keyword:`async with` statement::
fr: La meilleure façon d'utiliser un sémaphore est une instruction :keyword:`async with` ::

source: Acquire a semaphore.
fr: Acquiert un sémaphore.

source: If the internal counter is greater than zero, decrement it by one and return ``True`` immediately. If it is zero, wait until a :meth:`release` is called and return ``True``.
fr: Si le compteur interne est supérieur à zéro, le décrémente d'une unité et renvoie ``True`` immédiatement. Si c'est zéro, attend que :meth:`release` soit appelée et renvoie ``True``.

source: Returns ``True`` if semaphore can not be acquired immediately.
fr: Renvoie ``True`` si le sémaphore ne peut pas être acquis immédiatement.

source: Release a semaphore, incrementing the internal counter by one. Can wake up a task waiting to acquire the semaphore.
fr: Relâche un sémaphore, incrémentant le compteur interne d'une unité. Peut réveiller une tâche en attente d'acquisition du sémaphore.

source: Unlike :class:`BoundedSemaphore`, :class:`Semaphore` allows making more ``release()`` calls than ``acquire()`` calls.
fr: Contrairement à :class:`BoundedSemaphore`, :class:`Semaphore` permet de faire plus d'appels ``release()`` que d'appels ``acquire()``.

source: BoundedSemaphore
fr: Sémaphore capé (*BoundedSemaphore*)

source: A bounded semaphore object. Not thread-safe.
fr: Objet sémaphore capé. Non compatible avec les programmes à plusieurs fils d'exécution.

source: Bounded Semaphore is a version of :class:`Semaphore` that raises a :exc:`ValueError` in :meth:`~Semaphore.release` if it increases the internal counter above the initial *value*.
fr: *Bounded Semaphore* est une version de :class:`Semaphore` qui lève une :exc:`ValueError` dans :meth:`~Semaphore.release` s'il augmente le compteur interne au-dessus de la *value* initiale.

source: Barrier
fr: Barrière (*Barrier*)

source: A barrier object. Not thread-safe.
fr: Objet barrière. Non compatible avec les programmes à plusieurs fils d'exécution.

source: A barrier is a simple synchronization primitive that allows to block until *parties* number of tasks are waiting on it. Tasks can wait on the :meth:`~Barrier.wait` method and would be blocked until the specified number of tasks end up waiting on :meth:`~Barrier.wait`. At that point all of the waiting tasks would unblock simultaneously.
fr: Une barrière est une simple primitive de synchronisation qui permet de bloquer jusqu'à ce que *parties* tâches l'attendent. Les tâches attendent sur la méthode :meth:`~Barrier.wait` et sont bloquées jusqu'à ce que le nombre spécifié de tâches attendent sur :meth:`~Barrier.wait`. À ce stade, toutes les tâches en attente se débloquent simultanément.

source: :keyword:`async with` can be used as an alternative to awaiting on :meth:`~Barrier.wait`.
fr: :keyword:`async with` peut être utilisé comme alternative à l'attente sur :meth:`~Barrier.wait`.

source: The barrier can be reused any number of times.
fr: La barrière peut être réutilisée un nombre illimité de fois.

source: Result of this example is::
fr: Le résultat de cet exemple est ::

source: Pass the barrier. When all the tasks party to the barrier have called this function, they are all unblocked simultaneously.
fr: Passe la barrière. Lorsque toutes les tâches bloquées à la barrière ont appelé cette fonction, elles sont toutes débloquées simultanément.

source: When a waiting or blocked task in the barrier is cancelled, this task exits the barrier which stays in the same state. If the state of the barrier is "filling", the number of waiting task decreases by 1.
fr: Lorsqu'une tâche en attente ou bloquée à la barrière est annulée, cette tâche sort de la barrière qui reste dans le même état. Si la barrière est en cours de « remplissage », le nombre de tâche en attente diminue de 1.

source: The return value is an integer in the range of 0 to ``parties-1``, different for each task. This can be used to select a task to do some special housekeeping, e.g.::
fr: La valeur de retour est un entier compris entre 0 et ``parties-1``, différent pour chaque tâche. Cela peut être utilisé pour sélectionner une tâche qui fera du ménage, par exemple ::

source: This method may raise a :class:`BrokenBarrierError` exception if the barrier is broken or reset while a task is waiting. It could raise a :exc:`CancelledError` if a task is cancelled.
fr: Cette méthode peut lever une exception :class:`BrokenBarrierError` si la barrière est brisée ou réinitialisée alors qu'une tâche est en attente. Cela peut lever une :exc:`CancelledError` si une tâche est annulée.

source: Return the barrier to the default, empty state. Any tasks waiting on it will receive the :class:`BrokenBarrierError` exception.
fr: Ramène la barrière à l'état vide par défaut. Toutes les tâches en attente reçoivent l'exception :class:`BrokenBarrierError`.

source: If a barrier is broken it may be better to just leave it and create a new one.
fr: Si une barrière est brisée, il peut être préférable de la quitter et d'en créer une nouvelle.

source: Put the barrier into a broken state. This causes any active or future calls to :meth:`wait` to fail with the :class:`BrokenBarrierError`. Use this for example if one of the tasks needs to abort, to avoid infinite waiting tasks.
fr: Met la barrière dans un état cassé. Cela provoque l'échec de tout appel actif ou futur à :meth:`wait` avec une :class:`BrokenBarrierError`. Utilisez ceci par exemple si l'une des tâches doit être abandonnée, pour éviter des tâches en attente infinie.

source: The number of tasks required to pass the barrier.
fr: Le nombre de tâches nécessaires pour franchir la barrière.

source: The number of tasks currently waiting in the barrier while filling.
fr: Le nombre de tâches actuellement en attente à la barrière pendant le remplissage.

source: A boolean that is ``True`` if the barrier is in the broken state.
fr: Booléen qui vaut ``True`` si la barrière est rompue.

source: This exception, a subclass of :exc:`RuntimeError`, is raised when the :class:`Barrier` object is reset or broken.
fr: Cette exception, une sous-classe de :exc:`RuntimeError`, est déclenchée lorsque l'objet :class:`Barrier` est réinitialisé ou cassé.

source: Acquiring a lock using ``await lock`` or ``yield from lock`` and/or :keyword:`with` statement (``with await lock``, ``with (yield from lock)``) was removed. Use ``async with lock`` instead.
fr: l'acquisition d'un verrou en utilisant ``wait lock`` ou ``yield from lock`` ou :keyword:`with` (``with await lock``, ``with (yield from lock)``) a été supprimée. Utilisez ``async with lock`` à la place.
