Repository: python/python-docs-fr
Catalog: library/asyncio-runner.po
Languages: fr

source: Runners
fr: Exécuteurs (*runners*)

source: **Source code:** :source:`Lib/asyncio/runners.py`
fr: **Code source :** :source:`Lib/asyncio/runners.py`

source: This section outlines high-level asyncio primitives to run asyncio code.
fr: Cette section décrit les primitives *asyncio* de haut niveau pour exécuter du code asynchrone.

source: They are built on top of an :ref:`event loop <asyncio-event-loop>` with the aim to simplify async code usage for common wide-spread scenarios.
fr: Elles sont construites au-dessus d'une :ref:`boucle d'événements <asyncio-event-loop>` dans le but de simplifier l'utilisation du code asynchrone pour les scénarios les plus courants.

source: Running an asyncio Program
fr: Exécution d'un programme asynchrone

source: Execute the :term:`coroutine` *coro* and return the result.
fr: Exécute la :term:`coroutine` *coro* et renvoie le résultat.

source: This function cannot be called when another asyncio event loop is running in the same thread.
fr: Cette fonction ne peut pas être appelée lorsqu'une autre boucle d'événement asynchrone est en cours d'exécution dans le même fil d'exécution.

source: If *debug* is ``True``, the event loop will be run in debug mode. ``False`` disables debug mode explicitly. ``None`` is used to respect the global :ref:`asyncio-debug-mode` settings.
fr: Si *debug* vaut ``True``, la boucle d'événements est exécutée en mode débogage. ``False`` désactive explicitement le mode débogage. ``None`` est utilisée pour respecter les paramètres globaux définis par :ref:`asyncio-debug-mode`.

source: Example::
fr: Exemple ::

source: Updated to use :meth:`loop.shutdown_default_executor`.
fr: mise à jour pour utiliser :meth:`loop.shutdown_default_executor`.

source: *debug* is ``None`` by default to respect the global debug mode settings.
fr: *debug* vaut ``None`` par défaut pour respecter les paramètres du mode de débogage global.

source: Runner context manager
fr: Gestionnaire de contexte de l'exécuteur

source: A context manager that simplifies *multiple* async function calls in the same context.
fr: Gestionnaire de contexte englobant *plusieurs* appels de fonctions asynchrones dans le même contexte.

source: Sometimes several top-level async functions should be called in the same :ref:`event loop <asyncio-event-loop>` and :class:`contextvars.Context`.
fr: Parfois, plusieurs fonctions asynchrones de niveau supérieur doivent être appelées dans la même :ref:`boucle d'événements <asyncio-event-loop>` et le même :class:`contextvars.Context`.

source: *loop_factory* could be used for overriding the loop creation. It is the responsibility of the *loop_factory* to set the created loop as the current one. By default :func:`asyncio.new_event_loop` is used and set as current event loop with :func:`asyncio.set_event_loop` if *loop_factory* is ``None``.
fr: *loop_factory* peut être utilisée pour remplacer la création de la boucle. *loop_factory* a la responsabilité de définir la boucle créée comme boucle courante. Par défaut :func:`asyncio.new_event_loop` est utilisée et définie comme boucle d'événements actuelle avec :func:`asyncio.set_event_loop` si *loop_factory* vaut ``None``.

source: Run a :term:`coroutine <coroutine>` *coro* in the embedded loop.
fr: Exécute la :term:`coroutine <coroutine>` *coro* dans la boucle d'événements en cours.

source: Return the coroutine's result or raise its exception.
fr: Renvoie le résultat de la coroutine ou lève les exceptions afférentes.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *coro* to run in. The runner's default context is used if ``None``.
fr: L'argument (uniquement nommé) facultatif *context* permet de spécifier un :class:`contextvars.Context` personnalisé pour la coroutine à exécuter. Le contexte par défaut de l'exécuteur est utilisé si *context* est ``None``.

source: Close the runner.
fr: Termine l'exécuteur.

source: Finalize asynchronous generators, shutdown default executor, close the event loop and release embedded :class:`contextvars.Context`.
fr: Finalise les générateurs asynchrones, arrête l'exécuteur par défaut, ferme la boucle d'événements et libère le :class:`contextvars.Context` en cours.

source: Return the event loop associated with the runner instance.
fr: Renvoie la boucle d'événements associée à l'instance de l'exécuteur.

source: :class:`Runner` uses the lazy initialization strategy, its constructor doesn't initialize underlying low-level structures.
fr: :class:`Runner` utilise la stratégie d'initialisation paresseuse, son constructeur n'initialise pas les structures de bas niveau sous-jacentes.

source: Embedded *loop* and *context* are created at the :keyword:`with` body entering or the first call of :meth:`run` or :meth:`get_loop`.
fr: La boucle d'événements *loop* et le *context* intégrés sont créés à l'entrée du corps de :keyword:`with` ou au premier appel de :meth:`run` ou :meth:`get_loop`.

source: Handling Keyboard Interruption
fr: Gestion de l'interruption par le clavier

source: When :const:`signal.SIGINT` is raised by :kbd:`Ctrl-C`, :exc:`KeyboardInterrupt` exception is raised in the main thread by default. However this doesn't work with :mod:`asyncio` because it can interrupt asyncio internals and can hang the program from exiting.
fr: Lorsque :const:`signal.SIGINT` est déclenché par :kbd:`Ctrl-C`, l'exception :exc:`KeyboardInterrupt` est levée par défaut dans le fils d'exécution principal. Cependant, cela ne fonctionne pas avec :mod:`asyncio` car cela peut interrompre le fonctionnement interne de *asyncio* et empêcher le programme de se terminer.

source: To mitigate this issue, :mod:`asyncio` handles :const:`signal.SIGINT` as follows:
fr: Pour contrer ce problème, :mod:`asyncio` gère :const:`signal.SIGINT` comme suit :

source: :meth:`asyncio.Runner.run` installs a custom :const:`signal.SIGINT` handler before any user code is executed and removes it when exiting from the function.
fr: :meth:`asyncio.Runner.run` installe un gestionnaire :const:`signal.SIGINT` personnalisé avant l'exécution de tout code utilisateur et le supprime à la sortie de la fonction.

source: The :class:`~asyncio.Runner` creates the main task for the passed coroutine for its execution.
fr: Le :class:`~asyncio.Runner` crée la tâche principale pour la coroutine transmise pour son exécution.

source: When :const:`signal.SIGINT` is raised by :kbd:`Ctrl-C`, the custom signal handler cancels the main task by calling :meth:`asyncio.Task.cancel` which raises :exc:`asyncio.CancelledError` inside the main task. This causes the Python stack to unwind, ``try/except`` and ``try/finally`` blocks can be used for resource cleanup. After the main task is cancelled, :meth:`asyncio.Runner.run` raises :exc:`KeyboardInterrupt`.
fr: Lorsque :const:`signal.SIGINT` est déclenché par :kbd:`Ctrl-C`, le gestionnaire de signal personnalisé annule la tâche principale en appelant :meth:`asyncio.Task.cancel` qui lève :exc:`asyncio.CancelledError` à l'intérieur de la tâche principale. Cela entraîne la remontée dans la pile Python, les blocs ``try/except`` et ``try/finally`` peuvent être utilisés pour le nettoyage des ressources. Une fois la tâche principale annulée, :meth:`asyncio.Runner.run` lève :exc:`KeyboardInterrupt`.

source: A user could write a tight loop which cannot be interrupted by :meth:`asyncio.Task.cancel`, in which case the second following :kbd:`Ctrl-C` immediately raises the :exc:`KeyboardInterrupt` without cancelling the main task.
fr: Un utilisateur peut écrire une boucle tellement petite qu'elle ne peut pas être interrompue par :meth:`asyncio.Task.cancel` ; dans ce cas la seconde suivante :kbd:`Ctrl-C` lève immédiatement le :exc:`KeyboardInterrupt` sans annuler la tâche principale.
