Repository: python/python-docs-fr
Catalog: library/asyncio-platforms.po
Languages: fr

source: Platform Support
fr: Prise en charge de la plate-forme

source: The :mod:`asyncio` module is designed to be portable, but some platforms have subtle differences and limitations due to the platforms' underlying architecture and capabilities.
fr: Le module :mod:`asyncio` est conçu pour être portable, mais certaines plates-formes présentent des différences et des limitations subtiles en raison de l'architecture et des capacités sous-jacentes des plates-formes.

source: All Platforms
fr: Toutes plateformes

source: :meth:`loop.add_reader` and :meth:`loop.add_writer` cannot be used to monitor file I/O.
fr: :meth:`loop.add_reader` et :meth:`loop.add_writer` ne peuvent pas être utilisées pour surveiller les entrées-sorties de fichiers.

source: **Source code:** :source:`Lib/asyncio/proactor_events.py`, :source:`Lib/asyncio/windows_events.py`, :source:`Lib/asyncio/windows_utils.py`
fr: **Code source :** :source:`Lib/asyncio/proactor_events.py`, :source:`Lib/asyncio/windows_events.py`, :source:`Lib/asyncio/windows_utils.py`

source: On Windows, :class:`ProactorEventLoop` is now the default event loop.
fr: sous Windows, :class:`ProactorEventLoop` est désormais la boucle d'événements par défaut.

source: All event loops on Windows do not support the following methods:
fr: Aucune boucle d'événements sous Windows ne prend en charge les méthodes suivantes :

source: :meth:`loop.add_signal_handler` and :meth:`loop.remove_signal_handler` are not supported.
fr: :meth:`loop.add_signal_handler` et :meth:`loop.remove_signal_handler` ne sont pas prises en charge.

source: :class:`SelectorEventLoop` has the following limitations:
fr: :class:`SelectorEventLoop` a les limitations suivantes :

source: :class:`~selectors.SelectSelector` is used to wait on socket events: it supports sockets and is limited to 512 sockets.
fr: :class:`~selectors.SelectSelector` est utilisée pour attendre les événements de connecteur (*sockets*) : elle prend en charge les connecteurs et est limitée à 512 connecteurs.

source: :meth:`loop.add_reader` and :meth:`loop.add_writer` only accept socket handles (e.g. pipe file descriptors are not supported).
fr: :meth:`loop.add_reader` et :meth:`loop.add_writer` n'acceptent que les descripteurs de connecteur (par exemple, les descripteurs de tube fichier ne sont pas pris en charge).

source: Pipes are not supported, so the :meth:`loop.connect_read_pipe` and :meth:`loop.connect_write_pipe` methods are not implemented.
fr: Les tubes ne sont pas pris en charge, donc les méthodes :meth:`loop.connect_read_pipe` et :meth:`loop.connect_write_pipe` ne sont pas implémentées.

source: :ref:`Subprocesses <asyncio-subprocess>` are not supported, i.e. :meth:`loop.subprocess_exec` and :meth:`loop.subprocess_shell` methods are not implemented.
fr: Les :ref:`sous-processus <asyncio-subprocess>` ne sont pas pris en charge, c'est-à-dire que les méthodes :meth:`loop.subprocess_exec` et :meth:`loop.subprocess_shell` ne sont pas implémentées.

source: :class:`ProactorEventLoop` has the following limitations:
fr: :class:`ProactorEventLoop` a les limitations suivantes :

source: The :meth:`loop.add_reader` and :meth:`loop.add_writer` methods are not supported.
fr: Les méthodes :meth:`loop.add_reader` et :meth:`loop.add_writer` ne sont pas prises en charge.

source: The resolution of the monotonic clock on Windows is usually around 15.6 milliseconds. The best resolution is 0.5 milliseconds. The resolution depends on the hardware (availability of `HPET <https://en.wikipedia.org/wiki/High_Precision_Event_Timer>`_) and on the Windows configuration.
fr: La résolution de l'horloge monotone sous Windows est généralement d'environ 15,6 millisecondes. La meilleure résolution est de 0,5 milliseconde. La résolution dépend du matériel (disponibilité de `HPET <https://fr.wikipedia.org/wiki/High_Precision_Event_Timer>`_) et de la configuration de Windows.

source: Subprocess Support on Windows
fr: Prise en charge des sous-processus sous Windows

source: On Windows, the default event loop :class:`ProactorEventLoop` supports subprocesses, whereas :class:`SelectorEventLoop` does not.
fr: Sous Windows, la boucle d'événements par défaut :class:`ProactorEventLoop` prend en charge les sous-processus, contrairement à :class:`SelectorEventLoop`.

source: The :meth:`policy.set_child_watcher() <AbstractEventLoopPolicy.set_child_watcher>` function is also not supported, as :class:`ProactorEventLoop` has a different mechanism to watch child processes.
fr: La fonction :meth:`policy.set_child_watcher() <AbstractEventLoopPolicy.set_child_watcher>` n'est pas non plus prise en charge, car :class:`ProactorEventLoop` a un mécanisme différent pour surveiller les processus enfants.

source: Modern macOS versions are fully supported.
fr: Les versions modernes de macOS sont entièrement prises en charge.

source: On macOS 10.6, 10.7 and 10.8, the default event loop uses :class:`selectors.KqueueSelector`, which does not support character devices on these versions. The :class:`SelectorEventLoop` can be manually configured to use :class:`~selectors.SelectSelector` or :class:`~selectors.PollSelector` to support character devices on these older versions of macOS. Example::
fr: Sur macOS 10.6, 10.7 et 10.8, la boucle d'événements par défaut utilise :class:`selectors.KqueueSelector`, qui ne prend pas en charge les périphériques de caractères sur ces versions. La :class:`SelectorEventLoop` peut être configurée manuellement pour utiliser :class:`~selectors.SelectSelector` ou :class:`~selectors.PollSelector` pour prendre en charge les périphériques de caractères sur ces anciennes versions de macOS. Par exemple ::
