Repository: python/python-docs-fr
Catalog: library/asyncio-protocol.po
Languages: fr

source: On POSIX systems, the function sends SIGKILL to the subprocess. On Windows, this method is an alias for :meth:`terminate`.
fr: Sur les systèmes POSIX, la fonction envoie SIGKILL au sous-processus. Sous Windows, cette méthode est un alias pour :meth:`terminate`.

source: See also :meth:`subprocess.Popen.kill`.
fr: Voir aussi :meth:`subprocess.Popen.kill`.

source: Send the *signal* number to the subprocess, as in :meth:`subprocess.Popen.send_signal`.
fr: Envoie le numéro de *signal* au sous-processus, comme dans :meth:`subprocess.Popen.send_signal`.

source: Stop the subprocess.
fr: Termine le sous-processus.

source: See also :meth:`subprocess.Popen.terminate`.
fr: Voir aussi :meth:`subprocess.Popen.terminate`.

source: Kill the subprocess by calling the :meth:`kill` method.
fr: Tue le sous-processus en appelant la méthode :meth:`kill`.

source: If the subprocess hasn't returned yet, and close transports of *stdin*, *stdout*, and *stderr* pipes.
fr: Si le sous-processus n'est pas encore terminé, ferme les transports des tubes *stdin*, *stdout* et *stderr*.

source: Protocols
fr: Protocoles

source: **Source code:** :source:`Lib/asyncio/protocols.py`
fr: **Code source :** :source:`Lib/asyncio/protocols.py`

source: asyncio provides a set of abstract base classes that should be used to implement network protocols. Those classes are meant to be used together with :ref:`transports <asyncio-transport>`.
fr: *asyncio* fournit un ensemble de classes mères abstraites qui doivent être utilisées pour implémenter des protocoles réseau. Ces classes sont destinées à être utilisées avec les :ref:`transports <asyncio-transport>`.

source: Subclasses of abstract base protocol classes may implement some or all methods. All these methods are callbacks: they are called by transports on certain events, for example when some data is received. A base protocol method should be called by the corresponding transport.
fr: Les sous-classes des classes mères abstraites de protocole peuvent implémenter certaines ou toutes les méthodes. Toutes ces méthodes sont des rappels : elles sont appelées par des transports sur certains événements, par exemple lors de la réception de certaines données. Une méthode de protocole de base doit être appelée par le transport correspondant.

source: Base Protocols
fr: Protocoles de base

source: Base protocol with methods that all protocols share.
fr: Protocole de base avec des méthodes partagées par tous les protocoles.

source: The base class for implementing streaming protocols (TCP, Unix sockets, etc).
fr: Classe mère pour l'implémentation des protocoles de streaming (TCP, sockets Unix, etc.).

source: A base class for implementing streaming protocols with manual control of the receive buffer.
fr: Classe mère pour implémenter des protocoles de streaming avec contrôle manuel du tampon de réception.

source: The base class for implementing datagram (UDP) protocols.
fr: Classe mère pour l'implémentation des protocoles par datagrammes (UDP).

source: The base class for implementing protocols communicating with child processes (unidirectional pipes).
fr: Classe mère pour implémenter des protocoles communiquant avec des processus enfants (canaux unidirectionnels).

source: Base Protocol
fr: Protocoles de base

source: All asyncio protocols can implement Base Protocol callbacks.
fr: Tous les protocoles asynchrones peuvent implémenter des rappels pour les protocoles de base.

source: Connection Callbacks
fr: Rappels pour les connexions

source: Connection callbacks are called on all protocols, exactly once per a successful connection. All other protocol callbacks can only be called between those two methods.
fr: Les méthodes de rappel pour les connexions concernent tous les protocoles, exactement une fois par connexion réussie. Tous les autres rappels de protocole ne peuvent être appelés qu'entre ces deux méthodes.

source: Called when a connection is made.
fr: Appelée lorsqu'une connexion est établie.

source: The *transport* argument is the transport representing the connection. The protocol is responsible for storing the reference to its transport.
fr: L'argument *transport* est le transport représentant la connexion. Le protocole est chargé de stocker la référence à son transport.

source: Called when the connection is lost or closed.
fr: Appelée lorsqu'une connexion est perdue ou fermée.

source: The argument is either an exception object or :const:`None`. The latter means a regular EOF is received, or the connection was aborted or closed by this side of the connection.
fr: L'argument est soit un objet exception soit :const:`None`. Ce dernier signifie qu'un EOF régulier est reçu, ou que la connexion a été interrompue ou fermée par ce côté de la connexion.

source: Flow Control Callbacks
fr: Rappels pour le contrôle de flux

source: Flow control callbacks can be called by transports to pause or resume writing performed by the protocol.
fr: Les méthodes de rappel pour le contrôle de flux concernent les transports et sont utilisés pour suspendre ou reprendre l'écriture effectuée par le protocole.

source: See the documentation of the :meth:`~WriteTransport.set_write_buffer_limits` method for more details.
fr: Voir la documentation de la méthode :meth:`~WriteTransport.set_write_buffer_limits` pour plus de détails.

source: Called when the transport's buffer goes over the high watermark.
fr: Appelée lorsque la mémoire tampon du transport dépasse la limite supérieure.

source: Called when the transport's buffer drains below the low watermark.
fr: Appelée lorsque la mémoire tampon du transport passe sous le seuil bas.

source: If the buffer size equals the high watermark, :meth:`~BaseProtocol.pause_writing` is not called: the buffer size must go strictly over.
fr: Si la taille du tampon est égale au seuil haut, :meth:`~BaseProtocol.pause_writing` n'est pas appelée : la taille du tampon doit être strictement supérieure.

source: Conversely, :meth:`~BaseProtocol.resume_writing` is called when the buffer size is equal or lower than the low watermark. These end conditions are important to ensure that things go as expected when either mark is zero.
fr: Inversement, :meth:`~BaseProtocol.resume_writing` est appelée lorsque la taille du tampon est égale ou inférieure au seuil bas. Ces conditions de fin sont importantes pour s'assurer que les choses se déroulent comme prévu lorsque l'un ou l'autre seuil est à zéro.

source: Streaming Protocols
fr: Protocoles connectés

source: Event methods, such as :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_accepted_socket`, :meth:`loop.connect_read_pipe`, and :meth:`loop.connect_write_pipe` accept factories that return streaming protocols.
fr: Les méthodes d'événement, telles que :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_accepted_socket`, :meth:`loop.connect_read_pipe` et :meth:`loop.connect_write_pipe` acceptent les fabriques qui renvoient des protocoles connectés.

source: Called when some data is received. *data* is a non-empty bytes object containing the incoming data.
fr: Appelée lorsque certaines données sont reçues. *data* est un objet bytes non vide contenant les données entrantes.

source: Whether the data is buffered, chunked or reassembled depends on the transport. In general, you shouldn't rely on specific semantics and instead make your parsing generic and flexible. However, data is always received in the correct order.
fr: Le fait que les données soient mises en mémoire tampon, fragmentées ou réassemblées dépend du transport. En général, vous ne devez pas vous fier à une sémantique spécifique et plutôt rendre votre analyse générique et flexible. Cependant, les données sont toujours reçues dans le bon ordre.

source: The method can be called an arbitrary number of times while a connection is open.
fr: La méthode peut être appelée un nombre arbitraire de fois lorsqu'une connexion est ouverte.

source: However, :meth:`protocol.eof_received() <Protocol.eof_received>` is called at most once. Once ``eof_received()`` is called, ``data_received()`` is not called anymore.
fr: Cependant, :meth:`protocol.eof_received() <Protocol.eof_received>` est appelée au plus une fois. Une fois que ``eof_received()`` est appelée, ``data_received()`` n'est plus appelée.

source: Called when the other end signals it won't send any more data (for example by calling :meth:`transport.write_eof() <WriteTransport.write_eof>`, if the other end also uses asyncio).
fr: Appelée lorsque l'autre extrémité signale qu'il n'enverra plus de données (par exemple en appelant :meth:`transport.write_eof() <WriteTransport.write_eof>`, si l'autre extrémité utilise également *asyncio*).

source: This method may return a false value (including ``None``), in which case the transport will close itself. Conversely, if this method returns a true value, the protocol used determines whether to close the transport. Since the default implementation returns ``None``, it implicitly closes the connection.
fr: Cette méthode peut renvoyer une valeur évaluée à faux (y compris ``None``), auquel cas le transport se ferme de lui-même. À l'inverse, si cette méthode renvoie une valeur évaluée à vrai, le protocole utilisé détermine s'il faut fermer le transport. Puisque l'implémentation par défaut renvoie ``None``, elle ferme implicitement la connexion.

source: Some transports, including SSL, don't support half-closed connections, in which case returning true from this method will result in the connection being closed.
fr: Certains transports, y compris SSL, ne prennent pas en charge les connexions semi-fermées, auquel cas renvoyer *True* à partir de cette méthode entraîne la fermeture de la connexion.

source: State machine:
fr: Machine à états :

source: Buffered Streaming Protocols
fr: Protocoles connectés avec tampon

source: Buffered Protocols can be used with any event loop method that supports `Streaming Protocols`_.
fr: Les protocoles avec mise en mémoire tampon peuvent être utilisés avec n'importe quelle méthode de boucle d'événements prenant en charge les `protocoles connectés`_.

source: ``BufferedProtocol`` implementations allow explicit manual allocation and control of the receive buffer. Event loops can then use the buffer provided by the protocol to avoid unnecessary data copies. This can result in noticeable performance improvement for protocols that receive big amounts of data. Sophisticated protocol implementations can significantly reduce the number of buffer allocations.
fr: Les implémentations de ``BufferedProtocol`` permettent une allocation et un contrôle manuels explicites du tampon de réception. Les boucles d'événements peuvent alors utiliser le tampon fourni par le protocole pour éviter les copies de données inutiles. Cela peut entraîner une amélioration notable des performances pour les protocoles qui reçoivent de grandes quantités de données. Des implémentations de protocole sophistiquées peuvent réduire considérablement le nombre d'allocations de mémoire tampon.

source: The following callbacks are called on :class:`BufferedProtocol` instances:
fr: Les méthodes de rappel suivantes sont appelées sur les instances :class:`BufferedProtocol` :

source: Called to allocate a new receive buffer.
fr: Appelée pour allouer un nouveau tampon de réception.

source: *sizehint* is the recommended minimum size for the returned buffer. It is acceptable to return smaller or larger buffers than what *sizehint* suggests. When set to -1, the buffer size can be arbitrary. It is an error to return a buffer with a zero size.
fr: *sizehint* est la taille minimale recommandée pour le tampon renvoyé. Il est acceptable de renvoyer des tampons plus petits ou plus grands que ce que suggère *sizehint*. Lorsqu'il est défini à −1, la taille du tampon peut être arbitraire. C'est une erreur de renvoyer un tampon de taille nulle.

source: ``get_buffer()`` must return an object implementing the :ref:`buffer protocol <bufferobjects>`.
fr: ``get_buffer()`` doit renvoyer un objet implémentant le :ref:`protocole tampon <bufferobjects>`.

source: Called when the buffer was updated with the received data.
fr: Appelée lorsque le tampon a été mis à jour avec les données reçues.

source: *nbytes* is the total number of bytes that were written to the buffer.
fr: *nbytes* est le nombre total d'octets qui ont été écrits dans la mémoire tampon.

source: See the documentation of the :meth:`protocol.eof_received() <Protocol.eof_received>` method.
fr: Voir la documentation de la méthode :meth:`protocol.eof_received() <Protocol.eof_received>`.

source: :meth:`~BufferedProtocol.get_buffer` can be called an arbitrary number of times during a connection. However, :meth:`protocol.eof_received() <Protocol.eof_received>` is called at most once and, if called, :meth:`~BufferedProtocol.get_buffer` and :meth:`~BufferedProtocol.buffer_updated` won't be called after it.
fr: :meth:`~BufferedProtocol.get_buffer` peut être appelée un nombre arbitraire de fois pendant une connexion. Cependant, :meth:`protocol.eof_received() <Protocol.eof_received>` est appelée au plus une fois et, si elle est appelée, :meth:`~BufferedProtocol.get_buffer` et :meth:`~BufferedProtocol.buffer_updated` ne seront pas appelées après.

source: Datagram Protocols
fr: Protocoles par datagrammes (non connectés)

source: Datagram Protocol instances should be constructed by protocol factories passed to the :meth:`loop.create_datagram_endpoint` method.
fr: Les instances du protocole par datagrammes doivent être construites par des fabriques de protocole transmises à la méthode :meth:`loop.create_datagram_endpoint`.

source: Called when a datagram is received. *data* is a bytes object containing the incoming data. *addr* is the address of the peer sending the data; the exact format depends on the transport.
fr: Appelée lorsqu'un datagramme est reçu. *data* est un objet bytes contenant les données entrantes. *addr* est l'adresse du pair qui envoie les données ; le format exact dépend du transport.

source: Called when a previous send or receive operation raises an :class:`OSError`. *exc* is the :class:`OSError` instance.
fr: Appelée lorsqu'une opération d'envoi ou de réception précédente lève une :class:`OSError`. *exc* est l'instance :class:`OSError`.

source: This method is called in rare conditions, when the transport (e.g. UDP) detects that a datagram could not be delivered to its recipient. In many conditions though, undeliverable datagrams will be silently dropped.
fr: Cette méthode est appelée dans de rares cas, lorsque le transport (par exemple UDP) détecte qu'un datagramme n'a pas pu être livré à son destinataire. Cependant, il est courant que les datagrammes qui ne peuvent être acheminés soient supprimés silencieusement.

source: On BSD systems (macOS, FreeBSD, etc.) flow control is not supported for datagram protocols, because there is no reliable way to detect send failures caused by writing too many packets.
fr: Sur les systèmes BSD (macOS, FreeBSD, etc.), le contrôle de flux n'est pas pris en charge pour les protocoles par datagrammes, car il n'existe aucun moyen fiable de détecter les échecs d'envoi causés par l'écriture d'un trop grand nombre de paquets.

source: The socket always appears 'ready' and excess packets are dropped. An :class:`OSError` with ``errno`` set to :const:`errno.ENOBUFS` may or may not be raised; if it is raised, it will be reported to :meth:`DatagramProtocol.error_received` but otherwise ignored.
fr: Le connecteur apparaît toujours « prêt » et les paquets en excès sont supprimés. Une :class:`OSError` avec ``errno`` définie sur :const:`errno.ENOBUFS` peut être levée ou non ; si elle est levée, c'est communiqué à :meth:`DatagramProtocol.error_received` et ignoré dans le cas contraire.

source: Subprocess Protocols
fr: Protocoles liés aux sous-processus

source: Subprocess Protocol instances should be constructed by protocol factories passed to the :meth:`loop.subprocess_exec` and :meth:`loop.subprocess_shell` methods.
fr: Les instances de protocole de sous-processus doivent être construites par des fabriques de protocole transmises aux méthodes :meth:`loop.subprocess_exec` et :meth:`loop.subprocess_shell`.

source: Called when the child process writes data into its stdout or stderr pipe.
fr: Appelée lorsqu'un processus enfant écrit sur sa sortie d'erreur ou sa sortie standard.

source: *fd* is the integer file descriptor of the pipe.
fr: *fd* est l'entier représentant le descripteur de fichier du tube.

source: *data* is a non-empty bytes object containing the received data.
fr: *data* est un objet bytes non vide contenant les données reçues.

source: Called when one of the pipes communicating with the child process is closed.
fr: Appelé lorsqu'un des tubes de communication avec un sous-processus est fermé.

source: *fd* is the integer file descriptor that was closed.
fr: *fd* est l'entier représentant le descripteur de fichier qui a été fermé.

source: Called when the child process has exited.
fr: Appelée lorsqu'un processus enfant se termine.

source: Examples
fr: Exemples

source: TCP Echo Server
fr: Serveur *écho* en TCP

source: Create a TCP echo server using the :meth:`loop.create_server` method, send back received data, and close the connection::
fr: Crée un serveur d'écho TCP en utilisant la méthode :meth:`loop.create_server`, renvoie les données reçues et ferme la connexion ::

source: The :ref:`TCP echo server using streams <asyncio-tcp-echo-server-streams>` example uses the high-level :func:`asyncio.start_server` function.
fr: L'exemple :ref:`asyncio-tcp-echo-server-streams` utilise la fonction de haut niveau :func:`asyncio.start_server`.

source: TCP Echo Client
fr: Client *écho* en TCP

source: A TCP echo client using the :meth:`loop.create_connection` method, sends data, and waits until the connection is closed::
fr: Client d'écho TCP utilisant la méthode :meth:`loop.create_connection` envoie des données et attend que la connexion soit fermée ::

source: The :ref:`TCP echo client using streams <asyncio-tcp-echo-client-streams>` example uses the high-level :func:`asyncio.open_connection` function.
fr: L'exemple :ref:`asyncio-tcp-echo-client-streams` utilise la fonction de haut niveau :func:`asyncio.open_connection`.

source: UDP Echo Server
fr: Serveur *écho* en UDP

source: A UDP echo server, using the :meth:`loop.create_datagram_endpoint` method, sends back received data::
fr: Serveur d'écho UDP, utilisant la méthode :meth:`loop.create_datagram_endpoint`, qui renvoie les données reçues ::

source: UDP Echo Client
fr: Client *écho* en UDP

source: A UDP echo client, using the :meth:`loop.create_datagram_endpoint` method, sends data and closes the transport when it receives the answer::
fr: Client d'écho UDP, utilisant la méthode :meth:`loop.create_datagram_endpoint`, qui envoie des données et ferme le transport lorsqu'il reçoit la réponse :

source: Connecting Existing Sockets
fr: Connexion de connecteurs existants

source: Wait until a socket receives data using the :meth:`loop.create_connection` method with a protocol::
fr: Attend qu'un connecteur reçoive des données en utilisant la méthode :meth:`loop.create_connection` avec un protocole ::

source: The :ref:`watch a file descriptor for read events <asyncio_example_watch_fd>` example uses the low-level :meth:`loop.add_reader` method to register an FD.
fr: L'exemple :ref:`asyncio_example_watch_fd` utilise la méthode de bas niveau :meth:`loop.add_reader` pour enregistrer un descripteur de fichier.

source: The :ref:`register an open socket to wait for data using streams <asyncio_example_create_connection-streams>` example uses high-level streams created by the :func:`open_connection` function in a coroutine.
fr: L'exemple :ref:`asyncio_example_create_connection-streams` utilise des flux de haut niveau créés par la fonction :func:`open_connection` dans une coroutine.

source: loop.subprocess_exec() and SubprocessProtocol
fr: *loop.subprocess_exec()* et *SubprocessProtocol*

source: An example of a subprocess protocol used to get the output of a subprocess and to wait for the subprocess exit.
fr: Un exemple de protocole de sous-processus utilisé pour obtenir la sortie d'un sous-processus et attendre la sortie du sous-processus.

source: The subprocess is created by the :meth:`loop.subprocess_exec` method::
fr: Le sous-processus est créé par la méthode :meth:`loop.subprocess_exec` ::

source: See also the :ref:`same example <asyncio_example_create_subprocess_exec>` written using high-level APIs.
fr: Voir aussi le :ref:`même exemple <asyncio_example_create_subprocess_exec>` écrit à l'aide d'API de haut niveau.
