Repository: python/python-docs-fr
Catalog: library/asyncio-queue.po
Languages: fr

source: Queues
fr: Files d'attente (*queues*)

source: **Source code:** :source:`Lib/asyncio/queues.py`
fr: **Code source :** :source:`Lib/asyncore.py`

source: asyncio queues are designed to be similar to classes of the :mod:`queue` module. Although asyncio queues are not thread-safe, they are designed to be used specifically in async/await code.
fr: Les files d'attente *asyncio* sont conçues pour être similaires aux classes du module :mod:`queue`. Bien que les files d'attente *asyncio* ne soient pas compatibles avec les programmes à multiples fils d'exécution, elles sont conçues pour être utilisées spécifiquement dans le code *async/await*.

source: Note that methods of asyncio queues don't have a *timeout* parameter; use :func:`asyncio.wait_for` function to do queue operations with a timeout.
fr: Notez que les méthodes des files d'attente *asyncio* n'ont pas de paramètre *timeout* ; utilisez la fonction :func:`asyncio.wait_for` pour effectuer des opérations de file d'attente avec un délai d'attente.

source: See also the `Examples`_ section below.
fr: Voir également la section `Exemples`_ ci-dessous.

source: Queue
fr: File d'attente (*queue*)

source: A first in, first out (FIFO) queue.
fr: File d'attente premier entré, premier sorti (FIFO pour *fist in, first out*).

source: If *maxsize* is less than or equal to zero, the queue size is infinite. If it is an integer greater than ``0``, then ``await put()`` blocks when the queue reaches *maxsize* until an item is removed by :meth:`get`.
fr: Si *maxsize* est inférieur ou égal à zéro, la taille de la file d'attente est infinie. Si c'est un entier supérieur à ``0``, alors ``await put()`` se bloque lorsque la file d'attente atteint *maxsize* jusqu'à ce qu'un élément soit supprimé par :meth:`get`.

source: Unlike the standard library threading :mod:`queue`, the size of the queue is always known and can be returned by calling the :meth:`qsize` method.
fr: Contrairement à la bibliothèque standard multi-fils :mod:`queue`, la taille de la file d'attente est toujours connue et peut être renvoyée en appelant la méthode :meth:`qsize`.

source: Removed the *loop* parameter.
fr: suppression du paramètre *loop*.

source: This class is :ref:`not thread safe <asyncio-multithreading>`.
fr: Cette classe n'est :ref:`pas compatible avec les fils d'exécution multiples <asyncio-multithreading>`.

source: Number of items allowed in the queue.
fr: Nombre d'éléments autorisés dans la file d'attente.

source: Return ``True`` if the queue is empty, ``False`` otherwise.
fr: Renvoie ``True`` si la file d'attente est vide, ``False`` sinon.

source: Return ``True`` if there are :attr:`maxsize` items in the queue.
fr: Renvoie ``True`` s'il y a :attr:`maxsize` éléments dans la file d'attente.

source: Remove and return an item from the queue. If queue is empty, wait until an item is available.
fr: Supprime et renvoie un élément de la file d'attente. Si la file d'attente est vide, attend qu'un élément soit disponible.

source: Return an item if one is immediately available, else raise :exc:`QueueEmpty`.
fr: Renvoie un élément s'il y en a un immédiatement disponible, sinon lève :exc:`QueueEmpty`.

source: Block until all items in the queue have been received and processed.
fr: Bloque jusqu'à ce que tous les éléments de la file d'attente aient été récupérés et traités.

source: The count of unfinished tasks goes up whenever an item is added to the queue. The count goes down whenever a consumer coroutine calls :meth:`task_done` to indicate that the item was retrieved and all work on it is complete. When the count of unfinished tasks drops to zero, :meth:`join` unblocks.
fr: Le nombre de tâches inachevées augmente chaque fois qu'un élément est ajouté à la file. Ce nombre diminue chaque fois qu'un fil d'exécution consommateur appelle :meth:`task_done` pour indiquer que l'élément a été extrait et que tout le travail à effectuer dessus est terminé. Lorsque le nombre de tâches non terminées devient nul, :meth:`join` débloque.

source: Put an item into the queue. If the queue is full, wait until a free slot is available before adding the item.
fr: Met un élément dans la file d'attente. Si la file d'attente est pleine, attend qu'un emplacement libre soit disponible avant d'ajouter l'élément.

source: Put an item into the queue without blocking.
fr: Ajoute un élément dans la file d'attente sans bloquer.

source: If no free slot is immediately available, raise :exc:`QueueFull`.
fr: Si aucun emplacement libre n'est immédiatement disponible, lève :exc:`QueueFull`.

source: Return the number of items in the queue.
fr: Renvoie le nombre d'éléments dans la file d'attente.

source: Indicate that a formerly enqueued task is complete.
fr: Indique qu'une tâche précédemment mise en file d'attente est terminée.

source: Used by queue consumers. For each :meth:`~Queue.get` used to fetch a task, a subsequent call to :meth:`task_done` tells the queue that the processing on the task is complete.
fr: Utilisé par les consommateurs de file d'attente. Pour chaque :meth:`~Queue.get` utilisé pour récupérer une tâche, un appel ultérieur à :meth:`task_done` indique à la file d'attente que le traitement de la tâche est terminé.

source: If a :meth:`join` is currently blocking, it will resume when all items have been processed (meaning that a :meth:`task_done` call was received for every item that had been :meth:`~Queue.put` into the queue).
fr: Si un :meth:`join` est actuellement bloquant, on reprendra lorsque tous les éléments auront été traités (ce qui signifie qu'un appel à :meth:`task_done` a été effectué pour chaque élément qui a été :meth:`put` dans la file).

source: Raises :exc:`ValueError` if called more times than there were items placed in the queue.
fr: Lève une exception :exc:`ValueError` si elle est appelée plus de fois qu'il n'y avait d'éléments dans la file.

source: Priority Queue
fr: File avec priorité

source: A variant of :class:`Queue`; retrieves entries in priority order (lowest first).
fr: Une variante de :class:`Queue` ; récupère les entrées par ordre de priorité (la plus basse en premier).

source: Entries are typically tuples of the form ``(priority_number, data)``.
fr: Les entrées sont généralement des *n*-uplets de la forme ``(priority_number, data)``.

source: LIFO Queue
fr: Pile (LIFO)

source: A variant of :class:`Queue` that retrieves most recently added entries first (last in, first out).
fr: Une variante de :class:`Queue` qui récupère en premier les entrées les plus récemment ajoutées (dernier entré, premier sorti).

source: This exception is raised when the :meth:`~Queue.get_nowait` method is called on an empty queue.
fr: Cette exception est levée lorsque la méthode :meth:`~Queue.get_nowait` est appelée sur une file d'attente vide.

source: Exception raised when the :meth:`~Queue.put_nowait` method is called on a queue that has reached its *maxsize*.
fr: Exception levée lorsque la méthode :meth:`~Queue.put_nowait` est appelée sur une file d'attente qui a atteint sa *maxsize*.

source: Examples
fr: Exemples

source: Queues can be used to distribute workload between several concurrent tasks::
fr: Les files d'attente peuvent être utilisées pour répartir la charge de travail entre plusieurs tâches simultanées ::
