Repository: python/python-docs-fr
Catalog: library/asyncio-task.po
Languages: fr

source: The context manager produced by :func:`asyncio.timeout` can be rescheduled to a different deadline and inspected.
fr: Le gestionnaire de contexte produit par :func:`asyncio.timeout` peut être reprogrammé à une échéance différente et inspecté.

source: An :ref:`asynchronous context manager <async-context-managers>` for cancelling overdue coroutines.
fr: :ref:`Gestionnaire de contexte asynchrone <async-context-managers>` pour annuler les coroutines en retard.

source: ``when`` should be an absolute time at which the context should time out, as measured by the event loop's clock:
fr: ``when`` doit être un temps absolu au bout duquel le contexte doit expirer, tel que mesuré par l'horloge de la boucle d'événements :

source: If ``when`` is ``None``, the timeout will never trigger.
fr: Si ``when`` vaut ``None``, le délai maximal ne se déclenche jamais.

source: If ``when < loop.time()``, the timeout will trigger on the next iteration of the event loop.
fr: Si ``when < loop.time()``, le délai maximal se déclenche à la prochaine itération de la boucle d'événement.

source: Return the current deadline, or ``None`` if the current deadline is not set.
fr: Renvoie la limite de temps d'exécution définie actuellement, ou ``None`` s'il n'y en a pas.

source: Reschedule the timeout.
fr: Reprogramme le délai d'attente.

source: Return whether the context manager has exceeded its deadline (expired).
fr: Renvoie si le gestionnaire de contexte a dépassé son délai (c.-à-d. s'il a expiré).

source: Timeout context managers can be safely nested.
fr: Les gestionnaires de contexte de délai maximal peuvent être imbriqués en toute sécurité.

source: Similar to :func:`asyncio.timeout`, except *when* is the absolute time to stop waiting, or ``None``.
fr: Semblable à :func:`asyncio.timeout`, sauf que *when* est le temps absolu pour arrêter d'attendre, ou ``None``.

source: Wait for the *aw* :ref:`awaitable <asyncio-awaitables>` to complete with a timeout.
fr: Attend la fin de l':ref:`awaitable <asyncio-awaitables>` *aw* avec délai d'attente.

source: *timeout* can either be ``None`` or a float or int number of seconds to wait for. If *timeout* is ``None``, block until the future completes.
fr: *timeout* peut-être soit ``None``, soit le nombre de secondes (entier ou décimal) d'attente. Si *timeout* vaut ``None``, la fonction s'interrompt jusqu'à ce que le futur s'achève.

source: If a timeout occurs, it cancels the task and raises :exc:`TimeoutError`.
fr: Si le délai d'attente maximal est dépassé, la tâche est annulée et l'exception :exc:`TimeoutError` est levée.

source: To avoid the task :meth:`cancellation <Task.cancel>`, wrap it in :func:`shield`.
fr: Pour empêcher :meth:`l'annulation <Task.cancel>` de la tâche, il est nécessaire de l'encapsuler dans une fonction :func:`shield`.

source: The function will wait until the future is actually cancelled, so the total wait time may exceed the *timeout*. If an exception happens during cancellation, it is propagated.
fr: Cette fonction attend que le futur soit réellement annulé, donc le temps d'attente total peut être supérieur à *timeout*. Si une exception se produit lors de l'annulation, elle est propagée.

source: If the wait is cancelled, the future *aw* is also cancelled.
fr: Si l'attente est annulée, le futur *aw* est également annulé.

source: When *aw* is cancelled due to a timeout, ``wait_for`` waits for *aw* to be cancelled. Previously, it raised :exc:`TimeoutError` immediately.
fr: Si le dépassement du délai d'attente maximal provoque l'annulation de *aw*, ``wait_for`` attend que *aw* soit annulée. Auparavant, l'exception :exc:`TimeoutError` était immédiatement levée.

source: Waiting Primitives
fr: Primitives d'attente

source: Run :class:`~asyncio.Future` and :class:`~asyncio.Task` instances in the *aws* iterable concurrently and block until the condition specified by *return_when*.
fr: Exécute les instances :class:`~asyncio.Future` et :class:`~asyncio.Task` de l'itérable *aws* de manière concurrente, et s'interrompt jusqu'à ce que la condition décrite dans *return_when* soit vraie.

source: Returns two sets of Tasks/Futures: ``(done, pending)``.
fr: Renvoie deux ensembles de *Tasks* / *Futures* : ``(done, pending)``.

source: Usage::
fr: Utilisation ::

source: *timeout* (a float or int), if specified, can be used to control the maximum number of seconds to wait before returning.
fr: *timeout* (entier ou décimal), si précisé, peut-être utilisé pour contrôler le nombre maximal de secondes d'attente avant de se terminer.

source: Note that this function does not raise :exc:`TimeoutError`. Futures or Tasks that aren't done when the timeout occurs are simply returned in the second set.
fr: Cette fonction ne lève pas :exc:`TimeoutError`. Les futurs et les tâches qui ne sont pas finis quand le délai d'attente maximal est dépassé sont tout simplement renvoyés dans le second ensemble.

source: *return_when* indicates when this function should return. It must be one of the following constants:
fr: *return_when* indique quand la fonction doit se terminer. Il peut prendre les valeurs suivantes :

source: Constant
fr: Constante

source: The function will return when any future finishes or is cancelled.
fr: La fonction se termine lorsque n'importe quel futur se termine ou est annulé.

source: The function will return when all futures finish or are cancelled.
fr: La fonction se termine lorsque les *futurs* sont tous finis ou annulés.

source: Unlike :func:`~asyncio.wait_for`, ``wait()`` does not cancel the futures when a timeout occurs.
fr: À la différence de :func:`~asyncio.wait_for`, ``wait()`` n'annule pas les futurs quand le délai d'attente est dépassé.

source: Passing coroutine objects to ``wait()`` directly is forbidden.
fr: Passer directement des objets coroutines à ``wait()`` est interdit.

source: Deprecation warning is emitted if not all awaitable objects in the *aws* iterable are Future-like objects and there is no running event loop.
fr: Un avertissement d'obsolescence est émis si tous les objets en attente dans l'itérable *aws* ne sont pas des objets de type *Future* et qu'il n'y a pas de boucle d'événement en cours d'exécution.

source: Running in Threads
fr: Exécution dans des fils d'exécution (*threads*)

source: Asynchronously run function *func* in a separate thread.
fr: Exécute la fonction *func* de manière asynchrone dans un fil d'exécution séparé.

source: Any \*args and \*\*kwargs supplied for this function are directly passed to *func*. Also, the current :class:`contextvars.Context` is propagated, allowing context variables from the event loop thread to be accessed in the separate thread.
fr: Tous les *\*args* et *\*\*kwargs* fournis à cette fonction sont directement passés à *func*. De plus, le :class:`contextvars.Context` actuel est propagé, ce qui permet d'accéder aux variables de contexte du fil de boucle d'événements dans le fil séparé.

source: Return a coroutine that can be awaited to get the eventual result of *func*.
fr: Renvoie une coroutine qui peut être attendue pour obtenir le résultat éventuel de *func*.

source: This coroutine function is primarily intended to be used for executing IO-bound functions/methods that would otherwise block the event loop if they were run in the main thread. For example::
fr: Cette fonction coroutine est principalement destinée à être utilisée pour exécuter des fonctions/méthodes faisant beaucoup d'entrées-sorties et qui bloqueraient autrement la boucle d'événements si elles étaient exécutées dans le fil d'exécution principal. Par exemple ::

source: Directly calling ``blocking_io()`` in any coroutine would block the event loop for its duration, resulting in an additional 1 second of run time. Instead, by using ``asyncio.to_thread()``, we can run it in a separate thread without blocking the event loop.
fr: Appeler directement ``blocking_io()`` dans n'importe quelle coroutine bloquerait la boucle d'événements pendant sa durée, ce qui entraînerait une seconde supplémentaire de temps d'exécution. Au lieu de cela, en utilisant ``asyncio.to_thread()``, nous pouvons l'exécuter dans un fil d'exécution séparé sans bloquer la boucle d'événements.

source: Due to the :term:`GIL`, ``asyncio.to_thread()`` can typically only be used to make IO-bound functions non-blocking. However, for extension modules that release the GIL or alternative Python implementations that don't have one, ``asyncio.to_thread()`` can also be used for CPU-bound functions.
fr: en raison du :term:`GIL`, ``asyncio.to_thread()`` ne peut généralement être utilisée que pour rendre les fonctions faisant beaucoup d'entrées-sorties non bloquantes. Cependant, pour les modules d'extension qui relâchent le GIL ou les implémentations Python alternatives qui n'en ont pas, ``asyncio.to_thread()`` peut également être utilisée pour les fonctions qui sollicitent beaucoup le processeur.

source: Scheduling From Other Threads
fr: Planification depuis d'autres fils d'exécution

source: Submit a coroutine to the given event loop. Thread-safe.
fr: Enregistre une coroutine dans la boucle d'exécution actuelle. Cette opération est compatible avec les programmes à multiples fils d'exécution (*thread-safe*).

source: Return a :class:`concurrent.futures.Future` to wait for the result from another OS thread.
fr: Renvoie un :class:`concurrent.futures.Future` pour attendre le résultat d'un autre fil d'exécution du système d'exploitation.

source: This function is meant to be called from a different OS thread than the one where the event loop is running. Example::
fr: Cette fonction est faite pour être appelée par un fil d'exécution distinct de celui dans laquelle la boucle d'événement s'exécute. Exemple ::

source: If an exception is raised in the coroutine, the returned Future will be notified. It can also be used to cancel the task in the event loop::
fr: Si une exception est levée dans une coroutine, le futur renvoyé en sera averti. Elle peut également être utilisée pour annuler la tâche de la boucle d'événement ::

source: See the :ref:`concurrency and multithreading <asyncio-multithreading>` section of the documentation.
fr: Voir la section :ref:`exécution concurrente et multi-fils d'exécution <asyncio-multithreading>` de la documentation.

source: Unlike other asyncio functions this function requires the *loop* argument to be passed explicitly.
fr: À la différence des autres fonctions d'*asyncio*, cette fonction requiert que *loop* soit passé de manière explicite.

source: Return the currently running :class:`Task` instance, or ``None`` if no task is running.
fr: Renvoie l'instance de la :class:`Task` en cours d'exécution, ou ``None`` s'il n'y a pas de tâche en cours.

source: If *loop* is ``None`` :func:`get_running_loop` is used to get the current loop.
fr: Si *loop* vaut ``None``, :func:`get_running_loop` est appelée pour récupérer la boucle en cours d'exécution.

source: Return a set of not yet finished :class:`Task` objects run by the loop.
fr: Renvoie l'ensemble des :class:`Task` non terminés en cours d'exécution dans la boucle.

source: If *loop* is ``None``, :func:`get_running_loop` is used for getting current loop.
fr: Si *loop* vaut ``None``, :func:`get_running_loop` est appelée pour récupérer la boucle en cours d'exécution.

source: Return ``True`` if *obj* is a coroutine object.
fr: Renvoie ``True`` si *obj* est un objet coroutine.

source: Task Object
fr: Objets *Task*

source: A :class:`Future-like <Future>` object that runs a Python :ref:`coroutine <coroutine>`. Not thread-safe.
fr: Objet compatible avec :class:`Future <Future>` qui exécute une :ref:`coroutine <coroutine>` Python. Cet objet n'est pas utilisable dans des programmes à fils d'exécution multiples.

source: Tasks are used to run coroutines in event loops. If a coroutine awaits on a Future, the Task suspends the execution of the coroutine and waits for the completion of the Future. When the Future is *done*, the execution of the wrapped coroutine resumes.
fr: Les tâches servent à exécuter des coroutines dans des boucles d'événements. Si une coroutine attend un futur, la tâche interrompt son exécution et attend la fin de ce *futur*. Quand celui-ci est terminé, l'exécution de la coroutine encapsulée reprend.

source: Event loops use cooperative scheduling: an event loop runs one Task at a time. While a Task awaits for the completion of a Future, the event loop runs other Tasks, callbacks, or performs IO operations.
fr: Les boucles d'événement fonctionnent de manière *coopérative* : une boucle d'événement exécute une tâche à la fois. Quand une tâche attend la fin d'un futur, la boucle d'événement exécute d'autres tâches, des fonctions de rappel, ou effectue des opérations d'entrées-sorties.

source: Use the high-level :func:`asyncio.create_task` function to create Tasks, or the low-level :meth:`loop.create_task` or :func:`ensure_future` functions. Manual instantiation of Tasks is discouraged.
fr: La fonction de haut niveau :func:`asyncio.create_task` et les fonctions de bas-niveau :meth:`loop.create_task` ou :func:`ensure_future` permettent de créer des tâches. Il est déconseillé d'instancier manuellement des objets *Task*.

source: To cancel a running Task use the :meth:`cancel` method. Calling it will cause the Task to throw a :exc:`CancelledError` exception into the wrapped coroutine. If a coroutine is awaiting on a Future object during cancellation, the Future object will be cancelled.
fr: La méthode :meth:`cancel` d'une tâche en cours d'exécution permet d'annuler celle-ci. L'appel de cette méthode force la tâche à lever l'exception :exc:`CancelledError` dans la coroutine encapsulée. Si la coroutine attendait un *futur* au moment de l'annulation, celui-ci est annulé.

source: :meth:`cancelled` can be used to check if the Task was cancelled. The method returns ``True`` if the wrapped coroutine did not suppress the :exc:`CancelledError` exception and was actually cancelled.
fr: La méthode :meth:`cancelled` permet de vérifier si la tâche a été annulée. Elle renvoie ``True`` si la coroutine encapsulée n'a pas ignoré l'exception :exc:`CancelledError` et a bien été annulée.

source: :class:`asyncio.Task` inherits from :class:`Future` all of its APIs except :meth:`Future.set_result` and :meth:`Future.set_exception`.
fr: :class:`asyncio.Task` hérite de :class:`Future`, de toute son API, à l'exception de :meth:`Future.set_result` et de :meth:`Future.set_exception`.

source: Added support for the :mod:`contextvars` module.
fr: ajout du support du module :mod:`contextvars`.

source: Deprecation warning is emitted if *loop* is not specified and there is no running event loop.
fr: un avertissement d'obsolescence est émis si *loop* n'est pas spécifié et qu'il n'y a pas de boucle d'événement en cours d'exécution.

source: Return ``True`` if the Task is *done*.
fr: Renvoie ``True`` si la tâche est *achevée*.

source: A Task is *done* when the wrapped coroutine either returned a value, raised an exception, or the Task was cancelled.
fr: Une tâche est dite *achevée* quand la coroutine encapsulée a soit renvoyé une valeur, soit levé une exception, ou que la tâche a été annulée.

source: Return the result of the Task.
fr: Renvoie le résultat de la tâche.

source: If the Task is *done*, the result of the wrapped coroutine is returned (or if the coroutine raised an exception, that exception is re-raised.)
fr: Si la tâche est *achevée*, le résultat de la coroutine encapsulée est renvoyé (sinon, dans le cas où la coroutine a levé une exception, cette exception est de nouveau levée).

source: If the Task has been *cancelled*, this method raises a :exc:`CancelledError` exception.
fr: Si la tâche a été *annulée*, cette méthode lève une exception :exc:`CancelledError`.

source: Return the exception of the Task.
fr: Renvoie l'exception de la tâche.

source: If the wrapped coroutine raised an exception that exception is returned. If the wrapped coroutine returned normally this method returns ``None``.
fr: Si la coroutine encapsulée lève une exception, cette exception est renvoyée. Si la coroutine s'est exécutée normalement, cette méthode renvoie ``None``.

source: If the Task isn't *done* yet, this method raises an :exc:`InvalidStateError` exception.
fr: Si la tâche n'est pas encore *achevée*, cette méthode lève une exception :exc:`InvalidStateError`.

source: Add a callback to be run when the Task is *done*.
fr: Ajoute une fonction de rappel qui sera exécutée quand la tâche sera *achevée*.

source: This method should only be used in low-level callback-based code.
fr: Cette méthode ne doit être utilisée que dans du code basé sur les fonctions de rappel de bas-niveau.

source: See the documentation of :meth:`Future.add_done_callback` for more details.
fr: Se référer à la documentation de :meth:`Future.add_done_callback` pour plus de détails.

source: Remove *callback* from the callbacks list.
fr: Retire *callback* de la liste de fonctions de rappel.

source: See the documentation of :meth:`Future.remove_done_callback` for more details.
fr: Se référer à la documentation de :meth:`Future.remove_done_callback` pour plus de détails.

source: Return the list of stack frames for this Task.
fr: Renvoie une liste représentant la pile d'appels de la tâche.

source: If the wrapped coroutine is not done, this returns the stack where it is suspended. If the coroutine has completed successfully or was cancelled, this returns an empty list. If the coroutine was terminated by an exception, this returns the list of traceback frames.
fr: Si la coroutine encapsulée n'est pas terminée, cette fonction renvoie la pile d'appels à partir de l'endroit où celle-ci est interrompue. Si la coroutine s'est terminée normalement ou a été annulée, cette fonction renvoie une liste vide. Si la coroutine a été terminée par une exception, ceci renvoie la pile d'erreurs.

source: The frames are always ordered from oldest to newest.
fr: La pile est toujours affichée de l'appelant à l'appelé.

source: Only one stack frame is returned for a suspended coroutine.
fr: Une seule ligne est renvoyée si la coroutine est suspendue.

source: The optional *limit* argument sets the maximum number of frames to return; by default all available frames are returned. The ordering of the returned list differs depending on whether a stack or a traceback is returned: the newest frames of a stack are returned, but the oldest frames of a traceback are returned. (This matches the behavior of the traceback module.)
fr: L'argument facultatif *limit* définit le nombre maximal d'appels à renvoyer ; par défaut, tous sont renvoyés. L'ordre de la liste diffère selon la nature de celle-ci : les appels les plus récents d'une pile d'appels sont renvoyés, si la pile est une pile d'erreurs, ce sont les appels les plus anciens qui le sont (dans un souci de cohérence avec le module *traceback*).

source: Print the stack or traceback for this Task.
fr: Affiche la pile d'appels ou d'erreurs de la tâche.

source: This produces output similar to that of the traceback module for the frames retrieved by :meth:`get_stack`.
fr: Le format de sortie des appels produits par :meth:`get_stack` est similaire à celui du module *traceback*.

source: The *limit* argument is passed to :meth:`get_stack` directly.
fr: Le paramètre *limit* est directement passé à :meth:`get_stack`.

source: The *file* argument is an I/O stream to which the output is written; by default output is written to :data:`sys.stdout`.
fr: Le paramètre *file* est un flux d'entrées-sorties sur lequel le résultat est écrit ; par défaut, :data:`sys.stdout`.

source: Return the coroutine object wrapped by the :class:`Task`.
fr: Renvoie l’objet *coroutine* encapsulé par la :class:`Task`.

source: Return the name of the Task.
fr: Renvoie le nom de la tâche.

source: If no name has been explicitly assigned to the Task, the default asyncio Task implementation generates a default name during instantiation.
fr: Si aucun nom n’a été explicitement assigné à la tâche, l’implémentation par défaut d’une *Task* *asyncio* génère un nom par défaut durant l’instanciation.

source: Set the name of the Task.
fr: Définit le nom de la tâche.

source: The *value* argument can be any object, which is then converted to a string.
fr: L’argument *value* peut être n’importe quel objet qui sera ensuite converti en chaine de caractères.

source: In the default Task implementation, the name will be visible in the :func:`repr` output of a task object.
fr: Dans l’implémentation par défaut de *Task*, le nom sera visible dans le résultat de :func:`repr` d’un objet *Task*.

source: Request the Task to be cancelled.
fr: Demande l'annulation d'une tâche.

source: This arranges for a :exc:`CancelledError` exception to be thrown into the wrapped coroutine on the next cycle of the event loop.
fr: Provisionne la levée de l'exception :exc:`CancelledError` dans la coroutine encapsulée. L'exception sera levée au prochain cycle de la boucle d'exécution.

source: The coroutine then has a chance to clean up or even deny the request by suppressing the exception with a :keyword:`try` ... ... ``except CancelledError`` ... :keyword:`finally` block. Therefore, unlike :meth:`Future.cancel`, :meth:`Task.cancel` does not guarantee that the Task will be cancelled, although suppressing cancellation completely is not common and is actively discouraged. Should the coroutine nevertheless decide to suppress the cancellation, it needs to call :meth:`Task.uncancel` in addition to catching the exception.
fr: La coroutine peut alors faire le ménage ou même ignorer la requête en supprimant l'exception à l'aide d'un bloc :keyword:`try` … … ``except CancelledError`` … :keyword:`finally`. Par conséquent, contrairement à :meth:`Future.cancel`, :meth:`Task.cancel` ne garantit pas que la tâche sera annulée, bien qu'ignorer totalement une annulation ne soit ni une pratique courante, ni encouragé. Si la coroutine décide néanmoins de supprimer l'annulation, elle doit appeler :meth:`Task.uncancel` en plus d'intercepter l'exception.

source: Added the *msg* parameter.
fr: ajout du paramètre *msg*.

source: The ``msg`` parameter is propagated from cancelled task to its awaiter.
fr: le paramètre ``msg`` est propagé de la tâche annulée vers celle qui l'attend.

source: The following example illustrates how coroutines can intercept the cancellation request::
fr: L'exemple ci-dessous illustre comment une coroutine peut intercepter une requête d'annulation ::

source: Return ``True`` if the Task is *cancelled*.
fr: Renvoie ``True`` si la tâche est *annulée*.

source: The Task is *cancelled* when the cancellation was requested with :meth:`cancel` and the wrapped coroutine propagated the :exc:`CancelledError` exception thrown into it.
fr: La tâche est *annulée* quand l'annulation a été demandée avec :meth:`cancel` et la coroutine encapsulée a propagé l'exception :exc:`CancelledError` qui a été levée en son sein.

source: Decrement the count of cancellation requests to this Task.
fr: Décrémente le nombre de demandes d'annulation pour cette tâche.

source: Returns the remaining number of cancellation requests.
fr: Renvoie le nombre restant de demandes d'annulation.

source: Note that once execution of a cancelled task completed, further calls to :meth:`uncancel` are ineffective.
fr: Notez qu'une fois l'exécution d'une tâche annulée terminée, les appels ultérieurs à :meth:`uncancel` ne font rien.
