Repository: python/python-docs-fr
Catalog: library/asyncio-stream.po
Languages: fr

source: Streams
fr: Flux (*streams*)

source: **Source code:** :source:`Lib/asyncio/streams.py`
fr: **Code source :** :source:`Lib/asyncore.py`

source: Streams are high-level async/await-ready primitives to work with network connections. Streams allow sending and receiving data without using callbacks or low-level protocols and transports.
fr: Les flux sont des primitives de haut niveau compatibles avec *async*/*await* pour utiliser les connexions réseau. Les flux permettent d'envoyer et de recevoir des données sans utiliser de fonctions de rappel ou des protocoles de bas niveau.

source: Here is an example of a TCP echo client written using asyncio streams::
fr: Voici un exemple de client « écho TCP » écrit en utilisant les flux *asyncio* ::

source: See also the `Examples`_ section below.
fr: Voir également la section `Exemples`_ ci-dessous.

source: Stream Functions
fr: Fonctions de flux

source: The following top-level asyncio functions can be used to create and work with streams:
fr: Les fonctions *asyncio* de haut niveau suivantes peuvent être utilisées pour créer et utiliser des flux :

source: Establish a network connection and return a pair of ``(reader, writer)`` objects.
fr: Établit une connexion réseau et renvoie une paire d'objets ``(lecteur, écrivain)``.

source: The returned *reader* and *writer* objects are instances of :class:`StreamReader` and :class:`StreamWriter` classes.
fr: Les objets *lecteur* et *écrivain* renvoyés sont des instances des classes :class:`StreamReader` et :class:`StreamWriter`.

source: *limit* determines the buffer size limit used by the returned :class:`StreamReader` instance. By default the *limit* is set to 64 KiB.
fr: *limit* détermine la limite de taille de tampon utilisée par l'instance :class:`StreamReader` renvoyée. Par défaut, *limit* est fixée à 64 Kio.

source: The rest of the arguments are passed directly to :meth:`loop.create_connection`.
fr: Le reste des arguments est passé directement à :meth:`loop.create_connection`.

source: The *sock* argument transfers ownership of the socket to the :class:`StreamWriter` created. To close the socket, call its :meth:`~asyncio.StreamWriter.close` method.
fr: l'argument *sock* transfère la propriété du connecteur réseau au :class:`StreamWriter` créé. Pour fermer le connecteur, appelez sa méthode :meth:`~asyncio.StreamWriter.close`.

source: Added the *ssl_handshake_timeout* parameter.
fr: ajout du paramètre *ssl_handshake_timeout*.

source: Added *happy_eyeballs_delay* and *interleave* parameters.
fr: ajout des paramètres *happy_eyeballs_delay* et *interleave*.

source: Removed the *loop* parameter.
fr: suppression du paramètre *loop*.

source: Added the *ssl_shutdown_timeout* parameter.
fr: ajout du paramètre *ssl_shutdown_timeout*.

source: Start a socket server.
fr: Démarre un serveur de connexions

source: The *client_connected_cb* callback is called whenever a new client connection is established. It receives a ``(reader, writer)`` pair as two arguments, instances of the :class:`StreamReader` and :class:`StreamWriter` classes.
fr: La fonction de rappel *client_connected_cb* est appelée chaque fois qu'une nouvelle connexion client est établie. Elle reçoit une paire d'arguments ``(lecteur, écrivain)``, instances des classes :class:`StreamReader` et :class:`StreamWriter`.

source: *client_connected_cb* can be a plain callable or a :ref:`coroutine function <coroutine>`; if it is a coroutine function, it will be automatically scheduled as a :class:`Task`.
fr: *client_connected_cb* peut être un simple appelable ou une fonction :ref:`coroutine <coroutine>` ; s'il s'agit d'une fonction coroutine, elle sera automatiquement planifiée en tant que :class:`Task`.

source: The rest of the arguments are passed directly to :meth:`loop.create_server`.
fr: Le reste des arguments est passé directement à :meth:`loop.create_server`.

source: The *sock* argument transfers ownership of the socket to the server created. To close the socket, call the server's :meth:`~asyncio.Server.close` method.
fr: l'argument *sock* transfère la propriété du connecteur au serveur créé. Pour fermer le connecteur, appelez la méthode :meth:`~asyncio.Server.close` du serveur.

source: Added the *ssl_handshake_timeout* and *start_serving* parameters.
fr: ajout des paramètres *ssl_handshake_timeout* et *start_serving*.

source: Unix Sockets
fr: Connecteurs Unix (*sockets*)

source: Establish a Unix socket connection and return a pair of ``(reader, writer)``.
fr: Ouvre un connecteur Unix et renvoie une paire de ``(lecteur, écrivain)``.

source: Similar to :func:`open_connection` but operates on Unix sockets.
fr: Similaire à :func:`open_connection` mais fonctionne sur les connecteurs Unix.

source: See also the documentation of :meth:`loop.create_unix_connection`.
fr: Voir aussi la documentation de :meth:`loop.create_unix_connection`.

source: :ref:`Availability <availability>`: Unix.
fr: :ref:`Disponibilité <availability>` : Unix.

source: Added the *ssl_handshake_timeout* parameter. The *path* parameter can now be a :term:`path-like object`
fr: ajout du paramètre *ssl_handshake_timeout*. Le paramètre *path* peut désormais être un :term:`objet simili-chemin <path-like object>`

source: Start a Unix socket server.
fr: Démarre un connecteur Unix en mode serveur.

source: Similar to :func:`start_server` but works with Unix sockets.
fr: Similaire à :func:`start_server` mais fonctionne avec les connecteurs Unix.

source: See also the documentation of :meth:`loop.create_unix_server`.
fr: Voir aussi la documentation de :meth:`loop.create_unix_server`.

source: Added the *ssl_handshake_timeout* and *start_serving* parameters. The *path* parameter can now be a :term:`path-like object`.
fr: ajout des paramètres *ssl_handshake_timeout* et *start_serving*. Le paramètre *chemin* peut désormais être un :term:`simili-chemin<path-like object>`.

source: StreamReader
fr: Flux lecteurs (*StreamReader*)

source: Represents a reader object that provides APIs to read data from the IO stream. As an :term:`asynchronous iterable`, the object supports the :keyword:`async for` statement.
fr: Représente un objet lecteur qui fournit des API pour lire les données du flux d'entrée-sortie. En tant que :term:`itérable asynchrone <asynchronous iterable>`, l'objet prend en charge l'instruction :keyword:`async for`.

source: It is not recommended to instantiate *StreamReader* objects directly; use :func:`open_connection` and :func:`start_server` instead.
fr: Il n'est pas recommandé d'instancier directement les objets *StreamReader* ; utilisez :func:`open_connection` et :func:`start_server` à la place.

source: Read up to *n* bytes from the stream.
fr: Lit jusqu'à *n* octets du flux.

source: If *n* is not provided or set to ``-1``, read until EOF, then return all read :class:`bytes`. If EOF was received and the internal buffer is empty, return an empty ``bytes`` object.
fr: Si *n* n'est pas fourni ou défini à ``-1``, lit jusqu'à *EOF*, puis renvoie tous les :class:`bytes` lus. Si *EOF* a été reçu et que le tampon interne est vide, renvoie un objet ``bytes`` vide.

source: If *n* is ``0``, return an empty ``bytes`` object immediately.
fr: Si *n* vaut ``0``, renvoie immédiatement un objet ``bytes`` vide.

source: If *n* is positive, return at most *n* available ``bytes`` as soon as at least 1 byte is available in the internal buffer. If EOF is received before any byte is read, return an empty ``bytes`` object.
fr: Si *n* est positif, renvoie au plus *n* ``bytes`` disponibles dès qu'au moins 1 octet est disponible dans le tampon interne. Si *EOF* est reçu avant qu'aucun octet ne soit lu, renvoie un objet ``bytes`` vide.

source: Read one line, where "line" is a sequence of bytes ending with ``\n``.
fr: Lit une ligne, où une « ligne » est une séquence d'octets se terminant par ``\n``.

source: If EOF is received and ``\n`` was not found, the method returns partially read data.
fr: Si *EOF* est reçu et ``\n`` n'a pas été trouvé, la méthode renvoie des données partiellement lues.

source: If EOF is received and the internal buffer is empty, return an empty ``bytes`` object.
fr: Si *EOF* est reçu et que le tampon interne est vide, renvoie un objet ``bytes`` vide.

source: Read exactly *n* bytes.
fr: Lit exactement *n* octets.

source: Raise an :exc:`IncompleteReadError` if EOF is reached before *n* can be read. Use the :attr:`IncompleteReadError.partial` attribute to get the partially read data.
fr: Lève une :exc:`IncompleteReadError` si *EOF* est atteint avant que *n* octets ne puissent être lus. Utilisez l'attribut :attr:`IncompleteReadError.partial` pour obtenir les données partiellement lues.

source: Read data from the stream until *separator* is found.
fr: Lit les données du flux jusqu'à ce que le *separator* soit trouvé.

source: On success, the data and separator will be removed from the internal buffer (consumed). Returned data will include the separator at the end.
fr: En cas de succès, les données et le séparateur sont supprimés du tampon interne (consommés). Les données renvoyées incluent le séparateur à la fin.

source: If the amount of data read exceeds the configured stream limit, a :exc:`LimitOverrunError` exception is raised, and the data is left in the internal buffer and can be read again.
fr: Si la quantité de données lues dépasse la limite de flux configurée, une exception :exc:`LimitOverrunError` est levée et les données sont laissées dans le tampon interne et peuvent être lues à nouveau.

source: If EOF is reached before the complete separator is found, an :exc:`IncompleteReadError` exception is raised, and the internal buffer is reset. The :attr:`IncompleteReadError.partial` attribute may contain a portion of the separator.
fr: Si *EOF* est atteint avant que le séparateur complet ne soit trouvé, une exception :exc:`IncompleteReadError` est levée et le tampon interne est réinitialisé. L'attribut :attr:`IncompleteReadError.partial` peut contenir une partie du séparateur.

source: Return ``True`` if the buffer is empty and :meth:`feed_eof` was called.
fr: Renvoie ``True`` si le tampon est vide et que :meth:`feed_eof` a été appelée.

source: StreamWriter
fr: Flux écrivains (*StreamWriter*)

source: Represents a writer object that provides APIs to write data to the IO stream.
fr: Représente un objet écrivain qui fournit des API pour écrire des données dans le flux d'entrée-sortie.

source: It is not recommended to instantiate *StreamWriter* objects directly; use :func:`open_connection` and :func:`start_server` instead.
fr: Il n'est pas recommandé d'instancier directement les objets *StreamWriter* ; utilisez :func:`open_connection` et :func:`start_server` à la place.

source: The method attempts to write the *data* to the underlying socket immediately. If that fails, the data is queued in an internal write buffer until it can be sent.
fr: La méthode tente d'écrire immédiatement les *data* dans le connecteur sous-jacent. Si cela échoue, les données sont mises en file d'attente dans un tampon d'écriture interne jusqu'à ce qu'elles puissent être envoyées.

source: The method should be used along with the ``drain()`` method::
fr: La méthode doit être utilisée avec la méthode ``drain()`` ::

source: The method writes a list (or any iterable) of bytes to the underlying socket immediately. If that fails, the data is queued in an internal write buffer until it can be sent.
fr: La méthode écrit immédiatement une liste (ou tout itérable) d'octets dans le connecteur sous-jacent. Si cela échoue, les données sont mises en file d'attente dans un tampon d'écriture interne jusqu'à ce qu'elles puissent être envoyées.

source: The method closes the stream and the underlying socket.
fr: La méthode ferme le flux et le connecteur sous-jacent.

source: The method should be used, though not mandatory, along with the ``wait_closed()`` method::
fr: La méthode doit être utilisée, bien que ce ne soit pas obligatoire, avec la méthode ``wait_closed()`` ::

source: Return ``True`` if the underlying transport supports the :meth:`write_eof` method, ``False`` otherwise.
fr: Renvoie ``True`` si le transport sous-jacent gère la méthode :meth:`write_eof`, ``False`` sinon.

source: Close the write end of the stream after the buffered write data is flushed.
fr: Ferme le flux en écriture après le vidage des données d'écriture en mémoire tampon.

source: Return the underlying asyncio transport.
fr: Renvoie le transport asynchrone sous-jacent.

source: Access optional transport information; see :meth:`BaseTransport.get_extra_info` for details.
fr: Donne accès aux informations de transport facultatives ; voir :meth:`BaseTransport.get_extra_info` pour plus de détails.

source: Wait until it is appropriate to resume writing to the stream. Example::
fr: Attend qu'il soit approprié de reprendre l'écriture dans le flux. Par exemple ::

source: This is a flow control method that interacts with the underlying IO write buffer. When the size of the buffer reaches the high watermark, *drain()* blocks until the size of the buffer is drained down to the low watermark and writing can be resumed. When there is nothing to wait for, the :meth:`drain` returns immediately.
fr: Il s'agit d'une méthode de contrôle de flux qui interagit avec le tampon d'écriture entrée-sortie sous-jacent. Lorsque la taille du tampon atteint la limite haute, *drain()* bloque jusqu'à ce que la taille du tampon soit drainée jusqu'à la limite basse et que l'écriture puisse reprendre. Lorsqu'il n'y a rien à attendre, :meth:`drain` termine immédiatement.

source: Upgrade an existing stream-based connection to TLS.
fr: Bascule la connexion basée sur le flux existant vers TLS.

source: Parameters:
fr: Paramètres :

source: *sslcontext*: a configured instance of :class:`~ssl.SSLContext`.
fr: *sslcontext* : une instance configurée de :class:`~ssl.SSLContext`.

source: *server_hostname*: sets or overrides the host name that the target server's certificate will be matched against.
fr: *server_hostname* : définit ou remplace le nom d'hôte auquel le certificat du serveur cible sera comparé.

source: *ssl_handshake_timeout* is the time in seconds to wait for the TLS handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
fr: *ssl_handshake_timeout* est le temps en secondes à attendre pour que la poignée de main TLS se termine avant d'abandonner la connexion. ``60.0`` secondes si ``None`` (par défaut).

source: Return ``True`` if the stream is closed or in the process of being closed.
fr: Renvoie ``True`` si le flux est fermé ou en cours de fermeture.

source: Wait until the stream is closed.
fr: Attend que le flux soit fermé.

source: Should be called after :meth:`close` to wait until the underlying connection is closed, ensuring that all data has been flushed before e.g. exiting the program.
fr: Doit être appelée après :meth:`close` pour attendre que la connexion sous-jacente soit fermée, en s'assurant que toutes les données ont été vidées avant, par exemple, de quitter le programme.

source: Examples
fr: Exemples

source: TCP echo client using streams
fr: Client d'écho TCP utilisant des flux

source: TCP echo client using the :func:`asyncio.open_connection` function::
fr: Client d'écho TCP utilisant la fonction :func:`asyncio.open_connection` ::

source: The :ref:`TCP echo client protocol <asyncio_example_tcp_echo_client_protocol>` example uses the low-level :meth:`loop.create_connection` method.
fr: L'exemple :ref:`asyncio_example_tcp_echo_client_protocol` utilise la méthode de bas niveau :meth:`loop.create_connection`.

source: TCP echo server using streams
fr: Serveur d'écho TCP utilisant des flux

source: TCP echo server using the :func:`asyncio.start_server` function::
fr: Serveur d'écho TCP utilisant la fonction :func:`asyncio.start_server` ::

source: The :ref:`TCP echo server protocol <asyncio_example_tcp_echo_server_protocol>` example uses the :meth:`loop.create_server` method.
fr: L'exemple de :ref:`asyncio_example_tcp_echo_server_protocol` utilise la méthode :meth:`loop.create_server`.

source: Get HTTP headers
fr: Récupération des en-têtes HTTP

source: Simple example querying HTTP headers of the URL passed on the command line::
fr: Exemple simple d'interrogation des en-têtes HTTP de l'URL transmise sur la ligne de commande ::

source: Usage::
fr: Utilisation ::

source: or with HTTPS::
fr: ou avec HTTPS ::

source: Register an open socket to wait for data using streams
fr: Ouverture d'un connecteur pour attendre les données à l'aide de flux

source: Coroutine waiting until a socket receives data using the :func:`open_connection` function::
fr: Coroutine attendant qu'un connecteur reçoive des données en utilisant la fonction :func:`open_connection` ::

source: The :ref:`register an open socket to wait for data using a protocol <asyncio_example_create_connection>` example uses a low-level protocol and the :meth:`loop.create_connection` method.
fr: L'exemple :ref:`asyncio_example_create_connection` utilise un protocole de bas niveau et la méthode :meth:`loop.create_connection`.

source: The :ref:`watch a file descriptor for read events <asyncio_example_watch_fd>` example uses the low-level :meth:`loop.add_reader` method to watch a file descriptor.
fr: L'exemple :ref:`asyncio_example_watch_fd` utilise la méthode de bas niveau :meth:`loop.add_reader` pour surveiller un descripteur de fichier.
