Repository: python/python-docs-fr
Catalog: library/asyncio-eventloop.po
Languages: fr

source: The protocol instance is coupled with the transport by calling its :meth:`~BaseProtocol.connection_made` method.
fr: L'instance de protocole est couplée au transport en appelant sa méthode :meth:`~BaseProtocol.connection_made`.

source: A ``(transport, protocol)`` tuple is returned on success.
fr: Un *n*-uplet ``(transport, protocol)`` est renvoyé en cas de succès.

source: The created transport is an implementation-dependent bidirectional stream.
fr: Le transport créé est un flux bidirectionnel dépendant de l'implémentation.

source: Other arguments:
fr: Autres arguments :

source: *ssl*: if given and not false, a SSL/TLS transport is created (by default a plain TCP transport is created). If *ssl* is a :class:`ssl.SSLContext` object, this context is used to create the transport; if *ssl* is :const:`True`, a default context returned from :func:`ssl.create_default_context` is used.
fr: *ssl* : s'il est donné et non faux, un transport SSL/TLS est créé (par défaut un transport TCP simple est créé). Si *ssl* est un objet :class:`ssl.SSLContext`, ce contexte est utilisé pour créer le transport ; si *ssl* est :const:`True`, un contexte par défaut renvoyé par :func:`ssl.create_default_context` est utilisé.

source: :ref:`SSL/TLS security considerations <ssl-security>`
fr: :ref:`Considérations sur la sécurité SSL/TLS <ssl-security>`

source: *server_hostname* sets or overrides the hostname that the target server's certificate will be matched against. Should only be passed if *ssl* is not ``None``. By default the value of the *host* argument is used. If *host* is empty, there is no default and you must pass a value for *server_hostname*. If *server_hostname* is an empty string, hostname matching is disabled (which is a serious security risk, allowing for potential man-in-the-middle attacks).
fr: *server_hostname* définit ou remplace le nom d'hôte auquel le certificat du serveur cible sera comparé. Ne doit être passé que si *ssl* n'est pas ``None``. Par défaut, la valeur de l'argument *host* est utilisée. Si *host* est vide, il n'y a pas de valeur par défaut et vous devez transmettre une valeur pour *server_hostname*. Si *server_hostname* est une chaîne vide, la correspondance du nom d'hôte est désactivée (ce qui constitue un risque de sécurité sérieux, permettant des attaques potentielles de type « homme du milieu »).

source: *family*, *proto*, *flags* are the optional address family, protocol and flags to be passed through to getaddrinfo() for *host* resolution. If given, these should all be integers from the corresponding :mod:`socket` module constants.
fr: *family*, *proto*, *flags* sont facultatifs et sont la famille d'adresse, le protocole et les drapeaux à transmettre à *getaddrinfo()* pour la résolution de *host*. S'ils sont fournis, ils doivent tous être des entiers provenant des constantes du module :mod:`socket`.

source: *happy_eyeballs_delay*, if given, enables Happy Eyeballs for this connection. It should be a floating-point number representing the amount of time in seconds to wait for a connection attempt to complete, before starting the next attempt in parallel. This is the "Connection Attempt Delay" as defined in :rfc:`8305`. A sensible default value recommended by the RFC is ``0.25`` (250 milliseconds).
fr: *happy_eyeballs_delay*, s'il est fourni, active Happy Eyeballs pour cette connexion. Il doit s'agir d'un nombre à virgule flottante représentant le temps d'attente en secondes pour qu'une tentative de connexion se termine, avant de démarrer la prochaine tentative en parallèle. Il s'agit du « délai de tentative de connexion » tel que défini dans la :rfc:`8305`. Une valeur par défaut raisonnable recommandée par la RFC est ``0.25`` (250 millisecondes).

source: *interleave* controls address reordering when a host name resolves to multiple IP addresses. If ``0`` or unspecified, no reordering is done, and addresses are tried in the order returned by :meth:`getaddrinfo`. If a positive integer is specified, the addresses are interleaved by address family, and the given integer is interpreted as "First Address Family Count" as defined in :rfc:`8305`. The default is ``0`` if *happy_eyeballs_delay* is not specified, and ``1`` if it is.
fr: *interleave* contrôle la réorganisation des adresses lorsqu'un nom d'hôte se résout en plusieurs adresses IP. S'il vaut ``0`` ou n'est pas spécifié, aucune réorganisation n'est effectuée et les adresses sont essayées dans l'ordre renvoyé par :meth:`getaddrinfo`. Si un entier positif est spécifié, les adresses sont entrelacées par famille d'adresses et l'entier donné est interprété comme "First Address Family Count" tel que défini dans la :rfc:`8305`. La valeur par défaut est ``0`` si *happy_eyeballs_delay* n'est pas spécifié, et ``1`` si c'est le cas.

source: *sock*, if given, should be an existing, already connected :class:`socket.socket` object to be used by the transport. If *sock* is given, none of *host*, *port*, *family*, *proto*, *flags*, *happy_eyeballs_delay*, *interleave* and *local_addr* should be specified.
fr: *sock*, s'il est fourni, doit être un objet :class:`socket.socket` existant et déjà connecté à utiliser par le transport. Si *sock* est donné, aucun des *host*, *port*, *family*, *proto*, *flags*, *happy_eyeballs_delay*, *interleave* et *local_addr* ne doit être spécifié.

source: The *sock* argument transfers ownership of the socket to the transport created. To close the socket, call the transport's :meth:`~asyncio.BaseTransport.close` method.
fr: l'argument *sock* transfère la propriété du connecteur au transport créé. Pour fermer le connecteur, appelez la méthode :meth:`~asyncio.BaseTransport.close` du transport.

source: *local_addr*, if given, is a ``(local_host, local_port)`` tuple used to bind the socket locally. The *local_host* and *local_port* are looked up using ``getaddrinfo()``, similarly to *host* and *port*.
fr: *local_addr*, s'il est fourni, est un *n*-uplet ``(local_host, local_port)`` utilisé pour lier le connecteur localement. *local_host* et *local_port* sont recherchés en utilisant ``getaddrinfo()``, de la même manière que *host* et *port*.

source: *ssl_handshake_timeout* is (for a TLS connection) the time in seconds to wait for the TLS handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
fr: *ssl_handshake_timeout* est (pour une connexion TLS) le temps en secondes à attendre que la poignée de main TLS se termine avant d'abandonner la connexion. ``60.0`` secondes si ``None`` (par défaut).

source: *ssl_shutdown_timeout* is the time in seconds to wait for the SSL shutdown to complete before aborting the connection. ``30.0`` seconds if ``None`` (default).
fr: *ssl_shutdown_timeout* est le temps en secondes à attendre que l'arrêt SSL se termine avant d'abandonner la connexion. ``30.0`` secondes si ``None`` (par défaut).

source: Added support for SSL/TLS in :class:`ProactorEventLoop`.
fr: ajout de la prise en charge de SSL/TLS dans :class:`ProactorEventLoop`.

source: Added the *ssl_handshake_timeout* parameter.
fr: ajout du paramètre *ssl handshake timeout*

source: Added the *happy_eyeballs_delay* and *interleave* parameters.
fr: ajout des paramètres *happy_eyeballs_delay* et *interleave*.

source: Happy Eyeballs Algorithm: Success with Dual-Stack Hosts. When a server's IPv4 path and protocol are working, but the server's IPv6 path and protocol are not working, a dual-stack client application experiences significant connection delay compared to an IPv4-only client. This is undesirable because it causes the dual-stack client to have a worse user experience. This document specifies requirements for algorithms that reduce this user-visible delay and provides an algorithm.
fr: Algorithme Happy Eyeballs : « succès avec les hôtes à double pile ». Lorsque le chemin et le protocole IPv4 d'un serveur fonctionnent, mais que le chemin et le protocole IPv6 du serveur ne fonctionnent pas, une application cliente à double pile subit un retard de connexion important par rapport à un client IPv4 uniquement. Ceci n'est pas souhaitable car cela entraîne une moins bonne expérience utilisateur pour le client à double pile. Ce document spécifie les exigences pour les algorithmes qui réduisent ce délai visible par l'utilisateur et fournit un algorithme correspondant.

source: Added the *ssl_shutdown_timeout* parameter.
fr: ajout du paramètre *ssl shutdown timeout*

source: The :func:`open_connection` function is a high-level alternative API. It returns a pair of (:class:`StreamReader`, :class:`StreamWriter`) that can be used directly in async/await code.
fr: la fonction :func:`open_connection` est une API alternative de haut niveau. Elle renvoie une paire de (:class:`StreamReader`, :class:`StreamWriter`) qui peut être utilisée directement dans le code *async/wait*.

source: Create a datagram connection.
fr: Création d'une connexion par datagramme

source: *protocol_factory* must be a callable returning a :ref:`protocol <asyncio-protocol>` implementation.
fr: *protocol_factory* doit être un appelable gérant le :ref:`protocole asyncio <asyncio-protocol>`.

source: A tuple of ``(transport, protocol)`` is returned on success.
fr: Un *n*-uplet ``(transport, protocol)`` est renvoyé en cas de succès.

source: *local_addr*, if given, is a ``(local_host, local_port)`` tuple used to bind the socket locally. The *local_host* and *local_port* are looked up using :meth:`getaddrinfo`.
fr: *local_addr*, s'il est fourni, est un *n*-uplet ``(local_host, local_port)`` utilisé pour lier le connecteur localement. Le *local_host* et le *local_port* sont recherchés en utilisant :meth:`getaddrinfo`.

source: *remote_addr*, if given, is a ``(remote_host, remote_port)`` tuple used to connect the socket to a remote address. The *remote_host* and *remote_port* are looked up using :meth:`getaddrinfo`.
fr: *remote_addr*, s'il est fourni, est un *n*-uplet ``(remote_host, remote_port)`` utilisé pour se connecter à une adresse distante. Le *remote_host* et le *remote_port* sont recherchés en utilisant :meth:`getaddrinfo`.

source: *family*, *proto*, *flags* are the optional address family, protocol and flags to be passed through to :meth:`getaddrinfo` for *host* resolution. If given, these should all be integers from the corresponding :mod:`socket` module constants.
fr: *family*, *proto*, *flags* sont facultatifs et représentent la famille d'adresse, le protocole et les drapeaux à transmettre à :meth:`getaddrinfo` pour la résolution *host*. S'ils sont fournis, ils doivent tous être des entiers provenant des constantes du module :mod:`socket`.

source: *allow_broadcast* tells the kernel to allow this endpoint to send messages to the broadcast address.
fr: *allow_broadcast* indique au noyau d'autoriser ce point de terminaison à envoyer des messages à l'adresse de *broadcast*.

source: *sock* can optionally be specified in order to use a preexisting, already connected, :class:`socket.socket` object to be used by the transport. If specified, *local_addr* and *remote_addr* should be omitted (must be :const:`None`).
fr: *sock* peut éventuellement être spécifié afin d'utiliser un objet :class:`socket.socket` préexistant, déjà connecté, à utiliser par le transport. Si spécifié, *local_addr* et *remote_addr* doivent être omis (doit être :const:`None`).

source: See :ref:`UDP echo client protocol <asyncio-udp-echo-client-protocol>` and :ref:`UDP echo server protocol <asyncio-udp-echo-server-protocol>` examples.
fr: Voir les exemples :ref:`asyncio-udp-echo-client-protocol` et :ref:`asyncio-udp-echo-server-protocol`.

source: The *family*, *proto*, *flags*, *reuse_address*, *reuse_port*, *allow_broadcast*, and *sock* parameters were added.
fr: les paramètres *family*, *proto*, *flags*, *reuse_address*, *reuse_port*, *allow_broadcast* et *sock* ont été ajoutés.

source: When multiple processes with differing UIDs assign sockets to an identical UDP socket address with ``SO_REUSEADDR``, incoming packets can become randomly distributed among the sockets.
fr: Lorsque plusieurs processus avec des UID différents attribuent des connecteurs à une adresse de connecteur UDP identique avec ``SO_REUSEADDR``, les paquets entrants peuvent être distribués de manière aléatoire entre les connecteurs.

source: Added support for Windows.
fr: prise en charge sur Windows.

source: The *reuse_address* parameter, disabled since Python 3.9.0, 3.8.1, 3.7.6 and 3.6.10, has been entirely removed.
fr: le paramètre *reuse_address*, désactivé depuis Python 3.9.0, 3.8.1, 3.7.6 et 3.6.10, a été entièrement supprimé.

source: Create a Unix connection.
fr: Crée une connexion Unix

source: *path* is the name of a Unix domain socket and is required, unless a *sock* parameter is specified. Abstract Unix sockets, :class:`str`, :class:`bytes`, and :class:`~pathlib.Path` paths are supported.
fr: *path* est le nom d'un connecteur de domaine Unix et est obligatoire, sauf si un paramètre *sock* est spécifié. Les connecteurs Unix abstraits, les chemins :class:`str`, :class:`bytes` et :class:`~pathlib.Path` sont pris en charge.

source: See the documentation of the :meth:`loop.create_connection` method for information about arguments to this method.
fr: Voir la documentation de la méthode :meth:`loop.create_connection` pour plus d'informations sur les arguments de cette méthode.

source: :ref:`Availability <availability>`: Unix.
fr: :ref:`Disponibilité <availability>` : Unix.

source: Added the *ssl_handshake_timeout* parameter. The *path* parameter can now be a :term:`path-like object`.
fr: ajout du paramètre *ssl_handshake_timeout*. Le paramètre *chemin* peut désormais être un :term:`objet simili-chemin <path-like object>`.

source: Creating network servers
fr: Création de serveurs

source: Returns a :class:`Server` object.
fr: Renvoie un objet :class:`Server`.

source: The *host* parameter can be set to several types which determine where the server would be listening:
fr: Le paramètre *host* peut être défini sur plusieurs types qui déterminent où le serveur écoute :

source: If *host* is a string, the TCP server is bound to a single network interface specified by *host*.
fr: Si *host* est une chaîne, le serveur TCP est lié à une seule interface réseau spécifiée par *host*.

source: If *host* is a sequence of strings, the TCP server is bound to all network interfaces specified by the sequence.
fr: Si *host* est une séquence de chaînes, le serveur TCP est lié à toutes les interfaces réseau spécifiées par la séquence.

source: If *host* is an empty string or ``None``, all interfaces are assumed and a list of multiple sockets will be returned (most likely one for IPv4 and another one for IPv6).
fr: Si *host* est une chaîne vide ou ``None``, toutes les interfaces sont prises en compte et une liste de plusieurs connecteurs est renvoyée (probablement une pour IPv4 et une autre pour IPv6).

source: The *port* parameter can be set to specify which port the server should listen on. If ``0`` or ``None`` (the default), a random unused port will be selected (note that if *host* resolves to multiple network interfaces, a different random port will be selected for each interface).
fr: Le paramètre *port* peut être défini pour spécifier sur quel port le serveur doit écouter. Si ``0`` ou ``None`` (la valeur par défaut), un port inutilisé aléatoire est sélectionné (notez que si *host* se résout en plusieurs interfaces réseau, un port aléatoire différent est sélectionné pour chaque interface).

source: *flags* is a bitmask for :meth:`getaddrinfo`.
fr: *flags* est un masque de bits pour :meth:`getaddrinfo`.

source: *sock* can optionally be specified in order to use a preexisting socket object. If specified, *host* and *port* must not be specified.
fr: *sock* peut éventuellement être spécifié afin d'utiliser un objet connecteur préexistant. S'il est spécifié, *host* et *port* ne doivent pas être spécifiés.

source: The *sock* argument transfers ownership of the socket to the server created. To close the socket, call the server's :meth:`~asyncio.Server.close` method.
fr: l'argument *sock* transfère la propriété du connecteur au serveur créé. Pour fermer le connecteur, appelez la méthode :meth:`~asyncio.Server.close` du serveur.

source: *backlog* is the maximum number of queued connections passed to :meth:`~socket.socket.listen` (defaults to 100).
fr: *backlog* est le nombre maximum de connexions en file d'attente passées à :meth:`~socket.socket.listen` (par défaut à 100).

source: *ssl* can be set to an :class:`~ssl.SSLContext` instance to enable TLS over the accepted connections.
fr: *ssl* peut être défini sur une instance :class:`~ssl.SSLContext` pour activer TLS sur les connexions acceptées.

source: *reuse_address* tells the kernel to reuse a local socket in ``TIME_WAIT`` state, without waiting for its natural timeout to expire. If not specified will automatically be set to ``True`` on Unix.
fr: *reuse_address* indique au noyau de réutiliser un connecteur local dans l'état ``TIME_WAIT``, sans attendre l'expiration de son délai d'attente naturel. S'il n'est pas spécifié, il est automatiquement défini sur ``True`` sous Unix.

source: *reuse_port* tells the kernel to allow this endpoint to be bound to the same port as other existing endpoints are bound to, so long as they all set this flag when being created. This option is not supported on Windows.
fr: *reuse_port* indique au noyau d'autoriser ce point de terminaison à être lié au même port que les autres points de terminaison existants, tant qu'ils définissent tous cet indicateur lors de leur création. Cette option n'est pas prise en charge sous Windows.

source: *ssl_handshake_timeout* is (for a TLS server) the time in seconds to wait for the TLS handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
fr: *ssl_handshake_timeout* est (pour un serveur TLS) le temps en secondes à attendre que la poignée de main TLS se termine avant d'abandonner la connexion. ``60.0`` secondes si ``None`` (par défaut).

source: *start_serving* set to ``True`` (the default) causes the created server to start accepting connections immediately. When set to ``False``, the user should await on :meth:`Server.start_serving` or :meth:`Server.serve_forever` to make the server to start accepting connections.
fr: *start_serving* défini à ``True`` (valeur par défaut) fait que le serveur créé commence immédiatement à accepter les connexions. Lorsqu'il est défini sur ``False``, l'utilisateur doit attendre sur :meth:`Server.start_serving` ou :meth:`Server.serve_forever` pour que le serveur commence à accepter les connexions.

source: The *host* parameter can be a sequence of strings.
fr: le paramètre *host* peut être une séquence de chaînes.

source: The :func:`start_server` function is a higher-level alternative API that returns a pair of :class:`StreamReader` and :class:`StreamWriter` that can be used in an async/await code.
fr: la fonction :func:`start_server` est une API alternative de niveau supérieur qui renvoie une paire de :class:`StreamReader` et :class:`StreamWriter` qui peut être utilisée dans un code *async/wait*.

source: *path* is the name of a Unix domain socket, and is required, unless a *sock* argument is provided. Abstract Unix sockets, :class:`str`, :class:`bytes`, and :class:`~pathlib.Path` paths are supported.
fr: *path* est le nom d'un connecteur de domaine Unix et est obligatoire, sauf si un argument *sock* est fourni. Les connecteurs Unix abstraits, les chemins :class:`str`, :class:`bytes` et :class:`~pathlib.Path` sont pris en charge.

source: See the documentation of the :meth:`loop.create_server` method for information about arguments to this method.
fr: Voir la documentation de la méthode :meth:`loop.create_server` pour plus d'informations sur les arguments de cette méthode.

source: Added the *ssl_handshake_timeout* and *start_serving* parameters. The *path* parameter can now be a :class:`~pathlib.Path` object.
fr: ajout des paramètres *ssl_handshake_timeout* et *start_serving*. Le paramètre *path* peut maintenant être un objet :class:`~pathlib.Path`.

source: Wrap an already accepted connection into a transport/protocol pair.
fr: Enveloppe une connexion déjà acceptée dans une paire transport/protocole.

source: This method can be used by servers that accept connections outside of asyncio but that use asyncio to handle them.
fr: Cette méthode peut être utilisée par les serveurs qui acceptent les connexions en dehors d'*asyncio* mais qui utilisent *asyncio* pour les gérer.

source: Parameters:
fr: Paramètres :

source: *sock* is a preexisting socket object returned from :meth:`socket.accept <socket.socket.accept>`.
fr: *sock* est un objet connecteur préexistant renvoyé par :meth:`socket.accept <socket.socket.accept>`.

source: *ssl* can be set to an :class:`~ssl.SSLContext` to enable SSL over the accepted connections.
fr: *ssl* peut être défini sur une :class:`~ssl.SSLContext` pour activer SSL sur les connexions acceptées.

source: *ssl_handshake_timeout* is (for an SSL connection) the time in seconds to wait for the SSL handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
fr: *ssl_handshake_timeout* est (pour une connexion SSL) le temps en secondes à attendre que la poignée de main SSL se termine avant d'abandonner la connexion. ``60.0`` secondes si ``None`` (par défaut).

source: Returns a ``(transport, protocol)`` pair.
fr: Renvoie une paire ``(transport, protocole)``.

source: Transferring files
fr: Transfert de fichiers

source: Send a *file* over a *transport*. Return the total number of bytes sent.
fr: Envoie *file* via *transport*. Renvoie le nombre total d'octets envoyés.

source: The method uses high-performance :meth:`os.sendfile` if available.
fr: La méthode utilise :meth:`os.sendfile` (hautes performances) si elle est disponible.

source: *file* must be a regular file object opened in binary mode.
fr: *file* doit être un objet fichier normal ouvert en mode binaire.

source: *offset* tells from where to start reading the file. If specified, *count* is the total number of bytes to transmit as opposed to sending the file until EOF is reached. File position is always updated, even when this method raises an error, and :meth:`file.tell() <io.IOBase.tell>` can be used to obtain the actual number of bytes sent.
fr: *offset* indique où commencer la lecture du fichier. Si spécifié, *count* est le nombre total d'octets à transmettre, par opposition à l'envoi du fichier jusqu'à ce que EOF soit atteint. La position du fichier est toujours mise à jour, même lorsque cette méthode génère une erreur. :meth:`file.tell() <io.IOBase.tell>` peut être utilisée pour obtenir le nombre d'octets réellement envoyés.

source: *fallback* set to ``True`` makes asyncio to manually read and send the file when the platform does not support the sendfile system call (e.g. Windows or SSL socket on Unix).
fr: *fallback* défini sur ``True`` permet à *asyncio* de lire et d'envoyer manuellement le fichier lorsque la plateforme ne prend pas en charge l'appel système *sendfile* (par exemple, Windows ou connecteur SSL sous Unix).

source: Raise :exc:`SendfileNotAvailableError` if the system does not support the *sendfile* syscall and *fallback* is ``False``.
fr: Lève :exc:`SendfileNotAvailableError` si le système ne prend pas en charge l'appel système *sendfile* et que *fallback* est ``False``.

source: TLS Upgrade
fr: Passage du flux en TLS

source: Upgrade an existing transport-based connection to TLS.
fr: Convertit une connexion existante en connexion TLS.
