Repository: python/python-docs-fr
Catalog: library/asyncio-subprocess.po
Languages: fr

source: Subprocesses
fr: Sous-processus

source: **Source code:** :source:`Lib/asyncio/subprocess.py`, :source:`Lib/asyncio/base_subprocess.py`
fr: **Code source :** :source:`Lib/asyncio/subprocess.py`, :source:`Lib/asyncio/base_subprocess.py`

source: This section describes high-level async/await asyncio APIs to create and manage subprocesses.
fr: Cette section décrit des API de haut niveau de *asyncio* pour créer et gérer des sous-processus via ``async``/``await``.

source: Here's an example of how asyncio can run a shell command and obtain its result::
fr: Voici un exemple de comment *asyncio* peut lancer une commande shell et obtenir son résultat ::

source: will print::
fr: affiche ::

source: Because all asyncio subprocess functions are asynchronous and asyncio provides many tools to work with such functions, it is easy to execute and monitor multiple subprocesses in parallel. It is indeed trivial to modify the above example to run several commands simultaneously::
fr: Puisque toutes les fonctions à sous-processus d'*asyncio* sont synchrones et qu'*asyncio* fournit de nombreux outils pour travailler avec de telles fonctions, il est facile d'exécuter et de surveiller de nombreux processus en parallèle. Il est en effet trivial de modifier l'exemple ci-dessus pour exécuter plusieurs commandes simultanément ::

source: See also the `Examples`_ subsection.
fr: Voir également la section `Exemples`_.

source: Creating Subprocesses
fr: Créer des sous-processus

source: Create a subprocess.
fr: Crée un sous-processus.

source: Return a :class:`~asyncio.subprocess.Process` instance.
fr: Renvoie une instance de :class:`~asyncio.subprocess.Process`.

source: See the documentation of :meth:`loop.subprocess_exec` for other parameters.
fr: Voir la documentation de :meth:`loop.subprocess_exec` pour d'autres paramètres.

source: Removed the *loop* parameter.
fr: suppression du paramètre *loop*.

source: Run the *cmd* shell command.
fr: Exécute la commande *cmd* dans un *shell*.

source: See the documentation of :meth:`loop.subprocess_shell` for other parameters.
fr: Voir la documentation de :meth:`loop.subprocess_shell` pour d'autres paramètres.

source: It is the application's responsibility to ensure that all whitespace and special characters are quoted appropriately to avoid `shell injection <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_ vulnerabilities. The :func:`shlex.quote` function can be used to properly escape whitespace and special shell characters in strings that are going to be used to construct shell commands.
fr: Il est de la responsabilité de l'application de s'assurer que tous les espaces et les caractères spéciaux sont correctement mis entre guillemets pour éviter les vulnérabilités de type `injection de code <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_. La fonction :func:`shlex.quote` peut être utilisée pour l’échappement des espaces et caractères spéciaux dans les chaînes utilisées pour construire des commandes shell.

source: Subprocesses are available for Windows if a :class:`ProactorEventLoop` is used. See :ref:`Subprocess Support on Windows <asyncio-windows-subprocess>` for details.
fr: les sous-processus sont disponibles pour Windows si un :class:`ProactorEventLoop` est utilisé. Voir :ref:`Support des sous-processus sous Windows <asyncio-windows-subprocess>` pour plus de précisions.

source: asyncio also has the following *low-level* APIs to work with subprocesses: :meth:`loop.subprocess_exec`, :meth:`loop.subprocess_shell`, :meth:`loop.connect_read_pipe`, :meth:`loop.connect_write_pipe`, as well as the :ref:`Subprocess Transports <asyncio-subprocess-transports>` and :ref:`Subprocess Protocols <asyncio-subprocess-protocols>`.
fr: *asyncio* propose aussi les API de « bas niveau » suivantes pour travailler avec les sous-processus : :meth:`loop.subprocess_exec`, :meth:`loop.subprocess_shell`, :meth:`loop.connect_read_pipe`, :meth:`loop.connect_write_pipe`, ainsi que les :ref:`asyncio-subprocess-transports` et :ref:`asyncio-subprocess-protocols`.

source: Constants
fr: Constantes

source: Can be passed to the *stdin*, *stdout* or *stderr* parameters.
fr: Peut être passé aux paramètres *stdin*, *stdout* ou *stderr*.

source: If *PIPE* is passed to *stdin* argument, the :attr:`Process.stdin <asyncio.subprocess.Process.stdin>` attribute will point to a :class:`StreamWriter` instance.
fr: Si *PIPE* est passé au paramètre *stdin*, l'attribut :attr:`Process.stdin <asyncio.subprocess.Process.stdin>` ne pointera pas vers une instance de :class:`StreamWriter`.

source: If *PIPE* is passed to *stdout* or *stderr* arguments, the :attr:`Process.stdout <asyncio.subprocess.Process.stdout>` and :attr:`Process.stderr <asyncio.subprocess.Process.stderr>` attributes will point to :class:`StreamReader` instances.
fr: Si *PIPE* est passé au paramètre *stdout* ou *stderr*, l'attribut :attr:`Process.stdout <asyncio.subprocess.Process.stdout>` et :attr:`Process.stderr <asyncio.subprocess.Process.stderr>` pointeront vers des instances de :class:`StreamReader`.

source: Special value that can be used as the *stderr* argument and indicates that standard error should be redirected into standard output.
fr: Une valeur spéciale qui peut être passée au paramètre *stderr* et qui indique que la sortie d'erreur doit être redirigée vers la sortie standard.

source: Special value that can be used as the *stdin*, *stdout* or *stderr* argument to process creation functions. It indicates that the special file :data:`os.devnull` will be used for the corresponding subprocess stream.
fr: Une valeur spéciale qui peut être passée à l'argument *stdin*, *stdout* ou *stderr* des fonctions créant des processus. Elle implique l'utilisation du fichier :data:`os.devnull` pour le flux correspondant du processus.

source: Interacting with Subprocesses
fr: Interagir avec les sous-processus

source: Both :func:`create_subprocess_exec` and :func:`create_subprocess_shell` functions return instances of the *Process* class. *Process* is a high-level wrapper that allows communicating with subprocesses and watching for their completion.
fr: Les fonctions :func:`create_subprocess_exec` et :func:`create_subprocess_shell` renvoient des instances de la classe *Process*. *Process* est une enveloppe de haut niveau qui permet de communiquer avec les sous-processus et de surveiller leur achèvement.

source: An object that wraps OS processes created by the :func:`create_subprocess_exec` and :func:`create_subprocess_shell` functions.
fr: Objet qui encapsule les processus du système d'exploitation créés par les fonctions :func:`create_subprocess_exec` et :func:`create_subprocess_shell`.

source: This class is designed to have a similar API to the :class:`subprocess.Popen` class, but there are some notable differences:
fr: Cette classe est conçue pour avoir une API similaire à la classe :class:`subprocess.Popen`, mais il existe quelques différences notables :

source: unlike Popen, Process instances do not have an equivalent to the :meth:`~subprocess.Popen.poll` method;
fr: contrairement à *Popen*, les instances Process n'ont pas d'équivalent à la méthode :meth:`~subprocess.Popen.poll` ;

source: the :meth:`~asyncio.subprocess.Process.communicate` and :meth:`~asyncio.subprocess.Process.wait` methods don't have a *timeout* parameter: use the :func:`~asyncio.wait_for` function;
fr: les méthodes :meth:`~asyncio.subprocess.Process.communicate` et :meth:`~asyncio.subprocess.Process.wait` n'ont pas de paramètre *timeout* : utilisez la fonction :func:`~asyncio.wait_for` ;

source: the :meth:`Process.wait() <asyncio.subprocess.Process.wait>` method is asynchronous, whereas :meth:`subprocess.Popen.wait` method is implemented as a blocking busy loop;
fr: :meth:`asyncio.subprocess.Process.wait` est asynchrone, tandis que la méthode :meth:`subprocess.Popen.wait` est implémentée comme une boucle bloquante ;

source: the *universal_newlines* parameter is not supported.
fr: le paramètre *universal_newlines* n'est pas pris en charge.

source: This class is :ref:`not thread safe <asyncio-multithreading>`.
fr: Cette classe n'est :ref:`pas conçue pour un contexte multi-fils <asyncio-multithreading>`.

source: See also the :ref:`Subprocess and Threads <asyncio-subprocess-threads>` section.
fr: Voir aussi la section :ref:`sous-processus et fils d'exécution <asyncio-subprocess-threads>`.

source: Wait for the child process to terminate.
fr: Attend que le sous processus s'arrête.

source: Set and return the :attr:`returncode` attribute.
fr: Définit et renvoie l'attribut :attr:`returncode`.

source: This method can deadlock when using ``stdout=PIPE`` or ``stderr=PIPE`` and the child process generates so much output that it blocks waiting for the OS pipe buffer to accept more data. Use the :meth:`communicate` method when using pipes to avoid this condition.
fr: cette méthode peut générer un interblocage quand ``stdout=PIPE`` ou ``stderr=PIPE`` est utilisé et que le sous-processus génère tellement de sorties qu'il se bloque, dans l'attente que le tampon du tube côté OS accepte des données supplémentaires. Pour éviter cette situation, choisissez la méthode :meth:`communicate` quand vous utilisez des tubes.

source: Interact with process:
fr: Interagit avec le processus :

source: send data to *stdin* (if *input* is not ``None``);
fr: envoie des données sur le *stdin* (si *input* n'est pas ``None``) ;

source: read data from *stdout* and *stderr*, until EOF is reached;
fr: lit les données sur *stdout* et *stderr*, jusqu'à ce que le EOF soit atteint ;

source: wait for process to terminate.
fr: attend que le processus s'arrête.

source: The optional *input* argument is the data (:class:`bytes` object) that will be sent to the child process.
fr: Le paramètre optionnel *input* (objet de type :class:`bytes`) représente les données transmises au sous-processus.

source: Return a tuple ``(stdout_data, stderr_data)``.
fr: Renvoie un *n*-uplet ``(stdout_data, stderr_data)``.

source: If either :exc:`BrokenPipeError` or :exc:`ConnectionResetError` exception is raised when writing *input* into *stdin*, the exception is ignored. This condition occurs when the process exits before all data are written into *stdin*.
fr: Si l'une des exceptions :exc:`BrokenPipeError` ou :exc:`ConnectionResetError` est levée lors de l'écriture de *input* dans *stdin*, l'exception est ignorée. Cette condition se produit lorsque le processus se termine avant que toutes les données ne soient écrites dans *stdin*.

source: If it is desired to send data to the process' *stdin*, the process needs to be created with ``stdin=PIPE``. Similarly, to get anything other than ``None`` in the result tuple, the process has to be created with ``stdout=PIPE`` and/or ``stderr=PIPE`` arguments.
fr: Si vous souhaitez envoyer des données au processus *stdin*, le processus doit être créé avec ``stdin=PIPE``. De même, pour obtenir autre chose que ``None`` dans le *n*-uplet résultat, le processus doit être créé avec les arguments ``stdout=PIPE`` et/ou ``stderr=PIPE``.

source: Note, that the data read is buffered in memory, so do not use this method if the data size is large or unlimited.
fr: Notez que les données lues sont mises en cache en mémoire, donc n'utilisez pas cette méthode si la taille des données est importante voire illimitée.

source: Sends the signal *signal* to the child process.
fr: Envoie le signal *signal* au sous-processus.

source: Stop the child process.
fr: Arrête le sous-processus.

source: Kill the child process.
fr: Arrête le sous-processus.

source: On POSIX systems this method sends :py:data:`SIGKILL` to the child process.
fr: Sur les systèmes POSIX, cette méthode envoie :py:data:`signal.SIGTERM` au sous-processus.

source: On Windows this method is an alias for :meth:`terminate`.
fr: Sous Windows, cette méthode est un alias pour :meth:`terminate`.

source: Standard input stream (:class:`StreamWriter`) or ``None`` if the process was created with ``stdin=None``.
fr: Flux d'entrée standard (:class:`StreamWriter`) ou ``None`` si le processus a été créé avec ``stdin=None``.

source: Standard output stream (:class:`StreamReader`) or ``None`` if the process was created with ``stdout=None``.
fr: Flux de sortie standard (:class:`StreamReader`) ou ``None`` si le processus a été créé avec ``stdout=None``.

source: Standard error stream (:class:`StreamReader`) or ``None`` if the process was created with ``stderr=None``.
fr: Flux d'erreur standard (:class:`StreamReader`) ou ``None`` si le processus a été créé avec ``stderr=None``.

source: Use the :meth:`communicate` method rather than :attr:`process.stdin.write() <stdin>`, :attr:`await process.stdout.read() <stdout>` or :attr:`await process.stderr.read() <stderr>`. This avoids deadlocks due to streams pausing reading or writing and blocking the child process.
fr: utilisez la méthode :meth:`communicate` plutôt que :attr:`process.stdin.write() <stdin>`, :attr:`wait process.stdout.read() <stdout>` ou :attr:`wait process.stderr.read() <stderr>`. Cela évite les interblocages dus aux flux qui interrompent la lecture ou l'écriture et bloquent le processus enfant.

source: Process identification number (PID).
fr: Numéro d'identification du processus (PID, pour *Process Identification Number* en anglais).

source: Note that for processes created by the :func:`create_subprocess_shell` function, this attribute is the PID of the spawned shell.
fr: Notez que pour les processus créés par la fonction :func:`create_subprocess_shell`, cet attribut est le PID du shell généré.

source: Return code of the process when it exits.
fr: Code de retour du processus quand il se termine.

source: A ``None`` value indicates that the process has not terminated yet.
fr: Une valeur ``None`` indique que le processus n'est pas encore terminé.

source: A negative value ``-N`` indicates that the child was terminated by signal ``N`` (POSIX only).
fr: Une valeur négative ``-N`` indique que le sous-processus a été terminé par le signal ``N`` (seulement sur les systèmes *POSIX*).

source: Subprocess and Threads
fr: Sous-processus et fils d'exécution

source: Standard asyncio event loop supports running subprocesses from different threads by default.
fr: La boucle d'événement asynchrone standard prend en charge l'exécution de sous-processus à partir de différents fils d'exécution par défaut.

source: On Windows subprocesses are provided by :class:`ProactorEventLoop` only (default), :class:`SelectorEventLoop` has no subprocess support.
fr: Sous Windows, les sous-processus sont fournis par :class:`ProactorEventLoop` uniquement (par défaut), :class:`SelectorEventLoop` ne prend pas en charge les sous-processus.

source: On UNIX *child watchers* are used for subprocess finish waiting, see :ref:`asyncio-watchers` for more info.
fr: Sous UNIX, les *observateurs d'enfants (child watchers)* sont utilisés pour l'attente de fin de sous-processus, voir :ref:`asyncio-watchers` pour plus d'informations.

source: UNIX switched to use :class:`ThreadedChildWatcher` for spawning subprocesses from different threads without any limitation.
fr: UNIX est passé à l'utilisation de :class:`ThreadedChildWatcher` pour générer des sous-processus à partir de différents threads sans aucune limitation.

source: Spawning a subprocess with *inactive* current child watcher raises :exc:`RuntimeError`.
fr: Instancier un sous-processus avec un observateur enfant actuel *inactif* lève l'exception :exc:`RuntimeError`.

source: Note that alternative event loop implementations might have own limitations; please refer to their documentation.
fr: Notez que ces implémentations alternatives de la boucle d'événements peuvent comporter leurs propres limitations. Veuillez vous référer à leur documentation.

source: The :ref:`Concurrency and multithreading in asyncio <asyncio-multithreading>` section.
fr: la section :ref:`Exécution concurrente et multi-fils d'exécution <asyncio-multithreading>`.

source: Examples
fr: Exemples

source: An example using the :class:`~asyncio.subprocess.Process` class to control a subprocess and the :class:`StreamReader` class to read from its standard output.
fr: Un exemple utilisant la classe :class:`~asyncio.subprocess.Process` pour contrôler un sous-processus et la classe :class:`StreamReader` pour lire sa sortie standard.

source: The subprocess is created by the :func:`create_subprocess_exec` function::
fr: Le sous-processus est créé par la fonction :func:`create_subprocess_exec` ::

source: See also the :ref:`same example <asyncio_example_subprocess_proto>` written using low-level APIs.
fr: Voir également :ref:`le même exemple <asyncio_example_subprocess_proto>`, écrit en utilisant des API de bas niveau.
