Repository: python/python-docs-fr
Catalog: library/asyncio-protocol.po
Languages: fr

source: Transports and Protocols
fr: Transports et Protocoles

source: Preface
fr: Préface

source: Transports and Protocols are used by the **low-level** event loop APIs such as :meth:`loop.create_connection`. They use callback-based programming style and enable high-performance implementations of network or IPC protocols (e.g. HTTP).
fr: Les transports et les protocoles sont utilisés par les API de boucle d'événements **de bas niveau** telles que :meth:`loop.create_connection`. Ils utilisent un style de programmation basé sur les fonctions de rappel et permettent des implémentations hautes performances de protocoles réseau (par exemple, HTTP) ou de communication inter-processus (*IPC*).

source: Essentially, transports and protocols should only be used in libraries and frameworks and never in high-level asyncio applications.
fr: Avant tout, les transports et les protocoles ne doivent être utilisés que dans des bibliothèques et des cadriciels et jamais dans des applications asynchrones de haut niveau.

source: This documentation page covers both `Transports`_ and `Protocols`_.
fr: Cette page de documentation couvre à la fois `Transports`_ et `Protocoles`_.

source: At the highest level, the transport is concerned with *how* bytes are transmitted, while the protocol determines *which* bytes to transmit (and to some extent when).
fr: Au plus haut niveau, le transport concerne *comment* les octets sont transmis, tandis que le protocole détermine *quels* octets transmettre (et dans une certaine mesure quand).

source: A different way of saying the same thing: a transport is an abstraction for a socket (or similar I/O endpoint) while a protocol is an abstraction for an application, from the transport's point of view.
fr: Pour l'écrire autrement : un transport est une abstraction pour un connecteur (*socket* ou tout autre point de terminaison d'entrée-sortie) tandis qu'un protocole est une abstraction pour une application, du point de vue du transport.

source: Yet another view is the transport and protocol interfaces together define an abstract interface for using network I/O and interprocess I/O.
fr: Encore une autre vue est que les interfaces de transport et de protocole définissent ensemble une interface abstraite pour utiliser les entrées-sorties réseau et les entrées-sorties inter-processus.

source: There is always a 1:1 relationship between transport and protocol objects: the protocol calls transport methods to send data, while the transport calls protocol methods to pass it data that has been received.
fr: Il existe toujours une relation 1:1 entre les objets de transport et de protocole : le protocole appelle les méthodes de transport pour envoyer des données, tandis que le transport appelle les méthodes de protocole pour lui transmettre les données reçues.

source: Most of connection oriented event loop methods (such as :meth:`loop.create_connection`) usually accept a *protocol_factory* argument used to create a *Protocol* object for an accepted connection, represented by a *Transport* object. Such methods usually return a tuple of ``(transport, protocol)``.
fr: La plupart des méthodes de boucles d'événements orientées connexion (telles que :meth:`loop.create_connection`) acceptent généralement un argument *protocol_factory* utilisé pour créer un objet *Protocol* pour une connexion acceptée, représentée par un objet *Transport*. De telles méthodes renvoient généralement un *n*-uplet ``(transport, protocol)``.

source: Contents
fr: Sommaire

source: This documentation page contains the following sections:
fr: Cette page de documentation contient les sections suivantes :

source: The `Transports`_ section documents asyncio :class:`BaseTransport`, :class:`ReadTransport`, :class:`WriteTransport`, :class:`Transport`, :class:`DatagramTransport`, and :class:`SubprocessTransport` classes.
fr: La section `Transports`_ documente les classes *asyncio* :class:`BaseTransport`, :class:`ReadTransport`, :class:`WriteTransport`, :class:`Transport`, :class:`DatagramTransport` et :class:`SubprocessTransport`.

source: The `Protocols`_ section documents asyncio :class:`BaseProtocol`, :class:`Protocol`, :class:`BufferedProtocol`, :class:`DatagramProtocol`, and :class:`SubprocessProtocol` classes.
fr: La section `Protocols`_ documente les classes *asyncio* :class:`BaseProtocol`, :class:`Protocol`, :class:`BufferedProtocol`, :class:`DatagramProtocol` et :class:`SubprocessProtocol`.

source: The `Examples`_ section showcases how to work with transports, protocols, and low-level event loop APIs.
fr: La section `Examples`_ montre comment utiliser les transports, les protocoles et les API de boucle d'événements de bas niveau.

source: **Source code:** :source:`Lib/asyncio/transports.py`
fr: **Code source :** :source:`Lib/asyncio/transports.py`

source: Transports are classes provided by :mod:`asyncio` in order to abstract various kinds of communication channels.
fr: Les transports sont des classes fournies par :mod:`asyncio` afin d'abstraire différents types de canaux de communication.

source: Transport objects are always instantiated by an :ref:`asyncio event loop <asyncio-event-loop>`.
fr: Les objets de transport sont toujours instanciés par une :ref:`boucle d'événements asyncio <asyncio-event-loop>`.

source: asyncio implements transports for TCP, UDP, SSL, and subprocess pipes. The methods available on a transport depend on the transport's kind.
fr: *asyncio* implémente les transports pour TCP, UDP, SSL et les tubes de sous-processus. Les méthodes disponibles sur un transport dépendent du type de transport.

source: The transport classes are :ref:`not thread safe <asyncio-multithreading>`.
fr: Les classes de transport ne sont :ref:`pas compatibles avec les fils d'exécution multiples <asyncio-multithreading>`.

source: Transports Hierarchy
fr: Hiérarchie des transports

source: Base class for all transports. Contains methods that all asyncio transports share.
fr: Classe de base pour tous les transports. Contient des méthodes partagées par tous les transports *asyncio*.

source: A base transport for write-only connections.
fr: Transport de base pour les connexions en écriture seule.

source: Instances of the *WriteTransport* class are returned from the :meth:`loop.connect_write_pipe` event loop method and are also used by subprocess-related methods like :meth:`loop.subprocess_exec`.
fr: Les instances de la classe *WriteTransport* sont renvoyées par la méthode de boucle d'événements :meth:`loop.connect_write_pipe` et sont également utilisées par les méthodes liées aux sous-processus comme :meth:`loop.subprocess_exec`.

source: A base transport for read-only connections.
fr: Transport de base pour les connexions en lecture seule.

source: Instances of the *ReadTransport* class are returned from the :meth:`loop.connect_read_pipe` event loop method and are also used by subprocess-related methods like :meth:`loop.subprocess_exec`.
fr: Les instances de la classe *ReadTransport* sont renvoyées par la méthode de boucle d'événements :meth:`loop.connect_read_pipe` et sont également utilisées par les méthodes liées aux sous-processus comme :meth:`loop.subprocess_exec`.

source: Interface representing a bidirectional transport, such as a TCP connection.
fr: Interface représentant un transport bidirectionnel, comme une connexion TCP.

source: The user does not instantiate a transport directly; they call a utility function, passing it a protocol factory and other information necessary to create the transport and protocol.
fr: L'utilisateur n'instancie pas un transport directement ; il appelle une fonction utilitaire, lui transmettant une fabrique de protocoles et d'autres informations nécessaires pour créer le transport et le protocole.

source: Instances of the *Transport* class are returned from or used by event loop methods like :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.create_server`, :meth:`loop.sendfile`, etc.
fr: Les instances de la classe *Transport* sont renvoyées ou utilisées par des méthodes de boucle d'événements comme :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.create_server`, :meth:`loop.sendfile`, etc.

source: A transport for datagram (UDP) connections.
fr: Transport pour les connexions par datagrammes (UDP).

source: Instances of the *DatagramTransport* class are returned from the :meth:`loop.create_datagram_endpoint` event loop method.
fr: Les instances de la classe *DatagramTransport* sont renvoyées par la méthode de boucle d'événements :meth:`loop.create_datagram_endpoint`.

source: An abstraction to represent a connection between a parent and its child OS process.
fr: Abstraction pour représenter une connexion entre un parent et son processus enfant au niveau du système d'exploitation.

source: Instances of the *SubprocessTransport* class are returned from event loop methods :meth:`loop.subprocess_shell` and :meth:`loop.subprocess_exec`.
fr: Les instances de la classe *SubprocessTransport* sont renvoyées par les méthodes de boucle d'événements :meth:`loop.subprocess_shell` et :meth:`loop.subprocess_exec`.

source: Base Transport
fr: Classe de base des Transports

source: Close the transport.
fr: Ferme le transport.

source: If the transport has a buffer for outgoing data, buffered data will be flushed asynchronously. No more data will be received. After all buffered data is flushed, the protocol's :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` method will be called with :const:`None` as its argument. The transport should not be used once it is closed.
fr: Si le transport a une mémoire tampon pour les données sortantes, les données mises en mémoire tampon seront vidées de manière asynchrone. Aucune autre donnée ne sera reçue. Une fois que toutes les données mises en mémoire tampon ont été vidées, la méthode :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` sera appelée avec :const:`None` comme argument. Le transport ne doit pas être utilisé une fois qu'il est fermé.

source: Return ``True`` if the transport is closing or is closed.
fr: Renvoie ``True`` si le transport se ferme ou est fermé.

source: Return information about the transport or underlying resources it uses.
fr: Renvoie des informations sur le transport ou les ressources sous-jacentes qu'il utilise.

source: *name* is a string representing the piece of transport-specific information to get.
fr: *name* est une chaîne représentant l'information spécifique au transport à obtenir.

source: *default* is the value to return if the information is not available, or if the transport does not support querying it with the given third-party event loop implementation or on the current platform.
fr: *default* est la valeur à renvoyer si les informations ne sont pas disponibles ou si le transport ne prend pas en charge l'implémentation de boucle d'événements tierce donnée ou la plateforme actuelle.

source: For example, the following code attempts to get the underlying socket object of the transport::
fr: Par exemple, le code suivant tente d'obtenir l'objet *socket* sous-jacent du transport :

source: Categories of information that can be queried on some transports:
fr: Catégories d'informations pouvant être interrogées sur certains transports :

source: ``'peername'``: the remote address to which the socket is connected, result of :meth:`socket.socket.getpeername` (``None`` on error)
fr: ``'peername'`` : l'adresse distante à laquelle le *socket* est connecté, résultat de :meth:`socket.socket.getpeername` (``None`` en cas d'erreur)

source: ``'socket'``: :class:`socket.socket` instance
fr: ``'socket'`` : Instance de :class:`socket.socket`

source: ``'sockname'``: the socket's own address, result of :meth:`socket.socket.getsockname`
fr: ``'sockname'`` : la propre adresse du connecteur, résultat de :meth:`socket.socket.getsockname`

source: SSL socket:
fr: Connecteur (*socket*) SSL :

source: ``'compression'``: the compression algorithm being used as a string, or ``None`` if the connection isn't compressed; result of :meth:`ssl.SSLSocket.compression`
fr: ``'compression'`` : l'algorithme de compression utilisé (chaîne de caractères), ou ``None`` si la connexion n'est pas compressée ; résultat de :meth:`ssl.SSLSocket.compression`

source: ``'cipher'``: a three-value tuple containing the name of the cipher being used, the version of the SSL protocol that defines its use, and the number of secret bits being used; result of :meth:`ssl.SSLSocket.cipher`
fr: ``'cipher'`` : un *n*-uplet à trois valeurs contenant le nom du chiffrement utilisé, la version du protocole SSL qui définit son utilisation et le nombre de bits secrets utilisés ; résultat de :meth:`ssl.SSLSocket.cipher`

source: ``'peercert'``: peer certificate; result of :meth:`ssl.SSLSocket.getpeercert`
fr: ``'peercert'`` : certificat du pair ; résultat de :meth:`ssl.SSLSocket.getpeercert`

source: ``'sslcontext'``: :class:`ssl.SSLContext` instance
fr: ``sslcontext'`` : instance de :class:`ssl.SSLContext`

source: ``'ssl_object'``: :class:`ssl.SSLObject` or :class:`ssl.SSLSocket` instance
fr: ``'ssl_object'`` : instance de :class:`ssl.SSLObject` ou de :class:`ssl.SSLSocket`

source: pipe:
fr: tube :

source: ``'pipe'``: pipe object
fr: ``'pipe'`` : objet *pipe*

source: subprocess:
fr: sous-processus :

source: ``'subprocess'``: :class:`subprocess.Popen` instance
fr: ``'sous-processus'`` : instance de :class:`subprocess.Popen`

source: Set a new protocol.
fr: Change le protocole.

source: Switching protocol should only be done when both protocols are documented to support the switch.
fr: La commutation de protocole ne doit être effectuée que lorsque les deux protocoles sont documentés pour prendre en charge la commutation.

source: Return the current protocol.
fr: Renvoie le protocole courant.

source: Read-only Transports
fr: Transports en lecture seule

source: Return ``True`` if the transport is receiving new data.
fr: Renvoie ``True`` si le transport reçoit de nouvelles données.

source: Pause the receiving end of the transport. No data will be passed to the protocol's :meth:`protocol.data_received() <Protocol.data_received>` method until :meth:`resume_reading` is called.
fr: Met en pause l'extrémité de réception du transport. Aucune donnée ne sera transmise à la méthode :meth:`protocol.data_received() <Protocol.data_received>` du protocole jusqu'à ce que :meth:`resume_reading` soit appelée.

source: The method is idempotent, i.e. it can be called when the transport is already paused or closed.
fr: la méthode est idempotente, c'est-à-dire qu'elle peut être appelée lorsque le transport est déjà en pause ou fermé.

source: Resume the receiving end. The protocol's :meth:`protocol.data_received() <Protocol.data_received>` method will be called once again if some data is available for reading.
fr: Reprend la réception. La méthode :meth:`protocol.data_received() <Protocol.data_received>` du protocole sera appelée à nouveau si certaines données sont disponibles pour la lecture.

source: The method is idempotent, i.e. it can be called when the transport is already reading.
fr: la méthode est idempotente, c'est-à-dire qu'elle peut être appelée alors que le transport est déjà en train de lire.

source: Write-only Transports
fr: Transports en lecture-écriture

source: Close the transport immediately, without waiting for pending operations to complete. Buffered data will be lost. No more data will be received. The protocol's :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` method will eventually be called with :const:`None` as its argument.
fr: Ferme le transport immédiatement, sans attendre la fin des opérations en attente. Les données mises en mémoire tampon sont perdues. Aucune autre donnée ne sera reçue. La méthode :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` du protocole sera éventuellement appelée avec :const:`None` comme argument.

source: Return :const:`True` if the transport supports :meth:`~WriteTransport.write_eof`, :const:`False` if not.
fr: Renvoie :const:`True` si le transport gère :meth:`~WriteTransport.write_eof`, :const:`False` sinon.

source: Return the current size of the output buffer used by the transport.
fr: Renvoie la taille actuelle du tampon de sortie utilisé par le transport.

source: Get the *high* and *low* watermarks for write flow control. Return a tuple ``(low, high)`` where *low* and *high* are positive number of bytes.
fr: Obtient les seuils *high* et *low* pour le contrôle du flux d'écriture. Renvoie un *n*-uplet ``(low, high)`` où *low* et *high* sont des nombres positifs d'octets.

source: Use :meth:`set_write_buffer_limits` to set the limits.
fr: Utilisez :meth:`set_write_buffer_limits` pour définir les limites.

source: Set the *high* and *low* watermarks for write flow control.
fr: Définit les seuils *high* et *low* pour le contrôle du flux d'écriture.

source: These two values (measured in number of bytes) control when the protocol's :meth:`protocol.pause_writing() <BaseProtocol.pause_writing>` and :meth:`protocol.resume_writing() <BaseProtocol.resume_writing>` methods are called. If specified, the low watermark must be less than or equal to the high watermark. Neither *high* nor *low* can be negative.
fr: Ces deux valeurs (mesurées en nombre d'octets) contrôlent quand les méthodes :meth:`protocol.pause_writing() <BaseProtocol.pause_writing>` et :meth:`protocol.resume_writing() <BaseProtocol.resume_writing>` du protocole sont appelées. S'il est spécifié, le seuil bas doit être inférieur ou égal au seuil haut. Ni *high* ni *low* ne peuvent être négatifs.

source: :meth:`~BaseProtocol.pause_writing` is called when the buffer size becomes greater than or equal to the *high* value. If writing has been paused, :meth:`~BaseProtocol.resume_writing` is called when the buffer size becomes less than or equal to the *low* value.
fr: :meth:`~BaseProtocol.pause_writing` est appelée lorsque la taille du tampon devient supérieure ou égale à la valeur *high*. Si l'écriture a été interrompue, :meth:`~BaseProtocol.resume_writing` est appelée lorsque la taille du tampon devient inférieure ou égale à la valeur *low*.

source: The defaults are implementation-specific. If only the high watermark is given, the low watermark defaults to an implementation-specific value less than or equal to the high watermark. Setting *high* to zero forces *low* to zero as well, and causes :meth:`~BaseProtocol.pause_writing` to be called whenever the buffer becomes non-empty. Setting *low* to zero causes :meth:`~BaseProtocol.resume_writing` to be called only once the buffer is empty. Use of zero for either limit is generally sub-optimal as it reduces opportunities for doing I/O and computation concurrently.
fr: Les valeurs par défaut sont spécifiques à l'implémentation. Si seul le seuil supérieur est donné, le seuil bas prend par défaut une valeur spécifique à l'implémentation inférieure ou égale au seuil supérieur. Définir *high* sur zéro force également *low* sur zéro et provoque l'appel de :meth:`~BaseProtocol.pause_writing` chaque fois que le tampon devient non vide. Définir *low* sur zéro entraîne l'appel de :meth:`~BaseProtocol.resume_writing` uniquement une fois que le tampon est vide. L'utilisation de zéro pour l'un ou l'autre seuil est généralement sous-optimal car cela réduit les possibilités d'effectuer des entrées-sorties et des calculs simultanément.

source: Use :meth:`~WriteTransport.get_write_buffer_limits` to get the limits.
fr: Utilisez :meth:`~WriteTransport.get_write_buffer_limits` pour obtenir les limites.

source: Write some *data* bytes to the transport.
fr: Écrit des octets de *data* sur le transport.

source: This method does not block; it buffers the data and arranges for it to be sent out asynchronously.
fr: Cette méthode ne bloque pas ; elle met les données en mémoire tampon et s'arrange pour qu'elles soient envoyées de manière asynchrone.

source: Write a list (or any iterable) of data bytes to the transport. This is functionally equivalent to calling :meth:`write` on each element yielded by the iterable, but may be implemented more efficiently.
fr: Écrit une liste (ou tout itérable) d'octets de données dans le transport. Ceci est fonctionnellement équivalent à appeler :meth:`write` sur chaque élément produit par l'itérable, mais peut être implémentée plus efficacement.

source: Close the write end of the transport after flushing all buffered data. Data may still be received.
fr: Ferme l'extrémité d'écriture du transport après avoir vidé toutes les données mises en mémoire tampon. Des données peuvent encore être reçues.

source: This method can raise :exc:`NotImplementedError` if the transport (e.g. SSL) doesn't support half-closed connections.
fr: Cette méthode peut lever :exc:`NotImplementedError` si le transport (par exemple SSL) ne prend pas en charge les connexions semi-fermées.

source: Datagram Transports
fr: Transports par datagrammes

source: Send the *data* bytes to the remote peer given by *addr* (a transport-dependent target address). If *addr* is :const:`None`, the data is sent to the target address given on transport creation.
fr: Envoie les octets *data* au pair distant indiqué par *addr* (une adresse cible dépendante du transport). Si *addr* est :const:`None`, les données sont envoyées à l'adresse cible indiquée lors de la création du transport.

source: Close the transport immediately, without waiting for pending operations to complete. Buffered data will be lost. No more data will be received. The protocol's :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` method will eventually be called with :const:`None` as its argument.
fr: Ferme le transport immédiatement, sans attendre la fin des opérations en attente. Les données mises en mémoire tampon sont perdues. Aucune autre donnée ne sera reçue. La méthode :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` du protocole sera éventuellement appelée avec :const:`None` comme argument.

source: Subprocess Transports
fr: Transports entre sous-processus

source: Return the subprocess process id as an integer.
fr: Renvoie l'identifiant du sous processus sous la forme d'un nombre entier.

source: Return the transport for the communication pipe corresponding to the integer file descriptor *fd*:
fr: Renvoie le transport pour le canal de communication correspondant au descripteur de fichier *fd* donné sous forme d'un entier :

source: ``0``: readable streaming transport of the standard input (*stdin*), or :const:`None` if the subprocess was not created with ``stdin=PIPE``
fr: ``0`` : transport de flux en lecture de l'entrée standard (*stdin*), ou :const:`None` si le sous-processus n'a pas été créé avec ``stdin=PIPE``

source: ``1``: writable streaming transport of the standard output (*stdout*), or :const:`None` if the subprocess was not created with ``stdout=PIPE``
fr: ``1`` : transport de flux en écriture de la sortie standard (*stdout*), ou :const:`None` si le sous-processus n'a pas été créé avec ``stdout=PIPE``

source: ``2``: writable streaming transport of the standard error (*stderr*), or :const:`None` if the subprocess was not created with ``stderr=PIPE``
fr: ``2`` : transport de flux en écriture de l'erreur standard (*stderr*), ou :const:`None` si le sous-processus n'a pas été créé avec ``stderr=PIPE``

source: other *fd*: :const:`None`
fr: autre *fd* : :const:`None`

source: Return the subprocess return code as an integer or :const:`None` if it hasn't returned, which is similar to the :attr:`subprocess.Popen.returncode` attribute.
fr: Renvoie le code de retour du sous-processus sous la forme d'un entier ou :const:`None` s'il n'a pas été renvoyé, ce qui est similaire à l'attribut :attr:`subprocess.Popen.returncode`.

source: Kill the subprocess.
fr: Tue le sous-processus.
