Repository: python/python-docs-fr
Catalog: library/asyncio-dev.po
Languages: fr

source: Developing with asyncio
fr: Programmer avec *asyncio*

source: Asynchronous programming is different from classic "sequential" programming.
fr: La programmation asynchrone est différente de la programmation « séquentielle » classique.

source: This page lists common mistakes and traps and explains how to avoid them.
fr: Cette page liste les pièges et erreurs communs que le développeur pourrait rencontrer et décrit comment les éviter.

source: Debug Mode
fr: Mode débogage

source: By default asyncio runs in production mode. In order to ease the development asyncio has a *debug mode*.
fr: Par défaut, *asyncio* s'exécute en mode production. Pour faciliter le développement, *asyncio* possède un « mode débogage ».

source: There are several ways to enable asyncio debug mode:
fr: Il existe plusieurs façons d'activer le mode débogage de *asyncio* :

source: Setting the :envvar:`PYTHONASYNCIODEBUG` environment variable to ``1``.
fr: en réglant la variable d’environnement :envvar:`PYTHONASYNCIODEBUG` à ``1`` ;

source: Using the :ref:`Python Development Mode <devmode>`.
fr: en utilisant le mode développement de Python (:ref:`Python Development Mode <devmode>`) ;

source: Passing ``debug=True`` to :func:`asyncio.run`.
fr: en passant ``debug=True`` à la fonction :func:`asyncio.run` ;

source: Calling :meth:`loop.set_debug`.
fr: en appelant la méthode :meth:`loop.set_debug`.

source: In addition to enabling the debug mode, consider also:
fr: En plus d'activer le mode débogage, vous pouvez également :

source: setting the log level of the :ref:`asyncio logger <asyncio-logger>` to :py:data:`logging.DEBUG`, for example the following snippet of code can be run at startup of the application::
fr: régler le niveau de journalisation pour l'enregistreur d'*asyncio* (:ref:`asyncio logger <asyncio-logger>`) à :py:data:`logging.DEBUG` ; par exemple, le fragment de code suivant peut être exécuté au démarrage de l'application ::

source: configuring the :mod:`warnings` module to display :exc:`ResourceWarning` warnings. One way of doing that is by using the :option:`-W` ``default`` command line option.
fr: configurer le module :mod:`warnings` afin d'afficher les avertissements de type :exc:`ResourceWarning` ; vous pouvez faire cela en utilisant l'option :option:`-W` ``default`` sur la ligne de commande.

source: When the debug mode is enabled:
fr: Lorsque le mode débogage est activé :

source: asyncio checks for :ref:`coroutines that were not awaited <asyncio-coroutine-not-scheduled>` and logs them; this mitigates the "forgotten await" pitfall.
fr: *asyncio* surveille les :ref:`coroutines qui ne sont jamais attendues <asyncio-coroutine-not-scheduled>` et les journalise ; cela atténue le problème des « *await* oubliés » ;

source: Many non-threadsafe asyncio APIs (such as :meth:`loop.call_soon` and :meth:`loop.call_at` methods) raise an exception if they are called from a wrong thread.
fr: beaucoup d'*API* *asyncio* ne prenant pas en charge les fils d'exécution multiples (comme les méthodes :meth:`loop.call_soon` et :meth:`loop.call_at`) lèvent une exception si elles sont appelées par le mauvais fil d’exécution ;

source: The execution time of the I/O selector is logged if it takes too long to perform an I/O operation.
fr: le temps d'exécution du sélecteur d'entrée-sortie est journalisé si une opération prend trop de temps à s'effectuer ;

source: Callbacks taking longer than 100ms are logged. The :attr:`loop.slow_callback_duration` attribute can be used to set the minimum execution duration in seconds that is considered "slow".
fr: les fonctions de rappel prenant plus de 100 ms sont journalisées ; l'attribut :attr:`loop.slow_callback_duration` peut être utilisé pour changer la limite (en secondes) après laquelle une fonction de rappel est considérée comme « lent ».

source: Concurrency and Multithreading
fr: Programmation concurrente et multi-fils

source: An event loop runs in a thread (typically the main thread) and executes all callbacks and Tasks in its thread. While a Task is running in the event loop, no other Tasks can run in the same thread. When a Task executes an ``await`` expression, the running Task gets suspended, and the event loop executes the next Task.
fr: Une boucle d'évènements s'exécute dans un fil d’exécution (typiquement dans le fil principal) et traite toutes les fonctions de rappel (*callbacks*) ainsi que toutes les tâches dans ce même fil. Lorsqu'une tâche est en cours d'exécution dans la boucle d'évènements, aucune autre tâche ne peut s'exécuter dans ce fil. Quand une tâche traite une expression ``await``, elle se suspend et laisse la boucle d’évènements traiter la tâche suivante.

source: To schedule a :term:`callback` from another OS thread, the :meth:`loop.call_soon_threadsafe` method should be used. Example::
fr: Pour planifier un :term:`rappel <callback>` depuis un autre fil d'exécution système, utilisez la méthode :meth:`loop.call_soon_threadsafe`. Par exemple ::

source: Almost all asyncio objects are not thread safe, which is typically not a problem unless there is code that works with them from outside of a Task or a callback. If there's a need for such code to call a low-level asyncio API, the :meth:`loop.call_soon_threadsafe` method should be used, e.g.::
fr: La plupart des objets *asyncio* ne sont pas conçus pour être exécutés dans un contexte multi-fils (*thread-safe*) mais cela n'est en général pas un problème à moins que l'objet ne fasse appel à du code se trouvant en dehors d'une tâche ou d'une fonction de rappel. Dans ce dernier cas, si le code appelle les *API* bas niveau de *asyncio*, utilisez la méthode :meth:`loop.call_soon_threadsafe`. Par exemple ::

source: To schedule a coroutine object from a different OS thread, the :func:`run_coroutine_threadsafe` function should be used. It returns a :class:`concurrent.futures.Future` to access the result::
fr: Pour planifier un objet concurrent depuis un autre fil d'exécution système, utilisez :func:`run_coroutine_threadsafe`. Cette fonction renvoie un objet :class:`concurrent.futures.Future` pour accéder au résultat ::

source: To handle signals and to execute subprocesses, the event loop must be run in the main thread.
fr: Pour pouvoir traiter les signaux et démarrer des processus enfants, la boucle d'évènements doit être exécutée dans le fil principal.

source: The :meth:`loop.run_in_executor` method can be used with a :class:`concurrent.futures.ThreadPoolExecutor` to execute blocking code in a different OS thread without blocking the OS thread that the event loop runs in.
fr: La méthode :meth:`loop.run_in_executor` peut être utilisée avec :class:`concurrent.futures.ThreadPoolExecutor` pour exécuter du code bloquant dans un autre fil d'exécution, afin de ne pas bloquer le fil où la boucle d'évènements se trouve.

source: Running Blocking Code
fr: Exécution de code bloquant

source: Blocking (CPU-bound) code should not be called directly. For example, if a function performs a CPU-intensive calculation for 1 second, all concurrent asyncio Tasks and IO operations would be delayed by 1 second.
fr: Du code bloquant sur des opérations de calcul (*CPU-bound*) ne devrait pas être appelé directement. Par exemple, si une fonction effectue des calculs utilisant le CPU intensivement pendant une seconde, toutes les tâches *asyncio* concurrentes et les opérations d'entrées-sorties seront bloquées pour une seconde.

source: An executor can be used to run a task in a different thread or even in a different process to avoid blocking the OS thread with the event loop. See the :meth:`loop.run_in_executor` method for more details.
fr: Un exécuteur peut être utilisé pour traiter une tâche dans un fil d'exécution ou un processus différent, afin d'éviter de bloquer le fil d'exécution système dans lequel se trouve la boucle d’évènements. Voir :meth:`loop.run_in_executor` pour plus de détails.

source: Logging
fr: Journalisation

source: asyncio uses the :mod:`logging` module and all logging is performed via the ``"asyncio"`` logger.
fr: *Asyncio* utilise le module :mod:`logging`. Toutes les opérations de journalisation sont effectuées via l'enregistreur (*logger*) ``"asyncio"``.

source: The default log level is :py:data:`logging.INFO`, which can be easily adjusted::
fr: Le niveau de journalisation par défaut est :py:data:`logging.INFO` mais peut être ajusté facilement ::

source: Detect never-awaited coroutines
fr: Détection des coroutines jamais attendues

source: When a coroutine function is called, but not awaited (e.g. ``coro()`` instead of ``await coro()``) or the coroutine is not scheduled with :meth:`asyncio.create_task`, asyncio will emit a :exc:`RuntimeWarning`::
fr: Lorsqu'une fonction coroutine est appelée mais qu'elle n'est pas attendue (p. ex. ``coro()`` au lieu de ``await coro()``) ou si la coroutine n'est pas planifiée avec :meth:`asyncio.create_task`, *asyncio* émet un :exc:`RuntimeWarning` ::

source: Output::
fr: Sortie ::

source: Output in debug mode::
fr: Affichage en mode débogage ::

source: The usual fix is to either await the coroutine or call the :meth:`asyncio.create_task` function::
fr: La façon habituelle de régler ce problème est d'attendre (*await*) la coroutine ou bien d'appeler la fonction :meth:`asyncio.create_task` ::

source: Detect never-retrieved exceptions
fr: Détection des exceptions jamais récupérées

source: If a :meth:`Future.set_exception` is called but the Future object is never awaited on, the exception would never be propagated to the user code. In this case, asyncio would emit a log message when the Future object is garbage collected.
fr: Si la méthode :meth:`Future.set_exception` est appelée mais que l'objet *Future* n'est pas attendu, l'exception n'est pas propagée au code utilisateur. Dans ce cas, *asyncio* écrit un message dans le journal lorsque l'objet *Future* est récupéré par le ramasse-miette.

source: Example of an unhandled exception::
fr: Exemple d'une exception non-gérée ::

source: :ref:`Enable the debug mode <asyncio-debug-mode>` to get the traceback where the task was created::
fr: :ref:`Activez le mode débogage <asyncio-debug-mode>` pour récupérer la trace d'appels indiquant où la tâche a été créée ::
