Repository: python/python-docs-fr
Catalog: library/asyncio-policy.po
Languages: fr

source: Policies
fr: Politiques

source: An event loop policy is a global object used to get and set the current :ref:`event loop <asyncio-event-loop>`, as well as create new event loops. The default policy can be :ref:`replaced <asyncio-policy-get-set>` with :ref:`built-in alternatives <asyncio-policy-builtin>` to use different event loop implementations, or substituted by a :ref:`custom policy <asyncio-custom-policies>` that can override these behaviors.
fr: Une politique de boucle d'événements est un objet global utilisé pour obtenir et définir la :ref:`boucle d'événements <asyncio-event-loop>` actuelle, ainsi que créer de nouvelles boucles d'événements. La politique par défaut peut être :ref:`remplacée <asyncio-policy-get-set>` par des :ref:`alternatives intégrées <asyncio-policy-builtin>` afin d'utiliser d'autres implémentations de boucles d'événements, ou remplacée par une :ref:`politique personnalisée <asyncio-custom-policies>` qui peut remplacer ces comportements.

source: The :ref:`policy object <asyncio-policy-objects>` gets and sets a separate event loop per *context*. This is per-thread by default, though custom policies could define *context* differently.
fr: Un :ref:`objet politique <asyncio-policy-objects>` définit la notion de *contexte* et gère une boucle d'événement distincte par contexte. Ceci est valable fil par fil d'exécution par défaut, bien que les politiques personnalisées puissent définir le *contexte* différemment.

source: Custom event loop policies can control the behavior of :func:`get_event_loop`, :func:`set_event_loop`, and :func:`new_event_loop`.
fr: En utilisant une politique de boucle d'événement personnalisée, le comportement des fonctions :func:`get_event_loop`, :func:`set_event_loop` et :func:`new_event_loop` peut être personnalisé.

source: Policy objects should implement the APIs defined in the :class:`AbstractEventLoopPolicy` abstract base class.
fr: Les objets politiques doivent implémenter les API définies dans la classe mère abstraite :class:`AbstractEventLoopPolicy`.

source: Getting and Setting the Policy
fr: Obtenir et définir la politique

source: The following functions can be used to get and set the policy for the current process:
fr: Les fonctions suivantes peuvent être utilisées pour obtenir et définir la politique du processus en cours :

source: Return the current process-wide policy.
fr: Renvoie la politique actuelle à l'échelle du processus.

source: Set the current process-wide policy to *policy*.
fr: Définit la politique actuelle sur l'ensemble du processus sur *policy*.

source: If *policy* is set to ``None``, the default policy is restored.
fr: Si *policy* est définie sur ``None``, la politique par défaut est restaurée.

source: Policy Objects
fr: Objets politiques

source: The abstract event loop policy base class is defined as follows:
fr: La classe mère abstraite de la politique de boucle d'événements est définie comme suit :

source: An abstract base class for asyncio policies.
fr: Une classe de base abstraite pour les politiques *asyncio*.

source: Get the event loop for the current context.
fr: Récupère la boucle d'évènements pour le contexte actuel.

source: Return an event loop object implementing the :class:`AbstractEventLoop` interface.
fr: Renvoie un objet de boucle d'événements en implémentant l'interface :class:`AbstractEventLoop`.

source: This method should never return ``None``.
fr: Cette méthode ne devrait jamais renvoyer ``None``.

source: Set the event loop for the current context to *loop*.
fr: Définit la boucle d'événements du contexte actuel sur *loop*.

source: Create and return a new event loop object.
fr: Crée et renvoie un nouvel objet de boucle d'événements.

source: Get a child process watcher object.
fr: Récupère un objet observateur du processus enfant.

source: Return a watcher object implementing the :class:`AbstractChildWatcher` interface.
fr: Renvoie un objet observateur implémentant l'interface :class:`AbstractChildWatcher`.

source: This function is Unix specific.
fr: Cette fonction est spécifique à Unix.

source: Set the current child process watcher to *watcher*.
fr: Définit l'observateur du processus enfant actuel à *watcher*.

source: asyncio ships with the following built-in policies:
fr: *asyncio* est livré avec les politiques intégrées suivantes :

source: The default asyncio policy. Uses :class:`SelectorEventLoop` on Unix and :class:`ProactorEventLoop` on Windows.
fr: La politique *asyncio* par défaut. Utilise :class:`SelectorEventLoop` sur les plates-formes Unix et :class:`ProactorEventLoop` sur Windows.

source: There is no need to install the default policy manually. asyncio is configured to use the default policy automatically.
fr: Il n'est pas nécessaire d'installer la politique par défaut manuellement. *asyncio* est configuré pour utiliser automatiquement la politique par défaut.

source: On Windows, :class:`ProactorEventLoop` is now used by default.
fr: Sous Windows, :class:`ProactorEventLoop` est désormais utilisée par défaut.

source: An alternative event loop policy that uses the :class:`SelectorEventLoop` event loop implementation.
fr: Politique de boucle d'événements alternative utilisant l'implémentation de la boucle d'événements :class:`ProactorEventLoop`.

source: An alternative event loop policy that uses the :class:`ProactorEventLoop` event loop implementation.
fr: Politique de boucle d'événements alternative utilisant l'implémentation de la boucle d'événements :class:`ProactorEventLoop`.

source: Process Watchers
fr: Observateurs de processus

source: A process watcher allows customization of how an event loop monitors child processes on Unix. Specifically, the event loop needs to know when a child process has exited.
fr: Un observateur de processus permet de personnaliser la manière dont une boucle d'événements surveille les processus enfants sous Unix. Plus précisément, la boucle d'événements a besoin de savoir quand un processus enfant s'est terminé.

source: In asyncio, child processes are created with :func:`create_subprocess_exec` and :meth:`loop.subprocess_exec` functions.
fr: Dans *asyncio*, les processus enfants sont créés avec les fonctions :func:`create_subprocess_exec` et :meth:`loop.subprocess_exec`.

source: asyncio defines the :class:`AbstractChildWatcher` abstract base class, which child watchers should implement, and has four different implementations: :class:`ThreadedChildWatcher` (configured to be used by default), :class:`MultiLoopChildWatcher`, :class:`SafeChildWatcher`, and :class:`FastChildWatcher`.
fr: *asyncio* définit la classe mère abstraite :class:`AbstractChildWatcher`, que les observateurs enfants doivent implémenter et possède quatre implémentations différentes : :class:`ThreadedChildWatcher` (configurée pour être utilisé par défaut), :class:`MultiLoopChildWatcher`, :class:`SafeChildWatcher` et :class:`FastChildWatcher`.

source: See also the :ref:`Subprocess and Threads <asyncio-subprocess-threads>` section.
fr: Voir aussi la section :ref:`sous-processus et fils d'exécution <asyncio-subprocess-threads>`.

source: The following two functions can be used to customize the child process watcher implementation used by the asyncio event loop:
fr: Les deux fonctions suivantes peuvent être utilisées pour personnaliser l'implémentation de l'observateur de processus enfant utilisé par la boucle d'événements *asyncio* :

source: Return the current child watcher for the current policy.
fr: Renvoie l'observateur enfant actuel pour la politique actuelle.

source: Set the current child watcher to *watcher* for the current policy. *watcher* must implement methods defined in the :class:`AbstractChildWatcher` base class.
fr: Définit l'observateur enfant actuel à *watcher* pour la politique actuelle. *watcher* doit implémenter les méthodes définies dans la classe de base :class:`AbstractChildWatcher`.

source: Third-party event loops implementations might not support custom child watchers. For such event loops, using :func:`set_child_watcher` might be prohibited or have no effect.
fr: Les implémentations de boucles d'événements tierces peuvent ne pas prendre en charge les observateurs enfants personnalisés. Pour ces boucles d'événements, utiliser :func:`set_child_watcher` pourrait être interdit ou n'avoir aucun effet.

source: Register a new child handler.
fr: Enregistre un nouveau gestionnaire.

source: Arrange for ``callback(pid, returncode, *args)`` to be called when a process with PID equal to *pid* terminates. Specifying another callback for the same process replaces the previous handler.
fr: Organise l'appel de ``callback(pid, returncode, * args)`` lorsqu'un processus dont le *PID* est égal à *pid* se termine. La spécification d'un autre rappel pour le même processus remplace le gestionnaire précédent.

source: The *callback* callable must be thread-safe.
fr: L'appelable *callback* doit être compatible avec les programmes à fils d'exécution multiples.

source: Removes the handler for process with PID equal to *pid*.
fr: Supprime le gestionnaire de processus avec un PID égal à *pid*.

source: The function returns ``True`` if the handler was successfully removed, ``False`` if there was nothing to remove.
fr: La fonction renvoie ``True`` si le gestionnaire a été supprimé avec succès, ``False`` s'il n'y a rien à supprimer.

source: Attach the watcher to an event loop.
fr: Attache l'observateur à une boucle d'événement.

source: If the watcher was previously attached to an event loop, then it is first detached before attaching to the new loop.
fr: Si l'observateur était précédemment attaché à une boucle d'événements, il est d'abord détaché avant d'être rattaché à la nouvelle boucle.

source: Note: loop may be ``None``.
fr: Remarque : la boucle peut être ``None``.

source: Return ``True`` if the watcher is ready to use.
fr: Renvoie ``True`` si l'observateur est prêt à être utilisé.

source: Spawning a subprocess with *inactive* current child watcher raises :exc:`RuntimeError`.
fr: La création d'un sous-processus avec un observateur enfant actuel *inactif* lève une :exc:`RuntimeError`.

source: Close the watcher.
fr: Ferme l'observateur.

source: This method has to be called to ensure that underlying resources are cleaned-up.
fr: Cette méthode doit être appelée pour s'assurer que les ressources sous-jacentes sont nettoyées.

source: This implementation starts a new waiting thread for every subprocess spawn.
fr: Cette implémentation démarre un nouveau fil d'exécution en attente pour chaque génération de sous-processus.

source: It works reliably even when the asyncio event loop is run in a non-main OS thread.
fr: Il fonctionne de manière fiable même lorsque la boucle d'événements *asyncio* est exécutée dans un fil d'exécution non principal.

source: This watcher is used by default.
fr: Cet observateur est utilisé par défaut.

source: This implementation registers a :py:data:`SIGCHLD` signal handler on instantiation. That can break third-party code that installs a custom handler for :py:data:`SIGCHLD` signal.
fr: Cette implémentation enregistre un gestionnaire de signal :py:data:`SIGCHLD` lors de l'instanciation. Cela peut casser le code tiers qui installe un gestionnaire personnalisé pour le signal :py:data:`SIGCHLD`.

source: The watcher avoids disrupting other code spawning processes by polling every process explicitly on a :py:data:`SIGCHLD` signal.
fr: L'observateur évite de perturber un autre code qui crée des processus en interrogeant explicitement chaque processus sur un signal :py:data:`SIGCHLD`.

source: There is no limitation for running subprocesses from different threads once the watcher is installed.
fr: Il n'y a aucune limitation pour l'exécution de sous-processus à partir de différents fils d'exécution une fois l'observateur installé.

source: This implementation uses active event loop from the main thread to handle :py:data:`SIGCHLD` signal. If the main thread has no running event loop another thread cannot spawn a subprocess (:exc:`RuntimeError` is raised).
fr: Cette implémentation utilise une boucle d'événements active du fil d'exécution principal pour gérer le signal :py:data:`SIGCHLD`. Si le fil d'exécution principal n'a pas de boucle d'événements en cours d'exécution, un autre fil ne pourra pas générer de sous-processus (une :exc:`RuntimeError` est levée).

source: This implementation reaps every terminated processes by calling ``os.waitpid(-1)`` directly, possibly breaking other code spawning processes and waiting for their termination.
fr: Cette implémentation récupère tous les processus terminés en appelant directement ``os.waitpid(-1)``, cassant éventuellement un autre code qui génère des processus et attend leur fin.

source: This solution requires a running event loop in the main thread to work, as :class:`SafeChildWatcher`.
fr: Cette solution nécessite une boucle d'événements en cours d'exécution dans le fil d'exécution principal pour fonctionner, comme :class:`SafeChildWatcher`.

source: This implementation polls process file descriptors (pidfds) to await child process termination. In some respects, :class:`PidfdChildWatcher` is a "Goldilocks" child watcher implementation. It doesn't require signals or threads, doesn't interfere with any processes launched outside the event loop, and scales linearly with the number of subprocesses launched by the event loop. The main disadvantage is that pidfds are specific to Linux, and only work on recent (5.3+) kernels.
fr: Cette implémentation interroge les descripteurs de fichiers de processus (*pidfds*) pour attendre la fin du processus enfant. À certains égards, :class:`PidfdChildWatcher` est une implémentation d'observateur d'enfants *Goldilocks*. Elle ne nécessite ni signaux ni threads, n'interfère avec aucun processus lancé en dehors de la boucle d'événements et évolue de manière linéaire avec le nombre de sous-processus lancés par la boucle d'événements. Le principal inconvénient est que les *pidfds* sont spécifiques à Linux et ne fonctionnent que sur les noyaux récents (5.3+).

source: Custom Policies
fr: Politiques personnalisées

source: To implement a new event loop policy, it is recommended to subclass :class:`DefaultEventLoopPolicy` and override the methods for which custom behavior is wanted, e.g.::
fr: Pour implémenter une nouvelle politique de boucle d’événements, il est recommandé de sous-classer :class:`DefaultEventLoopPolicy` et de réimplémenter les méthodes pour lesquelles un comportement personnalisé est souhaité, par exemple ::
