Repository: python/python-docs-fr
Catalog: library/asyncio-eventloop.po
Languages: fr

source: Methods described in this subsections are low-level. In regular async/await code consider using the high-level :func:`asyncio.create_subprocess_shell` and :func:`asyncio.create_subprocess_exec` convenience functions instead.
fr: Les méthodes décrites dans ces sous-sections sont de bas niveau. Dans le code *async/await* normal, pensez à utiliser les fonctions de commodité de haut niveau :func:`asyncio.create_subprocess_shell` et :func:`asyncio.create_subprocess_exec` à la place.

source: On Windows, the default event loop :class:`ProactorEventLoop` supports subprocesses, whereas :class:`SelectorEventLoop` does not. See :ref:`Subprocess Support on Windows <asyncio-windows-subprocess>` for details.
fr: sous Windows, la boucle d'événements par défaut :class:`ProactorEventLoop` prend en charge les sous-processus, contrairement à :class:`SelectorEventLoop`. Voir :ref:`Prise en charge des sous-processus sous Windows <asyncio-windows-subprocess>` pour plus de détails.

source: Create a subprocess from one or more string arguments specified by *args*.
fr: Crée un sous-processus à partir d'un ou plusieurs arguments de chaîne spécifiés par *args*.

source: *args* must be a list of strings represented by:
fr: *args* doit être une liste de chaînes représentée par :

source: or :class:`bytes`, encoded to the :ref:`filesystem encoding <filesystem-encoding>`.
fr: ou :class:`bytes`, encodés selon l':ref:`encodage du système de fichiers <filesystem-encoding>`.

source: The first string specifies the program executable, and the remaining strings specify the arguments. Together, string arguments form the ``argv`` of the program.
fr: La première chaîne spécifie l'exécutable du programme et les chaînes restantes spécifient les arguments. Ensemble, les arguments de chaîne forment le ``argv`` du programme.

source: This is similar to the standard library :class:`subprocess.Popen` class called with ``shell=False`` and the list of strings passed as the first argument; however, where :class:`~subprocess.Popen` takes a single argument which is list of strings, *subprocess_exec* takes multiple string arguments.
fr: C'est similaire à la classe standard de la bibliothèque :class:`subprocess.Popen` appelée avec ``shell=False`` et la liste des chaînes passées en premier argument ; cependant, où :class:`~subprocess.Popen` prend un seul argument qui est une liste de chaînes, *subprocess_exec* prend plusieurs arguments de chaînes.

source: The *protocol_factory* must be a callable returning a subclass of the :class:`asyncio.SubprocessProtocol` class.
fr: Le *protocol_factory* doit être un appelable renvoyant une sous-classe de la classe :class:`asyncio.SubprocessProtocol`.

source: Other parameters:
fr: Autres paramètres :

source: *stdin* can be any of these:
fr: *stdin* peut être l'un de ces éléments :

source: a file-like object representing a pipe to be connected to the subprocess's standard input stream using :meth:`~loop.connect_write_pipe`
fr: un objet de type fichier représentant un tube à connecter au flux d'entrée standard du sous-processus en utilisant :meth:`~loop.connect_write_pipe`,

source: the :const:`subprocess.PIPE` constant (default) which will create a new pipe and connect it,
fr: la constante :const:`subprocess.PIPE` (par défaut) qui va créer un nouveau tube et le connecter,

source: the value ``None`` which will make the subprocess inherit the file descriptor from this process
fr: la valeur ``None`` qui fera que le sous-processus héritera du descripteur de fichier de ce processus,

source: the :const:`subprocess.DEVNULL` constant which indicates that the special :data:`os.devnull` file will be used
fr: la constante :const:`subprocess.DEVNULL` qui indique que le fichier spécial :data:`os.devnull` sera utilisé.

source: *stdout* can be any of these:
fr: *stdout* peut être l'un de ces éléments :

source: a file-like object representing a pipe to be connected to the subprocess's standard output stream using :meth:`~loop.connect_write_pipe`
fr: un objet de type fichier représentant un tube à connecter au flux de sortie standard du sous-processus en utilisant :meth:`~loop.connect_write_pipe`,

source: *stderr* can be any of these:
fr: *stderr* peut être l'un de ces éléments :

source: a file-like object representing a pipe to be connected to the subprocess's standard error stream using :meth:`~loop.connect_write_pipe`
fr: un objet de type fichier représentant un tube à connecter au flux d'erreurs standard du sous-processus en utilisant :meth:`~loop.connect_write_pipe`,

source: the :const:`subprocess.STDOUT` constant which will connect the standard error stream to the process' standard output stream
fr: la constante :const:`subprocess.STDOUT` qui connectera le flux d'erreur standard au flux de sortie standard du processus.

source: All other keyword arguments are passed to :class:`subprocess.Popen` without interpretation, except for *bufsize*, *universal_newlines*, *shell*, *text*, *encoding* and *errors*, which should not be specified at all.
fr: Tous les autres arguments nommés sont passés à :class:`subprocess.Popen` sans interprétation, à l'exception de *bufsize*, *universal_newlines*, *shell*, *text*, *encoding* et *errors*, qui ne doivent pas être spécifiés du tout.

source: The ``asyncio`` subprocess API does not support decoding the streams as text. :func:`bytes.decode` can be used to convert the bytes returned from the stream to text.
fr: L'API de sous-processus ``asyncio`` ne prend pas en charge le décodage des flux sous forme de texte. :func:`bytes.decode` peut être utilisée pour convertir les octets renvoyés par le flux en texte.

source: See the constructor of the :class:`subprocess.Popen` class for documentation on other arguments.
fr: Voir le constructeur de la classe :class:`subprocess.Popen` pour la documentation sur les autres arguments.

source: Returns a pair of ``(transport, protocol)``, where *transport* conforms to the :class:`asyncio.SubprocessTransport` base class and *protocol* is an object instantiated by the *protocol_factory*.
fr: Renvoie une paire ``(transport, protocol)``, où *transport* est conforme à la classe de base :class:`asyncio.SubprocessTransport` et *protocol* est un objet instancié par *protocol_factory*.

source: Create a subprocess from *cmd*, which can be a :class:`str` or a :class:`bytes` string encoded to the :ref:`filesystem encoding <filesystem-encoding>`, using the platform's "shell" syntax.
fr: Crée un sous-processus à partir de *cmd*, qui peut être une chaîne :class:`str` ou une chaîne :class:`bytes` encodée avec l':ref:`encodage du système de fichiers <filesystem-encoding>`, en utilisant la syntaxe "shell" de la plate-forme.

source: This is similar to the standard library :class:`subprocess.Popen` class called with ``shell=True``.
fr: C'est similaire à la classe standard de la bibliothèque :class:`subprocess.Popen` appelée avec ``shell=True``.

source: The *protocol_factory* must be a callable returning a subclass of the :class:`SubprocessProtocol` class.
fr: Le *protocol_factory* doit être un appelable renvoyant une sous-classe de la classe :class:`SubprocessProtocol`.

source: See :meth:`~loop.subprocess_exec` for more details about the remaining arguments.
fr: Voir :meth:`~loop.subprocess_exec` pour plus de détails sur les arguments restants.

source: Returns a pair of ``(transport, protocol)``, where *transport* conforms to the :class:`SubprocessTransport` base class and *protocol* is an object instantiated by the *protocol_factory*.
fr: Renvoie une paire ``(transport, protocol)``, où *transport* est conforme à la classe de base :class:`SubprocessTransport` et *protocol* est un objet instancié par *protocol_factory*.

source: It is the application's responsibility to ensure that all whitespace and special characters are quoted appropriately to avoid `shell injection <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_ vulnerabilities. The :func:`shlex.quote` function can be used to properly escape whitespace and special characters in strings that are going to be used to construct shell commands.
fr: il est de la responsabilité de l'application de s'assurer que tous les espaces blancs et les caractères spéciaux sont correctement échappés pour éviter les vulnérabilités d'`injection de shell <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_. La fonction :func:`shlex.quote` peut être utilisée pour échapper correctement les espaces blancs et les caractères spéciaux dans les chaînes qui seront utilisées pour construire des commandes shell.

source: Callback Handles
fr: Fonctions de rappel sur des descripteurs

source: A callback wrapper object returned by :meth:`loop.call_soon`, :meth:`loop.call_soon_threadsafe`.
fr: Objet encapsulant une fonction de rappel renvoyé par :meth:`loop.call_soon`, :meth:`loop.call_soon_threadsafe`.

source: Cancel the callback. If the callback has already been canceled or executed, this method has no effect.
fr: Annule le rappel. Si le rappel a déjà été annulé ou exécuté, cette méthode n'a aucun effet.

source: Return ``True`` if the callback was cancelled.
fr: Renvoie ``True`` si la fonction de rappel a été annulée.

source: A callback wrapper object returned by :meth:`loop.call_later`, and :meth:`loop.call_at`.
fr: Objet encapsulant la fonction de rappel renvoyé par :meth:`loop.call_later` et :meth:`loop.call_at`.

source: This class is a subclass of :class:`Handle`.
fr: Cette classe est une sous-classe de :class:`Handle`.

source: Return a scheduled callback time as :class:`float` seconds.
fr: Renvoie une heure de rappel planifiée sous forme de :class:`float` secondes.

source: The time is an absolute timestamp, using the same time reference as :meth:`loop.time`.
fr: L'heure est un horodatage absolu, utilisant la même référence de temps que :meth:`loop.time`.

source: Server Objects
fr: Objets Serveur

source: Server objects are created by :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :func:`start_server`, and :func:`start_unix_server` functions.
fr: Les objets serveur sont créés par les fonctions :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :func:`start_server` et :func:`start_unix_server`.

source: *Server* objects are asynchronous context managers. When used in an ``async with`` statement, it's guaranteed that the Server object is closed and not accepting new connections when the ``async with`` statement is completed::
fr: Les objets *Server* sont des gestionnaires de contexte asynchrones. Lorsqu'il est utilisé dans une instruction ``async with``, il est garanti que l'objet Serveur est fermé et n'accepte pas de nouvelle connexion lorsque l'instruction ``async with`` est terminée ::

source: Server object is an asynchronous context manager since Python 3.7.
fr: l'objet serveur est un gestionnaire de contexte asynchrone depuis Python 3.7.

source: Stop serving: close listening sockets and set the :attr:`sockets` attribute to ``None``.
fr: Arrête le serveur : ferme les connecteurs d'écoute et définit l'attribut :attr:`sockets` à ``None``.

source: The sockets that represent existing incoming client connections are left open.
fr: Les connecteurs qui représentent les connexions client entrantes existantes restent ouvertes.

source: The server is closed asynchronously, use the :meth:`wait_closed` coroutine to wait until the server is closed.
fr: Le serveur est fermé de manière asynchrone, utilisez la coroutine :meth:`wait_closed` pour attendre que le serveur soit fermé.

source: Return the event loop associated with the server object.
fr: Renvoie la boucle d'événement associée à l'objet serveur.

source: Start accepting connections.
fr: Commence à accepter les connexions.

source: This method is idempotent, so it can be called when the server is already serving.
fr: Cette méthode est idempotente, elle peut donc être appelée lorsque le serveur est déjà en service.

source: The *start_serving* keyword-only parameter to :meth:`loop.create_server` and :meth:`asyncio.start_server` allows creating a Server object that is not accepting connections initially. In this case ``Server.start_serving()``, or :meth:`Server.serve_forever` can be used to make the Server start accepting connections.
fr: Le paramètre nommé *start_serving* de :meth:`loop.create_server` et :meth:`asyncio.start_server` permet de créer un objet *Server* qui n'accepte pas les connexions initialement. Dans ce cas, ``Server.start_serving()`` ou :meth:`Server.serve_forever` peut être utilisée pour que le serveur commence à accepter les connexions.

source: Start accepting connections until the coroutine is cancelled. Cancellation of ``serve_forever`` task causes the server to be closed.
fr: Commence à accepter les connexions jusqu'à ce que la coroutine soit annulée. L'annulation de la tâche ``serve_forever`` provoque la fermeture du serveur.

source: This method can be called if the server is already accepting connections. Only one ``serve_forever`` task can exist per one *Server* object.
fr: Cette méthode peut être appelée si le serveur accepte déjà les connexions. Une seule tâche ``serve_forever`` peut exister par objet *Server*.

source: Return ``True`` if the server is accepting new connections.
fr: Renvoie ``True`` si le serveur accepte de nouvelles connexions.

source: Wait until the :meth:`close` method completes.
fr: Attend que la méthode :meth:`close` se termine.

source: Prior to Python 3.7 ``Server.sockets`` used to return an internal list of server sockets directly. In 3.7 a copy of that list is returned.
fr: avant Python 3.7, ``Server.sockets`` renvoyait directement une liste interne de sockets de serveur. En 3.7, une copie de cette liste est renvoyée.

source: Event Loop Implementations
fr: Implémentations de boucle d'évènements

source: asyncio ships with two different event loop implementations: :class:`SelectorEventLoop` and :class:`ProactorEventLoop`.
fr: *asyncio* est livré avec deux implémentations de boucles d'événements différentes : :class:`SelectorEventLoop` et :class:`ProactorEventLoop`.

source: By default asyncio is configured to use :class:`SelectorEventLoop` on Unix and :class:`ProactorEventLoop` on Windows.
fr: Par défaut, *asyncio* est configuré pour utiliser :class:`SelectorEventLoop` sous Unix et :class:`ProactorEventLoop` sous Windows.

source: An event loop based on the :mod:`selectors` module.
fr: Boucle d'événements basée sur le module :mod:`selectors`.

source: Uses the most efficient *selector* available for the given platform. It is also possible to manually configure the exact selector implementation to be used::
fr: Utilise le *sélecteur* le plus efficace disponible pour la plate-forme donnée. Il est également possible de configurer manuellement l'implémentation exacte du sélecteur à utiliser ::

source: :ref:`Availability <availability>`: Unix, Windows.
fr: :ref:`Disponibilité <availability>` : Unix, Windows.

source: An event loop for Windows that uses "I/O Completion Ports" (IOCP).
fr: Boucle d'événements pour Windows qui utilise des "I/O Completion Ports" (IOCP).

source: :ref:`Availability <availability>`: Windows.
fr: :ref:`Disponibilité <availability>` : Windows.

source: `MSDN documentation on I/O Completion Ports <https://docs.microsoft.com/en-ca/windows/desktop/FileIO/i-o-completion-ports>`_.
fr: `Documentation MSDN sur les ports de saisie semi-automatique d’E/S <https://docs.microsoft.com/fr-fr/windows/desktop/FileIO/i-o-completion-ports>`_.

source: Abstract base class for asyncio-compliant event loops.
fr: Classe mère abstraite pour les boucles d'événements conforme à *asyncio*.

source: The :ref:`asyncio-event-loop-methods` section lists all methods that an alternative implementation of ``AbstractEventLoop`` should have defined.
fr: La section :ref:`asyncio-event-loop-methods` liste toutes les méthodes qu'une implémentation alternative de ``AbstractEventLoop`` doit définir.

source: Examples
fr: Exemples

source: Note that all examples in this section **purposefully** show how to use the low-level event loop APIs, such as :meth:`loop.run_forever` and :meth:`loop.call_soon`. Modern asyncio applications rarely need to be written this way; consider using the high-level functions like :func:`asyncio.run`.
fr: Notez que tous les exemples de cette section montrent **à dessein** comment utiliser les API de boucle d'événement de bas niveau, telles que :meth:`loop.run_forever` et :meth:`loop.call_soon`. Les applications *asyncio* modernes ont rarement besoin d'être écrites de cette façon ; pensez à utiliser les fonctions de haut niveau comme :func:`asyncio.run`.

source: Hello World with call_soon()
fr: "Hello World" avec ``call_soon()``

source: An example using the :meth:`loop.call_soon` method to schedule a callback. The callback displays ``"Hello World"`` and then stops the event loop::
fr: Un exemple utilisant la méthode :meth:`loop.call_soon` pour programmer un rappel. Le rappel affiche ``"Hello World"`` puis arrête la boucle d'événements ::

source: A similar :ref:`Hello World <coroutine>` example created with a coroutine and the :func:`run` function.
fr: un exemple similaire de :ref:`Hello World <coroutine>` créé avec une coroutine et la fonction :func:`run`.

source: Display the current date with call_later()
fr: Affichage de la date actuelle avec ``call_later()``

source: An example of a callback displaying the current date every second. The callback uses the :meth:`loop.call_later` method to reschedule itself after 5 seconds, and then stops the event loop::
fr: Un exemple de rappel affichant la date actuelle toutes les secondes. Le rappel utilise la méthode :meth:`loop.call_later` pour se re-planifier après 5 secondes, puis arrête la boucle d'événements ::

source: A similar :ref:`current date <asyncio_example_sleep>` example created with a coroutine and the :func:`run` function.
fr: un exemple similaire de :ref:`date actuelle <asyncio_example_sleep>` créé avec une coroutine et la fonction :func:`run`.

source: Watch a file descriptor for read events
fr: Surveillance des événements de lecture pour un descripteur de fichier

source: Wait until a file descriptor received some data using the :meth:`loop.add_reader` method and then close the event loop::
fr: Attend qu'un descripteur de fichier reçoive des données en utilisant la méthode :meth:`loop.add_reader` puis ferme la boucle d'événements ::

source: A similar :ref:`example <asyncio_example_create_connection>` using transports, protocols, and the :meth:`loop.create_connection` method.
fr: un :ref:`exemple <asyncio_example_create_connection>` similaire utilisant les transports, les protocoles et la méthode :meth:`loop.create_connection`,

source: Another similar :ref:`example <asyncio_example_create_connection-streams>` using the high-level :func:`asyncio.open_connection` function and streams.
fr: un autre :ref:`exemple <asyncio_example_create_connection-streams>` utilisant la fonction et les flux de haut niveau :func:`asyncio.open_connection`.

source: Set signal handlers for SIGINT and SIGTERM
fr: Gestion des signaux *SIGINT* et *SIGTERM*

source: (This ``signals`` example only works on Unix.)
fr: (Cet exemple ne fonctionne que sur Unix.)

source: Register handlers for signals :py:data:`SIGINT` and :py:data:`SIGTERM` using the :meth:`loop.add_signal_handler` method::
fr: Enregistre des gestionnaires pour les signaux :py:data:`SIGINT` et :py:data:`SIGTERM` en utilisant la méthode :meth:`loop.add_signal_handler` ::
