Repository: python/python-docs-fr
Catalog: library/asyncio-eventloop.po
Languages: fr

source: Event Loop
fr: Boucle d'évènements

source: **Source code:** :source:`Lib/asyncio/events.py`, :source:`Lib/asyncio/base_events.py`
fr: **Code source :** :source:`Lib/asyncio/events.py`, :source:`Lib/asyncio/base_events.py`

source: Preface
fr: Préface

source: The event loop is the core of every asyncio application. Event loops run asynchronous tasks and callbacks, perform network IO operations, and run subprocesses.
fr: La boucle d'événements est au cœur de chaque application *asyncio*. Les boucles d'événements exécutent des tâches et des rappels asynchrones, effectuent des opérations d'entrée-sorite réseau et exécutent des sous-processus.

source: Application developers should typically use the high-level asyncio functions, such as :func:`asyncio.run`, and should rarely need to reference the loop object or call its methods. This section is intended mostly for authors of lower-level code, libraries, and frameworks, who need finer control over the event loop behavior.
fr: Les développeurs d'applications doivent généralement utiliser les fonctions *asyncio* de haut niveau, telles que :func:`asyncio.run`, et ne doivent que rarement référencer l'objet boucle ou appeler ses méthodes. Cette section est principalement destinée aux auteurs de code, de bibliothèques et de cadriciels de bas niveau, qui ont besoin d'un contrôle plus précis sur le comportement de la boucle d'événements.

source: Obtaining the Event Loop
fr: Obtention d'une boucle d'évènements

source: The following low-level functions can be used to get, set, or create an event loop:
fr: Les fonctions de bas niveau suivantes peuvent être utilisées pour obtenir, définir ou créer une boucle d'événements :

source: Return the running event loop in the current OS thread.
fr: Renvoie la boucle d'événements en cours d'exécution dans le fil actuel du système d'exploitation.

source: Raise a :exc:`RuntimeError` if there is no running event loop.
fr: Lève une :exc:`RuntimeError` s'il n'y a pas de boucle d'événements en cours d'exécution.

source: This function can only be called from a coroutine or a callback.
fr: Cette fonction ne peut être appelée qu'à partir d'une coroutine ou d'une fonction de rappel.

source: Get the current event loop.
fr: Arrête l'exécution de la boucle d'évènements.

source: When called from a coroutine or a callback (e.g. scheduled with call_soon or similar API), this function will always return the running event loop.
fr: Lorsqu'elle est appelée depuis une coroutine ou une fonction de rappel (par exemple planifiée avec *call_soon* ou une API similaire), cette fonction renvoie toujours la boucle d'événement en cours.

source: If there is no running event loop set, the function will return the result of the ``get_event_loop_policy().get_event_loop()`` call.
fr: S'il n'y a pas de boucle d'événement en cours d'exécution, la fonction renvoie le résultat de l'appel ``get_event_loop_policy().get_event_loop()``.

source: Because this function has rather complex behavior (especially when custom event loop policies are in use), using the :func:`get_running_loop` function is preferred to :func:`get_event_loop` in coroutines and callbacks.
fr: Étant donné que cette fonction a un comportement plutôt complexe (en particulier lorsque des politiques de boucle d'événements personnalisées sont utilisées), l'utilisation de la fonction :func:`get_running_loop` est préférable à :func:`get_event_loop` dans les coroutines et les fonctions de rappel.

source: As noted above, consider using the higher-level :func:`asyncio.run` function, instead of using these lower level functions to manually create and close an event loop.
fr: Comme indiqué ci-dessus, envisagez d'utiliser la fonction de haut niveau :func:`asyncio.run`, au lieu d'utiliser ces fonctions de bas niveau pour créer et fermer manuellement une boucle d'événements.

source: In Python versions 3.10.0--3.10.8 and 3.11.0 this function (and other functions which use it implicitly) emitted a :exc:`DeprecationWarning` if there was no running event loop, even if the current loop was set on the policy. In Python versions 3.10.9, 3.11.1 and 3.12 they emit a :exc:`DeprecationWarning` if there is no running event loop and no current loop is set. In some future Python release this will become an error.
fr: dans les versions Python 3.10.0–3.10.8 et 3.11.0, cette fonction (et d'autres fonctions qui l'utilisent implicitement) levait un :exc:`DeprecationWarning` s'il n'y avait pas de boucle d'événements en cours d'exécution, même si la boucle actuelle était définie dans la politique. Dans les versions Python 3.10.9, 3.11.1 et 3.12, elles lèvent un :exc:`DeprecationWarning` s'il n'y a pas de boucle d'événements en cours et qu'aucune boucle actuelle n'est définie. Dans une future version de Python, cela deviendra une erreur.

source: Set *loop* as the current event loop for the current OS thread.
fr: Définit *loop* comme boucle d'événements actuelle pour le fil d'exécution actuel du système d'exploitation.

source: Create and return a new event loop object.
fr: Crée et renvoie un nouvel objet de boucle d'événements.

source: Note that the behaviour of :func:`get_event_loop`, :func:`set_event_loop`, and :func:`new_event_loop` functions can be altered by :ref:`setting a custom event loop policy <asyncio-policies>`.
fr: Notez que le comportement des fonctions :func:`get_event_loop`, :func:`set_event_loop` et :func:`new_event_loop` peut être modifié en :ref:`définissant une politique de boucle d'événement personnalisée <asyncio-policies>`.

source: Contents
fr: Sommaire

source: This documentation page contains the following sections:
fr: Cette page de documentation contient les sections suivantes :

source: The `Event Loop Methods`_ section is the reference documentation of the event loop APIs;
fr: la section `Event Loop Methods`_ est la documentation de référence des API de boucle d'événements ;

source: The `Callback Handles`_ section documents the :class:`Handle` and :class:`TimerHandle` instances which are returned from scheduling methods such as :meth:`loop.call_soon` and :meth:`loop.call_later`;
fr: la section `Callback Handles`_ documente les instances :class:`Handle` et :class:`TimerHandle` qui sont renvoyées par les méthodes de planification telles que :meth:`loop.call_soon` et :meth:`loop.call_later` ;

source: The `Server Objects`_ section documents types returned from event loop methods like :meth:`loop.create_server`;
fr: la section `Server Objects`_ documente les types renvoyés par les méthodes de boucle d'événements comme :meth:`loop.create_server` ;

source: The `Event Loop Implementations`_ section documents the :class:`SelectorEventLoop` and :class:`ProactorEventLoop` classes;
fr: la section `Event Loop Implementations`_ documente les classes :class:`SelectorEventLoop` et :class:`ProactorEventLoop` ;

source: The `Examples`_ section showcases how to work with some event loop APIs.
fr: la section `Exemples`_ montre comment travailler avec certaines API de boucle d'événements.

source: Event Loop Methods
fr: Méthodes de la boucle d'évènements

source: Event loops have **low-level** APIs for the following:
fr: Les boucles d'événements ont des API **de bas niveau** pour les éléments suivants :

source: Running and stopping the loop
fr: Démarrer et arrêter une boucle d'évènements

source: Run until the *future* (an instance of :class:`Future`) has completed.
fr: Lance la boucle jusqu'à ce que *future* (une instance de :class:`Future`) soit terminée.

source: If the argument is a :ref:`coroutine object <coroutine>` it is implicitly scheduled to run as a :class:`asyncio.Task`.
fr: Si l'argument est un objet :ref:`coroutine <coroutine>`, il est implicitement programmé pour s'exécuter en tant que :class:`asyncio.Task`.

source: Return the Future's result or raise its exception.
fr: Renvoie le résultat du *Future* ou lève son exception.

source: Run the event loop until :meth:`stop` is called.
fr: Exécute la boucle d'événement jusqu'à ce que :meth:`stop` soit appelée.

source: If :meth:`stop` is called before :meth:`run_forever()` is called, the loop will poll the I/O selector once with a timeout of zero, run all callbacks scheduled in response to I/O events (and those that were already scheduled), and then exit.
fr: Si :meth:`stop` est appelée avant que :meth:`run_forever()` ne soit appelée, la boucle interroge le sélecteur d'entrée-sortie une fois avec un délai d'attente de zéro, exécute tous les rappels programmés en réponse aux événements d'entrée-sortie (et ceux qui étaient déjà programmés), puis quitte.

source: If :meth:`stop` is called while :meth:`run_forever` is running, the loop will run the current batch of callbacks and then exit. Note that new callbacks scheduled by callbacks will not run in this case; instead, they will run the next time :meth:`run_forever` or :meth:`run_until_complete` is called.
fr: Si :meth:`stop` est appelée pendant que :meth:`run_forever` est en cours d'exécution, la boucle exécute le lot actuel de rappels puis se termine. Notez que les nouveaux rappels programmés par fonctions de rappel ne s'exécuteront pas dans ce cas ; à la place, ils s'exécuteront la prochaine fois que :meth:`run_forever` ou :meth:`run_until_complete` sera appelée.

source: Stop the event loop.
fr: Arrête l'exécution de la boucle d'évènements.

source: Return ``True`` if the event loop is currently running.
fr: Renvoie ``True`` si la boucle d'évènements est démarrée.

source: Return ``True`` if the event loop was closed.
fr: Renvoie ``True`` si la boucle d'évènements est arrêtée.

source: Close the event loop.
fr: Arrête la boucle d'évènements.

source: The loop must not be running when this function is called. Any pending callbacks will be discarded.
fr: La boucle ne doit pas être en cours d'exécution lorsque cette fonction est appelée. Tous les rappels en attente seront ignorés.

source: This method clears all queues and shuts down the executor, but does not wait for the executor to finish.
fr: Cette méthode efface toutes les files d'attente et arrête l'exécuteur, mais n'attend pas que l'exécuteur se termine.

source: This method is idempotent and irreversible. No other methods should be called after the event loop is closed.
fr: Cette méthode est idempotente et irréversible. Aucune autre méthode ne doit être appelée après la fermeture de la boucle d'événements.

source: Schedule all currently open :term:`asynchronous generator` objects to close with an :meth:`~agen.aclose()` call. After calling this method, the event loop will issue a warning if a new asynchronous generator is iterated. This should be used to reliably finalize all scheduled asynchronous generators.
fr: Planifie la fermeture de tous les objets :term:`générateurs asynchrones <asynchronous generator>` actuellement ouverts avec un appel :meth:`~agen.aclose()`. Après avoir appelé cette méthode, la boucle d'événements émet un avertissement si un nouveau générateur asynchrone est itéré. Elle doit être utilisée pour finaliser de manière fiable tous les générateurs asynchrones planifiés.

source: Note that there is no need to call this function when :func:`asyncio.run` is used.
fr: Notez qu'il n'est pas nécessaire d'appeler cette fonction lorsque :func:`asyncio.run` est utilisée.

source: Example::
fr: Exemple ::

source: Schedule the closure of the default executor and wait for it to join all of the threads in the :class:`~concurrent.futures.ThreadPoolExecutor`. Once this method has been called, using the default executor with :meth:`loop.run_in_executor` will raise a :exc:`RuntimeError`.
fr: Planifie la fermeture de l'exécuteur par défaut et attend que tous les fils se rejoignent dans le :class:`~concurrent.futures.ThreadPoolExecutor`. Une fois cette méthode appelée, l'utilisation de l'exécuteur par défaut avec :meth:`loop.run_in_executor` lève une :exc:`RuntimeError`.

source: Do not call this method when using :func:`asyncio.run`, as the latter handles default executor shutdown automatically.
fr: n'appelez pas cette méthode lorsque vous utilisez :func:`asyncio.run`, car cette dernière gère automatiquement l'arrêt de l'exécuteur par défaut.

source: Scheduling callbacks
fr: Planification des fonctions de rappel

source: Schedule the *callback* :term:`callback` to be called with *args* arguments at the next iteration of the event loop.
fr: Définit la :term:`fonction de rappel <callback>` *callback* à appeler avec les arguments *args* à la prochaine itération de la boucle d'événements.

source: Return an instance of :class:`asyncio.Handle`, which can be used later to cancel the callback.
fr: Renvoie une instance de :class:`asyncio.Handle`, qui pourra être utilisée ultérieurement pour annuler le rappel.

source: Callbacks are called in the order in which they are registered. Each callback will be called exactly once.
fr: Les fonctions de rappels sont appelées dans l'ordre dans lequel elles sont enregistrées. Chaque fonction de rappel sera appelée exactement une fois.

source: The optional keyword-only *context* argument specifies a custom :class:`contextvars.Context` for the *callback* to run in. Callbacks use the current context when no *context* is provided.
fr: L'argument facultatif nommé uniquement *context* spécifie un :class:`contextvars.Context` personnalisé pour le *callback* à exécuter. Les rappels utilisent le contexte actuel lorsqu'aucun *context* n'est fourni.

source: Unlike :meth:`call_soon_threadsafe`, this method is not thread-safe.
fr: Contrairement à :meth:`call_soon_threadsafe`, cette méthode n'est pas compatible avec les programmes à fils d'exécution multiples.

source: A thread-safe variant of :meth:`call_soon`. When scheduling callbacks from another thread, this function *must* be used, since :meth:`call_soon` is not thread-safe.
fr: Une variante compatible avec les programmes à fils d'exécution multiples de :meth:`call_soon`. Lors de la planification de rappels à partir d'un autre fil d'exécution, cette fonction *doit* être utilisée, puisque :meth:`call_soon` n'est pas thread-safe.

source: Raises :exc:`RuntimeError` if called on a loop that's been closed. This can happen on a secondary thread when the main application is shutting down.
fr: Lève :exc:`RuntimeError` si elle est appelée sur une boucle qui a été fermée. Cela peut se produire sur un fil secondaire lorsque l'application principale se ferme.

source: See the :ref:`concurrency and multithreading <asyncio-multithreading>` section of the documentation.
fr: Voir la section :ref:`exécution concurrente et multi-fils d'exécution <asyncio-multithreading>` de la documentation.

source: The *context* keyword-only parameter was added. See :pep:`567` for more details.
fr: le paramètre nommé uniquement *context* a été ajouté. Voir :pep:`567` pour plus de détails.

source: Most :mod:`asyncio` scheduling functions don't allow passing keyword arguments. To do that, use :func:`functools.partial`::
fr: la plupart des fonctions d'ordonnancement :mod:`asyncio` n'autorisent pas le passage d'arguments nommés. Pour le faire, utilisez :func:`functools.partial` ::

source: Using partial objects is usually more convenient than using lambdas, as asyncio can render partial objects better in debug and error messages.
fr: L'utilisation d'objets partiels est généralement plus pratique que l'utilisation de lambdas, car *asyncio* peut mieux rendre les objets partiels dans les messages de débogage et d'erreur.

source: Scheduling delayed callbacks
fr: Planification des rappels différés

source: Event loop provides mechanisms to schedule callback functions to be called at some point in the future. Event loop uses monotonic clocks to track time.
fr: La boucle d'événements fournit des mécanismes pour programmer les fonctions de rappel à appeler à un moment donné dans le futur. La boucle d'événements utilise des horloges monotones pour suivre le temps.

source: Schedule *callback* to be called after the given *delay* number of seconds (can be either an int or a float).
fr: Planifie le rappel *callback* à appeler après *delay* secondes (peut être un entier ou un flottant).

source: An instance of :class:`asyncio.TimerHandle` is returned which can be used to cancel the callback.
fr: Une instance de :class:`asyncio.TimerHandle` est renvoyée et peut être utilisée pour annuler le rappel.

source: *callback* will be called exactly once. If two callbacks are scheduled for exactly the same time, the order in which they are called is undefined.
fr: *callback* sera appelé exactement une fois. Si deux rappels sont programmés exactement à la même heure, l'ordre dans lequel ils sont appelés n'est pas défini.

source: The optional positional *args* will be passed to the callback when it is called. If you want the callback to be called with keyword arguments use :func:`functools.partial`.
fr: L'argument positionnel facultatif *args* sera transmis au rappel lorsqu'il sera appelé. Si vous voulez que le rappel soit appelé avec des arguments nommés, utilisez :func:`functools.partial`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *callback* to run in. The current context is used when no *context* is provided.
fr: Un argument facultatif *context* nommé uniquement permet de spécifier un :class:`contextvars.Context` personnalisé pour le *callback* à exécuter. Le contexte actuel est utilisé lorsqu'aucun *context* n'est fourni.

source: In Python 3.7 and earlier with the default event loop implementation, the *delay* could not exceed one day. This has been fixed in Python 3.8.
fr: dans Python 3.7 et versions antérieures avec l'implémentation de la boucle d'événements par défaut, le *delay* ne pouvait pas dépasser un jour. Cela a été corrigé dans Python 3.8.

source: Schedule *callback* to be called at the given absolute timestamp *when* (an int or a float), using the same time reference as :meth:`loop.time`.
fr: Planifie l'appel de *callback* à l'horodatage absolu donné *when* (un *int* ou un *float*), en utilisant la même référence de temps que :meth:`loop.time`.

source: This method's behavior is the same as :meth:`call_later`.
fr: Le comportement de cette méthode est le même que :meth:`call_later`.

source: In Python 3.7 and earlier with the default event loop implementation, the difference between *when* and the current time could not exceed one day. This has been fixed in Python 3.8.
fr: dans Python 3.7 et versions antérieures avec l'implémentation de la boucle d'événements par défaut, la différence entre *when* et l'heure actuelle ne pouvait pas dépasser un jour. Cela a été corrigé dans Python 3.8.

source: Return the current time, as a :class:`float` value, according to the event loop's internal monotonic clock.
fr: Renvoie l'heure actuelle, sous la forme d'une valeur :class:`float`, selon l'horloge monotone interne de la boucle d'événements.

source: In Python 3.7 and earlier timeouts (relative *delay* or absolute *when*) should not exceed one day. This has been fixed in Python 3.8.
fr: dans Python 3.7 et les versions antérieures, les délais d'expiration (relatif *delay* ou absolu *when*) ne doivent pas dépasser un jour. Cela a été corrigé dans Python 3.8.

source: The :func:`asyncio.sleep` function.
fr: la fonction :func:`asyncio.sleep`.

source: Creating Futures and Tasks
fr: Création de *Futures* et des tâches

source: Create an :class:`asyncio.Future` object attached to the event loop.
fr: Crée un objet :class:`asyncio.Future` attaché à la boucle d'événements.

source: This is the preferred way to create Futures in asyncio. This lets third-party event loops provide alternative implementations of the Future object (with better performance or instrumentation).
fr: C'est la méthode préférée pour créer des *Futures* avec *asyncio*. Cela permet aux boucles d'événements tierces de fournir des implémentations alternatives de l'objet *Future* (avec de meilleures performances ou instrumentation).

source: Schedule the execution of :ref:`coroutine <coroutine>` *coro*. Return a :class:`Task` object.
fr: Planifie l'exécution de :ref:`coroutine <coroutine>` *coro*. Renvoie un objet :class:`Task`.

source: Third-party event loops can use their own subclass of :class:`Task` for interoperability. In this case, the result type is a subclass of :class:`Task`.
fr: Les boucles d'événements tierces peuvent utiliser leur propre sous-classe de :class:`Task` pour l'interopérabilité. Dans ce cas, le type de résultat est une sous-classe de :class:`Task`.

source: If the *name* argument is provided and not ``None``, it is set as the name of the task using :meth:`Task.set_name`.
fr: Si l'argument *name* est fourni et non ``None``, il est défini comme le nom de la tâche en utilisant :meth:`Task.set_name`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *coro* to run in. The current context copy is created when no *context* is provided.
fr: Argument facultatif *context* nommé uniquement qui permet de spécifier un :class:`contextvars.Context` personnalisé pour la *coro* à exécuter. La copie de contexte actuel est créée lorsqu'aucun *context* n'est fourni.

source: Added the *name* parameter.
fr: ajout du paramètre ``name``.

source: Added the *context* parameter.
fr: ajout du paramètre ``context``.

source: Set a task factory that will be used by :meth:`loop.create_task`.
fr: Définit une fabrique de tâches qui sera utilisée par :meth:`loop.create_task`.

source: If *factory* is ``None`` the default task factory will be set. Otherwise, *factory* must be a *callable* with the signature matching ``(loop, coro, context=None)``, where *loop* is a reference to the active event loop, and *coro* is a coroutine object. The callable must return a :class:`asyncio.Future`-compatible object.
fr: Si *factory* est ``None``, la fabrique de tâches par défaut sera définie. Sinon, *factory* doit être un *appelable* avec la signature correspondant à ``(loop, coro, context=None)``, où *loop* est une référence à la boucle d'événements active et *coro* est un objet coroutine . L'appelable doit renvoyer un objet compatible avec :class:`asyncio.Future`.

source: Return a task factory or ``None`` if the default one is in use.
fr: Renvoie une fabrique de tâches ou ``None`` si celle par défaut est utilisée.

source: Opening network connections
fr: Création de connexions

source: Open a streaming transport connection to a given address specified by *host* and *port*.
fr: Ouvre un flux de transport connecté à l'adresse spécifiée par *host* et *port*.

source: *protocol_factory* must be a callable returning an :ref:`asyncio protocol <asyncio-protocol>` implementation.
fr: *protocol_factory* doit être un appelable renvoyant un protocole gérant le :ref:`protocole asyncio <asyncio-protocol>`.

source: This method will try to establish the connection in the background. When successful, it returns a ``(transport, protocol)`` pair.
fr: Cette méthode tente d'établir la connexion en arrière-plan. En cas de succès, elle renvoie une paire ``(transport, protocol)``.

source: The chronological synopsis of the underlying operation is as follows:
fr: Le synopsis chronologique de l'opération sous-jacente est le suivant :

source: The connection is established and a :ref:`transport <asyncio-transport>` is created for it.
fr: La connexion est établie et un :ref:`transport asyncio <asyncio-transport>` est créé pour cela.

source: *protocol_factory* is called without arguments and is expected to return a :ref:`protocol <asyncio-protocol>` instance.
fr: *protocol_factory* est appelée sans arguments et doit renvoyer une instance de :ref:`protocol asyncio <asyncio-protocol>`.
