Repository: python/python-docs-fr
Catalog: library/asyncio-task.po
Languages: fr

source: This method is used by asyncio's internals and isn't expected to be used by end-user code. In particular, if a Task gets successfully uncancelled, this allows for elements of structured concurrency like :ref:`taskgroups` and :func:`asyncio.timeout` to continue running, isolating cancellation to the respective structured block. For example::
fr: Cette méthode est utilisée par les composants internes d'*asyncio* et elle ne devrait pas être utilisée par le code de l'utilisateur final. En particulier, si une tâche est annulée avec succès, cela permet aux structures permettant le multi-fils tels que :ref:`taskgroups` et :func:`asyncio.timeout` de continuer à s'exécuter, isolant l'annulation au bloc concerné. Par exemple ::

source: While the block with ``make_request()`` and ``make_another_request()`` might get cancelled due to the timeout, ``unrelated_code()`` should continue running even in case of the timeout. This is implemented with :meth:`uncancel`. :class:`TaskGroup` context managers use :func:`uncancel` in a similar fashion.
fr: Alors que le bloc avec ``make_request()`` et ``make_another_request()`` peut être annulé en raison du délai d'attente, ``unrelated_code()`` devrait continuer à s'exécuter même en cas d'atteinte du délai maximal. Ceci est implémenté avec :meth:`uncancel`. Les gestionnaires de contexte :class:`TaskGroup` utilisent :func:`uncancel` de la même manière.

source: Return the number of pending cancellation requests to this Task, i.e., the number of calls to :meth:`cancel` less the number of :meth:`uncancel` calls.
fr: Renvoie le nombre de demandes d'annulation en attente à cette tâche, c'est-à-dire le nombre d'appels à :meth:`cancel` moins le nombre d'appels à :meth:`uncancel`.

source: Note that if this number is greater than zero but the Task is still executing, :meth:`cancelled` will still return ``False``. This is because this number can be lowered by calling :meth:`uncancel`, which can lead to the task not being cancelled after all if the cancellation requests go down to zero.
fr: Notez que si ce nombre est supérieur à zéro mais que la tâche est toujours en cours d'exécution, :meth:`cancelled` renvoie toujours ``False``. En effet, ce nombre peut être réduit en appelant :meth:`uncancel`, ce qui peut empêcher en fin de compte la tâche d'être annulée si les demandes d'annulation tombent à zéro.

source: This method is used by asyncio's internals and isn't expected to be used by end-user code. See :meth:`uncancel` for more details.
fr: Cette méthode est utilisée par les composants internes d'*asyncio* et ne devrait pas être utilisée par le code de l'utilisateur final. Voir :meth:`uncancel` pour plus de détails.
