Repository: python/python-docs-fr
Catalog: library/asyncio-exceptions.po
Languages: fr

source: **Source code:** :source:`Lib/asyncio/exceptions.py`
fr: **Code source :** :source:`Lib/asyncio/exceptions.py`

source: A deprecated alias of :exc:`TimeoutError`, raised when the operation has exceeded the given deadline.
fr: Alias obsolète de :exc:`TimeoutError`, levée lorsque l'opération a dépassé le délai donné.

source: This class was made an alias of :exc:`TimeoutError`.
fr: cette classe est devenue un alias de :exc:`TimeoutError`.

source: The operation has been cancelled.
fr: L'opération a été annulée.

source: This exception can be caught to perform custom operations when asyncio Tasks are cancelled. In almost all situations the exception must be re-raised.
fr: Cette exception peut être interceptée pour effectuer des opérations personnalisées lorsque des tâches asynchrones sont annulées. Dans presque toutes les situations, l'exception doit être relancée.

source: Invalid internal state of :class:`Task` or :class:`Future`.
fr: État interne non valide de :class:`Task` ou :class:`Future`.

source: Can be raised in situations like setting a result value for a *Future* object that already has a result value set.
fr: Peut être levée dans des situations telles que la définition d'une valeur de résultat pour un objet *Future* qui a déjà une valeur de résultat définie.

source: The "sendfile" syscall is not available for the given socket or file type.
fr: L'appel système *sendfile* n'est pas disponible pour le connecteur ou le type de fichier donné.

source: A subclass of :exc:`RuntimeError`.
fr: Sous-classe de :exc:`RuntimeError`.

source: The requested read operation did not complete fully.
fr: L'opération de lecture demandée s'est terminée avant d'être complète.

source: Raised by the :ref:`asyncio stream APIs<asyncio-streams>`.
fr: Levée par les API de :ref:`flux asyncio <asyncio-streams>`.

source: This exception is a subclass of :exc:`EOFError`.
fr: Cette exception est une sous-classe de :exc:`EOFError`.

source: The total number (:class:`int`) of expected bytes.
fr: Nombre total (:class:`int`) d'octets attendus.

source: A string of :class:`bytes` read before the end of stream was reached.
fr: Chaîne de :class:`bytes` lue avant que la fin du flux ne soit atteinte.

source: Reached the buffer size limit while looking for a separator.
fr: La limite de taille de tampon a été atteinte lors de la recherche d'un séparateur.

source: Raised by the :ref:`asyncio stream APIs <asyncio-streams>`.
fr: Levée par les API :ref:`flux asyncio <asyncio-streams>`.

source: The total number of to be consumed bytes.
fr: Nombre total d'octets à consommer.
