Repository: python/python-docs-fr
Catalog: library/asyncio.po
Languages: fr

source: High-level APIs
fr: Bibliothèques de haut-niveau

source: Low-level APIs
fr: Bibliothèques de bas-niveau

source: Guides and Tutorials
fr: Guides et tutoriels

source: :mod:`asyncio` --- Asynchronous I/O
fr: :mod:`asyncio` — Entrées/Sorties asynchrones

source: asyncio is a library to write **concurrent** code using the **async/await** syntax.
fr: `asyncio` est une bibliothèque permettant de faire de la programmation asynchrone en utilisant la syntaxe *async*/*await*.

source: asyncio is used as a foundation for multiple Python asynchronous frameworks that provide high-performance network and web-servers, database connection libraries, distributed task queues, etc.
fr: `asyncio` constitue la base de nombreux cadriciels (*frameworks*) Python asynchrones qui fournissent des utilitaires réseau et des serveurs web performants, des bibliothèques de connexion à des bases de données, des files d'exécution distribuées, etc.

source: asyncio is often a perfect fit for IO-bound and high-level **structured** network code.
fr: `asyncio` est souvent le bon choix pour écrire du code réseau de haut-niveau et tributaire des entrées-sorties (*IO-bound*).

source: asyncio provides a set of **high-level** APIs to:
fr: `asyncio` fournit des interfaces de programmation **haut-niveau** pour :

source: :ref:`run Python coroutines <coroutine>` concurrently and have full control over their execution;
fr: :ref:`exécuter des coroutines Python <coroutine>` de manière concurrente et d'avoir le contrôle total sur leur exécution ;

source: perform :ref:`network IO and IPC <asyncio-streams>`;
fr: effectuer :ref:`des entrées/sorties réseau et de la communication inter-processus <asyncio-streams>` ;

source: control :ref:`subprocesses <asyncio-subprocess>`;
fr: contrôler des :ref:`sous-processus <asyncio-subprocess>` ;

source: distribute tasks via :ref:`queues <asyncio-queues>`;
fr: distribuer des tâches avec des :ref:`queues <asyncio-queues>` ;

source: :ref:`synchronize <asyncio-sync>` concurrent code;
fr: :ref:`synchroniser <asyncio-sync>` du code s'exécutant de manière concurrente ;

source: Additionally, there are **low-level** APIs for *library and framework developers* to:
fr: En plus, il existe des bibliothèques de **bas-niveau** pour que les *développeurs de bibliothèques et de frameworks* puissent :

source: create and manage :ref:`event loops <asyncio-event-loop>`, which provide asynchronous APIs for :meth:`networking <loop.create_server>`, running :meth:`subprocesses <loop.subprocess_exec>`, handling :meth:`OS signals <loop.add_signal_handler>`, etc;
fr: créer et gérer des :ref:`boucles d'événements <asyncio-event-loop>`, qui fournissent des bibliothèques asynchrones de :meth:`réseau <loop.create_server>`, d'exécution de :meth:`subprocesses <loop.subprocess_exec>`, de gestion de :meth:`signaux système <loop.add_signal_handler>`, etc ;

source: implement efficient protocols using :ref:`transports <asyncio-transports-protocols>`;
fr: implémenter des protocoles efficaces à l'aide de :ref:`transports <asyncio-transports-protocols>` ;

source: :ref:`bridge <asyncio-futures>` callback-based libraries and code with async/await syntax.
fr: :ref:`lier <asyncio-futures>` des bibliothèques basées sur les fonctions de rappel et développer avec la syntaxe *async*/*await*.

source: Reference
fr: Sommaire
