Repository: python/python-docs-fr
Catalog: library/asyncio-extending.po
Languages: fr

source: Extending
fr: Extension

source: The main direction for :mod:`asyncio` extending is writing custom *event loop* classes. Asyncio has helpers that could be used to simplify this task.
fr: La direction principale pour l'extension d':mod:`asyncio` est l'écriture de classes *event loop* personnalisées. *Asyncio* a des assistants qui peuvent être utilisés pour simplifier cette tâche.

source: Third-parties should reuse existing asyncio code with caution, a new Python version is free to break backward compatibility in *internal* part of API.
fr: la réutilisation du code asynchrone existant doit se faire avec prudence, une nouvelle version de Python est libre de rompre la compatibilité descendante dans la partie *interne* de l'API.

source: Writing a Custom Event Loop
fr: Écriture d'une boucle d'événements personnalisée

source: :class:`asyncio.AbstractEventLoop` declares very many methods. Implementing all them from scratch is a tedious job.
fr: :class:`asyncio.AbstractEventLoop` déclare de très nombreuses méthodes. Les mettre en œuvre à partir de zéro est un travail fastidieux.

source: A loop can get many common methods implementation for free by inheriting from :class:`asyncio.BaseEventLoop`.
fr: Une boucle d'événements peut obtenir gratuitement l'implémentation de nombreuses méthodes courantes en héritant de :class:`asyncio.BaseEventLoop`.

source: In turn, the successor should implement a bunch of *private* methods declared but not implemented in :class:`asyncio.BaseEventLoop`.
fr: Le successeur doit, pour ce qui le concerne, implémenter un ensemble de méthodes *privées* déclarées mais non implémentées dans :class:`asyncio.BaseEventLoop`.

source: For example, ``loop.create_connection()`` checks arguments, resolves DNS addresses, and calls ``loop._make_socket_transport()`` that should be implemented by inherited class. The ``_make_socket_transport()`` method is not documented and is considered as an *internal* API.
fr: Par exemple, ``loop.create_connection()`` vérifie les arguments, résout les adresses DNS et appelle ``loop._make_socket_transport()`` qui doit être implémentée par la classe héritée. La méthode ``_make_socket_transport()`` n'est pas documentée et est considérée comme une API *interne*.

source: Future and Task private constructors
fr: Constructeurs privés *Future* et *Task*

source: :class:`asyncio.Future` and :class:`asyncio.Task` should be never created directly, please use corresponding :meth:`loop.create_future` and :meth:`loop.create_task`, or :func:`asyncio.create_task` factories instead.
fr: :class:`asyncio.Future` et :class:`asyncio.Task` ne doivent jamais être créées directement, veuillez utiliser les correspondances :meth:`loop.create_future` et :meth:`loop.create_task`, ou les fabriques :func:`asyncio.create_task` à la place.

source: However, third-party *event loops* may *reuse* built-in future and task implementations for the sake of getting a complex and highly optimized code for free.
fr: Cependant, les *boucles d'événements* tierces peuvent *réutiliser* les implémentations de *Future* et de *Task* intégrées dans le but d'obtenir gratuitement un code complexe et hautement optimisé.

source: For this purpose the following, *private* constructors are listed:
fr: À cette fin, les constructeurs *privés* suivants sont répertoriés :

source: Create a built-in future instance.
fr: Crée une instance de la *future* native.

source: *loop* is an optional event loop instance.
fr: *loop* est une instance de boucle d'événements facultative.

source: Create a built-in task instance.
fr: Crée une instance de la *Task* native.

source: *loop* is an optional event loop instance. The rest of arguments are described in :meth:`loop.create_task` description.
fr: *loop* est une instance de boucle d'événements facultative. Le reste des arguments est décrit dans la description de :meth:`loop.create_task`.

source: *context* argument is added.
fr: l'argument *contexte* a été ajouté.

source: Task lifetime support
fr: Prise en charge de la durée de vie des tâches

source: Register a new *task* as managed by *asyncio*.
fr: Enregistre une nouvelle *tâche* comme gérée par *asyncio*.

source: Call the function from a task constructor.
fr: Appelez la fonction à partir d'un constructeur de tâche.

source: Unregister a *task* from *asyncio* internal structures.
fr: Désinscrit une *tâche* des structures internes *asyncio*.

source: The function should be called when a task is about to finish.
fr: La fonction doit être appelée lorsqu'une tâche est sur le point de se terminer.

source: Switch the current task to the *task* argument.
fr: Bascule la tâche en cours vers l'argument *task*.

source: Call the function just before executing a portion of embedded *coroutine* (:meth:`coroutine.send` or :meth:`coroutine.throw`).
fr: Appelez la fonction juste avant d'exécuter une partie de la *coroutine* intégrée (:meth:`coroutine.send` ou :meth:`coroutine.throw`).

source: Switch the current task back from *task* to ``None``.
fr: Rebascule la tâche en cours de *task* à ``None``.

source: Call the function just after :meth:`coroutine.send` or :meth:`coroutine.throw` execution.
fr: Appelez la fonction juste après l'exécution de :meth:`coroutine.send` ou :meth:`coroutine.throw`.
