Repository: python/python-docs-fr
Catalog: library/asyncio-eventloop.po
Languages: fr

source: Create a TLS coder/decoder instance and insert it between the *transport* and the *protocol*. The coder/decoder implements both *transport*-facing protocol and *protocol*-facing transport.
fr: Crée une instance de codeur-décodeur TLS et l'insère entre le *transport* et le *protocol*. Le codeur-décodeur implémente à la fois le protocole vers le *transport* et le transport vers le *protocol*.

source: Return the created two-interface instance. After *await*, the *protocol* must stop using the original *transport* and communicate with the returned object only because the coder caches *protocol*-side data and sporadically exchanges extra TLS session packets with *transport*.
fr: Renvoie l'instance à deux interfaces créée. Après *await*, le *protocol* doit cesser d'utiliser le *transport* d'origine et communiquer avec l'objet renvoyé uniquement parce que le codeur met en cache les données côté *protocol* et échange sporadiquement des paquets de session TLS supplémentaires avec *transport*.

source: *transport* and *protocol* instances that methods like :meth:`~loop.create_server` and :meth:`~loop.create_connection` return.
fr: *transport* et *protocol* que des méthodes comme :meth:`~loop.create_server` et :meth:`~loop.create_connection` renvoient.

source: *sslcontext*: a configured instance of :class:`~ssl.SSLContext`.
fr: *sslcontext* : une instance configurée de :class:`~ssl.SSLContext`.

source: *server_side* pass ``True`` when a server-side connection is being upgraded (like the one created by :meth:`~loop.create_server`).
fr: *server_side* passe à ``True`` lorsqu'une connexion côté serveur est mise à jour (comme celle créée par :meth:`~loop.create_server`).

source: *server_hostname*: sets or overrides the host name that the target server's certificate will be matched against.
fr: *server_hostname* : définit ou remplace le nom d'hôte auquel le certificat du serveur cible est comparé.

source: Watching file descriptors
fr: Surveillance de descripteur de fichier

source: Start monitoring the *fd* file descriptor for read availability and invoke *callback* with the specified arguments once *fd* is available for reading.
fr: Commence à surveiller la disponibilité en lecture du descripteur de fichier *fd* et appelle *callback* avec les arguments spécifiés une fois que *fd* est disponible en lecture.

source: Stop monitoring the *fd* file descriptor for read availability. Returns ``True`` if *fd* was previously being monitored for reads.
fr: Arrête de surveiller le descripteur de fichier *fd* pour la disponibilité en lecture. Renvoie ``True`` si *fd* était précédemment surveillé pour les lectures.

source: Start monitoring the *fd* file descriptor for write availability and invoke *callback* with the specified arguments once *fd* is available for writing.
fr: Commence à surveiller le descripteur de fichier *fd* pour la disponibilité en écriture et appelle *callback* avec les arguments spécifiés une fois que *fd* est disponible en écriture.

source: Use :func:`functools.partial` :ref:`to pass keyword arguments <asyncio-pass-keywords>` to *callback*.
fr: Utilisez :func:`functools.partial` pour :ref:`passer des arguments nommés <asyncio-pass-keywords>` à *callback*.

source: Stop monitoring the *fd* file descriptor for write availability. Returns ``True`` if *fd* was previously being monitored for writes.
fr: Arrête de surveiller le descripteur de fichier *fd* pour la disponibilité en écriture. Renvoie ``True`` si *fd* était précédemment surveillé pour les écritures.

source: See also :ref:`Platform Support <asyncio-platform-support>` section for some limitations of these methods.
fr: Voir aussi la section :ref:`Prise en charge de la plate-forme <asyncio-platform-support>` pour certaines limitations de ces méthodes.

source: Working with socket objects directly
fr: Travail direct avec des objets *socket*

source: In general, protocol implementations that use transport-based APIs such as :meth:`loop.create_connection` and :meth:`loop.create_server` are faster than implementations that work with sockets directly. However, there are some use cases when performance is not critical, and working with :class:`~socket.socket` objects directly is more convenient.
fr: En général, les implémentations de protocole qui utilisent des API basées sur le transport telles que :meth:`loop.create_connection` et :meth:`loop.create_server` sont plus rapides que les implémentations qui fonctionnent directement avec les *sockets*. Cependant, il existe des cas d'utilisation où les performances ne sont pas critiques, et travailler directement avec les objets :class:`~socket.socket` est plus pratique.

source: Receive up to *nbytes* from *sock*. Asynchronous version of :meth:`socket.recv() <socket.socket.recv>`.
fr: Reçoit jusqu'à *nbytes* de *sock*. Version asynchrone de :meth:`socket.recv() <socket.socket.recv>`.

source: Return the received data as a bytes object.
fr: Renvoie les données reçues sous la forme d'un objet bytes.

source: *sock* must be a non-blocking socket.
fr: Le connecteur *sock* ne doit pas être bloquant.

source: Even though this method was always documented as a coroutine method, releases before Python 3.7 returned a :class:`Future`. Since Python 3.7 this is an ``async def`` method.
fr: même si cette méthode a toujours été documentée en tant que méthode coroutine, les versions antérieures à Python 3.7 renvoyaient un :class:`Future`. Depuis Python 3.7, il s'agit d'une méthode ``async def``.

source: Receive data from *sock* into the *buf* buffer. Modeled after the blocking :meth:`socket.recv_into() <socket.socket.recv_into>` method.
fr: Reçoit les données de *sock* dans le tampon *buf*. Basée sur le modèle de la méthode bloquante :meth:`socket.recv_into() <socket.socket.recv_into>`.

source: Return the number of bytes written to the buffer.
fr: Renvoie le nombre d'octets écrits dans le tampon.

source: Receive a datagram of up to *bufsize* from *sock*. Asynchronous version of :meth:`socket.recvfrom() <socket.socket.recvfrom>`.
fr: Reçoit un datagramme jusqu'à *bufsize* de *sock*. Version asynchrone de :meth:`socket.recvfrom() <socket.socket.recvfrom>`.

source: Return a tuple of (received data, remote address).
fr: Renvoie un *n*-uplet (données reçues, adresse distante).

source: Receive a datagram of up to *nbytes* from *sock* into *buf*. Asynchronous version of :meth:`socket.recvfrom_into() <socket.socket.recvfrom_into>`.
fr: Reçoit un datagramme jusqu'à *nbytes* de *sock* vers *buf*. Version asynchrone de :meth:`socket.recvfrom_into() <socket.socket.recvfrom_into>`.

source: Return a tuple of (number of bytes received, remote address).
fr: Renvoie un *n*-uplet (nombre d'octets reçus, adresse distante).

source: Send *data* to the *sock* socket. Asynchronous version of :meth:`socket.sendall() <socket.socket.sendall>`.
fr: Envoie les données *data* au connecteur *sock*. Version asynchrone de :meth:`socket.sendall() <socket.socket.sendall>`.

source: This method continues to send to the socket until either all data in *data* has been sent or an error occurs. ``None`` is returned on success. On error, an exception is raised. Additionally, there is no way to determine how much data, if any, was successfully processed by the receiving end of the connection.
fr: Cette méthode continue d'envoyer des données au connecteur jusqu'à ce que toutes les *data* aient été envoyées ou qu'une erreur se produise. ``None`` est renvoyé en cas de succès. En cas d'erreur, une exception est levée. De plus, il n'existe aucun moyen de déterminer la quantité de données, le cas échéant, qui a été traitée avec succès par l'extrémité réceptrice de la connexion.

source: Even though the method was always documented as a coroutine method, before Python 3.7 it returned a :class:`Future`. Since Python 3.7, this is an ``async def`` method.
fr: même si la méthode a toujours été documentée en tant que méthode coroutine, avant Python 3.7, elle renvoyait un :class:`Future`. Depuis Python 3.7, il s'agit d'une méthode ``async def``.

source: Send a datagram from *sock* to *address*. Asynchronous version of :meth:`socket.sendto() <socket.socket.sendto>`.
fr: Envoie un datagramme de *sock* à *address*. Version asynchrone de :meth:`socket.sendto() <socket.socket.sendto>`.

source: Return the number of bytes sent.
fr: Renvoie le nombre d'octets envoyés.

source: Connect *sock* to a remote socket at *address*.
fr: Connecte *sock* à un connecteur distant situé à *address*.

source: Asynchronous version of :meth:`socket.connect() <socket.socket.connect>`.
fr: Version asynchrone de :meth:`socket.connect() <socket.socket.connect>`.

source: ``address`` no longer needs to be resolved. ``sock_connect`` will try to check if the *address* is already resolved by calling :func:`socket.inet_pton`. If not, :meth:`loop.getaddrinfo` will be used to resolve the *address*.
fr: ``address`` n'a plus besoin d'être résolu. ``sock_connect`` essaie de vérifier si *address* est déjà résolue en appelant :func:`socket.inet_pton`. Sinon, :meth:`loop.getaddrinfo` est utilisé pour résoudre *address*.

source: :meth:`loop.create_connection` and :func:`asyncio.open_connection() <open_connection>`.
fr: :meth:`loop.create_connection` et :func:`asyncio.open_connection() <open_connection>`.

source: Accept a connection. Modeled after the blocking :meth:`socket.accept() <socket.socket.accept>` method.
fr: Accepte une connexion. Basée sur le modèle de la méthode bloquante :meth:`socket.accept() <socket.socket.accept>`.

source: The socket must be bound to an address and listening for connections. The return value is a pair ``(conn, address)`` where *conn* is a *new* socket object usable to send and receive data on the connection, and *address* is the address bound to the socket on the other end of the connection.
fr: Le connecteur doit être lié à une adresse et écouter les connexions. La valeur de retour est une paire ``(conn, adresse)`` où *conn* est un *nouvel* objet socket utilisable pour envoyer et recevoir des données sur la connexion, et *adresse* est l'adresse liée au connecteur de l'autre côté de la connexion.

source: :meth:`loop.create_server` and :func:`start_server`.
fr: :meth:`loop.create_server` et :func:`start_server`.

source: Send a file using high-performance :mod:`os.sendfile` if possible. Return the total number of bytes sent.
fr: Envoie le fichier en utilisant :mod:`os.sendfile` (haute performance) si possible. Renvoie le nombre total d'octets envoyés.

source: Asynchronous version of :meth:`socket.sendfile() <socket.socket.sendfile>`.
fr: Version asynchrone de :meth:`socket.sendfile() <socket.socket.sendfile>`.

source: *sock* must be a non-blocking :const:`socket.SOCK_STREAM` :class:`~socket.socket`.
fr: *sock* doit être un :const:`socket.SOCK_STREAM` :class:`~socket.socket` non bloquant.

source: *file* must be a regular file object open in binary mode.
fr: *file* doit être un objet fichier normal ouvert en mode binaire.

source: *fallback*, when set to ``True``, makes asyncio manually read and send the file when the platform does not support the sendfile syscall (e.g. Windows or SSL socket on Unix).
fr: *fallback*, lorsqu'il est défini à ``True``, permet à *asyncio* de lire et d'envoyer manuellement le fichier lorsque la plateforme ne prend pas en charge l'appel système *sendfile* (par exemple, Windows ou connecteur SSL sous Unix).

source: Raise :exc:`SendfileNotAvailableError` if the system does not support *sendfile* syscall and *fallback* is ``False``.
fr: Lève une :exc:`SendfileNotAvailableError` si le système ne prend pas en charge l'appel système *sendfile* et que *fallback* est ``False``.

source: Asynchronous version of :meth:`socket.getaddrinfo`.
fr: Version asynchrone de :meth:`socket.getaddrinfo`.

source: Asynchronous version of :meth:`socket.getnameinfo`.
fr: Version asynchrone de :meth:`socket.getnameinfo`.

source: Both *getaddrinfo* and *getnameinfo* methods were always documented to return a coroutine, but prior to Python 3.7 they were, in fact, returning :class:`asyncio.Future` objects. Starting with Python 3.7 both methods are coroutines.
fr: les méthodes *getaddrinfo* et *getnameinfo* ont toujours été documentées pour renvoyer une coroutine, mais avant Python 3.7, elles renvoyaient en fait des objets :class:`asyncio.Future`. À partir de Python 3.7, les deux méthodes sont des coroutines.

source: Working with pipes
fr: Travail avec des tubes (*pipes*)

source: Register the read end of *pipe* in the event loop.
fr: Branche l'extrémité en lecture du tube *pipe* à la boucle d'évènements.

source: *pipe* is a :term:`file-like object <file object>`.
fr: *pipe* est un :term:`simili-fichier <file object>`.

source: Return pair ``(transport, protocol)``, where *transport* supports the :class:`ReadTransport` interface and *protocol* is an object instantiated by the *protocol_factory*.
fr: Renvoie la paire ``(transport, protocol)``, où *transport* prend en charge l'interface :class:`ReadTransport` et *protocol* est un objet instancié par *protocol_factory*.

source: With :class:`SelectorEventLoop` event loop, the *pipe* is set to non-blocking mode.
fr: Avec la boucle d'événements :class:`SelectorEventLoop`, le *pipe* est mis en mode non bloquant.

source: Register the write end of *pipe* in the event loop.
fr: Branche l'extrémité en écriture de *pipe* à la boucle d'évènements.

source: *pipe* is :term:`file-like object <file object>`.
fr: *pipe* est un :term:`simili-fichier <file object>`.

source: Return pair ``(transport, protocol)``, where *transport* supports :class:`WriteTransport` interface and *protocol* is an object instantiated by the *protocol_factory*.
fr: Renvoie la paire ``(transport, protocol)``, où *transport* prend en charge l'interface :class:`WriteTransport` et *protocol* est un objet instancié par *protocol_factory*.

source: :class:`SelectorEventLoop` does not support the above methods on Windows. Use :class:`ProactorEventLoop` instead for Windows.
fr: :class:`SelectorEventLoop` ne prend pas en charge les méthodes ci-dessus sous Windows. Utilisez :class:`ProactorEventLoop` à la place pour Windows.

source: The :meth:`loop.subprocess_exec` and :meth:`loop.subprocess_shell` methods.
fr: les méthodes :meth:`loop.subprocess_exec` et :meth:`loop.subprocess_shell`.

source: Unix signals
fr: Signaux Unix

source: Set *callback* as the handler for the *signum* signal.
fr: Définit *callback* comme gestionnaire du signal *signum*.

source: The callback will be invoked by *loop*, along with other queued callbacks and runnable coroutines of that event loop. Unlike signal handlers registered using :func:`signal.signal`, a callback registered with this function is allowed to interact with the event loop.
fr: La fonction de rappel sera appelée par *loop*, avec d'autres rappels en file d'attente et des coroutines exécutables de cette boucle d'événements. Contrairement aux gestionnaires de signaux enregistrés à l'aide de :func:`signal.signal`, un rappel enregistré avec cette fonction est autorisé à interagir avec la boucle d'événements.

source: Raise :exc:`ValueError` if the signal number is invalid or uncatchable. Raise :exc:`RuntimeError` if there is a problem setting up the handler.
fr: Lève une :exc:`ValueError` si le numéro de signal est invalide ou non attrapable. Lève une :exc:`RuntimeError` s'il y a un problème lors de la configuration du gestionnaire.

source: Like :func:`signal.signal`, this function must be invoked in the main thread.
fr: Comme :func:`signal.signal`, cette fonction doit être invoquée dans le fil d'exécution principal.

source: Remove the handler for the *sig* signal.
fr: Supprime le gestionnaire du signal *sig*.

source: Return ``True`` if the signal handler was removed, or ``False`` if no handler was set for the given signal.
fr: Renvoie ``True`` si le gestionnaire de signal a été supprimé, ou ``False`` si aucun gestionnaire n'a été défini pour le signal donné.

source: The :mod:`signal` module.
fr: le module :mod:`signal`.

source: Executing code in thread or process pools
fr: Exécution de code dans des pools de threads ou de processus

source: Arrange for *func* to be called in the specified executor.
fr: Fait en sorte que *func* soit appelée dans l'exécuteur spécifié.

source: The *executor* argument should be an :class:`concurrent.futures.Executor` instance. The default executor is used if *executor* is ``None``.
fr: L'argument *executor* doit être une instance :class:`concurrent.futures.Executor`. L'exécuteur par défaut est utilisé si *executor* vaut ``None``.

source: Note that the entry point guard (``if __name__ == '__main__'``) is required for option 3 due to the peculiarities of :mod:`multiprocessing`, which is used by :class:`~concurrent.futures.ProcessPoolExecutor`. See :ref:`Safe importing of main module <multiprocessing-safe-main-import>`.
fr: Notez que la garde du point d'entrée (``if __name__ == '__main__'``) est requis pour l'option 3 en raison des particularités de :mod:`multiprocessing`, qui est utilisé par :class:`~concurrent.futures.ProcessPoolExecutor`. Voir :ref:`Importation sécurisée du module principal <multiprocessing-safe-main-import>`.

source: This method returns a :class:`asyncio.Future` object.
fr: Cette méthode renvoie un objet :class:`asyncio.Future`.

source: Use :func:`functools.partial` :ref:`to pass keyword arguments <asyncio-pass-keywords>` to *func*.
fr: Utilisez :func:`functools.partial` pour :ref:`passer des arguments nommés <asyncio-pass-keywords>` à *func*.

source: :meth:`loop.run_in_executor` no longer configures the ``max_workers`` of the thread pool executor it creates, instead leaving it up to the thread pool executor (:class:`~concurrent.futures.ThreadPoolExecutor`) to set the default.
fr: :meth:`loop.run_in_executor` ne configure plus le ``max_workers`` de l'exécuteur de pool de threads qu'il crée, laissant à la place à l'exécuteur de pool de threads (:class:`~concurrent.futures.ThreadPoolExecutor`) le soin de définir le défaut.

source: Set *executor* as the default executor used by :meth:`run_in_executor`. *executor* must be an instance of :class:`~concurrent.futures.ThreadPoolExecutor`.
fr: Définit *executor* comme exécuteur par défaut utilisé par :meth:`run_in_executor`. *executor* doit être une instance de :class:`~concurrent.futures.ThreadPoolExecutor`.

source: *executor* must be an instance of :class:`~concurrent.futures.ThreadPoolExecutor`.
fr: *executor* doit être une instance de :class:`~concurrent.futures.ThreadPoolExecutor`.

source: Error Handling API
fr: API de gestion d'erreur

source: Allows customizing how exceptions are handled in the event loop.
fr: Permet de personnaliser la façon dont les exceptions sont gérées dans la boucle d'événements.

source: Set *handler* as the new event loop exception handler.
fr: Définit *handler* comme nouveau gestionnaire d'exceptions de boucle d'événements.

source: If *handler* is ``None``, the default exception handler will be set. Otherwise, *handler* must be a callable with the signature matching ``(loop, context)``, where ``loop`` is a reference to the active event loop, and ``context`` is a ``dict`` object containing the details of the exception (see :meth:`call_exception_handler` documentation for details about context).
fr: Si *handler* est ``None``, le gestionnaire d'exceptions par défaut est activé. Sinon, *handler* doit être un appelable avec la signature correspondant à ``(loop, context)``, où ``loop`` est une référence à la boucle d'événements active et ``context`` est un ``dict`` contenant les détails de l'exception (voir la documentation :meth:`call_exception_handler` pour plus de détails sur le contexte).

source: Return the current exception handler, or ``None`` if no custom exception handler was set.
fr: Renvoie le gestionnaire d'exceptions actuel ou ``None`` si aucun gestionnaire d'exceptions personnalisé n'a été défini.

source: Default exception handler.
fr: Gestionnaire d'exception par défaut.

source: This is called when an exception occurs and no exception handler is set. This can be called by a custom exception handler that wants to defer to the default handler behavior.
fr: Appelée lorsqu'une exception se produit et qu'aucun gestionnaire d'exception n'est défini. Elle peut être appelée par un gestionnaire d'exceptions personnalisé qui souhaite s'en remettre au comportement du gestionnaire par défaut.

source: *context* parameter has the same meaning as in :meth:`call_exception_handler`.
fr: Le paramètre *context* a la même signification que dans :meth:`call_exception_handler`.

source: Call the current event loop exception handler.
fr: Appelle le gestionnaire d'exception de la boucle d'évènements actuelle.

source: *context* is a ``dict`` object containing the following keys (new keys may be introduced in future Python versions):
fr: *context* est un objet ``dict`` contenant les clés suivantes (de nouvelles clés pourront être introduites dans les futures versions de Python) :

source: 'message': Error message;
fr: 'message' : message d'erreur ;

source: 'exception' (optional): Exception object;
fr: 'exception' (facultatif) : objet exception ;

source: 'future' (optional): :class:`asyncio.Future` instance;
fr: 'future' (facultatif) : instance de :class:`asyncio.Future` ;

source: 'task' (optional): :class:`asyncio.Task` instance;
fr: 'task' (facultatif) : instance de :class:`asyncio.Task` ;

source: 'handle' (optional): :class:`asyncio.Handle` instance;
fr: *'handle'* (facultatif) : instance de :class:`asyncio.Handle` ;

source: 'protocol' (optional): :ref:`Protocol <asyncio-protocol>` instance;
fr: *'protocol'* (facultatif) : instance de :ref:`protocole asyncio <asyncio-protocol>` ;

source: 'transport' (optional): :ref:`Transport <asyncio-transport>` instance;
fr: 'transport' (facultatif) : instance de :ref:`transport asyncio <asyncio-transport>` ;

source: 'socket' (optional): :class:`socket.socket` instance;
fr: 'socket' (facultatif) : instance de :class:`socket.socket` ;

source: 'asyncgen' (optional): Asynchronous generator that caused
fr: *'asyncgen'* (facultatif) : générateur asynchrone qui a causé

source: the exception.
fr: l'exception

source: This method should not be overloaded in subclassed event loops. For custom exception handling, use the :meth:`set_exception_handler()` method.
fr: cette méthode ne doit pas être surchargée dans les boucles d'événements sous-classées. Pour la gestion personnalisée des exceptions, utilisez la méthode :meth:`set_exception_handler()`.

source: Enabling debug mode
fr: Activation du mode débogage

source: Get the debug mode (:class:`bool`) of the event loop.
fr: Obtient le mode de débogage (:class:`bool`) de la boucle d'événements.

source: The default value is ``True`` if the environment variable :envvar:`PYTHONASYNCIODEBUG` is set to a non-empty string, ``False`` otherwise.
fr: La valeur par défaut est ``True`` si la variable d'environnement :envvar:`PYTHONASYNCIODEBUG` est définie sur une chaîne non vide, ``False`` sinon.

source: Set the debug mode of the event loop.
fr: Active le mode débogage pour la boucle d'évènements.

source: The new :ref:`Python Development Mode <devmode>` can now also be used to enable the debug mode.
fr: le nouveau :ref:`mode de développement Python <devmode>` peut désormais également être utilisé pour activer le mode de débogage.

source: The :ref:`debug mode of asyncio <asyncio-debug-mode>`.
fr: le :ref:`mode debogage d'asyncio <asyncio-debug-mode>`.

source: Running Subprocesses
fr: Exécution de sous-processus
