Repository: python/python-docs-fr
Catalog: library/asyncio-api-index.po
Languages: fr

source: High-level API Index
fr: Index de l'API de haut niveau

source: This page lists all high-level async/await enabled asyncio APIs.
fr: Cette page répertorie toutes les API *async/await* de haut niveau disponibles dans l'API *asyncio*.

source: Tasks
fr: Tâches

source: Utilities to run asyncio programs, create Tasks, and await on multiple things with timeouts.
fr: Utilitaires pour exécuter des programmes asynchrones, créer des tâches et attendre plusieurs choses avec des délais maximaux d'attente.

source: Create event loop, run a coroutine, close the loop.
fr: Crée une boucle d'événements, exécute une coroutine, ferme la boucle.

source: A context manager that simplifies multiple async function calls.
fr: Gestionnaire de contexte qui simplifie plusieurs appels de fonction asynchrones.

source: Task object.
fr: Objet de tâche.

source: A context manager that holds a group of tasks. Provides a convenient and reliable way to wait for all tasks in the group to finish.
fr: Gestionnaire de contexte pour un groupe de tâches. Fournit un moyen pratique et fiable d'attendre la fin de toutes les tâches du groupe.

source: Start an asyncio Task, then returns it.
fr: Démarre une tâche asynchrone, puis la renvoie.

source: Return the current Task.
fr: Renvoie la tâche actuelle.

source: Return all tasks that are not yet finished for an event loop.
fr: Renvoie toutes les tâches qui ne sont pas encore terminées pour une boucle d'événements.

source: Sleep for a number of seconds.
fr: Dort quelques secondes.

source: Schedule and wait for things concurrently.
fr: Planifie et attend des choses concurrentes.

source: Run with a timeout.
fr: Exécute avec un délai d'attente.

source: Shield from cancellation.
fr: Empêche l'annulation.

source: Monitor for completion.
fr: Surveille l'achèvement.

source: Run with a timeout. Useful in cases when ``wait_for`` is not suitable.
fr: Exécute avec un délai d'attente. Utile dans les cas où ``wait_for`` ne convient pas.

source: Asynchronously run a function in a separate OS thread.
fr: Exécute de manière asynchrone une fonction dans un fil d'exécution séparé.

source: Schedule a coroutine from another OS thread.
fr: Planifie une coroutine à partir d'un autre fil d'exécution.

source: Monitor for completion with a ``for`` loop.
fr: Surveille l'achèvement avec une boucle ``for``.

source: Examples
fr: Exemples

source: :ref:`Using asyncio.gather() to run things in parallel <asyncio_example_gather>`.
fr: :ref:`Utilisation d'asyncio.gather() pour exécuter des choses en parallèle <asyncio_example_gather>`.

source: :ref:`Using asyncio.wait_for() to enforce a timeout <asyncio_example_waitfor>`.
fr: :ref:`Utilisation d'asyncio.wait_for() pour appliquer un délai d'attente <asyncio_example_waitfor>`.

source: :ref:`Cancellation <asyncio_example_task_cancel>`.
fr: :ref:`Annulation <asyncio_example_task_cancel>`.

source: :ref:`Using asyncio.sleep() <asyncio_example_sleep>`.
fr: :ref:`Utilisation d'asyncio.sleep() <asyncio_example_sleep>`.

source: See also the main :ref:`Tasks documentation page <coroutine>`.
fr: Voir aussi la page de :ref:`documentation de Tasks <coroutine>`.

source: Queues
fr: Files d'attente

source: Queues should be used to distribute work amongst multiple asyncio Tasks, implement connection pools, and pub/sub patterns.
fr: Les files d'attente doivent être utilisées pour répartir le travail entre plusieurs tâches asynchrones, implémenter des pools de connexions et des modèles *pub*/*sub*.

source: A FIFO queue.
fr: File d'attente FIFO (premier entré, premier sorti).

source: A priority queue.
fr: File d'attente avec gestion des priorités.

source: A LIFO queue.
fr: Pile LIFO (dernier entré, premier sorti).

source: :ref:`Using asyncio.Queue to distribute workload between several Tasks <asyncio_example_queue_dist>`.
fr: :ref:`Utilisation d'asyncio.Queue pour répartir la charge de travail entre plusieurs tâches <asyncio_example_queue_dist>`.

source: See also the :ref:`Queues documentation page <asyncio-queues>`.
fr: Voir aussi la page de :ref:`documentation des Queues <asyncio-queues>`.

source: Subprocesses
fr: Sous-processus

source: Utilities to spawn subprocesses and run shell commands.
fr: Utilitaires pour générer des sous-processus et exécuter des commandes shell.

source: Create a subprocess.
fr: Crée un sous-processus.

source: Run a shell command.
fr: Exécute une commande shell.

source: :ref:`Executing a shell command <asyncio_example_subprocess_shell>`.
fr: :ref:`Exécution d'une commande shell <asyncio_example_subprocess_shell>`.

source: See also the :ref:`subprocess APIs <asyncio-subprocess>` documentation.
fr: Voir aussi la documentation des :ref:`API subprocess <asyncio-subprocess>`.

source: Streams
fr: Flux (*streams*)

source: High-level APIs to work with network IO.
fr: API de haut niveau pour travailler avec les entrées-sorties réseau.

source: Establish a TCP connection.
fr: Établit une connexion TCP.

source: Establish a Unix socket connection.
fr: Établit une connexion sur un connecteur Unix.

source: Start a TCP server.
fr: Démarre un serveur TCP.

source: Start a Unix socket server.
fr: Démarre un serveur de socket Unix.

source: High-level async/await object to receive network data.
fr: Objet *async/await* de haut niveau pour recevoir des données réseau.

source: High-level async/await object to send network data.
fr: Objet *async/await* de haut niveau pour envoyer des données réseau.

source: :ref:`Example TCP client <asyncio_example_stream>`.
fr: :ref:`Exemple de client TCP <asyncio_example_stream>`.

source: See also the :ref:`streams APIs <asyncio-streams>` documentation.
fr: Voir aussi la documentation des :ref:`API streams <asyncio-streams>`.

source: Synchronization
fr: Synchronisation

source: Threading-like synchronization primitives that can be used in Tasks.
fr: Primitives de synchronisation de type thread qui peuvent être utilisées dans les tâches.

source: A mutex lock.
fr: Verrou mutex.

source: An event object.
fr: Objet événement.

source: A condition object.
fr: Objet condition.

source: A semaphore.
fr: Sémaphore.

source: A bounded semaphore.
fr: Sémaphore avec des bornes.

source: A barrier object.
fr: Objet barrière.

source: :ref:`Using asyncio.Event <asyncio_example_sync_event>`.
fr: :ref:`Utilisation d'asyncio.Event <asyncio_example_sync_event>`.

source: :ref:`Using asyncio.Barrier <asyncio_example_barrier>`.
fr: :ref:`Utilisation d'asyncio.Barrier <asyncio_example_barrier>`.

source: See also the documentation of asyncio :ref:`synchronization primitives <asyncio-sync>`.
fr: Voir aussi la documentation des :ref:`primitives asyncio de synchronisation <asyncio-sync>`.

source: Raised when a Task is cancelled. See also :meth:`Task.cancel`.
fr: Levée lorsqu'une tâche est annulée. Voir aussi :meth:`Task.cancel`.

source: Raised when a Barrier is broken. See also :meth:`Barrier.wait`.
fr: Levée lorsqu'une barrière est brisée. Voir aussi :meth:`Barrier.wait`.

source: :ref:`Handling CancelledError to run code on cancellation request <asyncio_example_task_cancel>`.
fr: :ref:`Utilisation de CancelledError pour exécuter le code sur la demande d'annulation <asyncio_example_task_cancel>`.

source: See also the full list of :ref:`asyncio-specific exceptions <asyncio-exceptions>`.
fr: Voir aussi la liste complète des :ref:`exceptions spécifiques asyncio <asyncio-exceptions>`.
