Repository: python/python-docs-fr
Catalog: library/binhex.po
Languages: fr

source: :mod:`binhex` --- Encode and decode binhex4 files
fr: :mod:`binhex` --- Encode et décode les fichiers binhex4

source: **Source code:** :source:`Lib/binhex.py`
fr: **Code source :** :source:`Lib/binhex.py`

source: This module encodes and decodes files in binhex4 format, a format allowing representation of Macintosh files in ASCII. Only the data fork is handled.
fr: Ce module encode et décode les fichiers au format binhex4, un format permettant la représentation de fichier Macintosh au format ASCII. Seulement la fourchette de donnée est supportée.

source: The :mod:`binhex` module defines the following functions:
fr: Le module :mod:`binhex` définit les fonctions suivantes :

source: Convert a binary file with filename *input* to binhex file *output*. The *output* parameter can either be a filename or a file-like object (any object supporting a :meth:`write` and :meth:`close` method).
fr: Converti un fichier binaire avec comme nom *input* en fichier binhex *output*. Le paramètre *output* peut être soit un nom de fichier, soit un objet s’apparentant à un fichier (tout objet supportant les méthodes :meth:`write` et :meth:`close`).

source: Decode a binhex file *input*. *input* may be a filename or a file-like object supporting :meth:`read` and :meth:`close` methods. The resulting file is written to a file named *output*, unless the argument is ``None`` in which case the output filename is read from the binhex file.
fr: Décode un fichier binhex *input*. *input* peut être soit un nom de fichier, soit un objet s’apparentant à un fichier supportant les méthodes :meth:`write` et :meth:`close`. Le résultat est écrit dans un fichier nommé *output*, sauf si l'argument est ``None``, dans ce cas le fichier de sorti est lu depuis le fichier binhex.

source: The following exception is also defined:
fr: L'exception suivante est aussi définie :

source: Exception raised when something can't be encoded using the binhex format (for example, a filename is too long to fit in the filename field), or when input is not properly encoded binhex data.
fr: Exception levée quand quelque chose ne peut être encodé en utilisant le format binhex (par exemple, un nom de fichier trop long pour rentrer dans le champ filename) ou quand les données d'entrée ne sont pas encodées correctement en binhex.

source: Support module containing ASCII-to-binary and binary-to-ASCII conversions.
fr: Module secondaire contenant les conversions ASCII-à-binaire et binaire-à-ASCII.

source: There is an alternative, more powerful interface to the coder and decoder, see the source for details.
fr: Il y a une alternative, une interface plus puissante pour le codeur et décodeur, voir les sources pour les détails.

source: If you code or decode textfiles on non-Macintosh platforms they will still use the old Macintosh newline convention (carriage-return as end of line).
fr: Si vous codez ou décodez sur des plateformes non-Macintosh, elles utiliseront l'ancienne convention Macintosh newline (retour-chariot comme fin de ligne).
