Repository: python/python-docs-fr
Catalog: library/bisect.po
Languages: fr

source: :mod:`bisect` --- Array bisection algorithm
fr: :mod:`bisect` — Algorithme de bissection de listes

source: **Source code:** :source:`Lib/bisect.py`
fr: **Code source :** :source:`Lib/bisect.py`

source: This module provides support for maintaining a list in sorted order without having to sort the list after each insertion. For long lists of items with expensive comparison operations, this can be an improvement over the more common approach. The module is called :mod:`bisect` because it uses a basic bisection algorithm to do its work. The source code may be most useful as a working example of the algorithm (the boundary conditions are already right!).
fr: Ce module fournit des outils pour maintenir une liste triée sans avoir à la trier à chaque insertion. Il pourrait être plus rapide que l'approche classique pour de longues listes d'éléments dont les opérations de comparaison sont lourdes. Le module se nomme :mod:`bisect` car il utilise une approche simple par bissection. Si vous voulez un exemple de cet algorithme, le mieux est d'aller lire le code source de ce module (les conditions sur les limites y étant justes !).

source: The following functions are provided:
fr: Les fonctions suivantes sont fournies :

source: Locate the insertion point for *x* in *a* to maintain sorted order. The parameters *lo* and *hi* may be used to specify a subset of the list which should be considered; by default the entire list is used. If *x* is already present in *a*, the insertion point will be before (to the left of) any existing entries. The return value is suitable for use as the first parameter to ``list.insert()`` assuming that *a* is already sorted.
fr: Trouve le point d'insertion de *x* dans *a* permettant de conserver l'ordre. Les paramètres *lo* et *hi* permettent de limiter les emplacements à vérifier dans la liste, par défaut toute la liste est utilisée. Si *x* est déjà présent dans *a*, le point d'insertion proposé sera avant (à gauche) de l'entrée existante. Si *a* est déjà triée, la valeur renvoyée peut directement être utilisée comme premier paramètre de ``list.insert()``.

source: The returned insertion point *i* partitions the array *a* into two halves so that ``all(val < x for val in a[lo : i])`` for the left side and ``all(val >= x for val in a[i : hi])`` for the right side.
fr: Le point d'insertion renvoyé, *i*, coupe la liste *a* en deux moitiés telles que, pour la moitié de gauche : ``all(val < x for val in a[lo : i])``, et pour la partie de droite : ``all(val >= x for val in a[i : hi])``.

source: Added the *key* parameter.
fr: ajout du paramètre *key*.

source: Similar to :func:`bisect_left`, but returns an insertion point which comes after (to the right of) any existing entries of *x* in *a*.
fr: Semblable à :func:`bisect_left`, mais renvoie un point d'insertion après (à droite) d'une potentielle entrée existante valant *x* dans *a*.

source: The returned insertion point *i* partitions the array *a* into two halves so that ``all(val <= x for val in a[lo : i])`` for the left side and ``all(val > x for val in a[i : hi])`` for the right side.
fr: Le point d'insertion renvoyé, *i*, coupe la liste *a* en deux moitiés telles que, pour la moitié de gauche : ``all(val <= x for val in a[lo : i])`` et pour la moitié de droite : ``all(val > x for val in a[i : hi])``.

source: Insert *x* in *a* in sorted order.
fr: Insère *x* dans *a* en préservant l'ordre.

source: This function first runs :func:`bisect_left` to locate an insertion point. Next, it runs the :meth:`insert` method on *a* to insert *x* at the appropriate position to maintain sort order.
fr: Cette fonction commence par appliquer :func:`bisect_left` pour déterminer la position de l'insertion, puis appelle la méthode :meth:`insert` de *a* pour ajouter *x* à l'endroit adéquat.

source: Keep in mind that the ``O(log n)`` search is dominated by the slow O(n) insertion step.
fr: Gardez à l'esprit que la complexité logarithmique :math:`O(\ln(n))` de la recherche est dominée par la lenteur de l'insertion, de complexité linéaire :math:`O(n)`.

source: Similar to :func:`insort_left`, but inserting *x* in *a* after any existing entries of *x*.
fr: Similaire à :func:`insort_left`, mais en insérant *x* dans *a* après une potentielle entrée existante égale à *x*.

source: This function first runs :func:`bisect_right` to locate an insertion point. Next, it runs the :meth:`insert` method on *a* to insert *x* at the appropriate position to maintain sort order.
fr: Le principe est le même que :func:`insort_left`, mais avec :func:`bisect_right`.

source: Performance Notes
fr: Notes sur la performance

source: When writing time sensitive code using *bisect()* and *insort()*, keep these thoughts in mind:
fr: Pour écrire du code sensible à la performance utilisant ``bisect()`` et ``insort()``, prenez en compte ces quelques considérations :

source: Bisection is effective for searching ranges of values. For locating specific values, dictionaries are more performant.
fr: La bissection est une bonne idée pour rechercher une plage de valeurs. Pour une seule valeur, mieux vaut un dictionnaire.

source: The *insort()* functions are ``O(n)`` because the logarithmic search step is dominated by the linear time insertion step.
fr: Les fonctions d'insertion dans une liste classée ont une complexité linéaire car c'est le coût d'une insertion, même si la recherche est logarithmique.

source: The search functions are stateless and discard key function results after they are used. Consequently, if the search functions are used in a loop, the key function may be called again and again on the same array elements. If the key function isn't fast, consider wrapping it with :func:`functools.cache` to avoid duplicate computations. Alternatively, consider searching an array of precomputed keys to locate the insertion point (as shown in the examples section below).
fr: Les fonctions de recherche ne maintiennent pas d'état et ne conservent pas le résultat de la fonction clé après utilisation. Par conséquent, si elles sont appelées dans une boucle, la fonction clé peut être appelée de nombreuses fois sur les mêmes entrées. Si cette fonction clé est lente, une possibilité est de l'encapsuler dans :func:`functools.cache` pour éviter de répéter les opérations. Une autre possibilité est d'effectuer la recherche sur un tableau de clés pré-calculées pour trouver le point d'insertion (voir les exemples plus bas).

source: The `SortedCollection recipe <https://code.activestate.com/recipes/577197-sortedcollection/>`_ uses bisect to build a full-featured collection class with straight-forward search methods and support for a key-function. The keys are precomputed to save unnecessary calls to the key function during searches.
fr: `SortedCollection recipe <https://code.activestate.com/recipes/577197-sortedcollection/>`_ utilise le module *bisect* pour construire une classe collection exposant des méthodes de recherches naturelles et gérant une fonction clef. Les clefs sont pré-calculées pour économiser des appels inutiles à la fonction clef durant les recherches.

source: Searching Sorted Lists
fr: Chercher dans des listes triées

source: The above :func:`bisect` functions are useful for finding insertion points but can be tricky or awkward to use for common searching tasks. The following five functions show how to transform them into the standard lookups for sorted lists::
fr: Les fonctions :func:`bisect` ci-dessus sont utiles pour insérer des éléments, mais peuvent être étranges et peu naturelles à utiliser pour rechercher des éléments. Les cinq fonctions suivantes montrent comment les transformer en recherche plus classique pour les listes triées ::

source: Examples
fr: Exemples

source: The :func:`bisect` function can be useful for numeric table lookups. This example uses :func:`bisect` to look up a letter grade for an exam score (say) based on a set of ordered numeric breakpoints: 90 and up is an 'A', 80 to 89 is a 'B', and so on::
fr: La fonction :func:`bisect` peut être utile pour des recherches dans des tableaux de nombres. Cet exemple utilise :func:`bisect` pour rechercher la note (sous forme de lettre) correspondant à une note sous forme de points, en se basant sur une échelle prédéfinie : plus de 90 vaut 'A', de 80 à 89 vaut 'B', etc. ::
