Repository: python/python-docs-fr
Catalog: library/bz2.po
Languages: fr

source: :mod:`bz2` --- Support for :program:`bzip2` compression
fr: :mod:`bz2` — Prise en charge de la compression :program:`bzip2`

source: **Source code:** :source:`Lib/bz2.py`
fr: **Code Source :** :source:`Lib/bz2.py`

source: This module provides a comprehensive interface for compressing and decompressing data using the bzip2 compression algorithm.
fr: Ce module fournit une interface complète pour compresser et décompresser les données en utilisant l'algorithme de compression *bzip2*.

source: The :mod:`bz2` module contains:
fr: Le module :mod:`bz2` contient :

source: The :func:`.open` function and :class:`BZ2File` class for reading and writing compressed files.
fr: La fonction :func:`.open` et la classe :class:`BZ2File` pour lire et écrire des fichiers compressés.

source: The :class:`BZ2Compressor` and :class:`BZ2Decompressor` classes for incremental (de)compression.
fr: Les classes :class:`BZ2Compressor` et :class:`BZ2Decompressor` pour la (dé)compression incrémentielle.

source: The :func:`compress` and :func:`decompress` functions for one-shot (de)compression.
fr: Les fonctions :func:`compress` et :func:`decompress` pour la (dé)compression en une seule fois.

source: (De)compression of files
fr: (Dé)compression de fichiers

source: Open a bzip2-compressed file in binary or text mode, returning a :term:`file object`.
fr: Ouvre un fichier compressé par *bzip2* en mode binaire ou texte, le renvoyant en :term:`file object`.

source: As with the constructor for :class:`BZ2File`, the *filename* argument can be an actual filename (a :class:`str` or :class:`bytes` object), or an existing file object to read from or write to.
fr: Tout comme avec le constructeur pour la classe :class:`BZ2File`, l'argument *filename* peut être un nom de fichier réel (un objet :class:`str` ou :class:`bytes`), ou un objet fichier existant à lire ou à écrire.

source: The *mode* argument can be any of ``'r'``, ``'rb'``, ``'w'``, ``'wb'``, ``'x'``, ``'xb'``, ``'a'`` or ``'ab'`` for binary mode, or ``'rt'``, ``'wt'``, ``'xt'``, or ``'at'`` for text mode. The default is ``'rb'``.
fr: L'argument *mode* peut valoir ``'r'``, ``'rb'``, ``'w'``, ``'wb'``, ``'x'``, ``'xb'``, ``'a'`` ou ``'ab'`` pour le mode binaire, ou ``'rt'``, ``'wt'``, ``'xt'`` ou ``'at'`` pour le mode texte. Il vaut par défaut ``'rb'``.

source: The *compresslevel* argument is an integer from 1 to 9, as for the :class:`BZ2File` constructor.
fr: L'argument *compresslevel* est un entier de 1 à 9, comme pour le constructeur :class:`BZ2File`.

source: For binary mode, this function is equivalent to the :class:`BZ2File` constructor: ``BZ2File(filename, mode, compresslevel=compresslevel)``. In this case, the *encoding*, *errors* and *newline* arguments must not be provided.
fr: Pour le mode binaire, cette fonction est équivalente au constructeur :class:`BZ2File` : ``BZ2File(filename, mode, compresslevel=compresslevel)``. Dans ce cas, les arguments *encoding*, *errors* et *newline* arguments ne doivent pas être fournis.

source: For text mode, a :class:`BZ2File` object is created, and wrapped in an :class:`io.TextIOWrapper` instance with the specified encoding, error handling behavior, and line ending(s).
fr: Pour le mode texte, un objet :class:`BZ2File` est créé et encapsulé dans une instance :class:`io.TextIOWrapper` avec l'encodage spécifié, le comportement de gestion des erreurs et les fins de ligne.

source: The ``'x'`` (exclusive creation) mode was added.
fr: Le mode ``'x'`` (création exclusive) est ajouté.

source: Accepts a :term:`path-like object`.
fr: Accepte un :term:`path-like object`.

source: Open a bzip2-compressed file in binary mode.
fr: Ouvre un fichier *bzip2* en mode binaire.

source: If *filename* is a :class:`str` or :class:`bytes` object, open the named file directly. Otherwise, *filename* should be a :term:`file object`, which will be used to read or write the compressed data.
fr: Si *filename* est un objet :class:`str` ou :class:`bytes`, ouvre le nom de fichier directement. Autrement, *filename* doit être un :term:`file object`, qui est utilisé pour lire ou écrire les données compressées.

source: The *mode* argument can be either ``'r'`` for reading (default), ``'w'`` for overwriting, ``'x'`` for exclusive creation, or ``'a'`` for appending. These can equivalently be given as ``'rb'``, ``'wb'``, ``'xb'`` and ``'ab'`` respectively.
fr: L'argument *mode* peut être soit ``'r'`` pour lire (par défaut), ``'w'`` pour écraser, ``'x'`` pour créer exclusivement, ou ``'a'`` pour ajouter. Ils peuvent également être écrits respectivement comme ``'rb'``, ``'wb'``, ``'xb'`` et ``'ab'``.

source: If *filename* is a file object (rather than an actual file name), a mode of ``'w'`` does not truncate the file, and is instead equivalent to ``'a'``.
fr: Si *filename* est un objet fichier (plutôt que le nom de fichier réel), le mode ``'w'`` ne tronque pas le fichier, mais équivaut à ``'a'``.

source: If *mode* is ``'w'`` or ``'a'``, *compresslevel* can be an integer between ``1`` and ``9`` specifying the level of compression: ``1`` produces the least compression, and ``9`` (default) produces the most compression.
fr: Si *mode* est ``'w'`` ou ``'a'``, *compresslevel* peut être un entier entre ``1`` et ``9`` spécifiant le niveau de compression : ``1`` utilise la compression la moins forte, et ``9`` (par défaut) la compression la plus forte.

source: If *mode* is ``'r'``, the input file may be the concatenation of multiple compressed streams.
fr: Si *mode* est ``'r'``, le fichier d'entrée peut être la concaténation de plusieurs flux compressés.

source: :class:`BZ2File` provides all of the members specified by the :class:`io.BufferedIOBase`, except for :meth:`detach` and :meth:`truncate`. Iteration and the :keyword:`with` statement are supported.
fr: :class:`BZ2File` fournit tous les membres spécifiés par la classe :class:`io.BufferedIOBase`, excepté les méthodes :meth:`detach` et :meth:`truncate`. L'itération et l'instruction :keyword:`with` sont prises en charge.

source: :class:`BZ2File` also provides the following method:
fr: :class:`BZ2File` fournit aussi la méthode suivante :

source: Return buffered data without advancing the file position. At least one byte of data will be returned (unless at EOF). The exact number of bytes returned is unspecified.
fr: Renvoie des données en mémoire tampon sans avancer la position du fichier. Au moins un octet de donnée (sauf l'EOF) est renvoyé. Le nombre exact d'octets renvoyés n'est pas spécifié.

source: While calling :meth:`peek` does not change the file position of the :class:`BZ2File`, it may change the position of the underlying file object (e.g. if the :class:`BZ2File` was constructed by passing a file object for *filename*).
fr: Bien que l'appel à la méthode :meth:`peek` ne change pas la position du fichier de la classe :class:`BZ2File`, il peut changer la position de l'objet fichier sous-jacent (e.g. si la classe :class:`BZ2File` a été construite en passant un objet fichier à *filename*).

source: Support for the :keyword:`with` statement was added.
fr: La prise en charge de l'instruction :keyword:`with` a été ajoutée.

source: The :meth:`fileno`, :meth:`readable`, :meth:`seekable`, :meth:`writable`, :meth:`read1` and :meth:`readinto` methods were added.
fr: Les méthodes :meth:`fileno`, :meth:`readable`, :meth:`seekable`, :meth:`writable`, :meth:`read1` et :meth:`readinto` ont été ajoutées.

source: Support was added for *filename* being a :term:`file object` instead of an actual filename.
fr: La gestion de *filename* comme :term:`file object` au lieu d'un nom de fichier réel a été ajoutée.

source: The ``'a'`` (append) mode was added, along with support for reading multi-stream files.
fr: Le mode ``'a'`` (ajout) a été ajouté, avec la prise en charge de la lecture des fichiers *multiflux*.

source: The :meth:`~io.BufferedIOBase.read` method now accepts an argument of ``None``.
fr: La méthode :meth:`~io.BufferedIOBase.read` accepte maintenant un argument ``None``.

source: The *buffering* parameter has been removed. It was ignored and deprecated since Python 3.0. Pass an open file object to control how the file is opened.
fr: Le paramètre *buffering* a été supprimé. Il était ignoré et obsolète depuis Python 3.0. Passez un objet fichier déjà ouvert si vous voulez contrôler la façon dont le fichier est ouvert.

source: The *compresslevel* parameter became keyword-only.
fr: Le paramètre *compresslevel* est devenu un paramètre exclusivement nommé.

source: This class is thread unsafe in the face of multiple simultaneous readers or writers, just like its equivalent classes in :mod:`gzip` and :mod:`lzma` have always been.
fr: Cette classe n'est plus protégée d'un accès concurrent malheureux par plusieurs lecteurs ou compresseurs. C'était déjà le cas depuis toujours des classes analogues dans les modules :mod:`gzip` et :mod:`lzma`.

source: Incremental (de)compression
fr: (Dé)compression incrémentielle

source: Create a new compressor object. This object may be used to compress data incrementally. For one-shot compression, use the :func:`compress` function instead.
fr: Crée un nouvel objet compresseur. Cet objet peut être utilisé pour compresser les données de manière incrémentielle. Pour une compression en une seule fois, utilisez à la place la fonction :func:`compress`.

source: *compresslevel*, if given, must be an integer between ``1`` and ``9``. The default is ``9``.
fr: *compresslevel*, s'il est fourni, doit être un entier entre ``1`` et ``9``. Sa valeur par défaut est ``9``.

source: Provide data to the compressor object. Returns a chunk of compressed data if possible, or an empty byte string otherwise.
fr: Fournit la donnée à l'objet compresseur. Renvoie un bloc de données compressées si possible, ou autrement une chaîne d'octet vide.

source: When you have finished providing data to the compressor, call the :meth:`flush` method to finish the compression process.
fr: Quand vous avez fini de fournir des données au compresseur, appelez la méthode :meth:`flush` pour finir le processus de compression.

source: Finish the compression process. Returns the compressed data left in internal buffers.
fr: Finit le processus de compression. Renvoie la donnée compressée restante dans les tampons internes.

source: The compressor object may not be used after this method has been called.
fr: L'objet compresseur ne peut pas être utilisé après que cette méthode a été appelée.

source: Create a new decompressor object. This object may be used to decompress data incrementally. For one-shot compression, use the :func:`decompress` function instead.
fr: Crée un nouvel objet décompresseur. Cet objet peut être utilisé pour décompresser les données de manière incrémentielle. Pour une compression en une seule fois, utilisez à la place la fonction :func:`decompress`.

source: This class does not transparently handle inputs containing multiple compressed streams, unlike :func:`decompress` and :class:`BZ2File`. If you need to decompress a multi-stream input with :class:`BZ2Decompressor`, you must use a new decompressor for each stream.
fr: Cette classe ne gère pas de manière transparente les entrées contenant plusieurs flux compressés, à la différence de :func:`decompress` et :class:`BZ2File`. Si vous avez besoin de décompresser une entrée *multiflux* avec la classe :class:`BZ2Decompressor`, vous devez utiliser un nouveau décompresseur pour chaque flux.

source: Decompress *data* (a :term:`bytes-like object`), returning uncompressed data as bytes. Some of *data* may be buffered internally, for use in later calls to :meth:`decompress`. The returned data should be concatenated with the output of any previous calls to :meth:`decompress`.
fr: Décompresse *data* (un :term:`bytes-like object`), renvoyant une donnée non compressée en tant que chaîne d'octets. Certaines de ces *data* peuvent être mises en interne en tampon, pour un usage lors d'appels ultérieurs par la méthode :meth:`decompress`. La donnée renvoyée doit être concaténée avec la sortie des appels précédents à la méthode :meth:`decompress`.

source: If *max_length* is nonnegative, returns at most *max_length* bytes of decompressed data. If this limit is reached and further output can be produced, the :attr:`~.needs_input` attribute will be set to ``False``. In this case, the next call to :meth:`~.decompress` may provide *data* as ``b''`` to obtain more of the output.
fr: Si *max_length* est positif, renvoie au plus *max_length* octets de données compressées. Si la limite est atteinte et que d'autres sorties peuvent être produites, l'attribut :attr:`~.needs_input` est positionné sur ``False``. Dans ce cas, lors de l'appel suivant à la méthode :meth:`~.decompress`, vous pouvez fournir ``b''`` dans *data* afin d'obtenir la suite de la sortie.

source: If all of the input data was decompressed and returned (either because this was less than *max_length* bytes, or because *max_length* was negative), the :attr:`~.needs_input` attribute will be set to ``True``.
fr: Si toutes les données entrées ont été décompressées et renvoyées (soit parce qu'il y avait moins de *max_length* octets, ou parce que *max_length* était négatif), l'attribut :attr:`~.needs_input` sera configuré sur ``True``.

source: Added the *max_length* parameter.
fr: Ajout du paramètre *max_length*.

source: ``True`` if the end-of-stream marker has been reached.
fr: ``True`` si le marqueur de fin de flux a été atteint.

source: Data found after the end of the compressed stream.
fr: Donnée trouvée après la fin du flux compressé.

source: If this attribute is accessed before the end of the stream has been reached, its value will be ``b''``.
fr: Si l'attribut est accédé avant que la fin du flux ait été atteint, sa valeur sera ``b''``.

source: ``False`` if the :meth:`.decompress` method can provide more decompressed data before requiring new uncompressed input.
fr: ``False`` si la méthode :meth:`.decompress` peut fournir plus de données décompressées avant l'acquisition d'une nouvelle entrée non compressée.

source: One-shot (de)compression
fr: (Dé)compression en une fois

source: Compress *data*, a :term:`bytes-like object <bytes-like object>`.
fr: Compresse *data*, un :term:`bytes-like object <bytes-like object>`.

source: For incremental compression, use a :class:`BZ2Compressor` instead.
fr: Pour la compression incrémentielle, utilisez à la place la classe :class:`BZ2Compressor`.

source: Decompress *data*, a :term:`bytes-like object <bytes-like object>`.
fr: Décompresse *data*, un :term:`bytes-like object <bytes-like object>`.

source: If *data* is the concatenation of multiple compressed streams, decompress all of the streams.
fr: Si *data* est la concaténation de multiples flux compressés, décompresse tous les flux.

source: For incremental decompression, use a :class:`BZ2Decompressor` instead.
fr: Pour une décompression incrémentielle, utilisez à la place la classe :class:`BZ2Decompressor`.

source: Support for multi-stream inputs was added.
fr: Prise en charge des entrées *multiflux*.

source: Examples of usage
fr: Exemples d'utilisation

source: Below are some examples of typical usage of the :mod:`bz2` module.
fr: Ci-dessous, nous présentons quelques exemples typiques de l'utilisation du module :mod:`bz2`.

source: Using :func:`compress` and :func:`decompress` to demonstrate round-trip compression:
fr: Utilise les fonctions :func:`compress` et :func:`decompress` pour démontrer une compression aller-retour :

source: Using :class:`BZ2Compressor` for incremental compression:
fr: Utilise la classe :class:`BZ2Compressor` pour une compression incrémentielle :

source: Writing and reading a bzip2-compressed file in binary mode:
fr: Écriture et lecture en mode binaire d'un fichier compressé avec *bzip2* :
