Repository: python/python-docs-fr
Catalog: library/calendar.po
Languages: fr

source: :mod:`calendar` --- General calendar-related functions
fr: :mod:`calendar` --- Fonctions calendaires générales

source: **Source code:** :source:`Lib/calendar.py`
fr: **Code source :** :source:`Lib/calendar.py`

source: This module allows you to output calendars like the Unix :program:`cal` program, and provides additional useful functions related to the calendar. By default, these calendars have Monday as the first day of the week, and Sunday as the last (the European convention). Use :func:`setfirstweekday` to set the first day of the week to Sunday (6) or to any other weekday. Parameters that specify dates are given as integers. For related functionality, see also the :mod:`datetime` and :mod:`time` modules.
fr: Ce module permet d'afficher un calendrier comme le fait le programme Unix :program:`cal`, et il fournit des fonctions utiles relatives au calendrier. Par défaut, ces calendriers ont le lundi comme premier jour de la semaine et le dimanche comme dernier jour. Utilisez :func:`setfirstweekday` pour définir le premier jour de la semaine à dimanche (6) ou à tout autre jour de la semaine. Les paramètres pour spécifier les dates sont donnés sous forme de nombres entiers. Voir aussi les modules :mod:`datetime` et :mod:`time`.

source: The functions and classes defined in this module use an idealized calendar, the current Gregorian calendar extended indefinitely in both directions. This matches the definition of the "proleptic Gregorian" calendar in Dershowitz and Reingold's book "Calendrical Calculations", where it's the base calendar for all computations. Zero and negative years are interpreted as prescribed by the ISO 8601 standard. Year 0 is 1 BC, year -1 is 2 BC, and so on.
fr: Les fonctions et les classes définies dans ce module utilisent un calendrier idéalisé, le calendrier grégorien actuel s'étendant indéfiniment dans les deux sens. Cela correspond à la définition du calendrier grégorien proleptique dans le livre de Dershowitz et Reingold « *Calendrical Calculations* », œuvre dans lequel il est le calendrier de référence de tous les calculs. Les années zéros et les années négatives sont interprétées comme prescrit par la norme ISO 8601. L'année 0 est 1 avant JC, l'année `-1` est 2 avant JC et ainsi de suite.

source: Creates a :class:`Calendar` object. *firstweekday* is an integer specifying the first day of the week. ``0`` is Monday (the default), ``6`` is Sunday.
fr: Crée un objet :class:`Calendar`. *firstweekday* est un entier spécifiant le premier jour de la semaine, valant par défaut ``0`` (lundi), pouvant aller jusqu'à ``6`` (dimanche).

source: A :class:`Calendar` object provides several methods that can be used for preparing the calendar data for formatting. This class doesn't do any formatting itself. This is the job of subclasses.
fr: L'objet :class:`Calendar` fournit plusieurs méthodes pouvant être utilisées pour préparer les données du calendrier pour le formatage. Cette classe ne fait pas de formatage elle-même. Il s'agit du travail des sous-classes.

source: :class:`Calendar` instances have the following methods:
fr: Les instances de :class:`Calendar` ont les méthodes suivantes :

source: Return an iterator for the week day numbers that will be used for one week. The first value from the iterator will be the same as the value of the :attr:`firstweekday` property.
fr: Renvoie un itérateur sur les numéros des jours d'une semaine. La première valeur est donc la même que la valeur de la propriété :attr:`firstweekday`.

source: Return an iterator for the month *month* (1--12) in the year *year*. This iterator will return all days (as :class:`datetime.date` objects) for the month and all days before the start of the month or after the end of the month that are required to get a complete week.
fr: Renvoie un itérateur sur les jours du mois *month* (1 à 12) de l'année *year*. Cet itérateur renvoie tous les jours du mois (sous forme d'instances de :class:`datetime.date`) ainsi que tous les jours avant le début du mois et après la fin du mois nécessaires pour obtenir des semaines complètes.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will simply be day of the month numbers. For the days outside of the specified month, the day number is ``0``.
fr: Renvoie un itérateur sur les jours du mois *month* de l'année *year*, comme :meth:`itermonthdates`, sans être limité par l'intervalle de :class:`datetime.date`. Les jours renvoyés sont simplement les numéros des jours du mois. Pour les jours en dehors du mois spécifié, le numéro du jour est ``0``.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will be tuples consisting of a day of the month number and a week day number.
fr: Renvoie un itérateur sur les jours du mois *month* de l'année *year* comme :meth:`itermonthdates`, sans être limité par la plage :class:`datetime.date`. Les jours renvoyés sont des paires composées du numéro du jour dans le mois et du numéro du jour dans la semaine.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will be tuples consisting of a year, a month and a day of the month numbers.
fr: Renvoie un itérateur sur les jours du *month* de l'année *year*, comme :meth:`itermonthdates`, sans être limité par l'intervalle de :class:`datetime.date`. Les jours sont renvoyés sous forme de triplets composés du numéro de l'année, du mois et du jour dans le mois.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will be tuples consisting of a year, a month, a day of the month, and a day of the week numbers.
fr: Renvoie un itérateur sur les jours du mois *month* de l'année *year*, comme :meth:`itermonthdates`, sans être limité par l'intervalle de :class:`datetime.date`. Le jours sont renvoyés sous forme de quadruplets contenant le numéro de l'année, du mois, du jour du mois et du jour de la semaine.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven :class:`datetime.date` objects.
fr: Renvoie la liste des semaines complètes du mois *month* de l'année *year*. Les semaines sont des listes de sept objets :class:`datetime.date`.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven tuples of day numbers and weekday numbers.
fr: Renvoie la liste des semaines complètes du mois *month* de l'année *year*. Les semaines sont des listes de sept paires contenant le numéro du jour dans le mois et du numéro du jour dans la semaine.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven day numbers.
fr: Renvoie la liste des semaines complètes du mois *month* de l'année *year*. Les semaines sont une liste de sept numéros de jours.

source: Return the data for the specified year ready for formatting. The return value is a list of month rows. Each month row contains up to *width* months (defaulting to 3). Each month contains between 4 and 6 weeks and each week contains 1--7 days. Days are :class:`datetime.date` objects.
fr: Renvoie ce qu'il faut pour afficher correctement une année. La valeur renvoyée est une liste de lignes de mois. Chaque ligne mensuelle contient jusqu'à *width* mois (avec une valeur par défaut à 3). Chaque mois contient de 4 à 6 semaines et chaque semaine 1 à 7 jours. Les jours sont des objets :class:`datetime.date`.

source: Return the data for the specified year ready for formatting (similar to :meth:`yeardatescalendar`). Entries in the week lists are tuples of day numbers and weekday numbers. Day numbers outside this month are zero.
fr: Renvoie ce qu'il faut pour afficher correctement une année, (similaire à :meth:`yeardatescalendar`). Les listes des semaines contiennent des paires contenant le numéro du jour du mois et le numéro du jour de la semaine. Les numéro des jours en dehors de ce mois sont à zéro.

source: Return the data for the specified year ready for formatting (similar to :meth:`yeardatescalendar`). Entries in the week lists are day numbers. Day numbers outside this month are zero.
fr: Renvoie ce qu'il faut pour afficher correctement une année, (similaire à :meth:`yeardatescalendar`). Les listes de semaines contiennent des numéros de jours. Les numéros de jours en dehors de ce mois sont de zéro.

source: This class can be used to generate plain text calendars.
fr: Cette classe peut être utilisée pour générer des calendriers en texte brut.

source: :class:`TextCalendar` instances have the following methods:
fr: Les instances :class:`TextCalendar` exposent les méthodes suivantes :

source: Return a month's calendar in a multi-line string. If *w* is provided, it specifies the width of the date columns, which are centered. If *l* is given, it specifies the number of lines that each week will use. Depends on the first weekday as specified in the constructor or set by the :meth:`setfirstweekday` method.
fr: Donne le calendrier d'un mois dans une chaîne multi-ligne. Si *w* est fourni, il spécifie la largeur des colonnes de date, qui sont centrées. Si *l* est donné, il spécifie le nombre de lignes que chaque semaine utilisera. Le résultat varie en fonction du premier jour de la semaine spécifié dans le constructeur ou défini par la méthode :meth:`setfirstweekday`.

source: Print a month's calendar as returned by :meth:`formatmonth`.
fr: Affiche le calendrier d'un mois tel que renvoyé par :meth:`formatmonth`.

source: Return a *m*-column calendar for an entire year as a multi-line string. Optional parameters *w*, *l*, and *c* are for date column width, lines per week, and number of spaces between month columns, respectively. Depends on the first weekday as specified in the constructor or set by the :meth:`setfirstweekday` method. The earliest year for which a calendar can be generated is platform-dependent.
fr: Renvoie un calendrier de *m* colonnes pour une année entière sous forme de chaîne multi-ligne. Les paramètres facultatifs *w*, *l* et *c* correspondent respectivement à la largeur de la colonne date, les lignes par semaines, le nombre d'espace entre les colonnes de mois. Le résultat varie en fonction du premier jour de la semaine spécifié dans le constructeur ou défini par la méthode :meth:`setfirstweekday`. La première année pour laquelle un calendrier peut être généré, dépend de la plateforme.

source: Print the calendar for an entire year as returned by :meth:`formatyear`.
fr: Affiche le calendrier pour une année entière comme renvoyé par :meth:`formatyear`.

source: This class can be used to generate HTML calendars.
fr: Cette classe peut être utilisée pour générer des calendriers HTML.

source: :class:`!HTMLCalendar` instances have the following methods:
fr: Les instances de :class:`!HTMLCalendar` utilisent les méthodes suivantes :

source: Return a month's calendar as an HTML table. If *withyear* is true the year will be included in the header, otherwise just the month name will be used.
fr: Renvoie le calendrier d'un mois sous la forme d'une table HTML. Si *withyear* est vrai l'année sera inclue dans l'en-tête, sinon seul le nom du mois sera utilisé.

source: Return a year's calendar as an HTML table. *width* (defaulting to 3) specifies the number of months per row.
fr: Renvoie le calendrier d'une année sous la forme d'une table HTML. *width* (par défaut à 3) spécifie le nombre de mois par ligne.

source: Return a year's calendar as a complete HTML page. *width* (defaulting to 3) specifies the number of months per row. *css* is the name for the cascading style sheet to be used. :const:`None` can be passed if no style sheet should be used. *encoding* specifies the encoding to be used for the output (defaulting to the system default encoding).
fr: Renvoie le calendrier d'une année sous la forme d'une page HTML complète. *width* (par défaut à 3) spécifie le nombre de mois par ligne. *css* est le nom de la feuille de style en cascade à utiliser. :const:`None` peut être passé si aucune feuille de style ne doit être utilisée. *encoding* spécifie l'encodage à utiliser pour les données de sortie (par défaut l'encodage par défaut du système).

source: :class:`!HTMLCalendar` has the following attributes you can override to customize the CSS classes used by the calendar:
fr: :class:`!HTMLCalendar` possède les attributs suivants que vous pouvez surcharger pour personnaliser les classes CSS utilisées par le calendrier :

source: A list of CSS classes used for each weekday. The default class list is::
fr: Une liste de classes CSS utilisées pour chaque jour de la semaine. La liste par défaut de la classe est::

source: more styles can be added for each day::
fr: davantage de styles peuvent être ajoutés pour chaque jour::

source: Note that the length of this list must be seven items.
fr: Notez que la longueur de cette liste doit être de sept éléments.

source: The CSS class for a weekday occurring in the previous or coming month.
fr: La classe CSS pour le jour de la semaine apparaissant dans le mois précédent ou à venir.

source: A list of CSS classes used for weekday names in the header row. The default is the same as :attr:`cssclasses`.
fr: Une liste de classes CSS utilisées pour les noms des jours de la semaine dans la ligne d'en-tête. Par défaut les mêmes que :attr:`cssclasses`.

source: The month's head CSS class (used by :meth:`formatmonthname`). The default value is ``"month"``.
fr: La classe CSS du mois en en-tête (utilisé par :meth:`formatmonthname`). La valeur par défaut est ``"month"``.

source: The CSS class for the whole month's table (used by :meth:`formatmonth`). The default value is ``"month"``.
fr: La classe CSS pour la table du mois entière (utilisé par :meth:`formatmonth`). La valeur par défaut est ``"month"``.

source: The CSS class for the whole year's table of tables (used by :meth:`formatyear`). The default value is ``"year"``.
fr: La classe CSS pour la table entière des tables de l'année (utilisé par :meth:`formatyear`). La valeur par défaut est ``"year"``.

source: The CSS class for the table head for the whole year (used by :meth:`formatyear`). The default value is ``"year"``.
fr: La classe CSS pour l'en-tête de la table pour l'année entière (utilisé par :meth:`formatyear`). La valeur par défaut est ``"year"``.

source: Note that although the naming for the above described class attributes is singular (e.g. ``cssclass_month`` ``cssclass_noday``), one can replace the single CSS class with a space separated list of CSS classes, for example::
fr: Notez que même si le nommage ci-dessus des attributs de classe est au singulier (e.g. ``cssclass_month`` ``cssclass_noday``), on peut remplacer la seule classe CSS par une liste de classes CSS séparées par un espace, par exemple::

source: Here is an example how :class:`!HTMLCalendar` can be customized::
fr: Voici un exemple de comment peut être personnalisée :class:`!HTMLCalendar`::

source: This subclass of :class:`TextCalendar` can be passed a locale name in the constructor and will return month and weekday names in the specified locale. If this locale includes an encoding all strings containing month and weekday names will be returned as unicode.
fr: Cette sous-classe de :class:`TextCalendar` peut recevoir un nom de lieu dans le constructeur et renverra les noms de mois et de jours de la semaine selon le lieu spécifié. Si ce lieu possède un encodage toutes les chaînes contenant des noms de mois ou de jours de la semaine seront renvoyées en unicode.

source: This subclass of :class:`HTMLCalendar` can be passed a locale name in the constructor and will return month and weekday names in the specified locale. If this locale includes an encoding all strings containing month and weekday names will be returned as unicode.
fr: Cette sous-classe de :class:`HTMLCalendar` peut recevoir un nom de lieu dans le constructeur et renverra les noms de mois et de jours de la semaine selon le lieu spécifié. Si ce lieu possède un encodage toutes les chaînes contenant des noms de mois ou de jours de la semaine seront renvoyées en unicode.

source: The :meth:`formatweekday` and :meth:`formatmonthname` methods of these two classes temporarily change the current locale to the given *locale*. Because the current locale is a process-wide setting, they are not thread-safe.
fr: Les méthodes :meth:`formatweekday` et :meth:`formatmonthname` de ces deux classes changent temporairement le lieu courant pour le lieu *locale* indiqué. Comme le lieu courant est un réglage de l'ensemble du processus, elles ne sont pas sécures pour les fils d'exécution.

source: For simple text calendars this module provides the following functions.
fr: Pour les calendriers texte simples ce module fournit les fonctions suivantes.

source: Sets the weekday (``0`` is Monday, ``6`` is Sunday) to start each week. The values :const:`MONDAY`, :const:`TUESDAY`, :const:`WEDNESDAY`, :const:`THURSDAY`, :const:`FRIDAY`, :const:`SATURDAY`, and :const:`SUNDAY` are provided for convenience. For example, to set the first weekday to Sunday::
fr: Fixe le jour de la semaine (``0`` pour lundi, ``6`` pour dimanche) qui débute chaque semaine. Les valeurs :const:`MONDAY`, :const:`TUESDAY`, :const:`WEDNESDAY`, :const:`THURSDAY`, :const:`FRIDAY`, :const:`SATURDAY`, et :const:`SUNDAY` sont fournies par commodité. Par exemple, pour fixer le premier jour de la semaine à dimanche::

source: Returns the current setting for the weekday to start each week.
fr: Renvoie le réglage courant pour le jour de la semaine débutant chaque semaine.

source: Returns :const:`True` if *year* is a leap year, otherwise :const:`False`.
fr: Renvoie :const:`True` si *year* est une année bissextile, sinon :const:`False`.

source: Returns the number of leap years in the range from *y1* to *y2* (exclusive), where *y1* and *y2* are years.
fr: Renvoie le nombre d'années bissextiles dans la période de *y1* à *y2* (non inclus), où *y1* et *y2* sont des années.

source: This function works for ranges spanning a century change.
fr: Cette fonction marche pour les périodes couvrant un changement de siècle.

source: Returns the day of the week (``0`` is Monday) for *year* (``1970``--...), *month* (``1``--``12``), *day* (``1``--``31``).
fr: Renvoie le jour de la semaine (``0`` pour lundi) pour *year* (``1970``--...), *month* (``1``--``12``), *day* (``1``--``31``).

source: Return a header containing abbreviated weekday names. *n* specifies the width in characters for one weekday.
fr: Renvoie un en-tête contenant les jours de la semaine en abrégé. *n* spécifie la largeur en caractères pour un jour de la semaine.

source: Returns weekday of first day of the month and number of days in month, for the specified *year* and *month*.
fr: Renvoie le jour de la semaine correspondant au premier jour du mois et le nombre de jours dans le mois, pour l'année *year* et le mois *month* spécifiés.

source: Returns a matrix representing a month's calendar. Each row represents a week; days outside of the month a represented by zeros. Each week begins with Monday unless set by :func:`setfirstweekday`.
fr: Renvoie une matrice représentant le calendrier d'un mois. Chaque ligne représente une semaine ; les jours en dehors du mois sont représentés par des zéros. Chaque semaine débute avec le lundi à moins de l'avoir modifié avec :func:`setfirstweekday`.

source: Prints a month's calendar as returned by :func:`month`.
fr: Affiche le calendrier d'un mois tel que renvoyé par :func:`month`.

source: Returns a month's calendar in a multi-line string using the :meth:`formatmonth` of the :class:`TextCalendar` class.
fr: Renvoie le calendrier d'un mois dans une chaîne multi-lignes en utilisant la méthode :meth:`formatmonth` de la classe :class:`TextCalendar`.

source: Prints the calendar for an entire year as returned by :func:`calendar`.
fr: Affiche le calendrier pour une année entière tel que renvoyé par :func:`calendar`.

source: Returns a 3-column calendar for an entire year as a multi-line string using the :meth:`formatyear` of the :class:`TextCalendar` class.
fr: Renvoie un calendrier sur 3 colonnes pour une année entière dans une chaîne multi-lignes en utilisant le méthode :meth:`formatyear` de la classe :class:`TextCalendar`.

source: An unrelated but handy function that takes a time tuple such as returned by the :func:`~time.gmtime` function in the :mod:`time` module, and returns the corresponding Unix timestamp value, assuming an epoch of 1970, and the POSIX encoding. In fact, :func:`time.gmtime` and :func:`timegm` are each others' inverse.
fr: Une fonction sans lien mais pratique qui prend un tuple temporel tel que renvoyé par la fonction :func:`~time.gmtime` du module :mod:`time`, et renvoie une valeur *timestamp* Unix,

source: The :mod:`calendar` module exports the following data attributes:
fr: Le module :mod:`calendar` exporte les attributs suivants :

source: An array that represents the days of the week in the current locale.
fr: Un tableau qui représente les jours de la semaine pour la localisation courante.

source: An array that represents the abbreviated days of the week in the current locale.
fr: Un tableau qui représente les jours de la semaine en abrégé pour la localisation courante.

source: An array that represents the months of the year in the current locale. This follows normal convention of January being month number 1, so it has a length of 13 and ``month_name[0]`` is the empty string.
fr: Un tableau qui représente les mois de l'année pour la localisation courante. Celui-ci respecte la convention usuelle où janvier est le mois numéro 1, donc il a une longueur de 13 et ``month_name[0]`` est la chaîne vide.

source: An array that represents the abbreviated months of the year in the current locale. This follows normal convention of January being month number 1, so it has a length of 13 and ``month_abbr[0]`` is the empty string.
fr: Un tableau qui représente les mois de l'année en abrégé pour la localisation courante. Celui-ci respecte la convention usuelle où janvier est le mois numéro 1, donc il a une longueur de 13 et ``month_name[0]`` est la chaîne vide.

source: Object-oriented interface to dates and times with similar functionality to the :mod:`time` module.
fr: Interface orientée objet pour les dates et les heures avec des fonctionnalités similaires au module :mod:`time`.

source: Low-level time related functions.
fr: Fonctions bas niveau relatives au temps.
