Repository: python/python-docs-fr
Catalog: library/cgitb.po
Languages: fr

source: :mod:`cgitb` --- Traceback manager for CGI scripts
fr: :mod:`cgitb` — Gestionnaire d'exceptions pour les scripts CGI

source: **Source code:** :source:`Lib/cgitb.py`
fr: **Code source :** :source:`Lib/cgitb.py`

source: The :mod:`cgitb` module provides a special exception handler for Python scripts. (Its name is a bit misleading. It was originally designed to display extensive traceback information in HTML for CGI scripts. It was later generalized to also display this information in plain text.) After this module is activated, if an uncaught exception occurs, a detailed, formatted report will be displayed. The report includes a traceback showing excerpts of the source code for each level, as well as the values of the arguments and local variables to currently running functions, to help you debug the problem. Optionally, you can save this information to a file instead of sending it to the browser.
fr: Le module :mod:`cgitb` fournit un gestionnaire d'exceptions spécifique pour les scripts Python. (Son nom est trompeur : Il a été conçu à l'origine pour afficher des pile d'appels en HTML pour les scripts CGI, puis a été généralisé par la suite pour afficher cette information en texte brut.) Une fois ce module activé, si une exception remonte jusqu'à l'interpréteur, un rapport détaillé sera affiché. Le rapport affiche la pile d'appels, montrant des extraits de code pour chaque niveau, ainsi que les arguments et les variables locales des fonctions appelantes pour vous aider à résoudre le problème. Il est aussi possible de sauvegarder cette information dans un fichier plutôt que de l'envoyer dans le navigateur.

source: To enable this feature, simply add this to the top of your CGI script::
fr: Pour activer cette fonctionnalité, ajoutez simplement ceci au début de votre script CGI ::

source: The options to the :func:`enable` function control whether the report is displayed in the browser and whether the report is logged to a file for later analysis.
fr: Les paramètres optionnels de la fonction :func:`enable` permettent de choisir si le rapport est envoyé au navigateur ou si le rapport est écrit dans un fichier pour analyse ultérieure.

source: This function causes the :mod:`cgitb` module to take over the interpreter's default handling for exceptions by setting the value of :attr:`sys.excepthook`.
fr: Appeler cette fonction remplace le gestionnaire d'exceptions par défaut de l'interpréteur par celui du module :mod:`cgitb`, en configurant :attr:`sys.excepthook`.

source: The optional argument *display* defaults to ``1`` and can be set to ``0`` to suppress sending the traceback to the browser. If the argument *logdir* is present, the traceback reports are written to files. The value of *logdir* should be a directory where these files will be placed. The optional argument *context* is the number of lines of context to display around the current line of source code in the traceback; this defaults to ``5``. If the optional argument *format* is ``"html"``, the output is formatted as HTML. Any other value forces plain text output. The default value is ``"html"``.
fr: Le paramètre optionnel *display* vaut ``1`` par défaut, et peut être mis à ``0`` pour désactiver l'envoi des piles d'appels au navigateur. Si l'argument *logdir* est donné les piles d'appels seront écrites dans des fichiers placés dans le dossier *logdir*. L'argument optionnel *context* est le nombre de lignes de code à afficher autour de la ligne courante dans le code source à chaque niveau de la pile d'appel, il vaut ``5`` par défaut. Si l'argument optionnel *format* est ``"html"``, le rapport sera rédigé en HTML. Le rapport sera écrit en texte brut pour toute autre valeur. La valeur par défaut est ``"html"``.

source: This function handles the exception described by *info* (a 3-tuple containing the result of :func:`sys.exc_info`), formatting its traceback as text and returning the result as a string. The optional argument *context* is the number of lines of context to display around the current line of source code in the traceback; this defaults to ``5``.
fr: Cette fonction gère l’exception décrite par *info* (un triplet contenant le résultat de :func:`sys.exc_info`), elle présente sa pile d’appels en texte brut et renvois le résultat sous forme de chaîne de caractères. L’argument facultatif *contexte* est le nombre de lignes de contexte à afficher autour de la ligne courante du code source dans la pile d’appels ; la valeur par défaut est ``5``.

source: This function handles the exception described by *info* (a 3-tuple containing the result of :func:`sys.exc_info`), formatting its traceback as HTML and returning the result as a string. The optional argument *context* is the number of lines of context to display around the current line of source code in the traceback; this defaults to ``5``.
fr: Cette fonction gère l’exception décrite par *info* (un triplet contenant le résultat de :func:`sys.exc_info`), elle présente sa pile d’appels en HTML et renvoie le résultat sous forme de chaîne de caractères. L’argument facultatif *contexte* est le nombre de lignes de contexte à afficher autour de la ligne courante du code source dans la pile d’appels ; la valeur par défaut est ``5``.

source: This function handles an exception using the default settings (that is, show a report in the browser, but don't log to a file). This can be used when you've caught an exception and want to report it using :mod:`cgitb`. The optional *info* argument should be a 3-tuple containing an exception type, exception value, and traceback object, exactly like the tuple returned by :func:`sys.exc_info`. If the *info* argument is not supplied, the current exception is obtained from :func:`sys.exc_info`.
fr: Cette fonction gère les exceptions en utilisant la configuration par défaut (c'est à dire envoyer un rapport HTML au navigateur sans l'enregistrer dans un fichier). Il peut être utilisé lorsque vous avez attrapé une exception et que vous en voulez un rapport généré par :mod:`cgitb`. L'argument optionnel *info* doit être un *tuple* de trois éléments contenant le type de l'exception, l'exception, et la pile d'appels, tel que le *tuple* renvoyé par :func:`sys.exc_info`. Si l'argument *info* n'est pas donné, l'exception courante est obtenue via :func:`sys.exc_info`.
