Repository: python/python-docs-fr
Catalog: library/cmath.po
Languages: fr

source: Conversions to and from polar coordinates
fr: Conversion vers et à partir de coordonnées polaires

source: *Polar coordinates* give an alternative way to represent a complex number. In polar coordinates, a complex number *z* is defined by the modulus *r* and the phase angle *phi*. The modulus *r* is the distance from *z* to the origin, while the phase *phi* is the counterclockwise angle, measured in radians, from the positive x-axis to the line segment that joins the origin to *z*.
fr: Les *coordonnées polaires* donnent une manière alternative de représenter un nombre complexe. En coordonnées polaires, un nombre complexe *z* est défini par son module *r* et par son argument (*angle de phase*) *phi*. Le module *r* est la distance entre *z* et l'origine, alors que l'argument *phi* est l'angle (dans le sens inverse des aiguilles d'une montre, ou sens trigonométrique), mesuré en radians, à partir de l'axe X positif, et vers le segment de droite joignant *z* à l'origine.

source: The following functions can be used to convert from the native rectangular coordinates to polar coordinates and back.
fr: Les fonctions suivantes peuvent être utilisées pour convertir à partir des coordonnées rectangulaires natives vers les coordonnées polaires, et vice-versa.

source: The modulus (absolute value) of a complex number *x* can be computed using the built-in :func:`abs` function. There is no separate :mod:`cmath` module function for this operation.
fr: Le module (valeur absolue) d'un nombre complexe *x* peut être calculé en utilisant la primitive :func:`abs`. Il n'y a pas de fonction spéciale du module :mod:`cmath` pour cette opération.

source: Return the representation of *x* in polar coordinates. Returns a pair ``(r, phi)`` where *r* is the modulus of *x* and phi is the phase of *x*. ``polar(x)`` is equivalent to ``(abs(x), phase(x))``.
fr: Renvoie la représentation de *x* en coordonnées polaires. Renvoie une paire ``(r, phi)`` où *r* est le module de *x* et phi est l'argument de *x*. ``polar(x)`` est équivalent à ``(abs(x), phase(x))``.

source: Power and logarithmic functions
fr: Fonctions logarithme et exponentielle

source: Return *e* raised to the power *x*, where *e* is the base of natural logarithms.
fr: Renvoie *e* élevé à la puissance *x*, où *e* est la base des logarithmes naturels.

source: Return the base-10 logarithm of *x*. This has the same branch cut as :func:`log`.
fr: Renvoie le logarithme en base 10 de *x*. Elle a la même coupure que :func:`log`.

source: Return the square root of *x*. This has the same branch cut as :func:`log`.
fr: Renvoie la racine carrée de *x*. Elle a la même coupure que :func:`log`.

source: Trigonometric functions
fr: Fonctions trigonométriques

source: Return the arc sine of *x*. This has the same branch cuts as :func:`acos`.
fr: Renvoie l'arc sinus de *x*. Elle a les mêmes coupures que :func:`acos`.

source: Return the cosine of *x*.
fr: Renvoie le cosinus de *x*.

source: Return the sine of *x*.
fr: Renvoie le sinus de *x*.

source: Return the tangent of *x*.
fr: Renvoie la tangente de *x*.

source: Hyperbolic functions
fr: Fonctions hyperboliques

source: Return the hyperbolic cosine of *x*.
fr: Renvoie le cosinus hyperbolique de *x*.

source: Return the hyperbolic sine of *x*.
fr: Renvoie le sinus hyperbolique de *x*.

source: Return the hyperbolic tangent of *x*.
fr: Renvoie la tangente hyperbolique de *x*.

source: Classification functions
fr: Fonctions de classifications

source: Return ``True`` if both the real and imaginary parts of *x* are finite, and ``False`` otherwise.
fr: Renvoie ``True`` si la partie réelle *et* la partie imaginaire de *x* sont finies, et ``False`` sinon.

source: Return ``True`` if either the real or the imaginary part of *x* is an infinity, and ``False`` otherwise.
fr: Renvoie ``True`` si soit la partie réelle *ou* la partie imaginaire de *x* est infinie, et ``False`` sinon.

source: Return ``True`` if either the real or the imaginary part of *x* is a NaN, and ``False`` otherwise.
fr: Renvoie ``True`` si soit la partie réelle *ou* la partie imaginaire de *x* est NaN, et ``False`` sinon.

source: Return ``True`` if the values *a* and *b* are close to each other and ``False`` otherwise.
fr: Renvoie ``True`` si les valeurs *a* et *b* sont proches l'une de l'autre, et ``False`` sinon.

source: Whether or not two values are considered close is determined according to given absolute and relative tolerances.
fr: Déterminer si deux valeurs sont proches se fait à l'aide des tolérances absolues et relatives données en paramètres.

source: *rel_tol* is the relative tolerance -- it is the maximum allowed difference between *a* and *b*, relative to the larger absolute value of *a* or *b*. For example, to set a tolerance of 5%, pass ``rel_tol=0.05``. The default tolerance is ``1e-09``, which assures that the two values are the same within about 9 decimal digits. *rel_tol* must be greater than zero.
fr: *rel_tol* est la tolérance relative -- c'est la différence maximale permise entre *a* et *b*, relativement à la plus grande valeur de *a* ou de *b*. Par exemple, pour définir une tolérance de 5%,, précisez ``rel_tol=0.05``. La tolérance par défaut est ``1e-09``, ce qui assure que deux valeurs sont les mêmes à partir de la 9\ :sup:`e` décimale. *rel_tol* doit être supérieur à zéro.

source: *abs_tol* is the minimum absolute tolerance -- useful for comparisons near zero. *abs_tol* must be at least zero.
fr: *abs_tol* est la tolérance absolue minimale -- utile pour les comparaisons proches de zéro. *abs_tol* doit valoir au moins zéro.

source: If no errors occur, the result will be: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.
fr: Si aucune erreur n'est rencontrée, le résultat sera : ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.

source: The IEEE 754 special values of ``NaN``, ``inf``, and ``-inf`` will be handled according to IEEE rules. Specifically, ``NaN`` is not considered close to any other value, including ``NaN``. ``inf`` and ``-inf`` are only considered close to themselves.
fr: Les valeurs spécifiques suivantes : ``NaN``, ``inf``, et ``-inf`` définies dans la norme IEEE 754 seront manipulées selon les règles du standard IEEE. En particulier, ``NaN`` n'est considéré proche d'aucune autre valeur, ``NaN`` inclus. ``inf`` et ``-inf`` ne sont considérés proches que d'eux-mêmes.

source: :pep:`485` -- A function for testing approximate equality
fr: :pep:`485` -- Une fonction pour tester des égalités approximées

source: Constants
fr: Constantes

source: The mathematical constant *π*, as a float.
fr: La constante mathématique *π*, en tant que flottant.

source: The mathematical constant *e*, as a float.
fr: La constante mathématique *e*, en tant que flottant.

source: The mathematical constant *τ*, as a float.
fr: La constante mathématique *τ*, sous forme de flottant.

source: Floating-point positive infinity. Equivalent to ``float('inf')``.
fr: Nombre à virgule flottante positif infini. Équivaut à ``float('inf')``.

source: Complex number with zero real part and positive infinity imaginary part. Equivalent to ``complex(0.0, float('inf'))``.
fr: Nombre complexe dont la partie réelle vaut zéro et la partie imaginaire un infini positif. Équivalent à ``complex(0.0, float('inf'))``.

source: A floating-point "not a number" (NaN) value. Equivalent to ``float('nan')``.
fr: Un nombre à virgule flottante *NaN* (*Not a number*). Équivalent à ``float('nan')``.

source: Complex number with zero real part and NaN imaginary part. Equivalent to ``complex(0.0, float('nan'))``.
fr: Nombre complexe dont la partie réelle vaut zéro et la partie imaginaire vaut un *NaN*. Équivalent à ``complex(0.0, float('nan'))``.

source: Note that the selection of functions is similar, but not identical, to that in module :mod:`math`. The reason for having two modules is that some users aren't interested in complex numbers, and perhaps don't even know what they are. They would rather have ``math.sqrt(-1)`` raise an exception than return a complex number. Also note that the functions defined in :mod:`cmath` always return a complex number, even if the answer can be expressed as a real number (in which case the complex number has an imaginary part of zero).
fr: Notez que la sélection de fonctions est similaire, mais pas identique, à celles du module :mod:`math`. La raison d'avoir deux modules est que certains utilisateurs ne sont pas intéressés par les nombres complexes, et peut-être ne savent même pas ce qu'ils sont. Ils préféreraient alors que ``math.sqrt(-1)`` lève une exception au lieu de renvoyer un nombre complexe. Également, notez que les fonctions définies dans :mod:`cmath` renvoient toujours un nombre complexe, même si le résultat peut être exprimé à l'aide d'un nombre réel (en quel cas la partie imaginaire du complexe vaut zéro).

source: A note on branch cuts: They are curves along which the given function fails to be continuous. They are a necessary feature of many complex functions. It is assumed that if you need to compute with complex functions, you will understand about branch cuts. Consult almost any (not too elementary) book on complex variables for enlightenment. For information of the proper choice of branch cuts for numerical purposes, a good reference should be the following:
fr: Une note sur les *coupures* : ce sont des courbes sur lesquelles la fonction n'est pas continue. Ce sont des caractéristiques nécessaires de beaucoup de fonctions complexes. Il est supposé que si vous avez besoin d'utiliser des fonctions complexes, vous comprendrez ce que sont les coupures. Consultez n'importe quel livre (pas trop élémentaire) sur les variables complexes pour plus d'informations. Pour des informations sur les choix des coupures à des fins numériques, voici une bonne référence :
