Repository: python/python-docs-fr
Catalog: library/cmd.po
Languages: fr

source: **Source code:** :source:`Lib/cmd.py`
fr: **Code source:** :source:`Lib/cmd.py`

source: The :class:`Cmd` class provides a simple framework for writing line-oriented command interpreters. These are often useful for test harnesses, administrative tools, and prototypes that will later be wrapped in a more sophisticated interface.
fr: La :class:`Cmd` fournit une base simple permettant d'écrire des interpréteurs en ligne de commande. Ceux-ci sont souvent utiles pour piloter des tests, pour des outils administratifs, et pour des prototypes destinés à être intégrés à une interface plus sophistiquée.

source: A :class:`Cmd` instance or subclass instance is a line-oriented interpreter framework. There is no good reason to instantiate :class:`Cmd` itself; rather, it's useful as a superclass of an interpreter class you define yourself in order to inherit :class:`Cmd`'s methods and encapsulate action methods.
fr: Une instance de :class:`Cmd` ou d'une classe en héritant est un *framework* orienté ligne de commande. Il n'y a pas de bonne raison d'instancier :class:`Cmd` directement. Elle est plutôt utile en tant que classe mère d'une classe-interprète que vous définirez afin d'hériter des méthodes de :class:`Cmd` et d'encapsuler les opérations.

source: The optional argument *completekey* is the :mod:`readline` name of a completion key; it defaults to :kbd:`Tab`. If *completekey* is not :const:`None` and :mod:`readline` is available, command completion is done automatically.
fr: L'argument facultatif *completekey* est le nom :mod:`readline` d'une touche de complétion. Si *completekey* ne vaut pas :const:`None` et que :mod:`readline` est disponible, la complétion de commandes est faite automatiquement.

source: The optional arguments *stdin* and *stdout* specify the input and output file objects that the Cmd instance or subclass instance will use for input and output. If not specified, they will default to :data:`sys.stdin` and :data:`sys.stdout`.
fr: Les arguments facultatifs *stdin* et *stdout* spécifient les objets-fichiers de lecture et d'écriture que l'instance de Cmd ou d'une classe fille utilisera comme entrée et sortie. Si ces arguments ne sont pas spécifiés, ils prendront comme valeur par défaut :data:`sys.stdin` et :data:`sys.stdout`.

source: If you want a given *stdin* to be used, make sure to set the instance's :attr:`use_rawinput` attribute to ``False``, otherwise *stdin* will be ignored.
fr: Si vous souhaitez qu'un *stdin* donné soit utilisé, assurez-vous que l'attribut :attr:`use_rawinput` de l'instance vaille ``False``, faute de quoi *stdin* sera ignoré.

source: Cmd Objects
fr: Objets Cmd

source: A :class:`Cmd` instance has the following methods:
fr: Une instance de :class:`Cmd` possède les méthodes suivantes :

source: Repeatedly issue a prompt, accept input, parse an initial prefix off the received input, and dispatch to action methods, passing them the remainder of the line as argument.
fr: Affiche une invite de commande de manière répétée, accepte une entrée, soustrait un préfixe initial de l'entrée reçue et envoie aux méthodes d'opération la partie restante de l'entrée reçue.

source: The optional argument is a banner or intro string to be issued before the first prompt (this overrides the :attr:`intro` class attribute).
fr: L'argument facultatif est une bannière ou chaîne de caractères d'introduction à afficher avant la première invite de commande (il redéfinit l'attribut de classe :attr:`intro`).

source: If the :mod:`readline` module is loaded, input will automatically inherit :program:`bash`\ -like history-list editing (e.g. :kbd:`Control-P` scrolls back to the last command, :kbd:`Control-N` forward to the next one, :kbd:`Control-F` moves the cursor to the right non-destructively, :kbd:`Control-B` moves the cursor to the left non-destructively, etc.).
fr: Si le module :mod:`readline` est chargé, l'entrée héritera automatiquement d'une édition d'historique similaire à :program:`bash` (Par exemple, :kbd:`Control-P` reviendra à la dernière commande, :kbd:`Control-N` avancera à la suivante, :kbd:`Control-F` déplace le curseur vers la droite, :kbd:`Control-B` déplace le curseur vers la gauche, etc...).

source: An end-of-file on input is passed back as the string ``'EOF'``.
fr: Une caractère de fin de fichier est transmis via la chaîne de caractères ``'EOF'``.

source: Method called when an empty line is entered in response to the prompt. If this method is not overridden, it repeats the last nonempty command entered.
fr: Méthode appelée quand une ligne vide est entrée en réponse à l'invite de commande. Si cette méthode n'est pas surchargée, elle répète la dernière commande non-vide entrée.

source: Method called on an input line when the command prefix is not recognized. If this method is not overridden, it prints an error message and returns.
fr: Méthode appelée lorsque le préfixe de commande d'une ligne entrée n'est pas reconnu. Si cette méthode n'est pas surchargée, elle affiche un message d'erreur et s'arrête.

source: Method called to display a list of strings as a compact set of columns. Each column is only as wide as necessary. Columns are separated by two spaces for readability.
fr: Méthode appelée pour afficher une liste de chaînes de caractères sous la forme d'un ensemble compact de colonnes. Chaque colonne est de largeur minimale. Les colonnes sont séparées par deux espaces pour faciliter la lecture.

source: Hook method executed just before the command line *line* is interpreted, but after the input prompt is generated and issued. This method is a stub in :class:`Cmd`; it exists to be overridden by subclasses. The return value is used as the command which will be executed by the :meth:`onecmd` method; the :meth:`precmd` implementation may re-write the command or simply return *line* unchanged.
fr: Méthode de rappel exécutée juste avant que la ligne de commande *line* ne soit interprétée, mais après que l'invite de commande ait été généré et affiché. Cette méthode existe afin d'être surchargée par des classes filles de :class:`Cmd`. La valeur de retour est utilisée comme la commande qui sera exécutée par la méthode :meth:`onecmd`. L'implémentation de :meth:`precmd` peut réécrire la commande ou simplement renvoyer *line* sans modification.

source: Hook method executed just after a command dispatch is finished. This method is a stub in :class:`Cmd`; it exists to be overridden by subclasses. *line* is the command line which was executed, and *stop* is a flag which indicates whether execution will be terminated after the call to :meth:`postcmd`; this will be the return value of the :meth:`onecmd` method. The return value of this method will be used as the new value for the internal flag which corresponds to *stop*; returning false will cause interpretation to continue.
fr: Méthode de rappel exécutée juste après qu'une commande ait été exécutée. Cette méthode existe afin d'être surchargée par des classes filles de :class:`Cmd`. *line* est la ligne de commande ayant été exécutée et *stop* est un *flag* indiquant si l'exécution sera terminée après un appel à :meth:`postcmd`. *stop* sera la valeur de retour de :meth:`onecmd`. La valeur de retour de cette méthode sera utilisée comme nouvelle valeur pour le *flag* interne correspondant à *stop*. Renvoyer *False* permettra à l'interprétation de continuer.

source: Hook method executed once when :meth:`cmdloop` is called. This method is a stub in :class:`Cmd`; it exists to be overridden by subclasses.
fr: Méthode de rappel exécutée une fois lorsque :meth:`cmdloop` est appelée. Cette méthode existe afin d'être surchargée par des classes filles de :class:`Cmd`.

source: Hook method executed once when :meth:`cmdloop` is about to return. This method is a stub in :class:`Cmd`; it exists to be overridden by subclasses.
fr: Méthode de rappel exécutée une fois lorsque :meth:`cmdloop` va s'arrêter. Cette méthode existe afin d'être surchargée par des classes filles de :class:`Cmd`.

source: Instances of :class:`Cmd` subclasses have some public instance variables:
fr: Les instances de classes filles de :class:`Cmd` possèdent des variables d'instance publiques :

source: The prompt issued to solicit input.
fr: L'invite de commande affiché pour solliciter une entrée.

source: The string of characters accepted for the command prefix.
fr: La chaîne de caractères acceptée en tant que préfixe de commande.

source: The last nonempty command prefix seen.
fr: Le dernier préfixe de commande non-vide vu.

source: A list of queued input lines. The cmdqueue list is checked in :meth:`cmdloop` when new input is needed; if it is nonempty, its elements will be processed in order, as if entered at the prompt.
fr: Une liste de lignes entrées en file. La liste *cmdqueue* est vérifiée dans :meth:`cmdloop` lorsqu'une nouvelle entrée est nécessitée; si elle n'est pas vide, ses éléments seront traités dans l'ordre, comme si ils avaient entrés dans l'invite de commande.

source: A string to issue as an intro or banner. May be overridden by giving the :meth:`cmdloop` method an argument.
fr: Une chaîne de caractères à afficher en introduction ou bannière. Peut être surchargée en passant un argument à la méthode :meth:`cmdloop`.

source: The header to issue if the help output has a section for documented commands.
fr: L'en-tête à afficher si la sortie de l'aide possède une section pour les commandes documentées.

source: The character used to draw separator lines under the help-message headers. If empty, no ruler line is drawn. It defaults to ``'='``.
fr: Le caractère utilisé pour afficher des lignes de séparation sous les en-têtes de messages d'aide. Si il est vide, aucune ligne de séparation n'est affichée. Par défaut, ce caractère vaut ``'='``.

source: Cmd Example
fr: Exemple

source: The :mod:`cmd` module is mainly useful for building custom shells that let a user work with a program interactively.
fr: Le module :mod:`cmd` est utile pour produire des invites de commande permettant à l'utilisateur de travailler avec un programme de manière interactive.

source: This section presents a simple example of how to build a shell around a few of the commands in the :mod:`turtle` module.
fr: Cette section présente un exemple simple de comment produire une invite de commande autour de quelques commandes du module :mod:`turtle`.

source: Here is a sample session with the turtle shell showing the help functions, using blank lines to repeat commands, and the simple record and playback facility:
fr: Voici une session d'exemple avec l'invite de commande *turtle*. Elle montre les fonctions d'aide, utilise les lignes vides pour répéter des commandes et montre l'utilitaire de *playback* :
