Repository: python/python-docs-fr
Catalog: library/codeop.po
Languages: fr

source: :mod:`codeop` --- Compile Python code
fr: :mod:`codeop` --- Compilation de code Python

source: **Source code:** :source:`Lib/codeop.py`
fr: **Code source :** :source:`Lib/codeop.py`

source: The :mod:`codeop` module provides utilities upon which the Python read-eval-print loop can be emulated, as is done in the :mod:`code` module. As a result, you probably don't want to use the module directly; if you want to include such a loop in your program you probably want to use the :mod:`code` module instead.
fr: Le module :mod:`codeop` fournit des outils permettant d'émuler une boucle de lecture-évaluation-affichage (en anglais *read-eval-print-loop* ou REPL), comme dans le module `code`. Par conséquent, ce module n'est pas destiné à être utilisé directement ; pour inclure un REPL dans un programme, il est préférable d'utiliser le module :mod:`code`.

source: There are two parts to this job:
fr: Cette tâche se divise en deux parties :

source: Being able to tell if a line of input completes a Python statement: in short, telling whether to print '``>>>``' or '``...``' next.
fr: Pouvoir affirmer qu'une ligne d'entrée est une instruction complète, ou achève une instruction : en bref, savoir s'il faut afficher « ``>>>`` » ou « ``...`` » à sa suite.

source: Remembering which future statements the user has entered, so subsequent input can be compiled with these in effect.
fr: Conserver les instructions déjà entrées par l'utilisateur, afin que les entrées suivantes puissent êtres compilées avec elles.

source: The :mod:`codeop` module provides a way of doing each of these things, and a way of doing them both.
fr: Le module :mod:`codeop` fournit un moyen d'effectuer ces deux parties, individuellement ou simultanément.

source: To do just the former:
fr: Pour les effectuer simultanément :

source: Tries to compile *source*, which should be a string of Python code and return a code object if *source* is valid Python code. In that case, the filename attribute of the code object will be *filename*, which defaults to ``'<input>'``. Returns ``None`` if *source* is *not* valid Python code, but is a prefix of valid Python code.
fr: Essaye de compiler *source*, qui doit être une chaîne de caractères représentant du code Python valide et renvoie un objet code le cas échéant. Dans ce cas, l'attribut de nom de fichier de l'objet code renvoyé sera *filename* (``'<input>'`` par défaut). Renvoie ``None`` si *source* n'est *pas* du code Python valide, mais est un préfixe de code Python valide.

source: If there is a problem with *source*, an exception will be raised. :exc:`SyntaxError` is raised if there is invalid Python syntax, and :exc:`OverflowError` or :exc:`ValueError` if there is an invalid literal.
fr: En cas de problème avec *source*, une exception est levée ; :exc:`SyntaxError` si la syntaxe Python est incorrecte, et :exc:`OverflowError` ou :exc:`ValueError` si un littéral invalide est rencontré.

source: The *symbol* argument determines whether *source* is compiled as a statement (``'single'``, the default) or as an :term:`expression` (``'eval'``). Any other value will cause :exc:`ValueError` to be raised.
fr: L'argument *symbol* détermine si *source* est compilée comme une instruction (``'single'``, par défaut) ou comme une :term:`expression` (``'eval'``). Toute autre valeur lèvera :exc:`ValueError`.

source: It is possible (but not likely) that the parser stops parsing with a successful outcome before reaching the end of the source; in this case, trailing symbols may be ignored instead of causing an error. For example, a backslash followed by two newlines may be followed by arbitrary garbage. This will be fixed once the API for the parser is better.
fr: Il est possible (quoique improbable) que l'analyseur s'arrête avant d'atteindre la fin du code source ; dans ce cas, les symboles venant après peuvent être ignorés au lieu de provoquer une erreur. Par exemple, une barre oblique inverse suivie de deux retours à la ligne peut être suivie par de la mémoire non-initialisée. Ceci sera corrigé quand l'interface de l'analyseur aura été améliorée.

source: Instances of this class have :meth:`__call__` methods identical in signature to the built-in function :func:`compile`, but with the difference that if the instance compiles program text containing a :mod:`__future__` statement, the instance 'remembers' and compiles all subsequent program texts with the statement in force.
fr: Les instances de cette classe ont des méthodes :meth:`__call__` de signature identique à la fonction native :func:`compile`, à la différence près que si l'instance compile du code source contenant une instruction :mod:`__future__`, l'instance s'en « souviendra » et compilera tous les codes sources suivants avec cette expression activée.

source: Instances of this class have :meth:`__call__` methods identical in signature to :func:`compile_command`; the difference is that if the instance compiles program text containing a ``__future__`` statement, the instance 'remembers' and compiles all subsequent program texts with the statement in force.
fr: Les instances de cette classe ont des méthodes :meth:`__call__` de signature identique à la fonction :func:`compile_command`, à la différence près que si l'instance compile du code source contenant une instruction :mod:`__future__`, l'instance s'en « souviendra » et compilera tous les codes sources suivants avec cette expression activée.
