Repository: python/python-docs-fr
Catalog: library/collections.po
Languages: fr

source: Since a named tuple is a regular Python class, it is easy to add or change functionality with a subclass. Here is how to add a calculated field and a fixed-width print format:
fr: Il est aisé d'ajouter ou de modifier les fonctionnalités des tuples nommés grâce à l'héritage puisqu'il s'agit de simples classes. Voici comment ajouter un champ calculé avec une longueur fixe d'affichage :

source: The subclass shown above sets ``__slots__`` to an empty tuple. This helps keep memory requirements low by preventing the creation of instance dictionaries.
fr: La sous-classe ci-dessus définit ``__slots__`` comme un tuple vide. Cela permet de garder une emprunte mémoire faible en empêchant la création de dictionnaire d'instance.

source: Subclassing is not useful for adding new, stored fields. Instead, simply create a new named tuple type from the :attr:`~somenamedtuple._fields` attribute:
fr: L'héritage n'est pas pertinent pour ajouter de nouveaux champs. Il est préférable de simplement créer un nouveau type de tuple nommé avec l'attribut :attr:`~somenamedtuple._fields` :

source: Docstrings can be customized by making direct assignments to the ``__doc__`` fields:
fr: Les *docstrings* peuvent être personnalisées en modifiant directement l'attribut ``__doc__`` :

source: Property docstrings became writeable.
fr: La propriété devient éditable.

source: Default values can be implemented by using :meth:`~somenamedtuple._replace` to customize a prototype instance:
fr: Les valeurs par défaut peuvent être implémentées en utilisant :meth:`~somenamedtuple._replace` pour personnaliser une instance prototype :

source: See :meth:`types.SimpleNamespace` for a mutable namespace based on an underlying dictionary instead of a tuple.
fr: Voir :meth:`types.SimpleNamespace` pour un espace de nommage muable basé sur un dictionnaire sous-jacent à la place d'un tuple.

source: :class:`OrderedDict` objects
fr: Objets :class:`OrderedDict`

source: Ordered dictionaries are just like regular dictionaries but have some extra capabilities relating to ordering operations. They have become less important now that the built-in :class:`dict` class gained the ability to remember insertion order (this new behavior became guaranteed in Python 3.7).
fr: Les dictionnaires ordonnés sont des dictionnaires comme les autres mais possèdent des capacités supplémentaires pour s'ordonner. Ils sont maintenant moins importants puisque la classe native :class:`dict` sait se souvenir de l'ordre d'insertion (cette fonctionnalité a été garantie par Python 3.7).

source: Some differences from :class:`dict` still remain:
fr: Quelques différences persistent vis-à-vis de :class:`dict` :

source: The regular :class:`dict` was designed to be very good at mapping operations. Tracking insertion order was secondary.
fr: Les :class:`dict` classiques ont été conçus pour être performants dans les opérations de correspondance. Garder une trace de l'ordre d'insertion était secondaire.

source: The :class:`OrderedDict` was designed to be good at reordering operations. Space efficiency, iteration speed, and the performance of update operations were secondary.
fr: Les :class:`OrderedDict` ont été conçus pour être performants dans les opérations de ré-arrangement. L'occupation mémoire, la vitesse de parcours et les performances de mise à jour étaient secondaires.

source: Algorithmically, :class:`OrderedDict` can handle frequent reordering operations better than :class:`dict`. This makes it suitable for tracking recent accesses (for example in an `LRU cache <https://medium.com/@krishankantsinghal/my-first-blog-on-medium-583159139237>`_).
fr: Algorithmiquement, :class:`OrderedDict` gère mieux les ré-arrangements fréquents que :class:`dict`. Ceci la rend adaptée pour suivre les accès les plus récents (par exemple pour implémenter un `cache LRU <https://medium.com/@krishankantsinghal/my-first-blog-on-medium-583159139237>`_ pour *Least Recently Used* en anglais).

source: The equality operation for :class:`OrderedDict` checks for matching order.
fr: Le test d'égalité de :class:`OrderedDict` vérifie si l'ordre correspond.

source: The :meth:`popitem` method of :class:`OrderedDict` has a different signature. It accepts an optional argument to specify which item is popped.
fr: La méthode :meth:`popitem` de :class:`OrderedDict` possède une signature différente. Elle accepte un argument optionnel pour spécifier quel élément doit être enlevé.

source: :class:`OrderedDict` has a :meth:`move_to_end` method to efficiently reposition an element to an endpoint.
fr: :class:`OrderedDict` possède une méthode :meth:`move_to_end` pour déplacer efficacement un élément à la fin.

source: Until Python 3.8, :class:`dict` lacked a :meth:`__reversed__` method.
fr: Avant Python 3.8, :class:`dict` n'a pas de méthode :meth:`__reversed__`.

source: Return an instance of a :class:`dict` subclass that has methods specialized for rearranging dictionary order.
fr: Renvoie une instance d'une sous-classe de :class:`dict` qui possède des méthodes spécialisées pour redéfinir l'ordre du dictionnaire.

source: The :meth:`popitem` method for ordered dictionaries returns and removes a (key, value) pair. The pairs are returned in :abbr:`LIFO (last-in, first-out)` order if *last* is true or :abbr:`FIFO (first-in, first-out)` order if false.
fr: La méthode :meth:`popitem` pour les dictionnaires ordonnés retire et renvoie une paire ``(clé, valeur)``. Les paires sont renvoyées comme pour une pile, c'est-à-dire dernier entré, premier sorti (en anglais :abbr:`LIFO (last-in, first-out)`) si *last* vaut ``True``. Si *last* vaut ``False``, alors les paires sont renvoyées comme pour une file, c'est-à-dire premier entré, premier sorti (en anglais :abbr:`FIFO (first-in, first-out)`).

source: Move an existing *key* to either end of an ordered dictionary. The item is moved to the right end if *last* is true (the default) or to the beginning if *last* is false. Raises :exc:`KeyError` if the *key* does not exist::
fr: Déplace une clé *key* existante à l'une des deux extrémités du dictionnaire : à droite si *last* vaut ``True`` (comportement par défaut) ou à gauche sinon. Lève une exception :exc:`KeyError` si la clé *key* n'est pas trouvée : ::

source: In addition to the usual mapping methods, ordered dictionaries also support reverse iteration using :func:`reversed`.
fr: En plus des méthodes usuelles des dictionnaires, les dictionnaires ordonnés gèrent l'itération en sens inverse grâce à :func:`reversed`.

source: Equality tests between :class:`OrderedDict` objects are order-sensitive and are implemented as ``list(od1.items())==list(od2.items())``. Equality tests between :class:`OrderedDict` objects and other :class:`~collections.abc.Mapping` objects are order-insensitive like regular dictionaries. This allows :class:`OrderedDict` objects to be substituted anywhere a regular dictionary is used.
fr: Les tests d'égalité entre deux objets :class:`OrderedDict` sont sensibles à l'ordre et sont implémentés comme ceci : ``list(od1.items() == list(od2.items())``. Les tests d'égalité entre un objet :class:`OrderedDict` et un objet :class:`~collections.abc.Mapping` ne sont pas sensibles à l'ordre (comme les dictionnaires natifs). Cela permet substituer des objets :class:`OrderedDict` partout où les dictionnaires natifs sont utilisés.

source: The items, keys, and values :term:`views <dictionary view>` of :class:`OrderedDict` now support reverse iteration using :func:`reversed`.
fr: Les :term:`vues <dictionary view>` d'éléments, de clés et de valeurs de :class:`OrderedDict` gèrent maintenant l'itération en sens inverse en utilisant :func:`reversed`.

source: With the acceptance of :pep:`468`, order is retained for keyword arguments passed to the :class:`OrderedDict` constructor and its :meth:`update` method.
fr: Suite à l'acceptation de la :pep:`468`, l'ordre des arguments nommés passés au constructeur et à la méthode :meth:`update` de :class:`OrderedDict` est conservé.

source: :class:`OrderedDict` Examples and Recipes
fr: Exemples et cas pratiques utilisant :class:`OrderDict`

source: It is straightforward to create an ordered dictionary variant that remembers the order the keys were *last* inserted. If a new entry overwrites an existing entry, the original insertion position is changed and moved to the end::
fr: Il est facile de créer une variante de dictionnaire ordonné qui retient l'ordre dans lequel les clés ont été insérées *en dernier*. Si une nouvelle entrée écrase une existante, la position d'insertion d'origine est modifiée et déplacée à la fin : ::

source: An :class:`OrderedDict` would also be useful for implementing variants of :func:`functools.lru_cache`::
fr: Un :class:`OrderedDict` peut aussi être utile pour implémenter des variantes de :func:`functools.lru_cache` ::

source: :class:`UserDict` objects
fr: Objets :class:`UserDict`

source: The class, :class:`UserDict` acts as a wrapper around dictionary objects. The need for this class has been partially supplanted by the ability to subclass directly from :class:`dict`; however, this class can be easier to work with because the underlying dictionary is accessible as an attribute.
fr: La classe :class:`UserDict` se comporte comme une surcouche autour des dictionnaires. L'utilité de cette classe est réduite car on peut maintenant hériter directement de :class:`dict`. Cependant, il peut être plus facile de travailler avec celle-ci car le dictionnaire sous-jacent est accessible comme attribut.

source: Class that simulates a dictionary. The instance's contents are kept in a regular dictionary, which is accessible via the :attr:`data` attribute of :class:`UserDict` instances. If *initialdata* is provided, :attr:`data` is initialized with its contents; note that a reference to *initialdata* will not be kept, allowing it be used for other purposes.
fr: Classe simulant un dictionnaire. Les instances de :class:`UserDict` possèdent un attribut :attr:`data` où est stocké leur contenu sous forme de dictionnaire natif. Si *initialdata* est spécifié, alors :attr:`data` est initialisé avec son contenu. Remarquez qu'une référence vers *initialdata* n'est pas conservée, ce qui permet de l'utiliser pour d'autres tâches.

source: In addition to supporting the methods and operations of mappings, :class:`UserDict` instances provide the following attribute:
fr: En plus de gérer les méthodes et opérations des dictionnaires, les instance de :class:`UserDict` fournissent l'attribut suivant :

source: A real dictionary used to store the contents of the :class:`UserDict` class.
fr: Un dictionnaire natif où est stocké le contenu de la classe :class:`UserDict`.

source: :class:`UserList` objects
fr: Objets :class:`UserList`

source: This class acts as a wrapper around list objects. It is a useful base class for your own list-like classes which can inherit from them and override existing methods or add new ones. In this way, one can add new behaviors to lists.
fr: Cette classe agit comme une surcouche autour des objets ``list``. C'est une classe mère utile pour vos classes listes-compatibles qui peuvent en hériter et surcharger les méthodes existantes ou en ajouter de nouvelles. Ainsi, on peut ajouter de nouveaux comportements aux listes.

source: The need for this class has been partially supplanted by the ability to subclass directly from :class:`list`; however, this class can be easier to work with because the underlying list is accessible as an attribute.
fr: L'utilité de cette classe a été partiellement réduite par la possibilité d'hériter directement de :class:`list`. Cependant, il peut être plus facile de travailler avec cette classe car la liste sous-jacente est accessible via un attribut.

source: Class that simulates a list. The instance's contents are kept in a regular list, which is accessible via the :attr:`data` attribute of :class:`UserList` instances. The instance's contents are initially set to a copy of *list*, defaulting to the empty list ``[]``. *list* can be any iterable, for example a real Python list or a :class:`UserList` object.
fr: Classe simulant une liste. Les instances de :class:`UserList` possèdent un attribut :attr:`UserList` où est stocké leur contenu sous forme de liste native. Il est initialement une copie de *list*, ou ``[]`` par défaut. *list* peut être un itérable, par exemple une liste native ou un objet :class:`UserList`.

source: In addition to supporting the methods and operations of mutable sequences, :class:`UserList` instances provide the following attribute:
fr: En plus de gérer les méthodes et opérations des séquences muables, les instances de :class:`UserList` possèdent l'attribut suivant :

source: A real :class:`list` object used to store the contents of the :class:`UserList` class.
fr: Un objet :class:`list` natif utilisé pour stocker le contenu de la classe :class:`UserList`.

source: **Subclassing requirements:** Subclasses of :class:`UserList` are expected to offer a constructor which can be called with either no arguments or one argument. List operations which return a new sequence attempt to create an instance of the actual implementation class. To do so, it assumes that the constructor can be called with a single parameter, which is a sequence object used as a data source.
fr: **Prérequis pour l'héritage :** Les sous-classe de :class:`UserList` doivent implémenter un constructeur qui peut être appelé avec zéro ou un argument. Les opérations sur les listes qui renvoient une nouvelle séquence essayent de créer une instance de la classe courante. C'est pour cela que le constructeur doit pouvoir être appelé avec un unique paramètre, un objet séquence utilisé comme source de données.

source: If a derived class does not wish to comply with this requirement, all of the special methods supported by this class will need to be overridden; please consult the sources for information about the methods which need to be provided in that case.
fr: Si une classe fille ne remplit pas cette condition, toutes les méthodes spéciales gérées par cette classe devront être implémentées à nouveau. Merci de consulter les sources pour obtenir des informations sur les méthodes qui doivent être fournies dans ce cas.

source: :class:`UserString` objects
fr: Objets :class:`UserString`

source: The class, :class:`UserString` acts as a wrapper around string objects. The need for this class has been partially supplanted by the ability to subclass directly from :class:`str`; however, this class can be easier to work with because the underlying string is accessible as an attribute.
fr: La classe :class:`UserString` agit comme une surcouche autour des objets ``str``. L'utilité de cette classe a été partiellement réduite par la possibilité d'hériter directement de :class:`str`. Cependant, il peut être plus facile de travailler avec cette classe car la chaîne de caractère sous-jacente est accessible via un attribut.

source: Class that simulates a string object. The instance's content is kept in a regular string object, which is accessible via the :attr:`data` attribute of :class:`UserString` instances. The instance's contents are initially set to a copy of *seq*. The *seq* argument can be any object which can be converted into a string using the built-in :func:`str` function.
fr: Classe simulant une chaîne de caractères. Les instances de :class:`UserString` possèdent un attribut :attr:`data` où est stocké leur contenu sous forme de chaîne de caractères native. Le contenu de l'instance est initialement une copie de *seq*, qui peut être n'importe quel objet convertible en chaîne de caractère avec la fonction native :func:`str`.

source: In addition to supporting the methods and operations of strings, :class:`UserString` instances provide the following attribute:
fr: En plus de gérer les méthodes et opérations sur les chaînes de caractères, les instances de :class:`UserString` possèdent l'attribut suivant :

source: A real :class:`str` object used to store the contents of the :class:`UserString` class.
fr: Un objet :class:`str` natif utilisé pour stocker le contenu de la classe :class:`UserString`.

source: New methods ``__getnewargs__``, ``__rmod__``, ``casefold``, ``format_map``, ``isprintable``, and ``maketrans``.
fr: Nouvelles méthodes ``__getnewargs__``, ``__rmod__``, ``casefold``, ``format_map``, ``isprintable`` et ``maketrans``.
