Repository: python/python-docs-fr
Catalog: library/collections.po
Languages: fr

source: :mod:`collections` --- Container datatypes
fr: :mod:`collections` — Types de données de conteneurs

source: **Source code:** :source:`Lib/collections/__init__.py`
fr: **Code source :** :source:`Lib/collections/__init__.py`

source: This module implements specialized container datatypes providing alternatives to Python's general purpose built-in containers, :class:`dict`, :class:`list`, :class:`set`, and :class:`tuple`.
fr: Ce module implémente des types de données de conteneurs spécialisés qui apportent des alternatives aux conteneurs natifs de Python plus généraux :class:`dict`, :class:`list`, :class:`set` et :class:`tuple`.

source: factory function for creating tuple subclasses with named fields
fr: fonction permettant de créer des sous-classes de ``tuple`` avec des champs nommés

source: list-like container with fast appends and pops on either end
fr: conteneur se comportant comme une liste avec des ajouts et retraits rapides à chaque extrémité

source: dict-like class for creating a single view of multiple mappings
fr: classe semblable aux dictionnaires qui crée une unique vue à partir de plusieurs dictionnaires

source: dict subclass for counting hashable objects
fr: sous-classe de ``dict`` pour compter des objets hachables

source: dict subclass that remembers the order entries were added
fr: sous-classe de ``dict`` qui garde en mémoire l'ordre dans lequel les entrées ont été ajoutées

source: dict subclass that calls a factory function to supply missing values
fr: sous-classe de ``dict`` qui appelle une fonction de fabrication en cas de valeur manquante

source: wrapper around dictionary objects for easier dict subclassing
fr: surcouche autour des objets dictionnaires pour faciliter l'héritage de ``dict``

source: wrapper around list objects for easier list subclassing
fr: surcouche autour des objets listes pour faciliter l'héritage de ``list``

source: wrapper around string objects for easier string subclassing
fr: surcouche autour des objets chaînes de caractères pour faciliter l'héritage de ``str``

source: Moved :ref:`collections-abstract-base-classes` to the :mod:`collections.abc` module. For backwards compatibility, they continue to be visible in this module through Python 3.7. Subsequently, they will be removed entirely.
fr: Les :ref:`collections-abstract-base-classes` ont été déplacées vers le module :mod:`collections.abc`. Pour assurer la rétrocompatibilité, elles sont toujours disponibles dans ce module en Python 3.7 mais seront ensuite totalement supprimées.

source: :class:`ChainMap` objects
fr: Objets :class:`ChainMap`

source: A :class:`ChainMap` class is provided for quickly linking a number of mappings so they can be treated as a single unit. It is often much faster than creating a new dictionary and running multiple :meth:`~dict.update` calls.
fr: Le module fournit une classe :class:`ChainMap` afin de réunir rapidement plusieurs dictionnaires en une unique entité. Cela est souvent plus rapide que de créer un nouveau dictionnaire et d'effectuer plusieurs appels de :meth:`~dict.update`.

source: The class can be used to simulate nested scopes and is useful in templating.
fr: Cette classe peut être utilisée pour simuler des portées imbriquées, elle est aussi utile pour le *templating*.

source: A :class:`ChainMap` groups multiple dicts or other mappings together to create a single, updateable view. If no *maps* are specified, a single empty dictionary is provided so that a new chain always has at least one mapping.
fr: Un objet :class:`ChainMap` regroupe plusieurs dictionnaires (ou autres tableaux de correspondance) en une vue que l'on peut mettre à jour. Si le paramètre *maps* est vide, un dictionnaire vide est fourni de telle manière qu'une nouvelle chaîne possède toujours au moins un dictionnaire.

source: The underlying mappings are stored in a list. That list is public and can be accessed or updated using the *maps* attribute. There is no other state.
fr: Les dictionnaires sous-jacents sont stockés dans une liste. Celle-ci est publique et peut être consultée ou mise à jour via l'attribut *maps*. Il n'y a pas d'autre état.

source: Lookups search the underlying mappings successively until a key is found. In contrast, writes, updates, and deletions only operate on the first mapping.
fr: Les recherches s'effectuent successivement dans chaque dictionnaire jusqu'à la première clé correspondante. En revanche, les écritures, mises à jour et suppressions n'affectent que le premier dictionnaire.

source: A :class:`ChainMap` incorporates the underlying mappings by reference. So, if one of the underlying mappings gets updated, those changes will be reflected in :class:`ChainMap`.
fr: Un objet :class:`ChainMap` incorpore les dictionnaires sous-jacents par leur référence. Ainsi, si l'un d'eux est modifié, les changements affectent également la :class:`ChainMap`.

source: All of the usual dictionary methods are supported. In addition, there is a *maps* attribute, a method for creating new subcontexts, and a property for accessing all but the first mapping:
fr: Toutes les méthodes usuelles des dictionnaires sont gérées. De plus, cette classe fournit un attribut *maps*, une méthode pour créer de nouveaux sous-contextes et une propriété pour accéder à tous les dictionnaires sous-jacents excepté le premier :

source: A user updateable list of mappings. The list is ordered from first-searched to last-searched. It is the only stored state and can be modified to change which mappings are searched. The list should always contain at least one mapping.
fr: Liste de dictionnaires éditable par l'utilisateur et classée selon l'ordre de recherche. Il s'agit de l'unique état stocké et elle peut être modifiée pour changer l'ordre de recherche. La liste doit toujours contenir au moins un dictionnaire.

source: Returns a new :class:`ChainMap` containing a new map followed by all of the maps in the current instance. If ``m`` is specified, it becomes the new map at the front of the list of mappings; if not specified, an empty dict is used, so that a call to ``d.new_child()`` is equivalent to: ``ChainMap({}, *d.maps)``. This method is used for creating subcontexts that can be updated without altering values in any of the parent mappings.
fr: Renvoie un nouvel objet :class:`ChainMap` contenant un nouveau dictionnaire suivi par tous les autres de l'instance actuelle. Si ``m`` est spécifié, il devient le nouveau dictionnaire au début de la liste ; sinon, un dictionnaire vide est utilisé, de telle manière qu'appeler ``d.new_child()`` équivaut à appeler ``ChainMap({}, *d.maps)``. Cette méthode est utile pour créer des sous-contextes qui peuvent être mis à jour sans altérer les valeurs dans les dictionnaires parents.

source: The optional ``m`` parameter was added.
fr: Ajout du paramètre optionnel ``m``.

source: Property returning a new :class:`ChainMap` containing all of the maps in the current instance except the first one. This is useful for skipping the first map in the search. Use cases are similar to those for the :keyword:`nonlocal` keyword used in :term:`nested scopes <nested scope>`. The use cases also parallel those for the built-in :func:`super` function. A reference to ``d.parents`` is equivalent to: ``ChainMap(*d.maps[1:])``.
fr: Propriété qui renvoie un nouvel objet :class:`ChainMap` contenant tous les dictionnaires de l'instance actuelle hormis le premier. Cette propriété est utile pour ignorer le premier dictionnaire dans les recherches ; son utilisation rappelle le mot-clé :keyword:`nonlocal` (utilisé pour les :term:`portées imbriquées <nested scope>`), ou bien la fonction native :func:`super`. Une référence à ``d.parents`` est équivalente à : ``ChainMap(*d.maps[1:])``.

source: Note, the iteration order of a :class:`ChainMap()` is determined by scanning the mappings last to first::
fr: Notez que l'itération de :class:`ChainMap()` se fait en parcourant les tableaux de correspondances du dernier jusqu'au premier ::

source: This gives the same ordering as a series of :meth:`dict.update` calls starting with the last mapping::
fr: Cela produit le même ordre qu'une suite d'appels à :meth:`dict.update` en commençant par le dernier tableau de correspondances ::

source: The `MultiContext class <https://github.com/enthought/codetools/blob/4.0.0/codetools/contexts/multi_context.py>`_ in the Enthought `CodeTools package <https://github.com/enthought/codetools>`_ has options to support writing to any mapping in the chain.
fr: La `classe MultiContext <https://github.com/enthought/codetools/blob/4.0.0/codetools/contexts/multi_context.py>`_ dans le `package CodeTools <https://github.com/enthought/codetools>`_ d'Enthought possède des options pour gérer l'écriture dans n'importe quel dictionnaire de la chaîne.

source: Django's `Context class <https://github.com/django/django/blob/master/django/template/context.py>`_ for templating is a read-only chain of mappings. It also features pushing and popping of contexts similar to the :meth:`~collections.ChainMap.new_child` method and the :attr:`~collections.ChainMap.parents` property.
fr: La `classe de contexte de Django <https://github.com/django/django/blob/master/django/template/context.py>`_ pour la création de modèles est une chaîne de dictionnaires en lecture seule. Elle comporte également des fonctionnalités d'ajouts et de retraits de contextes similaires à la méthode :meth:`~collections.ChainMap.new_child` et à la propriété :attr:`~collections.ChainMap.parents`.

source: The `Nested Contexts recipe <https://code.activestate.com/recipes/577434/>`_ has options to control whether writes and other mutations apply only to the first mapping or to any mapping in the chain.
fr: `Le Cas pratique des contextes imbriqués <https://code.activestate.com/recipes/577434/>`_ a des options pour contrôler si les écritures et autres mutations ne s'appliquent qu'au premier ou à un autre dictionnaire de la chaîne.

source: A `greatly simplified read-only version of Chainmap <https://code.activestate.com/recipes/305268/>`_.
fr: Une `version grandement simplifiée de Chainmap en lecture seule <https://code.activestate.com/recipes/305268/>`_.

source: :class:`ChainMap` Examples and Recipes
fr: Exemples et cas pratiques utilisant :class:`ChainMap`

source: This section shows various approaches to working with chained maps.
fr: Cette partie montre diverses approches afin de travailler avec les dictionnaires chaînés.

source: Example of simulating Python's internal lookup chain::
fr: Exemple 1 : simulation de la chaîne de recherche interne de Python : ::

source: Example of letting user specified command-line arguments take precedence over environment variables which in turn take precedence over default values::
fr: Exemple 2 : spécification d'une hiérarchie pour les options : ligne de commande, variable d'environnement, valeurs par défaut : ::

source: Example patterns for using the :class:`ChainMap` class to simulate nested contexts::
fr: Exemple 3 : modèles pour simuler des contexte imbriqués avec la classe :class:`ChainMap` ::

source: The :class:`ChainMap` class only makes updates (writes and deletions) to the first mapping in the chain while lookups will search the full chain. However, if deep writes and deletions are desired, it is easy to make a subclass that updates keys found deeper in the chain::
fr: La classe :class:`ChainMap` ne met à jour (écriture et suppression) que le premier dictionnaire de la chaîne, alors qu'une recherche inspecte toute la chaîne. Cependant, si l'on veut effectuer des écritures ou suppressions en profondeur, on peut facilement faire une sous-classe qui met à jour les clés trouvées de la chaîne en profondeur : ::

source: :class:`Counter` objects
fr: Objets :class:`Counter`

source: A counter tool is provided to support convenient and rapid tallies. For example::
fr: Ce module fournit un outil pour effectuer rapidement et facilement des dénombrements. Par exemple : ::

source: A :class:`Counter` is a :class:`dict` subclass for counting hashable objects. It is a collection where elements are stored as dictionary keys and their counts are stored as dictionary values. Counts are allowed to be any integer value including zero or negative counts. The :class:`Counter` class is similar to bags or multisets in other languages.
fr: La classe :class:`Counter` est une sous-classe de :class:`dict` qui permet le dénombrement d'objets hachables. Il s'agit d'une collection dans laquelle les éléments sont stockés comme des clés de dictionnaire et leurs nombres d’occurrences respectifs comme leurs valeurs. Ceux-ci peuvent être des entiers relatifs (positifs, négatifs ou nuls). La classe :class:`Counter` est similaire aux sacs ou aux multiensembles dans d'autres langages.

source: Elements are counted from an *iterable* or initialized from another *mapping* (or counter):
fr: Les éléments sont comptés à partir d'un itérable ou initialisés à partir d'un autre dictionnaire (ou compteur) :

source: Counter objects have a dictionary interface except that they return a zero count for missing items instead of raising a :exc:`KeyError`:
fr: Les objets Counter ont une interface de dictionnaire, à l'exception près qu'ils renvoient zéro au lieu de lever une exception :exc:`KeyError` pour des éléments manquants :

source: Setting a count to zero does not remove an element from a counter. Use ``del`` to remove it entirely:
fr: Mettre un comptage à zéro pour un élément ne le retire pas de l'objet Counter. Il faut utiliser ``del`` pour le supprimer complètement :

source: Counter objects support three methods beyond those available for all dictionaries:
fr: En plus des méthodes disponibles pour tous les dictionnaires, les objets compteurs gèrent trois méthodes supplémentaires :

source: Return an iterator over elements repeating each as many times as its count. Elements are returned in arbitrary order. If an element's count is less than one, :meth:`elements` will ignore it.
fr: Renvoie un itérateur sur chaque élément en le répétant autant de fois que la valeur du compteur associé. Les éléments sont renvoyés dans un ordre arbitraire. Si le comptage d'un élément est strictement inférieur à 1, alors :meth:`elements` l'ignore.

source: Return a list of the *n* most common elements and their counts from the most common to the least. If *n* is omitted or ``None``, :meth:`most_common` returns *all* elements in the counter. Elements with equal counts are ordered arbitrarily:
fr: Renvoie une liste des *n* éléments les plus nombreux et leur valeur respective dans l'ordre décroissant. Si *n* n'est pas fourni ou vaut ``None``, :meth:`most_common` renvoie *tous* les éléments du compteur. Les éléments qui ont le même nombre d'occurrences sont ordonnés de manière arbitraire :

source: Elements are subtracted from an *iterable* or from another *mapping* (or counter). Like :meth:`dict.update` but subtracts counts instead of replacing them. Both inputs and outputs may be zero or negative.
fr: Les éléments sont soustraits à partir d'un itérable ou d'un autre dictionnaire (ou compteur). Cette méthode se comporte comme :meth:`dict.update` mais soustrait les nombres d'occurrences au lieu de les remplacer. Les entrées et sorties peuvent être négatives ou nulles.

source: The usual dictionary methods are available for :class:`Counter` objects except for two which work differently for counters.
fr: Les méthodes usuelles des dictionnaires sont disponibles pour les objets :class:`Counter` à l'exception de deux méthodes qui fonctionnent différemment pour les compteurs.

source: This class method is not implemented for :class:`Counter` objects.
fr: Cette méthode de classe n'est pas implémentée pour les objets :class:`Counter`.

source: Elements are counted from an *iterable* or added-in from another *mapping* (or counter). Like :meth:`dict.update` but adds counts instead of replacing them. Also, the *iterable* is expected to be a sequence of elements, not a sequence of ``(key, value)`` pairs.
fr: Les éléments sont comptés à partir d'un itérable ou ajoutés d'un autre dictionnaire (ou compteur). Cette méthode se comporte comme :meth:`dict.update` mais additionne les nombres d'occurrences au lieu de les remplacer. De plus, l'itérable doit être une séquence d'éléments et non une séquence de paires ``(clé, valeur)``.

source: Common patterns for working with :class:`Counter` objects::
fr: Opérations usuelles sur les objets :class:`Counter` : ::

source: Several mathematical operations are provided for combining :class:`Counter` objects to produce multisets (counters that have counts greater than zero). Addition and subtraction combine counters by adding or subtracting the counts of corresponding elements. Intersection and union return the minimum and maximum of corresponding counts. Each operation can accept inputs with signed counts, but the output will exclude results with counts of zero or less.
fr: Quelques opérations mathématiques sont fournies pour combiner des objets :class:`Counter` afin de créer des multiensembles (des compteurs dont les dénombrements des éléments sont strictement supérieurs à zéro). Les additions et soustractions combinent les compteurs en ajoutant ou retranchant les nombres d'occurrences des éléments correspondants. Les intersections et unions renvoient les minimums et maximums des comptages correspondants. Chaque opération peut accepter des entrées avec des comptages relatifs, mais la sortie exclut les résultats avec des comptages négatifs ou nuls.

source: Unary addition and subtraction are shortcuts for adding an empty counter or subtracting from an empty counter.
fr: L'addition et la soustraction unaires (avec un seul terme) sont des raccourcis pour respectivement additionner un compteur avec un compteur vide ou et pour retrancher un compteur d'un compteur vide.

source: Added support for unary plus, unary minus, and in-place multiset operations.
fr: Ajout de la gestion des additions et soustractions unaires, et des remplacements dans les multiensembles.

source: Counters were primarily designed to work with positive integers to represent running counts; however, care was taken to not unnecessarily preclude use cases needing other types or negative values. To help with those use cases, this section documents the minimum range and type restrictions.
fr: Les compteurs ont été conçus essentiellement pour fonctionner avec des entiers naturels pour représenter les dénombrements en cours ; cependant, les cas d'utilisation nécessitant d'autres types ou des valeurs négatives n'ont pas été écartés. Pour vous aider dans ces cas particuliers, cette section documente la plage minimale et les restrictions de type.

source: The :class:`Counter` class itself is a dictionary subclass with no restrictions on its keys and values. The values are intended to be numbers representing counts, but you *could* store anything in the value field.
fr: La classe :class:`Counter` est elle-même une sous-classe de dictionnaire sans restriction particulière sur ces clés ou valeurs. Les valeurs ont vocation à être des nombres représentants des comptages, mais il est *possible* de stocker n'importe quel type de valeur.

source: The :meth:`~Counter.most_common` method requires only that the values be orderable.
fr: La méthode :meth:`~Counter.most_common` exige uniquement que les valeurs soient ordonnables.

source: For in-place operations such as ``c[key] += 1``, the value type need only support addition and subtraction. So fractions, floats, and decimals would work and negative values are supported. The same is also true for :meth:`~Counter.update` and :meth:`~Counter.subtract` which allow negative and zero values for both inputs and outputs.
fr: Les opérations de remplacement telles que ``c[key] += 1`` exigent une valeur dont le type gère l'addition et la soustraction. Cela inclut donc les fractions, les flottants et les décimaux, y compris négatifs. Il en va de même pour :meth:`~Counter.update` et :meth:`~Cointer.substract` qui acceptent des valeurs négatives ou nulles dans les entrées et sorties.

source: The multiset methods are designed only for use cases with positive values. The inputs may be negative or zero, but only outputs with positive values are created. There are no type restrictions, but the value type needs to support addition, subtraction, and comparison.
fr: Les méthodes de multiensembles sont uniquement conçues pour les cas d'utilisation avec des valeurs positives. Les entrées peuvent contenir des valeurs négatives ou nulles, mais seules les sorties avec des valeurs positives sont créées. Il n'y a pas de restriction de type, mais les types des valeurs doivent gérer l'addition, la soustraction et la comparaison.

source: The :meth:`~Counter.elements` method requires integer counts. It ignores zero and negative counts.
fr: La méthode :meth:`~Counter.elements` exige des valeurs entières et ignore les valeurs négatives ou nulles.

source: `Bag class <https://www.gnu.org/software/smalltalk/manual-base/html_node/Bag.html>`_ in Smalltalk.
fr: `Bag class <https://www.gnu.org/software/smalltalk/manual-base/html_node/Bag.html>`_ dans Smalltalk.

source: Wikipedia entry for `Multisets <https://en.wikipedia.org/wiki/Multiset>`_.
fr: L'article Wikipédia sur les `multiensembles <https://fr.wikipedia.org/wiki/Multiensemble>`_ sur Wikipédia (ou `l'article en anglais <https://en.wikipedia.org/wiki/Multiset>`_).

source: `C++ multisets <http://www.java2s.com/Tutorial/Cpp/0380__set-multiset/Catalog0380__set-multiset.htm>`_ tutorial with examples.
fr: Des guides et exemples à propos des `multiensembles en C++ <http://www.java2s.com/Tutorial/Cpp/0380__set-multiset/Catalog0380__set-multiset.htm>`_.

source: For mathematical operations on multisets and their use cases, see *Knuth, Donald. The Art of Computer Programming Volume II, Section 4.6.3, Exercise 19*.
fr: Pour les opérations mathématiques sur les multiensembles et leurs applications, voir *Knuth, Donald. The Art of Computer Programming Volume II, Section 4.6.3, Exercise 19*.

source: To enumerate all distinct multisets of a given size over a given set of elements, see :func:`itertools.combinations_with_replacement`::
fr: Pour lister tous les multiensembles distincts de même taille parmi un ensemble donné d'éléments, voir :func:`itertools.combinations_with_replacement` : ::

source: :class:`deque` objects
fr: Objets :class:`deque`

source: Returns a new deque object initialized left-to-right (using :meth:`append`) with data from *iterable*. If *iterable* is not specified, the new deque is empty.
fr: Renvoie un nouvel objet *deque* initialisé de gauche à droite (en utilisant :meth:`append`) avec les données d'*iterable*. Si *iterable* n'est pas spécifié, alors la nouvelle *deque* est vide.

source: Deques are a generalization of stacks and queues (the name is pronounced "deck" and is short for "double-ended queue"). Deques support thread-safe, memory efficient appends and pops from either side of the deque with approximately the same O(1) performance in either direction.
fr: Les *deques* sont une généralisation des piles et des files (*deque* se prononce "*dèque*" et est l'abréviation de l'anglais *double-ended queue*) : il est possible d'ajouter et retirer des éléments par les deux bouts des *deques*. Celles-ci gèrent des ajouts et des retraits utilisables par de multiples fils d'exécution (*thread-safe*) et efficients du point de vue de la mémoire des deux côtés de la *deque*, avec approximativement la même performance en *O(1)* dans les deux sens.
