Repository: python/python-docs-fr
Catalog: library/collections.po
Languages: fr

source: Though :class:`list` objects support similar operations, they are optimized for fast fixed-length operations and incur O(n) memory movement costs for ``pop(0)`` and ``insert(0, v)`` operations which change both the size and position of the underlying data representation.
fr: Bien que les les objets :class:`list` gèrent des opérations similaires, ils sont optimisés pour des opérations qui ne changent pas la taille de la liste. Les opérations ``pop(0)`` et ``insert(0, v)`` qui changent la taille et la position de la représentation des données sous-jacentes entraînent des coûts de déplacement de mémoire en *O(n)*.

source: If *maxlen* is not specified or is ``None``, deques may grow to an arbitrary length. Otherwise, the deque is bounded to the specified maximum length. Once a bounded length deque is full, when new items are added, a corresponding number of items are discarded from the opposite end. Bounded length deques provide functionality similar to the ``tail`` filter in Unix. They are also useful for tracking transactions and other pools of data where only the most recent activity is of interest.
fr: Si *maxlen* n'est pas spécifié ou vaut *None*, les *deques* peuvent atteindre une taille arbitraire. Sinon, la *deque* est limitée par cette taille maximale. Une fois que celle-ci est atteinte, un ajout d'un ou plusieurs éléments engendre la suppression du nombre correspondant d'éléments à l'autre extrémité de la *deque*. Les *deques* à longueur limitée apportent des fonctionnalités similaire au filtre ``tail`` d'Unix. Elles sont aussi utiles pour le suivi de transactions et autres lots de données où seule l'activité récente est intéressante.

source: Deque objects support the following methods:
fr: Les objets *deques* gèrent les méthodes suivantes :

source: Add *x* to the right side of the deque.
fr: Ajoute *x* à l'extrémité droite de la *deque*.

source: Add *x* to the left side of the deque.
fr: Ajoute *x* à l'extrémité gauche de la *deque*.

source: Remove all elements from the deque leaving it with length 0.
fr: Supprime tous les éléments de la *deque* et la laisse avec une longueur de 0.

source: Create a shallow copy of the deque.
fr: Crée une copie superficielle de la *deque*.

source: Count the number of deque elements equal to *x*.
fr: Compte le nombre d'éléments de la *deque* égaux à *x*.

source: Extend the right side of the deque by appending elements from the iterable argument.
fr: Étend la *deque* en ajoutant les éléments de l'itérable en argument à son extrémité droite.

source: Extend the left side of the deque by appending elements from *iterable*. Note, the series of left appends results in reversing the order of elements in the iterable argument.
fr: Étend la *deque* en ajoutant les éléments d'*iterable* à son extrémité gauche. Dans ce cas, notez que la série d'ajouts inverse l'ordre des éléments de l'argument itérable.

source: Return the position of *x* in the deque (at or after index *start* and before index *stop*). Returns the first match or raises :exc:`ValueError` if not found.
fr: Renvoie la position de *x* dans la *deque* (à partir de *start* inclus et jusqu'à *stop* exclus). Renvoie la première correspondance ou lève :exc:`ValueError` si aucune n'est trouvée.

source: Insert *x* into the deque at position *i*.
fr: Insère *x* dans la *deque* à la position *i*.

source: If the insertion would cause a bounded deque to grow beyond *maxlen*, an :exc:`IndexError` is raised.
fr: Si une insertion provoque un dépassement de la taille limitée d'une *deque*, alors elle lève une exception :exc:`IndexError`.

source: Remove and return an element from the right side of the deque. If no elements are present, raises an :exc:`IndexError`.
fr: Retire et renvoie un élément de l'extrémité droite de la *deque*. S'il n'y a aucun élément, lève une exception :exc:`IndexError`.

source: Remove and return an element from the left side of the deque. If no elements are present, raises an :exc:`IndexError`.
fr: Retire et renvoie un élément de l'extrémité gauche de la *deque*. S'il n'y a aucun élément, lève une exception :exc:`IndexError`.

source: Remove the first occurrence of *value*. If not found, raises a :exc:`ValueError`.
fr: Supprime la première occurrence de *value*. Si aucune occurrence n'est trouvée, lève une exception :exc:`ValueError`.

source: Reverse the elements of the deque in-place and then return ``None``.
fr: Inverse le sens des éléments de la *deque* sans créer de copie et renvoie ``None``.

source: Rotate the deque *n* steps to the right. If *n* is negative, rotate to the left.
fr: Décale les éléments de la *deque* de *n* places vers la droite (le dernier élément revient au début). Si *n* est négatif, décale vers la gauche.

source: When the deque is not empty, rotating one step to the right is equivalent to ``d.appendleft(d.pop())``, and rotating one step to the left is equivalent to ``d.append(d.popleft())``.
fr: Quand la *deque* n'est pas vide, un décalage d'une place vers la droite équivaut à ``d.appendleft(d.pop())`` et un décalage d'une place vers la gauche est équivalent à ``d.append(d.popleft())``.

source: Deque objects also provide one read-only attribute:
fr: Les objets *deques* fournissent également un attribut en lecture seule :

source: Maximum size of a deque or ``None`` if unbounded.
fr: La taille maximale d'une *deque*, ou ``None`` si illimitée.

source: In addition to the above, deques support iteration, pickling, ``len(d)``, ``reversed(d)``, ``copy.copy(d)``, ``copy.deepcopy(d)``, membership testing with the :keyword:`in` operator, and subscript references such as ``d[-1]``. Indexed access is O(1) at both ends but slows to O(n) in the middle. For fast random access, use lists instead.
fr: En plus des méthodes précédentes, les *deques* gèrent l'itération, la sérialisation, ``len(d)``, ``reversed(d)``, ``copy.copy(d)``, ``copy.deepcopy(d)``, le test d'appartenance avec l'opérateur :keyword:`in`, et les références en indice comme ``d[-1]``. L'accès par indice est en *O(1)* aux extrémités mais en *O(n)* au milieu. Pour des accès aléatoires rapides, il est préférable d'utiliser des listes.

source: Starting in version 3.5, deques support ``__add__()``, ``__mul__()``, and ``__imul__()``.
fr: Depuis la version 3.5, les *deques* gèrent ``__add__()``, ``__mul__()`` et ``__imul__()``.

source: Example:
fr: Exemple :

source: :class:`deque` Recipes
fr: Cas pratiques utilisant :class:`deque`

source: This section shows various approaches to working with deques.
fr: Cette partie montre diverses approches afin de travailler avec les *deques*.

source: Bounded length deques provide functionality similar to the ``tail`` filter in Unix::
fr: Les *deques* à taille limitée apportent une fonctionnalité similaire au filtre ``tail`` d'Unix : ::

source: Another approach to using deques is to maintain a sequence of recently added elements by appending to the right and popping to the left::
fr: Une autre approche d'utilisation des *deques* est de maintenir une séquence d'éléments récemment ajoutés en les ajoutant à droite et en retirant les anciens par la gauche : ::

source: A `round-robin scheduler <https://en.wikipedia.org/wiki/Round-robin_scheduling>`_ can be implemented with input iterators stored in a :class:`deque`. Values are yielded from the active iterator in position zero. If that iterator is exhausted, it can be removed with :meth:`~deque.popleft`; otherwise, it can be cycled back to the end with the :meth:`~deque.rotate` method::
fr: Un `ordonnancement en round-robin <https://fr.wikipedia.org/wiki/Round-robin_(informatique)>`_ peut être implémenté avec des entrées itérateurs stockées dans une :class:`deque`. Les valeurs sont produites par l'itérateur actif en position zéro. Si cet itérateur est épuisé, il peut être retiré avec la méthode :meth:`~deque.popleft` ; ou bien il peut être remis à la fin avec la méthode :meth:`~ deque.rotate` : ::

source: The :meth:`~deque.rotate` method provides a way to implement :class:`deque` slicing and deletion. For example, a pure Python implementation of ``del d[n]`` relies on the ``rotate()`` method to position elements to be popped::
fr: La méthode :meth:`~deque.rotate` apporte une façon d'implémenter la sélection d'intervalle (*slicing*) et les suppressions pour les :class:`deques`. Par exemple, une implémentation de ``del d[n]`` en Python pur utilise la méthode ``rotate()`` pour mettre en position les éléments à éjecter : ::

source: To implement :class:`deque` slicing, use a similar approach applying :meth:`~deque.rotate` to bring a target element to the left side of the deque. Remove old entries with :meth:`~deque.popleft`, add new entries with :meth:`~deque.extend`, and then reverse the rotation. With minor variations on that approach, it is easy to implement Forth style stack manipulations such as ``dup``, ``drop``, ``swap``, ``over``, ``pick``, ``rot``, and ``roll``.
fr: Pour implémenter le *slicing* pour les :class:`deques <deque>`, il est possible d'utiliser une approche similaire en appliquant :meth:`~deque.rotate` afin d'apporter un élément cible à l'extrémité gauche de la *deque*. On éjecte les anciennes entrées avec :meth:`~deque.popleft` et on ajoute les nouvelles avec :meth:`~deque.extend`, puis on inverse la rotation. Il est aisé d'implémenter les manipulations des piles inspirées du Forth telles que ``dup``, ``drop``, ``swap``, ``over``, ``pick``, ``rot`` et ``roll``.

source: :class:`defaultdict` objects
fr: Objets :class:`defaultdict`

source: Returns a new dictionary-like object. :class:`defaultdict` is a subclass of the built-in :class:`dict` class. It overrides one method and adds one writable instance variable. The remaining functionality is the same as for the :class:`dict` class and is not documented here.
fr: Renvoie un nouvel objet qui se comporte comme un dictionnaire. :class:`defaultdict` est une sous-classe de la la classe native :class:`dict`. Elle surcharge une méthode et ajoute une variable d'instance modifiable. Les autres fonctionnalités sont les mêmes que celles des objets :class:`dict` et ne sont pas documentées ici.

source: The first argument provides the initial value for the :attr:`default_factory` attribute; it defaults to ``None``. All remaining arguments are treated the same as if they were passed to the :class:`dict` constructor, including keyword arguments.
fr: Le premier argument fournit la valeur initiale de l'attribut :attr:`default_factory` qui doit être un objet appelable sans paramètre ou ``None``, sa valeur par défaut. Tous les autres arguments sont traités comme si on les passait au constructeur de :class:`dict`, y compris les arguments nommés.

source: :class:`defaultdict` objects support the following method in addition to the standard :class:`dict` operations:
fr: En plus des opérations usuelles de :class:`dict`, les objets :class:`defaultdict` gèrent les méthodes supplémentaires suivantes :

source: If the :attr:`default_factory` attribute is ``None``, this raises a :exc:`KeyError` exception with the *key* as argument.
fr: Si l'attribut :attr:`default_factory` est ``None``, lève une exception :exc:`KeyError` avec *key* comme argument.

source: If :attr:`default_factory` is not ``None``, it is called without arguments to provide a default value for the given *key*, this value is inserted in the dictionary for the *key*, and returned.
fr: Si :attr:`default_fatory`` ne vaut pas ``None``, cet attribut est appelé sans argument pour fournir une valeur par défaut pour la *key* demandée. Cette valeur est insérée dans le dictionnaire avec pour clé *key* et est renvoyée.

source: If calling :attr:`default_factory` raises an exception this exception is propagated unchanged.
fr: Si appeler :attr:`default_factory` lève une exception, celle-ci est transmise inchangée.

source: This method is called by the :meth:`__getitem__` method of the :class:`dict` class when the requested key is not found; whatever it returns or raises is then returned or raised by :meth:`__getitem__`.
fr: Cette méthode est appelée par la méthode :meth:`__getitem__` de la classe :class:`dict` lorsque la clé demandée n'est pas trouvée. Ce qu'elle renvoie ou lève est alors renvoyé ou levé par :meth:`__getitem__`.

source: Note that :meth:`__missing__` is *not* called for any operations besides :meth:`__getitem__`. This means that :meth:`get` will, like normal dictionaries, return ``None`` as a default rather than using :attr:`default_factory`.
fr: Remarquez que :meth:`__missing__` n'est *pas* appelée pour les opérations autres que :meth:`__getitem__`. Cela signifie que :meth:`get` renvoie ``None`` comme les dictionnaires natifs dans les cas triviaux et n'utilise pas :attr:`default_factory`.

source: :class:`defaultdict` objects support the following instance variable:
fr: Les objets :class:`defaultdict` gèrent la variable d'instance :

source: This attribute is used by the :meth:`__missing__` method; it is initialized from the first argument to the constructor, if present, or to ``None``, if absent.
fr: Cet attribut est utilisé par la méthode :meth:`__missing__` ; il est initialisé par le premier argument passé au constructeur, s'il est spécifié, sinon par ``None``.

source: :class:`defaultdict` Examples
fr: Exemples utilisant :class:`defaultdict`

source: Using :class:`list` as the :attr:`~defaultdict.default_factory`, it is easy to group a sequence of key-value pairs into a dictionary of lists:
fr: Utiliser :class:`list` comme :attr:`~defaultdict.default_factory` facilite le regroupement d'une séquence de paires clé-valeur en un dictionnaire de listes :

source: When each key is encountered for the first time, it is not already in the mapping; so an entry is automatically created using the :attr:`~defaultdict.default_factory` function which returns an empty :class:`list`. The :meth:`list.append` operation then attaches the value to the new list. When keys are encountered again, the look-up proceeds normally (returning the list for that key) and the :meth:`list.append` operation adds another value to the list. This technique is simpler and faster than an equivalent technique using :meth:`dict.setdefault`:
fr: Lorsque chaque clé est rencontrée pour la première fois, elle n'est pas encore présente dans le dictionnaire, donc une entrée est automatiquement créée grâce à la fonction :attr:`~defaultdict.default_factory` qui renvoie un objet :class:`list` vide. L'opération :meth:`list.append` ajoute la valeur à la nouvelle liste. Quand les clés sont à nouveau rencontrées, la recherche se déroule correctement (elle renvoie la liste de cette clé) et l'opération :meth:`list.append` ajoute une autre valeur à la liste. Cette technique est plus simple et plus rapide qu'une technique équivalente utilisant :meth:`dict.setdefault` :

source: Setting the :attr:`~defaultdict.default_factory` to :class:`int` makes the :class:`defaultdict` useful for counting (like a bag or multiset in other languages):
fr: Utiliser :class:`int` comme :attr:`~defaultdict.default_factory` rend la classe :class:`defaultdict` pratique pour le comptage (comme un sac ou multi-ensemble dans d'autres langages) :

source: When a letter is first encountered, it is missing from the mapping, so the :attr:`~defaultdict.default_factory` function calls :func:`int` to supply a default count of zero. The increment operation then builds up the count for each letter.
fr: Quand une lettre est rencontrée pour la première fois, elle n'est pas dans le dictionnaire, donc la fonction :attr:`~defaultdict.default_factory` appelle :func:`int` pour mettre un nouveau compteur à zéro. L'incrémentation augmente ensuite le comptage pour chaque lettre.

source: The function :func:`int` which always returns zero is just a special case of constant functions. A faster and more flexible way to create constant functions is to use a lambda function which can supply any constant value (not just zero):
fr: La fonction :func:`int` qui retourne toujours zéro est simplement une fonction constante particulière. Un moyen plus flexible et rapide de créer une fonction constante est d'utiliser une fonction lambda qui peut fournir n'importe quelle valeur constante (pas seulement zéro) :

source: Setting the :attr:`~defaultdict.default_factory` to :class:`set` makes the :class:`defaultdict` useful for building a dictionary of sets:
fr: Utiliser :class:`set` comme :attr:`~defaultdict.default_factory` rend la classe :class:`defaultdict` pratique pour créer un dictionnaire d'ensembles :

source: :func:`namedtuple` Factory Function for Tuples with Named Fields
fr: :func:`namedtuple`: fonction de construction pour *n-uplets* (*tuples*) avec des champs nommés

source: Named tuples assign meaning to each position in a tuple and allow for more readable, self-documenting code. They can be used wherever regular tuples are used, and they add the ability to access fields by name instead of position index.
fr: Les tuples nommés assignent une signification à chacun de leur élément, ce qui rend le code plus lisible et explicite. Ils peuvent être utilisés partout où les tuples natifs sont utilisés, et ils ajoutent la possibilité d'accéder à leurs champs grâce à leur nom au lieu de leur index de position.

source: Returns a new tuple subclass named *typename*. The new subclass is used to create tuple-like objects that have fields accessible by attribute lookup as well as being indexable and iterable. Instances of the subclass also have a helpful docstring (with typename and field_names) and a helpful :meth:`__repr__` method which lists the tuple contents in a ``name=value`` format.
fr: Renvoie une nouvelle sous-classe de ``tuple`` appelée *typename*. Elle est utilisée pour créer des objets se comportant comme les *tuples* qui ont des champs accessibles par recherche d'attribut en plus d'être indexables et itérables. Les instances de cette sous-classe possèdent aussi une *docstring* explicite (avec *type_name* et les *field_names*) et une méthode :meth:`__repr__` pratique qui liste le contenu du tuple au format ``nom=valeur``.

source: The *field_names* are a sequence of strings such as ``['x', 'y']``. Alternatively, *field_names* can be a single string with each fieldname separated by whitespace and/or commas, for example ``'x y'`` or ``'x, y'``.
fr: *field_names* peut être une séquence de chaînes de caractères telle que ``['x', 'y']`` ou bien une unique chaîne de caractères où les noms de champs sont séparés par un espace et/ou une virgule, par exemple ``'x y'`` ou ``'x, y'``.

source: Any valid Python identifier may be used for a fieldname except for names starting with an underscore. Valid identifiers consist of letters, digits, and underscores but do not start with a digit or underscore and cannot be a :mod:`keyword` such as *class*, *for*, *return*, *global*, *pass*, or *raise*.
fr: N'importe quel identifiant Python peut être utilisé pour un nom de champ hormis ceux commençant par un tiret bas. Les identifiants valides peuvent contenir des lettres, des chiffres (sauf en première position) et des tirets bas (sauf en première position). Un identifiant ne peut pas être un :mod:`keyword` tel que ``class``, ``for``, ``return``, ``global``, ``pass`` ou ``raise``.

source: If *rename* is true, invalid fieldnames are automatically replaced with positional names. For example, ``['abc', 'def', 'ghi', 'abc']`` is converted to ``['abc', '_1', 'ghi', '_3']``, eliminating the keyword ``def`` and the duplicate fieldname ``abc``.
fr: Si *rename* vaut ``True``, alors les noms de champs invalides sont automatiquement renommés en noms positionnels. Par exemple, ``['abc', 'def', 'ghi', 'abc']`` est converti en ``['abc, '_1', 'ghi', '_3']`` afin d'éliminer le mot-clé ``def`` et le doublon de ``abc``.

source: *defaults* can be ``None`` or an :term:`iterable` of default values. Since fields with a default value must come after any fields without a default, the *defaults* are applied to the rightmost parameters. For example, if the fieldnames are ``['x', 'y', 'z']`` and the defaults are ``(1, 2)``, then ``x`` will be a required argument, ``y`` will default to ``1``, and ``z`` will default to ``2``.
fr: *defaults* peut être ``None`` ou un :term:`iterable` de valeurs par défaut. Comme les champs avec une valeur par défaut doivent être définis après les champs sans valeur par défaut, les *defaults* sont appliqués aux paramètres les plus à droite. Par exemple, si les noms des champs sont ``['x', 'y', 'z']`` et les valeurs par défaut ``(1, 2)``, alors ``x`` est un argument obligatoire tandis que ``y`` et ``y`` valent par défaut ``1`` et ``2``.

source: If *module* is defined, the ``__module__`` attribute of the named tuple is set to that value.
fr: Si *module* est spécifié, alors il est assigné à l'attribut ``__module__`` du tuple nommé.

source: Named tuple instances do not have per-instance dictionaries, so they are lightweight and require no more memory than regular tuples.
fr: Les instances de tuples nommés n'ont pas de dictionnaires propres, elles sont donc légères et ne requièrent pas plus de mémoire que les tuples natifs.

source: Added support for *rename*.
fr: Gestion de *rename*.

source: The *verbose* and *rename* parameters became :ref:`keyword-only arguments <keyword-only_parameter>`.
fr: Les paramètres *verbose* et *rename* deviennent des :ref:`arguments obligatoirement nommés <keyword-only_parameter>`.

source: Added the *module* parameter.
fr: Ajout du paramètre *module*.

source: Remove the *verbose* parameter and the :attr:`_source` attribute.
fr: Suppression du paramètre *verbose* et de l'attribut :attr:`_source`.

source: Added the *defaults* parameter and the :attr:`_field_defaults` attribute.
fr: Ajout du paramètre *defaults* et de l'attribut :attr:`_field_defaults`.

source: Named tuples are especially useful for assigning field names to result tuples returned by the :mod:`csv` or :mod:`sqlite3` modules::
fr: Les tuples nommés sont particulièrement utiles pour associer des noms de champs à des tuples renvoyés par les modules :mod:`csv` ou :mod:`sqlite3` : ::

source: In addition to the methods inherited from tuples, named tuples support three additional methods and two attributes. To prevent conflicts with field names, the method and attribute names start with an underscore.
fr: En plus des méthodes héritées de ``tuple``, les tuples nommés implémentent trois méthodes et deux attributs supplémentaires. Pour éviter les conflits avec noms de champs, leurs noms commencent par un tiret bas.

source: Class method that makes a new instance from an existing sequence or iterable.
fr: Méthode de classe qui construit une nouvelle instance à partir d'une séquence ou d'un itérable existant.

source: Return a new :class:`dict` which maps field names to their corresponding values:
fr: Renvoie un nouveau :class:`dict` qui associe chaque nom de champ à sa valeur correspondante :

source: Returns an :class:`OrderedDict` instead of a regular :class:`dict`.
fr: Renvoie un :class:`OrderedDict` au lieu d'un :class:`dict` natif.

source: Return a new instance of the named tuple replacing specified fields with new values::
fr: Renvoie une nouvelle instance du tuple nommé en remplaçant les champs spécifiés par leurs nouvelles valeurs : ::

source: Tuple of strings listing the field names. Useful for introspection and for creating new named tuple types from existing named tuples.
fr: Tuple de chaînes de caractères listant les noms de champs. Pratique pour l'introspection et pour créer de nouveaux types de tuples nommés à partir d'existants.

source: Dictionary mapping field names to default values.
fr: Dictionnaire qui assigne les valeurs par défaut aux noms des champs.

source: To retrieve a field whose name is stored in a string, use the :func:`getattr` function:
fr: Pour récupérer un champ dont le nom est une chaîne de caractères, utilisez la fonction :func:`getattr` :
