Repository: python/python-docs-fr
Catalog: library/colorsys.po
Languages: fr

source: :mod:`colorsys` --- Conversions between color systems
fr: :mod:`colorsys` --- Conversions entre les systèmes de couleurs

source: **Source code:** :source:`Lib/colorsys.py`
fr: **Code source :** :source:`Lib/colorsys.py`

source: The :mod:`colorsys` module defines bidirectional conversions of color values between colors expressed in the RGB (Red Green Blue) color space used in computer monitors and three other coordinate systems: YIQ, HLS (Hue Lightness Saturation) and HSV (Hue Saturation Value). Coordinates in all of these color spaces are floating point values. In the YIQ space, the Y coordinate is between 0 and 1, but the I and Q coordinates can be positive or negative. In all other spaces, the coordinates are all between 0 and 1.
fr: Le module :mod:`colorsys` définit les conversions bidirectionnelles des valeurs de couleur entre les couleurs exprimées dans l'espace colorimétrique RVB (Rouge Vert Bleu) utilisé par les écrans d'ordinateur et trois autres systèmes de coordonnées : YIQ, HLS (Hue Lightness Saturation) et HSV (Hue Saturation Value). Les coordonnées dans tous ces espaces colorimétriques sont des valeurs en virgule flottante. Dans l'espace YIQ, la coordonnée Y est comprise entre 0 et 1, mais les coordonnées I et Q peuvent être positives ou négatives. Dans tous les autres espaces, les coordonnées sont toutes comprises entre 0 et 1.

source: More information about color spaces can be found at http://www.poynton.com/ColorFAQ.html and https://www.cambridgeincolour.com/tutorials/color-spaces.htm.
fr: Consultez http://www.poynton.com/ColorFAQ.html et https://www.cambridgeincolour.com/tutorials/color-spaces.htm pour plus d'informations concernant les espaces colorimétrique.

source: The :mod:`colorsys` module defines the following functions:
fr: Le module :mod:`colorsys` définit les fonctions suivantes :

source: Convert the color from RGB coordinates to YIQ coordinates.
fr: Convertit la couleur des coordonnées RGB (RVB) vers les coordonnées YIQ.

source: Convert the color from YIQ coordinates to RGB coordinates.
fr: Convertit la couleur des coordonnées YIQ vers les coordonnées RGB (RVB).

source: Convert the color from RGB coordinates to HLS coordinates.
fr: Convertit la couleur des coordonnées RGB (RVB) vers les coordonnées HLS (TSV).

source: Convert the color from HLS coordinates to RGB coordinates.
fr: Convertit la couleur des coordonnées HLS (TSV) vers les coordonnées RGB (RVB).

source: Convert the color from RGB coordinates to HSV coordinates.
fr: Convertit la couleur des coordonnées RGB (RVB) vers les coordonnées HSV (TSV).

source: Convert the color from HSV coordinates to RGB coordinates.
fr: Convertit la couleur des coordonnées HSV (TSV) vers les coordonnées RGB (RVB).

source: Example::
fr: Exemple ::
