Repository: python/python-docs-fr
Catalog: library/compileall.po
Languages: fr

source: :mod:`compileall` --- Byte-compile Python libraries
fr: :mod:`compileall` — Génération du code intermédiaire des bibliothèques Python

source: **Source code:** :source:`Lib/compileall.py`
fr: **Code source :** :source:`Lib/compileall.py`

source: This module provides some utility functions to support installing Python libraries. These functions compile Python source files in a directory tree. This module can be used to create the cached byte-code files at library installation time, which makes them available for use even by users who don't have write permission to the library directories.
fr: Ce module contient des fonctions qui facilitent l'installation de bibliothèques Python. Elles compilent, sous forme de code intermédiaire (*bytecode*), les fichiers source situés dans un dossier de votre choix. Ce module est particulièrement utile pour générer les fichiers de code intermédiaire lors de l'installation d'une bibliothèque, les rendant disponibles même pour les utilisateurs qui n'ont pas les privilèges d'écriture dans l'emplacement d'installation.

source: Command-line use
fr: Utilisation en ligne de commande

source: This module can work as a script (using :program:`python -m compileall`) to compile Python sources.
fr: On peut se servir de ce module comme d'un script (avec :program:`python -m compileall`) pour compiler les fichiers source Python.

source: Positional arguments are files to compile or directories that contain source files, traversed recursively. If no argument is given, behave as if the command line was ``-l <directories from sys.path>``.
fr: Les arguments positionnels sont les fichiers à compiler. Ils peuvent aussi être des dossiers, qui sont alors parcourus récursivement pour compiler tous les fichiers de code :file:`.py` qu'ils contiennent. Lorsque le script ne reçoit aucun argument, il fait comme s'il avait été appelé avec `-l <tous les dossiers de sys.path>`.

source: Do not recurse into subdirectories, only compile source code files directly contained in the named or implied directories.
fr: Compiler uniquement les fichiers situés directement dans les dossiers passés en argument ou implicites, sans descendre récursivement dans les sous-dossiers.

source: Force rebuild even if timestamps are up-to-date.
fr: Forcer la recompilation même si les horodatages sont à jour.

source: Do not print the list of files compiled. If passed once, error messages will still be printed. If passed twice (``-qq``), all output is suppressed.
fr: Supprimer l'affichage des noms des fichiers compilés.Si cette option est donnée une seule fois, les erreurs sont affichées malgré tout. Vous pouvez les supprimer en passant l'option deux fois (c'est-à-dire avec ``-qq``).

source: Directory prepended to the path to each file being compiled. This will appear in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
fr: Ce nom de dossier est ajouté en tête du chemin de chaque fichier compilé. Il aura une influence sur les traces d'appels pour les erreurs levées lors de la compilation, et sera reflété dans les fichiers de code intermédiaire, pour utilisation dans les traces d'appels et autres messages si le fichier source n'existe pas au moment de l'exécution.

source: Remove (``-s``) or append (``-p``) the given prefix of paths recorded in the ``.pyc`` files. Cannot be combined with ``-d``.
fr: Retire (``-s``) ou ajoute (``-p``) le préfixe aux chemins stockés dans les fichiers ``.pyc``. Cette option ne peut pas être combinée avec ``-d``.

source: regex is used to search the full path to each file considered for compilation, and if the regex produces a match, the file is skipped.
fr: Exclut tous les fichiers dont les noms correspondent à l'expression régulière *regex*.

source: Read the file ``list`` and add each line that it contains to the list of files and directories to compile. If ``list`` is ``-``, read lines from ``stdin``.
fr: Ajoute chaque ligne du fichier *list* aux fichiers et dossiers à compiler. *list* peut être ``-``, auquel cas le script lit l'entrée standard.

source: Write the byte-code files to their legacy locations and names, which may overwrite byte-code files created by another version of Python. The default is to write files to their :pep:`3147` locations and names, which allows byte-code files from multiple versions of Python to coexist.
fr: Utilise l'ancienne manière de nommer et placer les fichiers de code intermédiaire, en écrasant éventuellement ceux générés par une autre version de Python. Par défaut, les règles décrites dans la :pep:`3147` s'appliquent. Elles permettent à différentes versions de l'interpréteur Python de coexister en conservant chacune ses propres fichiers ``.pyc``.

source: Control the maximum recursion level for subdirectories. If this is given, then ``-l`` option will not be taken into account. :program:`python -m compileall <directory> -r 0` is equivalent to :program:`python -m compileall <directory> -l`.
fr: Règle le niveau de récursion maximal pour le parcours des sous-dossiers. Lorsque cette option est fournie, ``-l`` est ignorée. :program:`python -m compileall <dossier> -r 0` revient au même que :program:`python -m compileall <dossier> -l`.

source: Use *N* workers to compile the files within the given directory. If ``0`` is used, then the result of :func:`os.cpu_count()` will be used.
fr: Effectue la compilation avec *N* processus parallèles. Si *N* vaut 0, autant de processus sont créés que la machine dispose de processeurs (résultat de :func:`os.cpu_count()`).

source: Control how the generated byte-code files are invalidated at runtime. The ``timestamp`` value, means that ``.pyc`` files with the source timestamp and size embedded will be generated. The ``checked-hash`` and ``unchecked-hash`` values cause hash-based pycs to be generated. Hash-based pycs embed a hash of the source file contents rather than a timestamp. See :ref:`pyc-invalidation` for more information on how Python validates bytecode cache files at runtime. The default is ``timestamp`` if the :envvar:`SOURCE_DATE_EPOCH` environment variable is not set, and ``checked-hash`` if the ``SOURCE_DATE_EPOCH`` environment variable is set.
fr: Définit la manière dont les fichiers de code intermédiaire seront invalidés au moment de l'exécution. Avec ``timestamp``, les fichiers ``.pyc`` générés comportent l'horodatage de la source et sa taille. Avec ``checked-hash`` ou ``unchecked-hash``, ce seront des pyc utilisant le hachage, qui contiennent une empreinte du code source plutôt qu'un horodatage. Voir :ref:`pyc-invalidation` pour plus d'informations sur la manière dont Python valide les fichiers de code intermédiaire conservés en cache lors de l'exécution. La valeur par défaut est ``timestamp``. Cependant, si la variable d'environnement :envvar:`SOURCE_DATE_EPOCH` a été réglée, elle devient ``checked-hash``.

source: Compile with the given optimization level. May be used multiple times to compile for multiple levels at a time (for example, ``compileall -o 1 -o 2``).
fr: Compile avec un certain niveau d'optimisation. Cette option peut être passée plusieurs fois afin de compiler pour plusieurs niveaux d'un seul coup (par exemple, ``compileall -o 1 -o 2``).

source: Ignore symlinks pointing outside the given directory.
fr: Ignore les liens symboliques qui redirigent en dehors du dossier.

source: If two ``.pyc`` files with different optimization level have the same content, use hard links to consolidate duplicate files.
fr: Si deux fichiers ``.pyc`` compilés avec des niveaux d'optimisation différents ont finalement le même contenu, emploie des liens physiques pour les fusionner.

source: Added the ``-i``, ``-b`` and ``-h`` options.
fr: ajout des options ``-i``, ``-b`` et ``-h``.

source: Added the ``-j``, ``-r``, and ``-qq`` options. ``-q`` option was changed to a multilevel value. ``-b`` will always produce a byte-code file ending in ``.pyc``, never ``.pyo``.
fr: ajout des options ``-j``, ``-r`` et ``-qq`` (l'option ``-q`` peut donc prendre plusieurs niveaux). ``-b`` produit toujours un fichier de code intermédiaire portant l'extension ``.pyc``, et jamais ``.pyo``.

source: Added the ``--invalidation-mode`` option.
fr: ajout de l'option ``--invalidation-mode``.

source: Added the ``-s``, ``-p``, ``-e`` and ``--hardlink-dupes`` options. Raised the default recursion limit from 10 to :py:func:`sys.getrecursionlimit()`. Added the possibility to specify the ``-o`` option multiple times.
fr: ajout des options ``-s``, ``-p``, ``-e`` et ``--hardlink-dupes``. Rehaussement de la limite de récursion par défaut à :py:func:`sys.getrecursionlimit()` au lieu de 10 précédemment. L'option ``-o`` peut être passée plusieurs fois.

source: There is no command-line option to control the optimization level used by the :func:`compile` function, because the Python interpreter itself already provides the option: :program:`python -O -m compileall`.
fr: Il n'y a pas d'option en ligne de commande pour contrôler le niveau d'optimisation utilisé par la fonction :func:`compile`. Il suffit en effet d'utiliser l'option ``-O`` de l'interpréteur Python lui-même : :program:`python -O -m compileall`.

source: Similarly, the :func:`compile` function respects the :attr:`sys.pycache_prefix` setting. The generated bytecode cache will only be useful if :func:`compile` is run with the same :attr:`sys.pycache_prefix` (if any) that will be used at runtime.
fr: De même, la fonction :func:`compile` utilise le réglage :attr:`sys.pycache_prefix`. Le code intermédiaire généré ne pourra servir que dans la mesure où :func:`compile` est exécutée avec la même valeur de :attr:`sys.pycache_prefix` (si tant est qu'elle soit définie) que celle en vigueur au moment d'exécuter le programme.

source: Public functions
fr: Fonctions publiques

source: Recursively descend the directory tree named by *dir*, compiling all :file:`.py` files along the way. Return a true value if all the files compiled successfully, and a false value otherwise.
fr: Parcourt récursivement le dossier *dir*, en compilant tous les fichiers :file:`.py`. Renvoie une valeur vraie si tous les fichiers ont été compilés sans erreur, et une valeur fausse dans le cas contraire.

source: The *maxlevels* parameter is used to limit the depth of the recursion; it defaults to ``sys.getrecursionlimit()``.
fr: Le paramètre *maxlevels* permet de limiter la profondeur de récursion. Sa valeur par défaut est celle de ``sys.getrecursionlimit()``.

source: If *ddir* is given, it is prepended to the path to each file being compiled for use in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
fr: Si *ddir* est fourni, il est ajouté en tête du chemin de chaque fichier compilé, ce qui modifie l'affichage des traces d'appels pour les erreurs qui seraient levées lors de la compilation. De plus, il se retrouve dans les fichiers de code intermédiaire, pour utilisation dans les traces et autres messages si le fichier source n'existe pas au moment de l'exécution.

source: If *force* is true, modules are re-compiled even if the timestamps are up to date.
fr: Si *force* est vrai, les modules sont recompilés même si leurs horodatages sont à jour.

source: If *rx* is given, its ``search`` method is called on the complete path to each file considered for compilation, and if it returns a true value, the file is skipped. This can be used to exclude files matching a regular expression, given as a :ref:`re.Pattern <re-objects>` object.
fr: Si *rx* est donné, sa méthode ``search`` est appelée sur le chemin complet de chaque fichier source, et si elle renvoie une valeur vraie, le fichier est sauté. *rx* sera habituellement une expression régulière (objet :ref:`re.Pattern <re-objects>`).

source: If *quiet* is ``False`` or ``0`` (the default), the filenames and other information are printed to standard out. Set to ``1``, only errors are printed. Set to ``2``, all output is suppressed.
fr: Si *quiet* est ``False`` ou bien ``0`` (la valeur par défaut), les noms de fichiers et d'autres informations sont affichés sur la sortie standard. Avec ``1``, seules les erreurs sont affichées. Avec ``2``, aucune sortie n'est émise.

source: If *legacy* is true, byte-code files are written to their legacy locations and names, which may overwrite byte-code files created by another version of Python. The default is to write files to their :pep:`3147` locations and names, which allows byte-code files from multiple versions of Python to coexist.
fr: Si *legacy* est vrai, les fichiers de code intermédiaire sont nommés et placés selon l'ancienne méthode, en écrasant éventuellement ceux générés par une autre version de Python. Par défaut, les règles décrites dans la :pep:`3147` s'appliquent. Elles permettent à différentes versions de l'interpréteur Python de coexister en conservant chacune ses propres fichiers ``.pyc``.

source: *optimize* specifies the optimization level for the compiler. It is passed to the built-in :func:`compile` function. Accepts also a sequence of optimization levels which lead to multiple compilations of one :file:`.py` file in one call.
fr: *optimize* définit le niveau d'optimisation qu'applique le compilateur. Cet argument est passé directement à la fonction native :func:`compile`. Il peut également être fourni sous la forme d'une séquence de niveaux d'optimisation, ce qui permet de compiler chaque fichier :file:`.py` plusieurs fois en appliquant divers niveaux d'optimisation.

source: The argument *workers* specifies how many workers are used to compile files in parallel. The default is to not use multiple workers. If the platform can't use multiple workers and *workers* argument is given, then sequential compilation will be used as a fallback. If *workers* is 0, the number of cores in the system is used. If *workers* is lower than ``0``, a :exc:`ValueError` will be raised.
fr: *workers* est le nombre de tâches lancées en parallèle pour la compilation. Par défaut, les fichiers sont compilés séquentiellement. Cette même stratégie s'applique dans tous les cas lorsque le parallélisme n'est pas possible sur la plateforme d'exécution. Si *workers* vaut 0, autant de tâches sont lancées que le système comporte de cœurs. Si *workers* est strictement négatif, une exception de type :exc:`ValueError` est levée.

source: *invalidation_mode* should be a member of the :class:`py_compile.PycInvalidationMode` enum and controls how the generated pycs are invalidated at runtime.
fr: *invalidation_mode* doit être un membre de l'énumération :class:`py_compile.PycInvalidationMode` et détermine la manière dont les fichiers :file:`.pyc` sont invalidés lorsque l'interpréteur tente de les utiliser.

source: The *stripdir*, *prependdir* and *limit_sl_dest* arguments correspond to the ``-s``, ``-p`` and ``-e`` options described above. They may be specified as ``str``, ``bytes`` or :py:class:`os.PathLike`.
fr: Les arguments *stripdir*, *prependdir* et *limit_sl_dest* correspondent aux options ``-s``, ``-p`` et ``-e`` décrites plus haut. Ils peuvent être de type ``str``, ``bytes`` ou :py:class:`os.PathLike`.

source: If *hardlink_dupes* is true and two ``.pyc`` files with different optimization level have the same content, use hard links to consolidate duplicate files.
fr: Un argument *hardlink_dupes* vrai correspond à l'utilisation de l'option ``--hardlink-dupes``.

source: Added the *legacy* and *optimize* parameter.
fr: ajout des paramètres *legacy* et *optimize*.

source: Added the *workers* parameter.
fr: ajout du paramètre *workers*.

source: *quiet* parameter was changed to a multilevel value.
fr: le paramètre *quiet* peut prendre plusieurs niveaux.

source: The *legacy* parameter only writes out ``.pyc`` files, not ``.pyo`` files no matter what the value of *optimize* is.
fr: Lorsque le paramètre *legacy* est vrai, des fichiers ``.pyc``, et jamais ``.pyo``, sont générés, quel que soit le niveau d'optimisation.

source: Accepts a :term:`path-like object`.
fr: accepte un :term:`objet simili-chemin <path-like object>`.

source: The *invalidation_mode* parameter was added.
fr: ajout du paramètre *invalidation_mode*.

source: The *invalidation_mode* parameter's default value is updated to None.
fr: La valeur par défaut du paramètre *invalidation_mode* est changée à ``None``.

source: Setting *workers* to 0 now chooses the optimal number of cores.
fr: Un nombre de processus adapté à la machine est choisi lorsque *workers* vaut 0.

source: Added *stripdir*, *prependdir*, *limit_sl_dest* and *hardlink_dupes* arguments. Default value of *maxlevels* was changed from ``10`` to ``sys.getrecursionlimit()``
fr: ajout des arguments *stripdir*, *prependdir*, *limit_sl_dest* et *hardlink_dupes*. La valeur par défaut de *maxlevels* a été changée pour ``sys.getrecursionlimit()`` (elle était de 10 auparavant).

source: Compile the file with path *fullname*. Return a true value if the file compiled successfully, and a false value otherwise.
fr: Compile le fichier dont le chemin est donné par *fullname*. Renvoie une valeur vraie si et seulement si le fichier est compilé sans erreur.

source: If *ddir* is given, it is prepended to the path to the file being compiled for use in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
fr: Si *ddir* est fourni, il est ajouté en tête du chemin de chaque fichier compilé, ce qui modifie l'affichage des traces pour les erreurs qui seraient levées lors de la compilation. De plus, il se retrouve dans les fichiers de code intermédiaire, pour utilisation dans les traces et autres messages si le fichier source n'existe pas au moment de l'exécution.

source: If *rx* is given, its ``search`` method is passed the full path name to the file being compiled, and if it returns a true value, the file is not compiled and ``True`` is returned. This can be used to exclude files matching a regular expression, given as a :ref:`re.Pattern <re-objects>` object.
fr: Si *rx* est donné, sa méthode ``search`` est appelée sur le chemin complet de chaque fichier source, et si elle renvoie une valeur vraie, le fichier est sauté. *rx* sera habituellement une expression régulière (objet :ref:`re.Pattern <re-objects>`).

source: Added *stripdir*, *prependdir*, *limit_sl_dest* and *hardlink_dupes* arguments.
fr: Ajout des arguments *stripdir*, *prependdir*, *limit_sl_dest* et *hardlink_dupes*.

source: Byte-compile all the :file:`.py` files found along ``sys.path``. Return a true value if all the files compiled successfully, and a false value otherwise.
fr: Compile tous les fichiers :file:`.py` contenus dans les dossiers de ``sys.path``. Renvoie une valeur vraie s'ils ont tous été compilés sans erreur, et une valeur fausse dans le cas contraire.

source: If *skip_curdir* is true (the default), the current directory is not included in the search. All other parameters are passed to the :func:`compile_dir` function. Note that unlike the other compile functions, ``maxlevels`` defaults to ``0``.
fr: Si *skip_curdir* est vrai (c'est le cas par défaut), le dossier courant est exclu de la recherche. Les autres paramètres sont passés à :func:`compile_dir`. Notez que contrairement aux autres fonctions de ce module, la valeur par défaut de ``maxlevels`` est ``0``.

source: To force a recompile of all the :file:`.py` files in the :file:`Lib/` subdirectory and all its subdirectories::
fr: Pour forcer la recompilation de tous les fichiers :file:`.py` dans le dossier :file:`Lib/` et tous ses sous-dossiers ::

source: Byte-compile a single source file.
fr: Compiler un fichier source unique.
