Repository: python/python-docs-fr
Catalog: library/constants.po
Languages: fr

source: Built-in Constants
fr: Constantes natives

source: A small number of constants live in the built-in namespace. They are:
fr: Un petit nombre de constantes existent dans le *namespace* natif. Elles sont :

source: The false value of the :class:`bool` type. Assignments to ``False`` are illegal and raise a :exc:`SyntaxError`.
fr: La valeur fausse du type :class:`bool`. Les assignations à ``False`` ne sont pas autorisées et lèvent une :exc:`SyntaxError`.

source: The true value of the :class:`bool` type. Assignments to ``True`` are illegal and raise a :exc:`SyntaxError`.
fr: La valeur vraie du type :class:`bool`. Les assignations à ``True`` ne sont pas autorisées et lèvent une :exc:`SyntaxError`.

source: An object frequently used to represent the absence of a value, as when default arguments are not passed to a function. Assignments to ``None`` are illegal and raise a :exc:`SyntaxError`. ``None`` is the sole instance of the :data:`NoneType` type.
fr: Objet utilisé fréquemment pour représenter l'absence de valeur, comme lorsque des arguments par défaut ne sont pas passés à une fonction. Les assignations à ``None`` ne sont pas autorisées et lèvent une :exc:`SyntaxError`. ``None`` est la seule instance du type :data:`NoneType`.

source: A special value which should be returned by the binary special methods (e.g. :meth:`__eq__`, :meth:`__lt__`, :meth:`__add__`, :meth:`__rsub__`, etc.) to indicate that the operation is not implemented with respect to the other type; may be returned by the in-place binary special methods (e.g. :meth:`__imul__`, :meth:`__iand__`, etc.) for the same purpose. It should not be evaluated in a boolean context. ``NotImplemented`` is the sole instance of the :data:`types.NotImplementedType` type.
fr: Valeur spéciale qui devrait être renvoyée par les méthodes magiques à deux opérandes (comme :meth:`__eq__`, :meth:`__lt__`, :meth:`__add__`, :meth:`__rsub__`, etc.) pour indiquer que l'opération n'est pas implémentée pour l'autre type ; peut être renvoyée par les méthodes magiques augmentées à deux opérandes (comme :meth:`__imul__`, :meth:`__iand__`, etc.) avec le même objectif. Elle ne doit pas être évaluée comme booléen. ``NotImplemented`` est la seule instance de :data:`types.NotImplementedType`.

source: When a binary (or in-place) method returns ``NotImplemented`` the interpreter will try the reflected operation on the other type (or some other fallback, depending on the operator). If all attempts return ``NotImplemented``, the interpreter will raise an appropriate exception. Incorrectly returning ``NotImplemented`` will result in a misleading error message or the ``NotImplemented`` value being returned to Python code.
fr: Lorsqu'une méthode à deux opérandes renvoie ``NotImplemented``, l'interpréteur essaye d'exécuter l'opération réfléchie sur l'autre type (il existe d'autres mécanismes de *fallback*, en fonction de l'opérateur). Si toutes les tentatives renvoient ``NotImplemented``, l'interpréteur lève une exception appropriée. Renvoyer ``NotImplemented`` à tort donne lieu à un message d'erreur peu clair ou au renvoi de la valeur ``NotImplemented`` pour le code Python.

source: See :ref:`implementing-the-arithmetic-operations` for examples.
fr: Voir :ref:`implementing-the-arithmetic-operations` pour des exemples.

source: ``NotImplementedError`` and ``NotImplemented`` are not interchangeable, even though they have similar names and purposes. See :exc:`NotImplementedError` for details on when to use it.
fr: ``NotImplementedError`` et ``NotImplemented`` ne sont pas interchangeables, même s'ils ont un nom et un objectif similaire. Voir :exc:`NotImplementedError` pour savoir quand l'utiliser.

source: Evaluating ``NotImplemented`` in a boolean context is deprecated. While it currently evaluates as true, it will emit a :exc:`DeprecationWarning`. It will raise a :exc:`TypeError` in a future version of Python.
fr: évaluer ``NotImplemented`` dans un contexte booléen est obsolète. Python l'évalue aujourd'hui à ``True`` mais émet un :exc:`DeprecationWarning`. Il lèvera une :exc:`TypeError` dans une version ultérieure de Python.

source: The same as the ellipsis literal "``...``". Special value used mostly in conjunction with extended slicing syntax for user-defined container data types. ``Ellipsis`` is the sole instance of the :data:`types.EllipsisType` type.
fr: Identique au littéral *points de suspension* ("``...``"). Valeur spéciale utilisée principalement de manière conjointe avec la syntaxe de découpage (*slicing*) étendu pour les conteneurs personnalisés. ``Ellipsis`` est la seule instance de :data:`types.EllipsisType`.

source: This constant is true if Python was not started with an :option:`-O` option. See also the :keyword:`assert` statement.
fr: Cette constante est vraie si Python n'a pas été démarré avec une option :option:`-O`. Voir aussi l'expression :keyword:`assert`.

source: The names :data:`None`, :data:`False`, :data:`True` and :data:`__debug__` cannot be reassigned (assignments to them, even as an attribute name, raise :exc:`SyntaxError`), so they can be considered "true" constants.
fr: Les noms :data:`None`, :data:`False`, :data:`True` et :data:`__debug__` ne peuvent pas être réassignés (des assignations à ces noms, ou aux noms de leurs attributs, lèvent une :exc:`SyntaxError`), donc ils peuvent être considérés comme des "vraies" constantes.

source: Constants added by the :mod:`site` module
fr: Constantes ajoutées par le module :mod:`site`

source: The :mod:`site` module (which is imported automatically during startup, except if the :option:`-S` command-line option is given) adds several constants to the built-in namespace. They are useful for the interactive interpreter shell and should not be used in programs.
fr: Le module :mod:`site` (qui est importé automatiquement au démarrage, sauf si l'option de ligne de commande :option:`-S` est donnée ajoute un certain nombre de constantes au *namespace* natif. Elles sont utiles pour l'interpréteur interactif et ne devraient pas être utilisées par des programmes.

source: Objects that when printed, print a message like "Use quit() or Ctrl-D (i.e. EOF) to exit", and when called, raise :exc:`SystemExit` with the specified exit code.
fr: Objets qui, lorsqu'ils sont représentés, affichent un message comme *"Use quit() or Ctrl-D (i.e. EOF) to exit"*, et lorsqu'ils sont appelés, lèvent un :exc:`SystemExit` avec le code de retour spécifié.

source: Objects that when printed or called, print the text of copyright or credits, respectively.
fr: Objets qui, lorsqu'ils sont affichés ou appelés, affichent le copyright ou les crédits, respectivement.

source: Object that when printed, prints the message "Type license() to see the full license text", and when called, displays the full license text in a pager-like fashion (one screen at a time).
fr: Objet qui, lorsqu'il est affiché, affiche un message comme *"Type license() to see the full license text"*, et lorsqu'il est appelé, affiche le texte complet de la licence dans un style paginé (un écran à la fois).
