Repository: python/python-docs-fr
Catalog: library/contextlib.po
Languages: fr

source: :mod:`!contextlib` --- Utilities for :keyword:`!with`\ -statement contexts
fr: :mod:`!contextlib` — Utilitaires pour les contextes s'appuyant sur l'instruction :keyword:`!with`

source: **Source code:** :source:`Lib/contextlib.py`
fr: **Code source :** :source:`Lib/contextlib.py`

source: This module provides utilities for common tasks involving the :keyword:`with` statement. For more information see also :ref:`typecontextmanager` and :ref:`context-managers`.
fr: Ce module fournit des utilitaires pour les tâches impliquant le mot-clé :keyword:`with`. Pour plus d'informations voir aussi :ref:`typecontextmanager` et :ref:`context-managers`.

source: Utilities
fr: Utilitaires

source: Functions and classes provided:
fr: Fonctions et classes fournies :

source: An :term:`abstract base class` for classes that implement :meth:`object.__enter__` and :meth:`object.__exit__`. A default implementation for :meth:`object.__enter__` is provided which returns ``self`` while :meth:`object.__exit__` is an abstract method which by default returns ``None``. See also the definition of :ref:`typecontextmanager`.
fr: :term:`Classe mère abstraite <abstract base class>` pour les classes qui implémentent les méthodes :meth:`object.__enter__` et :meth:`object.__exit__`. Une implémentation par défaut de :meth:`object.__enter__` est fournie, qui renvoie ``self``, et :meth:`object.__exit__` est une méthode abstraite qui renvoie ``None`` par défaut. Voir aussi la définition de :ref:`typecontextmanager`.

source: An :term:`abstract base class` for classes that implement :meth:`object.__aenter__` and :meth:`object.__aexit__`. A default implementation for :meth:`object.__aenter__` is provided which returns ``self`` while :meth:`object.__aexit__` is an abstract method which by default returns ``None``. See also the definition of :ref:`async-context-managers`.
fr: :term:`Classe mère abstraite <abstract base class>` pour les classes qui implémentent les méthodes :meth:`object.__aenter__` et :meth:`object.__aexit__`. Une implémentation par défaut de :meth:`object.__aenter__` est fournie, qui renvoie ``self``, et :meth:`object.__aexit__` est une méthode abstraite qui renvoie ``None`` par défaut. Voir aussi la définition de :ref:`async-context-managers`.

source: This function is a :term:`decorator` that can be used to define a factory function for :keyword:`with` statement context managers, without needing to create a class or separate :meth:`__enter__` and :meth:`__exit__` methods.
fr: Cette fonction est un :term:`decorator` qui peut être utilisé pour définir une fonction fabriquant des gestionnaires de contexte à utiliser avec :keyword:`with`, sans nécessiter de créer une classe ou des méthodes :meth:`__enter__` et :meth:`__exit__` séparées.

source: While many objects natively support use in with statements, sometimes a resource needs to be managed that isn't a context manager in its own right, and doesn't implement a ``close()`` method for use with ``contextlib.closing``
fr: Alors que de nombreux objets s'utilisent nativement dans des blocs *with*, on trouve parfois des ressources qui nécessitent d'être gérées mais ne sont pas des gestionnaires de contextes, et qui n'implémentent pas de méthode ``close()`` pour pouvoir être utilisées avec ``contextlib.closing``

source: An abstract example would be the following to ensure correct resource management::
fr: L'exemple abstrait suivant présente comment assurer une gestion correcte des ressources ::

source: At the point where the generator yields, the block nested in the :keyword:`with` statement is executed. The generator is then resumed after the block is exited. If an unhandled exception occurs in the block, it is reraised inside the generator at the point where the yield occurred. Thus, you can use a :keyword:`try`...\ :keyword:`except`...\ :keyword:`finally` statement to trap the error (if any), or ensure that some cleanup takes place. If an exception is trapped merely in order to log it or to perform some action (rather than to suppress it entirely), the generator must reraise that exception. Otherwise the generator context manager will indicate to the :keyword:`!with` statement that the exception has been handled, and execution will resume with the statement immediately following the :keyword:`!with` statement.
fr: Au moment où le générateur produit une valeur, le bloc imbriqué sous l'instruction :keyword:`with` est exécuté. Le générateur est ensuite repris après la sortie du bloc. Si une exception non gérée survient dans le bloc, elle est relayée dans le générateur au niveau de l'instruction *yield*. Ainsi, vous pouvez utiliser les instructions :keyword:`try`…\ :keyword:`except`…\ :keyword:`finally` pour attraper l'erreur (s'il y a), ou vous assurer qu'un nettoyage a bien lieu. Si une exception est attrapée dans l'unique but d'être journalisée ou d'effectuer une action particulière (autre que supprimer entièrement l'exception), le générateur se doit de la relayer. Autrement le générateur gestionnaire de contexte doit indiquer à l'instruction :keyword:`!with` que l'exception a été gérée, et l'exécution reprend sur l'instruction qui suit directement le bloc :keyword:`!with`.

source: :func:`contextmanager` uses :class:`ContextDecorator` so the context managers it creates can be used as decorators as well as in :keyword:`with` statements. When used as a decorator, a new generator instance is implicitly created on each function call (this allows the otherwise "one-shot" context managers created by :func:`contextmanager` to meet the requirement that context managers support multiple invocations in order to be used as decorators).
fr: Le décorateur :func:`contextmanager` utilise la classe :class:`ContextDecorator` afin que les gestionnaires de contexte qu'il crée puissent être utilisés aussi bien en tant que décorateurs qu'avec des instructions :keyword:`with`. Quand vous l'utilisez comme décorateur, une nouvelle instance du générateur est créée à chaque appel de la fonction (cela permet aux gestionnaires de contexte à usage unique créés par :func:`contextmanager` de remplir la condition de pouvoir être invoqués plusieurs fois afin d'être utilisés comme décorateurs).

source: Use of :class:`ContextDecorator`.
fr: Utilisation de la classe :class:`ContextDecorator`.

source: Similar to :func:`~contextlib.contextmanager`, but creates an :ref:`asynchronous context manager <async-context-managers>`.
fr: Similaire à :func:`~contextlib.contextmanager`, mais crée un :ref:`gestionnaire de contexte asynchrone <async-context-managers>`.

source: This function is a :term:`decorator` that can be used to define a factory function for :keyword:`async with` statement asynchronous context managers, without needing to create a class or separate :meth:`__aenter__` and :meth:`__aexit__` methods. It must be applied to an :term:`asynchronous generator` function.
fr: Cette fonction est un :term:`decorator` qui peut être utilisé pour définir une fonction fabriquant des gestionnaires de contexte asynchrones à utiliser avec :keyword:`async with`, sans nécessiter de créer une classe ou des méthodes :meth:`__aenter__` et :meth:`__aexit__` séparées. Le décorateur doit être appliqué à une fonction renvoyant un :term:`asynchronous generator`.

source: A simple example::
fr: Un exemple simple ::

source: Return a context manager that closes *thing* upon completion of the block. This is basically equivalent to::
fr: Renvoie un gestionnaire de contexte qui ferme *thing* à la fin du bloc. C'est essentiellement équivalent à ::

source: And lets you write code like this::
fr: Et cela vous permet d'écrire du code tel que ::

source: without needing to explicitly close ``page``. Even if an error occurs, ``page.close()`` will be called when the :keyword:`with` block is exited.
fr: sans besoin de fermer explicitement ``page``. Même si une erreur survient, ``page.close()`` est appelée à la fermeture du bloc :keyword:`with`.

source: Return a context manager that returns *enter_result* from ``__enter__``, but otherwise does nothing. It is intended to be used as a stand-in for an optional context manager, for example::
fr: Renvoie un gestionnaire de contexte dont la méthode ``__enter__`` renvoie *enter_result*, mais ne fait rien d'autre. L'idée est de l'utiliser comme remplaçant pour un gestionnaire de contexte optionnel, par exemple ::

source: An example using *enter_result*::
fr: Un exemple utilisant *enter_result* ::

source: Return a context manager that suppresses any of the specified exceptions if they occur in the body of a with statement and then resumes execution with the first statement following the end of the with statement.
fr: Renvoie un gestionnaire de contexte qui supprime toutes les exceptions spécifiées si elles surviennent dans le corps du bloc *with*, et reprend l'exécution sur la première instruction qui suit la fin du bloc *with*.

source: As with any other mechanism that completely suppresses exceptions, this context manager should be used only to cover very specific errors where silently continuing with program execution is known to be the right thing to do.
fr: Comme pour tous les mécanismes qui suppriment complètement les exceptions, ce gestionnaire de contexte doit seulement être utilisé pour couvrir des cas très spécifiques d'erreurs où il est certain que continuer silencieusement l'exécution du programme est la bonne chose à faire.

source: For example::
fr: Par exemple ::

source: This code is equivalent to::
fr: Ce code est équivalent à ::

source: This context manager is :ref:`reentrant <reentrant-cms>`.
fr: Ce gestionnaire de contexte est :ref:`réentrant <reentrant-cms>`.

source: Context manager for temporarily redirecting :data:`sys.stdout` to another file or file-like object.
fr: Gestionnaire de contexte servant à rediriger temporairement :data:`sys.stdout` vers un autre fichier ou objet fichier-compatible.

source: This tool adds flexibility to existing functions or classes whose output is hardwired to stdout.
fr: Cet outil ajoute une certaine flexibilité aux fonctions ou classes existantes dont la sortie est envoyée vers la sortie standard.

source: For example, the output of :func:`help` normally is sent to *sys.stdout*. You can capture that output in a string by redirecting the output to an :class:`io.StringIO` object::
fr: Par exemple, la sortie de :func:`help` est normalement envoyée vers *sys.stdout*. Vous pouvez capturer cette sortie dans une chaîne de caractères en la redirigeant vers un objet :class:`io.StringIO` ::

source: To send the output of :func:`help` to a file on disk, redirect the output to a regular file::
fr: Pour envoyer la sortie de :func:`help` vers un fichier sur le disque, redirigez-la sur un fichier normal ::

source: To send the output of :func:`help` to *sys.stderr*::
fr: Pour envoyer la sortie de :func:`help` sur *sys.stderr* ::

source: Note that the global side effect on :data:`sys.stdout` means that this context manager is not suitable for use in library code and most threaded applications. It also has no effect on the output of subprocesses. However, it is still a useful approach for many utility scripts.
fr: Notez que l'effet de bord global sur :data:`sys.stdout` signifie que ce gestionnaire de contexte n'est pas adapté à une utilisation dans le code d'une bibliothèque ni dans la plupart des applications à plusieurs fils d'exécution. Aussi, cela n'a pas d'effet sur la sortie des sous-processus. Cependant, cela reste une approche utile pour beaucoup de scripts utilitaires.

source: Similar to :func:`~contextlib.redirect_stdout` but redirecting :data:`sys.stderr` to another file or file-like object.
fr: Similaire à :func:`~contextlib.redirect_stdout` mais redirige :data:`sys.stderr` vers un autre fichier ou objet fichier-compatible.

source: A base class that enables a context manager to also be used as a decorator.
fr: Une classe mère qui permet à un gestionnaire de contexte d'être aussi utilisé comme décorateur.

source: Context managers inheriting from ``ContextDecorator`` have to implement ``__enter__`` and ``__exit__`` as normal. ``__exit__`` retains its optional exception handling even when used as a decorator.
fr: Les gestionnaires de contexte héritant de ``ContextDecorator`` doivent implémenter ``__enter__`` et ``__exit__`` comme habituellement. ``__exit__`` conserve sa gestion optionnelle des exceptions même lors de l'utilisation en décorateur.

source: ``ContextDecorator`` is used by :func:`contextmanager`, so you get this functionality automatically.
fr: ``ContextDecorator`` est utilisé par :func:`contextmanager`, donc vous bénéficiez automatiquement de cette fonctionnalité.

source: Example of ``ContextDecorator``::
fr: Exemple de ``ContextDecorator`` ::

source: This change is just syntactic sugar for any construct of the following form::
fr: Ce changement est simplement un sucre syntaxique pour les constructions de la forme suivante ::

source: ``ContextDecorator`` lets you instead write::
fr: ``ContextDecorator`` vous permet d'écrire à la place ::

source: It makes it clear that the ``cm`` applies to the whole function, rather than just a piece of it (and saving an indentation level is nice, too).
fr: Cela éclaircit le fait que ``cm`` s'applique à la fonction entière, et pas seulement à un morceau en particulier (et gagner un niveau d'indentation est toujours appréciable).

source: Existing context managers that already have a base class can be extended by using ``ContextDecorator`` as a mixin class::
fr: Les gestionnaires de contexte existants qui ont déjà une classe mère peuvent être étendus en utilisant ``ContextDecorator`` comme une *mixin* ::

source: As the decorated function must be able to be called multiple times, the underlying context manager must support use in multiple :keyword:`with` statements. If this is not the case, then the original construct with the explicit :keyword:`!with` statement inside the function should be used.
fr: Comme la fonction décorée doit être capable d'être appelée plusieurs fois, le gestionnaire de contexte sous-jacent doit permettre d'être utilisé dans de multiples instructions :keyword:`with`. Si ce n'est pas le cas, alors la construction d'origine avec de multiples instructions :keyword:`!with` au sein de la fonction doit être utilisée.

source: A context manager that is designed to make it easy to programmatically combine other context managers and cleanup functions, especially those that are optional or otherwise driven by input data.
fr: Gestionnaire de contexte conçu pour simplifier le fait de combiner programmatiquement d'autres gestionnaires de contexte et fonctions de nettoyage, spécifiquement ceux qui sont optionnels ou pilotés par des données d'entrée.

source: For example, a set of files may easily be handled in a single with statement as follows::
fr: Par exemple, un ensemble de fichiers peut facilement être géré dans une unique instruction *with* comme suit ::

source: Each instance maintains a stack of registered callbacks that are called in reverse order when the instance is closed (either explicitly or implicitly at the end of a :keyword:`with` statement). Note that callbacks are *not* invoked implicitly when the context stack instance is garbage collected.
fr: Chaque instance maintient une pile de fonctions de rappels (*callbacks*) enregistrées qui sont appelées en ordre inverse quand l'instance est fermée (explicitement ou implicitement à la fin d'un bloc :keyword:`with`). Notez que ces fonctions ne sont *pas* invoquées implicitement quand l'instance de la pile de contextes est collectée par le ramasse-miettes.

source: This stack model is used so that context managers that acquire their resources in their ``__init__`` method (such as file objects) can be handled correctly.
fr: Ce modèle de pile est utilisé afin que les gestionnaires de contexte qui acquièrent leurs ressources dans leur méthode ``__init__`` (tels que les objets-fichiers) puissent être gérés correctement.

source: Since registered callbacks are invoked in the reverse order of registration, this ends up behaving as if multiple nested :keyword:`with` statements had been used with the registered set of callbacks. This even extends to exception handling - if an inner callback suppresses or replaces an exception, then outer callbacks will be passed arguments based on that updated state.
fr: Comme les fonctions de rappel enregistrées sont invoquées dans l'ordre inverse d'enregistrement, cela revient au même que si de multiples blocs :keyword:`with` imbriqués avaient été utilisés avec l'ensemble de fonctions enregistrées. Cela s'étend aussi à la gestion d'exceptions — si une fonction de rappel intérieure supprime ou remplace une exception, alors les fonctions extérieures reçoivent des arguments basés sur ce nouvel état.

source: This is a relatively low level API that takes care of the details of correctly unwinding the stack of exit callbacks. It provides a suitable foundation for higher level context managers that manipulate the exit stack in application specific ways.
fr: C'est une *API* relativement bas-niveau qui s'occupe de dérouler correctement la pile des appels de sortie. Elle fournit une base adaptée pour des gestionnaires de contexte de plus haut niveau qui manipulent la pile de sortie de manière spécifique à l'application.

source: Enters a new context manager and adds its :meth:`__exit__` method to the callback stack. The return value is the result of the context manager's own :meth:`__enter__` method.
fr: Entre dans un nouveau gestionnaire de contexte et ajoute sa méthode :meth:`__exit__` à la pile d'appels. La valeur de retour est le résultat de la méthode :meth:`__enter__` du gestionnaire de contexte donné.

source: These context managers may suppress exceptions just as they normally would if used directly as part of a :keyword:`with` statement.
fr: Ces gestionnaires de contexte peuvent supprimer des exceptions comme ils le feraient normalement s'ils étaient utilisés directement derrière une instruction :keyword:`with`.

source: Adds a context manager's :meth:`__exit__` method to the callback stack.
fr: Ajoute la méthode :meth:`__exit__` d'un gestionnaire de contexte à la pile d'appels.

source: As ``__enter__`` is *not* invoked, this method can be used to cover part of an :meth:`__enter__` implementation with a context manager's own :meth:`__exit__` method.
fr: Comme ``__enter__`` n'est *pas* invoquée, cette méthode peut être utilisée pour couvrir une partie de l'implémentation de :meth:`__enter__` avec la propre méthode :meth:`__exit__` d'un gestionnaire de contexte.

source: If passed an object that is not a context manager, this method assumes it is a callback with the same signature as a context manager's :meth:`__exit__` method and adds it directly to the callback stack.
fr: Si l'argument passé n'est pas un gestionnaire de contexte, la méthode assume qu'il s'agit d'une fonction de rappel avec la même signature que la méthode :meth:`__exit__` des gestionnaires de contexte pour l'ajouter directement à la pile d'appels.

source: By returning true values, these callbacks can suppress exceptions the same way context manager :meth:`__exit__` methods can.
fr: En retournant des valeurs vraies, ces fonctions peuvent supprimer des exceptions de la même manière que le peuvent les méthodes :meth:`__exit__` des gestionnaires de contexte.

source: The passed in object is returned from the function, allowing this method to be used as a function decorator.
fr: L'objet passé en paramètre est renvoyé par la fonction, ce qui permet à la méthode d'être utilisée comme décorateur de fonction.

source: Accepts an arbitrary callback function and arguments and adds it to the callback stack.
fr: Accepte une fonction arbitraire et ses arguments et les ajoute à la pile des fonctions de rappel.

source: Unlike the other methods, callbacks added this way cannot suppress exceptions (as they are never passed the exception details).
fr: À la différence des autres méthodes, les fonctions de rappel ajoutées de cette manière ne peuvent pas supprimer les exceptions (puisqu'elles ne reçoivent jamais les détails de l'exception).

source: The passed in callback is returned from the function, allowing this method to be used as a function decorator.
fr: La fonction passée en paramètre est renvoyée par la méthode, ce qui permet à la méthode d'être utilisée comme décorateur de fonction.

source: Transfers the callback stack to a fresh :class:`ExitStack` instance and returns it. No callbacks are invoked by this operation - instead, they will now be invoked when the new stack is closed (either explicitly or implicitly at the end of a :keyword:`with` statement).
fr: Transfère la pile d'appels à une nouvelle instance de :class:`ExitStack` et la renvoie. Aucune fonction de rappel n'est invoquée par cette opération — à la place, elles sont dorénavant invoquées quand la nouvelle pile sera close (soit explicitement soit implicitement à la fin d'un bloc :keyword:`with`).

source: For example, a group of files can be opened as an "all or nothing" operation as follows::
fr: Par exemple, un groupe de fichiers peut être ouvert comme une opération « tout ou rien » comme suit ::

source: Immediately unwinds the callback stack, invoking callbacks in the reverse order of registration. For any context managers and exit callbacks registered, the arguments passed in will indicate that no exception occurred.
fr: Déroule immédiatement la pile d'appels, invoquant les fonctions de rappel dans l'ordre inverse d'enregistrement. Pour chaque gestionnaire de contexte et fonction de sortie enregistré, les arguments passés indiqueront qu'aucune exception n'est survenue.

source: An :ref:`asynchronous context manager <async-context-managers>`, similar to :class:`ExitStack`, that supports combining both synchronous and asynchronous context managers, as well as having coroutines for cleanup logic.
fr: Un :ref:`gestionnaire de contexte asynchrone <async-context-managers>`, similaire à :class:`ExitStack`, apte à combiner à la fois des gestionnaires de contexte synchrones et asynchrones, ainsi que la gestion de coroutines pour la logique de nettoyage.

source: The :meth:`close` method is not implemented, :meth:`aclose` must be used instead.
fr: La méthode :meth:`close` n'est pas implémentée, :meth:`aclose` doit plutôt être utilisée.

source: Similar to :meth:`enter_context` but expects an asynchronous context manager.
fr: Similaire à :meth:`enter_context` mais attend un gestionnaire de contexte asynchrone.

source: Similar to :meth:`push` but expects either an asynchronous context manager or a coroutine function.
fr: Similaire à :meth:`push` mais attend soit un gestionnaire de contexte asynchrone soit une fonction coroutine.

source: Similar to :meth:`callback` but expects a coroutine function.
fr: Similaire à :meth:`callback` mais attend une fonction coroutine.

source: Similar to :meth:`close` but properly handles awaitables.
fr: Similaire à :meth:`close` mais gère correctement les tâches asynchrones.

source: Continuing the example for :func:`asynccontextmanager`::
fr: En continuité de l'exemple de :func:`asynccontextmanager` ::

source: Examples and Recipes
fr: Exemples et Recettes

source: This section describes some examples and recipes for making effective use of the tools provided by :mod:`contextlib`.
fr: Cette section décrit quelques exemples et recettes pour décrire une utilisation réelle des outils fournis par :mod:`contextlib`.

source: Supporting a variable number of context managers
fr: Gérer un nombre variable de gestionnaires de contexte
