Repository: python/python-docs-fr
Catalog: library/contextvars.po
Languages: fr

source: :mod:`contextvars` --- Context Variables
fr: :mod:`contextvars` — Variables de contexte

source: This module provides APIs to manage, store, and access context-local state. The :class:`~contextvars.ContextVar` class is used to declare and work with *Context Variables*. The :func:`~contextvars.copy_context` function and the :class:`~contextvars.Context` class should be used to manage the current context in asynchronous frameworks.
fr: Ce module fournit des API pour gérer, stocker et accéder à l'état local de contexte. La classe :class:`~contextvars.ContextVar` est utilisée pour déclarer et travailler avec les *Variables de contexte*. La fonction :func:`~contextvars.copy_context` et la classe :class:`~contextvars.Context` doivent être utilisées pour la gestion du contexte actuel dans les cadriciels asynchrones.

source: Context managers that have state should use Context Variables instead of :func:`threading.local()` to prevent their state from bleeding to other code unexpectedly, when used in concurrent code.
fr: Les gestionnaires de contexte, quand ils ont un état et quand ils sont utilisés dans du code s'exécutant de manière concurrente, doivent utiliser les variables de contexte au lieu de :func:`threading.local()` pour empêcher que leur état ne perturbe un autre fil de manière inattendue.

source: See also :pep:`567` for additional details.
fr: Voir aussi :pep:`567` pour plus de détails.

source: Context Variables
fr: Variables de contexte

source: This class is used to declare a new Context Variable, e.g.::
fr: Cette classe est utilisée pour déclarer une nouvelle variable de contexte, p. ex. ::

source: The required *name* parameter is used for introspection and debug purposes.
fr: Le paramètre requis *name* est utilisé à des fins d'introspection et de débogage.

source: The optional keyword-only *default* parameter is returned by :meth:`ContextVar.get` when no value for the variable is found in the current context.
fr: Le paramètre nommé *default* est renvoyé par :meth:`ContextVar.get` quand aucune valeur n'est trouvée dans le contexte actuel pour la variable.

source: **Important:** Context Variables should be created at the top module level and never in closures. :class:`Context` objects hold strong references to context variables which prevents context variables from being properly garbage collected.
fr: **Important :** les variables de contexte doivent être créées au plus haut niveau du module et jamais dans des fermetures (*closures*). Les objets :class:`Context` maintiennent des références fortes aux variables de contexte ce qui empêche que les variables de contexte soient correctement nettoyées par le ramasse-miette.

source: The name of the variable. This is a read-only property.
fr: Nom de la variable. Cette propriété est en lecture seule.

source: Return a value for the context variable for the current context.
fr: Renvoie la valeur de la variable de contexte pour le contexte actuel.

source: If there is no value for the variable in the current context, the method will:
fr: S'il n'y a pas de valeur pour la variable dans le contexte actuel, la méthode :

source: return the value of the *default* argument of the method, if provided; or
fr: renvoie la valeur de l'argument *default* passé à la méthode, s'il a été fourni ;

source: return the default value for the context variable, if it was created with one; or
fr: ou renvoie la valeur par défaut de la variable de contexte, si elle a été créée avec une valeur par défaut ;

source: raise a :exc:`LookupError`.
fr: ou lève une erreur :exc:`LookupError`.

source: Call to set a new value for the context variable in the current context.
fr: Assigne une nouvelle valeur à la variable de contexte dans le contexte actuel.

source: The required *value* argument is the new value for the context variable.
fr: L'argument requis *value* est la nouvelle valeur pour la variable de contexte.

source: Returns a :class:`~contextvars.Token` object that can be used to restore the variable to its previous value via the :meth:`ContextVar.reset` method.
fr: Renvoie un objet :class:`~contextvars.Token` qui peut être utilisé pour rétablir la variable à sa valeur précédente par la méthode :meth:`ContextVar.reset`.

source: Reset the context variable to the value it had before the :meth:`ContextVar.set` that created the *token* was used.
fr: Réinitialise la variable de contexte à la valeur qu'elle avait avant l'appel de :meth:`ContextVar.set` qui a créé le *token*.

source: For example::
fr: Par exemple ::

source: *Token* objects are returned by the :meth:`ContextVar.set` method. They can be passed to the :meth:`ContextVar.reset` method to revert the value of the variable to what it was before the corresponding *set*.
fr: Les objets *Token* sont renvoyés par la méthode :meth:`ContextVar.set`. Ils peuvent être passés à la méthode :meth:`ContextVar.reset` pour réaffecter la valeur de la variable à ce qu'elle était avant le *set* correspondant.

source: A read-only property. Points to the :class:`ContextVar` object that created the token.
fr: Propriété en lecture seule. Pointe vers l'objet :class:`ContextVar` qui a créé le token.

source: A marker object used by :attr:`Token.old_value`.
fr: Objet marqueur utilisé par :attr:`Token.old_value`.

source: Manual Context Management
fr: Gestion de contexte manuelle

source: Returns a copy of the current :class:`~contextvars.Context` object.
fr: Renvoie une copie de l'objet :class:`~contextvars.Context` actuel.

source: The following snippet gets a copy of the current context and prints all variables and their values that are set in it::
fr: Le fragment de code qui suit obtient une copie du contexte actuel et affiche toutes les variables avec leurs valeurs définies dans ce contexte.

source: The function has an O(1) complexity, i.e. works equally fast for contexts with a few context variables and for contexts that have a lot of them.
fr: La fonction a une complexité O(1), c.-à-d. qu'elle fonctionne aussi rapidement pour des contextes avec peu de variables de contexte que pour des contextes qui en ont beaucoup.

source: A mapping of :class:`ContextVars <ContextVar>` to their values.
fr: Tableau associatif entre :class:`ContextVars <ContextVar>` et leurs valeurs.

source: ``Context()`` creates an empty context with no values in it. To get a copy of the current context use the :func:`~contextvars.copy_context` function.
fr: ``Context()`` crée un contexte vide ne contenant aucune valeur. Pour obtenir une copie du contexte actuel, utilisez la fonction :func:`~contextvars.copy_context`.

source: Context implements the :class:`collections.abc.Mapping` interface.
fr: *Context* implémente l'interface :class:`collections.abc.Mapping`.

source: Execute ``callable(*args, **kwargs)`` code in the context object the *run* method is called on. Return the result of the execution or propagate an exception if one occurred.
fr: Exécute le code ``callable(*args, **kwargs)`` dans le contexte défini par l'objet. Renvoie le résultat de l'exécution ou propage une exception s'il y en a une qui s'est produite.

source: Any changes to any context variables that *callable* makes will be contained in the context object::
fr: Tout changement apporté aux variables de contexte effectué par *callable* sera contenu dans l'objet de contexte ::

source: The method raises a :exc:`RuntimeError` when called on the same context object from more than one OS thread, or when called recursively.
fr: La méthode lève une :exc:`RuntimeError` quand elle est appelée sur le même objet de contexte depuis plus qu'un fil d'exécution ou quand elle est appelée récursivement.

source: Return a shallow copy of the context object.
fr: Renvoie une copie de surface de l'objet de contexte.

source: Return ``True`` if the *context* has a value for *var* set; return ``False`` otherwise.
fr: Renvoie ``True`` si le *context* a une valeur pour *var* ; sinon renvoie ``False``.

source: Return the value of the *var* :class:`ContextVar` variable. If the variable is not set in the context object, a :exc:`KeyError` is raised.
fr: Renvoie la valeur de la variable :class:`ContextVar` *var*. Si la variable n'est pas définie dans l'objet de contexte, une :exc:`KeyError` est levée.

source: Return the value for *var* if *var* has the value in the context object. Return *default* otherwise. If *default* is not given, return ``None``.
fr: Renvoie la valeur de *var* si *var* possède une valeur dans l'objet de contexte. Renvoie *default* sinon (ou ``None`` si *default* n'est pas donné).

source: Return an iterator over the variables stored in the context object.
fr: Renvoie un itérateur sur les variables stockées dans l'objet de contexte.

source: Return the number of variables set in the context object.
fr: Renvoie le nombre de variables définies dans l'objet de contexte.

source: Return a list of all variables in the context object.
fr: Renvoie une liste de toutes les variables dans l'objet de contexte.

source: Return a list of all variables' values in the context object.
fr: Renvoie une liste de toutes les valeurs des variables dans l'objet de contexte.

source: Return a list of 2-tuples containing all variables and their values in the context object.
fr: Renvoie une liste de paires contenant toutes les variables et leurs valeurs dans l'objet de contexte.

source: asyncio support
fr: Gestion avec *asyncio*

source: Context variables are natively supported in :mod:`asyncio` and are ready to be used without any extra configuration. For example, here is a simple echo server, that uses a context variable to make the address of a remote client available in the Task that handles that client::
fr: :mod:`asyncio` gère nativement les variables de contexte et elles sont prêtes à être utilisées sans configuration supplémentaire. Par exemple, voici un serveur *echo* simple qui utilise une variable de contexte pour que l’adresse d'un client distant soit disponible dans le *Task* qui gère ce client ::
