Repository: python/python-docs-fr
Catalog: library/contextlib.po
Languages: fr

source: The primary use case for :class:`ExitStack` is the one given in the class documentation: supporting a variable number of context managers and other cleanup operations in a single :keyword:`with` statement. The variability may come from the number of context managers needed being driven by user input (such as opening a user specified collection of files), or from some of the context managers being optional::
fr: Le cas d'utilisation primaire de :class:`ExitStack` est celui décrit dans la documentation de la classe : gérer un nombre variable de gestionnaires de contexte et d'autres opérations de nettoyage en une unique instruction :keyword:`with`. La variabilité peut venir du nombre de gestionnaires de contexte voulus découlant d'une entrée de l'utilisateur (comme ouvrir une collection spécifique de fichiers de l'utilisateur), ou de certains gestionnaires de contexte qui peuvent être optionnels ::

source: As shown, :class:`ExitStack` also makes it quite easy to use :keyword:`with` statements to manage arbitrary resources that don't natively support the context management protocol.
fr: Comme montré, :class:`ExitStack` rend aussi assez facile d'utiliser les instructions :keyword:`with` pour gérer des ressources arbitraires qui ne gèrent pas nativement le protocole des gestionnaires de contexte.

source: Catching exceptions from ``__enter__`` methods
fr: Attraper des exceptions depuis les méthodes ``__enter__``

source: It is occasionally desirable to catch exceptions from an ``__enter__`` method implementation, *without* inadvertently catching exceptions from the :keyword:`with` statement body or the context manager's ``__exit__`` method. By using :class:`ExitStack` the steps in the context management protocol can be separated slightly in order to allow this::
fr: Il est occasionnellement souhaitable d'attraper les exceptions depuis l'implémentation d'une méthode ``__enter__``, *sans* attraper par inadvertance les exceptions du corps de l'instruction :keyword:`with` ou de la méthode ``__exit__`` des gestionnaires de contexte. En utilisant :class:`ExitStack`, les étapes du protocole des gestionnaires de contexte peuvent être légèrement séparées pour permettre le code suivant ::

source: Actually needing to do this is likely to indicate that the underlying API should be providing a direct resource management interface for use with :keyword:`try`/:keyword:`except`/:keyword:`finally` statements, but not all APIs are well designed in that regard. When a context manager is the only resource management API provided, then :class:`ExitStack` can make it easier to handle various situations that can't be handled directly in a :keyword:`with` statement.
fr: Avoir à faire cela est en fait surtout utile pour indiquer que l'*API* sous-jacente devrait fournir une interface directe de gestion des ressources à utiliser avec les instructions :keyword:`try`/:keyword:`except`/:keyword:`finally`, mais que toutes les *API* ne sont pas bien conçues dans cet objectif. Quand un gestionnaire de contexte est la seule *API* de gestion des ressources fournie, alors :class:`ExitStack` peut rendre plus facile la gestion de plusieurs situations qui ne peuvent pas être traitées directement dans une instruction :keyword:`with`.

source: Cleaning up in an ``__enter__`` implementation
fr: Nettoyer dans une méthode ``__enter__``

source: As noted in the documentation of :meth:`ExitStack.push`, this method can be useful in cleaning up an already allocated resource if later steps in the :meth:`__enter__` implementation fail.
fr: Comme indiqué dans la documentation de :meth:`ExitStack.push`, cette méthode peut être utile pour nettoyer une ressource déjà allouée si les dernières étapes de l'implémentation de :meth:`__enter__` échouent.

source: Here's an example of doing this for a context manager that accepts resource acquisition and release functions, along with an optional validation function, and maps them to the context management protocol::
fr: Voici un exemple de gestionnaire de contexte qui reçoit des fonctions d'acquisition de ressources et de libération, avec une méthode de validation optionnelle, et qui les adapte au protocole des gestionnaires de contexte ::

source: Replacing any use of ``try-finally`` and flag variables
fr: Remplacer un ``try-finally`` avec une option variable

source: A pattern you will sometimes see is a ``try-finally`` statement with a flag variable to indicate whether or not the body of the ``finally`` clause should be executed. In its simplest form (that can't already be handled just by using an ``except`` clause instead), it looks something like this::
fr: Un modèle que vous rencontrerez parfois est un bloc ``try-finally`` avec une option pour indiquer si le corps de la clause ``finally`` doit être exécuté ou non. Dans sa forme la plus simple (qui ne peut pas déjà être gérée avec juste une clause ``except``), cela ressemble à ::

source: As with any ``try`` statement based code, this can cause problems for development and review, because the setup code and the cleanup code can end up being separated by arbitrarily long sections of code.
fr: Comme avec n'importe quel code basé sur une instruction ``try``, cela peut poser problème pour le développement et la revue, parce que beaucoup de codes d'installation et de nettoyage peuvent finir par être séparés par des sections de code arbitrairement longues.

source: :class:`ExitStack` makes it possible to instead register a callback for execution at the end of a ``with`` statement, and then later decide to skip executing that callback::
fr: :class:`ExitStack` rend possible de plutôt enregistrer une fonction de rappel pour être exécutée à la fin d'une instruction ``with``, et décider ensuite de passer l'exécution de cet appel ::

source: This allows the intended cleanup up behaviour to be made explicit up front, rather than requiring a separate flag variable.
fr: Cela permet de rendre explicite dès le départ le comportement de nettoyage attendu, plutôt que de nécessiter une option séparée.

source: If a particular application uses this pattern a lot, it can be simplified even further by means of a small helper class::
fr: Si une application particulière utilise beaucoup ce modèle, cela peut-être simplifié encore plus au moyen d'une petite classe d'aide ::

source: If the resource cleanup isn't already neatly bundled into a standalone function, then it is still possible to use the decorator form of :meth:`ExitStack.callback` to declare the resource cleanup in advance::
fr: Si le nettoyage de la ressource n'est pas déjà soigneusement embarqué dans une fonction autonome, il est possible d'utiliser le décorateur :meth:`ExitStack.callback` pour déclarer la fonction de nettoyage de ressource en avance ::

source: Due to the way the decorator protocol works, a callback function declared this way cannot take any parameters. Instead, any resources to be released must be accessed as closure variables.
fr: Dû au fonctionnement du protocole des décorateurs, une fonction déclarée ainsi ne peut prendre aucun paramètre. À la place, les ressources à libérer doivent être récupérées depuis l'extérieur comme des variables de fermeture (*closure*).

source: Using a context manager as a function decorator
fr: Utiliser un gestionnaire de contexte en tant que décorateur de fonction

source: :class:`ContextDecorator` makes it possible to use a context manager in both an ordinary ``with`` statement and also as a function decorator.
fr: :class:`ContextDecorator` rend possible l'utilisation d'un gestionnaire de contexte à la fois ordinairement avec une instruction ``with`` ou comme un décorateur de fonction.

source: For example, it is sometimes useful to wrap functions or groups of statements with a logger that can track the time of entry and time of exit. Rather than writing both a function decorator and a context manager for the task, inheriting from :class:`ContextDecorator` provides both capabilities in a single definition::
fr: Par exemple, il est parfois utile d'emballer les fonctions ou blocs d'instructions avec un journaliseur qui pourrait suivre le temps d'exécution entre l'entrée et la sortie. Plutôt qu'écrire à la fois un décorateur et un gestionnaire de contexte pour la même tâche, hériter de :class:`ContextDecorator` fournit les deux fonctionnalités en une seule définition ::

source: Instances of this class can be used as both a context manager::
fr: Les instances de cette classe peuvent être utilisées comme gestionnaires de contexte ::

source: And also as a function decorator::
fr: Et comme décorateurs de fonctions ::

source: Note that there is one additional limitation when using context managers as function decorators: there's no way to access the return value of :meth:`__enter__`. If that value is needed, then it is still necessary to use an explicit ``with`` statement.
fr: Notez qu'il y a une autre limitation en utilisant les gestionnaires de contexte comme décorateurs : il n'y a aucune manière d'accéder à la valeur de retour de :meth:`__enter__`. Si cette valeur est nécessaire, il faut utiliser explicitement une instruction ``with``.

source: The specification, background, and examples for the Python :keyword:`with` statement.
fr: La spécification, les motivations et des exemples de l'instruction :keyword:`with` en Python.

source: Single use, reusable and reentrant context managers
fr: Gestionnaires de contexte à usage unique, réutilisables et réentrants

source: Most context managers are written in a way that means they can only be used effectively in a :keyword:`with` statement once. These single use context managers must be created afresh each time they're used - attempting to use them a second time will trigger an exception or otherwise not work correctly.
fr: La plupart des gestionnaires de contexte sont écrits d'une manière qui ne leur permet que d'être utilisés une fois avec une instruction :keyword:`with`. Ces gestionnaires de contexte à usage unique doivent être recréés chaque fois qu'ils sont utilisés — tenter de les utiliser une seconde fois lève une exception ou ne fonctionne pas correctement.

source: This common limitation means that it is generally advisable to create context managers directly in the header of the :keyword:`with` statement where they are used (as shown in all of the usage examples above).
fr: Cette limitation commune signifie qu'il est généralement conseillé de créer les gestionnaires de contexte directement dans l'en-tête du bloc :keyword:`with` où ils sont utilisés (comme montré dans tous les exemples d'utilisation au-dessus).

source: Files are an example of effectively single use context managers, since the first :keyword:`with` statement will close the file, preventing any further IO operations using that file object.
fr: Les fichiers sont un exemple de gestionnaires de contexte étant effectivement à usage unique, puisque la première instruction :keyword:`with` ferme le fichier, empêchant d'autres opérations d'entrée/sortie d'être exécutées sur ce fichier.

source: Context managers created using :func:`contextmanager` are also single use context managers, and will complain about the underlying generator failing to yield if an attempt is made to use them a second time::
fr: Les gestionnaires de contexte créés avec :func:`contextmanager` sont aussi à usage unique, et se plaindront du fait que le générateur sous-jacent ne produise plus de valeur si vous essayez de les utiliser une seconde fois ::

source: Reentrant context managers
fr: Gestionnaires de contexte réentrants

source: More sophisticated context managers may be "reentrant". These context managers can not only be used in multiple :keyword:`with` statements, but may also be used *inside* a :keyword:`!with` statement that is already using the same context manager.
fr: Certains gestionnaires de contexte plus sophistiqués peuvent être « réentrants ». Ces gestionnaires de contexte ne peuvent pas seulement être utilisés avec plusieurs instructions :keyword:`with`, mais aussi *à l'intérieur* d'une instruction :keyword:`!with` qui utilise déjà ce même gestionnaire de contexte.

source: :class:`threading.RLock` is an example of a reentrant context manager, as are :func:`suppress` and :func:`redirect_stdout`. Here's a very simple example of reentrant use::
fr: :class:`threading.RLock` est un exemple de gestionnaire de contexte réentrant, comme le sont aussi :func:`suppress` et :func:`redirect_stdout`. Voici un très simple exemple d'utilisation réentrante ::

source: Real world examples of reentrancy are more likely to involve multiple functions calling each other and hence be far more complicated than this example.
fr: Les exemples plus réels de réentrance sont susceptibles d'invoquer plusieurs fonctions s'entre-appelant, et donc être bien plus compliqués que cet exemple.

source: Note also that being reentrant is *not* the same thing as being thread safe. :func:`redirect_stdout`, for example, is definitely not thread safe, as it makes a global modification to the system state by binding :data:`sys.stdout` to a different stream.
fr: Notez aussi qu'être réentrant ne signifie *pas* être *thread safe*. :func:`redirect_stdout`, par exemple, n'est définitivement pas *thread safe*, puisqu'il effectue des changements globaux sur l'état du système en branchant :data:`sys.stdout` sur différents flux.

source: Reusable context managers
fr: Gestionnaires de contexte réutilisables

source: Distinct from both single use and reentrant context managers are "reusable" context managers (or, to be completely explicit, "reusable, but not reentrant" context managers, since reentrant context managers are also reusable). These context managers support being used multiple times, but will fail (or otherwise not work correctly) if the specific context manager instance has already been used in a containing with statement.
fr: D'autres gestionnaires de contexte que ceux à usage unique et les réentrants sont les gestionnaires de contexte « réutilisables » (ou, pour être plus explicite, « réutilisables mais pas réentrants », puisque les gestionnaires de contexte réentrants sont aussi réutilisables). Ces gestionnaires de contexte sont conçus afin d'être utilisés plusieurs fois, mais échoueront (ou ne fonctionnent pas correctement) si l'instance de gestionnaire de contexte référencée a déjà été utilisée dans une instruction *with* englobante.

source: :class:`threading.Lock` is an example of a reusable, but not reentrant, context manager (for a reentrant lock, it is necessary to use :class:`threading.RLock` instead).
fr: :class:`threading.Lock` est un exemple de gestionnaire de contexte réutilisable mais pas réentrant (pour un verrou réentrant, il faut à la place utiliser :class:`threading.RLock`).

source: Another example of a reusable, but not reentrant, context manager is :class:`ExitStack`, as it invokes *all* currently registered callbacks when leaving any with statement, regardless of where those callbacks were added::
fr: Un autre exemple de gestionnaire de contexte réutilisable mais pas réentrant est :class:`ExitStack`, puisqu'il invoque *toutes* les fonctions de rappel actuellement enregistrées en quittant l'instruction *with*, sans regarder où ces fonctions ont été ajoutées ::

source: As the output from the example shows, reusing a single stack object across multiple with statements works correctly, but attempting to nest them will cause the stack to be cleared at the end of the innermost with statement, which is unlikely to be desirable behaviour.
fr: Comme le montre la sortie de l'exemple, réutiliser une simple pile entre plusieurs instructions *with* fonctionne correctement, mais essayer de les imbriquer fait que la pile est vidée à la fin du *with* le plus imbriqué, ce qui n'est probablement pas le comportement voulu.

source: Using separate :class:`ExitStack` instances instead of reusing a single instance avoids that problem::
fr: Pour éviter ce problème, utilisez des instances différentes de :class:`ExitStack` plutôt qu'une seule instance ::
