Repository: python/python-docs-fr
Catalog: library/csv.po
Languages: fr

source: When ``True``, raise exception :exc:`Error` on bad CSV input. The default is ``False``.
fr: Quand il vaut ``True``, une exception :exc:`Error` est levée lors de mauvaises entrées CSV. Il vaut ``False`` par défaut.

source: Reader Objects
fr: Objets lecteurs

source: Reader objects (:class:`DictReader` instances and objects returned by the :func:`reader` function) have the following public methods:
fr: Les objets lecteurs (instances de :class:`DictReader` ou objets renvoyés par la fonction :func:`reader`) ont les méthodes publiques suivantes :

source: Return the next row of the reader's iterable object as a list (if the object was returned from :func:`reader`) or a dict (if it is a :class:`DictReader` instance), parsed according to the current dialect. Usually you should call this as ``next(reader)``.
fr: Renvoie la ligne suivante de l'objet itérable du lecteur en tant que liste (si l'objet est renvoyé depuis :func:`reader`) ou dictionnaire (si l'objet est un :class:`DictReader`), analysé suivant le dialecte courant. Généralement, vous devez appeler la méthode à l'aide de ``next(reader)``.

source: Reader objects have the following public attributes:
fr: Les objets lecteurs ont les attributs publics suivants :

source: A read-only description of the dialect in use by the parser.
fr: Une description en lecture seule du dialecte utilisé par l'analyseur.

source: The number of lines read from the source iterator. This is not the same as the number of records returned, as records can span multiple lines.
fr: Le nombre de lignes lues depuis l'itérateur source. Ce n'est pas équivalent au nombre d'enregistrements renvoyés, puisque certains enregistrements peuvent s'étendre sur plusieurs lignes.

source: DictReader objects have the following public attribute:
fr: Les objets *DictReader* ont les attributs publics suivants :

source: If not passed as a parameter when creating the object, this attribute is initialized upon first access or when the first record is read from the file.
fr: S'il n'est pas passé comme paramètre à la création de l'objet, cet attribut est initialisé lors du premier accès ou quand le premier enregistrement est lu depuis le fichier.

source: Writer Objects
fr: Objets transcripteurs

source: :class:`Writer` objects (:class:`DictWriter` instances and objects returned by the :func:`writer` function) have the following public methods. A *row* must be an iterable of strings or numbers for :class:`Writer` objects and a dictionary mapping fieldnames to strings or numbers (by passing them through :func:`str` first) for :class:`DictWriter` objects. Note that complex numbers are written out surrounded by parens. This may cause some problems for other programs which read CSV files (assuming they support complex numbers at all).
fr: Les objets :class:`Writer` (instances de :class:`DictWriter` ou objets renvoyés par la fonction :func:`writer`) ont les méthodes publiques suivantes. Une *row* doit être un itérable de chaînes de caractères ou de nombres pour les objets :class:`Writer`, et un dictionnaire associant des noms de champs à des chaînes ou des nombres (en les faisant d'abord passer par :func:`str`) pour les objets :class:`DictWriter`. Notez que les nombres complexes sont retranscrits entourés de parenthèses. Cela peut causer quelques problèmes pour d'autres programmes qui liraient ces fichiers CSV (en supposant qu'ils supportent les nombres complexes).

source: Write the *row* parameter to the writer's file object, formatted according to the current dialect. Return the return value of the call to the *write* method of the underlying file object.
fr: Écrit le paramètre *row* vers le fichier associé au transcripteur, formaté selon le dialecte courant. Renvoie la valeur de retour de l'appel à la méthode *write* de l'objet fichier sous-jacent.

source: Added support of arbitrary iterables.
fr: Ajout du support d'itérables arbitraires.

source: Write all elements in *rows* (an iterable of *row* objects as described above) to the writer's file object, formatted according to the current dialect.
fr: Écrit tous les éléments de *rows* (itérable d'objets *row* comme décrits précédemment) vers le fichier associé au transcripteur, formatés selon le dialecte courant.

source: Writer objects have the following public attribute:
fr: Les objets transcripteurs ont les attributs publics suivants :

source: A read-only description of the dialect in use by the writer.
fr: Une description en lecture seule du dialecte utilisé par le transcripteur.

source: DictWriter objects have the following public method:
fr: Les objets *DictWriter* ont les attributs publics suivants :

source: Write a row with the field names (as specified in the constructor) to the writer's file object, formatted according to the current dialect. Return the return value of the :meth:`csvwriter.writerow` call used internally.
fr: Écrit une ligne avec le nom des en-têtes (comme définies dans le constructeur) dans l'objet fichier associé au transcripteur, formatée selon le dialecte courant. Renvoie la valeur de retour de l'appel :meth:`csvwriter.writerow` utilisé en interne.

source: :meth:`writeheader` now also returns the value returned by the :meth:`csvwriter.writerow` method it uses internally.
fr: :meth:`writeheader` renvoie maintenant aussi la valeur renvoyée par la méthode :meth:`csvwriter.writerow` qu'il utilise en interne.

source: Examples
fr: Exemples

source: The simplest example of reading a CSV file::
fr: Le plus simple exemple de lecture d'un fichier CSV ::

source: Reading a file with an alternate format::
fr: Lire un fichier avec un format alternatif ::

source: The corresponding simplest possible writing example is::
fr: Le plus simple exemple d'écriture correspondant est ::

source: Since :func:`open` is used to open a CSV file for reading, the file will by default be decoded into unicode using the system default encoding (see :func:`locale.getpreferredencoding`). To decode a file using a different encoding, use the ``encoding`` argument of open::
fr: Puisque :func:`open` est utilisée pour ouvrir un fichier CSV en lecture, le fichier sera par défaut décodé vers Unicode en utilisant l'encodage par défaut (voir :func:`locale.getpreferredencoding`). Pour décoder un fichier utilisant un encodage différent, utilisez l'argument ``encoding`` de *open* ::

source: The same applies to writing in something other than the system default encoding: specify the encoding argument when opening the output file.
fr: La même chose s'applique lors de l'écriture dans un autre encodage que celui par défaut du système : spécifiez l'encodage en argument lors de l'ouverture du fichier de sortie.

source: Registering a new dialect::
fr: Enregistrer un nouveau dialecte ::

source: A slightly more advanced use of the reader --- catching and reporting errors::
fr: Un exemple d'utilisation un peu plus avancé du lecteur --- attrapant et notifiant les erreurs ::

source: And while the module doesn't directly support parsing strings, it can easily be done::
fr: Et bien que le module ne permette pas d'analyser directement des chaînes, cela peut être fait facilement ::

source: Footnotes
fr: Notes

source: If ``newline=''`` is not specified, newlines embedded inside quoted fields will not be interpreted correctly, and on platforms that use ``\r\n`` linendings on write an extra ``\r`` will be added. It should always be safe to specify ``newline=''``, since the csv module does its own (:term:`universal <universal newlines>`) newline handling.
fr: Si ``newline=''`` n'est pas spécifié, les caractères de fin de ligne embarqués dans des champs délimités par des guillemets ne seront pas interprétés correctement, et sur les plateformes qui utilisent ``\r\n`` comme marqueur de fin de ligne, un ``\r`` sera ajouté. Vous devriez toujours spécifier sans crainte ``newline=''``, puisque le module *csv* gère lui-même les fins de lignes (:term:`universelles <universal newlines>`).
