Repository: python/python-docs-fr
Catalog: library/ctypes.po
Languages: fr

source: Since ``table`` is a ``pointer`` to the array of ``struct_frozen`` records, we can iterate over it, but we just have to make sure that our loop terminates, because pointers have no size. Sooner or later it would probably crash with an access violation or whatever, so it's better to break out of the loop when we hit the ``NULL`` entry::
fr: Puisque ``table`` est un ``pointer`` vers un tableau d'entrées de ``struct_frozen``, il est possible d'itérer dessus, mais il faut être certain que la boucle se termine, car les pointeurs n'ont pas de taille. Tôt ou tard, il planterait probablement avec une erreur de segmentation ou autre, donc mieux vaut sortir de la boucle quand on lit l'entrée ``NULL`` ::

source: The fact that standard Python has a frozen module and a frozen package (indicated by the negative ``size`` member) is not well known, it is only used for testing. Try it out with ``import __hello__`` for example.
fr: Le fait que le standard Python possède un module et un paquet figés (indiqués par la valeur négative du membre *size*) est peu connu, cela ne sert qu'aux tests. Essayez avec ``import __hello__`` par exemple.

source: Surprises
fr: Pièges

source: There are some edges in :mod:`ctypes` where you might expect something other than what actually happens.
fr: Il y a quelques cas tordus dans :mod:`ctypes` où on peut s'attendre à un résultat différent de la réalité.

source: Consider the following example::
fr: Examinons l'exemple suivant ::

source: Hm. We certainly expected the last statement to print ``3 4 1 2``. What happened? Here are the steps of the ``rc.a, rc.b = rc.b, rc.a`` line above::
fr: Diantre. On s'attendait certainement à ce que le dernier résultat affiche ``3 4 1 2``. Que s'est-il passé ? Les étapes de la ligne ``rc.a, rc.b = rc.b, rc.a`` ci-dessus sont les suivantes ::

source: Note that ``temp0`` and ``temp1`` are objects still using the internal buffer of the ``rc`` object above. So executing ``rc.a = temp0`` copies the buffer contents of ``temp0`` into ``rc`` 's buffer. This, in turn, changes the contents of ``temp1``. So, the last assignment ``rc.b = temp1``, doesn't have the expected effect.
fr: Les objets ``temp0`` et ``temp1`` utilisent encore le tampon interne de l'objet ``rc`` ci-dessus. Donc exécuter ``rc.a = temp0`` copie le contenu du tampon de ``temp0`` dans celui de ``rc``. Ce qui, par ricochet, modifie le contenu de ``temp1``. Et donc, la dernière affectation, ``rc.b = temp1``, n'a pas l'effet escompté.

source: Keep in mind that retrieving sub-objects from Structure, Unions, and Arrays doesn't *copy* the sub-object, instead it retrieves a wrapper object accessing the root-object's underlying buffer.
fr: Gardez en tête qu'accéder au sous-objet depuis une *Structure*, une *Union* ou un *Array* ne copie *pas* le sous-objet, mais crée un objet interface qui accède au tampon sous-jacent de l'objet initial.

source: Another example that may behave differently from what one would expect is this::
fr: Un autre exemple de comportement *a priori* inattendu est le suivant ::

source: Objects instantiated from :class:`c_char_p` can only have their value set to bytes or integers.
fr: La valeur d'une instance de :class:`c_char_p` ne peut être initialisée qu'avec un octet ou un entier.

source: Why is it printing ``False``? ctypes instances are objects containing a memory block plus some :term:`descriptor`\s accessing the contents of the memory. Storing a Python object in the memory block does not store the object itself, instead the ``contents`` of the object is stored. Accessing the contents again constructs a new Python object each time!
fr: Pourquoi cela affiche-t'il ``False`` ? Les instances *ctypes* sont des objets qui contiennent un bloc mémoire et des :term:`descriptor` qui donnent accès au contenu du ce bloc. Stocker un objet Python dans le bloc mémoire ne stocke pas l'objet même ; seuls ses ``contents`` le sont. Accéder au ``contents`` crée un nouvel objet Python à chaque fois !

source: Variable-sized data types
fr: Types de données à taille flottante

source: :mod:`ctypes` provides some support for variable-sized arrays and structures.
fr: :mod:`ctypes` assure la prise en charge des tableaux et des structures à taille flottante.

source: The :func:`resize` function can be used to resize the memory buffer of an existing ctypes object. The function takes the object as first argument, and the requested size in bytes as the second argument. The memory block cannot be made smaller than the natural memory block specified by the objects type, a :exc:`ValueError` is raised if this is tried::
fr: La fonction :func:`resize` permet de redimensionner la taille du tampon mémoire d'un objet *ctypes* existant. Cette fonction prend l'objet comme premier argument et la taille en octets désirée comme second. La taille du tampon mémoire ne peut pas être inférieure à celle occupée par un objet unitaire du type considéré. Une :exc:`ValueError` est levée si c'est le cas ::

source: This is nice and fine, but how would one access the additional elements contained in this array? Since the type still only knows about 4 elements, we get errors accessing other elements::
fr: Cela dit, comment accéder aux éléments supplémentaires contenus dans le tableau ? Vu que le type ne connaît que 4 éléments, on obtient une erreur si l'on accède aux suivants ::

source: Another way to use variable-sized data types with :mod:`ctypes` is to use the dynamic nature of Python, and (re-)define the data type after the required size is already known, on a case by case basis.
fr: Une autre approche pour utiliser des types de donnée à taille flottante avec :mod:`ctypes` consiste à tirer profit de la nature intrinsèquement dynamique de Python et de (re)définir le type de donnée une fois que la taille demandée est connue, au cas-par-cas.

source: ctypes reference
fr: Référence du module

source: Finding shared libraries
fr: Recherche de bibliothèques partagées

source: When programming in a compiled language, shared libraries are accessed when compiling/linking a program, and when the program is run.
fr: Les langages compilés ont besoin d'accéder aux bibliothèques partagées au moment de la compilation, de l'édition de liens et pendant l'exécution du programme.

source: The purpose of the :func:`find_library` function is to locate a library in a way similar to what the compiler or runtime loader does (on platforms with several versions of a shared library the most recent should be loaded), while the ctypes library loaders act like when a program is run, and call the runtime loader directly.
fr: Le but de la fonction :func:`find_library` est de trouver une bibliothèque de la même façon que le ferait le compilateur ou le chargeur (sur les plates-formes avec plusieurs versions de la même bibliothèque, la plus récente est chargée), alors que les chargeurs de bibliothèques de *ctypes* se comportent de la même façon qu'un programme qui s'exécute, et appellent directement le chargeur.

source: The :mod:`ctypes.util` module provides a function which can help to determine the library to load.
fr: Le module :mod:`ctypes.util` fournit une fonction pour déterminer quelle bibliothèque charger.

source: Try to find a library and return a pathname. *name* is the library name without any prefix like *lib*, suffix like ``.so``, ``.dylib`` or version number (this is the form used for the posix linker option :option:`!-l`). If no library can be found, returns ``None``.
fr: Tente de trouver une bibliothèque et en renvoie le chemin. *name* est le nom de la bibliothèque sans préfixe — comme *lib* — ni suffixe — comme ``.so``, ``.dylib`` ou un numéro de version (c.-à-d. la même forme que l'option POSIX de l'éditeur de lien :option:`!-l`). Si la fonction ne parvient pas à trouver de bibliothèque, elle renvoie ``None``.

source: The exact functionality is system dependent.
fr: Le mode opératoire exact dépend du système.

source: On Linux, :func:`find_library` tries to run external programs (``/sbin/ldconfig``, ``gcc``, ``objdump`` and ``ld``) to find the library file. It returns the filename of the library file.
fr: Sous Linux, :func:`find_library` essaye de lancer des programmes externes (``/sbin/ldconfig``, ``gcc``, ``objdump`` et ``ld``) pour trouver la bibliothèque. Elle renvoie le nom de la bibliothèque sur le disque.

source: On Linux, the value of the environment variable ``LD_LIBRARY_PATH`` is used when searching for libraries, if a library cannot be found by any other means.
fr: Sous Linux, si les autres moyens échouent, la fonction utilise la variable d'environnement ``LD_LIBRARY_PATH`` pour trouver la bibliothèque.

source: Here are some examples::
fr: Voici quelques exemples :

source: On macOS, :func:`find_library` tries several predefined naming schemes and paths to locate the library, and returns a full pathname if successful::
fr: Sous macOS, :func:`find_library` regarde dans des chemins et conventions de chemins prédéfinies pour trouver la bibliothèque et en renvoie le chemin complet si elle la trouve :

source: On Windows, :func:`find_library` searches along the system search path, and returns the full pathname, but since there is no predefined naming scheme a call like ``find_library("c")`` will fail and return ``None``.
fr: Sous Windows, :func:`find_library` examine le chemin de recherche du système et renvoie le chemin complet de la bibliothèque, mais comme il n'existe pas de convention de nommage, des appels comme ``find_library("c")`` échouent et renvoient ``None``.

source: If wrapping a shared library with :mod:`ctypes`, it *may* be better to determine the shared library name at development time, and hardcode that into the wrapper module instead of using :func:`find_library` to locate the library at runtime.
fr: Si vous encapsulez une bibliothèque partagée avec :mod:`ctypes`, il est *probablement* plus judicieux de déterminer le chemin de cette bibliothèque lors du développement et de l'écrire en dur dans le module d'encapsulation, plutôt que d'utiliser :func:`find_library` pour la trouver lors de l'exécution.

source: Loading shared libraries
fr: Chargement des bibliothèques partagées

source: There are several ways to load shared libraries into the Python process. One way is to instantiate one of the following classes:
fr: Il y a plusieurs moyens de charger une bibliothèque partagée dans un processus Python. L'un d'entre eux consiste à instancier une des classes suivantes :

source: Instances of this class represent loaded shared libraries. Functions in these libraries use the standard C calling convention, and are assumed to return :c:type:`int`.
fr: Une instance de cette classe représente une bibliothèque partagée déjà chargée. Les fonctions de cette bibliothèque utilisent la convention d'appel C standard et doivent renvoyer un :c:type:`int`.

source: On Windows creating a :class:`CDLL` instance may fail even if the DLL name exists. When a dependent DLL of the loaded DLL is not found, a :exc:`OSError` error is raised with the message *"[WinError 126] The specified module could not be found".* This error message does not contain the name of the missing DLL because the Windows API does not return this information making this error hard to diagnose. To resolve this error and determine which DLL is not found, you need to find the list of dependent DLLs and determine which one is not found using Windows debugging and tracing tools.
fr: En Windows, créer une instance de :class:`CDLL` peut échouer, même si une DLL du bon nom existe. Quand une des dépendances de la DLL à charger ne peut pas être trouvée, une :exc:`OSError` est levée avec le message *"[WinError 126] The specified module could not be found".* Ce message d'erreur ne contient pas le nom de la DLL manquante car l'API Windows ne fournit pas cette information. Cela rend l'erreur délicate à analyser ; pour la résoudre, il faut lister toutes les dépendances de la DLL et trouver celle qui manque en utilisant des outils de débogage et de traçage Windows.

source: `Microsoft DUMPBIN tool <https://docs.microsoft.com/cpp/build/reference/dependents>`_ -- A tool to find DLL dependents.
fr: `DUMPBIN <https://docs.microsoft.com/cpp/build/reference/dependents>`_ — un utilitaire Microsoft pour lister les dépendances d'une DLL.

source: Windows only: Instances of this class represent loaded shared libraries, functions in these libraries use the ``stdcall`` calling convention, and are assumed to return the windows specific :class:`HRESULT` code. :class:`HRESULT` values contain information specifying whether the function call failed or succeeded, together with additional error code. If the return value signals a failure, an :class:`OSError` is automatically raised.
fr: En Windows seulement : une instance de cette classe représente une bibliothèque partagée déjà chargée. Les fonctions de cette bibliothèque utilisent la convention d'appel *stdcall*, et doivent renvoyer un code :class:`HRESULT` (propre à Windows). Les valeurs de :class:`HRESULT` contiennent des informations précisant si l'appel de la fonction a échoué ou s'il a réussi, ainsi qu'un code d'erreur supplémentaire. Si la valeur de retour signale un échec, une :class:`OSError` est levée automatiquement.

source: :exc:`WindowsError` used to be raised.
fr: :exc:`WindowsError` était levée auparavant.

source: Windows only: Instances of this class represent loaded shared libraries, functions in these libraries use the ``stdcall`` calling convention, and are assumed to return :c:type:`int` by default.
fr: En Windows seulement : une instance de cette classe représente une bibliothèque partagée déjà chargée. Les fonctions de cette bibliothèque utilisent la convention d'appel *stdcall* et doivent renvoyer par défaut un :c:type:`int`.

source: On Windows CE only the standard calling convention is used, for convenience the :class:`WinDLL` and :class:`OleDLL` use the standard calling convention on this platform.
fr: Sous Windows CE, seule la convention d'appel standard est utilisée. Pour des raisons pratiques, :class:`WinDLL` et :class:`OleDLL` utilisent la convention d'appel standard sur cette plate-forme.

source: The Python :term:`global interpreter lock` is released before calling any function exported by these libraries, and reacquired afterwards.
fr: Le :term:`verrou global de l'interpréteur <global interpreter lock>` Python est relâché avant chaque appel d'une fonction exposée par ces bibliothèques et ré-activé après.

source: Instances of this class behave like :class:`CDLL` instances, except that the Python GIL is *not* released during the function call, and after the function execution the Python error flag is checked. If the error flag is set, a Python exception is raised.
fr: Cette classe est identique à :class:`CDLL`, à ceci près que le GIL n'est *pas* relâché pendant l'appel de la fonction, et, qu'au terme de l'appel, le drapeau d'erreur Python est vérifié. Si celui-ci est activé, une exception Python est levée.

source: Thus, this is only useful to call Python C api functions directly.
fr: Donc, cette classe ne sert qu'à appeler les fonctions de l'API C de Python.

source: All these classes can be instantiated by calling them with at least one argument, the pathname of the shared library. If you have an existing handle to an already loaded shared library, it can be passed as the ``handle`` named parameter, otherwise the underlying platforms ``dlopen`` or ``LoadLibrary`` function is used to load the library into the process, and to get a handle to it.
fr: Toutes ces classes peuvent être instanciées en les appelant avec le chemin de la bibliothèque partagée comme unique argument. Il est aussi possible de passer un lien vers une bibliothèque déjà chargée en utilisant le paramètre ``handle``. Sinon, les fonctions ``dlopen`` ou ``LoadLibrary`` de la plate-forme sous-jacente permettent de charger la bibliothèque dans le processus, et d'en obtenir un lien.

source: The *mode* parameter can be used to specify how the library is loaded. For details, consult the :manpage:`dlopen(3)` manpage. On Windows, *mode* is ignored. On posix systems, RTLD_NOW is always added, and is not configurable.
fr: Le mode de chargement de la bibliothèque est défini par le paramètre *mode*. Pour plus de détails, référez-vous à l'entrée :manpage:`dlopen(3)` du manuel. En Windows, *mode* est ignoré. Sur les systèmes POSIX, RTLD_NOW y est toujours ajouté. Ceci n'est pas configurable.

source: The *use_errno* parameter, when set to true, enables a ctypes mechanism that allows accessing the system :data:`errno` error number in a safe way. :mod:`ctypes` maintains a thread-local copy of the systems :data:`errno` variable; if you call foreign functions created with ``use_errno=True`` then the :data:`errno` value before the function call is swapped with the ctypes private copy, the same happens immediately after the function call.
fr: Le paramètre *use_errno*, lorsque défini à vrai, active un mécanisme de *ctypes* qui permet d'accéder au numéro d'erreur :data:`errno` du système de manière sécurisée. :mod:`ctypes` maintient une copie de :data:`errno` du système dans chaque fil d'exécution. Si vous appelez des fonctions externes créées avec ``use_errno=True``, la valeur de :data:`errno` avant l'appel de la fonction est échangée avec la copie privée de *ctypes*. La même chose se produit juste après l'appel de la fonction.

source: The function :func:`ctypes.get_errno` returns the value of the ctypes private copy, and the function :func:`ctypes.set_errno` changes the ctypes private copy to a new value and returns the former value.
fr: La fonction :func:`ctypes.get_errno` renvoie la valeur de la copie privée de *ctypes*. La fonction :func:`ctypes.set_errno` affecte une nouvelle valeur à la copie privée et renvoie l'ancienne valeur.

source: The *use_last_error* parameter, when set to true, enables the same mechanism for the Windows error code which is managed by the :func:`GetLastError` and :func:`SetLastError` Windows API functions; :func:`ctypes.get_last_error` and :func:`ctypes.set_last_error` are used to request and change the ctypes private copy of the windows error code.
fr: Définir le paramètre *use_last_error* à vrai active le même mécanisme pour le code d'erreur de Windows qui est géré par les fonctions :func:`GetLastError` et :func:`SetLastError` de l'API Windows ; :func:`ctypes.get_last_error` et :func:`ctypes.set_last_error` servent à obtenir et modifier la copie privée *ctypes* de ce code d'erreur.

source: The *winmode* parameter is used on Windows to specify how the library is loaded (since *mode* is ignored). It takes any value that is valid for the Win32 API ``LoadLibraryEx`` flags parameter. When omitted, the default is to use the flags that result in the most secure DLL load to avoiding issues such as DLL hijacking. Passing the full path to the DLL is the safest way to ensure the correct library and dependencies are loaded.
fr: Sous Windows, le paramètre *winmode* définit comment charger la bibliothèque (puisque *mode* est ignoré). Il accepte toute valeur compatible avec le drapeau ``LoadLibraryEx`` de l'API Win32. Lorsqu'il est omis, les drapeaux par défaut sont ceux qui chargent la DLL de la manière la plus sécurisée possible, afin d'éviter des problèmes comme le détournement de DLL. Passer le chemin complet à la DLL reste le moyen le plus sûr de s'assurer que la bonne bibliothèque et les bonnes dépendances sont chargées.

source: Added *winmode* parameter.
fr: Ajout du paramètre *winmode*.

source: Flag to use as *mode* parameter. On platforms where this flag is not available, it is defined as the integer zero.
fr: Valeur possible pour le paramètre *mode*. Vaut zéro sur les plates-formes où ce drapeau n'est pas disponible.

source: Flag to use as *mode* parameter. On platforms where this is not available, it is the same as *RTLD_GLOBAL*.
fr: Valeur possible pour le paramètre *mode*. Vaut *RTLD_GLOBAL* sur les plates-formes où ce drapeau n'est pas disponible.

source: The default mode which is used to load shared libraries. On OSX 10.3, this is *RTLD_GLOBAL*, otherwise it is the same as *RTLD_LOCAL*.
fr: Mode de chargement par défaut des bibliothèques partagées. Vaut *RTLD_GLOBAL* sur OSX 10.3 et *RTLD_LOCAL* sur les autres systèmes d'exploitation.

source: Instances of these classes have no public methods. Functions exported by the shared library can be accessed as attributes or by index. Please note that accessing the function through an attribute caches the result and therefore accessing it repeatedly returns the same object each time. On the other hand, accessing it through an index returns a new object each time::
fr: Les instances de ces classes n'ont pas de méthodes publiques ; on accède aux fonctions de la bibliothèque partagée par attribut ou par indiçage. Notez que les résultats des accès par attribut sont mis en cache, et donc des accès consécutifs renvoient à chaque fois le même objet. Accéder à une fonction par indice renvoie cependant chaque fois un nouvel objet :

source: The following public attributes are available, their name starts with an underscore to not clash with exported function names:
fr: Les attributs publics suivants sont disponibles, leur nom commence par un tiret bas pour éviter les conflits avec les noms des fonctions exportées :

source: The system handle used to access the library.
fr: Le lien système d'accès à la bibliothèque.

source: The name of the library passed in the constructor.
fr: Nom de la bibliothèque donné au constructeur.

source: Shared libraries can also be loaded by using one of the prefabricated objects, which are instances of the :class:`LibraryLoader` class, either by calling the :meth:`LoadLibrary` method, or by retrieving the library as attribute of the loader instance.
fr: Il est possible de charger une bibliothèque partagée soit en utilisant une instance de la classe :class:`LibraryLoader`, soit en appelant la méthode :meth:`LoadLibrary`, soit en récupérant la bibliothèque comme attribut de l'instance du chargeur.

source: Class which loads shared libraries. *dlltype* should be one of the :class:`CDLL`, :class:`PyDLL`, :class:`WinDLL`, or :class:`OleDLL` types.
fr: Classe pour charger une bibliothèque partagée. *dlltype* doit être de type :class:`CDLL`, :class:`PyDLL`, :class:`WinDLL` ou :class:`OleDLL`.

source: :meth:`__getattr__` has special behavior: It allows loading a shared library by accessing it as attribute of a library loader instance. The result is cached, so repeated attribute accesses return the same library each time.
fr: :meth:`__getattr__` a un comportement particulier : elle charge une bibliothèque quand on accède à un attribut du chargeur. Le résultat est mis en cache, donc des accès consécutifs renvoient la même bibliothèque à chaque fois.

source: Load a shared library into the process and return it. This method always returns a new instance of the library.
fr: Charge une bibliothèque partagée dans le processus et la renvoie. Cette méthode renvoie toujours une nouvelle instance de la bibliothèque.

source: These prefabricated library loaders are available:
fr: Plusieurs chargeurs sont fournis :

source: Creates :class:`CDLL` instances.
fr: Pour créer des instances de :class:`CDLL`.

source: Windows only: Creates :class:`WinDLL` instances.
fr: Pour créer des instances de :class:`WinDLL` (uniquement en Windows).

source: Windows only: Creates :class:`OleDLL` instances.
fr: Pour créer des instances de :class:`OleDLL` (uniquement en Windows).

source: Creates :class:`PyDLL` instances.
fr: Pour créer des instances de :class:`PyDLL`.

source: For accessing the C Python api directly, a ready-to-use Python shared library object is available:
fr: Il existe un moyen rapide d'accéder directement à l'API C Python :
