Repository: python/python-docs-fr
Catalog: library/ctypes.po
Languages: fr

source: :mod:`ctypes` --- A foreign function library for Python
fr: :mod:`ctypes` — Bibliothèque Python d'appels à des fonctions externes

source: :mod:`ctypes` is a foreign function library for Python. It provides C compatible data types, and allows calling functions in DLLs or shared libraries. It can be used to wrap these libraries in pure Python.
fr: :mod:`ctypes` est une bibliothèque d'appel à des fonctions externes en python. Elle fournit des types de données compatibles avec le langage C et permet d'appeler des fonctions depuis des DLL ou des bibliothèques partagées, rendant ainsi possible l'interfaçage de ces bibliothèques avec du pur code Python.

source: ctypes tutorial
fr: Didacticiel de *ctypes*

source: Note: The code samples in this tutorial use :mod:`doctest` to make sure that they actually work. Since some code samples behave differently under Linux, Windows, or macOS, they contain doctest directives in comments.
fr: Remarque : les exemples de code de ce didacticiel utilisent :mod:`doctest` pour s'assurer de leur propre bon fonctionnement. Vu que certains de ces exemples ont un comportement différent en Linux, Windows ou macOS, ils contiennent des directives *doctest* dans les commentaires.

source: Note: Some code samples reference the ctypes :class:`c_int` type. On platforms where ``sizeof(long) == sizeof(int)`` it is an alias to :class:`c_long`. So, you should not be confused if :class:`c_long` is printed if you would expect :class:`c_int` --- they are actually the same type.
fr: Remarque : le type :class:`c_int` du module apparaît dans certains de ces exemples. Sur les plates-formes où ``sizeof(long) == sizeof(int)``, ce type est un alias de :class:`c_long`. Ne soyez donc pas surpris si :class:`c_long` s'affiche là où vous vous attendiez à :class:`c_int` — il s'agit bien du même type.

source: Loading dynamic link libraries
fr: Chargement des DLL

source: :mod:`ctypes` exports the *cdll*, and on Windows *windll* and *oledll* objects, for loading dynamic link libraries.
fr: :mod:`ctypes` fournit l'objet *cdll* pour charger des bibliothèques à liens dynamiques (et les objets *windll* et *oledll* en Windows).

source: You load libraries by accessing them as attributes of these objects. *cdll* loads libraries which export functions using the standard ``cdecl`` calling convention, while *windll* libraries call functions using the ``stdcall`` calling convention. *oledll* also uses the ``stdcall`` calling convention, and assumes the functions return a Windows :c:type:`HRESULT` error code. The error code is used to automatically raise an :class:`OSError` exception when the function call fails.
fr: Une bibliothèque se charge en y accédant comme un attribut de ces objets. *cdll* charge les bibliothèques qui exportent des fonctions utilisant la convention d'appel standard ``cdecl``, alors que les bibliothèques qui se chargent avec *windll* utilisent la convention d'appel ``stdcall``. *oledll* utilise elle aussi la convention ``stdcall`` et suppose que les fonctions renvoient un code d'erreur :c:type:`HRESULT` de Windows. Ce code d'erreur est utilisé pour lever automatiquement une :class:`OSError` quand l'appel de la fonction échoue.

source: Windows errors used to raise :exc:`WindowsError`, which is now an alias of :exc:`OSError`.
fr: En Windows, les erreurs levaient auparavant une :exc:`WindowsError`, qui est maintenant un alias de :exc:`OSError`.

source: Here are some examples for Windows. Note that ``msvcrt`` is the MS standard C library containing most standard C functions, and uses the cdecl calling convention::
fr: Voici quelques exemples Windows. ``msvcrt`` est la bibliothèque standard C de Microsoft qui contient la plupart des fonctions standards C. Elle suit la convention d'appel *cdecl* ::

source: Windows appends the usual ``.dll`` file suffix automatically.
fr: Windows ajoute le suffixe habituel ``.dll`` automatiquement.

source: Accessing the standard C library through ``cdll.msvcrt`` will use an outdated version of the library that may be incompatible with the one being used by Python. Where possible, use native Python functionality, or else import and use the ``msvcrt`` module.
fr: Accéder à la bibliothèque standard C par ``cdll.msvcrt`` utilise une version obsolète de la bibliothèque qui peut avoir des problèmes de compatibilité avec celle que Python utilise. Si possible, mieux vaut utiliser la fonctionnalité native de Python, ou bien importer et utiliser le module ``msvcrt``.

source: On Linux, it is required to specify the filename *including* the extension to load a library, so attribute access can not be used to load libraries. Either the :meth:`LoadLibrary` method of the dll loaders should be used, or you should load the library by creating an instance of CDLL by calling the constructor::
fr: Pour charger une bibliothèque en Linux, il faut passer le nom du fichier *avec* son extension. Il est donc impossible de charger une bibliothèque en accédant à un attribut. Il faut utiliser la méthode :meth:`LoadLibrary` des chargeurs de DLL, ou bien charger la bibliothèque en créant une instance de *CDLL* en appelant son constructeur ::

source: Accessing functions from loaded dlls
fr: Accès aux fonctions des DLL chargées

source: Functions are accessed as attributes of dll objects::
fr: Les fonctions sont alors des attributs des objets DLL ::

source: Note that win32 system dlls like ``kernel32`` and ``user32`` often export ANSI as well as UNICODE versions of a function. The UNICODE version is exported with an ``W`` appended to the name, while the ANSI version is exported with an ``A`` appended to the name. The win32 ``GetModuleHandle`` function, which returns a *module handle* for a given module name, has the following C prototype, and a macro is used to expose one of them as ``GetModuleHandle`` depending on whether UNICODE is defined or not::
fr: Les DLL des systèmes *win32* comme ``kernel32`` et ``user32`` exportent souvent une version ANSI et une version UNICODE d'une fonction. La version UNICODE est exportée avec un ``W`` à la fin, et la version ANSI avec un ``A``. La fonction *win32* ``GetModuleHandle``, qui renvoie un *gestionnaire de module* à partir de son nom, a le prototype C suivant (c'est une macro qui décide d'exporter l'une ou l'autre à travers ``GetModuleHandle``, selon qu'UNICODE est définie ou non) ::

source: *windll* does not try to select one of them by magic, you must access the version you need by specifying ``GetModuleHandleA`` or ``GetModuleHandleW`` explicitly, and then call it with bytes or string objects respectively.
fr: *windll* n'en choisit pas une par magie, il faut accéder à la bonne en écrivant explicitement ``GetModuleHandleA`` ou ``GetModuleHandleW`` et en les appelant ensuite avec des objets octets ou avec des chaînes de caractères, respectivement.

source: Sometimes, dlls export functions with names which aren't valid Python identifiers, like ``"??2@YAPAXI@Z"``. In this case you have to use :func:`getattr` to retrieve the function::
fr: Les DLL exportent parfois des fonctions dont les noms ne sont pas des identifiants Python valides, comme ``"??2@YAPAXI@Z"``. Dans ce cas, il faut utiliser :func:`getattr` pour accéder à la fonction ::

source: On Windows, some dlls export functions not by name but by ordinal. These functions can be accessed by indexing the dll object with the ordinal number::
fr: Sous Windows, certaines DLL exportent des fonctions à travers un indice plutôt qu'à travers un nom. On accède à une fonction en indiçant l'objet DLL avec son index ::

source: Calling functions
fr: Appel de fonctions

source: You can call these functions like any other Python callable. This example uses the ``time()`` function, which returns system time in seconds since the Unix epoch, and the ``GetModuleHandleA()`` function, which returns a win32 module handle.
fr: Ces fonctions s'appellent comme n'importe quel appelable Python. Cet exemple utilise la fonction ``time()``, qui renvoie le temps en secondes du système depuis l'*epoch* Unix, et la fonction ``GetModuleHandleA()``, qui renvoie un gestionnaire de module *win32*.

source: This example calls both functions with a ``NULL`` pointer (``None`` should be used as the ``NULL`` pointer)::
fr: Cet exemple appelle les deux fonctions avec un pointeur ``NULL`` (on utilise ``None`` pour passer un pointeur ``NULL``) ::

source: :exc:`ValueError` is raised when you call an ``stdcall`` function with the ``cdecl`` calling convention, or vice versa::
fr: Une :exc:`ValueError` est levée quand on appelle une fonction ``stdcall`` avec la convention d'appel ``cdecl`` et vice-versa ::

source: To find out the correct calling convention you have to look into the C header file or the documentation for the function you want to call.
fr: Pour déterminer la convention d'appel, il faut consulter l'en-tête C ou la documentation de la fonction à appeler.

source: On Windows, :mod:`ctypes` uses win32 structured exception handling to prevent crashes from general protection faults when functions are called with invalid argument values::
fr: En Windows, :mod:`ctypes` tire profit de la gestion structurée des exceptions (*structured exception handling*) *win32* pour empêcher les plantages dus à des interruptions, afin de préserver la protection globale (*general protection faults*) du système, lorsque des fonctions sont appelées avec un nombre incorrect d'arguments ::

source: There are, however, enough ways to crash Python with :mod:`ctypes`, so you should be careful anyway. The :mod:`faulthandler` module can be helpful in debugging crashes (e.g. from segmentation faults produced by erroneous C library calls).
fr: Cependant, il y a suffisamment de façons de faire planter Python avec :mod:`ctypes`, donc il faut être prudent dans tous les cas. Le module :mod:`faulthandler` est pratique pour déboguer les plantages (p. ex. dus à des erreurs de segmentation produites par des appels erronés à la bibliothèque C).

source: ``None``, integers, bytes objects and (unicode) strings are the only native Python objects that can directly be used as parameters in these function calls. ``None`` is passed as a C ``NULL`` pointer, bytes objects and strings are passed as pointer to the memory block that contains their data (:c:type:`char *` or :c:type:`wchar_t *`). Python integers are passed as the platforms default C :c:type:`int` type, their value is masked to fit into the C type.
fr: ``None``, les entiers, les objets octets et les chaînes de caractères (Unicode) sont les seuls types natifs de Python qui peuvent être directement passés en paramètres de ces appels de fonctions. ``None`` est passé comme le pointeur C ``NULL``, les objets octets et les chaînes de caractères sont passés comme un pointeur sur le bloc mémoire qui contient la donnée (:c:type:`char *` ou :c:type:`wchar_t *`). Les entiers Python sont passés comme le type C :c:type:`int` par défaut de la plate-forme, un masque étant appliqué pour qu'ils tiennent dans le type C.

source: Before we move on calling functions with other parameter types, we have to learn more about :mod:`ctypes` data types.
fr: Avant de poursuivre sur l'appel de fonctions avec d'autres types de paramètres, apprenons-en un peu plus sur les types de données de :mod:`ctypes`.

source: Fundamental data types
fr: Types de données de base

source: :mod:`ctypes` defines a number of primitive C compatible data types:
fr: :mod:`ctypes` définit plusieurs types de donnée de base compatibles avec le C :

source: ctypes type
fr: Types de *ctypes*

source: C type
fr: Type C

source: Python type
fr: Type Python

source: 1-character bytes object
fr: objet octet (*bytes*) de 1 caractère

source: 1-character string
fr: chaîne de caractères (*string*) de longueur 1

source: :c:type:`__int64` or :c:type:`long long`
fr: :c:type:`__int64` ou :c:type:`long long`

source: :c:type:`unsigned __int64` or :c:type:`unsigned long long`
fr: :c:type:`unsigned __int64` ou :c:type:`unsigned long long`

source: :c:type:`ssize_t` or :c:type:`Py_ssize_t`
fr: :c:type:`ssize_t` ou :c:type:`Py_ssize_t`

source: :c:type:`char *` (NUL terminated)
fr: :c:type:`char *` (terminé par NUL)

source: bytes object or ``None``
fr: objet octet (*bytes*) ou ``None``

source: :c:type:`wchar_t *` (NUL terminated)
fr: :c:type:`wchar_t *` (terminé par NUL)

source: string or ``None``
fr: chaîne de caractères (*string*) ou ``None``

source: int or ``None``
fr: *int* ou ``None``

source: The constructor accepts any object with a truth value.
fr: Le constructeur accepte n'importe quel objet convertible en booléen.

source: All these types can be created by calling them with an optional initializer of the correct type and value::
fr: Il est possible de créer chacun de ces types en les appelant avec une valeur d'initialisation du bon type et avec une valeur cohérente ::

source: Since these types are mutable, their value can also be changed afterwards::
fr: Ces types étant des muables, leur valeur peut aussi être modifiée après coup ::

source: Assigning a new value to instances of the pointer types :class:`c_char_p`, :class:`c_wchar_p`, and :class:`c_void_p` changes the *memory location* they point to, *not the contents* of the memory block (of course not, because Python bytes objects are immutable)::
fr: Affecter une nouvelle valeur à une instance de type pointeur — :class:`c_char_p`, :class:`c_wchar_p` et :class:`c_void_p` — change *la zone mémoire* sur laquelle elle pointe, et non *le contenu* de ce bloc mémoire (c'est logique parce que les objets octets sont immuables en Python) ::

source: You should be careful, however, not to pass them to functions expecting pointers to mutable memory. If you need mutable memory blocks, ctypes has a :func:`create_string_buffer` function which creates these in various ways. The current memory block contents can be accessed (or changed) with the ``raw`` property; if you want to access it as NUL terminated string, use the ``value`` property::
fr: Cependant, prenez garde à ne pas en passer à des fonctions qui prennent en paramètre des pointeurs sur de la mémoire modifiable. S'il vous faut de la mémoire modifiable, *ctypes* fournit la fonction :func:`create_string_buffer` qui en crée de plusieurs façons. L'attribut ``raw`` permet d'accéder à (ou de modifier) un bloc mémoire ; l'attribut ``value`` permet d'y accéder comme à une chaîne de caractères terminée par NUL ::

source: The :func:`create_string_buffer` function replaces the :func:`c_buffer` function (which is still available as an alias), as well as the :func:`c_string` function from earlier ctypes releases. To create a mutable memory block containing unicode characters of the C type :c:type:`wchar_t` use the :func:`create_unicode_buffer` function.
fr: La fonction :func:`create_string_buffer` remplace les fonctions :func:`c_buffer` (qui en reste un alias) et :func:`c_string` des versions antérieures de *ctypes*. La fonction :func:`create_unicode_buffer` crée un bloc mémoire modifiable contenant des caractères Unicode du type C :c:type:`wchar_t`.

source: Calling functions, continued
fr: Appel de fonctions, suite

source: Note that printf prints to the real standard output channel, *not* to :data:`sys.stdout`, so these examples will only work at the console prompt, not from within *IDLE* or *PythonWin*::
fr: *printf* utilise la vraie sortie standard, et non :data:`sys.stdout` ; les exemples suivants ne fonctionnent donc que dans une invite de commande et non depuis *IDLE* or *PythonWin* ::

source: As has been mentioned before, all Python types except integers, strings, and bytes objects have to be wrapped in their corresponding :mod:`ctypes` type, so that they can be converted to the required C data type::
fr: Comme mentionné plus haut, tous les types Python (les entiers, les chaînes de caractères et les objets octet exceptés) doivent être encapsulés dans leur type :mod:`ctypes` correspondant pour pouvoir être convertis dans le type C requis ::

source: Calling functions with your own custom data types
fr: Appel de fonctions avec des types de données personnalisés

source: You can also customize :mod:`ctypes` argument conversion to allow instances of your own classes be used as function arguments. :mod:`ctypes` looks for an :attr:`_as_parameter_` attribute and uses this as the function argument. Of course, it must be one of integer, string, or bytes::
fr: Il est possible de personnaliser la conversion des arguments effectuée par :mod:`ctypes` pour permettre de passer en argument des instances de vos propres classes. :mod:`ctypes` recherche un attribut :attr:`_as_parameter_` et le prend comme argument à la fonction. Bien entendu, cet attribut doit être un entier, une chaîne de caractères ou des octets ::

source: If you don't want to store the instance's data in the :attr:`_as_parameter_` instance variable, you could define a :class:`property` which makes the attribute available on request.
fr: Si vous ne souhaitez pas stocker les données de l'instance dans la variable :attr:`_as_parameter_` de l'instance, vous pouvez toujours définir une :class:`propriété <property>` qui rend cet attribut disponible sur demande.

source: Specifying the required argument types (function prototypes)
fr: Définition du type des arguments nécessaires (prototypes de fonction)

source: It is possible to specify the required argument types of functions exported from DLLs by setting the :attr:`argtypes` attribute.
fr: Il est possible de définir le type des arguments demandés par une fonction exportée depuis une DLL en définissant son attribut :attr:`argtypes`.

source: :attr:`argtypes` must be a sequence of C data types (the ``printf`` function is probably not a good example here, because it takes a variable number and different types of parameters depending on the format string, on the other hand this is quite handy to experiment with this feature)::
fr: :attr:`argtypes` doit être une séquence de types de données C (la fonction ``printf`` n'est probablement pas le meilleur exemple pour l'illustrer, car elle accepte un nombre variable d'arguments de types eux aussi variables, selon la chaîne de formatage ; cela dit, elle se révèle pratique pour tester cette fonctionnalité) ::

source: Specifying a format protects against incompatible argument types (just as a prototype for a C function), and tries to convert the arguments to valid types::
fr: Définir un format empêche de passer des arguments de type incompatible (comme le fait le prototype d'une fonction C) et tente de convertir les arguments en des types valides ::

source: If you have defined your own classes which you pass to function calls, you have to implement a :meth:`from_param` class method for them to be able to use them in the :attr:`argtypes` sequence. The :meth:`from_param` class method receives the Python object passed to the function call, it should do a typecheck or whatever is needed to make sure this object is acceptable, and then return the object itself, its :attr:`_as_parameter_` attribute, or whatever you want to pass as the C function argument in this case. Again, the result should be an integer, string, bytes, a :mod:`ctypes` instance, or an object with an :attr:`_as_parameter_` attribute.
fr: Pour appeler une fonction avec votre propre classe définie dans la séquence :attr:`argtypes`, il est nécessaire d'implémenter une méthode de classe :meth:`from_param`. La méthode de classe :meth:`from_param` récupère l'objet Python passé à la fonction et doit faire une vérification de type ou tout ce qui est nécessaire pour s'assurer que l'objet est valide, puis renvoie l'objet lui-même, son attribut :attr:`_as_parameter_`, ou tout ce que vous voulez passer comme argument fonction C dans ce cas. Encore une fois, il convient que le résultat soit un entier, une chaîne, des octets, une instance :mod:`ctypes` ou un objet avec un attribut :attr:`_as_parameter_`.

source: Return types
fr: Types de sortie

source: By default functions are assumed to return the C :c:type:`int` type. Other return types can be specified by setting the :attr:`restype` attribute of the function object.
fr: Le module suppose que toutes les fonctions renvoient par défaut un :c:type:`int` C. Pour préciser un autre type de sortie, il faut définir l'attribut :attr:`restype` de l'objet encapsulant la fonction.

source: Here is a more advanced example, it uses the ``strchr`` function, which expects a string pointer and a char, and returns a pointer to a string::
fr: Voici un exemple plus poussé. Celui-ci utilise la fonction ``strchr``, qui prend en paramètres un pointeur vers une chaîne et un caractère. Elle renvoie un pointeur sur une chaîne de caractères ::

source: If you want to avoid the ``ord("x")`` calls above, you can set the :attr:`argtypes` attribute, and the second argument will be converted from a single character Python bytes object into a C char::
fr: Pour économiser l'appel ``ord("x")``, il est possible de définir l'attribut :attr:`argtypes` ; le second argument, un objet octet à un seul caractère, sera automatiquement converti en un caractère C ::

source: You can also use a callable Python object (a function or a class for example) as the :attr:`restype` attribute, if the foreign function returns an integer. The callable will be called with the *integer* the C function returns, and the result of this call will be used as the result of your function call. This is useful to check for error return values and automatically raise an exception::
fr: Si la fonction à interfacer renvoie un entier, l'attribut :attr:`restype` peut aussi être un appelable (une fonction ou une classe par exemple). Dans ce cas, l'appelable est appelé avec l'entier renvoyé par la fonction et le résultat de cet appel sera le résultat final de l'appel à la fonction. C'est pratique pour vérifier les codes d'erreurs des valeurs de retour et lever automatiquement des exceptions ::

source: ``WinError`` is a function which will call Windows ``FormatMessage()`` api to get the string representation of an error code, and *returns* an exception. ``WinError`` takes an optional error code parameter, if no one is used, it calls :func:`GetLastError` to retrieve it.
fr: ``WinError`` appelle l'API Windows ``FormatMessage()`` pour obtenir une représentation de la chaîne de caractères qui correspond au code d'erreur, et *renvoie* une exception. ``WinError`` prend en paramètre — optionnel — le code d'erreur. Si celui-ci n'est pas passé, elle appelle :func:`GetLastError` pour le récupérer.

source: Please note that a much more powerful error checking mechanism is available through the :attr:`errcheck` attribute; see the reference manual for details.
fr: Notez cependant que l'attribut :attr:`errcheck` permet de vérifier bien plus efficacement les erreurs ; référez-vous au manuel de référence pour plus de précisions.

source: Passing pointers (or: passing parameters by reference)
fr: Passage de pointeurs (passage de paramètres par référence)

source: Sometimes a C api function expects a *pointer* to a data type as parameter, probably to write into the corresponding location, or if the data is too large to be passed by value. This is also known as *passing parameters by reference*.
fr: Il arrive qu'une fonction C du code à interfacer requière un *pointeur* vers un certain type de donnée en paramètre, typiquement pour écrire à l'endroit correspondant ou si la donnée est trop grande pour pouvoir être passée par valeur. Ce mécanisme est appelé *passage de paramètres par référence*.
