Repository: python/python-docs-fr
Catalog: library/ctypes.po
Languages: fr

source: :mod:`ctypes` exports the :func:`byref` function which is used to pass parameters by reference. The same effect can be achieved with the :func:`pointer` function, although :func:`pointer` does a lot more work since it constructs a real pointer object, so it is faster to use :func:`byref` if you don't need the pointer object in Python itself::
fr: :mod:`ctypes` contient la fonction :func:`byref` qui permet de passer des paramètres par référence. La fonction :func:`pointer` a la même utilité, mais fait plus de travail car :func:`pointer` construit un véritable objet pointeur. Ainsi, si vous n'avez pas besoin de cet objet dans votre code Python, utiliser :func:`byref` est plus performant ::

source: Structures and unions
fr: Structures et unions

source: Structures and unions must derive from the :class:`Structure` and :class:`Union` base classes which are defined in the :mod:`ctypes` module. Each subclass must define a :attr:`_fields_` attribute. :attr:`_fields_` must be a list of *2-tuples*, containing a *field name* and a *field type*.
fr: Les structures et les unions doivent hériter des classes de base :class:`Structure` et :class:`Union` définies dans le module :mod:`ctypes`. Chaque sous-classe doit définir un attribut :attr:`_fields_`. :attr:`_fields_` doit être une liste de *paires*, contenant un *nom de champ* et un *type de champ*.

source: The field type must be a :mod:`ctypes` type like :class:`c_int`, or any other derived :mod:`ctypes` type: structure, union, array, pointer.
fr: Le type de champ doit être un type :mod:`ctypes` comme :class:`c_int` ou un type :mod:`ctypes` dérivé : structure, union, tableau ou pointeur.

source: Here is a simple example of a POINT structure, which contains two integers named *x* and *y*, and also shows how to initialize a structure in the constructor::
fr: Voici un exemple simple : une structure POINT qui contient deux entiers *x* et *y* et qui montre également comment instancier une structure avec le constructeur ::

source: You can, however, build much more complicated structures. A structure can itself contain other structures by using a structure as a field type.
fr: Il est bien entendu possible de créer des structures plus complexes. Une structure peut elle-même contenir d'autres structures en prenant une structure comme type de champ.

source: Here is a RECT structure which contains two POINTs named *upperleft* and *lowerright*::
fr: Voici une structure RECT qui contient deux POINTs *upperleft* et *lowerright* ::

source: Nested structures can also be initialized in the constructor in several ways::
fr: Une structure encapsulée peut être instanciée par un constructeur de plusieurs façons ::

source: Field :term:`descriptor`\s can be retrieved from the *class*, they are useful for debugging because they can provide useful information::
fr: Il est possible de récupérer les :term:`descripteurs <descriptor>` des champs depuis la *classe*. Ils sont importants pour déboguer car ils contiennent des informations utiles ::

source: :mod:`ctypes` does not support passing unions or structures with bit-fields to functions by value. While this may work on 32-bit x86, it's not guaranteed by the library to work in the general case. Unions and structures with bit-fields should always be passed to functions by pointer.
fr: :mod:`ctypes` ne prend pas en charge le passage par valeur des unions ou des structures avec des champs de bits. Bien que cela puisse fonctionner sur des architectures 32 bits avec un jeu d'instructions x86, ce n'est pas garanti par la bibliothèque en général. Les unions et les structures avec des champs de bits doivent toujours être passées par pointeur.

source: Structure/union alignment and byte order
fr: Alignement et boutisme des structures et des unions

source: By default, Structure and Union fields are aligned in the same way the C compiler does it. It is possible to override this behavior by specifying a :attr:`_pack_` class attribute in the subclass definition. This must be set to a positive integer and specifies the maximum alignment for the fields. This is what ``#pragma pack(n)`` also does in MSVC.
fr: Par défaut les champs d'une *Structure* ou d'une *Union* sont alignés de la même manière que le ferait un compilateur C. Ce comportement peut être redéfini en définissant l'attribut :attr:`_pack_` dans la définition de la sous-classe. Ce champ doit être un entier positif et vaut l'alignement maximal des champs. C'est ce que fait ``#pragma pack(n)`` pour MSVC.

source: :mod:`ctypes` uses the native byte order for Structures and Unions. To build structures with non-native byte order, you can use one of the :class:`BigEndianStructure`, :class:`LittleEndianStructure`, :class:`BigEndianUnion`, and :class:`LittleEndianUnion` base classes. These classes cannot contain pointer fields.
fr: :mod:`ctypes` suit le boutisme natif pour les *Structure* et les *Union*. Pour construire des structures avec un boutisme différent, utilisez les classes de base :class:`BigEndianStructure`, :class:`LittleEndianStructure`, :class:`BigEndianUnion` ou :class:`LittleEndianUnion`. Ces classes ne peuvent pas avoir de champ pointeur.

source: Bit fields in structures and unions
fr: Champs de bits dans les structures et les unions

source: It is possible to create structures and unions containing bit fields. Bit fields are only possible for integer fields, the bit width is specified as the third item in the :attr:`_fields_` tuples::
fr: Il est possible de créer des structures et des unions contenant des champs de bits. Seuls les entiers peuvent être des champs de bits, le nombre de bits est défini dans le troisième champ du *n*-uplet :attr:`_fields_` ::

source: Arrays
fr: Tableaux

source: Arrays are sequences, containing a fixed number of instances of the same type.
fr: Les tableaux sont des séquences qui contiennent un nombre fixe d'instances du même type.

source: The recommended way to create array types is by multiplying a data type with a positive integer::
fr: La meilleure façon de créer des tableaux consiste à multiplier le type de donnée par un entier positif ::

source: Here is an example of a somewhat artificial data type, a structure containing 4 POINTs among other stuff::
fr: Voici un exemple — un peu artificiel — d'une structure contenant, entre autres, 4 POINTs ::

source: Instances are created in the usual way, by calling the class::
fr: Comme d'habitude, on crée les instances en appelant la classe ::

source: The above code print a series of ``0 0`` lines, because the array contents is initialized to zeros.
fr: Le code précédent affiche une suite de ``0 0`` car le contenu du tableau est initialisé avec des zéros.

source: Initializers of the correct type can also be specified::
fr: Des valeurs d'initialisation du bon type peuvent être passées ::

source: Pointers
fr: Pointeurs

source: Pointer instances are created by calling the :func:`pointer` function on a :mod:`ctypes` type::
fr: On crée une instance de pointeur en appelant la fonction :func:`pointer` sur un type :mod:`ctypes` ::

source: Pointer instances have a :attr:`~_Pointer.contents` attribute which returns the object to which the pointer points, the ``i`` object above::
fr: Les instances de pointeurs ont un attribut :attr:`~_Pointer.contents` qui renvoie l'objet pointé (l'objet ``i`` ci-dessus) ::

source: Note that :mod:`ctypes` does not have OOR (original object return), it constructs a new, equivalent object each time you retrieve an attribute::
fr: Attention, :mod:`ctypes` ne fait pas de ROI (retour de l'objet initial). Il crée un nouvel objet à chaque fois qu'on accède à un attribut ::

source: Assigning another :class:`c_int` instance to the pointer's contents attribute would cause the pointer to point to the memory location where this is stored::
fr: Affecter une autre instance de :class:`c_int` à l'attribut *contents* du pointeur fait pointer le pointeur vers l'adresse mémoire de cette nouvelle instance ::

source: Pointer instances can also be indexed with integers::
fr: Il est possible d'indexer les pointeurs par des entiers ::

source: Assigning to an integer index changes the pointed to value::
fr: Affecter à travers un indice change la valeur pointée ::

source: It is also possible to use indexes different from 0, but you must know what you're doing, just as in C: You can access or change arbitrary memory locations. Generally you only use this feature if you receive a pointer from a C function, and you *know* that the pointer actually points to an array instead of a single item.
fr: Si vous êtes sûr de vous, vous pouvez utiliser d'autres valeurs que 0, comme en C : il est ainsi possible de modifier une zone mémoire de votre choix. De manière générale cette fonctionnalité ne s'utilise que sur un pointeur renvoyé par une fonction C, pointeur que vous *savez* pointer vers un tableau et non sur un seul élément.

source: Behind the scenes, the :func:`pointer` function does more than simply create pointer instances, it has to create pointer *types* first. This is done with the :func:`POINTER` function, which accepts any :mod:`ctypes` type, and returns a new type::
fr: Sous le capot, la fonction :func:`pointer` fait plus que simplement créer une instance de pointeur ; elle doit d'abord créer un type « pointeur sur… ». Cela s'effectue avec la fonction :func:`POINTER`, qui prend en paramètre n'importe quel type :mod:`ctypes` et renvoie un nouveau type ::

source: Calling the pointer type without an argument creates a ``NULL`` pointer. ``NULL`` pointers have a ``False`` boolean value::
fr: Appeler le pointeur sur type sans arguments crée un pointeur ``NULL``. Les pointeurs ``NULL`` s'évaluent à ``False`` ::

source: :mod:`ctypes` checks for ``NULL`` when dereferencing pointers (but dereferencing invalid non-\ ``NULL`` pointers would crash Python)::
fr: :mod:`ctypes` vérifie que le pointeur n'est pas ``NULL`` quand il en déréférence un (mais déréférencer des pointeurs non ``NULL`` invalides fait planter Python) ::

source: Type conversions
fr: Conversions de type

source: Usually, ctypes does strict type checking. This means, if you have ``POINTER(c_int)`` in the :attr:`argtypes` list of a function or as the type of a member field in a structure definition, only instances of exactly the same type are accepted. There are some exceptions to this rule, where ctypes accepts other objects. For example, you can pass compatible array instances instead of pointer types. So, for ``POINTER(c_int)``, ctypes accepts an array of c_int::
fr: En général, *ctypes* respecte un typage fort. Cela signifie que si un ``POINTER(c_int)`` est présent dans la liste des :attr:`argtypes` d'une fonction ou est le type d'un attribut membre dans une définition de structure, seules des instances de ce type seront valides. Cette règle comporte quelques exceptions pour lesquelles *ctypes* accepte d'autres objets. Par exemple il est possible de passer des instances de tableau à place de pointeurs, s'ils sont compatibles. Dans le cas de ``POINTER(c_int)``, *ctypes* accepte des tableaux de *c_int* ::

source: In addition, if a function argument is explicitly declared to be a pointer type (such as ``POINTER(c_int)``) in :attr:`argtypes`, an object of the pointed type (``c_int`` in this case) can be passed to the function. ctypes will apply the required :func:`byref` conversion in this case automatically.
fr: De plus, si un paramètre de fonction est déclaré explicitement de type pointeur (comme ``POINTER(c_int)``) dans les :attr:`argtypes`, il est aussi possible de passer un objet du type pointé — ici, ``c_int`` — à la fonction. *ctypes* appelle alors automatiquement la fonction de conversion :func:`byref`.

source: To set a POINTER type field to ``NULL``, you can assign ``None``::
fr: Pour mettre un champ de type *POINTER* à ``NULL``, il faut lui affecter ``None`` ::

source: Sometimes you have instances of incompatible types. In C, you can cast one type into another type. :mod:`ctypes` provides a :func:`cast` function which can be used in the same way. The ``Bar`` structure defined above accepts ``POINTER(c_int)`` pointers or :class:`c_int` arrays for its ``values`` field, but not instances of other types::
fr: Parfois il faut gérer des incompatibilités entre les types. En C, il est possible de convertir un type en un autre. :mod:`ctypes` fournit la fonction :func:`cast` qui permet la même chose. La structure ``Bar`` ci-dessus accepte des pointeurs ``POINTER(c_int)`` ou des tableaux de :class:`c_int` comme valeur pour le champ ``values``, mais pas des instances d'autres types ::

source: For these cases, the :func:`cast` function is handy.
fr: C'est là que la fonction :func:`cast` intervient.

source: The :func:`cast` function can be used to cast a ctypes instance into a pointer to a different ctypes data type. :func:`cast` takes two parameters, a ctypes object that is or can be converted to a pointer of some kind, and a ctypes pointer type. It returns an instance of the second argument, which references the same memory block as the first argument::
fr: La fonction :func:`cast` permet de convertir une instance de *ctypes* en un pointeur vers un type de données *ctypes* différent. :func:`cast` prend deux paramètres : un objet *ctypes* qui est, ou qui peut être converti en, un certain pointeur et un type pointeur de *ctypes*. Elle renvoie une instance du second argument, qui pointe sur le même bloc mémoire que le premier argument ::

source: So, :func:`cast` can be used to assign to the ``values`` field of ``Bar`` the structure::
fr: Ainsi, la fonction :func:`cast` permet de remplir le champ ``values`` de la structure ``Bar`` ::

source: Incomplete Types
fr: Types incomplets

source: *Incomplete Types* are structures, unions or arrays whose members are not yet specified. In C, they are specified by forward declarations, which are defined later::
fr: Un *type incomplet* est une structure, une union ou un tableau dont les membres ne sont pas encore définis. C'est l'équivalent d'une déclaration avancée en C, où la définition est fournie plus tard ::

source: The straightforward translation into ctypes code would be this, but it does not work::
fr: Une traduction naïve, mais invalide, en code *ctypes* ressemblerait à ça ::

source: because the new ``class cell`` is not available in the class statement itself. In :mod:`ctypes`, we can define the ``cell`` class and set the :attr:`_fields_` attribute later, after the class statement::
fr: Cela ne fonctionne pas parce que la nouvelle ``class cell`` n'est pas accessible dans la définition de la classe elle-même. Dans le module :mod:`ctypes`, on définit la classe ``cell`` et on définira les :attr:`_fields_` plus tard, après avoir défini la classe ::

source: Let's try it. We create two instances of ``cell``, and let them point to each other, and finally follow the pointer chain a few times::
fr: Essayons. Nous créons deux instances de ``cell``, les faisons pointer l'une sur l'autre et enfin nous suivons quelques maillons de la chaîne de pointeurs ::

source: Callback functions
fr: Fonctions de rappel

source: :mod:`ctypes` allows creating C callable function pointers from Python callables. These are sometimes called *callback functions*.
fr: :mod:`ctypes` permet de créer des pointeurs de fonctions appelables par des appelables Python. On les appelle parfois *fonctions de rappel*.

source: First, you must create a class for the callback function. The class knows the calling convention, the return type, and the number and types of arguments this function will receive.
fr: Tout d'abord, il faut créer une classe pour la fonction de rappel. La classe connaît la convention d'appel, le type de retour ainsi que le nombre et le type de paramètres que la fonction accepte.

source: The :func:`CFUNCTYPE` factory function creates types for callback functions using the ``cdecl`` calling convention. On Windows, the :func:`WINFUNCTYPE` factory function creates types for callback functions using the ``stdcall`` calling convention.
fr: La fabrique :func:`CFUNCTYPE` crée un type pour les fonctions de rappel qui suivent la convention d'appel ``cdecl``. En Windows, c'est la fabrique :func:`WINFUNCTYPE` qui crée un type pour les fonctions de rappel qui suivent la convention d'appel ``stdcall``.

source: Both of these factory functions are called with the result type as first argument, and the callback functions expected argument types as the remaining arguments.
fr: Le premier paramètre de ces deux fonctions est le type de retour, et les suivants sont les types des arguments qu'attend la fonction de rappel.

source: I will present an example here which uses the standard C library's :c:func:`qsort` function, that is used to sort items with the help of a callback function. :c:func:`qsort` will be used to sort an array of integers::
fr: Intéressons-nous à un exemple tiré de la bibliothèque standard C : la fonction :c:func:`qsort`. Celle-ci permet de classer des éléments par l'emploi d'une fonction de rappel. Nous allons utiliser :c:func:`qsort` pour ordonner un tableau d'entiers ::

source: :func:`qsort` must be called with a pointer to the data to sort, the number of items in the data array, the size of one item, and a pointer to the comparison function, the callback. The callback will then be called with two pointers to items, and it must return a negative integer if the first item is smaller than the second, a zero if they are equal, and a positive integer otherwise.
fr: :func:`qsort` doit être appelée avec un pointeur vers la donnée à ordonner, le nombre d'éléments dans la donnée, la taille d'un élément et un pointeur vers le comparateur, c.-à-d. la fonction de rappel. Cette fonction sera invoquée avec deux pointeurs sur deux éléments et doit renvoyer un entier négatif si le premier élément est plus petit que le second, zéro s'ils sont égaux et un entier positif sinon.

source: So our callback function receives pointers to integers, and must return an integer. First we create the ``type`` for the callback function::
fr: Ainsi notre fonction de rappel reçoit des pointeurs vers des entiers et doit renvoyer un entier. Créons d'abord le ``type`` pour la fonction de rappel ::

source: To get started, here is a simple callback that shows the values it gets passed::
fr: Pour commencer, voici une fonction de rappel simple qui affiche les valeurs qu'on lui passe ::

source: The result::
fr: Résultat ::

source: Now we can actually compare the two items and return a useful result::
fr: À présent, comparons pour de vrai les deux entiers et renvoyons un résultat utile ::

source: As we can easily check, our array is sorted now::
fr: Et comme il est facile de le voir, notre tableau est désormais classé ::

source: The function factories can be used as decorator factories, so we may as well write::
fr: Ces fonctions peuvent aussi être utilisées comme des décorateurs ; il est donc possible d'écrire ::

source: Make sure you keep references to :func:`CFUNCTYPE` objects as long as they are used from C code. :mod:`ctypes` doesn't, and if you don't, they may be garbage collected, crashing your program when a callback is made.
fr: Prenez garde à bien conserver une référence à un objet :func:`CFUNCTYPE` tant que celui-ci est utilisé par le code C. :mod:`ctypes` ne le fait pas tout seul et, si vous ne le faites pas, le ramasse-miette pourrait les libérer, ce qui fera planter votre programme quand un appel sera fait.

source: Also, note that if the callback function is called in a thread created outside of Python's control (e.g. by the foreign code that calls the callback), ctypes creates a new dummy Python thread on every invocation. This behavior is correct for most purposes, but it means that values stored with :class:`threading.local` will *not* survive across different callbacks, even when those calls are made from the same C thread.
fr: Notez aussi que si la fonction de rappel est appelée dans un fil d'exécution créé hors de Python (p. ex. par du code externe qui appelle la fonction de rappel), *ctypes* crée un nouveau fil Python « creux » à chaque fois. Ce comportement est acceptable pour la plupart des cas d'utilisation, mais cela implique que les valeurs stockées avec :class:`threading.local` ne seront *pas* persistantes d'un appel à l'autre, même si les appels proviennent du même fil d'exécution C.

source: Accessing values exported from dlls
fr: Accès aux variables exportées depuis une DLL

source: Some shared libraries not only export functions, they also export variables. An example in the Python library itself is the :c:data:`Py_OptimizeFlag`, an integer set to 0, 1, or 2, depending on the :option:`-O` or :option:`-OO` flag given on startup.
fr: Certaines bibliothèques ne se contentent pas d'exporter des fonctions, elles exportent aussi des variables. Par exemple, la bibliothèque Python exporte :c:data:`Py_OptimizeFlag`, un entier valant 0, 1, ou 2 selon que l'option :option:`-O` ou :option:`-OO` soit donnée au démarrage.

source: :mod:`ctypes` can access values like this with the :meth:`in_dll` class methods of the type. *pythonapi* is a predefined symbol giving access to the Python C api::
fr: :mod:`ctypes` peut accéder à ce type de valeurs avec les méthodes de classe :meth:`in_dll` du type considéré. *pythonapi* est un symbole prédéfini qui donne accès à l'API C Python ::

source: If the interpreter would have been started with :option:`-O`, the sample would have printed ``c_long(1)``, or ``c_long(2)`` if :option:`-OO` would have been specified.
fr: Si l'interpréteur est lancé avec :option:`-O`, l'exemple affiche ``c_long(1)`` et ``c_long(2)`` avec :option:`-OO`.

source: An extended example which also demonstrates the use of pointers accesses the :c:data:`PyImport_FrozenModules` pointer exported by Python.
fr: Le pointeur :c:data:`PyImport_FrozenModules` exposé par Python est un autre exemple complet de l'utilisation de pointeurs.

source: Quoting the docs for that value:
fr: Citons la documentation :

source: This pointer is initialized to point to an array of :c:type:`struct _frozen` records, terminated by one whose members are all ``NULL`` or zero. When a frozen module is imported, it is searched in this table. Third-party code could play tricks with this to provide a dynamically created collection of frozen modules.
fr: Ce pointeur est initialisé de manière à pointer sur un tableau d'entrées de :c:type:`struct _frozen`, dont tous les membres de la dernière valent ``NULL`` ou zéro. Quand un module figé est importé, il est cherché dans ce tableau. Du code tiers peut jouer avec pour construire dynamiquement une collection de module figés.

source: So manipulating this pointer could even prove useful. To restrict the example size, we show only how this table can be read with :mod:`ctypes`::
fr: Donc manipuler ce pointeur peut même se révéler utile. Pour limiter la taille de l'exemple, nous nous bornons à montrer comment lire ce tableau avec :mod:`ctypes` ::

source: We have defined the :c:type:`struct _frozen` data type, so we can get the pointer to the table::
fr: Le type de donnée :c:type:`struct _frozen` ayant été défini, nous pouvons récupérer le pointeur vers le tableau ::
