Repository: python/python-docs-fr
Catalog: library/ctypes.po
Languages: fr

source: An instance of :class:`PyDLL` that exposes Python C API functions as attributes. Note that all these functions are assumed to return C :c:type:`int`, which is of course not always the truth, so you have to assign the correct :attr:`restype` attribute to use these functions.
fr: Une instance de :class:`PyDLL` dont les attributs sont les fonctions exportées par l'API C Python. Toutes ces fonctions sont supposées renvoyer un :c:type:`int` C, ce qui n'est bien entendu pas toujours le cas. Il faut donc définir vous-même le bon attribut :attr:`restype` pour pouvoir les utiliser.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.dlopen`` with argument ``name``.
fr: Lève un :ref:`évènement d'audit <auditing>` ``ctypes.dlopen``, avec en argument ``name``.

source: Loading a library through any of these objects raises an :ref:`auditing event <auditing>` ``ctypes.dlopen`` with string argument ``name``, the name used to load the library.
fr: Charger une bibliothèque à l'aide d'un de ces objets avec en argument ``name``, le nom de la bibliothèque (une chaîne de caractères), lève un :ref:`évènement d'audit <auditing>` ``ctypes.dlopen``.

source: Accessing a function on a loaded library raises an auditing event ``ctypes.dlsym`` with arguments ``library`` (the library object) and ``name`` (the symbol's name as a string or integer).
fr: Accéder à une fonction d'une bibliothèque lève un évènement d'audit ``ctypes.dlsym`` avec ``library`` (l'objet bibliothèque) et ``name`` (le nom du symbole — une chaîne de caractères ou un entier) comme arguments.

source: In cases when only the library handle is available rather than the object, accessing a function raises an auditing event ``ctypes.dlsym/handle`` with arguments ``handle`` (the raw library handle) and ``name``.
fr: Si seul le lien sur la bibliothèque, et non l'objet, est disponible, accéder à une fonction lève l'évènement d'audit ``ctypes.dlsym/handle`` avec ``handle`` (le lien vers la bibliothèque) et ``name`` comme arguments.

source: Foreign functions
fr: Fonctions externes

source: As explained in the previous section, foreign functions can be accessed as attributes of loaded shared libraries. The function objects created in this way by default accept any number of arguments, accept any ctypes data instances as arguments, and return the default result type specified by the library loader. They are instances of a private class:
fr: Comme expliqué dans la section précédente, on peut accéder aux fonctions externes au travers des attributs des bibliothèques partagées. Un objet fonction créé de cette façon accepte par défaut un nombre quelconque d'arguments qui peuvent être de n'importe quel type de données *ctypes*. Il renvoie le type par défaut du chargeur de la bibliothèque. Ce sont des instances de la classe privée :

source: Base class for C callable foreign functions.
fr: Classe de base pour les fonctions externes C.

source: Instances of foreign functions are also C compatible data types; they represent C function pointers.
fr: Une instance de fonction externe est également un type de donnée compatible avec le C ; elle représente un pointeur vers une fonction.

source: This behavior can be customized by assigning to special attributes of the foreign function object.
fr: Son comportement peut-être personnalisé en réaffectant les attributs spécifiques de l'objet représentant la fonction externe.

source: Assign a ctypes type to specify the result type of the foreign function. Use ``None`` for :c:type:`void`, a function not returning anything.
fr: Fait correspondre le type de retour de la fonction externe à un type *ctypes*. Dans le cas où la fonction ne renvoie rien (:c:type:`void`), utilisez ``None``.

source: It is possible to assign a callable Python object that is not a ctypes type, in this case the function is assumed to return a C :c:type:`int`, and the callable will be called with this integer, allowing further processing or error checking. Using this is deprecated, for more flexible post processing or error checking use a ctypes data type as :attr:`restype` and assign a callable to the :attr:`errcheck` attribute.
fr: Il est aussi possible de passer n'importe quel un objet Python qui n'est pas un type *ctypes* pourvu qu'il soit appelable. Dans ce cas, la fonction est censée renvoyer un :c:type:`int` C et l'appelable sera appelé avec cet entier, ce qui permet ainsi de faire des actions supplémentaires comme vérifier un code d'erreur. Ce mécanisme est obsolète ; une façon plus souple de faire des actions supplémentaires ou de la vérification consiste à affecter un type *ctypes* à :attr:`restype` et à affecter un appelable à l'attribut :attr:`errcheck`.

source: Assign a tuple of ctypes types to specify the argument types that the function accepts. Functions using the ``stdcall`` calling convention can only be called with the same number of arguments as the length of this tuple; functions using the C calling convention accept additional, unspecified arguments as well.
fr: Fait correspondre le type des arguments que la fonction accepte avec un *n*-uplet de types *ctypes*. Les fonctions qui utilisent la convention d'appel ``stdcall`` ne peuvent être appelées qu'avec le même nombre d'arguments que la taille du *n*-uplet mais les fonctions qui utilisent la convention d'appel C acceptent aussi des arguments additionnels non-définis.

source: When a foreign function is called, each actual argument is passed to the :meth:`from_param` class method of the items in the :attr:`argtypes` tuple, this method allows adapting the actual argument to an object that the foreign function accepts. For example, a :class:`c_char_p` item in the :attr:`argtypes` tuple will convert a string passed as argument into a bytes object using ctypes conversion rules.
fr: À l'appel d'une fonction externe, chaque argument est passé à la méthode de classe :meth:`from_param` de l'élément correspondant dans le *n*-uplet des :attr:`argtypes`. Cette méthode convertit l'argument initial en un objet que la fonction externe peut comprendre. Par exemple, un :class:`c_char_p` dans le *n*-uplet des :attr:`argtypes` va transformer la chaîne de caractères passée en argument en un objet chaîne d'octets selon les règles de conversion *ctypes*.

source: New: It is now possible to put items in argtypes which are not ctypes types, but each item must have a :meth:`from_param` method which returns a value usable as argument (integer, string, ctypes instance). This allows defining adapters that can adapt custom objects as function parameters.
fr: Nouveau : il est maintenant possible de mettre des objets qui ne sont pas des types de *ctypes* dans les *argtypes*, mais ceux-ci doivent avoir une méthode :meth:`from_param` renvoyant une valeur qui peut être utilisée comme un argument (entier, chaîne de caractères ou instance *ctypes*). Ceci permet de créer des adaptateurs qui convertissent des objets arbitraires en des paramètres de fonction.

source: Assign a Python function or another callable to this attribute. The callable will be called with three or more arguments:
fr: Définit une fonction Python ou tout autre appelable qui sera appelé avec trois arguments ou plus :

source: *result* is what the foreign function returns, as specified by the :attr:`restype` attribute.
fr: *result* est la valeur de retour de la fonction externe, comme défini par l'attribut :attr:`restype`.

source: *func* is the foreign function object itself, this allows reusing the same callable object to check or post process the results of several functions.
fr: *func* est l'objet représentant la fonction externe elle-même. Cet accesseur permet de réutiliser le même appelable pour vérifier le résultat de plusieurs fonctions ou de faire des actions supplémentaires après leur exécution.

source: *arguments* is a tuple containing the parameters originally passed to the function call, this allows specializing the behavior on the arguments used.
fr: *arguments* est le *n*-uplet qui contient les paramètres initiaux passés à la fonction, ceci permet de spécialiser le comportement des arguments utilisés.

source: The object that this function returns will be returned from the foreign function call, but it can also check the result value and raise an exception if the foreign function call failed.
fr: L'objet renvoyé par cette fonction est celui renvoyé par l'appel de la fonction externe, mais il peut aussi vérifier la valeur du résultat et lever une exception si l'appel a échoué.

source: This exception is raised when a foreign function call cannot convert one of the passed arguments.
fr: Exception levée quand un appel à la fonction externe ne peut pas convertir un des arguments qu'elle a reçus.

source: On Windows, when a foreign function call raises a system exception (for example, due to an access violation), it will be captured and replaced with a suitable Python exception. Further, an auditing event ``ctypes.seh_exception`` with argument ``code`` will be raised, allowing an audit hook to replace the exception with its own.
fr: En Windows, quand un appel à une fonction externe lève une exception système (par exemple, une erreur de segmentation), celle-ci est interceptée pour être remplacée par l'exception Python correspondante. De plus, un évènement d'audit ``ctypes.seh_exception`` est levé avec ``code`` en argument, ce qui permet à un point d'entrée (*hook* en anglais) d'audit de remplacer l'exception par une des siennes.

source: Some ways to invoke foreign function calls may raise an auditing event ``ctypes.call_function`` with arguments ``function pointer`` and ``arguments``.
fr: Certaines manières d'appeler des fonction externes peuvent lever des évènements d'audit ``ctypes.call_function`` avec ``function pointer`` et ``arguments`` comme arguments.

source: Function prototypes
fr: Prototypes de fonction

source: Foreign functions can also be created by instantiating function prototypes. Function prototypes are similar to function prototypes in C; they describe a function (return type, argument types, calling convention) without defining an implementation. The factory functions must be called with the desired result type and the argument types of the function, and can be used as decorator factories, and as such, be applied to functions through the ``@wrapper`` syntax. See :ref:`ctypes-callback-functions` for examples.
fr: Il est aussi possible de créer des fonctions externes en instanciant des prototypes de fonction. Les prototypes de fonction ressemblent beaucoup aux prototypes de fonctions en C ; ils décrivent une fonction (type de retour, type des arguments, convention d'appel) sans préciser son implémentation. Les fabriques de fonctions prennent en entrée le type de retour et le type des arguments de la fonction, et peuvent être utilisées comme des décorateurs-fabrique et ainsi s'appliquer à des fonctions avec la syntaxe ``@décorateur``. Ceci est illustré dans la section :ref:`ctypes-callback-functions`.

source: The returned function prototype creates functions that use the standard C calling convention. The function will release the GIL during the call. If *use_errno* is set to true, the ctypes private copy of the system :data:`errno` variable is exchanged with the real :data:`errno` value before and after the call; *use_last_error* does the same for the Windows error code.
fr: Renvoie un prototype de fonction qui crée des fonctions qui suivent la convention d'appel standard C. Les fonctions libèreront le GIL lors de leur exécution. Si *use_errno* est vrai, la copie privée *ctypes* de la variable système :data:`errno` est échangée avec la vraie valeur de :data:`errno` avant et après l'appel ; *use_last_error* a le même effet sous Windows.

source: Windows only: The returned function prototype creates functions that use the ``stdcall`` calling convention, except on Windows CE where :func:`WINFUNCTYPE` is the same as :func:`CFUNCTYPE`. The function will release the GIL during the call. *use_errno* and *use_last_error* have the same meaning as above.
fr: En Windows seulement : renvoie un prototype de fonction qui crée des fonctions qui suivent la convention d'appel standard ``stdcall``, sauf sous Windows CE où :func:`WINFUNCTYPE` équivaut à :func:`CFUNCTYPE`. Les fonctions libèreront le GIL lors de leur exécution. *use_errno* et *use_last_error* ont la même signification que ci-dessus.

source: The returned function prototype creates functions that use the Python calling convention. The function will *not* release the GIL during the call.
fr: Renvoie un prototype de fonction qui crée des fonctions qui suivent la convention d'appel Python. Les fonctions ne libèreront *pas* le GIL lors de leur exécution.

source: Function prototypes created by these factory functions can be instantiated in different ways, depending on the type and number of the parameters in the call:
fr: Il y a plusieurs façons d'instancier les prototypes de fonction créés par ces fabriques, selon le type et le nombre de paramètres de l'appel :

source: Returns a foreign function at the specified address which must be an integer.
fr: Renvoie une fonction externe sur l'adresse donnée sous la forme d'un entier.

source: Create a C callable function (a callback function) from a Python *callable*.
fr: Crée une fonction appelable depuis du code C (une fonction de rappel) d'un appelable Python donné en paramètre.

source: Returns a foreign function exported by a shared library. *func_spec* must be a 2-tuple ``(name_or_ordinal, library)``. The first item is the name of the exported function as string, or the ordinal of the exported function as small integer. The second item is the shared library instance.
fr: Renvoie une fonction externe exposée par une bibliothèque partagée. *func_spec* est un couple ``(nom_ou_indice, bibliothèque)``. Le premier élément est le nom de la fonction à passer comme une chaîne ou bien son indice (dans la table des symboles) à passer comme un entier. Le second élément est l'instance de la bibliothèque partagée.

source: Returns a foreign function that will call a COM method. *vtbl_index* is the index into the virtual function table, a small non-negative integer. *name* is name of the COM method. *iid* is an optional pointer to the interface identifier which is used in extended error reporting.
fr: Renvoie une fonction qui appelle une méthode COM. *vtbl_index* est l'indice de la fonction dans la table virtuelle, un petit entier positif. *name* est le nom de la méthode COM. *iid* est un pointeur optionnel vers l'identificateur de plateforme, qui est utilisé dans la remontée d'erreurs étendue.

source: COM methods use a special calling convention: They require a pointer to the COM interface as first argument, in addition to those parameters that are specified in the :attr:`argtypes` tuple.
fr: Les méthodes COM ont une convention d'appel particulière : elles requièrent de passer un pointeur vers l'interface COM en premier argument, en sus des arguments passés dans le *n*-uplet :attr:`argtypes`.

source: The optional *paramflags* parameter creates foreign function wrappers with much more functionality than the features described above.
fr: Le paramètre optionnel *paramflags* crée une fabrique de fonction externes avec des fonctionnalités supplémentaires par rapport à celles décrites ci-dessus.

source: *paramflags* must be a tuple of the same length as :attr:`argtypes`.
fr: *paramflags* est un *n*-uplet de la même taille que :attr:`argtypes`.

source: Each item in this tuple contains further information about a parameter, it must be a tuple containing one, two, or three items.
fr: Chaque élément de ce *n*-uplet contient des informations supplémentaires sur le paramètre correspondant. Ce doit être aussi un *n*-uplet, avec un, deux ou trois éléments.

source: The first item is an integer containing a combination of direction flags for the parameter:
fr: Le premier élément est un entier qui contient une combinaison de drapeaux qui précisent le sens des paramètres (entrée ou sortie) :

source: Specifies an input parameter to the function.
fr: Paramètre d'entrée.

source: Output parameter. The foreign function fills in a value.
fr: Paramètre de sortie. La fonction externe va modifier cette valeur.

source: Input parameter which defaults to the integer zero.
fr: Paramètre d'entrée, valant 0 par défaut.

source: The optional second item is the parameter name as string. If this is specified, the foreign function can be called with named parameters.
fr: Le deuxième élément (optionnel) est une chaîne de caractères représentant le nom du paramètre. Si cet élément est donné, la fonction externe pourra être appelée avec des paramètres nommés.

source: The optional third item is the default value for this parameter.
fr: Le troisième élément (optionnel) est la valeur par défaut du paramètre.

source: This example demonstrates how to wrap the Windows ``MessageBoxW`` function so that it supports default parameters and named arguments. The C declaration from the windows header file is this::
fr: L'exemple suivant montre comment encapsuler la fonction Windows ``MessageBoxW`` afin que celle-ci prenne en charge des paramètres par défaut et des arguments nommés. Sa déclaration C dans le fichier d'en-tête des fenêtres est ::

source: Here is the wrapping with :mod:`ctypes`::
fr: L'encapsulation :mod:`ctypes` correspondante est alors ::

source: The ``MessageBox`` foreign function can now be called in these ways::
fr: La fonction ``MessageBox`` peut désormais être appelée des manières suivantes ::

source: A second example demonstrates output parameters. The win32 ``GetWindowRect`` function retrieves the dimensions of a specified window by copying them into ``RECT`` structure that the caller has to supply. Here is the C declaration::
fr: L'exemple qui suit traite des paramètres en sortie. La fonction win32 ``GetWindowRect`` donne les dimensions d'une fenêtre en les copiant dans une structure ``RECT`` que l'appelant doit fournir. Sa déclaration en C est ::

source: Functions with output parameters will automatically return the output parameter value if there is a single one, or a tuple containing the output parameter values when there are more than one, so the GetWindowRect function now returns a RECT instance, when called.
fr: Les fonctions avec des paramètres en sortie renvoient automatiquement la valeur du paramètre de sortie s'il n'y en a qu'un seul, ou un *n*-uplet avec les valeurs de sortie de chaque paramètre s'il y en a plusieurs. Ici, la fonction *GetWindowRect* renvoie donc une instance de *RECT* quand elle est appelée.

source: Output parameters can be combined with the :attr:`errcheck` protocol to do further output processing and error checking. The win32 ``GetWindowRect`` api function returns a ``BOOL`` to signal success or failure, so this function could do the error checking, and raises an exception when the api call failed::
fr: Il est possible de combiner des paramètres en sortie avec le protocole :attr:`errcheck` pour post-traiter les sorties et faire de la vérification d'erreur. La fonction de l'API win32 ``GetWindowRect`` renvoie un ``BOOL`` pour indiquer le succès ou l'échec de l'exécution, donc cette fonction peut vérifier le résultat et lever une exception quand l'appel à l'API a échoué ::

source: If the :attr:`errcheck` function returns the argument tuple it receives unchanged, :mod:`ctypes` continues the normal processing it does on the output parameters. If you want to return a tuple of window coordinates instead of a ``RECT`` instance, you can retrieve the fields in the function and return them instead, the normal processing will no longer take place::
fr: Si la fonction :attr:`errcheck` renvoie le *n*-uplet passé en paramètre sans rien y changer, :mod:`ctypes` continue l'exécution habituelle des paramètres en sortie. Si on préfère renvoyer un *n*-uplet de coordonnées au lieu de renvoyer une instance de ``RECT``, il faut récupérer les champs correspondants et les renvoyer en retour. Dans ce cas, l'exécution habituelle n'a plus lieu ::

source: Utility functions
fr: Fonctions utilitaires

source: Data types
fr: Types de données

source: Structured data types
fr: Types de données dérivés de Structure

source: Arrays and pointers
fr: Tableaux et pointeurs

source: Abstract base class for arrays.
fr: Classe de base abstraite pour les *arrays*.

source: Specifies the type of each element in the array.
fr: Spécifie le type de chaque élément de l'*array*.
