Repository: python/python-docs-fr
Catalog: library/dataclasses.po
Languages: fr

source: Returns a tuple of :class:`Field` objects that define the fields for this dataclass. Accepts either a dataclass, or an instance of a dataclass. Raises :exc:`TypeError` if not passed a dataclass or instance of one. Does not return pseudo-fields which are ``ClassVar`` or ``InitVar``.
fr: Renvoie un *n*-uplet d'objets :class:`Field` correspondant aux champs de l'argument, à l'exclusion des pseudo-champs ``ClassVar`` ou ``InitVar``. L'argument peut être soit une classe de données, soit une instance d'une telle classe ; si ce n'est pas le cas, une exception :exc:`TypeError` est levée.

source: Continuing from the previous example::
fr: Pour continuer l'exemple précédent :

source: Creates a new dataclass with name ``cls_name``, fields as defined in ``fields``, base classes as given in ``bases``, and initialized with a namespace as given in ``namespace``. ``fields`` is an iterable whose elements are each either ``name``, ``(name, type)``, or ``(name, type, Field)``. If just ``name`` is supplied, ``typing.Any`` is used for ``type``. The values of ``init``, ``repr``, ``eq``, ``order``, ``unsafe_hash``, ``frozen``, ``match_args``, ``kw_only``, and ``slots`` have the same meaning as they do in :func:`dataclass`.
fr: Crée une nouvelle classe de données avec le nom *cls_name*. Les champs proviennent de l'objet itérable *fields*. Les classes mères sont lues dans *bases*. L'espace de nommage de la classe est initialisé par *namespace*. La forme la plus générale d'un élément de *fields* est un triplet ``(nom, type, objet_Field)``. Le troisième élément peut être omis. On peut aussi passer un simple nom, auquel cas le type sera ``typing.Any``. Les paramètres restants, à savoir *init*, *repr*, *eq*, *order*, *unsafe_hash*, *frozen*, *march_args*, *kw_only* et *slots*, sont les mêmes que dans :func:`dataclass`.

source: This function is not strictly required, because any Python mechanism for creating a new class with ``__annotations__`` can then apply the :func:`dataclass` function to convert that class to a dataclass. This function is provided as a convenience. For example::
fr: Cette fonction est pratique mais pas absolument nécessaire, puisqu'il suffit de créer par un moyen quelconque une classe avec l'attribut ``__annotation__`` et de lui appliquer la fonction :func:`dataclass`, qui la convertit en une classe de données. Par exemple, ceci :

source: Is equivalent to::
fr: est équivalent à ::

source: Creates a new object of the same type as ``instance``, replacing fields with values from ``changes``. If ``instance`` is not a Data Class, raises :exc:`TypeError`. If values in ``changes`` do not specify fields, raises :exc:`TypeError`.
fr: Crée un nouvel objet du même type que *instance* en effectuant les remplacements donnés par *changes* dans ses champs. L'argument *instance* doit être une instance d'une classe de données, sans quoi :exc:`TypeError` est levée. De même, si une clé dans *changes* ne correspond à aucun champ de l'instance, :exc:`TypeError` est levée.

source: The newly returned object is created by calling the :meth:`__init__` method of the dataclass. This ensures that :meth:`__post_init__`, if present, is also called.
fr: L'objet renvoyé est créé à l'aide de la méthode :meth:`__init__` de la classe de données, ce qui garantit que :meth:`__post_init__` est appelée (si elle existe).

source: Init-only variables without default values, if any exist, must be specified on the call to :func:`replace` so that they can be passed to :meth:`__init__` and :meth:`__post_init__`.
fr: Si un champ d'initialisation (voir plus bas) n'a pas de valeur par défaut, il faut l'inclure dans l'appel à :func:`replace` afin qu'il soit passé à :meth:`__init__` et :meth:`__post_init__`.

source: It is an error for ``changes`` to contain any fields that are defined as having ``init=False``. A :exc:`ValueError` will be raised in this case.
fr: Si une clé de *changes* correspond à un champ défini avec ``init=False``, :exc:`ValueError` est levée.

source: Be forewarned about how ``init=False`` fields work during a call to :func:`replace`. They are not copied from the source object, but rather are initialized in :meth:`__post_init__`, if they're initialized at all. It is expected that ``init=False`` fields will be rarely and judiciously used. If they are used, it might be wise to have alternate class constructors, or perhaps a custom ``replace()`` (or similarly named) method which handles instance copying.
fr: Prenez garde aux champs définis avec ``init=False`` dans un appel à :func:`replace`. Ils ne sont pas copiés automatiquement de l'instance source. C'est le rôle de :meth:`__post_init__` de les initialiser — ou pas. Les champs avec ``init=False`` doivent rarement être utilisés et seulement à bon escient. Si vous en avez, il peut être sage de traiter la copie des instances par des constructeurs de classe alternatifs, ou bien une méthode personnalisée ``replace()`` (ou un nom similaire).

source: Return ``True`` if its parameter is a dataclass or an instance of one, otherwise return ``False``.
fr: Renvoie ``True`` si l'argument est soit une classe de données, soit une instance d'une telle classe. Sinon, renvoie ``False``.

source: If you need to know if a class is an instance of a dataclass (and not a dataclass itself), then add a further check for ``not isinstance(obj, type)``::
fr: Pour vérifier qu'un objet *obj* est une instance d'une classe de données, et non pas lui-même une classe de données, ajoutez le test ``not isinstance(obj, type)`` ::

source: A sentinel value signifying a missing default or default_factory.
fr: Une valeur sentinelle pour dénoter l'absence de *default* ou *default_factory*.

source: A sentinel value used as a type annotation. Any fields after a pseudo-field with the type of :const:`KW_ONLY` are marked as keyword-only fields. Note that a pseudo-field of type :const:`KW_ONLY` is otherwise completely ignored. This includes the name of such a field. By convention, a name of ``_`` is used for a :const:`KW_ONLY` field. Keyword-only fields signify :meth:`__init__` parameters that must be specified as keywords when the class is instantiated.
fr: Une valeur sentinelle utilisée en tant qu'annotation de type. Chaque attribut situé après un pseudo-champ ayant pour type la constante :const:`KW_ONLY` est marqué comme champ exclusivement nommé. Notez que le pseudo-champ ayant pour type la constante :const:`KW_ONLY` est par ailleurs complètement ignoré. Par convention le nom ``_`` est utilisé pour l'attribut :const:`KW_ONLY`. Les paramètres de la méthode :meth:`__init__` exclusivement nommés doivent être spécifiés par leur nom lors de l'instanciation de la classe.

source: In this example, the fields ``y`` and ``z`` will be marked as keyword-only fields::
fr: Dans cette exemple ``y`` et ``z`` sont marqués comme exclusivement nommés ::

source: In a single dataclass, it is an error to specify more than one field whose type is :const:`KW_ONLY`.
fr: Une erreur est levée s'il y a plus d'un champ de type :const:`KW_ONLY` dans une unique classe de données.

source: Raised when an implicitly defined :meth:`__setattr__` or :meth:`__delattr__` is called on a dataclass which was defined with ``frozen=True``. It is a subclass of :exc:`AttributeError`.
fr: Sous-classe de :exc:`AttributeError`, levée lorsqu'une méthode :meth:`__setattr__` ou :meth:`__delattr__` définie implicitement est appelée dans une classe de données définie avec ``frozen=True``.

source: Post-init processing
fr: Post-initialisation

source: The generated :meth:`__init__` code will call a method named :meth:`__post_init__`, if :meth:`__post_init__` is defined on the class. It will normally be called as ``self.__post_init__()``. However, if any ``InitVar`` fields are defined, they will also be passed to :meth:`__post_init__` in the order they were defined in the class. If no :meth:`__init__` method is generated, then :meth:`__post_init__` will not automatically be called.
fr: Après avoir initialisé l'objet, la méthode :meth:`__init__` générée appelle la méthode :meth:`__post_init__`, si elle est définie. :meth:`__post_init__` est habituellement appelée avec un simple ``self.__post_init__()``. Cependant, si la classe comporte des champs d'initialisation (voir plus bas), leurs valeurs sont aussi passées à :meth:`__post_init__` telles qu'elles ont été fournies à :meth:`__init__`. Si la classe est créée avec ``init=False``, :meth:`__post_init__` n'est jamais appelée automatiquement.

source: Among other uses, this allows for initializing field values that depend on one or more other fields. For example::
fr: Cette méthode permet, entre autres, d'initialiser des champs qui dépendent d'autres champs. Par exemple :

source: The :meth:`__init__` method generated by :func:`dataclass` does not call base class :meth:`__init__` methods. If the base class has an :meth:`__init__` method that has to be called, it is common to call this method in a :meth:`__post_init__` method::
fr: Les méthodes :meth:`__init__` des classes mères ne sont pas appelées automatiquement par la méthode :meth:`__init__` que génère :func:`dataclass`. S'il faut appeler ces méthodes :meth:`__init__`, il est courant de le faire dans :meth:`__post_init__` :

source: Note, however, that in general the dataclass-generated :meth:`__init__` methods don't need to be called, since the derived dataclass will take care of initializing all fields of any base class that is a dataclass itself.
fr: Notez toutefois qu'il n'est généralement pas nécessaire d'appeler une méthode :meth:`__init__` si elle a été générée automatiquement dans une classe de données, car la classe fille initialise elle-même les champs apportés par toute classe mère qui est aussi une classe de données.

source: See the section below on init-only variables for ways to pass parameters to :meth:`__post_init__`. Also see the warning about how :func:`replace` handles ``init=False`` fields.
fr: Voir la section plus bas à propos des variables d'initialisation pour les moyens de passer des paramètres à :meth:`__post_init__`. Voir également l'avertissement sur le traitement par :func:`replace` des champs définis avec ``init=False``.

source: Class variables
fr: Variables de classe

source: One of two places where :func:`dataclass` actually inspects the type of a field is to determine if a field is a class variable as defined in :pep:`526`. It does this by checking if the type of the field is ``typing.ClassVar``. If a field is a ``ClassVar``, it is excluded from consideration as a field and is ignored by the dataclass mechanisms. Such ``ClassVar`` pseudo-fields are not returned by the module-level :func:`fields` function.
fr: Voici le premier des deux cas où le type fourni dans l'annotation d'un champ est pris en compte par :func:`dataclass` au moment de l'exécution. Si ce type est ``typing.ClassVar``, le champ est considéré comme une variable de classe, notion définie dans la :pep:`526`. Les champs de ce genre sont complètement ignorés du point de vue des classes de données. Ils n'apparaissent pas dans le résultat de :func:`fields`.

source: Init-only variables
fr: Variables d'initialisation

source: The other place where :func:`dataclass` inspects a type annotation is to determine if a field is an init-only variable. It does this by seeing if the type of a field is of type ``dataclasses.InitVar``. If a field is an ``InitVar``, it is considered a pseudo-field called an init-only field. As it is not a true field, it is not returned by the module-level :func:`fields` function. Init-only fields are added as parameters to the generated :meth:`__init__` method, and are passed to the optional :meth:`__post_init__` method. They are not otherwise used by dataclasses.
fr: L'autre cas où l'annotation de type influence :func:`dataclass` est le suivant : si le type est ``dataclasses.InitVar``, le nom devient un « champ d'initialisation ». Puisque ce n'est pas un vrai champ, il n'est pas inclus dans le *n*-uplet que renvoie :func:`fields`. Les champs d'initialisation sont ajoutés en tant que paramètres à la méthode :meth:`__init__` générée. Leurs valeurs sont passées à :meth:`__post_init__`, si cette méthode existe. C'est la seule manière dont elles sont utilisées.

source: For example, suppose a field will be initialized from a database, if a value is not provided when creating the class::
fr: On peut par exemple imaginer un champ initialisé à partir d'une base de données s'il n'a pas reçu de valeur explicite :

source: In this case, :func:`fields` will return :class:`Field` objects for ``i`` and ``j``, but not for ``database``.
fr: Ici, :func:`fields` renvoie des objets :class:`Field` correspondant à ``i`` et à ``j``, mais pas à ``database``.

source: Frozen instances
fr: Instances figées

source: It is not possible to create truly immutable Python objects. However, by passing ``frozen=True`` to the :meth:`dataclass` decorator you can emulate immutability. In that case, dataclasses will add :meth:`__setattr__` and :meth:`__delattr__` methods to the class. These methods will raise a :exc:`FrozenInstanceError` when invoked.
fr: Bien qu'il ne soit pas possible de créer des objets Python strictement immuables, on peut rendre les instances d'une classe de données quasi immuables en passant ``frozen=True`` au décorateur :meth:`dataclass`, ce qui lui fait générer des méthodes :meth:`__setattr__` et :meth:`__delattr__`. Celles-ci lèvent systématiquement l'exception :exc:`FrozenInstanceError`.

source: There is a tiny performance penalty when using ``frozen=True``: :meth:`__init__` cannot use simple assignment to initialize fields, and must use :meth:`object.__setattr__`.
fr: Les performances sont légèrement moins bonnes avec ``frozen=True`` car :meth:`__init__` doit passer par :meth:`object.__setattr__` au lieu de simples affectations pour initialiser les champs.

source: Inheritance
fr: Héritage

source: When the dataclass is being created by the :meth:`dataclass` decorator, it looks through all of the class's base classes in reverse MRO (that is, starting at :class:`object`) and, for each dataclass that it finds, adds the fields from that base class to an ordered mapping of fields. After all of the base class fields are added, it adds its own fields to the ordered mapping. All of the generated methods will use this combined, calculated ordered mapping of fields. Because the fields are in insertion order, derived classes override base classes. An example::
fr: Au moment de la création d'une classe de données, le décorateur :meth:`dataclass` parcourt toutes les classes mères dans l'ordre inverse de résolution des méthodes (donc en commençant par :class:`object`). À chaque fois qu'une classe de données est rencontrée, ses champs sont insérés dans un tableau associatif ordonné. Pour finir, les champs de la classe elle-même sont rajoutés. Toutes les méthodes générées utilisent en interne ce même tableau associatif. Puisqu'il est ordonné, les champs des classes filles écrasent ceux des classes mères. Voici un exemple :

source: The final list of fields is, in order, ``x``, ``y``, ``z``. The final type of ``x`` is ``int``, as specified in class ``C``.
fr: La liste finale des champs contient, dans l'ordre, ``x``, ``y``, ``z``. Le type de ``x`` est ``int``, comme déclaré dans ``C``.

source: The generated :meth:`__init__` method for ``C`` will look like::
fr: La méthode :meth:`__init__` générée pour ``C`` ressemble à :

source: Re-ordering of keyword-only parameters in :meth:`__init__`
fr: Réarrangement des paramètres exclusivement nommés dans :meth:`__init__`

source: After the parameters needed for :meth:`__init__` are computed, any keyword-only parameters are moved to come after all regular (non-keyword-only) parameters. This is a requirement of how keyword-only parameters are implemented in Python: they must come after non-keyword-only parameters.
fr: Lorsque les paramètres requis pour :meth:`__init__` sont préparés, tout ceux marqués comme exclusivement nommé sont déplacés pour être positionnés après tous ceux non exclusivement nommés. Ceci est un prérequis de la façon dont les paramètres exclusivement nommés sont implémentés en Python : ils sont après les paramètres non exclusivement nommés.

source: In this example, ``Base.y``, ``Base.w``, and ``D.t`` are keyword-only fields, and ``Base.x`` and ``D.z`` are regular fields::
fr: Dans cet exemple, ``Base.y``, ``Base.w``, et ``D.t`` sont des champs exclusivement nommés alors que``Base.x`` et ``D.z`` sont des champs normaux ::

source: The generated :meth:`__init__` method for ``D`` will look like::
fr: La méthode :meth:`__init__` générée pour ``D`` ressemble à ::

source: Note that the parameters have been re-ordered from how they appear in the list of fields: parameters derived from regular fields are followed by parameters derived from keyword-only fields.
fr: Les paramètres ont été réarrangés par rapport à leur ordre d'apparition dans la liste des champs : les paramètres provenant des attributs normaux sont suivis par les paramètres qui proviennent des attributs exclusivement nommés.

source: The relative ordering of keyword-only parameters is maintained in the re-ordered :meth:`__init__` parameter list.
fr: L'ordre relatif des paramètres exclusivement nommés est conservé par le réarrangement des paramètres d'\ :meth:`__init__`.

source: Default factory functions
fr: Fabriques de valeurs par défaut

source: If a :func:`field` specifies a ``default_factory``, it is called with zero arguments when a default value for the field is needed. For example, to create a new instance of a list, use::
fr: Le paramètre facultatif *default_factory* de :func:`field` est une fonction qui est appelée sans argument pour fournir des valeurs par défaut. Par exemple, voici comment donner la valeur par défaut d'une liste vide :

source: If a field is excluded from :meth:`__init__` (using ``init=False``) and the field also specifies ``default_factory``, then the default factory function will always be called from the generated :meth:`__init__` function. This happens because there is no other way to give the field an initial value.
fr: Si un champ avec fabrique est exclu de :meth:`__init__` (par ``init=False``), alors la fabrique est appelée par :meth:`__init__` pour chaque nouvelle instance, puisque c'est le seul moyen d'obtenir une valeur à laquelle initialiser le champ.

source: Mutable default values
fr: Valeurs par défaut muables

source: Python stores default member variable values in class attributes. Consider this example, not using dataclasses::
fr: En Python, les valeurs par défaut des attributs sont stockées dans des attributs de la classe. Observez cet exemple, sans classe de données :

source: Note that the two instances of class ``C`` share the same class variable ``x``, as expected.
fr: Comme attendu, les deux instances de ``C`` partagent le même objet pour l'attribut ``x``.

source: Using dataclasses, *if* this code was valid::
fr: Avec les classes de données, si ce code était valide :

source: it would generate code similar to::
fr: il générerait un code équivalent à :

source: This has the same issue as the original example using class ``C``. That is, two instances of class ``D`` that do not specify a value for ``x`` when creating a class instance will share the same copy of ``x``. Because dataclasses just use normal Python class creation they also share this behavior. There is no general way for Data Classes to detect this condition. Instead, the :func:`dataclass` decorator will raise a :exc:`TypeError` if it detects a default parameter of type ``list``, ``dict``, or ``set``. This is a partial solution, but it does protect against many common errors.
fr: On se retrouve avec le même problème qu'au premier exemple avec la classe ``C``. Les classes de données étant créées comme toutes les autres classes Python, leur comportement est identique. Ainsi, deux instances distinctes de ``D`` où l'attribut ``x`` a été laissé à sa valeur par défaut partagent la même copie de l'objet ``x``. Il n'y a aucun moyen commun de détecter cette situation. C'est pourquoi le décorateur :func:`dataclass` lève :exc:`TypeError` si une valeur par défaut est de type ``list``, ``dict`` ou ``set`` est détectée. Cette solution n'est pas parfaite, mais permet d'éviter la majorité des erreurs.

source: Using default factory functions is a way to create new instances of mutable types as default values for fields::
fr: Pour qu'un champ d'un type muable soit par défaut initialisé à un nouvel objet pour chaque instance, utilisez une fonction de fabrique :
