Repository: python/python-docs-fr
Catalog: library/dataclasses.po
Languages: fr

source: :mod:`dataclasses` --- Data Classes
fr: :mod:`dataclasses` — Classes de Données

source: **Source code:** :source:`Lib/dataclasses.py`
fr: **Code source :** :source:`Lib/dataclasses.py`

source: This module provides a decorator and functions for automatically adding generated :term:`special method`\s such as :meth:`__init__` and :meth:`__repr__` to user-defined classes. It was originally described in :pep:`557`.
fr: Ce module fournit un décorateur et des fonctions pour générer automatiquement les :term:`méthodes spéciales <special method>` comme :meth:`__init__` et :meth:`__repr__` dans les *Classes de Données* définies par l’utilisateur. Ces classes ont été décrites dans la :pep:`557`.

source: The member variables to use in these generated methods are defined using :pep:`526` type annotations. For example, this code::
fr: Les variables membres à utiliser dans ces méthodes générées sont définies en utilisant les annotations de type :pep:`526`. Par exemple ::

source: will add, among other things, a :meth:`__init__` that looks like::
fr: ce code ajoute à la classe, entre autres choses, une méthode :meth:`__init__` qui ressemble à ::

source: Note that this method is automatically added to the class: it is not directly specified in the ``InventoryItem`` definition shown above.
fr: Il est important de noter que cette méthode est ajoutée automatiquement dans la classe. Elle n’est jamais écrite dans la définition de ``InventoryItem``.

source: Module contents
fr: Classe de données

source: This function is a :term:`decorator` that is used to add generated :term:`special method`\s to classes, as described below.
fr: Cette fonction est un :term:`décorateur <decorator>` qui ajoute aux classes des :term:`méthodes spéciales <special method>` générées automatiquement. Voici une description plus détaillée.

source: The :func:`dataclass` decorator examines the class to find ``field``\s. A ``field`` is defined as a class variable that has a :term:`type annotation <variable annotation>`. With two exceptions described below, nothing in :func:`dataclass` examines the type specified in the variable annotation.
fr: Le décorateur :func:`dataclass` examine la classe pour trouver des champs. Un champ est défini comme une variable de classe qui possède une :term:`annotation de type <variable annotation>`. À deux exceptions près décrites plus bas, :func:`dataclass` ne prend pas en considération le type donné dans l'annotation.

source: The order of the fields in all of the generated methods is the order in which they appear in the class definition.
fr: L’ordre des paramètres des méthodes générées est celui d’apparition des champs dans la définition de la classe.

source: The :func:`dataclass` decorator will add various "dunder" methods to the class, described below. If any of the added methods already exist in the class, the behavior depends on the parameter, as documented below. The decorator returns the same class that it is called on; no new class is created.
fr: Le décorateur :func:`dataclass` ajoute diverses méthodes spéciales à la classe, décrites ci-après. Si l’une des méthodes ajoutées existe déjà dans la classe, le comportement dépend des paramètres. Le décorateur renvoie la classe sur laquelle il est appelé ; aucune nouvelle classe n'est créée.

source: If :func:`dataclass` is used just as a simple decorator with no parameters, it acts as if it has the default values documented in this signature. That is, these three uses of :func:`dataclass` are equivalent::
fr: Si :func:`dataclass` est utilisé directement, il se comporte comme si on l’avait appelé sans argument (c.-à-d. en laissant les valeurs par défaut de sa signature). Ainsi, les trois usages suivants de :func:`dataclass` sont équivalents ::

source: The parameters to :func:`dataclass` are:
fr: Les paramètres de :func:`dataclass` sont les suivants :

source: ``init``: If true (the default), a :meth:`__init__` method will be generated.
fr: *init* : si vrai (par défaut), une méthode :meth:`__init__` est générée.

source: If the class already defines :meth:`__init__`, this parameter is ignored.
fr: Si la classe définit déjà une méthode :meth:`__init__`, ce paramètre est ignoré.

source: ``repr``: If true (the default), a :meth:`__repr__` method will be generated. The generated repr string will have the class name and the name and repr of each field, in the order they are defined in the class. Fields that are marked as being excluded from the repr are not included. For example: ``InventoryItem(name='widget', unit_price=3.0, quantity_on_hand=10)``.
fr: *repr* : si vrai (par défaut), une méthode :meth:`__repr__` est générée. La chaîne de représentation comporte le nom de la classe et le nom ainsi que la représentation de chaque champ, suivant leur ordre de définition. Les champs marqués comme exclus de la représentation (voir ``Field`` ci-dessous) sont ignorés. Par exemple : ``InventoryItem(name='widget', unit_price=3.0, quantity_on_hand=10)``.

source: If the class already defines :meth:`__repr__`, this parameter is ignored.
fr: Si la classe définit déjà une méthode :meth:`__repr__`, ce paramètre est ignoré.

source: ``eq``: If true (the default), an :meth:`__eq__` method will be generated. This method compares the class as if it were a tuple of its fields, in order. Both instances in the comparison must be of the identical type.
fr: *eq* : si vrai (par défaut), une méthode :meth:`__eq__` est générée. Cette méthode permet de comparer les instances de la classe comme si elles étaient des *n*-uplet de leurs champs, pris dans l’ordre. Les deux instances dans la comparaison doivent être de même type.

source: If the class already defines :meth:`__eq__`, this parameter is ignored.
fr: Si la classe définit déjà une méthode :meth:`__eq__`, ce paramètre est ignoré.

source: ``order``: If true (the default is ``False``), :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__`, and :meth:`__ge__` methods will be generated. These compare the class as if it were a tuple of its fields, in order. Both instances in the comparison must be of the identical type. If ``order`` is true and ``eq`` is false, a :exc:`ValueError` is raised.
fr: *order* : si vrai (``False`` par défaut), les méthodes :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__`, et :meth:`__ge__` sont générées. Elles permettent de comparer les instances de la classe en les considérant comme des *n*-uplets, dans l’ordre de définition des champs. Toutes les instances dans la comparaison doivent être de même type. Si ``order`` est vrai mais que ``eq`` est faux, une :exc:`ValueError` est levée.

source: If the class already defines any of :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__`, or :meth:`__ge__`, then :exc:`TypeError` is raised.
fr: Si la classe définit déjà l’une des méthodes :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__`, ou :meth:`__ge__`, alors une :exc:`TypeError` est levée.

source: ``unsafe_hash``: If ``False`` (the default), a :meth:`__hash__` method is generated according to how ``eq`` and ``frozen`` are set.
fr: *unsafe_hash* : si ``False`` (par défaut), une méthode :meth:`__hash__` est générée et son comportement dépend des valeurs de *eq* et *frozen*.

source: :meth:`__hash__` is used by built-in :meth:`hash()`, and when objects are added to hashed collections such as dictionaries and sets. Having a :meth:`__hash__` implies that instances of the class are immutable. Mutability is a complicated property that depends on the programmer's intent, the existence and behavior of :meth:`__eq__`, and the values of the ``eq`` and ``frozen`` flags in the :func:`dataclass` decorator.
fr: :meth:`__hash__` est utilisée par la fonction native :meth:`hash()`, ainsi que lorsqu’un objet est inséré dans une collection utilisant du hachage, tel qu’un dictionnaire ou un ensemble. Avoir une méthode :meth:`__hash__` implique que les instances de la classe sont immuables. La muabilité est une propriété complexe qui dépend des intentions du programmeur, de l’existence et du comportement de la méthode :meth:`__eq__`, et des valeurs des options *eq* et *frozen* dans l’appel au décorateur :func:`dataclass`.

source: By default, :func:`dataclass` will not implicitly add a :meth:`__hash__` method unless it is safe to do so. Neither will it add or change an existing explicitly defined :meth:`__hash__` method. Setting the class attribute ``__hash__ = None`` has a specific meaning to Python, as described in the :meth:`__hash__` documentation.
fr: Par défaut, :func:`dataclass` n’ajoute pas de méthode implicite :meth:`__hash__`, sauf s’il n’existe aucun risque sous-jacent. Il n’ajoute ou ne modifie pas non plus la méthode :meth:`__hash__` si elle a été définie explicitement. Définir l’attribut de classe ``__hash__ = None`` a une signification particulière, comme précisé dans la documentation de :meth:`__hash__`.

source: If :meth:`__hash__` is not explicitly defined, or if it is set to ``None``, then :func:`dataclass` *may* add an implicit :meth:`__hash__` method. Although not recommended, you can force :func:`dataclass` to create a :meth:`__hash__` method with ``unsafe_hash=True``. This might be the case if your class is logically immutable but can nonetheless be mutated. This is a specialized use case and should be considered carefully.
fr: Si :meth:`__hash__` n’est pas défini explicitement, ou s’il a pour valeur ``None``, alors :func:`dataclass` *peut* ajouter une méthode :meth:`__hash__` implicite. Bien que ce ne soit pas recommandé, vous pouvez forcer :func:`dataclass` à créer une méthode :meth:`__hash__` en utilisant ``unsafe_hash=True``. Cela pourrait être nécessaire si votre classe est logiquement immuable mais qu’une mutation est tout de même possible. Il s'agit là d'un cas particulier qui doit être considéré avec la plus grande prudence.

source: Here are the rules governing implicit creation of a :meth:`__hash__` method. Note that you cannot both have an explicit :meth:`__hash__` method in your dataclass and set ``unsafe_hash=True``; this will result in a :exc:`TypeError`.
fr: Voici les règles autour de la création implicite de la méthode :meth:`__hash__`. Il faut noter que vous ne pouvez pas avoir à la fois une méthode :meth:`__hash__` explicite dans votre classe de données et définir ``unsafe_hash=True`` ; cela lèvera une :exc:`TypeError`.

source: If ``eq`` and ``frozen`` are both true, by default :func:`dataclass` will generate a :meth:`__hash__` method for you. If ``eq`` is true and ``frozen`` is false, :meth:`__hash__` will be set to ``None``, marking it unhashable (which it is, since it is mutable). If ``eq`` is false, :meth:`__hash__` will be left untouched meaning the :meth:`__hash__` method of the superclass will be used (if the superclass is :class:`object`, this means it will fall back to id-based hashing).
fr: Si *eq* et *frozen* sont tous deux vrais, :func:`dataclass` génère par défaut une méthode :meth:`__hash__` pour vous. Si *eq* est vrai mais que *frozen* est faux, :meth:`__hash__` prend la valeur ``None``, marquant la classe comme non-hachable (et c’est le cas, puisque les instances sont mutables). Si ``eq`` est faux, la méthode :meth:`__hash__` est laissée intacte, ce qui veut dire que la méthode :meth:`__hash__` de la classe parente sera utilisée (si la classe parente est :class:`object`, le comportement est un hachage basé sur les id).

source: ``frozen``: If true (the default is ``False``), assigning to fields will generate an exception. This emulates read-only frozen instances. If :meth:`__setattr__` or :meth:`__delattr__` is defined in the class, then :exc:`TypeError` is raised. See the discussion below.
fr: *frozen* : si vrai (faux par défaut), assigner une valeur à un champ lève une exception. Cela simule le comportement des instances figées en lecture seule. Si la méthode :meth:`__setattr__` ou :meth:`__delattr__` est définie sur la classe, alors une :exc:`TypeError` est levée. Voir la discussion ci-dessous.

source: ``match_args``: If true (the default is ``True``), the ``__match_args__`` tuple will be created from the list of parameters to the generated :meth:`__init__` method (even if :meth:`__init__` is not generated, see above). If false, or if ``__match_args__`` is already defined in the class, then ``__match_args__`` will not be generated.
fr: *match_args* : si vrai (``True`` est la valeur par défaut), le *n*-uplet ``__match_args__`` est créé automatiquement depuis la liste des paramètres de la méthode :meth:`__init__` générée (même si :meth:`__init__` n'est pas générée, voir ci-dessus). Si faux ou si ``__match_args__`` est déjà défini dans la classe alors ``__match_args__`` n'est pas créé.

source: ``kw_only``: If true (the default value is ``False``), then all fields will be marked as keyword-only. If a field is marked as keyword-only, then the only affect is that the :meth:`__init__` parameter generated from a keyword-only field must be specified with a keyword when :meth:`__init__` is called. There is no effect on any other aspect of dataclasses. See the :term:`parameter` glossary entry for details. Also see the :const:`KW_ONLY` section.
fr: *kw_only* : si vrai (``False`` est la valeur par défaut) alors tous les champs sont marqués comme exclusivement nommés. Si un champ est marqué comme exclusivement nommé, le seul impact est que le champ de la méthode :meth:`__init__` générée devra être explicitement nommé lors de l'appel de la méthode :meth:`__init__`. Il n'y a aucun autre effet dans les autres aspects des classes de données. Voir l'entrée :term:`paramètre <parameter>` du glossaire pour plus d'informations. Voir également la section :const:`KW_ONLY`.

source: ``slots``: If true (the default is ``False``), :attr:`__slots__` attribute will be generated and new class will be returned instead of the original one. If :attr:`__slots__` is already defined in the class, then :exc:`TypeError` is raised.
fr: *slot* : si vrai (``False`` est la valeur par défaut), l'attribut :attr:`__slots__` est généré et une nouvelle classe est renvoyée à la place de celle d'origine. Si :attr:`__slots__` est déjà défini dans la classe alors une :exc:`TypeError` est levée.

source: ``field``\s may optionally specify a default value, using normal Python syntax::
fr: Les champs peuvent éventuellement préciser une valeur par défaut, en utilisant la syntaxe Python normale ::

source: In this example, both ``a`` and ``b`` will be included in the added :meth:`__init__` method, which will be defined as::
fr: Dans cet exemple, ``a`` et ``b`` sont tous deux inclus dans la signature de la méthode générée :meth:`__init__`, qui est définie comme suit ::

source: :exc:`TypeError` will be raised if a field without a default value follows a field with a default value. This is true whether this occurs in a single class, or as a result of class inheritance.
fr: Une :exc:`TypeError` est levée si un champ sans valeur par défaut est défini après un champ avec une valeur par défaut. C’est le cas que ce soit dans une seule classe ou si c’est le résultat d’un héritage de classes.

source: For common and simple use cases, no other functionality is required. There are, however, some dataclass features that require additional per-field information. To satisfy this need for additional information, you can replace the default field value with a call to the provided :func:`field` function. For example::
fr: Dans les cas les plus simples et courants, ce qui a été décrit jusqu'ici suffit. Cependant, les classes de données possèdent des fonctionnalités supplémentaires fondées sur des métadonnées propres à chaque champ. Pour remplir ces métadonnées, il suffit de mettre un appel à la fonction :func:`field` à la place de la valeur par défaut, comme dans cet exemple :

source: As shown above, the :const:`MISSING` value is a sentinel object used to detect if some parameters are provided by the user. This sentinel is used because ``None`` is a valid value for some parameters with a distinct meaning. No code should directly use the :const:`MISSING` value.
fr: Comme le montre la signature, la constante :const:`MISSING` est une valeur sentinelle pour déterminer si des paramètres ont été fournis par l'utilisateur. ``None`` ne conviendrait pas puisque c'est une valeur avec un sens qui peut être différent pour certains paramètres. La sentinelle :const:`MISSING` est interne au module et ne doit pas être utilisée dans vos programmes.

source: The parameters to :func:`field` are:
fr: Les paramètres de :func:`field` sont :

source: ``default``: If provided, this will be the default value for this field. This is needed because the :meth:`field` call itself replaces the normal position of the default value.
fr: *default* : s'il est fourni, il devient la valeur par défaut du champ. L'appel à :meth:`field` est mis à la place normale de la valeur par défaut, d'où la nécessité de ce paramètre.

source: ``default_factory``: If provided, it must be a zero-argument callable that will be called when a default value is needed for this field. Among other purposes, this can be used to specify fields with mutable default values, as discussed below. It is an error to specify both ``default`` and ``default_factory``.
fr: *default_factory* : s'il est fourni, ce doit être un objet appelable sans argument. Il est alors appelé à chaque fois qu'il faut une valeur par défaut pour le champ. Ceci permet, entre autres choses, de définir des champs dont les valeurs par défaut sont muables. Une erreur se produit si *default* et *default_factory* sont donnés tous les deux.

source: ``init``: If true (the default), this field is included as a parameter to the generated :meth:`__init__` method.
fr: *init* : si vrai (par défaut), la méthode :meth:`__init__` générée possède un paramètre correspondant à ce champ.

source: ``repr``: If true (the default), this field is included in the string returned by the generated :meth:`__repr__` method.
fr: *repr* : si vrai (par défaut), le champ est inclus dans les chaînes construites par la méthode :meth:`__repr__` générée.

source: ``hash``: This can be a bool or ``None``. If true, this field is included in the generated :meth:`__hash__` method. If ``None`` (the default), use the value of ``compare``: this would normally be the expected behavior. A field should be considered in the hash if it's used for comparisons. Setting this value to anything other than ``None`` is discouraged.
fr: *hash* : ce paramètre est un booléen ou ``None``. La valeur ``False`` force la prise en compte du champ dans la méthode :meth:`__hash__` générée, alors que ``False`` force son exclusion. ``None`` revient à mettre la même valeur que *compare*, ce qui est en général correct : il faut inclure dans le hachage les champs employés pour les comparaisons. Il est déconseillé de mettre ce paramètre à autre chose que ``None``.

source: One possible reason to set ``hash=False`` but ``compare=True`` would be if a field is expensive to compute a hash value for, that field is needed for equality testing, and there are other fields that contribute to the type's hash value. Even if a field is excluded from the hash, it will still be used for comparisons.
fr: Cependant, une raison légitime de mettre *hash* à ``False`` alors que *compare* est à ``True`` est la concourance de trois facteurs : le champ est coûteux à hacher ; il est nécessaire pour les comparaisons d'égalité ; et il y a déjà d'autres champs qui participent au hachage des instances. À ce moment, on peut alors se passer du champ dans le hachage tout en le faisant participer aux comparaisons.

source: ``compare``: If true (the default), this field is included in the generated equality and comparison methods (:meth:`__eq__`, :meth:`__gt__`, et al.).
fr: *compare* : si vrai (par défaut), le champ est considéré dans les comparaisons d'égalité et d'inégalité dans les méthodes générées :meth:`__eq__`, :meth:`__gt__`, etc.

source: ``metadata``: This can be a mapping or None. None is treated as an empty dict. This value is wrapped in :func:`~types.MappingProxyType` to make it read-only, and exposed on the :class:`Field` object. It is not used at all by Data Classes, and is provided as a third-party extension mechanism. Multiple third-parties can each have their own key, to use as a namespace in the metadata.
fr: *metadata* : ce paramètre est un tableau associatif (*mapping* en anglais). La valeur par défaut de ``None`` est prise comme un dictionnaire vide. Le tableau associatif devient accessible sur l'objet :class:`Field`, sous la forme d'un :func:`~types.MappingProxyType` afin qu'il soit en lecture seule.

source: ``kw_only``: If true, this field will be marked as keyword-only. This is used when the generated :meth:`__init__` method's parameters are computed.
fr: ``kw_only`` : Si vrai ce champ est marqué comme exclusivement nommé. Cela est utilisé lors du traitement des paramètres de la méthode :meth:`__init__` générée.

source: If the default value of a field is specified by a call to :func:`field()`, then the class attribute for this field will be replaced by the specified ``default`` value. If no ``default`` is provided, then the class attribute will be deleted. The intent is that after the :func:`dataclass` decorator runs, the class attributes will all contain the default values for the fields, just as if the default value itself were specified. For example, after::
fr: Si la valeur par défaut d'un champ est donnée dans un appel à :func:`field` (et pas directement), l'attribut correspondant de la classe est remplacé par cette valeur. Si le paramètre *default* n'est pas passé, l'attribut est simplement supprimé. De cette manière, après le passage du décorateur :func:`dataclass`, les attributs de la classe contiennent les valeurs par défaut des champs exactement comme si elles avaient été définies directement. Par exemple :

source: The class attribute ``C.z`` will be ``10``, the class attribute ``C.t`` will be ``20``, and the class attributes ``C.x`` and ``C.y`` will not be set.
fr: Après l'exécution de ce code, l'attribut de classe ``C.z`` vaut ``10`` et l'attribut ``C.t`` vaut ``20``, alors que les attributs ``C.x`` et ``C.y`` n'existent pas.

source: :class:`Field` objects describe each defined field. These objects are created internally, and are returned by the :func:`fields` module-level method (see below). Users should never instantiate a :class:`Field` object directly. Its documented attributes are:
fr: Les objets :class:`Field` contiennent des informations sur les champs. Ils sont créés en interne, et on y accède à l'aide de la méthode au niveau du module :func:`fields` (voir plus bas). Les utilisateurs ne doivent jamais instancier un objet :class:`Field` eux-mêmes. Les attributs documentés sont les suivants :

source: ``name``: The name of the field.
fr: *name* : le nom du champ ;

source: ``type``: The type of the field.
fr: *type* : le type associé au champ par l'annotation ;

source: ``default``, ``default_factory``, ``init``, ``repr``, ``hash``, ``compare``, ``metadata``, and ``kw_only`` have the identical meaning and values as they do in the :func:`field` function.
fr: *default*, *default_factory*, *init*, *repr*, *hash*, *compare*, *metadata* et *kw_only* qui correspondent aux paramètres de :func:`field` et en prennent les valeurs.

source: Other attributes may exist, but they are private and must not be inspected or relied on.
fr: D'autres attributs peuvent exister, mais ils sont privés et ne sont pas censés être inspectés. Le code ne doit jamais reposer sur eux.
