Repository: python/python-docs-fr
Catalog: library/datetime.po
Languages: fr

source: :mod:`datetime` --- Basic date and time types
fr: :mod:`datetime` — Types de base pour la date et l'heure

source: **Source code:** :source:`Lib/datetime.py`
fr: **Code source :** :source:`Lib/datetime.py`

source: The :mod:`datetime` module supplies classes for manipulating dates and times.
fr: Le module :mod:`datetime` fournit des classes permettant de manipuler les dates et les heures.

source: While date and time arithmetic is supported, the focus of the implementation is on efficient attribute extraction for output formatting and manipulation.
fr: Bien que les calculs de date et d'heure sont gérés, l'attention lors de l'implémentation s'est essentiellement portée sur l'efficacité de l'extraction des attributs en vue de leur manipulation et formatage pour l'affichage.

source: General calendar related functions.
fr: Fonctions génériques associées au calendrier.

source: Time access and conversions.
fr: Accès aux données d'horaires et aux conversions associées.

source: Package `dateutil <https://dateutil.readthedocs.io/en/stable/>`_
fr: Paquet `dateutil <https://dateutil.readthedocs.io/en/stable/>`_

source: Third-party library with expanded time zone and parsing support.
fr: Bibliothèque tierce avec prise en charge complète du fuseau horaire et de l'analyse de dates sous forme textuelle.

source: Aware and Naive Objects
fr: Objets avisés et naïfs

source: Date and time objects may be categorized as "aware" or "naive" depending on whether or not they include timezone information.
fr: Les objets *date* et *time* peuvent être classés comme « avisés » ou « naïfs » selon qu'ils contiennent ou non des informations sur le fuseau horaire.

source: With sufficient knowledge of applicable algorithmic and political time adjustments, such as time zone and daylight saving time information, an **aware** object can locate itself relative to other aware objects. An aware object represents a specific moment in time that is not open to interpretation. [#]_
fr: Un objet **avisé** possède suffisamment de connaissance des règles à appliquer et des politiques d'ajustement de l'heure comme les informations sur les fuseaux horaires et l'heure d'été pour se situer de façon relative par rapport à d'autres objets avisés. Un objet avisé est utilisé pour représenter un instant précis qui n'est pas ouvert à l'interprétation [#]_.

source: A **naive** object does not contain enough information to unambiguously locate itself relative to other date/time objects. Whether a naive object represents Coordinated Universal Time (UTC), local time, or time in some other timezone is purely up to the program, just like it is up to the program whether a particular number represents metres, miles, or mass. Naive objects are easy to understand and to work with, at the cost of ignoring some aspects of reality.
fr: Un objet **naïf** ne comporte pas assez d'informations pour se situer sans ambiguïté par rapport à d'autres objets *date/time*. Le fait qu'un objet naïf représente un Temps universel coordonné (UTC), une heure locale ou une heure dans un autre fuseau horaire dépend complètement du programme, tout comme un nombre peut représenter une longueur, un poids ou une distance pour le programme. Les objets naïfs sont simples à comprendre et il est aisé de travailler avec, au prix de négliger certains aspects de la réalité.

source: For applications requiring aware objects, :class:`.datetime` and :class:`.time` objects have an optional time zone information attribute, :attr:`!tzinfo`, that can be set to an instance of a subclass of the abstract :class:`tzinfo` class. These :class:`tzinfo` objects capture information about the offset from UTC time, the time zone name, and whether daylight saving time is in effect.
fr: Pour les applications nécessitant des objets avisés, les objets :class:`.datetime` et :class:`.time` ont un attribut facultatif renseignant le fuseau horaire, :attr:`!tzinfo`, qui peut être une instance d'une sous-classe de la classe abstraite :class:`tzinfo`. Ces objets :class:`tzinfo` regroupent des informations sur le décalage par rapport à l'heure UTC, le nom du fuseau horaire, et si l'heure d'été est en vigueur.

source: Only one concrete :class:`tzinfo` class, the :class:`timezone` class, is supplied by the :mod:`datetime` module. The :class:`timezone` class can represent simple timezones with fixed offsets from UTC, such as UTC itself or North American EST and EDT timezones. Supporting timezones at deeper levels of detail is up to the application. The rules for time adjustment across the world are more political than rational, change frequently, and there is no standard suitable for every application aside from UTC.
fr: Notez qu'une seule classe concrète :class:`tzinfo`, la classe :class:`timezone`, est proposée par le module :mod:`datetime`. La classe :class:`timezone` représente des fuseaux horaires simples avec un décalage fixe par rapport à UTC, comme UTC lui-même ou les fuseaux EST et EDT d'Amérique du Nord. Gérer des fuseaux horaires d'un niveau de détails plus avancé est à la charge de l'application. Les règles d'ajustement du temps à travers le monde sont plus politiques que rationnelles, changent fréquemment, et il n'y a pas de standard qui vaille pour toute application, en dehors d'UTC.

source: Constants
fr: Constantes

source: The :mod:`datetime` module exports the following constants:
fr: Le module :mod:`datetime` exporte les constantes suivantes :

source: The smallest year number allowed in a :class:`date` or :class:`.datetime` object. :const:`MINYEAR` is ``1``.
fr: Le numéro d'année le plus petit autorisé dans un objet :class:`date` ou :class:`datetime`. :const:`MINYEAR` vaut ``1``.

source: The largest year number allowed in a :class:`date` or :class:`.datetime` object. :const:`MAXYEAR` is ``9999``.
fr: Le numéro d'année le plus grand autorisé dans un objet :class:`date` ou :class:`datetime`. :const:`MAXYEAR` vaut ``9999``.

source: Available Types
fr: Types disponibles

source: An idealized naive date, assuming the current Gregorian calendar always was, and always will be, in effect. Attributes: :attr:`year`, :attr:`month`, and :attr:`day`.
fr: Une date naïve idéalisée, en supposant que le calendrier Grégorien actuel a toujours existé et qu'il existera toujours. Attributs : :attr:`year`, :attr:`month` et :attr:`day`.

source: An idealized time, independent of any particular day, assuming that every day has exactly 24\*60\*60 seconds. (There is no notion of "leap seconds" here.) Attributes: :attr:`hour`, :attr:`minute`, :attr:`second`, :attr:`microsecond`, and :attr:`.tzinfo`.
fr: Un temps idéalisé, indépendant d'une date particulière, en supposant qu'une journée est composée d'exactement 24\*60\*60 secondes (il n'y a pas ici de notion de « seconde intercalaire »). Attributs : :attr:`hour`, :attr:`minute`, :attr:`second`, :attr:`microsecond` et :attr:`tzinfo`.

source: A combination of a date and a time. Attributes: :attr:`year`, :attr:`month`, :attr:`day`, :attr:`hour`, :attr:`minute`, :attr:`second`, :attr:`microsecond`, and :attr:`.tzinfo`.
fr: Une combinaison d'une date et d'une heure. Attributs : :attr:`year`, :attr:`month`, :attr:`day`, :attr:`hour`, :attr:`minute`, :attr:`second`, :attr:`microsecond`, et :attr:`tzinfo`.

source: A duration expressing the difference between two :class:`date`, :class:`.time`, or :class:`.datetime` instances to microsecond resolution.
fr: Une durée qui exprime la différence entre deux instances de :class:`date`, :class:`time` ou :class:`datetime` en microsecondes.

source: An abstract base class for time zone information objects. These are used by the :class:`.datetime` and :class:`.time` classes to provide a customizable notion of time adjustment (for example, to account for time zone and/or daylight saving time).
fr: Une classe de base abstraite pour les objets portants des informations sur les fuseaux horaires. Ceux-ci sont utilisés par les classes :class:`.datetime` et :class:`.time` pour donner une notion personnalisable d'ajustement d'horaire (par exemple la prise en compte d'un fuseau horaire et/ou de l'heure d'été).

source: A class that implements the :class:`tzinfo` abstract base class as a fixed offset from the UTC.
fr: Une classe qui implémente la classe de base abstraite :class:`tzinfo` en tant qu'offset fixe par rapport au temps UTC.

source: Objects of these types are immutable.
fr: Les objets issus de ces types sont immuables.

source: Subclass relationships::
fr: Relations entre les sous-classes ::

source: Common Properties
fr: Propriétés communes

source: The :class:`date`, :class:`.datetime`, :class:`.time`, and :class:`timezone` types share these common features:
fr: Les types :class:`date`, :class:`.datetime`, :class:`.time`, et :class:`timezone` partagent les caractéristiques suivantes :

source: Objects of these types are hashable, meaning that they can be used as dictionary keys.
fr: Les objets de ces types sont hachables, ce qui signifie qu'ils peuvent être utilisés comme clés de dictionnaire.

source: Objects of these types support efficient pickling via the :mod:`pickle` module.
fr: Les objets de ces types peuvent être sérialisés efficacement par le module :mod:`pickle`.

source: Determining if an Object is Aware or Naive
fr: Catégorisation d'un objet en « avisé » ou « naïf »

source: Objects of the :class:`date` type are always naive.
fr: Les objets de type :class:`date` sont toujours naïfs.

source: An object of type :class:`.time` or :class:`.datetime` may be aware or naive.
fr: Un objet du type :class:`.time` ou :class:`.datetime` peut être avisé ou naïf.

source: A :class:`.datetime` object *d* is aware if both of the following hold:
fr: Un objet :class:`.datetime` *d* est avisé si les deux conditions suivantes vérifient :

source: ``d.tzinfo`` is not ``None``
fr: ``d.tzinfo`` ne vaut pas ``None``

source: ``d.tzinfo.utcoffset(d)`` does not return ``None``
fr: ``d.tzinfo.utcoffset(d)`` ne renvoie pas ``None``

source: Otherwise, *d* is naive.
fr: Autrement, *d* est naïf.

source: A :class:`.time` object *t* is aware if both of the following hold:
fr: Un objet :class:`.time` *t* est avisé si les deux conditions suivantes vérifient :

source: ``t.tzinfo`` is not ``None``
fr: ``t.tzinfo`` ne vaut pas ``None``

source: ``t.tzinfo.utcoffset(None)`` does not return ``None``.
fr: ``t.tzinfo.utcoffset(None)`` ne renvoie pas ``None``.

source: Otherwise, *t* is naive.
fr: Autrement, *t* est naïf.

source: The distinction between aware and naive doesn't apply to :class:`timedelta` objects.
fr: La distinction entre avisé et naïf ne s'applique pas aux objets de type :class:`timedelta`.

source: :class:`timedelta` Objects
fr: Objets :class:`timedelta`

source: A :class:`timedelta` object represents a duration, the difference between two dates or times.
fr: Un objet :class:`timedelta` représente une durée, c'est-à-dire la différence entre deux dates ou heures.

source: All arguments are optional and default to ``0``. Arguments may be integers or floats, and may be positive or negative.
fr: Tous les paramètres sont optionnels et ont ``0`` comme valeur par défaut. Les paramètres peuvent être des entiers ou des flottants et ils peuvent être positifs ou négatifs.

source: Only *days*, *seconds* and *microseconds* are stored internally. Arguments are converted to those units:
fr: Seuls les *jours*, les *secondes* et les *microsecondes* sont stockés en interne. Tous les paramètres sont convertis dans ces unités :

source: A millisecond is converted to 1000 microseconds.
fr: Une milliseconde est convertie en 1000 microsecondes.

source: A minute is converted to 60 seconds.
fr: Une minute est convertie en 60 secondes.

source: An hour is converted to 3600 seconds.
fr: Une heure est convertie en 3600 secondes.

source: A week is converted to 7 days.
fr: Une semaine est convertie en 7 jours.

source: and days, seconds and microseconds are then normalized so that the representation is unique, with
fr: et ensuite les jours, secondes et microsecondes sont normalisés pour que la représentation soit unique avec

source: ``0 <= seconds < 3600*24`` (the number of seconds in one day)
fr: ``0 <= secondes < 3600*24`` (le nombre de secondes dans une journée)

source: The following example illustrates how any arguments besides *days*, *seconds* and *microseconds* are "merged" and normalized into those three resulting attributes::
fr: L'exemple suivant illustre comment tous les arguments autres que *days*, *seconds* et *microseconds* sont « fusionnés » et normalisés dans ces trois attributs résultants ::

source: If any argument is a float and there are fractional microseconds, the fractional microseconds left over from all arguments are combined and their sum is rounded to the nearest microsecond using round-half-to-even tiebreaker. If no argument is a float, the conversion and normalization processes are exact (no information is lost).
fr: Si l'un des arguments est un flottant et qu'il y a des microsecondes décimales, les microsecondes décimales laissées par les arguments sont combinées et leur somme est arrondie à la microseconde la plus proche (en arrondissant les demis vers le nombre pair). Si aucun argument n'est flottant, les processus de conversion et de normalisation seront exacts (pas d'informations perdues).

source: If the normalized value of days lies outside the indicated range, :exc:`OverflowError` is raised.
fr: Si la valeur normalisée des jours déborde de l'intervalle indiqué, une :exc:`OverflowError` est levée.

source: Note that normalization of negative values may be surprising at first. For example::
fr: Notez que la normalisation de valeurs négatives peut être surprenante au premier abord. Par exemple ::

source: Class attributes:
fr: Attributs de la classe :

source: The most negative :class:`timedelta` object, ``timedelta(-999999999)``.
fr: L'objet :class:`timedelta` le plus négatif, ``timedelta(-999999999)``.

source: The most positive :class:`timedelta` object, ``timedelta(days=999999999, hours=23, minutes=59, seconds=59, microseconds=999999)``.
fr: L'objet :class:`timedelta` le plus positif, ``timedelta(days=999999999, hours=23, minutes=59, seconds=59, microseconds=999999)``.

source: The smallest possible difference between non-equal :class:`timedelta` objects, ``timedelta(microseconds=1)``.
fr: La plus petite différence entre des objets :class:`timedelta` non égaux, ``timedelta(microseconds=1)``.

source: Note that, because of normalization, ``timedelta.max`` > ``-timedelta.min``. ``-timedelta.max`` is not representable as a :class:`timedelta` object.
fr: Il est à noter, du fait de la normalisation, que ``timedelta.max`` > ``-timedelta.min``. ``-timedelta.max`` n'est pas représentable sous la forme d'un objet :class:`timedelta`.

source: Instance attributes (read-only):
fr: Attributs de l'instance (en lecture seule) :

source: Attribute
fr: Attribut

source: Value
fr: Valeur

source: Between -999999999 and 999999999 inclusive
fr: Entre ``-999999999`` et ``999999999`` inclus

source: Between 0 and 86399 inclusive
fr: Entre 0 et 86399 inclus

source: Between 0 and 999999 inclusive
fr: Entre 0 et 999999 inclus

source: Supported operations:
fr: Opérations gérées :

source: Operation
fr: Opération

source: Result
fr: Résultat

source: Sum of *t2* and *t3*. Afterwards *t1*-*t2* == *t3* and *t1*-*t3* == *t2* are true. (1)
fr: Somme de *t2* et *t3*. Ensuite ``t1 - t2 == t3`` et ``t1 - t3 == t2`` sont des expressions vraies. (1)

source: Difference of *t2* and *t3*. Afterwards *t1* == *t2* - *t3* and *t2* == *t1* + *t3* are true. (1)(6)
fr: Différence entre *t2* et *t3*. Ensuite ``t1 == t2 - t3`` et ``t2 == t1 + t3`` sont des expressions vraies. (1)(6)

source: Delta multiplied by an integer. Afterwards *t1* // i == *t2* is true, provided ``i != 0``.
fr: Delta multiplié par un entier. Ensuite *t1* // i == *t2* est vrai, en admettant que ``i != 0``.

source: In general, *t1* \* i == *t1* \* (i-1) + *t1* is true. (1)
fr: De manière générale, *t1* \* i == *t1* \* (i-1) + *t1* est vrai. (1)

source: Delta multiplied by a float. The result is rounded to the nearest multiple of timedelta.resolution using round-half-to-even.
fr: Delta multiplié par un flottant. Le résultat est arrondi au multiple le plus proche de ``timedelta.resolution`` en utilisant la règle de l'arrondi au pair le plus proche.

source: Division (3) of overall duration *t2* by interval unit *t3*. Returns a :class:`float` object.
fr: Division (3) de la durée totale *t2* par l'unité d'intervalle *t3*. Renvoie un objet :class:`float`.

source: Delta divided by a float or an int. The result is rounded to the nearest multiple of timedelta.resolution using round-half-to-even.
fr: Delta divisé par un flottant ou un entier. Le résultat est arrondi au multiple le plus proche de ``timedelta.resolution`` en utilisant la règle de l'arrondi au pair le plus proche.

source: The floor is computed and the remainder (if any) is thrown away. In the second case, an integer is returned. (3)
fr: Le quotient est calculé et le reste (s'il y en a un) est ignoré. Dans le second cas, un entier est renvoyé. (3)

source: The remainder is computed as a :class:`timedelta` object. (3)
fr: Le reste est calculé comme un objet de type :class:`timedelta`. (3)

source: Computes the quotient and the remainder: ``q = t1 // t2`` (3) and ``r = t1 % t2``. q is an integer and r is a :class:`timedelta` object.
fr: Calcule le quotient et le reste : ``q = t1 // t2`` (3) et ``r = t1 % t2``. q est un entier et r est un objet :class:`timedelta`.

source: Returns a :class:`timedelta` object with the same value. (2)
fr: Renvoie un objet :class:`timedelta` avec la même valeur. (2)

source: equivalent to :class:`timedelta`\ (-*t1.days*, -*t1.seconds*, -*t1.microseconds*), and to *t1*\* -1. (1)(4)
fr: équivalent à :class:`timedelta`\ (*-t1.days*, *-t1.seconds*, *-t1.microseconds*), et à ``t1 * -1``. (1)(4)

source: equivalent to +\ *t* when ``t.days >= 0``, and to -*t* when ``t.days < 0``. (2)
fr: équivalent à ``+t`` quand ``t.days >= 0``, et à ``-t`` quand ``t.days < 0``. (2)

source: Returns a string in the form ``[D day[s], ][H]H:MM:SS[.UUUUUU]``, where D is negative for negative ``t``. (5)
fr: Renvoie une chaîne de la forme ``[D day[s], ][H]H:MM:SS[.UUUUUU]``, où D est négatif pour ``t`` négatif. (5)

source: Returns a string representation of the :class:`timedelta` object as a constructor call with canonical attribute values.
fr: Renvoie une chaîne de la forme objet :class:`timedelta` comme un appel construit avec des valeurs d'attributs canoniques.

source: This is exact but may overflow.
fr: Ceci est exact, mais peut provoquer un débordement.

source: This is exact and cannot overflow.
fr: Ceci est exact, et ne peut pas provoquer un débordement.

source: Division by 0 raises :exc:`ZeroDivisionError`.
fr: Une division par 0 provoque :exc:`ZeroDivisionError`.

source: -*timedelta.max* is not representable as a :class:`timedelta` object.
fr: *-timedelta.max* n'est pas représentable avec un objet :class:`timedelta`.

source: String representations of :class:`timedelta` objects are normalized similarly to their internal representation. This leads to somewhat unusual results for negative timedeltas. For example::
fr: La représentation en chaîne de caractères des objets :class:`timedelta` est normalisée similairement à leur représentation interne. Cela amène à des résultats inhabituels pour des *timedeltas* négatifs. Par exemple ::

source: The expression ``t2 - t3`` will always be equal to the expression ``t2 + (-t3)`` except when t3 is equal to ``timedelta.max``; in that case the former will produce a result while the latter will overflow.
fr: L'expression ``t2 - t3`` est toujours égale à l'expression ``t2 + (-t3)`` sauf si *t3* vaut ``timedelta.max`` ; dans ce cas, la première expression produit une valeur alors que la seconde lève une ``OverflowError``.

source: In addition to the operations listed above, :class:`timedelta` objects support certain additions and subtractions with :class:`date` and :class:`.datetime` objects (see below).
fr: En plus des opérations listées ci-dessus, les objets :class:`timedelta` implémentent certaines additions et soustractions avec des objets :class:`date` et :class:`datetime` (voir ci-dessous).

source: Floor division and true division of a :class:`timedelta` object by another :class:`timedelta` object are now supported, as are remainder operations and the :func:`divmod` function. True division and multiplication of a :class:`timedelta` object by a :class:`float` object are now supported.
fr: La division entière et la vraie division d'un objet :class:`timedelta` par un autre :class:`timedelta` sont maintenant gérées, comme le sont les opérations de reste euclidien et la fonction :func:`divmod`. La vraie division et la multiplication d'un objet :class:`timedelta` par un :class:`float` sont maintenant implémentées.

source: Comparisons of :class:`timedelta` objects are supported, with some caveats.
fr: Les comparaisons des objets :class:`timedelta` sont gérées, avec quelques réserves.

source: The comparisons ``==`` or ``!=`` *always* return a :class:`bool`, no matter the type of the compared object::
fr: Les comparaisons ``==`` ou ``!=`` renvoient *toujours* un :class:`bool`, quel que soit le type de l'objet comparé ::

source: For all other comparisons (such as ``<`` and ``>``), when a :class:`timedelta` object is compared to an object of a different type, :exc:`TypeError` is raised::
fr: Pour toutes les autres comparaisons (telles que ``<`` et ``>``), lorsqu'un objet :class:`timedelta` est comparé à un objet d'un type différent, :exc:`TypeError` est levée ::

source: In Boolean contexts, a :class:`timedelta` object is considered to be true if and only if it isn't equal to ``timedelta(0)``.
fr: Dans les contextes booléens, un objet :class:`timedelta` est considéré comme vrai si et seulement s'il n'est pas égal à ``timedelta(0)``.

source: Instance methods:
fr: Méthodes de l'instance :

source: Return the total number of seconds contained in the duration. Equivalent to ``td / timedelta(seconds=1)``. For interval units other than seconds, use the division form directly (e.g. ``td / timedelta(microseconds=1)``).
fr: Renvoie le nombre total de secondes contenues dans la durée. Équivalent à ``td / timedelta(seconds=1)``. Pour un intervalle dont l'unité n'est pas la seconde, utilisez directement la division (par exemple, ``td / timedelta(microseconds=1)``).

source: Note that for very large time intervals (greater than 270 years on most platforms) this method will lose microsecond accuracy.
fr: Notez que pour des intervalles de temps très larges (supérieurs à 270 ans sur la plupart des plateformes), cette méthode perdra la précision des microsecondes.

source: Examples of usage: :class:`timedelta`
fr: Exemples d'utilisation de la classe :class:`timedelta` :

source: An additional example of normalization::
fr: Un exemple supplémentaire de normalisation ::

source: Examples of :class:`timedelta` arithmetic::
fr: Exemples d'arithmétique avec la classe :class:`timedelta` ::

source: :class:`date` Objects
fr: Objets :class:`date`

source: A :class:`date` object represents a date (year, month and day) in an idealized calendar, the current Gregorian calendar indefinitely extended in both directions.
fr: Un objet :class:`date` représente une date (année, mois et jour) dans un calendrier idéal, le calendrier grégorien actuel étant indéfiniment étendu dans les deux sens.

source: January 1 of year 1 is called day number 1, January 2 of year 1 is called day number 2, and so on. [#]_
fr: Le 1\ :sup:`er` janvier de l'année 1 est appelé jour numéro 1, le 2 janvier de l'année 1 est appelé jour numéro 2, et ainsi de suite. [#]_
