Repository: python/python-docs-fr
Catalog: library/datetime.po
Languages: fr

source: ISO 8601 weekday as a decimal number where 1 is Monday.
fr: Jour de la semaine ISO 8601 où 1 correspond au lundi.

source: ISO 8601 week as a decimal number with Monday as the first day of the week. Week 01 is the week containing Jan 4.
fr: Numéro de la semaine ISO 8601, avec lundi étant le premier jour de la semaine. La semaine 01 est la semaine contenant le 4 janvier.

source: ``%G``, ``%u`` and ``%V`` were added.
fr: ``%G``, ``%u`` et ``%V`` ont été ajoutés.

source: Technical Detail
fr: Détail technique

source: For the :meth:`datetime.strptime` class method, the default value is ``1900-01-01T00:00:00.000``: any components not specified in the format string will be pulled from the default value. [#]_
fr: Pour la méthode :meth:`datetime.strptime`, la valeur par défaut est ``1900-01-01T00:00:00.000`` : tous les composants non spécifiés dans la chaîne de formatage seront retirés de la valeur par défaut. [#]_

source: Using ``datetime.strptime(date_string, format)`` is equivalent to::
fr: L'utilisation de ``datetime.strptime(date_string, format)`` équivaut à ::

source: except when the format includes sub-second components or timezone offset information, which are supported in ``datetime.strptime`` but are discarded by ``time.strptime``.
fr: sauf lorsque le format inclut des composantes de sous-secondes ou des informations de décalage de fuseau horaire, qui sont prises en charge dans ``datetime.strptime`` mais pas par ``time.strptime``.

source: For the same reason, handling of format strings containing Unicode code points that can't be represented in the charset of the current locale is also platform-dependent. On some platforms such code points are preserved intact in the output, while on others ``strftime`` may raise :exc:`UnicodeError` or return an empty string instead.
fr: Pour la même raison, la gestion des chaînes contenant des caractères (ou points) Unicode qui ne peuvent pas être représentés dans la *locale* actuelle dépend aussi de la plateforme. Sur certaines plateformes, ces caractères sont conservés tels quels dans la sortie, alors que sur d'autres plateformes ``strftime`` lève une :exc:`UnicodeError` ou renvoie une chaîne vide.

source: Because the format depends on the current locale, care should be taken when making assumptions about the output value. Field orderings will vary (for example, "month/day/year" versus "day/month/year"), and the output may contain Unicode characters encoded using the locale's default encoding (for example, if the current locale is ``ja_JP``, the default encoding could be any one of ``eucJP``, ``SJIS``, or ``utf-8``; use :meth:`locale.getlocale` to determine the current locale's encoding).
fr: Comme le format dépend de la locale courante, les assomptions sur la valeur de retour doivent être prises soigneusement. L'ordre des champs variera (par exemple, « mois/jour/année » versus « année/mois/jour »), et le retour pourrait contenir des caractères Unicode encodés en utilisant l'encodage par défaut de la locale (par exemple, si la locale courante est ``ja_JP``, l'encodage par défaut pourrait être ``eucJP``, ``SJIS`` ou ``utf-8`` ; utilisez :meth:`locale.getlocale` pour déterminer l'encodage de la locale courante).

source: The :meth:`strptime` method can parse years in the full [1, 9999] range, but years < 1000 must be zero-filled to 4-digit width.
fr: La méthode :meth:`strptime` peut analyser toutes les années de l'intervalle [1, 9999], mais toutes les années < 1000 doivent être représentées sur quatre chiffres.

source: In previous versions, :meth:`strftime` method was restricted to years >= 1900.
fr: Dans les versions précédentes, la méthode :meth:`strftime` était limitée aux années >= 1900.

source: In version 3.2, :meth:`strftime` method was restricted to years >= 1000.
fr: En version 3.2, la méthode :meth:`strftime` était limitée aux années >= 1000.

source: When used with the :meth:`strptime` method, the ``%p`` directive only affects the output hour field if the ``%I`` directive is used to parse the hour.
fr: Quand utilisée avec la méthode :meth:`strptime`, la directive ``%p`` n'affecte l'heure extraite que si la directive ``%I`` est utilisée pour analyser l'heure.

source: Unlike the :mod:`time` module, the :mod:`datetime` module does not support leap seconds.
fr: À l'inverse du module :mod:`time`, le module :mod:`datetime` ne gère pas les secondes intercalaires.

source: For a naive object, the ``%z`` and ``%Z`` format codes are replaced by empty strings.
fr: Pour les objets naïfs, les codes de formatage ``%z`` et ``%Z`` sont remplacés par des chaînes vides.

source: For an aware object:
fr: Pour un objet avisé :

source: When the ``%z`` directive is provided to the :meth:`strptime` method, the UTC offsets can have a colon as a separator between hours, minutes and seconds. For example, ``'+01:00:00'`` will be parsed as an offset of one hour. In addition, providing ``'Z'`` is identical to ``'+00:00'``.
fr: Quand la directive ``%z`` est soumise à la méthode :meth:`strptime`, le décalage UTC peut avoir une colonne comme séparateur entre les heures, minutes et secondes. Par exemple, ``'+01:00:00'``, est analysé comme un décalage d'une heure. Par ailleurs, ``'Z'`` est identique à ``'+00:00'``.

source: When used with the :meth:`strptime` method, ``%U`` and ``%W`` are only used in calculations when the day of the week and the calendar year (``%Y``) are specified.
fr: Quand ces directives sont utilisées avec la méthode :meth:`strptime`, ``%U`` et ``%W`` ne sont utilisées dans les calculs que si le jour de la semaine et l'année calendaire (``%Y``) sont spécifiés.

source: Similar to ``%U`` and ``%W``, ``%V`` is only used in calculations when the day of the week and the ISO year (``%G``) are specified in a :meth:`strptime` format string. Also note that ``%G`` and ``%Y`` are not interchangeable.
fr: De façon similaire à ``%U`` et ``%W``, ``%v`` n'est utilisé dans les calculs que lorsque le jour de la semaine et l'année ISO (``%G``) sont spécifiés dans la chaîne de formatage :meth:`strptime`. Notez aussi que ``%G`` et ``%Y`` ne sont pas interchangeables.

source: When used with the :meth:`strptime` method, the leading zero is optional for formats ``%d``, ``%m``, ``%H``, ``%I``, ``%M``, ``%S``, ``%J``, ``%U``, ``%W``, and ``%V``. Format ``%y`` does require a leading zero.
fr: Quand cette directive est utilisée avec la méthode :meth:`strptime`, le zéro d'entête est optionnel pour les formats ``%d``, ``%m``, ``%H``, ``%I``, ``%M``, ``%S``, ``%J``, ``%U``, ``%W`` et ``%V``. Le format ``%y`` requiert un zéro en entête.

source: Footnotes
fr: Notes

source: If, that is, we ignore the effects of Relativity
fr: Si on ignore les effets de la Relativité

source: Passing ``datetime.strptime('Feb 29', '%b %d')`` will fail since ``1900`` is not a leap year.
fr: Passer ``datetime.strptime(‘Feb 29’, ‘%b %d’)`` ne marchera pas car ``1900`` n’est pas une année bissextile.
