Repository: python/python-docs-fr
Catalog: library/datetime.po
Languages: fr

source: All arguments are required. Arguments must be integers, in the following ranges:
fr: Tous les arguments sont requis. Les arguments peuvent être des entiers, dans les intervalles suivants :

source: ``1 <= day <= number of days in the given month and year``
fr: ``1 <= day <= nombre de jours dans le mois et l'année donnés``

source: If an argument outside those ranges is given, :exc:`ValueError` is raised.
fr: Si un argument est donné en dehors de ces intervalles, une :exc:`valueError` est levée.

source: Other constructors, all class methods:
fr: Autres constructeurs, méthodes de classe :

source: Return the current local date.
fr: Renvoie la date locale courante.

source: This is equivalent to ``date.fromtimestamp(time.time())``.
fr: Cela est équivalent à ``date.fromtimestamp(time.time())``.

source: Return the local date corresponding to the POSIX timestamp, such as is returned by :func:`time.time`.
fr: Renvoie la date locale correspondant à l'horodatage POSIX, telle que renvoyée par :func:`time.time`.

source: This may raise :exc:`OverflowError`, if the timestamp is out of the range of values supported by the platform C :c:func:`localtime` function, and :exc:`OSError` on :c:func:`localtime` failure. It's common for this to be restricted to years from 1970 through 2038. Note that on non-POSIX systems that include leap seconds in their notion of a timestamp, leap seconds are ignored by :meth:`fromtimestamp`.
fr: Elle peut lever une :exc:`OverflowError`, si l'horodatage est en dehors des bornes gérées par la fonction C :c:func:`localtime` de la plateforme, et une :exc:`OSError` en cas d'échec de :c:func:`localtime`. Il est commun d'être restreint aux années entre 1970 et 2038. Notez que sur les systèmes non *POSIX* qui incluent les secondes intercalaires dans leur notion d'horodatage, ces secondes sont ignorées par :meth:`fromtimestamp`.

source: Raise :exc:`OverflowError` instead of :exc:`ValueError` if the timestamp is out of the range of values supported by the platform C :c:func:`localtime` function. Raise :exc:`OSError` instead of :exc:`ValueError` on :c:func:`localtime` failure.
fr: Lève une :exc:`OverflowError` plutôt qu'une :exc:`ValueError` si l'horodatage (*timestamp* en anglais) est en dehors des bornes gérées par la fonction C :c:func:`localtime` de la plateforme. Lève une :exc:`OSError` plutôt qu'une :exc:`ValueError` en cas d'échec de :c:func:`localtime`.

source: Return the date corresponding to the proleptic Gregorian ordinal, where January 1 of year 1 has ordinal 1.
fr: Renvoie la date correspondant à l'ordinal grégorien proleptique, où le 1er janvier de l'an 1 a l'ordinal 1.

source: :exc:`ValueError` is raised unless ``1 <= ordinal <= date.max.toordinal()``. For any date *d*, ``date.fromordinal(d.toordinal()) == d``.
fr: :exc:`ValueError` est levée à moins que ``1 <= ordinal <= date.max.toordinal()``. Pour toute date *d*, ``date.fromordinal(d.toordinal()) == d``.

source: Return a :class:`date` corresponding to a *date_string* given in the format ``YYYY-MM-DD``::
fr: Renvoie une :class:`date` correspondant à *date_string* dans le format ``YYYY-MM-DD`` ::

source: This is the inverse of :meth:`date.isoformat`. It only supports the format ``YYYY-MM-DD``.
fr: C'est la réciproque de :meth:`date.isoformat`. Elle ne prend en charge que le format ``YYYY-MM-DD``.

source: Return a :class:`date` corresponding to the ISO calendar date specified by year, week and day. This is the inverse of the function :meth:`date.isocalendar`.
fr: Renvoie une :class:`date` correspondant à la date du calendrier ISO définie par l'année, la semaine et le jour. C'est la réciproque de la fonction :meth:`date.isocalendar`.

source: The earliest representable date, ``date(MINYEAR, 1, 1)``.
fr: La plus vieille date représentable, ``date(MINYEAR, 1, 1)``.

source: The latest representable date, ``date(MAXYEAR, 12, 31)``.
fr: La dernière date représentable, ``date(MAXYEAR, 12, 31)``.

source: The smallest possible difference between non-equal date objects, ``timedelta(days=1)``.
fr: La plus petite différence possible entre deux objets dates non-égaux, ``timedelta(days=1)``.

source: Between :const:`MINYEAR` and :const:`MAXYEAR` inclusive.
fr: Entre :const:`MINYEAR` et :const:`MAXYEAR` inclus.

source: Between 1 and 12 inclusive.
fr: Entre 1 et 12 inclus.

source: Between 1 and the number of days in the given month of the given year.
fr: Entre 1 et le nombre de jours du mois donné de l'année donnée.

source: *date2* is ``timedelta.days`` days removed from *date1*. (1)
fr: *date2* est décalée de ``timedelta.days`` jours par rapport à *date1*. (1)

source: Computes *date2* such that ``date2 + timedelta == date1``. (2)
fr: Calcule *date2* de façon à avoir ``date2 + timedelta == date1``. (2)

source: *date1* is considered less than *date2* when *date1* precedes *date2* in time. (4)
fr: *date1* est considérée comme inférieure à *date2* quand *date1* précède *date2* dans le temps. (4)

source: *date2* is moved forward in time if ``timedelta.days > 0``, or backward if ``timedelta.days < 0``. Afterward ``date2 - date1 == timedelta.days``. ``timedelta.seconds`` and ``timedelta.microseconds`` are ignored. :exc:`OverflowError` is raised if ``date2.year`` would be smaller than :const:`MINYEAR` or larger than :const:`MAXYEAR`.
fr: *date2* est déplacée en avant dans le temps si ``timedelta.days > 0``, ou en arrière si ``timedelta.days < 0``. Après quoi ``date2 - date1 == timedelta.days``. ``timedelta.seconds`` et ``timedelta.microseconds`` sont ignorés. Une :exc:`OverflowError` est levée si ``date2.year`` devait être inférieure à :const:`MINYEAR` ou supérieure à :const:`MAXYEAR`.

source: ``timedelta.seconds`` and ``timedelta.microseconds`` are ignored.
fr: ``timedelta.seconds`` et ``timedelta.microseconds`` sont ignorés.

source: This is exact, and cannot overflow. timedelta.seconds and timedelta.microseconds are 0, and date2 + timedelta == date1 after.
fr: Cela est exact, et ne peut pas provoquer de débordement. ``timedelta.seconds`` et ``timedelta.microseconds`` valent ``0``, et ``date2 + timedelta == date1`` après cela.

source: In other words, ``date1 < date2`` if and only if ``date1.toordinal() < date2.toordinal()``. Date comparison raises :exc:`TypeError` if the other comparand isn't also a :class:`date` object. However, ``NotImplemented`` is returned instead if the other comparand has a :meth:`timetuple` attribute. This hook gives other kinds of date objects a chance at implementing mixed-type comparison. If not, when a :class:`date` object is compared to an object of a different type, :exc:`TypeError` is raised unless the comparison is ``==`` or ``!=``. The latter cases return :const:`False` or :const:`True`, respectively.
fr: En d'autres termes, ``date1 < date2`` si et seulement si ``date1.toordinal() < date2.toordinal()``. La comparaison de dates lève une :exc:`TypeError` si l'autre opérande n'est pas un objet :class:`date`. Cependant, ``NotImplemented`` est renvoyé à la place si l'autre opérande a un attribut :meth:`timetuple`. Cela permet à d'autres types d'objets dates d'avoir une chance d'implémenter une comparaison entre types différents. Sinon, quand un objet :class:`date` est comparé à un objet d'un type différent, une :exc:`TypeError` est levée à moins que la comparaison soit ``==`` ou ``!=``. Ces derniers cas renvoient respectivement :const:`False` et :const:`True`.

source: In Boolean contexts, all :class:`date` objects are considered to be true.
fr: Dans des contextes booléens, tous les objets :class:`date` sont considérés comme vrai.

source: Return a date with the same value, except for those parameters given new values by whichever keyword arguments are specified.
fr: Renvoie une date avec la même valeur, excepté pour les valeurs spécifiées par arguments nommés.

source: Example::
fr: Exemple ::

source: Return a :class:`time.struct_time` such as returned by :func:`time.localtime`.
fr: Renvoie une :class:`time.struct_time` telle que renvoyée par :func:`time.localtime`.

source: The hours, minutes and seconds are 0, and the DST flag is -1.
fr: Les heures, minutes et secondes sont égales à 0 et le drapeau DST vaut -1.

source: ``d.timetuple()`` is equivalent to::
fr: ``d.timetuple()`` est équivalent à ::

source: where ``yday = d.toordinal() - date(d.year, 1, 1).toordinal() + 1`` is the day number within the current year starting with ``1`` for January 1st.
fr: où ``yday = d.toordinal() - date(d.year, 1, 1).toordinal() + 1`` est le numéro du jour dans l'année courante commençant par ``1`` pour le 1\ :sup:`er` janvier.

source: Return the proleptic Gregorian ordinal of the date, where January 1 of year 1 has ordinal 1. For any :class:`date` object *d*, ``date.fromordinal(d.toordinal()) == d``.
fr: Renvoie l'ordinal grégorien proleptique de la date, où le 1er janvier de l'an 1 a l'ordinal 1. Pour tout objet :class:`date` *d*, ``date.fromordinal(d.toordinal()) == d``.

source: Return the day of the week as an integer, where Monday is 0 and Sunday is 6. For example, ``date(2002, 12, 4).weekday() == 2``, a Wednesday. See also :meth:`isoweekday`.
fr: Renvoie le jour de la semaine sous forme de nombre, où lundi vaut 0 et dimanche vaut 6. Par exemple, ``date(2002, 12, 4).weekday() == 2``, un mercredi. Voir aussi :meth:`isoweekday`.

source: Return the day of the week as an integer, where Monday is 1 and Sunday is 7. For example, ``date(2002, 12, 4).isoweekday() == 3``, a Wednesday. See also :meth:`weekday`, :meth:`isocalendar`.
fr: Renvoie le jour de la semaine sous forme de nombre, où lundi vaut 1 et dimanche vaut 7. Par exemple, ``date(2002, 12, 4).isoweekday() == 3``, un mercredi. Voir aussi :meth:`weekday`, :meth:`isocalendar`.

source: Return a :term:`named tuple` object with three components: ``year``, ``week`` and ``weekday``.
fr: Renvoie un objet :term:`named tuple` avec trois composants : ``year``, ``week`` et ``weekday``.

source: The ISO calendar is a widely used variant of the Gregorian calendar. [#]_
fr: Le calendrier ISO est une variante largement utilisée du calendrier grégorien. [#]_

source: The ISO year consists of 52 or 53 full weeks, and where a week starts on a Monday and ends on a Sunday. The first week of an ISO year is the first (Gregorian) calendar week of a year containing a Thursday. This is called week number 1, and the ISO year of that Thursday is the same as its Gregorian year.
fr: Une année ISO est composée de 52 ou 53 semaines pleines, où chaque semaine débute un lundi et se termine un dimanche. La première semaine d'une année ISO est la première semaine calendaire (grégorienne) de l'année comportant un jeudi. Elle est appelée la semaine numéro 1, et l'année ISO de ce jeudi est la même que son année Grégorienne.

source: For example, 2004 begins on a Thursday, so the first week of ISO year 2004 begins on Monday, 29 Dec 2003 and ends on Sunday, 4 Jan 2004::
fr: Par exemple, l'année 2004 débute un jeudi, donc la première semaine de l'année ISO 2004 débute le lundi 29 décembre 2003 et se termine le dimanche 4 janvier 2004 ::

source: Result changed from a tuple to a :term:`named tuple`.
fr: Le résultat a changé d'un *n*-uplet à un :term:`named tuple`.

source: Return a string representing the date in ISO 8601 format, ``YYYY-MM-DD``::
fr: Renvoie une chaîne de caractères représentant la date au format ISO 8601, "YYYY-MM-DD" ::

source: This is the inverse of :meth:`date.fromisoformat`.
fr: C'est la réciproque de :meth:`date.fromisoformat`.

source: For a date *d*, ``str(d)`` is equivalent to ``d.isoformat()``.
fr: Pour une date *d*, ``str(d)`` est équivalent à ``d.isoformat()``.

source: Return a string representing the date::
fr: Renvoie une chaîne de caractères représentant la date ::

source: ``d.ctime()`` is equivalent to::
fr: ``d.ctime()`` est équivalent à ::

source: on platforms where the native C :c:func:`ctime` function (which :func:`time.ctime` invokes, but which :meth:`date.ctime` does not invoke) conforms to the C standard.
fr: sur les plateformes où la fonction C native :c:func:`ctime` (que :func:`time.ctime` invoque, mais pas :meth:`date.ctime`) est conforme au standard C.

source: Return a string representing the date, controlled by an explicit format string. Format codes referring to hours, minutes or seconds will see 0 values. For a complete list of formatting directives, see :ref:`strftime-strptime-behavior`.
fr: Renvoie une chaîne de caractères représentant la date, contrôlée par une chaîne de formatage explicite. Les codes de formatage se référant aux heures, minutes ou secondes auront pour valeur 0. Pour une liste complète des directives de formatage, voir :ref:`strftime-strptime-behavior`.

source: Same as :meth:`.date.strftime`. This makes it possible to specify a format string for a :class:`.date` object in :ref:`formatted string literals <f-strings>` and when using :meth:`str.format`. For a complete list of formatting directives, see :ref:`strftime-strptime-behavior`.
fr: Identique à :meth:`.date.strftime`. Cela permet de spécifier une chaîne de formatage pour un objet :class:`.date` dans une :ref:`chaîne de formatage littérale <f-strings>` et à l'utilisation de :meth:`str.format`. Pour une liste complète des directives de formatage, voir :ref:`strftime-strptime-behavior`.

source: Examples of Usage: :class:`date`
fr: Exemple d'utilisation de la classe :class:`date` :

source: Example of counting days to an event::
fr: Exemple de décompte des jours avant un évènement ::

source: More examples of working with :class:`date`:
fr: Plus d'exemples avec la classe :class:`date` :

source: :class:`.datetime` Objects
fr: Objets :class:`.datetime`

source: A :class:`.datetime` object is a single object containing all the information from a :class:`date` object and a :class:`.time` object.
fr: Un objet :class:`.datetime` est un seul et même objet contenant toute l'information d'un objet :class:`date` et d'un objet :class:`time`.

source: Like a :class:`date` object, :class:`.datetime` assumes the current Gregorian calendar extended in both directions; like a :class:`.time` object, :class:`.datetime` assumes there are exactly 3600\*24 seconds in every day.
fr: Comme un objet :class:`date`, un objet :class:`.datetime` utilise le calendrier Grégorien actuel étendu vers le passé et le futur ; comme un objet :class:`.time`, un objet :class:`.datetime` suppose qu'il y a exactement 3600\*24 secondes chaque jour.

source: Constructor:
fr: Constructeur :

source: The *year*, *month* and *day* arguments are required. *tzinfo* may be ``None``, or an instance of a :class:`tzinfo` subclass. The remaining arguments must be integers in the following ranges:
fr: Les arguments *year*, *month* et *day* sont requis. *tzinfo* peut être ``None`` ou une instance d'une sous-classe de :class:`tzinfo`. Les arguments restant doivent être des nombres, dans les intervalles suivants :

source: ``1 <= day <= number of days in the given month and year``,
fr: ``1 <= day <= nombre de jours dans le mois donné de l'année donnée``,

source: Added the ``fold`` argument.
fr: Ajout de l'argument ``fold``.

source: Return the current local datetime, with :attr:`.tzinfo` ``None``.
fr: Renvoie la date locale actuelle, avec :attr:`.tzinfo` ``None``.

source: Equivalent to::
fr: Équivalent à ::

source: See also :meth:`now`, :meth:`fromtimestamp`.
fr: Voir aussi :meth:`now`, :meth:`fromtimestamp`.

source: This method is functionally equivalent to :meth:`now`, but without a ``tz`` parameter.
fr: Cette méthode est fonctionnellement équivalente à :meth:`now`, mais sans le paramètre ``tz``.

source: Return the current local date and time.
fr: Renvoie la date et l'heure locale actuelle.

source: This function is preferred over :meth:`today` and :meth:`utcnow`.
fr: Cette fonction est préférée à :meth:`today` et :meth:`utcnow`.

source: Return the current UTC date and time, with :attr:`.tzinfo` ``None``.
fr: Renvoie la date et l'heure UTC actuelle, avec :attr:`.tzinfo` ``None``.

source: Because naive ``datetime`` objects are treated by many ``datetime`` methods as local times, it is preferred to use aware datetimes to represent times in UTC. As such, the recommended way to create an object representing the current time in UTC is by calling ``datetime.now(timezone.utc)``.
fr: Parce que les objets naïfs ``datetime`` sont traités par de nombreuses méthodes ``datetime`` comme des heures locales, il est préférable d'utiliser les dates connues pour représenter les heures en UTC. En tant que tel, le moyen recommandé pour créer un objet représentant l'heure actuelle en UTC est d'appeler ``datetime.now(timezone.utc)``.

source: Return the local date and time corresponding to the POSIX timestamp, such as is returned by :func:`time.time`. If optional argument *tz* is ``None`` or not specified, the timestamp is converted to the platform's local date and time, and the returned :class:`.datetime` object is naive.
fr: Renvoie la date et l'heure locales correspondant à l'horodatage (*timestamp* en anglais) *POSIX*, comme renvoyé par :func:`time.time`. Si l'argument optionnel *tz* est ``None`` ou n'est pas spécifié, l'horodatage est converti vers la date et l'heure locales de la plateforme, et l'objet :class:`.datetime` renvoyé est naïf.

source: Raise :exc:`OverflowError` instead of :exc:`ValueError` if the timestamp is out of the range of values supported by the platform C :c:func:`localtime` or :c:func:`gmtime` functions. Raise :exc:`OSError` instead of :exc:`ValueError` on :c:func:`localtime` or :c:func:`gmtime` failure.
fr: Lève une :exc:`OverflowError` plutôt qu'une :exc:`ValueError` si l'horodatage est en dehors de l'intervalle de valeurs gérées par les fonctions C :c:func:`localtime` ou :c:func:`gmtime` de la plateforme. Lève une :exc:`OSError` plutôt qu'une :exc:`ValueError` en cas d'échec de :c:func:`localtime` ou :c:func:`gmtime`.

source: :meth:`fromtimestamp` may return instances with :attr:`.fold` set to 1.
fr: :meth:`fromtimestamp` peut renvoyer des instances avec l'attribut :attr:`.fold` à 1.

source: Return the UTC :class:`.datetime` corresponding to the POSIX timestamp, with :attr:`.tzinfo` ``None``. (The resulting object is naive.)
fr: Renvoie la classe UTC :class:`.datetime` correspondant à l'horodatage POSIX, avec :attr:`.tzinfo` ``None`` (l'objet résultant est naïf).

source: To get an aware :class:`.datetime` object, call :meth:`fromtimestamp`::
fr: Pour obtenir un objet :class:`.datetime` avisé, appelez :meth:`fromtimestamp` ::

source: On the POSIX compliant platforms, it is equivalent to the following expression::
fr: Sur les plateformes respectant *POSIX*, cela est équivalent à l'expression suivante ::

source: except the latter formula always supports the full years range: between :const:`MINYEAR` and :const:`MAXYEAR` inclusive.
fr: excepté que la dernière formule gère l'intervalle complet des années entre :const:`MINYEAR` et :const:`MAXYEAR` incluses.

source: Because naive ``datetime`` objects are treated by many ``datetime`` methods as local times, it is preferred to use aware datetimes to represent times in UTC. As such, the recommended way to create an object representing a specific timestamp in UTC is by calling ``datetime.fromtimestamp(timestamp, tz=timezone.utc)``.
fr: Parce que les objets naïfs ``datetime`` sont traités par de nombreuses méthodes ``datetime`` comme des heures locales, il est préférable d'utiliser les dates connues pour représenter les heures en UTC. En tant que tel, le moyen recommandé pour créer un objet représentant un horodatage spécifique en UTC est d'appeler ``datetime.fromtimestamp(timestamp, tz=timezone.utc)``.

source: Raise :exc:`OverflowError` instead of :exc:`ValueError` if the timestamp is out of the range of values supported by the platform C :c:func:`gmtime` function. Raise :exc:`OSError` instead of :exc:`ValueError` on :c:func:`gmtime` failure.
fr: Lève une :exc:`OverflowError` plutôt qu'une :exc:`ValueError` si l'horodatage est en dehors de l'intervalle de valeurs gérées par la fonction C :c:func:`gmtime` de la plateforme. Lève une :exc:`OSError` plutôt qu'une :exc:`ValueError` en cas d'échec de :c:func:`gmtime`.

source: Added the *tzinfo* argument.
fr: Ajout de l'argument *tzinfo*.

source: Specifically, this function supports strings in the format:
fr: Plus précisément, cette fonction prend en charge les chaînes de caractères dans le format :

source: where ``*`` can match any single character.
fr: où ``*`` peut correspondre à n'importe quel caractère.

source: This does *not* support parsing arbitrary ISO 8601 strings - it is only intended as the inverse operation of :meth:`datetime.isoformat`. A more full-featured ISO 8601 parser, ``dateutil.parser.isoparse`` is available in the third-party package `dateutil <https://dateutil.readthedocs.io/en/stable/parser.html#dateutil.parser.isoparse>`__.
fr: Ceci ne prend pas en charge l'analyse arbitraire des chaînes de caractères ISO 8601 - il est uniquement destiné à l'opération réciproque de :meth:`datetime.isoformat`. Un analyseur ISO 8601 plus complet, ``dateutil.parser.isoparse`` est disponible dans le paquet tiers `dateutil <https://dateutil.readthedocs.io/en/stable/parser.html#dateutil.parser.isoparse>`__.

source: Examples::
fr: Exemples ::

source: Return a :class:`.datetime` corresponding to the ISO calendar date specified by year, week and day. The non-date components of the datetime are populated with their normal default values. This is the inverse of the function :meth:`datetime.isocalendar`.
fr: Renvoie une classe :class:`.datetime` correspondant à la date du calendrier ISO spécifiée par année, semaine et jour. Les composantes ne relevant pas de la date de *datetime* sont renseignées avec leurs valeurs par défaut normales. C'est la réciproque de la fonction :meth:`datetime.isocalendar`.

source: Return a :class:`.datetime` corresponding to *date_string*, parsed according to *format*.
fr: Renvoie une classe :class:`.datetime` correspondant à *date_string*, analysée selon *format*.

source: This is equivalent to::
fr: C’est équivalent à ::

source: The earliest representable :class:`.datetime`, ``datetime(MINYEAR, 1, 1, tzinfo=None)``.
fr: Le plus ancien :class:`.datetime` représentable, ``datetime(MINYEAR, 1, 1, tzinfo=None)``.

source: The latest representable :class:`.datetime`, ``datetime(MAXYEAR, 12, 31, 23, 59, 59, 999999, tzinfo=None)``.
fr: Le dernier :class:`.datetime` représentable, ``datetime(MAXYEAR, 12, 31, 23, 59, 59, 999999, tzinfo=None)``.

source: The smallest possible difference between non-equal :class:`.datetime` objects, ``timedelta(microseconds=1)``.
fr: La plus petite différence possible entre deux objets :class:`.datetime` non-égaux, ``timedelta(microseconds=1)``.

source: In ``range(24)``.
fr: Dans ``range(24)``.

source: In ``range(60)``.
fr: Dans ``range(60)``.

source: In ``range(1000000)``.
fr: Dans ``range(1000000)``.

source: The object passed as the *tzinfo* argument to the :class:`.datetime` constructor, or ``None`` if none was passed.
fr: L'objet passé en tant que paramètre *tzinfo* du constructeur de la classe :class:`.datetime` ou ``None`` si aucun n'a été donné.

source: Compares :class:`.datetime` to :class:`.datetime`. (4)
fr: Compare :class:`.datetime` à :class:`.datetime`. (4)

source: Computes the datetime2 such that datetime2 + timedelta == datetime1. As for addition, the result has the same :attr:`~.datetime.tzinfo` attribute as the input datetime, and no time zone adjustments are done even if the input is aware.
fr: Calcule *datetime2* tel que ``datetime2 + timedelta == datetime1``. Comme pour l'addition, le résultat a le même attribut :attr:`~.datetime.tzinfo` que le *datetime* d'entrée, et aucun ajustement de fuseau horaire n'est réalisé même si l'entrée est avisée.
