Repository: python/python-docs-fr
Catalog: library/datetime.po
Languages: fr

source: *datetime1* is considered less than *datetime2* when *datetime1* precedes *datetime2* in time.
fr: *datetime1* est considéré inférieur à *datetime2* quand il le précède dans le temps.

source: Return :class:`date` object with same year, month and day.
fr: Renvoie un objet :class:`date` avec les mêmes année, mois et jour.

source: The fold value is copied to the returned :class:`.time` object.
fr: La valeur *fold* est copiée vers l'objet :class:`.time` renvoyé.

source: Return a :class:`.datetime` object with new :attr:`.tzinfo` attribute *tz*, adjusting the date and time data so the result is the same UTC time as *self*, but in *tz*'s local time.
fr: Renvoie un objet :class:`.datetime` avec un nouvel attribut :attr:`.tzinfo` valant *tz*, ajustant la date et l'heure pour que le résultat soit le même temps UTC que *self*, mais dans le temps local au fuseau *tz*.

source: If ``self.tzinfo`` is *tz*, ``self.astimezone(tz)`` is equal to *self*: no adjustment of date or time data is performed. Else the result is local time in the timezone *tz*, representing the same UTC time as *self*: after ``astz = dt.astimezone(tz)``, ``astz - astz.utcoffset()`` will have the same date and time data as ``dt - dt.utcoffset()``.
fr: Si ``self.tzinfo`` est *tz*, ``self.astimezone(tz)`` est égal à *self* : aucun ajustement de date ou d'heure n'est réalisé. Sinon le résultat est le temps local dans le fuseau *tz* représentant le même temps UTC que *self* : après ``astz = dt.astimezone(tz)``, ``astz - astz.utcoffset()`` aura les mêmes données de date et d'heure que ``dt - dt.utcoffset()``.

source: Note that the default :meth:`tzinfo.fromutc` method can be overridden in a :class:`tzinfo` subclass to affect the result returned by :meth:`astimezone`. Ignoring error cases, :meth:`astimezone` acts like::
fr: Notez que la méthode par défaut :meth:`tzinfo.fromutc` peut être redéfinie dans une sous-classe :class:`tzinfo` pour affecter le résultat renvoyé par :meth:`astimezone`. En ignorant les cas d'erreurs, :meth:`astimezone` se comporte comme ::

source: *tz* now can be omitted.
fr: *tz* peut maintenant être omis.

source: The :meth:`astimezone` method can now be called on naive instances that are presumed to represent system local time.
fr: La méthode :meth:`astimezone` peut maintenant être appelée sur des instances naïves qui sont supposées représenter un temps local au système.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.utcoffset(self)``, and raises an exception if the latter doesn't return ``None`` or a :class:`timedelta` object with magnitude less than one day.
fr: Si :attr:`.tzinfo` est ``None``, renvoie ``None``, sinon renvoie ``self.tzinfo.utcoffset(self)``, et lève une exception si l'expression précédente ne renvoie pas ``None`` ou un objet :class:`timedelta` d'une magnitude inférieure à un jour.

source: The UTC offset is not restricted to a whole number of minutes.
fr: Le décalage UTC peut aussi être autre chose qu'un ensemble de minutes.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.dst(self)``, and raises an exception if the latter doesn't return ``None`` or a :class:`timedelta` object with magnitude less than one day.
fr: Si :attr:`.tzinfo` est ``None``, renvoie ``None``, sinon renvoie ``self.tzinfo.dst(self)``, et lève une exception si l'expression précédente ne renvoie pas ``None`` ou un objet :class:`timedelta` d'une magnitude inférieure à un jour.

source: The DST offset is not restricted to a whole number of minutes.
fr: Le décalage DST n'est pas restreint à des minutes entières.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.tzname(self)``, raises an exception if the latter doesn't return ``None`` or a string object,
fr: Si :attr:`.tzinfo` est ``None``, renvoie ``None``, sinon renvoie ``self.tzinfo.tzname(self)``, lève une exception si l'expression précédente ne renvoie pas ``None`` ou une chaîne de caractères,

source: Because naive ``datetime`` objects are treated by many ``datetime`` methods as local times, it is preferred to use aware datetimes to represent times in UTC; as a result, using ``utcfromtimetuple`` may give misleading results. If you have a naive ``datetime`` representing UTC, use ``datetime.replace(tzinfo=timezone.utc)`` to make it aware, at which point you can use :meth:`.datetime.timetuple`.
fr: Comme les objets ``datetime`` naïfs sont traités par de nombreuses méthodes ``datetime`` comme des heures locales, il est préférable d'utiliser les ``datetime`` avisés pour représenter les heures en UTC ; par conséquent, l'utilisation de ``utcfromtimetuple`` peut donner des résultats trompeurs. Si vous disposez d'une ``datetime`` naïve représentant l'heure UTC, utilisez ``datetime.replace(tzinfo=timezone.utc)`` pour la rendre avisée, puis vous pouvez utiliser :meth:`.datetime.timetuple`.

source: For aware :class:`.datetime` instances, the return value is computed as::
fr: Pour les instances :class:`.datetime` avisées, la valeur renvoyée est calculée comme suit ::

source: The :meth:`timestamp` method uses the :attr:`.fold` attribute to disambiguate the times during a repeated interval.
fr: La méthode :meth:`timestamp` utilise l'attribut :attr:`.fold` pour désambiguïser le temps dans un intervalle répété.

source: or by calculating the timestamp directly::
fr: ou en calculant l'horodatage (*timestamp* en anglais) directement ::

source: Return the day of the week as an integer, where Monday is 0 and Sunday is 6. The same as ``self.date().weekday()``. See also :meth:`isoweekday`.
fr: Renvoie le jour de la semaine sous forme de nombre, où lundi vaut 0 et dimanche vaut 6. Identique à ``self.date().weekday()``. Voir aussi :meth:`isoweekday`.

source: Return the day of the week as an integer, where Monday is 1 and Sunday is 7. The same as ``self.date().isoweekday()``. See also :meth:`weekday`, :meth:`isocalendar`.
fr: Renvoie le jour de la semaine sous forme de nombre, où lundi vaut 1 et dimanche vaut 7. Identique à ``self.date().isoweekday()``. Voir aussi :meth:`weekday`, :meth:`isocalendar`.

source: Return a :term:`named tuple` with three components: ``year``, ``week`` and ``weekday``. The same as ``self.date().isocalendar()``.
fr: Renvoie un :term:`n-uplet nommé<named tuple>` de 3 éléments : ``year``, ``week`` et ``weekday``. Identique à ``self.date().isocalendar()``.

source: ``YYYY-MM-DDTHH:MM:SS.ffffff``, if :attr:`microsecond` is not 0
fr: ``YYYY-MM-DDTHH:MM:SS.ffffff``, si :attr:`microsecond` ne vaut pas 0

source: ``YYYY-MM-DDTHH:MM:SS``, if :attr:`microsecond` is 0
fr: ``YYYY-MM-DDTHH:MM:SS``, si :attr:`microsecond` vaut 0

source: ``YYYY-MM-DDTHH:MM:SS.ffffff+HH:MM[:SS[.ffffff]]``, if :attr:`microsecond` is not 0
fr: ``YYYY-MM-DDTHH:MM:SS.ffffff+HH:MM[:SS[.ffffff]]``, si :attr:`microsecond` ne vaut pas 0

source: ``YYYY-MM-DDTHH:MM:SS+HH:MM[:SS[.ffffff]]``, if :attr:`microsecond` is 0
fr: ``YYYY-MM-DDTHH:MM:SS+HH:MM[:SS[.ffffff]]``, si :attr:`microsecond` vaut 0

source: The optional argument *timespec* specifies the number of additional components of the time to include (the default is ``'auto'``). It can be one of the following:
fr: L'argument optionnel *timespec* spécifie le nombre de composants additionnels de temps à inclure (par défaut ``'auto'``). Il peut valoir l'une des valeurs suivantes :

source: ``'auto'``: Same as ``'seconds'`` if :attr:`microsecond` is 0, same as ``'microseconds'`` otherwise.
fr: ``'auto'`` : Identique à ``'seconds'`` si :attr:`microsecond` vaut 0, à ``'microseconds'`` sinon.

source: Excluded time components are truncated, not rounded.
fr: Les composants de temps exclus sont tronqués et non arrondis.

source: Added the *timespec* argument.
fr: Ajout de l'argument *timespec*.

source: For a :class:`.datetime` instance *d*, ``str(d)`` is equivalent to ``d.isoformat(' ')``.
fr: Pour une instance *d* de :class:`.datetime`, ``str(d)`` est équivalent à ``d.isoformat(' ')``.

source: Return a string representing the date and time::
fr: Renvoie une chaîne de caractères représentant la date et l'heure ::

source: The output string will *not* include time zone information, regardless of whether the input is aware or naive.
fr: La chaîne de caractères en sortie n'inclura *pas* d'informations sur le fuseau horaire, que l'entrée soit avisée ou naïve.

source: The example below defines a :class:`tzinfo` subclass capturing time zone information for Kabul, Afghanistan, which used +4 UTC until 1945 and then +4:30 UTC thereafter::
fr: L'exemple ci-dessous définit une sous-classe :class:`tzinfo` qui regroupe des informations sur les fuseaux horaires pour Kaboul, en Afghanistan, qui a utilisé +4 UTC jusqu'en 1945, puis +4:30 UTC par la suite ::

source: Usage of ``KabulTz`` from above::
fr: Utilisation de ``KabulTz`` cité plus haut ::

source: :class:`.time` Objects
fr: Objets :class:`.time`

source: The earliest representable :class:`.time`, ``time(0, 0, 0, 0)``.
fr: Le plus petit objet :class:`.time` représentable, ``time(0, 0, 0, 0)``.

source: The latest representable :class:`.time`, ``time(23, 59, 59, 999999)``.
fr: Le plus grand objet :class:`.time` représentable, ``time(23, 59, 59, 999999)``.

source: The smallest possible difference between non-equal :class:`.time` objects, ``timedelta(microseconds=1)``, although note that arithmetic on :class:`.time` objects is not supported.
fr: La plus petite différence possible entre deux objets :class:`.time` non-égaux, ``timedelta(microseconds=1)``, notez cependant que les objets :class:`.time` n'implémentent pas d'opérations arithmétiques.

source: The object passed as the tzinfo argument to the :class:`.time` constructor, or ``None`` if none was passed.
fr: L'objet passé comme argument *tzinfo* au constructeur de :class:`.time`, ou ``None`` si aucune valeur n'a été passée.

source: Other constructor:
fr: Autre constructeur :

source: ``HH:MM:SS.ffffff``, if :attr:`microsecond` is not 0
fr: ``HH:MM:SS.ffffff``, si :attr:`microsecond` ne vaut pas 0

source: ``HH:MM:SS``, if :attr:`microsecond` is 0
fr: ``HH:MM:SS``, si :attr:`microsecond` vaut 0

source: ``HH:MM:SS.ffffff+HH:MM[:SS[.ffffff]]``, if :meth:`utcoffset` does not return ``None``
fr: ``HH:MM:SS.ffffff+HH:MM[:SS[.ffffff]]``, si :meth:`utcoffset` ne renvoie pas ``None``

source: ``HH:MM:SS+HH:MM[:SS[.ffffff]]``, if :attr:`microsecond` is 0 and :meth:`utcoffset` does not return ``None``
fr: ``HH:MM:SS+HH:MM[:SS[.ffffff]]``, si :attr:`microsecond` vaut 0 et :meth:`utcoffset` ne renvoie pas ``None``

source: :exc:`ValueError` will be raised on an invalid *timespec* argument.
fr: Une :exc:`ValueError` sera levée en cas d'argument *timespec* invalide.

source: For a time *t*, ``str(t)`` is equivalent to ``t.isoformat()``.
fr: Pour un temps *t*, ``str(t)`` est équivalent à ``t.isoformat()``.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.utcoffset(None)``, and raises an exception if the latter doesn't return ``None`` or a :class:`timedelta` object with magnitude less than one day.
fr: Si :attr:`.tzinfo` est ``None``, renvoie ``None``, sinon renvoie ``self.tzinfo.utcoffset(None)``, et lève une exception si l'expression précédente ne renvoie pas ``None`` ou un objet :class:`timedelta` d'une magnitude inférieure à un jour.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.dst(None)``, and raises an exception if the latter doesn't return ``None``, or a :class:`timedelta` object with magnitude less than one day.
fr: Si :attr:`.tzinfo` est ``None``, renvoie ``None``, sinon renvoie ``self.tzinfo.dst(None)``, et lève une exception si l'expression précédente ne renvoie pas ``None`` ou un objet :class:`timedelta` d'une magnitude inférieure à un jour.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.tzname(None)``, or raises an exception if the latter doesn't return ``None`` or a string object.
fr: Si :attr:`.tzinfo` est ``None``, renvoie ``None``, sinon renvoie ``self.tzinfo.tzname(None)``, et lève une exception si l'expression précédente ne renvoie pas ``None`` ou une chaîne de caractères.

source: :class:`tzinfo` Objects
fr: Objets :class:`tzinfo`

source: This is an abstract base class, meaning that this class should not be instantiated directly. Define a subclass of :class:`tzinfo` to capture information about a particular time zone.
fr: Il s'agit d'une classe de base abstraite, ce qui signifie que cette classe ne doit pas être instanciée directement. Définissez une sous-classe de :class:`tzinfo` pour capturer des informations sur un fuseau horaire particulier.

source: An instance of (a concrete subclass of) :class:`tzinfo` can be passed to the constructors for :class:`.datetime` and :class:`.time` objects. The latter objects view their attributes as being in local time, and the :class:`tzinfo` object supports methods revealing offset of local time from UTC, the name of the time zone, and DST offset, all relative to a date or time object passed to them.
fr: Une instance (d'une sous-classe concrète) de :class:`tzinfo` peut être passée aux constructeurs des objets :class:`.datetime` et :class:`.time`. Les objets en question voient leurs attributs comme étant en temps local, et l'objet :class:`.tzinfo` contient des méthodes pour obtenir le décalage du temps local par rapport à UTC, le nom du fuseau horaire, le décalage d'heure d'été, tous relatifs à un objet de date ou d'heure qui leur est passé.

source: Return offset of local time from UTC, as a :class:`timedelta` object that is positive east of UTC. If local time is west of UTC, this should be negative.
fr: Renvoie le décalage de l'heure locale par rapport à UTC, sous la forme d'un objet :class:`timedelta` qui est positif à l'est de UTC. Si l'heure locale est à l'ouest de UTC, il doit être négatif.

source: If :meth:`utcoffset` does not return ``None``, :meth:`dst` should not return ``None`` either.
fr: Si :meth:`utcoffset` ne renvoie pas ``None``, :meth:`dst` ne doit pas non plus renvoyer ``None``.

source: The default implementation of :meth:`utcoffset` raises :exc:`NotImplementedError`.
fr: L'implémentation par défaut de :meth:`utcoffset` lève une :exc:`NotImplementedError`.

source: Return the daylight saving time (DST) adjustment, as a :class:`timedelta` object or ``None`` if DST information isn't known.
fr: Renvoie le réglage de l'heure d'été (DST), sous la forme d'un objet :class:`timedelta` ou ``None`` si l'information DST n'est pas connue.

source: An instance *tz* of a :class:`tzinfo` subclass that models both standard and daylight times must be consistent in this sense:
fr: Une instance *tz* d'une sous-classe :class:`tzinfo` convenant à la fois pour une heure standard et une heure d'été doit être cohérente :

source: Most implementations of :meth:`dst` will probably look like one of these two::
fr: La plupart des implémentations de :meth:`dst` ressembleront probablement à l'une des deux suivantes ::

source: or::
fr: ou ::

source: The default implementation of :meth:`dst` raises :exc:`NotImplementedError`.
fr: L'implémentation par défaut de :meth:`dst` lève une :exc:`NotImplementedError`.

source: The default implementation of :meth:`tzname` raises :exc:`NotImplementedError`.
fr: L'implémentation par défaut de :meth:`tzname` lève une :exc:`NotImplementedError`.

source: There is one more :class:`tzinfo` method that a subclass may wish to override:
fr: Il y a une dernière méthode de :class:`tzinfo` que les sous-classes peuvent vouloir redéfinir :

source: Skipping code for error cases, the default :meth:`fromutc` implementation acts like::
fr: En omettant le code des cas d'erreurs, l'implémentation par défaut de :meth:`fromutc` se comporte comme suit ::

source: In the following :download:`tzinfo_examples.py <../includes/tzinfo_examples.py>` file there are some examples of :class:`tzinfo` classes:
fr: Dans le fichier :download:`tzinfo_examples.py <../includes/tzinfo_examples.py>` il y a des exemples de :class:`tzinfo` classes:

source: Applications that can't bear wall-time ambiguities should explicitly check the value of the :attr:`~datetime.fold` attribute or avoid using hybrid :class:`tzinfo` subclasses; there are no ambiguities when using :class:`timezone`, or any other fixed-offset :class:`tzinfo` subclass (such as a class representing only EST (fixed offset -5 hours), or only EDT (fixed offset -4 hours)).
fr: Les applications qui ne peuvent pas gérer ces ambiguïtés doivent vérifier explicitement la valeur de l'attribut :attr:`~datetime.fold` ou éviter d'utiliser des sous-classes :class:`tzinfo` hybrides ; il n'y a aucune ambiguïté lors de l'utilisation de la classe :class:`timezone`, ou toute autre sous-classe de :class:`tzinfo` à décalage fixe (comme une classe représentant uniquement le fuseau EST (de décalage fixe *-5h*) ou uniquement EDT (*-4h*)).

source: `IANA timezone database <https://www.iana.org/time-zones>`_
fr: `Base de données des fuseaux horaires de l'IANA <https://www.iana.org/time-zones>`_

source: The Time Zone Database (often called tz, tzdata or zoneinfo) contains code and data that represent the history of local time for many representative locations around the globe. It is updated periodically to reflect changes made by political bodies to time zone boundaries, UTC offsets, and daylight-saving rules.
fr: La *Time Zone Database* (souvent appelée *tz*, *tzdata* ou *zoneinfo*) contient les codes et les données représentant l'historique du temps local pour un grand nombre d'emplacements représentatifs autour du globe. Elle est mise à jour périodiquement, pour refléter les changements opérés par des politiques sur les bornes du fuseau, les décalages UTC, et les règles de passage à l'heure d'été.

source: :class:`timezone` Objects
fr: Objets :class:`timezone`

source: The :class:`timezone` class is a subclass of :class:`tzinfo`, each instance of which represents a timezone defined by a fixed offset from UTC.
fr: La classe :class:`timezone` est une sous-classe de :class:`tzinfo`, dont chaque instance représente un fuseau horaire défini par un décalage fixe par rapport à UTC.

source: Return the fixed value specified when the :class:`timezone` instance is constructed.
fr: Renvoie la valeur fixe spécifiée lorsque l'instance :class:`timezone` est construite.

source: Always returns ``None``.
fr: Renvoie toujours ``None``.

source: The UTC timezone, ``timezone(timedelta(0))``.
fr: Le fuseau horaire UTC, ``timezone(timedelta(0))``.

source: :meth:`strftime` and :meth:`strptime` Behavior
fr: Comportement de :meth:`strftime` et :meth:`strptime`

source: Conversely, the :meth:`datetime.strptime` class method creates a :class:`.datetime` object from a string representing a date and time and a corresponding format string.
fr: Inversement, la méthode de classe :meth:`datetime.strptime` crée un objet :class:`.datetime` à partir d'une chaîne représentant une date et une heure, et une chaîne de format correspondante.

source: The table below provides a high-level comparison of :meth:`strftime` versus :meth:`strptime`:
fr: Le tableau ci-dessous fournit une comparaison de haut niveau entre :meth:`strftime` et :meth:`strptime` :

source: Usage
fr: Utilisation

source: Convert object to a string according to a given format
fr: Convertit un objet en une chaîne de caractères selon un format donné

source: Parse a string into a :class:`.datetime` object given a corresponding format
fr: Analyse une chaîne de caractères dans un objet :class:`.datetime` en fonction du format de correspondance donné

source: Type of method
fr: Type de méthode

source: Class method
fr: Méthode de classe

source: Method of
fr: Méthode de

source: Meaning
fr: Signification

source: Example
fr: Exemple

source: Weekday as locale's abbreviated name.
fr: Jour de la semaine abrégé dans la langue locale.

source: So, Mo, ..., Sa (de_DE)
fr: Lu, Ma, ..., Di (*fr_FR*)

source: Weekday as locale's full name.
fr: Jour de la semaine complet dans la langue locale.

source: Sonntag, Montag, ..., Samstag (de_DE)
fr: Lundi, Mardi, ..., Dimanche (*fr_FR*)

source: Weekday as a decimal number, where 0 is Sunday and 6 is Saturday.
fr: Jour de la semaine en chiffre, avec 0 pour le dimanche et 6 pour le samedi.

source: Day of the month as a zero-padded decimal number.
fr: Jour du mois sur deux chiffres.

source: Month as locale's abbreviated name.
fr: Nom du mois abrégé dans la langue locale.

source: Jan, Feb, ..., Dez (de_DE)
fr: janv., févr., ..., déc. (*fr_FR*)

source: Month as locale's full name.
fr: Nom complet du mois dans la langue locale.

source: Januar, Februar, ..., Dezember (de_DE)
fr: janvier, février, ..., décembre (*fr_FR*)

source: Month as a zero-padded decimal number.
fr: Numéro du mois sur deux chiffres.

source: Year without century as a zero-padded decimal number.
fr: Année sur deux chiffres (sans le siècle).

source: Year with century as a decimal number.
fr: Année complète sur quatre chiffres.

source: Hour (24-hour clock) as a zero-padded decimal number.
fr: Heure à deux chiffres de 00 à 23.

source: Hour (12-hour clock) as a zero-padded decimal number.
fr: Heure à deux chiffres pour les horloges 12h (01 à 12).

source: Locale's equivalent of either AM or PM.
fr: Équivalent local à AM/PM.

source: Minute as a zero-padded decimal number.
fr: Minutes sur deux chiffres.

source: Second as a zero-padded decimal number.
fr: Secondes sur deux chiffres.

source: Microsecond as a decimal number, zero-padded on the left.
fr: Microsecondes sur 6 chiffres.

source: (empty), +0000, -0400, +1030, +063415, -030712.345216
fr: (vide), +0000, -0400, +1030, +063415, -030712.345216

source: Time zone name (empty string if the object is naive).
fr: Nom du fuseau horaire (chaîne vide si l'instance est naïve).

source: Day of the year as a zero-padded decimal number.
fr: Numéro du jour dans l'année sur trois chiffres.

source: Week number of the year (Sunday as the first day of the week) as a zero padded decimal number. All days in a new year preceding the first Sunday are considered to be in week 0.
fr: Numéro de la semaine à deux chiffres (où dimanche est considéré comme le premier jour de la semaine). Tous les jours de l'année précédent le premier dimanche sont considérés comme appartenant à la semaine 0.

source: Week number of the year (Monday as the first day of the week) as a decimal number. All days in a new year preceding the first Monday are considered to be in week 0.
fr: Numéro de la semaine à deux chiffres (où lundi est considéré comme le premier jour de la semaine). Tous les jours de l'année précédent le premier lundi sont considérés comme appartenant à la semaine 0.

source: Locale's appropriate date and time representation.
fr: Représentation locale de la date et de l'heure.

source: Di 16 Aug 21:30:00 1988 (de_DE)
fr: mar. 16 août 1988 21:30:00 (*fr_FR*)

source: Locale's appropriate date representation.
fr: Représentation locale de la date.

source: 16.08.1988 (de_DE)
fr: 16/08/1988 (*fr_FR*)

source: Locale's appropriate time representation.
fr: Représentation locale de l'heure.

source: 21:30:00 (de_DE)
fr: 21:30:00 (*fr_FR*)

source: A literal ``'%'`` character.
fr: Un caractère ``'%'`` littéral.

source: Several additional directives not required by the C89 standard are included for convenience. These parameters all correspond to ISO 8601 date values.
fr: Plusieurs directives supplémentaires non requises par la norme C89 sont incluses pour des raisons de commodité. Ces paramètres correspondent tous aux valeurs de date de la norme ISO 8601.

source: ISO 8601 year with century representing the year that contains the greater part of the ISO week (``%V``).
fr: Année complète ISO 8601 représentant l'année contenant la plus grande partie de la semaine ISO (``%V``).
