Repository: python/python-docs-fr
Catalog: library/decimal.po
Languages: fr

source: Return the adjusted exponent after shifting out the coefficient's rightmost digits until only the lead digit remains: ``Decimal('321e+5').adjusted()`` returns seven. Used for determining the position of the most significant digit with respect to the decimal point.
fr: Renvoie l'exposant ajusté après avoir décalé les chiffres les plus à droite de la mantisse jusqu'à ce qu'il ne reste que le premier chiffre : ``Decimal('321e+5').adjusted()`` renvoie sept. Utilisée pour déterminer la position du chiffre le plus significatif par rapport à la virgule.

source: Return a pair ``(n, d)`` of integers that represent the given :class:`Decimal` instance as a fraction, in lowest terms and with a positive denominator::
fr: Renvoie un couple d'entiers ``(n, d)`` qui représentent l'instance :class:`Decimal` donnée sous la forme d'une fraction, avec les termes les plus petits possibles et avec un dénominateur positif ::

source: The conversion is exact. Raise OverflowError on infinities and ValueError on NaNs.
fr: La conversion est exacte. Lève une ``OverflowError`` sur l'infini et ``ValueError`` sur les *Nan*.

source: Return a :term:`named tuple` representation of the number: ``DecimalTuple(sign, digits, exponent)``.
fr: Renvoie une représentation sous la forme d'un :term:`n-uplet nommé <named tuple>` du nombre ``DecimalTuple(sign, digits, exponent)``.

source: Return the canonical encoding of the argument. Currently, the encoding of a :class:`Decimal` instance is always canonical, so this operation returns its argument unchanged.
fr: Renvoie la forme canonique de l'argument. Actuellement, la forme d'une instance :class:`Decimal` est toujours canonique, donc cette opération renvoie son argument inchangé.

source: Compare the values of two Decimal instances. :meth:`compare` returns a Decimal instance, and if either operand is a NaN then the result is a NaN::
fr: Compare les valeurs de deux instances :class:`!Decimal`. :meth:`compare` renvoie une instance :class:`!Decimal` et, si l'un des opérandes est un *NaN*, alors le résultat est un *NaN* ::

source: This operation is identical to the :meth:`compare` method, except that all NaNs signal. That is, if neither operand is a signaling NaN then any quiet NaN operand is treated as though it were a signaling NaN.
fr: Cette opération est identique à la méthode :meth:`compare`, sauf que tous les *NaN* sont surveillés. Autrement dit, si aucun des opérandes n'est un *NaN* de signalisation, alors tout opérande *NaN* silencieux est traité comme s'il s'agissait d'un *NaN* de signalisation.

source: Compare two operands using their abstract representation rather than their numerical value. Similar to the :meth:`compare` method, but the result gives a total ordering on :class:`Decimal` instances. Two :class:`Decimal` instances with the same numeric value but different representations compare unequal in this ordering:
fr: Compare deux opérandes en utilisant leur représentation abstraite plutôt que leur valeur numérique. Similaire à la méthode :meth:`compare`, mais le résultat donne un ordre total sur les instances :class:`Decimal`. Deux instances de :class:`Decimal` avec la même valeur numérique mais des représentations différentes se comparent de manière inégale dans cet ordre :

source: Quiet and signaling NaNs are also included in the total ordering. The result of this function is ``Decimal('0')`` if both operands have the same representation, ``Decimal('-1')`` if the first operand is lower in the total order than the second, and ``Decimal('1')`` if the first operand is higher in the total order than the second operand. See the specification for details of the total order.
fr: Les *NaN* silencieux et de signalisation sont également inclus dans l'ordre total. Le résultat de cette fonction est ``Decimal('0')`` si les deux opérandes ont la même représentation, ``Decimal('-1')`` si le premier opérande est inférieur au second, et ``Decimal('1')`` si le premier opérande est supérieur au deuxième opérande. Voir les spécifications pour les détails de l'ordre total.

source: This operation is unaffected by context and is quiet: no flags are changed and no rounding is performed. As an exception, the C version may raise InvalidOperation if the second operand cannot be converted exactly.
fr: Cette opération ne dépend pas du contexte et est silencieuse : aucun indicateur n'est modifié et aucun arrondi n'est effectué. Exceptionnellement, la version C peut lever une *InvalidOperation* si le deuxième opérande ne peut pas être converti exactement.

source: Compare two operands using their abstract representation rather than their value as in :meth:`compare_total`, but ignoring the sign of each operand. ``x.compare_total_mag(y)`` is equivalent to ``x.copy_abs().compare_total(y.copy_abs())``.
fr: Compare deux opérandes en utilisant leur représentation abstraite plutôt que leur valeur comme dans :meth:`compare_total`, mais en ignorant le signe de chaque opérande. ``x.compare_total_mag(y)`` est équivalent à ``x.copy_abs().compare_total(y.copy_abs())``.

source: Just returns self, this method is only to comply with the Decimal Specification.
fr: Ne fait que renvoyer self ; cette méthode existe uniquement pour se conformer à la spécification.

source: Return the absolute value of the argument. This operation is unaffected by the context and is quiet: no flags are changed and no rounding is performed.
fr: Renvoie la valeur absolue de l'argument. Cette opération ne dépend pas du contexte et est silencieuse : aucun drapeau n'est modifié et aucun arrondi n'est effectué.

source: Return the negation of the argument. This operation is unaffected by the context and is quiet: no flags are changed and no rounding is performed.
fr: Renvoie l'opposé de l'argument. Cette opération ne dépend pas du contexte et est silencieuse : aucun drapeau n'est modifié et aucun arrondi n'est effectué.

source: Return a copy of the first operand with the sign set to be the same as the sign of the second operand. For example:
fr: Renvoie une copie du premier opérande mais avec le même signe que celui du deuxième opérande. Par exemple :

source: Return the value of the (natural) exponential function ``e**x`` at the given number. The result is correctly rounded using the :const:`ROUND_HALF_EVEN` rounding mode.
fr: Renvoie la valeur ``e**x`` (fonction exponentielle) du nombre donné. Le résultat est correctement arrondi en utilisant le mode d'arrondi :const:`ROUND_HALF_EVEN`.

source: Alternative constructor that only accepts instances of :class:`float` or :class:`int`.
fr: Constructeur alternatif qui n'accepte que les instances de :class:`float` ou :class:`int`.

source: Note ``Decimal.from_float(0.1)`` is not the same as ``Decimal('0.1')``. Since 0.1 is not exactly representable in binary floating point, the value is stored as the nearest representable value which is ``0x1.999999999999ap-4``. That equivalent value in decimal is ``0.1000000000000000055511151231257827021181583404541015625``.
fr: Remarquez que ``Decimal.from_float(0.1)`` est différent de ``Decimal('0.1')``. Puisque 0.1 n'est pas exactement représentable en virgule flottante binaire, la valeur est stockée comme la valeur représentable la plus proche qui est ``0x1.999999999999ap-4``. La valeur équivalente en décimal est ``0.1000000000000000055511151231257827021181583404541015625``.

source: From Python 3.2 onwards, a :class:`Decimal` instance can also be constructed directly from a :class:`float`.
fr: depuis Python 3.2, une instance :class:`Decimal` peut également être construite directement à partir d'un :class:`float`.

source: Fused multiply-add. Return self*other+third with no rounding of the intermediate product self*other.
fr: Multiplier-ajouter fusionné. Renvoie ``self*other+third`` sans arrondir le produit intermédiaire ``self*other``.

source: Return :const:`True` if the argument is canonical and :const:`False` otherwise. Currently, a :class:`Decimal` instance is always canonical, so this operation always returns :const:`True`.
fr: Renvoie :const:`True` si l'argument est sous forme canonique et :const:`False` sinon. Actuellement, une instance :class:`Decimal` est toujours canonique, donc cette opération renvoie toujours :const:`True`.

source: Return :const:`True` if the argument is a finite number, and :const:`False` if the argument is an infinity or a NaN.
fr: Renvoie :const:`True` si l'argument est un nombre fini et :const:`False` si l'argument est un infini ou un *NaN*.

source: Return :const:`True` if the argument is either positive or negative infinity and :const:`False` otherwise.
fr: Renvoie :const:`True` si l'argument est un infini positif ou négatif, :const:`False` sinon.

source: Return :const:`True` if the argument is a (quiet or signaling) NaN and :const:`False` otherwise.
fr: Renvoie :const:`True` si l'argument est un *NaN* (signalisé ou silencieux), :const:`False` sinon.

source: Return :const:`True` if the argument is a *normal* finite number. Return :const:`False` if the argument is zero, subnormal, infinite or a NaN.
fr: Renvoie :const:`True` si l'argument est un nombre fini *normal*. Renvoie :const:`False` si l'argument est zéro, infini, résultat d'un dépassement par valeur inférieure ou un *NaN*.

source: Return :const:`True` if the argument is a quiet NaN, and :const:`False` otherwise.
fr: Renvoie :const:`True` si l'argument est un *NaN* silencieux, :const:`False` sinon.

source: Return :const:`True` if the argument has a negative sign and :const:`False` otherwise. Note that zeros and NaNs can both carry signs.
fr: Renvoie :const:`True` si l'argument est négatif, :const:`False` sinon. Remarquez que les zéros et les *NaN* peuvent être signés.

source: Return :const:`True` if the argument is a signaling NaN and :const:`False` otherwise.
fr: Renvoie :const:`True` si l'argument est un *NaN* signalisé, :const:`False` sinon.

source: Return :const:`True` if the argument is subnormal, and :const:`False` otherwise.
fr: Renvoie :const:`True` si l'argument est le résultat d'un dépassement par valeur inférieure, :const:`False` sinon.

source: Return :const:`True` if the argument is a (positive or negative) zero and :const:`False` otherwise.
fr: Renvoie :const:`True` si l'argument est un zéro (positif ou négatif), :const:`False` sinon.

source: Return the natural (base e) logarithm of the operand. The result is correctly rounded using the :const:`ROUND_HALF_EVEN` rounding mode.
fr: Renvoie le logarithme naturel (base e) de l'opérande. Le résultat est arrondi avec le mode :const:`ROUND_HALF_EVEN`.

source: Return the base ten logarithm of the operand. The result is correctly rounded using the :const:`ROUND_HALF_EVEN` rounding mode.
fr: Renvoie le logarithme en base 10 de l'opérande. Le résultat est arrondi avec le mode :const:`ROUND_HALF_EVEN`.

source: For a nonzero number, return the adjusted exponent of its operand as a :class:`Decimal` instance. If the operand is a zero then ``Decimal('-Infinity')`` is returned and the :const:`DivisionByZero` flag is raised. If the operand is an infinity then ``Decimal('Infinity')`` is returned.
fr: Pour un nombre non nul, renvoie l'exposant ajusté de son opérande en tant qu'instance :class:`Decimal`. Si l'opérande est un zéro alors ``Decimal('-Infinity')`` est renvoyé et le drapeau :const:`DivisionByZero` est levé. Si l'opérande est un infini alors ``Decimal('Infinity')`` est renvoyé.

source: :meth:`logical_and` is a logical operation which takes two *logical operands* (see :ref:`logical_operands_label`). The result is the digit-wise ``and`` of the two operands.
fr: :meth:`logical_and` est une opération logique qui prend deux *opérandes logiques* (voir :ref:`logical_operands_label`). Le résultat est le *ET* des chiffres des deux opérandes.

source: :meth:`logical_invert` is a logical operation. The result is the digit-wise inversion of the operand.
fr: :meth:`logical_invert` est une opération logique. Le résultat est l'inversion de chacun des chiffres de l'opérande.

source: :meth:`logical_or` is a logical operation which takes two *logical operands* (see :ref:`logical_operands_label`). The result is the digit-wise ``or`` of the two operands.
fr: :meth:`logical_or` est une opération logique qui prend deux *opérandes logiques* (voir :ref:`logical_operands_label`). Le résultat est le *OU* des chiffres des deux opérandes.

source: :meth:`logical_xor` is a logical operation which takes two *logical operands* (see :ref:`logical_operands_label`). The result is the digit-wise exclusive or of the two operands.
fr: :meth:`logical_xor` est une opération logique qui prend deux *opérandes logiques* (voir :ref:`logical_operands_label`). Le résultat est le *OU EXCLUSIF* des chiffres des deux opérandes.

source: Like ``max(self, other)`` except that the context rounding rule is applied before returning and that ``NaN`` values are either signaled or ignored (depending on the context and whether they are signaling or quiet).
fr: Comme ``max(self, other)`` sauf que la règle d'arrondi de *context* est appliquée avant le retour et les valeurs ``NaN`` sont signalées ou ignorées (selon le contexte et suivant qu'elles sont signalisées ou silencieuses).

source: Similar to the :meth:`.max` method, but the comparison is done using the absolute values of the operands.
fr: Semblable à la méthode :meth:`.max`, mais la comparaison est effectuée en utilisant les valeurs absolues des opérandes.

source: Like ``min(self, other)`` except that the context rounding rule is applied before returning and that ``NaN`` values are either signaled or ignored (depending on the context and whether they are signaling or quiet).
fr: Comme ``min(self, other)`` sauf que la règle d'arrondi de *context* est appliquée avant le retour et les valeurs ``NaN`` sont signalées ou ignorées (selon le contexte et suivant qu'elles sont signalisées ou silencieuses).

source: Similar to the :meth:`.min` method, but the comparison is done using the absolute values of the operands.
fr: Semblable à la méthode :meth:`.min`, mais la comparaison est effectuée en utilisant les valeurs absolues des opérandes.

source: Return the largest number representable in the given context (or in the current thread's context if no context is given) that is smaller than the given operand.
fr: Renvoie le plus grand nombre représentable dans le *context* donné (ou dans le contexte du fil d'exécution actuel si aucun contexte n'est donné) qui est plus petit que l'opérande donné.

source: Return the smallest number representable in the given context (or in the current thread's context if no context is given) that is larger than the given operand.
fr: Renvoie le plus petit nombre représentable dans le *context* donné (ou dans le contexte du fil d'exécution actuel si aucun contexte n'est donné) qui est supérieur à l'opérande donné.

source: If the two operands are unequal, return the number closest to the first operand in the direction of the second operand. If both operands are numerically equal, return a copy of the first operand with the sign set to be the same as the sign of the second operand.
fr: Si les deux opérandes ne sont pas égaux, renvoie le nombre le plus proche du premier opérande dans la direction du deuxième opérande. Si les deux opérandes sont numériquement égaux, renvoie une copie du premier opérande avec le signe défini comme étant le même que le signe du second opérande.

source: Used for producing canonical values of an equivalence class within either the current context or the specified context.
fr: Utilisé pour produire des valeurs canoniques d'une classe d'équivalence dans le contexte actuel ou dans le contexte spécifié.

source: This has the same semantics as the unary plus operation, except that if the final result is finite it is reduced to its simplest form, with all trailing zeros removed and its sign preserved. That is, while the coefficient is non-zero and a multiple of ten the coefficient is divided by ten and the exponent is incremented by 1. Otherwise (the coefficient is zero) the exponent is set to 0. In all cases the sign is unchanged.
fr: C'est la même sémantique que l'opération unaire plus, sauf que si le résultat final est fini, il est réduit à sa forme la plus simple, avec tous les zéros à droite supprimés et son signe conservé. Autrement dit, tant que la mantisse est différente de zéro et est un multiple de dix, elle est divisée par dix et l'exposant est incrémenté de 1. Sinon (la mantisse est nulle), l'exposant est mis à 0. Dans tous les cas, le signe est inchangé.

source: For example, ``Decimal('32.100')`` and ``Decimal('0.321000e+2')`` both normalize to the equivalent value ``Decimal('32.1')``.
fr: Par exemple, ``Decimal('32.100')`` et ``Decimal('0.321000e+2')`` se normalisent tous deux à la valeur équivalente ``Decimal('32.1')``.

source: Note that rounding is applied *before* reducing to simplest form.
fr: Notez que l'arrondi est appliqué *avant* la réduction à la forme la plus simple.

source: In the latest versions of the specification, this operation is also known as ``reduce``.
fr: Dans les dernières versions de la spécification, cette opération est également connue sous le nom de ``reduce``.

source: Return a string describing the *class* of the operand. The returned value is one of the following ten strings.
fr: Renvoie une chaîne décrivant la *classe* de l'opérande. La valeur renvoyée est l'une des dix chaînes suivantes.

source: ``"-Infinity"``, indicating that the operand is negative infinity.
fr: ``"-Infinity"``, indiquant que l'opérande est l'infini négatif ;

source: ``"-Normal"``, indicating that the operand is a negative normal number.
fr: ``"-Normal"``, indiquant que l'opérande est un nombre négatif normal ;

source: ``"-Subnormal"``, indicating that the operand is negative and subnormal.
fr: ``"-Subnormal"``, indiquant que l'opérande est négatif et qu'il est le résultat d'un dépassement par valeur inférieure ;

source: ``"-Zero"``, indicating that the operand is a negative zero.
fr: ``"-Zero"``, indiquant que l'opérande est un zéro négatif ;

source: ``"+Zero"``, indicating that the operand is a positive zero.
fr: ``"+Zero"``, indiquant que l'opérande est un zéro positif ;

source: ``"+Subnormal"``, indicating that the operand is positive and subnormal.
fr: ``"+Subnormal"``, indiquant que l'opérande est positif et qu'il est le résultat un dépassement par valeur inférieure ;

source: ``"+Normal"``, indicating that the operand is a positive normal number.
fr: ``"+Normal"``, indiquant que l'opérande est un nombre positif normal ;

source: ``"+Infinity"``, indicating that the operand is positive infinity.
fr: ``"+Infinity"``, indiquant que l'opérande est l'infini positif ;

source: ``"NaN"``, indicating that the operand is a quiet NaN (Not a Number).
fr: ``"NaN"``, indiquant que l'opérande est un *NaN* (*Not a Number*, pas un nombre) silencieux ;

source: ``"sNaN"``, indicating that the operand is a signaling NaN.
fr: ``"sNaN"``, indiquant que l'opérande est un *NaN* (*Not a Number*, pas un nombre) signalisé.

source: Return a value equal to the first operand after rounding and having the exponent of the second operand.
fr: Renvoie une valeur égale au premier opérande après arrondi et ayant l'exposant du second opérande.

source: Unlike other operations, if the length of the coefficient after the quantize operation would be greater than precision, then an :const:`InvalidOperation` is signaled. This guarantees that, unless there is an error condition, the quantized exponent is always equal to that of the right-hand operand.
fr: Contrairement aux autres opérations, si la longueur de la mantisse après l'opération de quantification est supérieure à la précision, alors une :const:`InvalidOperation` est signalée. Ceci garantit que, sauf condition d'erreur, l'exposant quantifié est toujours égal à celui de l'opérande de droite.

source: Also unlike other operations, quantize never signals Underflow, even if the result is subnormal and inexact.
fr: Contrairement aux autres opérations, la quantification ne signale jamais de dépassement par valeur inférieure, même si le résultat est inférieur à la valeur minimale représentable et est inexact.

source: If the exponent of the second operand is larger than that of the first then rounding may be necessary. In this case, the rounding mode is determined by the ``rounding`` argument if given, else by the given ``context`` argument; if neither argument is given the rounding mode of the current thread's context is used.
fr: Si l'exposant du deuxième opérande est supérieur à celui du premier, un arrondi peut être nécessaire. Dans ce cas, le mode d'arrondi est déterminé par l'argument ``rounding`` s'il est donné, sinon par l'argument ``context`` donné ; si aucun argument n'est donné, le mode d'arrondi du contexte du fil d'exécution courant est utilisé.

source: An error is returned whenever the resulting exponent is greater than :attr:`~Context.Emax` or less than :meth:`~Context.Etiny`.
fr: Une erreur est renvoyée chaque fois que l'exposant résultant est supérieur à :attr:`~Context.Emax` ou inférieur à :meth:`~Context.Etiny`.

source: Return ``Decimal(10)``, the radix (base) in which the :class:`Decimal` class does all its arithmetic. Included for compatibility with the specification.
fr: Renvoie ``Decimal(10)``, la base (base) dans laquelle la classe :class:`Decimal` fait toute son arithmétique. Inclus pour la compatibilité avec la spécification.

source: Return the remainder from dividing *self* by *other*. This differs from ``self % other`` in that the sign of the remainder is chosen so as to minimize its absolute value. More precisely, the return value is ``self - n * other`` where ``n`` is the integer nearest to the exact value of ``self / other``, and if two integers are equally near then the even one is chosen.
fr: Renvoie le reste de la division de *self* par *other*. La différence avec ``self % other`` réside dans le signe du reste, qui est choisi de manière à minimiser sa valeur absolue. Plus précisément, la valeur de retour est ``self - n * other`` où ``n`` est l'entier le plus proche de la valeur exacte de ``self / other`` et, si deux entiers sont également proches, alors l'entier pair est choisi.

source: If the result is zero then its sign will be the sign of *self*.
fr: Si le résultat est zéro, alors son signe est le signe de *self*.

source: Return the result of rotating the digits of the first operand by an amount specified by the second operand. The second operand must be an integer in the range -precision through precision. The absolute value of the second operand gives the number of places to rotate. If the second operand is positive then rotation is to the left; otherwise rotation is to the right. The coefficient of the first operand is padded on the left with zeros to length precision if necessary. The sign and exponent of the first operand are unchanged.
fr: Renvoie le résultat de la rotation des chiffres du premier opérande d'une quantité spécifiée par le deuxième opérande. Le deuxième opérande doit être un entier compris dans la plage -précision à précision. La valeur absolue du deuxième opérande donne le nombre de rotations unitaires à faire. Si le deuxième opérande est positif alors la rotation se fait vers la gauche ; sinon la rotation se fait vers la droite. La mantisse du premier opérande est complétée à gauche avec des zéros à la précision de la longueur si nécessaire. Le signe et l'exposant du premier opérande sont inchangés.

source: Test whether self and other have the same exponent or whether both are ``NaN``.
fr: Teste si *self* et *other* ont le même exposant ou si les deux sont ``NaN``.
