Repository: python/python-docs-fr
Catalog: library/decimal.po
Languages: fr

source: Returns ``True`` if *x* is a zero; otherwise returns ``False``.
fr: Renvoie ``True`` si *x* est un zéro et ``False`` sinon.

source: Returns the natural (base e) logarithm of *x*.
fr: Renvoie le logarithme naturel (en base e) de *x*.

source: Returns the base 10 logarithm of *x*.
fr: Renvoie le logarithme en base 10 de *x*.

source: Returns the exponent of the magnitude of the operand's MSD.
fr: Renvoie l'exposant correspondant du chiffre de poids fort de la mantisse de l'opérande.

source: Applies the logical operation *and* between each operand's digits.
fr: Applique l'opération logique *ET* entre les chiffres de chaque opérande.

source: Invert all the digits in *x*.
fr: Inverse tous les chiffres de *x*.

source: Applies the logical operation *or* between each operand's digits.
fr: Applique l'opération logique *OU* entre les chiffres de chaque opérande.

source: Applies the logical operation *xor* between each operand's digits.
fr: Applique l'opération logique *OU EXCLUSIF* entre les chiffres de chaque opérande.

source: Compares two values numerically and returns the maximum.
fr: Renvoie le maximum entre les deux valeurs numériques.

source: Compares the values numerically with their sign ignored.
fr: Compare les valeurs numériquement en ignorant leur signe.

source: Compares two values numerically and returns the minimum.
fr: Compare numériquement deux valeurs et renvoie le minimum.

source: Minus corresponds to the unary prefix minus operator in Python.
fr: Correspond à l’opérateur unaire préfixé « moins » en Python.

source: Return the product of *x* and *y*.
fr: Renvoie la multiplication de *x* avec *y*.

source: Returns the largest representable number smaller than *x*.
fr: Renvoie le plus grand nombre représentable inférieur à *x*.

source: Returns the smallest representable number larger than *x*.
fr: Renvoie le plus petit nombre représentable supérieur à *x*.

source: Returns the number closest to *x*, in direction towards *y*.
fr: Renvoie le nombre le plus proche de *x*, en direction de *y*.

source: Reduces *x* to its simplest form.
fr: Réduit *x* à sa forme la plus simple.

source: Returns an indication of the class of *x*.
fr: Renvoie une indication de la classe de *x*.

source: Plus corresponds to the unary prefix plus operator in Python. This operation applies the context precision and rounding, so it is *not* an identity operation.
fr: Correspond à l'opérateur unaire préfixé « plus » en Python. Cette opération applique la précision du contexte et l'arrondi, ce n'est donc *pas* une opération d'identité.

source: Return ``x`` to the power of ``y``, reduced modulo ``modulo`` if given.
fr: Renvoie ``x`` à la puissance ``y``, réduit modulo ``modulo`` si celui-ci est donné.

source: With two arguments, compute ``x**y``. If ``x`` is negative then ``y`` must be integral. The result will be inexact unless ``y`` is integral and the result is finite and can be expressed exactly in 'precision' digits. The rounding mode of the context is used. Results are always correctly rounded in the Python version.
fr: Avec deux arguments, calcule ``x**y``. Si ``x`` est négatif alors ``y`` doit être entier. Le résultat est inexact à moins que ``y`` soit entier et que le résultat soit fini et puisse être exprimé exactement en ``precision`` chiffres. Le mode d'arrondi du contexte est utilisé. Les résultats sont toujours correctement arrondis à la manière de Python.

source: ``Decimal(0) ** Decimal(0)`` results in ``InvalidOperation``, and if ``InvalidOperation`` is not trapped, then results in ``Decimal('NaN')``.
fr: ``Decimal(0) ** Decimal(0)`` donne ``InvalidOperation`` et, si ``InvalidOperation`` n'est pas surveillé, cela donne ``Decimal('NaN')``.

source: The C module computes :meth:`power` in terms of the correctly rounded :meth:`exp` and :meth:`ln` functions. The result is well-defined but only "almost always correctly rounded".
fr: le module C calcule :meth:`power` en termes de fonctions :meth:`exp` et :meth:`ln` correctement arrondies. Le résultat est bien défini mais seulement « presque toujours correctement arrondi ».

source: With three arguments, compute ``(x**y) % modulo``. For the three argument form, the following restrictions on the arguments hold:
fr: Avec trois arguments, calcule ``(x**y) % modulo``. Pour la forme à trois arguments, les restrictions suivantes sur les arguments s'appliquent :

source: all three arguments must be integral
fr: les trois arguments doivent être entiers ;

source: ``y`` must be nonnegative
fr: ``y`` ne doit pas être négatif ;

source: at least one of ``x`` or ``y`` must be nonzero
fr: au moins l'un de ``x`` ou ``y`` doit être différent de zéro ;

source: ``modulo`` must be nonzero and have at most 'precision' digits
fr: ``modulo`` doit être différent de zéro et avoir au plus ``precision`` chiffres.

source: The value resulting from ``Context.power(x, y, modulo)`` is equal to the value that would be obtained by computing ``(x**y) % modulo`` with unbounded precision, but is computed more efficiently. The exponent of the result is zero, regardless of the exponents of ``x``, ``y`` and ``modulo``. The result is always exact.
fr: La valeur résultant de ``Context.power(x, y, modulo)`` est égale à la valeur qui serait obtenue en calculant ``(x**y) % modulo`` avec une précision illimitée, mais est calculée plus efficacement. L'exposant du résultat est zéro, quels que soient les exposants de ``x``, ``y`` et ``modulo``. Le résultat est toujours exact.

source: Returns a value equal to *x* (rounded), having the exponent of *y*.
fr: Renvoie une valeur égale à *x* (arrondie), ayant l'exposant de *y*.

source: Just returns 10, as this is Decimal, :)
fr: Renvoie 10 car c'est :class:`!Decimal`, :)

source: Returns the remainder from integer division.
fr: Renvoie le reste de la division entière.

source: The sign of the result, if non-zero, is the same as that of the original dividend.
fr: Le signe du résultat, s'il est différent de zéro, est le même que celui du dividende initial.

source: Returns ``x - y * n``, where *n* is the integer nearest the exact value of ``x / y`` (if the result is 0 then its sign will be the sign of *x*).
fr: Renvoie ``x - y * n``, où *n* est l'entier le plus proche de la valeur exacte de ``x / y`` (si le résultat est 0 alors son signe est le signe de *x*).

source: Returns a rotated copy of *x*, *y* times.
fr: Renvoie une copie pivotée de *x*, *y* fois.

source: Returns ``True`` if the two operands have the same exponent.
fr: Renvoie ``True`` si les deux opérandes ont le même exposant.

source: Returns the first operand after adding the second value its exp.
fr: Renvoie le premier opérande après avoir ajouté la deuxième valeur à son *exp*.

source: Returns a shifted copy of *x*, *y* times.
fr: Renvoie une copie décalée de *x*, *y* fois.

source: Square root of a non-negative number to context precision.
fr: Renvoie la racine carrée d'un nombre non négatif avec la précision donnée par le contexte.

source: Return the difference between *x* and *y*.
fr: Renvoie la différence entre *x* et *y*.

source: Rounds to an integer.
fr: Arrondit à un entier.

source: Converts a number to a string using scientific notation.
fr: Convertit un nombre en chaîne en utilisant la notation scientifique.

source: Constants
fr: Constantes

source: The constants in this section are only relevant for the C module. They are also included in the pure Python version for compatibility.
fr: Les constantes de cette section ne sont pertinentes que pour le module implémenté en C. Elles sont incluses dans la version en Python pur pour raison de compatibilité .

source: The value is ``True``. Deprecated, because Python now always has threads.
fr: La valeur est ``True``. Déprécié, parce que maintenant Python possède toujours des fils d'exécution.

source: Rounding modes
fr: Modes d'arrondi

source: Signals
fr: Signaux

source: Numerical overflow.
fr: Débordement numérique.

source: Recipes
fr: Cas pratiques

source: Decimal FAQ
fr: FAQ *decimal*

source: Q. It is cumbersome to type ``decimal.Decimal('1234.5')``. Is there a way to minimize typing when using the interactive interpreter?
fr: Q. C'est fastidieux de taper ``decimal.Decimal('1234.5')``. Y a-t-il un moyen de réduire la frappe quand on utilise l'interpréteur interactif ?

source: A. Some users abbreviate the constructor to just a single letter:
fr: R. Certains utilisateurs abrègent le constructeur en une seule lettre :

source: Q. Once I have valid two place inputs, how do I maintain that invariant throughout an application?
fr: Q. Une fois que mes entrées sont à deux décimales valides, comment maintenir cet invariant dans l'application ?

source: A. Some operations like addition, subtraction, and multiplication by an integer will automatically preserve fixed point. Others operations, like division and non-integer multiplication, will change the number of decimal places and need to be followed-up with a :meth:`~Decimal.quantize` step:
fr: R. Certaines opérations comme l'addition, la soustraction et la multiplication par un entier préservent automatiquement la virgule fixe. D'autres opérations, comme la division et la multiplication par des non-entiers, changent le nombre de décimales et doivent être suivies d'une étape :meth:`~Decimal.quantize` :

source: In developing fixed-point applications, it is convenient to define functions to handle the :meth:`~Decimal.quantize` step:
fr: Lors du développement d'applications en virgule fixe, il est pratique de définir des fonctions pour gérer cette étape de quantification par :meth:`~Decimal.quantize` :
