Repository: python/python-docs-fr
Catalog: library/decimal.po
Languages: fr

source: Return the first operand with exponent adjusted by the second. Equivalently, return the first operand multiplied by ``10**other``. The second operand must be an integer.
fr: Renvoie le premier opérande avec l'exposant ajusté par le second. De manière équivalente, renvoie le premier opérande multiplié par ``10**other``. Le deuxième opérande doit être entier.

source: Return the result of shifting the digits of the first operand by an amount specified by the second operand. The second operand must be an integer in the range -precision through precision. The absolute value of the second operand gives the number of places to shift. If the second operand is positive then the shift is to the left; otherwise the shift is to the right. Digits shifted into the coefficient are zeros. The sign and exponent of the first operand are unchanged.
fr: Renvoie le résultat du décalage des chiffres du premier opérande d'une quantité spécifiée par le deuxième opérande. Le deuxième opérande doit être un entier compris dans la plage -précision à précision. La valeur absolue du deuxième opérande donne le nombre de décalages unitaires à effectuer. Si le deuxième opérande est positif alors le décalage est vers la gauche ; sinon le décalage est vers la droite. Les chiffres insérés dans le nombre par le décalage sont des zéros. Le signe et l'exposant du premier opérande sont inchangés.

source: Return the square root of the argument to full precision.
fr: Renvoie la racine carrée de l'argument avec une précision maximale.

source: Convert to a string, using engineering notation if an exponent is needed.
fr: Convertit en chaîne, en utilisant la notation ingénieur si un exposant est nécessaire.

source: Engineering notation has an exponent which is a multiple of 3. This can leave up to 3 digits to the left of the decimal place and may require the addition of either one or two trailing zeros.
fr: La notation ingénieur possède un exposant qui est un multiple de 3. Cela peut laisser jusqu'à 3 chiffres à gauche de la décimale et peut nécessiter l'ajout d'un ou de deux zéros en fin de mantisse.

source: For example, this converts ``Decimal('123E+1')`` to ``Decimal('1.23E+3')``.
fr: Par exemple, ``Decimal('123E+1')`` est converti en ``Decimal('1.23E+3')``.

source: Identical to the :meth:`to_integral_value` method. The ``to_integral`` name has been kept for compatibility with older versions.
fr: Identique à la méthode :meth:`to_integral_value`. Le nom ``to_integral`` a été conservé pour la compatibilité avec les anciennes versions.

source: Round to the nearest integer, signaling :const:`Inexact` or :const:`Rounded` as appropriate if rounding occurs. The rounding mode is determined by the ``rounding`` parameter if given, else by the given ``context``. If neither parameter is given then the rounding mode of the current context is used.
fr: Arrondit à l'entier le plus proche, en signalant :const:`Inexact` ou :const:`Rounded` selon le cas si l'arrondi se produit. Le mode d'arrondi est déterminé par le paramètre ``rounding`` s'il est donné, sinon par le ``context`` donné. Si aucun paramètre n'est donné, le mode d'arrondi du contexte courant est utilisé.

source: Round to the nearest integer without signaling :const:`Inexact` or :const:`Rounded`. If given, applies *rounding*; otherwise, uses the rounding method in either the supplied *context* or the current context.
fr: Arrondit à l'entier le plus proche sans signaler :const:`Inexact` ou :const:`Rounded`. Si donné, applique *rounding* ; sinon, utilise la méthode d'arrondi dans le *context* fourni ou dans le contexte actuel.

source: Logical operands
fr: Opérandes logiques

source: The :meth:`~Decimal.logical_and`, :meth:`~Decimal.logical_invert`, :meth:`~Decimal.logical_or`, and :meth:`~Decimal.logical_xor` methods expect their arguments to be *logical operands*. A *logical operand* is a :class:`Decimal` instance whose exponent and sign are both zero, and whose digits are all either ``0`` or ``1``.
fr: Les méthodes :meth:`~Decimal.logical_and`, :meth:`~Decimal.logical_invert`, :meth:`~Decimal.logical_or` et :meth:`~Decimal.logical_xor` s'attendent à ce que leurs arguments soient des *opérandes logiques*. Un *opérande logique* est une instance :class:`Decimal` dont l'exposant et le signe sont tous les deux zéro et dont les chiffres sont tous ``0`` ou ``1``.

source: Context objects
fr: Objets de contexte

source: Contexts are environments for arithmetic operations. They govern precision, set rules for rounding, determine which signals are treated as exceptions, and limit the range for exponents.
fr: Les contextes sont des environnements pour les opérations arithmétiques. Ils régissent la précision, établissent des règles d'arrondi, déterminent quels signaux sont traités comme des exceptions et limitent la plage des exposants.

source: Each thread has its own current context which is accessed or changed using the :func:`getcontext` and :func:`setcontext` functions:
fr: Chaque fil d'exécution a son propre contexte actuel qui est accessible ou modifié à l'aide des fonctions :func:`getcontext` et :func:`setcontext` :

source: Return the current context for the active thread.
fr: Renvoie le contexte actuel du fil d'exécution courant.

source: Set the current context for the active thread to *c*.
fr: Définit le contexte du fil d'exécution courant à *c*.

source: You can also use the :keyword:`with` statement and the :func:`localcontext` function to temporarily change the active context.
fr: Vous pouvez également utiliser l'instruction :keyword:`with` et la fonction :func:`localcontext` pour modifier temporairement le contexte actif.

source: Return a context manager that will set the current context for the active thread to a copy of *ctx* on entry to the with-statement and restore the previous context when exiting the with-statement. If no context is specified, a copy of the current context is used. The *kwargs* argument is used to set the attributes of the new context.
fr: Renvoie un gestionnaire de contexte qui définira le contexte actuel du fil d'exécution actif sur une copie de *ctx* à l'entrée de l'instruction *with* et restaurera le contexte précédent lors de la sortie de l'instruction *with*. Si aucun contexte n'est spécifié, une copie du contexte actuel est utilisée. L'argument *kwargs* est utilisé pour définir les attributs du nouveau contexte.

source: For example, the following code sets the current decimal precision to 42 places, performs a calculation, and then automatically restores the previous context::
fr: Par exemple, le code suivant définit la précision décimale actuelle à 42 chiffres, effectue un calcul, puis restaure automatiquement le contexte précédent ::

source: Using keyword arguments, the code would be the following::
fr: En utilisant des arguments nommés, le code serait le suivant ::

source: Raises :exc:`TypeError` if *kwargs* supplies an attribute that :class:`Context` doesn't support. Raises either :exc:`TypeError` or :exc:`ValueError` if *kwargs* supplies an invalid value for an attribute.
fr: Lève :exc:`TypeError` si *kwargs* fournit un attribut que :class:`Context` ne prend pas en charge. Lève soit :exc:`TypeError` ou :exc:`ValueError` si *kwargs* fournit une valeur invalide pour un attribut.

source: :meth:`localcontext` now supports setting context attributes through the use of keyword arguments.
fr: :meth:`localcontext` prend désormais en charge la définition des attributs de contexte grâce à l'utilisation d'arguments nommés.

source: New contexts can also be created using the :class:`Context` constructor described below. In addition, the module provides three pre-made contexts:
fr: De nouveaux contextes peuvent également être créés à l'aide du constructeur :class:`Context` décrit ci-dessous. De plus, le module fournit trois contextes prédéfinis :

source: This is a standard context defined by the General Decimal Arithmetic Specification. Precision is set to nine. Rounding is set to :const:`ROUND_HALF_UP`. All flags are cleared. All traps are enabled (treated as exceptions) except :const:`Inexact`, :const:`Rounded`, and :const:`Subnormal`.
fr: Il s'agit d'un contexte standard défini par la *General Decimal Arithmetic Specification*. La précision est fixée à neuf. L'arrondi est défini sur :const:`ROUND_HALF_UP`. Tous les drapeaux sont effacés. Toutes les surveillances sont activées (elles lèvent des exceptions) sauf :const:`Inexact`, :const:`Rounded` et :const:`Subnormal`.

source: Because many of the traps are enabled, this context is useful for debugging.
fr: Étant donné que de nombreuses options de surveillance sont activées, ce contexte est utile pour le débogage.

source: This is a standard context defined by the General Decimal Arithmetic Specification. Precision is set to nine. Rounding is set to :const:`ROUND_HALF_EVEN`. All flags are cleared. No traps are enabled (so that exceptions are not raised during computations).
fr: Il s'agit d'un contexte standard défini par la *General Decimal Arithmetic Specification*. La précision est fixée à neuf. L'arrondi est défini sur :const:`ROUND_HALF_EVEN`. Toutes les options de surveillance sont désactivées (afin que les exceptions ne soient pas levées pendant les calculs).

source: Because the traps are disabled, this context is useful for applications that prefer to have result value of ``NaN`` or ``Infinity`` instead of raising exceptions. This allows an application to complete a run in the presence of conditions that would otherwise halt the program.
fr: Comme les interruptions sont désactivées, ce contexte est utile pour les applications qui préfèrent avoir une valeur de résultat ``NaN`` ou ``Infinity`` au lieu de lever des exceptions. Cela permet à une application de terminer une exécution en présence de conditions qui, autrement, arrêteraient le programme.

source: This context is used by the :class:`Context` constructor as a prototype for new contexts. Changing a field (such a precision) has the effect of changing the default for new contexts created by the :class:`Context` constructor.
fr: Ce contexte est utilisé par le constructeur :class:`Context` comme prototype pour de nouveaux contextes. Changer un champ (par exemple la précision) a pour effet de changer la valeur par défaut pour les nouveaux contextes créés par le constructeur :class:`Context`.

source: This context is most useful in multi-threaded environments. Changing one of the fields before threads are started has the effect of setting system-wide defaults. Changing the fields after threads have started is not recommended as it would require thread synchronization to prevent race conditions.
fr: Ce contexte est particulièrement utile dans les environnements à plusieurs fils d'exécution. La modification de l'un des champs avant le démarrage des fils a pour effet de définir des valeurs par défaut à l'échelle du système. La modification des champs après le démarrage des fils d'exécution n'est pas recommandée car cela nécessiterait une synchronisation des fils d'exécution pour éviter des conditions de concurrence.

source: In single threaded environments, it is preferable to not use this context at all. Instead, simply create contexts explicitly as described below.
fr: Dans les environnements à fil d'exécution unique, il est préférable de ne pas utiliser ce contexte du tout. Créez plutôt simplement des contextes explicitement comme décrit ci-dessous.

source: The default values are :attr:`Context.prec`\ =\ ``28``, :attr:`Context.rounding`\ =\ :const:`ROUND_HALF_EVEN`, and enabled traps for :class:`Overflow`, :class:`InvalidOperation`, and :class:`DivisionByZero`.
fr: Les valeurs par défaut sont :attr:`Context.prec`\ =\ ``28``, :attr:`Context.rounding`\ =\ :const:`ROUND_HALF_EVEN` et les interruptions sont activées pour :class:`Overflow`, :class:`InvalidOperation` et :class:`DivisionByZero`.

source: In addition to the three supplied contexts, new contexts can be created with the :class:`Context` constructor.
fr: En plus des trois contextes fournis, de nouveaux contextes peuvent être créés avec le constructeur :class:`Context`.

source: Creates a new context. If a field is not specified or is :const:`None`, the default values are copied from the :const:`DefaultContext`. If the *flags* field is not specified or is :const:`None`, all flags are cleared.
fr: Crée un nouveau contexte. Si un champ n'est pas spécifié ou est :const:`None`, les valeurs par défaut sont copiées à partir du :const:`DefaultContext`. Si le champ *flags* n'est pas spécifié ou est :const:`None`, tous les indicateurs sont effacés.

source: *prec* is an integer in the range [``1``, :const:`MAX_PREC`] that sets the precision for arithmetic operations in the context.
fr: *prec* est un entier compris dans la plage [``1``, :const:`MAX_PREC`] qui définit la précision des opérations arithmétiques dans le contexte.

source: The *rounding* option is one of the constants listed in the section `Rounding Modes`_.
fr: L'option *rounding* est l'une des constantes répertoriées dans la section `Modes d'arrondi`_.

source: The *traps* and *flags* fields list any signals to be set. Generally, new contexts should only set traps and leave the flags clear.
fr: Les champs *traps* et *flags* répertorient tous les signaux à définir. En général, les nouveaux contextes ne doivent qu'activer des surveillances et laisser les drapeaux baissés.

source: The *Emin* and *Emax* fields are integers specifying the outer limits allowable for exponents. *Emin* must be in the range [:const:`MIN_EMIN`, ``0``], *Emax* in the range [``0``, :const:`MAX_EMAX`].
fr: Les champs *Emin* et *Emax* sont des entiers spécifiant les valeurs limites autorisées pour les exposants. *Emin* doit être dans [:const:`MIN_EMIN`, ``0``], *Emax* dans la plage [``0``, :const:`MAX_EMAX`].

source: The *capitals* field is either ``0`` or ``1`` (the default). If set to ``1``, exponents are printed with a capital ``E``; otherwise, a lowercase ``e`` is used: ``Decimal('6.02e+23')``.
fr: Le champ *capitals* est soit ``0`` soit ``1`` (la valeur par défaut). S'il est défini à ``1``, les exposants sont imprimés avec un ``E`` majuscule ; sinon, un ``e`` minuscule est utilisé : ``Decimal('6.02e+23')``.

source: The *clamp* field is either ``0`` (the default) or ``1``. If set to ``1``, the exponent ``e`` of a :class:`Decimal` instance representable in this context is strictly limited to the range ``Emin - prec + 1 <= e <= Emax - prec + 1``. If *clamp* is ``0`` then a weaker condition holds: the adjusted exponent of the :class:`Decimal` instance is at most :attr:`~Context.Emax`. When *clamp* is ``1``, a large normal number will, where possible, have its exponent reduced and a corresponding number of zeros added to its coefficient, in order to fit the exponent constraints; this preserves the value of the number but loses information about significant trailing zeros. For example::
fr: Le champ *clamp* est soit ``0`` (la valeur par défaut), soit ``1``. S'il est défini à ``1``, l'exposant ``e`` d'une instance :class:`Decimal` représentable dans ce contexte est strictement limité à la plage ``Emin - prec + 1 <= e <= Emax - prec + 1``. Si *clamp* est ``0`` alors une condition plus faible est vraie : l'exposant ajusté de l'instance :class:`Decimal` est au plus :attr:`~Context.Emax`. Lorsque *clamp* vaut ``1``, un grand nombre normal voit, si possible, son exposant réduit et un nombre correspondant de zéros ajouté à sa mantisse, afin de s'adapter aux contraintes d'exposant ; cela préserve la valeur du nombre mais perd des informations sur les zéros significatifs. Par exemple ::

source: A *clamp* value of ``1`` allows compatibility with the fixed-width decimal interchange formats specified in IEEE 754.
fr: Une valeur *clamp* de ``1`` permet la compatibilité avec les formats d'échange décimaux à largeur fixe spécifiés dans la norme IEEE 754.

source: The :class:`Context` class defines several general purpose methods as well as a large number of methods for doing arithmetic directly in a given context. In addition, for each of the :class:`Decimal` methods described above (with the exception of the :meth:`~Decimal.adjusted` and :meth:`~Decimal.as_tuple` methods) there is a corresponding :class:`Context` method. For example, for a :class:`Context` instance ``C`` and :class:`Decimal` instance ``x``, ``C.exp(x)`` is equivalent to ``x.exp(context=C)``. Each :class:`Context` method accepts a Python integer (an instance of :class:`int`) anywhere that a Decimal instance is accepted.
fr: La classe :class:`Context` définit plusieurs méthodes à usage général ainsi qu'un grand nombre de méthodes permettant de faire de l'arithmétique directement dans un contexte donné. De plus, pour chacune des méthodes :class:`Decimal` décrites ci-dessus (à l'exception des méthodes :meth:`~Decimal.adjusted` et :meth:`~Decimal.as_tuple`), il existe une méthode :class:`Context` correspondante. Par exemple, pour une instance :class:`Context` ``C`` et une instance :class:`Decimal` ``x``, ``C.exp(x)`` est équivalent à ``x.exp(context=C)``. Chaque méthode :class:`Context` accepte un entier Python (une instance de :class:`int`) partout où une instance Decimal est acceptée.

source: Resets all of the flags to ``0``.
fr: Réinitialise tous les drapeaux à ``0``.

source: Resets all of the traps to ``0``.
fr: Réinitialise toutes les surveillances à ``0``.

source: Return a duplicate of the context.
fr: Renvoie une copie du contexte.

source: Return a copy of the Decimal instance num.
fr: Renvoie une copie de l'instance :class:`!Decimal` *num*.

source: Creates a new Decimal instance from *num* but using *self* as context. Unlike the :class:`Decimal` constructor, the context precision, rounding method, flags, and traps are applied to the conversion.
fr: Crée une nouvelle instance Decimal à partir de *num* mais en utilisant *self* comme contexte. Contrairement au constructeur :class:`Decimal`, la précision du contexte, la méthode d'arrondi, les indicateurs et les surveillances sont appliqués à la conversion.

source: This is useful because constants are often given to a greater precision than is needed by the application. Another benefit is that rounding immediately eliminates unintended effects from digits beyond the current precision. In the following example, using unrounded inputs means that adding zero to a sum can change the result:
fr: C'est utile car les constantes sont souvent données avec une précision supérieure à celle requise par l'application. Un autre avantage est que l’arrondi élimine immédiatement les effets involontaires des chiffres au-delà de la précision actuelle. Dans l'exemple suivant, l'utilisation d'entrées non arrondies signifie que l'ajout de zéro à une somme peut modifier le résultat :

source: This method implements the to-number operation of the IBM specification. If the argument is a string, no leading or trailing whitespace or underscores are permitted.
fr: Cette méthode implémente l'opération *to-number* de la spécification IBM. Si l’argument est une chaîne, aucun espace ou trait de soulignement de début ou de fin n’est autorisé.

source: Creates a new Decimal instance from a float *f* but rounding using *self* as the context. Unlike the :meth:`Decimal.from_float` class method, the context precision, rounding method, flags, and traps are applied to the conversion.
fr: Crée une nouvelle instance Decimal à partir d'un *float* *f* mais en arrondissant en utilisant *self* comme contexte. Contrairement à la méthode de classe :meth:`Decimal.from_float`, la précision du contexte, la méthode d'arrondi, les indicateurs et les surveillances sont appliqués à la conversion.

source: Returns a value equal to ``Emin - prec + 1`` which is the minimum exponent value for subnormal results. When underflow occurs, the exponent is set to :const:`Etiny`.
fr: Renvoie une valeur égale à ``Emin - prec + 1`` qui est la valeur minimale de l'exposant pour les résultats avec dépassement inférieur. Lorsqu'un dépassement inférieur se produit, l'exposant est défini sur :const:`Etiny`.

source: Returns a value equal to ``Emax - prec + 1``.
fr: Renvoie une valeur égale à ``Emax - prec + 1``.

source: The usual approach to working with decimals is to create :class:`Decimal` instances and then apply arithmetic operations which take place within the current context for the active thread. An alternative approach is to use context methods for calculating within a specific context. The methods are similar to those for the :class:`Decimal` class and are only briefly recounted here.
fr: L'approche habituelle pour travailler avec des décimaux consiste à créer des instances :class:`Decimal`, puis à appliquer des opérations arithmétiques qui ont lieu dans le contexte actuel du fil d'exécution actif. Une approche alternative consiste à utiliser des méthodes contextuelles pour calculer dans un contexte spécifique. Les méthodes sont similaires à celles de la classe :class:`Decimal` et ne sont décrites que brièvement ici.

source: Returns the absolute value of *x*.
fr: Renvoie la valeur absolue de *x*.

source: Return the sum of *x* and *y*.
fr: Renvoie la somme de *x* et *y*.

source: Returns the same Decimal object *x*.
fr: Renvoie l'objet Decimal *x* lui-même.

source: Compares *x* and *y* numerically.
fr: Compare *x* et *y* numériquement.

source: Compares the values of the two operands numerically.
fr: Compare numériquement les valeurs des deux opérandes.

source: Compares two operands using their abstract representation.
fr: Compare deux opérandes en utilisant leur représentation abstraite.

source: Compares two operands using their abstract representation, ignoring sign.
fr: Compare deux opérandes en utilisant leur représentation abstraite, en ignorant le signe.

source: Returns a copy of *x* with the sign set to 0.
fr: Renvoie une copie de *x* avec le signe à 0 (c.-à-d. positif).

source: Returns a copy of *x* with the sign inverted.
fr: Renvoie une copie de *x* mais de signe opposé.

source: Copies the sign from *y* to *x*.
fr: Copie le signe de *y* vers *x*.

source: Return *x* divided by *y*.
fr: Renvoie *x* divisé par *y*.

source: Return *x* divided by *y*, truncated to an integer.
fr: Renvoie *x* divisé par *y*, tronqué comme entier.

source: Divides two numbers and returns the integer part of the result.
fr: Renvoie la partie entière de la division entre deux nombres.

source: Returns ``e ** x``.
fr: Renvoie ``e ** x``.

source: Returns *x* multiplied by *y*, plus *z*.
fr: Renvoie *x* multiplié par *y*, plus *z*.

source: Returns ``True`` if *x* is canonical; otherwise returns ``False``.
fr: Renvoie ``True`` si *x* est canonique ; ``False`` sinon.

source: Returns ``True`` if *x* is finite; otherwise returns ``False``.
fr: Renvoie ``True`` si *x* est fini ; ``False`` sinon.

source: Returns ``True`` if *x* is infinite; otherwise returns ``False``.
fr: Renvoie ``True`` si *x* est infini et ``False`` sinon.

source: Returns ``True`` if *x* is a qNaN or sNaN; otherwise returns ``False``.
fr: Renvoie ``True`` si *x* est un *NaN* (silencieux ou signalisé), ``False`` sinon.

source: Returns ``True`` if *x* is a normal number; otherwise returns ``False``.
fr: Renvoie ``True`` si *x* est un nombre normal ; ``False`` sinon.

source: Returns ``True`` if *x* is a quiet NaN; otherwise returns ``False``.
fr: Renvoie ``True`` si *x* est un *NaN* silencieux, ``False`` sinon.

source: Returns ``True`` if *x* is negative; otherwise returns ``False``.
fr: Renvoie ``True`` si *x* est négatif et ``False`` sinon.

source: Returns ``True`` if *x* is a signaling NaN; otherwise returns ``False``.
fr: Renvoie ``True`` si *x* est un *NaN* signalisé, ``False`` sinon.

source: Returns ``True`` if *x* is subnormal; otherwise returns ``False``.
fr: Renvoie ``True`` si *x* est est inférieur à la valeur minimale représentable ; sinon, renvoie ``False``.
