Repository: python/python-docs-fr
Catalog: library/decimal.po
Languages: fr

source: :mod:`decimal` --- Decimal fixed point and floating point arithmetic
fr: :mod:`decimal` — Arithmétique décimale en virgule fixe et flottante

source: **Source code:** :source:`Lib/decimal.py`
fr: **Code source :** :source:`Lib/decimal.py`

source: The :mod:`decimal` module provides support for fast correctly rounded decimal floating point arithmetic. It offers several advantages over the :class:`float` datatype:
fr: Le module :mod:`decimal` fournit une arithmétique en virgule flottante rapide et produisant des arrondis mathématiquement corrects. Il possède plusieurs avantages par rapport au type :class:`float` :

source: Decimal "is based on a floating-point model which was designed with people in mind, and necessarily has a paramount guiding principle -- computers must provide an arithmetic that works in the same way as the arithmetic that people learn at school." -- excerpt from the decimal arithmetic specification.
fr: Le module ``decimal`` « est basé sur un modèle en virgule flottante conçu pour les humains, qui suit ce principe directeur : l'ordinateur doit fournir un modèle de calcul qui fonctionne de la même manière que le calcul qu'on apprend à l'école » – extrait (traduit) de la spécification de l'arithmétique décimale.

source: Decimal numbers can be represented exactly. In contrast, numbers like ``1.1`` and ``2.2`` do not have exact representations in binary floating point. End users typically would not expect ``1.1 + 2.2`` to display as ``3.3000000000000003`` as it does with binary floating point.
fr: Les nombres décimaux peuvent être représentés exactement en base décimale flottante. En revanche, des nombres tels que ``1.1`` ou ``1.2`` n'ont pas de représentation exacte en base binaire flottante. L'utilisateur final ne s'attend typiquement pas à obtenir ``3.3000000000000003`` lorsqu'il saisit ``1.1 + 2.2``, ce qui se passe en arithmétique binaire à virgule flottante.

source: The exactness carries over into arithmetic. In decimal floating point, ``0.1 + 0.1 + 0.1 - 0.3`` is exactly equal to zero. In binary floating point, the result is ``5.5511151231257827e-017``. While near to zero, the differences prevent reliable equality testing and differences can accumulate. For this reason, decimal is preferred in accounting applications which have strict equality invariants.
fr: Ces inexactitudes ont des conséquences en arithmétique. En base décimale à virgule flottante, ``0.1 + 0.1 + 0.1 - 0.3`` est exactement égal à zéro. En virgule flottante binaire, l'ordinateur l'évalue à ``5.5511151231257827e-017``. Bien que très proche de zéro, cette différence induit des erreurs lors des tests d'égalité, erreurs qui peuvent s'accumuler. Pour ces raisons ``decimal`` est le module utilisé pour des applications comptables ayant des contraintes strictes de fiabilité.

source: The decimal module incorporates a notion of significant places so that ``1.30 + 1.20`` is ``2.50``. The trailing zero is kept to indicate significance. This is the customary presentation for monetary applications. For multiplication, the "schoolbook" approach uses all the figures in the multiplicands. For instance, ``1.3 * 1.2`` gives ``1.56`` while ``1.30 * 1.20`` gives ``1.5600``.
fr: Le module ``decimal`` incorpore la notion de chiffres significatifs, de façon à ce que ``1.30 + 1.20`` égale ``2.50``. Le dernier zéro est conservé pour respecter le nombre de chiffres significatifs. C'est l'affichage préféré pour représenter des sommes d'argent. Pour la multiplication, l'approche « scolaire » utilise tous les chiffres présents dans les facteurs. Par exemple, ``1.3 * 1.2`` donne ``1.56`` tandis que ``1.30 * 1.20`` donne ``1.5600``.

source: Unlike hardware based binary floating point, the decimal module has a user alterable precision (defaulting to 28 places) which can be as large as needed for a given problem:
fr: Contrairement à l'arithmétique en virgule flottante binaire, le module ``decimal`` possède un paramètre de précision ajustable (par défaut à 28 chiffres significatifs) qui peut être aussi élevée que nécessaire pour un problème donné :

source: Both binary and decimal floating point are implemented in terms of published standards. While the built-in float type exposes only a modest portion of its capabilities, the decimal module exposes all required parts of the standard. When needed, the programmer has full control over rounding and signal handling. This includes an option to enforce exact arithmetic by using exceptions to block any inexact operations.
fr: L'arithmétique binaire et décimale en virgule flottante sont implémentées selon des standards publiés. Alors que le type ``float`` n'expose qu'une faible portion de ses capacités, le module ``decimal`` expose tous les composants nécessaires du standard. Lorsque nécessaire, le développeur a un contrôle total de la gestion des signaux et de l'arrondi. Cela inclut la possibilité de forcer une arithmétique exacte en utilisant des exceptions pour bloquer toute opération inexacte.

source: The decimal module was designed to support "without prejudice, both exact unrounded decimal arithmetic (sometimes called fixed-point arithmetic) and rounded floating-point arithmetic." -- excerpt from the decimal arithmetic specification.
fr: Le module ``decimal`` a été conçu pour gérer « sans préjugé, à la fois une arithmétique décimale non-arrondie (aussi appelée arithmétique en virgule fixe) et à la fois une arithmétique en virgule flottante » (extrait traduit de la spécification de l'arithmétique décimale).

source: The module design is centered around three concepts: the decimal number, the context for arithmetic, and signals.
fr: Le module est conçu autour de trois concepts : le nombre décimal, le contexte arithmétique et les signaux.

source: A decimal number is immutable. It has a sign, coefficient digits, and an exponent. To preserve significance, the coefficient digits do not truncate trailing zeros. Decimals also include special values such as ``Infinity``, ``-Infinity``, and ``NaN``. The standard also differentiates ``-0`` from ``+0``.
fr: Un ``Decimal`` est immuable. Il a un signe, une mantisse et un exposant. Pour préserver le nombre de chiffres significatifs, les zéros en fin de chaîne ne sont pas tronqués. Les décimaux incluent aussi des valeurs spéciales telles que ``Infinity``, ``-Infinity`` et ``NaN``. Le standard fait également la différence entre ``-0`` et ``+0``.

source: The context for arithmetic is an environment specifying precision, rounding rules, limits on exponents, flags indicating the results of operations, and trap enablers which determine whether signals are treated as exceptions. Rounding options include :const:`ROUND_CEILING`, :const:`ROUND_DOWN`, :const:`ROUND_FLOOR`, :const:`ROUND_HALF_DOWN`, :const:`ROUND_HALF_EVEN`, :const:`ROUND_HALF_UP`, :const:`ROUND_UP`, and :const:`ROUND_05UP`.
fr: Le contexte de l'arithmétique est un environnement qui permet de configurer une précision, une règle pour l'arrondi, des limites sur l'exposant, des options indiquant le résultat des opérations et si les signaux (remontés lors d'opérations illégales) sont traités comme des exceptions Python. Les options d'arrondi incluent :const:`ROUND_CEILING`, :const:`ROUND_DOWN`, :const:`ROUND_FLOOR`, :const:`ROUND_HALF_DOWN`, :const:`ROUND_HALF_EVEN`, :const:`ROUND_HALF_UP`, :const:`ROUND_UP` et :const:`ROUND_05UP`.

source: Signals are groups of exceptional conditions arising during the course of computation. Depending on the needs of the application, signals may be ignored, considered as informational, or treated as exceptions. The signals in the decimal module are: :const:`Clamped`, :const:`InvalidOperation`, :const:`DivisionByZero`, :const:`Inexact`, :const:`Rounded`, :const:`Subnormal`, :const:`Overflow`, :const:`Underflow` and :const:`FloatOperation`.
fr: Les signaux sont des groupes de conditions exceptionnelles qui surviennent durant le calcul. Selon les besoins de l'application, les signaux peuvent être ignorés, considérés comme de l'information, ou bien traités comme des exceptions. Les signaux dans le module ``decimal`` sont : :const:`Clamped`, :const:`InvalidOperation`, :const:`DivisionByZero`, :const:`Inexact`, :const:`Rounded`, :const:`Subnormal`, :const:`Overflow`, :const:`Underflow` et :const:`FloatOperation`.

source: For each signal there is a flag and a trap enabler. When a signal is encountered, its flag is set to one, then, if the trap enabler is set to one, an exception is raised. Flags are sticky, so the user needs to reset them before monitoring a calculation.
fr: Chaque signal est configurable indépendamment, à travers un drapeau (ou option) et un activateur de surveillance. Quand une opération illégale survient, le drapeau du signal est mis à ``1`` puis, si l'activateur est configuré, une exception est levée. La mise à ``1`` du drapeau est persistante, l'utilisateur doit donc remettre les drapeaux à zéro avant de commencer un calcul qu'il souhaite surveiller.

source: IBM's General Decimal Arithmetic Specification, `The General Decimal Arithmetic Specification <https://speleotrove.com/decimal/decarith.html>`_.
fr: Spécification d'IBM sur l'arithmétique décimale : `The General Decimal Arithmetic Specification <https://speleotrove.com/decimal/decarith.html>`_ (article en anglais).

source: Quick-start Tutorial
fr: Introduction pratique

source: The usual start to using decimals is importing the module, viewing the current context with :func:`getcontext` and, if necessary, setting new values for precision, rounding, or enabled traps::
fr: Commençons par importer le module, regarder le contexte actuel avec :func:`getcontext` et, si nécessaire, configurer la précision, l'arrondi et la gestion des signaux ::

source: Decimal instances can be constructed from integers, strings, floats, or tuples. Construction from an integer or a float performs an exact conversion of the value of that integer or float. Decimal numbers include special values such as ``NaN`` which stands for "Not a number", positive and negative ``Infinity``, and ``-0``::
fr: Les instances de ``Decimal`` peuvent être construites avec des entiers, des chaînes de caractères, des ``floats`` ou des *n*-uplets. La construction depuis un entier ou un ``float`` effectue la conversion exacte de cet entier ou de ce ``float``. Les nombres décimaux incluent des valeurs spéciales telles que ``NaN`` qui signifie en anglais « *Not a number* », en français « pas un nombre », des ``Infinity`` positifs ou négatifs et ``-0`` ::

source: If the :exc:`FloatOperation` signal is trapped, accidental mixing of decimals and floats in constructors or ordering comparisons raises an exception::
fr: Si le signal :exc:`FloatOperation` est activé pour la surveillance, un mélange accidentel d'objets ``Decimal`` et de ``float`` dans les constructeurs ou des opérations de comparaison lève une exception ::

source: The significance of a new Decimal is determined solely by the number of digits input. Context precision and rounding only come into play during arithmetic operations.
fr: Le nombre de chiffres significatifs d'un nouvel objet ``Decimal`` est déterminé entièrement par le nombre de chiffres saisis. La précision et les règles d'arrondis n'interviennent que lors d'opérations arithmétiques.

source: If the internal limits of the C version are exceeded, constructing a decimal raises :class:`InvalidOperation`::
fr: Si les limites internes de la version en C sont dépassées, la construction d'un objet décimal lève l'exception :class:`InvalidOperation` ::

source: Decimals interact well with much of the rest of Python. Here is a small decimal floating point flying circus:
fr: Les objets ``Decimal`` interagissent très bien avec le reste de Python. Voici quelques exemples d'opérations avec des décimaux :

source: And some mathematical functions are also available to Decimal:
fr: Et certaines fonctions mathématiques sont également disponibles sur des instances de ``Decimal`` :

source: The :meth:`~Decimal.quantize` method rounds a number to a fixed exponent. This method is useful for monetary applications that often round results to a fixed number of places:
fr: La méthode :meth:`~Decimal.quantize` arrondit un nombre à un exposant déterminé. Cette méthode est utile pour des applications monétaires qui arrondissent souvent un résultat à un nombre déterminé de chiffres après la virgule :

source: As shown above, the :func:`getcontext` function accesses the current context and allows the settings to be changed. This approach meets the needs of most applications.
fr: Comme montré plus haut, la fonction :func:`getcontext` accède au contexte actuel et permet de modifier les paramètres. Cette approche répond aux besoins de la plupart des applications.

source: For more advanced work, it may be useful to create alternate contexts using the Context() constructor. To make an alternate active, use the :func:`setcontext` function.
fr: Pour un travail plus avancé, il peut être utile de créer des contextes alternatifs en utilisant le constructeur de ``Context``. Pour activer cet objet ``Context``, utilisez la fonction :func:`setcontext`.

source: In accordance with the standard, the :mod:`decimal` module provides two ready to use standard contexts, :const:`BasicContext` and :const:`ExtendedContext`. The former is especially useful for debugging because many of the traps are enabled:
fr: En accord avec le standard, le module :mod:`decimal` fournit des objets *Context* standards, :const:`BasicContext` et :const:`ExtendedContext`. Le premier est particulièrement utile pour le débogage car beaucoup des signaux ont leur surveillance activée :

source: Contexts also have signal flags for monitoring exceptional conditions encountered during computations. The flags remain set until explicitly cleared, so it is best to clear the flags before each set of monitored computations by using the :meth:`~Context.clear_flags` method. ::
fr: Les objets ``Context`` ont aussi des options pour détecter des opérations illégales lors des calculs. Ces options restent activées jusqu'à ce qu'elles soit remises à zéro de manière explicite. Il convient donc de remettre à zéro ces options avant chaque inspection de chaque calcul, avec la méthode :meth:`~Context.clear_flags`. ::

source: The *flags* entry shows that the rational approximation to pi was rounded (digits beyond the context precision were thrown away) and that the result is inexact (some of the discarded digits were non-zero).
fr: Les options montrent que l'approximation de π par une fraction a été arrondie (les chiffres au-delà de la précision spécifiée par l'objet *Context* ont été tronqués) et que le résultat est différent (certains des chiffres tronqués étaient différents de zéro).

source: Individual traps are set using the dictionary in the :attr:`~Context.traps` attribute of a context:
fr: L'activation de la surveillance se fait en utilisant un dictionnaire dans l'attribut :attr:`~Context.traps` du contexte :

source: Most programs adjust the current context only once, at the beginning of the program. And, in many applications, data is converted to :class:`Decimal` with a single cast inside a loop. With context set and decimals created, the bulk of the program manipulates the data no differently than with other Python numeric types.
fr: La plupart des applications n'ajustent l'objet ``Context`` qu'une seule fois, au démarrage. Et, dans beaucoup d'applications, les données sont converties une fois pour toutes en :class:`Decimal`. Une fois le ``Context`` initialisé et les objets ``Decimal`` créés, la majeure partie du programme manipule les données de la même manière qu'avec d'autres types numériques Python.

source: Decimal objects
fr: Les objets :class:`!Decimal`

source: Construct a new :class:`Decimal` object based from *value*.
fr: Construit un nouvel objet :class:`Decimal` à partir de *value*.

source: *value* can be an integer, string, tuple, :class:`float`, or another :class:`Decimal` object. If no *value* is given, returns ``Decimal('0')``. If *value* is a string, it should conform to the decimal numeric string syntax after leading and trailing whitespace characters, as well as underscores throughout, are removed::
fr: *value* peut être un entier, une chaîne de caractères, un *n*-uplet, un :class:`float` ou une autre instance de :class:`Decimal`. Si *value* n'est pas fourni, le constructeur renvoie ``Decimal('0')``. Si *value* est une chaîne de caractères, elle doit correspondre à la syntaxe décimale en dehors des espaces de début et de fin, ou des tirets bas, qui sont enlevés ::

source: Other Unicode decimal digits are also permitted where ``digit`` appears above. These include decimal digits from various other alphabets (for example, Arabic-Indic and Devanāgarī digits) along with the fullwidth digits ``'\uff10'`` through ``'\uff19'``.
fr: Les chiffres codés en Unicode sont aussi autorisés, dans les emplacements ``digit`` ci-dessus. Cela inclut des chiffres décimaux venant d'autres alphabets (par exemple les chiffres indo-arabes ou Devanagari) ainsi que les chiffres de pleine largeur ``'\uff10'`` jusqu'à ``'\uff19'``.

source: If *value* is a :class:`tuple`, it should have three components, a sign (``0`` for positive or ``1`` for negative), a :class:`tuple` of digits, and an integer exponent. For example, ``Decimal((0, (1, 4, 1, 4), -3))`` returns ``Decimal('1.414')``.
fr: Si *value* est un :class:`n-uplet <tuple>`, il doit avoir trois éléments, le signe (``0`` pour positif ou ``1`` pour négatif), un :class:`n-uplet <tuple>` de chiffres et un entier représentant l'exposant. Par exemple, ``Decimal((0, (1, 4, 1, 4), -3))`` construit l'objet ``Decimal('1.414')``.

source: If *value* is a :class:`float`, the binary floating point value is losslessly converted to its exact decimal equivalent. This conversion can often require 53 or more digits of precision. For example, ``Decimal(float('1.1'))`` converts to ``Decimal('1.100000000000000088817841970012523233890533447265625')``.
fr: Si *value* est un :class:`float`, la valeur en binaire flottant est convertie exactement à son équivalent décimal. Cette conversion peut parfois nécessiter 53 chiffres significatifs ou plus. Par exemple, ``Decimal(float('1.1'))`` devient ``Decimal('1.100000000000000088817841970012523233890533447265625')``.

source: The *context* precision does not affect how many digits are stored. That is determined exclusively by the number of digits in *value*. For example, ``Decimal('3.00000')`` records all five zeros even if the context precision is only three.
fr: La précision spécifiée dans le contexte n'affecte pas le nombre de chiffres stockés. Cette valeur est déterminée exclusivement par le nombre de chiffres dans *value*. Par exemple, ``Decimal('3.00000')`` enregistre les 5 zéros même si la précision du contexte est de 3.

source: The purpose of the *context* argument is determining what to do if *value* is a malformed string. If the context traps :const:`InvalidOperation`, an exception is raised; otherwise, the constructor returns a new Decimal with the value of ``NaN``.
fr: L'objectif de l'argument *context* est de déterminer ce que Python doit faire si *value* est une chaîne avec un mauvais format. Si la surveillance est activée pour :const:`InvalidOperation`, une exception est levée, sinon le constructeur renvoie un objet ``Decimal`` de valeur ``NaN``.

source: Once constructed, :class:`Decimal` objects are immutable.
fr: Une fois construit, un objet :class:`Decimal` est immuable.

source: The argument to the constructor is now permitted to be a :class:`float` instance.
fr: l'argument du constructeur peut désormais être un objet :class:`float`.

source: :class:`float` arguments raise an exception if the :exc:`FloatOperation` trap is set. By default the trap is off.
fr: un argument :class:`float` lève une exception si la surveillance est activée pour :exc:`FloatOperation`. Par défaut la surveillance n'est pas activée.

source: Underscores are allowed for grouping, as with integral and floating-point literals in code.
fr: les tirets bas sont autorisés pour grouper des chiffres, tout comme pour l'arithmétique en virgule fixe et flottante.

source: Decimal floating point objects share many properties with the other built-in numeric types such as :class:`float` and :class:`int`. All of the usual math operations and special methods apply. Likewise, decimal objects can be copied, pickled, printed, used as dictionary keys, used as set elements, compared, sorted, and coerced to another type (such as :class:`float` or :class:`int`).
fr: Les objets ``Decimal`` partagent beaucoup de propriétés avec les autres types numériques natifs tels que :class:`float` et :class:`int`. Toutes les opérations mathématiques et méthodes sont conservées. De même les objets ``Decimal`` peuvent être copiés, sérialisés via le module ``pickle``, affichés, utilisés comme clé de dictionnaire, éléments d'ensembles, comparés, classés et convertis vers un autre type (tel que :class:`float` ou :class:`int`).

source: There are some small differences between arithmetic on Decimal objects and arithmetic on integers and floats. When the remainder operator ``%`` is applied to Decimal objects, the sign of the result is the sign of the *dividend* rather than the sign of the divisor::
fr: Il existe quelques différences mineures entre l'arithmétique entre les objets décimaux et l'arithmétique avec les entiers et les ``float``. Quand l'opérateur modulo ``%`` est appliqué sur des objets décimaux, le signe du résultat est le signe du *dividende* plutôt que le signe du diviseur ::

source: The integer division operator ``//`` behaves analogously, returning the integer part of the true quotient (truncating towards zero) rather than its floor, so as to preserve the usual identity ``x == (x // y) * y + x % y``::
fr: L'opérateur division entière (``//``) se comporte de la même manière, renvoyant la partie entière du quotient plutôt que son arrondi, de manière à préserver l'identité d'Euclide ``x == (x // y) * y + x % y`` ::

source: The ``%`` and ``//`` operators implement the ``remainder`` and ``divide-integer`` operations (respectively) as described in the specification.
fr: Les opérateurs ``//`` et ``%`` implémentent la division entière et le reste (ou modulo), respectivement, tels que décrits dans la spécification.

source: Decimal objects cannot generally be combined with floats or instances of :class:`fractions.Fraction` in arithmetic operations: an attempt to add a :class:`Decimal` to a :class:`float`, for example, will raise a :exc:`TypeError`. However, it is possible to use Python's comparison operators to compare a :class:`Decimal` instance ``x`` with another number ``y``. This avoids confusing results when doing equality comparisons between numbers of different types.
fr: Les objets ``Decimal`` ne peuvent généralement pas être combinés avec des ``float`` ou des objets :class:`fractions.Fraction` lors d'opérations arithmétiques : toute addition entre un :class:`Decimal` et un :class:`float`, par exemple, lève une exception :exc:`TypeError`. Cependant, il est possible d'utiliser les opérateurs de comparaison entre instances de :class:`Decimal` et les autres types numériques. Cela évite d'avoir des résultats absurdes lors des tests d'égalité entre différents types.

source: Mixed-type comparisons between :class:`Decimal` instances and other numeric types are now fully supported.
fr: les comparaisons inter-types entre :class:`Decimal` et les autres types numériques sont désormais intégralement gérées.

source: In addition to the standard numeric properties, decimal floating point objects also have a number of specialized methods:
fr: En plus des propriétés numériques standard, les objets décimaux à virgule flottante ont également un certain nombre de méthodes spécialisées :
