Repository: python/python-docs-fr
Catalog: library/dialog.po
Languages: fr

source: Tkinter Dialogs
fr: Boîtes de dialogue *Tkinter*

source: :mod:`tkinter.simpledialog` --- Standard Tkinter input dialogs
fr: :mod:`tkinter.simpledialog` – Boîtes de dialogue de saisie standard de *Tkinter*

source: **Source code:** :source:`Lib/tkinter/simpledialog.py`
fr: **Code source :** :source:`Lib/tkinter/simpledialog.py`

source: The :mod:`tkinter.simpledialog` module contains convenience classes and functions for creating simple modal dialogs to get a value from the user.
fr: Le module :mod:`tkinter.simpledialog` contient des classes pratiques et des fonctions pour créer des boîtes de dialogue modales simples afin d'obtenir une valeur de l'utilisateur.

source: The above three functions provide dialogs that prompt the user to enter a value of the desired type.
fr: Les trois fonctions ci-dessus fournissent des boîtes de dialogue qui invitent l'utilisateur à saisir une valeur du type souhaité.

source: The base class for custom dialogs.
fr: Classe mère pour les boîtes de dialogue personnalisées.

source: Override to construct the dialog's interface and return the widget that should have initial focus.
fr: À remplacer pour construire l'interface de la boîte de dialogue et renvoyer le widget qui doit avoir le focus initial.

source: Default behaviour adds OK and Cancel buttons. Override for custom button layouts.
fr: Le comportement par défaut ajoute les boutons OK et Annuler. À remplacer avoir une disposition de boutons personnalisée.

source: :mod:`tkinter.filedialog` --- File selection dialogs
fr: :mod:`tkinter.filedialog` – Boîtes de dialogue de sélection de fichiers

source: **Source code:** :source:`Lib/tkinter/filedialog.py`
fr: **Code source :** :source:`Lib/tkinter/filedialog.py`

source: The :mod:`tkinter.filedialog` module provides classes and factory functions for creating file/directory selection windows.
fr: Le module :mod:`tkinter.filedialog` fournit des classes et des fonctions de fabrique pour créer des fenêtres de sélection de fichiers ou répertoires.

source: Native Load/Save Dialogs
fr: Boîtes de dialogue de chargement et sauvegarde natives

source: The following classes and functions provide file dialog windows that combine a native look-and-feel with configuration options to customize behaviour. The following keyword arguments are applicable to the classes and functions listed below:
fr: Les classes et fonctions suivantes fournissent des fenêtres de dialogue de fichiers qui combinent une apparence native avec des options de configuration pour personnaliser le comportement. Les arguments nommés suivants s'appliquent aux classes et fonctions répertoriées ci-dessous :

source: *parent* - the window to place the dialog on top of
fr: *parent* – la fenêtre sur laquelle placer la boîte de dialogue

source: *title* - the title of the window
fr: *title* – le titre de la fenêtre

source: *initialdir* - the directory that the dialog starts in
fr: *initialdir* – le répertoire dans lequel la boîte de dialogue démarre

source: *initialfile* - the file selected upon opening of the dialog
fr: *initialfile* – le fichier sélectionné à l'ouverture de la boîte de dialogue

source: *filetypes* - a sequence of (label, pattern) tuples, '*' wildcard is allowed
fr: *filetypes* – une séquence de *n*-uplets (étiquette, motif), le caractère générique ``'*'`` est autorisé

source: *defaultextension* - default extension to append to file (save dialogs)
fr: *defaultextension* – extension par défaut à ajouter au fichier (boîtes de dialogue de sauvegarde)

source: *multiple* - when true, selection of multiple items is allowed
fr: *multiple* – lorsque vrai, la sélection de plusieurs éléments est autorisée

source: **Static factory functions**
fr: **Fonctions statiques de fabrique**

source: The below functions when called create a modal, native look-and-feel dialog, wait for the user's selection, then return the selected value(s) or ``None`` to the caller.
fr: Les fonctions ci-dessous, lorsqu'elles sont appelées, créent une boîte de dialogue d'apparence modale native, attendent la sélection de l'utilisateur, puis renvoient la ou les valeurs sélectionnées ou ``None`` à l'appelant.

source: The above two functions create an :class:`Open` dialog and return the opened file object(s) in read-only mode.
fr: Les deux fonctions ci-dessus créent une boîte de dialogue :class:`Open` et renvoient le(s) objet(s) fichier ouvert(s) en mode lecture seule.

source: Create a :class:`SaveAs` dialog and return a file object opened in write-only mode.
fr: Crée une boîte de dialogue :class:`SaveAs` et renvoie un objet fichier ouvert en mode écriture seule.

source: The above two functions create an :class:`Open` dialog and return the selected filename(s) that correspond to existing file(s).
fr: Les deux fonctions ci-dessus créent une boîte de dialogue :class:`Open` et renvoient le(s) nom(s) de fichier sélectionné(s) qui correspondent au(x) fichier(s) existant(s).

source: Create a :class:`SaveAs` dialog and return the selected filename.
fr: Crée une boîte de dialogue :class:`SaveAs` et renvoie le nom de fichier sélectionné.

source: Prompt user to select a directory.
fr: Demande à l'utilisateur de sélectionner un répertoire.

source: Additional keyword option:
fr: Option nommée supplémentaire :

source: *mustexist* - determines if selection must be an existing directory.
fr: *mustexist* – détermine si la sélection doit être un répertoire existant.

source: The above two classes provide native dialog windows for saving and loading files.
fr: Les deux classes ci-dessus fournissent des fenêtres de dialogue natives pour enregistrer et charger des fichiers.

source: **Convenience classes**
fr: **Classes de commodité**

source: The below classes are used for creating file/directory windows from scratch. These do not emulate the native look-and-feel of the platform.
fr: Les classes ci-dessous sont utilisées pour créer des fenêtres avec fichiers et répertoires à partir de zéro. Celles-ci n'imitent pas l'apparence native de la plateforme.

source: Create a dialog prompting the user to select a directory.
fr: Crée une boîte de dialogue invitant l'utilisateur à sélectionner un répertoire.

source: The *FileDialog* class should be subclassed for custom event handling and behaviour.
fr: la classe *FileDialog* doit être sous-classée pour un comportement et une gestion des événements personnalisés.

source: Create a basic file selection dialog.
fr: Crée une boîte de dialogue basique de sélection de fichiers.

source: Trigger the termination of the dialog window.
fr: Déclenche la fermeture de la fenêtre de dialogue.

source: Event handler for double-click event on directory.
fr: Gestionnaire d'événements pour l'événement de double-clic sur le répertoire.

source: Event handler for click event on directory.
fr: Gestionnaire d'événements pour l'événement de clic sur le répertoire.

source: Event handler for double-click event on file.
fr: Gestionnaire d'événements pour l'événement de double-clic sur le fichier.

source: Event handler for single-click event on file.
fr: Gestionnaire d'événements pour un événement en un seul clic sur le fichier.

source: Filter the files by directory.
fr: Filtre les fichiers par répertoire.

source: Retrieve the file filter currently in use.
fr: Récupère le filtre de fichiers actuellement utilisé.

source: Retrieve the currently selected item.
fr: Récupère l'élément actuellement sélectionné.

source: Render dialog and start event loop.
fr: Affiche la boîte de dialogue et lance la boucle d'événements.

source: Exit dialog returning current selection.
fr: Quitte la boîte de dialogue en renvoyant la sélection actuelle.

source: Exit dialog returning filename, if any.
fr: Sort de la boîte de dialogue en renvoyant le nom du fichier, le cas échéant.

source: Set the file filter.
fr: Définit le filtre de fichiers.

source: Update the current file selection to *file*.
fr: Met à jour la sélection de fichiers actuelle vers *file*.

source: A subclass of FileDialog that creates a dialog window for selecting an existing file.
fr: Sous-classe de *FileDialog* qui crée une fenêtre de dialogue pour sélectionner un fichier existant.

source: Test that a file is provided and that the selection indicates an already existing file.
fr: Teste qu'un fichier est fourni et que la sélection indique un fichier déjà existant.

source: A subclass of FileDialog that creates a dialog window for selecting a destination file.
fr: Sous-classe de *FileDialog* qui crée une fenêtre de dialogue pour sélectionner un fichier de destination.

source: Test whether or not the selection points to a valid file that is not a directory. Confirmation is required if an already existing file is selected.
fr: Teste si la sélection pointe vers un fichier valide qui n'est pas un répertoire. Une confirmation est requise si un fichier déjà existant est sélectionné.

source: :mod:`tkinter.commondialog` --- Dialog window templates
fr: :mod:`tkinter.commondialog` – Modèles de fenêtre de dialogue

source: **Source code:** :source:`Lib/tkinter/commondialog.py`
fr: **Code source :** :source:`Lib/tkinter/commondialog.py`

source: The :mod:`tkinter.commondialog` module provides the :class:`Dialog` class that is the base class for dialogs defined in other supporting modules.
fr: Le module :mod:`tkinter.commondialog` fournit la classe :class:`Dialog` qui est la classe mère pour les dialogues définis dans d'autres modules.

source: Render the Dialog window.
fr: Affiche la fenêtre de dialogue.
