Repository: python/python-docs-fr
Catalog: library/distutils.po
Languages: fr

source: :mod:`distutils` --- Building and installing Python modules
fr: :mod:`distutils` — Création et installation des modules Python

source: The :mod:`distutils` package provides support for building and installing additional modules into a Python installation. The new modules may be either 100%-pure Python, or may be extension modules written in C, or may be collections of Python packages which include modules coded in both Python and C.
fr: Le package :mod:`distutils` fournit le support pour la création et l'installation de modules supplémentaires dans une installation Python. Les nouveaux modules peuvent être soit en Python pur à 100%, soit des modules d'extension écrits en C, soit des collections de paquets Python qui incluent des modules codés en C et en Python.

source: Most Python users will *not* want to use this module directly, but instead use the cross-version tools maintained by the Python Packaging Authority. In particular, `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ is an enhanced alternative to :mod:`distutils` that provides:
fr: La plupart des utilisateurs de Python ne voudront *pas* utiliser ce module directement, mais plutôt les outils cross-version maintenus par la *Python Packaging Authority*. En particulier, `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ est une alternative améliorée à :mod:`distutils` qui fournit :

source: support for declaring project dependencies
fr: support pour la déclaration des dépendances de projets

source: additional mechanisms for configuring which files to include in source releases (including plugins for integration with version control systems)
fr: mécanismes supplémentaires pour configurer quels fichiers inclure dans les distributions source (y compris les extensions pour l'intégration avec les systèmes de contrôle de version)

source: the ability to declare project "entry points", which can be used as the basis for application plugin systems
fr: la possibilité de déclarer les "points d'entrée" du projet, qui peuvent être utilisés comme base pour les systèmes d'extensions

source: the ability to automatically generate Windows command line executables at installation time rather than needing to prebuild them
fr: la possibilité de générer automatiquement des exécutables en ligne de commande Windows au moment de l'installation plutôt que de devoir les pré-construire

source: consistent behaviour across all supported Python versions
fr: comportement cohérent entre toutes les versions Python supportées

source: The recommended `pip <https://pip.pypa.io/>`__ installer runs all ``setup.py`` scripts with ``setuptools``, even if the script itself only imports ``distutils``. Refer to the `Python Packaging User Guide <https://packaging.python.org>`_ for more information.
fr: Le programme d'installation recommandé `pip <https://pip.pypa.io/>`__ exécute tous les scripts ``setup. py`` avec ``setuptools``, même si le script lui-même n'importe que ``distutils``. Pour plus d'informations, reportez-vous au `Python Packaging User Guide <https://packaging.python.org>`_.

source: For the benefits of packaging tool authors and users seeking a deeper understanding of the details of the current packaging and distribution system, the legacy :mod:`distutils` based user documentation and API reference remain available:
fr: À destination des auteurs et utilisateurs d'outils d'empaquetage cherchant une compréhension plus approfondie des détails du système actuel de création de paquets et de leur distribution, la documentation utilisateur historique de :mod:`distutils` la référence de son API restent disponibles :
