Repository: python/python-docs-fr
Catalog: library/doctest.po
Languages: fr

source: This is a module-global setting, and affects all future doctests run by module :mod:`unittest`: the :meth:`runTest` method of :class:`DocTestCase` looks at the option flags specified for the test case when the :class:`DocTestCase` instance was constructed. If no reporting flags were specified (which is the typical and expected case), :mod:`doctest`'s :mod:`unittest` reporting flags are :ref:`bitwise ORed <bitwise>` into the option flags, and the option flags so augmented are passed to the :class:`DocTestRunner` instance created to run the doctest. If any reporting flags were specified when the :class:`DocTestCase` instance was constructed, :mod:`doctest`'s :mod:`unittest` reporting flags are ignored.
fr: Ceci est un paramètre au niveau global du module, et affecte tous les futurs *doctests* exécutés par le module :mod:`unittest` : la méthode :meth:`runTest` de :class:`DocTestCase` prend en compte les options précisées pour le cas de test lorsque l'instance de la classe :class:`DocTestCase` a été construite. Si aucune option de rapport n'a été précisée (ce qui est le cas typique et attendu), les options de rapport du module :mod:`unitest` de :mod:`doctest` sont :ref:`<composés avec un OU <bitwise>` vers les options, et les options obtenues sont passées à l'instance de la classe :class:`DocTestRunner` créée pour exécuter le *doctest*. Si une seule option de rapport a été précisée lorsque l'instance de :class:`DocTestCase` a été construite, les options de rapport du module :mod:`unittest` de :mod:`doctest` sont ignorées.

source: The value of the :mod:`unittest` reporting flags in effect before the function was called is returned by the function.
fr: La valeur prise par les options de rapport de :mod:`unittest` et ce, avant que la fonction n'ait été appelée, est renvoyée par la fonction.

source: Advanced API
fr: API avancé

source: :class:`Example`: A single Python :term:`statement`, paired with its expected output.
fr: :class:`Example` : Un unique :term:`statement` Python, pris conjointement avec sa sortie attendue.

source: :class:`DocTest`: A collection of :class:`Example`\ s, typically extracted from a single docstring or text file.
fr: :class:`DocTest` : Une collection de :class:`Example`, habituellement extraits d'une seule *docstring* ou fichier texte.

source: DocTest Objects
fr: Objets *doctest*

source: :class:`DocTest` defines the following attributes. They are initialized by the constructor, and should not be modified directly.
fr: :class:`DocTest` définit les attributs suivants. Ils sont initialisés par le constructeur, et ne doivent pas être modifiés directement.

source: Example Objects
fr: Exemples d'objets

source: DocTestFinder objects
fr: Objets *DocTestFinder*

source: :class:`DocTestFinder` defines the following method:
fr: La classe :class:`DocTestFinder` définit la méthode suivante :

source: To find the name of the file containing the object.
fr: Afin de trouver le nom du fichier contenant l'objet.

source: DocTestParser objects
fr: Objets *DocTestParser*

source: :class:`DocTestParser` defines the following methods:
fr: La classe :class:`DocTestFinder` définit les méthodes suivantes :

source: Extract all doctest examples from the given string, and collect them into a :class:`DocTest` object.
fr: Extrait tous les exemples de *doctests* à partir de la chaîne de caractère donnée, et les réunit dans un objet :class:`DocTest`.

source: *globs*, *name*, *filename*, and *lineno* are attributes for the new :class:`DocTest` object. See the documentation for :class:`DocTest` for more information.
fr: Notez que *globs*, *name*, *filname* et *lineno* sont des attributs pour le nouvel objet :class:`DocTest`. Voir la documentation pour :class:`DocTest` pour plus d'information.

source: DocTestRunner objects
fr: Objets *DocTestRunner*

source: OutputChecker objects
fr: Objets *OutputChecker*

source: :class:`OutputChecker` defines the following methods:
fr: La classe :class:`OutputChecker` définit les méthodes suivantes :

source: Debugging
fr: Débogage

source: Doctest provides several mechanisms for debugging doctest examples:
fr: *Doctest* fournit plusieurs mécanismes pour déboguer des exemples *doctest* :

source: Several functions convert doctests to executable Python programs, which can be run under the Python debugger, :mod:`pdb`.
fr: Plusieurs fonctions convertissent les *doctests* en programmes Python exécutables, qui peuvent être exécutés grâce au débogueur Python, :mod:`pdb`.

source: Then an interactive Python session may look like this::
fr: Alors une séance interactive de Python peut ressembler à ceci ::

source: Convert text with examples to a script.
fr: Convertit du texte contenant des exemples en un script.

source: This function is used internally by other functions (see below), but can also be useful when you want to transform an interactive Python session into a Python script.
fr: Cette fonction est utilisée à l'interne par d'autres fonctions (voir ci-bas), mais peut aussi être utile lorsque l'on souhaite transformer une séance interactive de Python en script Python.

source: Convert the doctest for an object to a script.
fr: Convertit en script l'objet *doctest*.

source: prints a script version of function :func:`f`'s docstring, with doctests converted to code, and the rest placed in comments.
fr: affiche une version script de la *docstring* de la fonction :func:`f`, avec des *doctests* convertis en code, et le reste dans les commentaires.

source: Debug the doctests for an object.
fr: Débogue les *doctests* pour un objet.

source: A shallow copy of ``module.__dict__`` is used for both local and global execution context.
fr: Une copie superficielle de ``module.__dict__`` est utilisée à la fois pour les contextes d'exécution locaux et globaux.

source: Debug the doctests in a string.
fr: Débogue les *doctests* dans une chaîne de caractères.

source: This is like function :func:`debug` above, except that a string containing doctest examples is specified directly, via the *src* argument.
fr: Ceci est similaire à la fonction :func:`debug` décrite ci-haut, mis-à-part qu'une chaîne de caractères contenant des exemples *doctest* est définie directement, par l'option *src*.

source: Optional argument *pm* has the same meaning as in function :func:`debug` above.
fr: L'option *pm* a la même définition que dans la fonction :func:`debug` ci-haut.

source: Optional argument *globs* gives a dictionary to use as both local and global execution context. If not specified, or ``None``, an empty dictionary is used. If specified, a shallow copy of the dictionary is used.
fr: L'option *globs* définit un dictionnaire à utiliser comme contexte d'exécution global et local. Si elle n'est pas définie, ou si ``None``, un dictionnaire vide est utilisé. Si définie, une copie superficielle du dictionnaire est utilisée.

source: For information about the constructor parameters and methods, see the documentation for :class:`DocTestRunner` in section :ref:`doctest-advanced-api`.
fr: Pour de l'information sur les paramètres et méthodes du constructeur, voir la documentation pour la classe :class:`DocTestrunner` dans la section :reF:`doctest-advanced-api`.

source: There are two exceptions that may be raised by :class:`DebugRunner` instances:
fr: Il y a deux exceptions qui peuvent être levées par des instances :class:`DebugRunner` :

source: An exception raised by :class:`DocTestRunner` to signal that a doctest example's actual output did not match its expected output. The constructor arguments are used to initialize the attributes of the same names.
fr: Une exception levée par :class:`DocTestRunner` pour signaler que la sortie obtenue suite à un exemple *doctest* ne correspond pas à la sortie attendue. Les arguments du constructeur sont utilisés pour initialiser les attributs des mêmes noms.

source: :exc:`DocTestFailure` defines the following attributes:
fr: :exc:`DocTestFailure` définit les attributs suivants :

source: The :class:`DocTest` object that was being run when the example failed.
fr: L'objet issu de la classe :class:`DocTest` qui était en cours d'exécution lorsque l'exemple a échoué.

source: The :class:`Example` that failed.
fr: L'exemple :class:`Example` qui a échoué.

source: The example's actual output.
fr: La sortie obtenue par l'exécution de l'exemple.

source: An exception raised by :class:`DocTestRunner` to signal that a doctest example raised an unexpected exception. The constructor arguments are used to initialize the attributes of the same names.
fr: Une exception levée par :class:`DocTestRunner` afin de signaler qu'un exemple *doctest* a levé une exception inattendue. Les arguments du constructeur sont utilisés pour initialiser les attributs des mêmes noms.

source: :exc:`UnexpectedException` defines the following attributes:
fr: :exc:`UnexpectedException` définit les attributs suivants :

source: A tuple containing information about the unexpected exception, as returned by :func:`sys.exc_info`.
fr: Un n-uplet contenant l'information au sujet de l'exception inattendue, telle que retourné par :func:`sys.exc_info`.

source: Soapbox
fr: Éditorial

source: As mentioned in the introduction, :mod:`doctest` has grown to have three primary uses:
fr: Comme mentionné dans l'introduction, :mod:`doctest` a présentement trois usages principaux :

source: Checking examples in docstrings.
fr: Vérifier les exemples dans les *docstrings*.

source: Regression testing.
fr: Test de régression.

source: Executable documentation / literate testing.
fr: De la documentation exécutable / des tests littéraires.

source: When you have placed your tests in a module, the module can itself be the test runner. When a test fails, you can arrange for your test runner to re-run only the failing doctest while you debug the problem. Here is a minimal example of such a test runner::
fr: Lorsque vous placez vos tests dans un module, le module lui-même peut être l'exécuteur de tests. Lorsqu'un test échoue, vous pouvez signifier à votre exécuteur de tests de rouler une seconde fois uniquement les tests qui échouent et ce, tant que vous travaillez sur le problème. Voici un exemple minimal d'un test exécuteur de tests ::

source: Footnotes
fr: Notes

source: Examples containing both expected output and an exception are not supported. Trying to guess where one ends and the other begins is too error-prone, and that also makes for a confusing test.
fr: Les exemples contenant à la fois la sortie attendue et une exception ne sont pas supportés. Tenter de deviner où finit l'un et où commence l'autre peut mener à plusieurs erreurs, en plus d'être un test qui soit source de confusion.
