Repository: python/python-docs-fr
Catalog: library/doctest.po
Languages: fr

source: Optional argument *extraglobs* gives a dict merged into the globals used to execute examples. This works like :meth:`dict.update`: if *globs* and *extraglobs* have a common key, the associated value in *extraglobs* appears in the combined dict. By default, or if ``None``, no extra globals are used. This is an advanced feature that allows parameterization of doctests. For example, a doctest can be written for a base class, using a generic name for the class, then reused to test any number of subclasses by passing an *extraglobs* dict mapping the generic name to the subclass to be tested.
fr: L'option *extraglobs* spécifie un *dict* intégré dans les variables globales utilisées pour exécuter l'exemple. Ceci fonctionne comme :meth:`dict.update` : si *globs* et *extraglobs* ont une clé commune, la valeur associée à *extraglobs* apparaît dans le *dict* combiné. Par défaut, ou si ``None`` est passé en argument, aucune variable globale supplémentaire est utilisée. Ceci est une fonctionnalité avancée qui permet la configuration des *doctests*. Par exemple, un *doctest* peut être rédigé pour une classe de base, en utilisant un nom générique pour la classe, puis réutilisé afin de tester un nombre indéfini de sous-classes en passant un *dict* *extraglobs* reliant le nom générique à la sous-classe qui doit être testée.

source: Optional argument *verbose* prints lots of stuff if true, and prints only failures if false; by default, or if ``None``, it's true if and only if ``'-v'`` is in ``sys.argv``.
fr: L'option *verbose* affiche une grande quantité d'information si elle est vraie, et affiche uniquement les défaillances si elle est fausse ; par défaut, ou si ``None``, celle-ci est vraie si et seulement si ``-v`` est présent dans ``sys.argv``.

source: Optional argument *report* prints a summary at the end when true, else prints nothing at the end. In verbose mode, the summary is detailed, else the summary is very brief (in fact, empty if all tests passed).
fr: L'option *report* affiche un résumé à la fin lorsque vraie ; sinon, rien n'est affiché à la fin. En mode *verbose*, le résumé est détaillé, sinon le résumé est très bref (en fait, vide si tous les tests ont réussi).

source: Optional argument *optionflags* (default value 0) takes the :ref:`bitwise OR <bitwise>` of option flags. See section :ref:`doctest-options`.
fr: L'option *optionflags* (dont la valeur par défaut est de zéro) calcule la valeur :ref:`bitwise OR <bitwise>` des options de ligne de commande. Voir la section :ref:`doctest-options`.

source: Optional argument *raise_on_error* defaults to false. If true, an exception is raised upon the first failure or unexpected exception in an example. This allows failures to be post-mortem debugged. Default behavior is to continue running examples.
fr: L'option *raise_on_error* est fausse par défaut. Si elle est vraie, une exception est levée à la première défaillance ou à la première exception qui ne soit prévue dans l'exemple. Ceci permet aux défaillances d'être analysées lors d'un post-mortem. Le comportement par défaut est de poursuivre l'exécution des exemples.

source: Optional argument *parser* specifies a :class:`DocTestParser` (or subclass) that should be used to extract tests from the files. It defaults to a normal parser (i.e., ``DocTestParser()``).
fr: L'option *parser* définit une classe ou une sous-classe :class:`DocTestParser` qui doit être utilisée pour extraire les tests des fichiers. Par défaut, on utilise un analyseur normal (c'est-à-dire, ``DocTestParser()``).

source: Optional argument *encoding* specifies an encoding that should be used to convert the file to unicode.
fr: L'option *encoding* définit un encodage à utiliser pour convertir le fichier en format *unicode*.

source: All arguments are optional, and all except for *m* should be specified in keyword form.
fr: Toutes les options sont facultatives, et toutes sauf *m* doivent être définies en format lettré.

source: Test examples in docstrings in functions and classes reachable from module *m* (or module :mod:`__main__` if *m* is not supplied or is ``None``), starting with ``m.__doc__``.
fr: Ceci teste les exemples en *docstrings* dans les fonctions et les classes accessibles depuis le module *m* (ou depuis le module :mod:`__main__` si *m* n'a pas été défini ou est ``None``), en commençant par ``m.__doc__``.

source: Also test examples reachable from dict ``m.__test__``, if it exists and is not ``None``. ``m.__test__`` maps names (strings) to functions, classes and strings; function and class docstrings are searched for examples; strings are searched directly, as if they were docstrings.
fr: Ceci teste aussi les exemples accessibles depuis le *dict* ``m.__test__``, si et seulement s'il existe et qu'il n'est pas ``None``. Le *dict* ``m.__test__`` associe des noms (chaînes de caractères) à des fonctions, des classes et des chaînes de caractères ; les *docstrings* de fonctions et de classes sont fouillées pour des exemples ; les chaînes de caractères sont fouillées directement, comme si elles étaient des *docstrings*.

source: Only docstrings attached to objects belonging to module *m* are searched.
fr: Seulement les *docstrings* attribuées à des objets appartenant au module *m* sont fouillées.

source: Return ``(failure_count, test_count)``.
fr: Renvoie ``(failure_count, test_count)``.

source: Optional argument *name* gives the name of the module; by default, or if ``None``, ``m.__name__`` is used.
fr: L'option *name* donne le nom du module ; par défaut, ou si ``None``, ``m.__name__`` est utilisé.

source: Optional argument *exclude_empty* defaults to false. If true, objects for which no doctests are found are excluded from consideration. The default is a backward compatibility hack, so that code still using :meth:`doctest.master.summarize` in conjunction with :func:`testmod` continues to get output for objects with no tests. The *exclude_empty* argument to the newer :class:`DocTestFinder` constructor defaults to true.
fr: L'option *exclude_empty* prend la valeur faux par défaut. Si la valeur est vraie, les objets pour lesquels aucun *doctest* n'est trouvé ne sont pas pris en compte. Le défaut est un bricolage permettant la compatibilité à rebours, de façon à ce que le code qui utilise toujours :meth:`doctest.master.summarize` en conjonction avec :func:`testmod` puisse continuer d'obtenir des sorties pour les objets n'ayant aucun test. L'option *exclude_empty* dans le constructeur de la classe plus récente :class:`DocTestFinder` prend vrai comme valeur par défaut.

source: Optional arguments *extraglobs*, *verbose*, *report*, *optionflags*, *raise_on_error*, and *globs* are the same as for function :func:`testfile` above, except that *globs* defaults to ``m.__dict__``.
fr: Les options *extraglobs*, *verbose*, *report*, *optionflags*, *raise_on_error*, et *globs* sont les mêmes que pour la fonction :func:`testfile` ci-dessus, sauf pour *globs*, qui est ``m.__dict__`` par défaut.

source: Test examples associated with object *f*; for example, *f* may be a string, a module, a function, or a class object.
fr: Les exemples de test associés à l'objet *f* ; par exemple, *f* peut être une chaîne de caractères, un module, une fonction, ou un objet de classe.

source: A shallow copy of dictionary argument *globs* is used for the execution context.
fr: Une copie superficielle de l'argument-dictionnaire *globs* est utilisée pour le contexte d'exécution.

source: Optional argument *name* is used in failure messages, and defaults to ``"NoName"``.
fr: L'option *name* est utilisée pour les messages d'échec, et prend ``"NoName"`` comme valeur par défaut.

source: If optional argument *verbose* is true, output is generated even if there are no failures. By default, output is generated only in case of an example failure.
fr: Si l'option *verbose* est vraie, les sorties sont générées même s'il n'y a aucun échec. Par défaut, la sortie est générée seulement si un exemple échoue.

source: Optional argument *compileflags* gives the set of flags that should be used by the Python compiler when running the examples. By default, or if ``None``, flags are deduced corresponding to the set of future features found in *globs*.
fr: L'option *compileflags* donne l'ensemble des options qui doit être utilisée par le compilateur Python lorsqu'il exécute les exemples. Par défaut, ou si ``None``, les options sont inférées à partir de l'ensemble des fonctionnalités futures trouvées dans *globs*.

source: Optional argument *optionflags* works as for function :func:`testfile` above.
fr: L'option *optionflags* fonctionne similairement à la fonction :func:`testfile` ci-dessus.

source: Unittest API
fr: API de tests unitaires

source: As your collection of doctest'ed modules grows, you'll want a way to run all their doctests systematically. :mod:`doctest` provides two functions that can be used to create :mod:`unittest` test suites from modules and text files containing doctests. To integrate with :mod:`unittest` test discovery, include a :func:`load_tests` function in your test module::
fr: Au fur et à mesure que la collection de modules testés avec *doctest* s'agrandira, vous allez souhaiter avoir une façon d'exécuter systématiquement tous les *doctests*. Le module :mod:`doctest` fournit deux fonctions qui peuvent être utilisées afin de créer des suites de tests unitaires :mod:`unittest` à partir des modules et des fichiers textes contenant des *doctests*. Afin d'intégrer la découverte fournie par :mod:`unittest`, il suffit d'ajouter une fonction :func:`load_tests` dans votre module de test ::

source: There are two main functions for creating :class:`unittest.TestSuite` instances from text files and modules with doctests:
fr: Il y a deux fonctions principales pour créer des instances de la classe :class:`unittest.TestSuite` à partir de fichiers textes et de modules ayant des *doctests* :

source: Convert doctest tests from one or more text files to a :class:`unittest.TestSuite`.
fr: Convertit des tests *doctest* à partir d'un ou plusieurs fichiers vers une classe :class:`unittest.TestSuite`.

source: The returned :class:`unittest.TestSuite` is to be run by the unittest framework and runs the interactive examples in each file. If an example in any file fails, then the synthesized unit test fails, and a :exc:`failureException` exception is raised showing the name of the file containing the test and a (sometimes approximate) line number.
fr: La classe renvoyée :class:`unittest.TestSuite` doit être exécutée dans le cadriciel de tests unitaires et exécute les exemples interactifs trouvés dans chaque fichier. Si un exemple de n'importe quel fichier échoue, alors le test unitaire de synthèse échoue aussi, et une exception :exc:`failureException` est levée, affichant le nom du fichier contenant le test et un numéro de ligne (celui-ci est parfois approximatif).

source: Pass one or more paths (as strings) to text files to be examined.
fr: Passe un ou plusieurs chemins (sous forme de chaînes de caractères) à des fichiers textes afin d'être vérifiés.

source: Options may be provided as keyword arguments:
fr: Les options peuvent être fournies comme des options lettrées :

source: Optional argument *module_relative* specifies how the filenames in *paths* should be interpreted:
fr: L'option *module_relative* précise comment les noms de fichiers dans *paths* doivent être interprétés :

source: If *module_relative* is ``True`` (the default), then each filename in *paths* specifies an OS-independent module-relative path. By default, this path is relative to the calling module's directory; but if the *package* argument is specified, then it is relative to that package. To ensure OS-independence, each filename should use ``/`` characters to separate path segments, and may not be an absolute path (i.e., it may not begin with ``/``).
fr: Si *module_relative* a ``True`` comme valeur (valeur par défaut), alors chaque nom de fichier dans *paths* précise un chemin relatif au module qui soit indépendant du système d'exploitation. Par défaut, ce chemin est relatif au répertoire du module appelant ; mais si l'option *package* est précisée, alors il est relatif à ce paquet. Afin de garantir l'indépendance face au système d'exploitation, chaque nom de fichier doit utiliser des caractères ``/`` afin de séparer les segments de chemin, et ne peut pas être un chemin absolu (c'est-à-dire, il ne peut pas commencer par ``/``).

source: If *module_relative* is ``False``, then each filename in *paths* specifies an OS-specific path. The path may be absolute or relative; relative paths are resolved with respect to the current working directory.
fr: Si *module_relative* prend la valeur ``False``, alors *filename* précise un chemin en fonction du système d'exploitation. Le chemin peut être absolu ou relatif ; les chemins relatifs sont résolus en rapport au répertoire actif.

source: Optional argument *package* is a Python package or the name of a Python package whose directory should be used as the base directory for module-relative filenames in *paths*. If no package is specified, then the calling module's directory is used as the base directory for module-relative filenames. It is an error to specify *package* if *module_relative* is ``False``.
fr: L'option *package* est un paquet Python ou le nom d'un paquet Python dont le répertoire dont être utilisé comme le répertoire principal pour un nom de fichier dans *paths* qui soit lié à un module. Si aucun paquet n'est spécifié, le répertoire du module appelé à l'exécution est utilisé comme le répertoire principal pour les noms de fichiers liés au module. C'est une erreur que de spécifier *package* si *module_relative* a ``False`` comme valeur.

source: Optional argument *setUp* specifies a set-up function for the test suite. This is called before running the tests in each file. The *setUp* function will be passed a :class:`DocTest` object. The setUp function can access the test globals as the *globs* attribute of the test passed.
fr: L'option *setUp* précise une fonction de mise-en-place pour la suite de tests. Ceci est appelé avant l'exécution des tests dans chaque fichier. La fonction *setUp* est passée à un objet :class:`DocTest`. La fonction *setUp* peut accéder aux valeurs globales du test par le biais de l'attribut *globs* du test passé.

source: Optional argument *tearDown* specifies a tear-down function for the test suite. This is called after running the tests in each file. The *tearDown* function will be passed a :class:`DocTest` object. The setUp function can access the test globals as the *globs* attribute of the test passed.
fr: L'option *tearDown* précise une fonction de démolition pour la suite de tests. Celle-ci est appelée après avoir exécuté les tests dans chaque fichier. La fonction *tearDown* est passée à un objet :class:`DocTest`. La fonction *setUp* peut accéder aux valeurs globales du test par l'attribut *globs* du test passé.

source: Optional argument *globs* is a dictionary containing the initial global variables for the tests. A new copy of this dictionary is created for each test. By default, *globs* is a new empty dictionary.
fr: L'option *globs* est un dictionnaire contenant les variables globales initiales pour les tests. Une nouvelle copie de ce dictionnaire est créée pour chaque test. Par défaut, *globs* est un nouveau dictionnaire vide.

source: Optional argument *optionflags* specifies the default doctest options for the tests, created by or-ing together individual option flags. See section :ref:`doctest-options`. See function :func:`set_unittest_reportflags` below for a better way to set reporting options.
fr: Les options *optionflags* précisent les options par défaut de *doctest* pour les tests, créées en composant par un OU les différentes options individuelles. Voir la section :ref:`doctest-options`. Voir la fonction :func:`set_unittest_reportflags` ci-dessous pour une meilleure façon de préciser des options de rapport.

source: The global ``__file__`` is added to the globals provided to doctests loaded from a text file using :func:`DocFileSuite`.
fr: La valeur globale ``__file__`` est ajoutée aux valeurs globales fournies par les *doctests*, ceux-ci étant téléchargés d'un fichier texte utilisant la fonction :func:`DocFileSuite`.

source: Convert doctest tests for a module to a :class:`unittest.TestSuite`.
fr: Convertit les tests *doctest* pour un module donné à une classe :class:`unittest.TestSuite`.

source: The returned :class:`unittest.TestSuite` is to be run by the unittest framework and runs each doctest in the module. If any of the doctests fail, then the synthesized unit test fails, and a :exc:`failureException` exception is raised showing the name of the file containing the test and a (sometimes approximate) line number.
fr: La classe renvoyée :class:`unittest.TestSuite` doit être exécutée par le cadriciel de test unitaire, afin d'exécuter chaque *doctest* dans le module. Si n'importe lequel des *doctests* échoue, alors le test unitaire de synthèse échoue, et une exception :exc:`failureException` est levée, affichant le nom du fichier contenant le test et un numéro de ligne pouvant être approximatif.

source: Optional argument *module* provides the module to be tested. It can be a module object or a (possibly dotted) module name. If not specified, the module calling this function is used.
fr: L'option *module* fournit le module qui sera testé. Il peut prendre la forme d'un objet-module ou celle du nom d'un module (possiblement *dotted*). Si non-précisée, le module appelant cette fonction est utilisé.

source: Optional argument *extraglobs* specifies an extra set of global variables, which is merged into *globs*. By default, no extra globals are used.
fr: L'option *extraglobs* précise un ensemble supplémentaire de variables globales, à fusionner avec *globs*. Par défaut, aucune variable globale supplémentaire est utilisée.

source: Optional argument *test_finder* is the :class:`DocTestFinder` object (or a drop-in replacement) that is used to extract doctests from the module.
fr: L'option *test_finder* est l'instance de :class:`DocTestFinder` (ou un remplacement *drop-in*) qui est utilisée pour extraire les *doctests* à partir du module.

source: Optional arguments *setUp*, *tearDown*, and *optionflags* are the same as for function :func:`DocFileSuite` above.
fr: Les options *setUp*, *tearDown* et *optionflags* sont les mêmes que pour la fonction :func:`DocFileSuite` ci-dessus.

source: This function uses the same search technique as :func:`testmod`.
fr: Cette fonction utilise la même technique de recherche que :func:`testmod`.

source: :func:`DocTestSuite` returns an empty :class:`unittest.TestSuite` if *module* contains no docstrings instead of raising :exc:`ValueError`.
fr: La fonction :func:`DocTestSuite` renvoie une instance vide de la classe :class:`unittest.TestSuite` si *module* ne contient aucune *docstring*, et ce, au lieu de lever l'exception :exc:`ValueError`.

source: Under the covers, :func:`DocTestSuite` creates a :class:`unittest.TestSuite` out of :class:`doctest.DocTestCase` instances, and :class:`DocTestCase` is a subclass of :class:`unittest.TestCase`. :class:`DocTestCase` isn't documented here (it's an internal detail), but studying its code can answer questions about the exact details of :mod:`unittest` integration.
fr: Sous le capot, :func:`DocTestSuite` crée une classe :class:`unittest.TestSuite` à partir d'instances de :class:`doctest.DocTestCase` ; de plus, :class:`DocTestCase` est une sous-classe de :class:`unittest.TestCase`. La classe :class:`DocTestCase` n'est pas documentée ici (c'est un détail interne), mais l'étude de son code peut répondre à des questions concernant les détails exacts de l'intégration du module :mod:`doctest`.

source: Similarly, :func:`DocFileSuite` creates a :class:`unittest.TestSuite` out of :class:`doctest.DocFileCase` instances, and :class:`DocFileCase` is a subclass of :class:`DocTestCase`.
fr: De la même façon, :func:`DocFileSuite` crée une classe :class:`unittest.TestSuite` à partir des instances :class:`doctest.DocFileCase`, où :class:`DocFileCase` est une sous-classe de :class:`DocTestCase`.

source: So both ways of creating a :class:`unittest.TestSuite` run instances of :class:`DocTestCase`. This is important for a subtle reason: when you run :mod:`doctest` functions yourself, you can control the :mod:`doctest` options in use directly, by passing option flags to :mod:`doctest` functions. However, if you're writing a :mod:`unittest` framework, :mod:`unittest` ultimately controls when and how tests get run. The framework author typically wants to control :mod:`doctest` reporting options (perhaps, e.g., specified by command line options), but there's no way to pass options through :mod:`unittest` to :mod:`doctest` test runners.
fr: Ainsi, les deux façons de créer une :class:`unittest.TestSuite` utilisent des instances de la classe :class:`DocTestCase`. Ceci est important pour une raison subtile : lorsque vous exécutez par vous-même des fonctions :mod:`doctest`, vous pouvez contrôler les options :mod:`doctest` qui sont utilisées de façon directe, en passant des options aux fonctions :mod:`doctest`. Toutefois, si vous écrivez un cadriciel :mod:`unittest`, alors :mod:`unittest` a le contrôle final de quand et de comment les tests sont exécutés. La personne qui écrit le cadriciel souhaite habituellement contrôler les options de rapport de :mod:`doctest` (qui sont peut-être, par exemple, spécifiées en options de ligne de commande), sauf qu'il n'y a pas de moyen de spécifier des options à l'attention des exécuteurs de test de :mod:`doctest` à partir de :mod:`unittest`.

source: For this reason, :mod:`doctest` also supports a notion of :mod:`doctest` reporting flags specific to :mod:`unittest` support, via this function:
fr: Pour cette raison, :mod:`doctest` implémente le concept d'options de rapport de :mod:`doctest` qui soit spécifique à :mod:`unittest`, par le biais de cette fonction :

source: Set the :mod:`doctest` reporting flags to use.
fr: Voir les options de ligne de commandes de :mod:`doctest` pour l'utilisation.

source: Argument *flags* takes the :ref:`bitwise OR <bitwise>` of option flags. See section :ref:`doctest-options`. Only "reporting flags" can be used.
fr: L'argument *flags* prend la :ref:`composition OU bit à bit <bitwise>` des arguments. Voir la section :ref:`doctest-options`. Ce sont uniquement les "options de rapport" qui peuvent être utilisées.
