Repository: python/python-docs-fr
Catalog: library/doctest.po
Languages: fr

source: :mod:`doctest` --- Test interactive Python examples
fr: :mod:`doctest` — Exemples de tests interactifs en Python

source: **Source code:** :source:`Lib/doctest.py`
fr: **Code source :** :source:`Lib/doctest.py`

source: The :mod:`doctest` module searches for pieces of text that look like interactive Python sessions, and then executes those sessions to verify that they work exactly as shown. There are several common ways to use doctest:
fr: Le module :mod:`doctest` cherche des extraits de texte ressemblant à des sessions Python interactives avant de les exécuter, de façon à vérifier que le fonctionnement correspond exactement à la description. Voici quelques cas d'utilisation de *doctest* :

source: To check that a module's docstrings are up-to-date by verifying that all interactive examples still work as documented.
fr: Vérifier que les *docstrings* d'un module sont à jour en vérifiant que tous les exemples interactifs fonctionnent toujours tels que décrits.

source: To perform regression testing by verifying that interactive examples from a test file or a test object work as expected.
fr: Réaliser un test de régression en vérifiant que les exemples interactifs provenant d'un fichier de test ou d'un objet de test fonctionnent comme prévu.

source: To write tutorial documentation for a package, liberally illustrated with input-output examples. Depending on whether the examples or the expository text are emphasized, this has the flavor of "literate testing" or "executable documentation".
fr: Rédiger de la documentation sous forme de tutoriel pour un paquet, avec une abondance d'exemples ayant des entrées et des sorties. On pourrait voir ça comme des tests « dans le texte » ou de la « documentation exécutable », selon le point de vue.

source: Here's a complete but small example module::
fr: Voici un petit exemple d'un module qui soit tout de même complet ::

source: If you run :file:`example.py` directly from the command line, :mod:`doctest` works its magic:
fr: L'exécution du fichier :file:`example.py` directement à partir de la ligne de commande démontre la magie de :mod:`doctest` :

source: There's no output! That's normal, and it means all the examples worked. Pass ``-v`` to the script, and :mod:`doctest` prints a detailed log of what it's trying, and prints a summary at the end:
fr: Il n'y a pas de sortie ! C'est normal, cela signifie que tous les exemples fonctionnent. Passez ``-v`` au script pour que :mod:`doctest` affiche un journal détaillé de ce qui a été essayé, avant d'afficher un résumé à la fin :

source: And so on, eventually ending with:
fr: Et ainsi de suite, jusqu'à ce qu'on atteigne :

source: That's all you need to know to start making productive use of :mod:`doctest`! Jump in. The following sections provide full details. Note that there are many examples of doctests in the standard Python test suite and libraries. Especially useful examples can be found in the standard test file :file:`Lib/test/test_doctest.py`.
fr: C'est tout ce dont vous avez besoin pour pouvoir commencer une utilisation productive de :mod:`doctest` ! Allez-y. Les sections suivantes donnent tous les détails. Notez qu'il y a plusieurs exemples de *doctests* dans la suite de tests de la bibliothèque standard de Python et dans les autres bibliothèques. Des exemples particulièrement utiles se situent dans le fichier de test standard :file:`Lib/test/test_doctest.py`.

source: Simple Usage: Checking Examples in Docstrings
fr: Utilisation simple : vérifier des exemples dans des *docstrings*

source: The simplest way to start using doctest (but not necessarily the way you'll continue to do it) is to end each module :mod:`M` with::
fr: Le plus simple pour commencer à utiliser *doctest* (mais pas nécessairement la façon avec laquelle vous continuerez) est de terminer chaque module :mod:`M` avec ::

source: :mod:`doctest` then examines docstrings in module :mod:`M`.
fr: :mod:`doctest` examine alors les *docstrings* dans le module :mod:`M`.

source: Running the module as a script causes the examples in the docstrings to get executed and verified::
fr: Exécuter le module comme un script a comme conséquence d'exécuter et de vérifier les exemples dans les *docstrings* ::

source: This won't display anything unless an example fails, in which case the failing example(s) and the cause(s) of the failure(s) are printed to stdout, and the final line of output is ``***Test Failed*** N failures.``, where *N* is the number of examples that failed.
fr: Ceci n'affiche rien à moins qu'un exemple échoue ; le cas échéant, les exemples défaillants et les causes du ou des échecs sont affichés sur *stdout*, et la ligne finale de la sortie est ``***Test Failed*** *N failures*.``, où *N* est le nombre d'exemples défaillants.

source: Run it with the ``-v`` switch instead::
fr: À la place, exécutez-la avec l'option de ligne de commande ``-v`` ::

source: and a detailed report of all examples tried is printed to standard output, along with assorted summaries at the end.
fr: alors, un rapport détaillé de tous les exemples faisant partie de l'essai est affiché sur la sortie standard, accompagné à la fin de leurs résumés.

source: You can force verbose mode by passing ``verbose=True`` to :func:`testmod`, or prohibit it by passing ``verbose=False``. In either of those cases, ``sys.argv`` is not examined by :func:`testmod` (so passing ``-v`` or not has no effect).
fr: Vous pouvez activer le mode verbeux en passant ``verbose=True`` à :func:`testmod`, ou vous le désactiver en lui passant ``verbose=False``. Dans ces deux cas, ``sys.argv`` n'est pas inspecté par :func:`testmod` (ainsi, lui passer ``-v`` ou pas n'a aucun effet).

source: There is also a command line shortcut for running :func:`testmod`. You can instruct the Python interpreter to run the doctest module directly from the standard library and pass the module name(s) on the command line::
fr: Il y a un raccourci pour exécuter :func:`testmod` à partir de la ligne de commande. Vous demandez à l'interpréteur Python d'exécuter le module *doctest* directement à partir de la bibliothèque standard afin de passer le ou les noms des modules à partir de la ligne de commande ainsi ::

source: This will import :file:`example.py` as a standalone module and run :func:`testmod` on it. Note that this may not work correctly if the file is part of a package and imports other submodules from that package.
fr: Ceci importera :file:`example.py` comme un module autonome et exécutera :func:`testmod` sur celui-ci. Notez que ceci peut ne pas fonctionner si le fichier fait partie d'un paquet et importe d'autres sous-modules de ce paquet.

source: For more information on :func:`testmod`, see section :ref:`doctest-basic-api`.
fr: Pour plus d'informations sur :func:`testmod`, consultez la section :ref:`doctest-basic-api`.

source: Simple Usage: Checking Examples in a Text File
fr: Utilisation simple : vérifier des exemples dans un fichier texte

source: Another simple application of doctest is testing interactive examples in a text file. This can be done with the :func:`testfile` function::
fr: Une autre application simple de *doctest* est de tester des exemples interactifs dans un fichier texte. Ceci est fait avec la fonction :func:`testfile` ::

source: That short script executes and verifies any interactive Python examples contained in the file :file:`example.txt`. The file content is treated as if it were a single giant docstring; the file doesn't need to contain a Python program! For example, perhaps :file:`example.txt` contains this:
fr: Ce court script exécute et vérifie chacun des exemples Python interactifs contenus dans le fichier :file:`example.txt`. Le contenu du fichier est traité comme une seule *docstring* géante ; le fichier n'a pas besoin de contenir un programme Python ! Par exemple, prenons un fichier :file:`example.txt` contenant :

source: Running ``doctest.testfile("example.txt")`` then finds the error in this documentation::
fr: Exécuter ``doctest.testfile("example.txt")`` recherche les erreurs dans cette documentation ::

source: As with :func:`testmod`, :func:`testfile` won't display anything unless an example fails. If an example does fail, then the failing example(s) and the cause(s) of the failure(s) are printed to stdout, using the same format as :func:`testmod`.
fr: Comme pour :func:`testmod`, :func:`testfile` n'affichera rien sauf si un exemple échoue. Si un exemple échoue, alors le ou les exemples défaillants et leurs causes sont affichés sur *stdout*, dans le même format que :func:`testmod`.

source: By default, :func:`testfile` looks for files in the calling module's directory. See section :ref:`doctest-basic-api` for a description of the optional arguments that can be used to tell it to look for files in other locations.
fr: Par défaut, :func:`testfile` cherche les fichiers dans le répertoire où se situe le module qui l'appelle. Consultez la section :ref:`doctest-basic-api` pour une description des options de ligne de commande à utiliser afin de chercher dans d'autres répertoires.

source: Like :func:`testmod`, :func:`testfile`'s verbosity can be set with the ``-v`` command-line switch or with the optional keyword argument *verbose*.
fr: Comme pour :func:`testmod`, la verbosité de :func:`testfile` peut être ajustée avec l'option de ligne de commande ``-v`` ou avec le mot clé *verbose*.

source: There is also a command line shortcut for running :func:`testfile`. You can instruct the Python interpreter to run the doctest module directly from the standard library and pass the file name(s) on the command line::
fr: Il y a un raccourci pour exécuter :func:`testfile` à partir de la ligne de commande. Demandez à l'interpréteur Python d'exécuter le module *doctest* directement à partir de la bibliothèque standard et de passer le ou les noms des modules à partir de la ligne de commande ainsi ::

source: Because the file name does not end with :file:`.py`, :mod:`doctest` infers that it must be run with :func:`testfile`, not :func:`testmod`.
fr: Puisque le nom du fichier ne se termine pas par :file:`.py`, :mod:`doctest` en déduit qu'il s'exécute à l'aide de :func:`testfile`, et non pas :func:`testmod`.

source: For more information on :func:`testfile`, see section :ref:`doctest-basic-api`.
fr: Pour plus d'information sur :func:`testfile`, consultez la section :ref:`doctest-basic-api`.

source: How It Works
fr: Comment ça marche

source: This section examines in detail how doctest works: which docstrings it looks at, how it finds interactive examples, what execution context it uses, how it handles exceptions, and how option flags can be used to control its behavior. This is the information that you need to know to write doctest examples; for information about actually running doctest on these examples, see the following sections.
fr: Cette section examine en détail le fonctionnement de *doctest* : quelles *docstrings* sont considérées, comment sont trouvés les exemples interactifs, quel est le contexte d'exécution sélectionné, comment les exceptions sont gérées, et de quelles façons les options de ligne de commande peuvent être utilisées pour définir le comportement. Ceci est l'information dont vous avez besoin pour écrire des exemples *doctest* ; pour de l'information sur l'exécution de *doctest* sur ces exemples, consultez les sections suivantes.

source: Which Docstrings Are Examined?
fr: Quelles *docstrings* sont considérées ?

source: The module docstring, and all function, class and method docstrings are searched. Objects imported into the module are not searched.
fr: Les *docstrings* du module, de toutes les fonctions, classes, et méthodes sont cherchées. Les objets qui sont importés dans le module ne sont pas cherchés.

source: In addition, if ``M.__test__`` exists and "is true", it must be a dict, and each entry maps a (string) name to a function object, class object, or string. Function and class object docstrings found from ``M.__test__`` are searched, and strings are treated as if they were docstrings. In output, a key ``K`` in ``M.__test__`` appears with name ::
fr: De plus, si ``M.__test__`` existe et qu'il est vrai, il doit être un *dict* dont chaque élément lie un nom (chaîne de caractère) à un objet (fonction, classe, chaîne de caractère). Les *docstrings* d'objets fonctions et classes trouvées dans ``M.__test__`` sont cherchés, et les chaînes de caractères sont traitées comme si elles étaient des *docstrings*. En sortie, une clé ``K`` dans ``M.__test__`` apparaît avec le nom ::

source: Any classes found are recursively searched similarly, to test docstrings in their contained methods and nested classes.
fr: Toute classe trouvée est ainsi cherchée récursivement, afin de tester les *docstrings* contenues dans leurs méthodes et leurs classes imbriquées.

source: How are Docstring Examples Recognized?
fr: Comment les exemples *docstring* sont-ils identifiés ?

source: In most cases a copy-and-paste of an interactive console session works fine, but doctest isn't trying to do an exact emulation of any specific Python shell.
fr: Dans la plupart des cas, un copier-coller d'une séance interactive de console fonctionne bien, mais *doctest* n'essaye pas de faire une simulation exacte d'un *shell* Python spécifique.

source: Any expected output must immediately follow the final ``'>>> '`` or ``'... '`` line containing the code, and the expected output (if any) extends to the next ``'>>> '`` or all-whitespace line.
fr: Toute sortie souhaitée doit immédiatement suivre le dernier ``'>>> '`` ou le dernier ``'... '`` contenant le code, et la sortie souhaitée, s'il y en a une, s'étend jusqu'au prochain ``'>>> '`` ou à la prochaine ligne vide.

source: The fine print:
fr: En détail :

source: Expected output cannot contain an all-whitespace line, since such a line is taken to signal the end of expected output. If expected output does contain a blank line, put ``<BLANKLINE>`` in your doctest example each place a blank line is expected.
fr: La sortie souhaitée ne peut pas contenir une ligne vide, puisque contenir une telle ligne signale la fin de la sortie souhaitée. Si la sortie souhaitée doit contenir une ligne vide, ajoutez ``<BLANKLINE>`` dans votre exemple *doctest* à chaque endroit où une ligne vide est souhaitée.

source: All hard tab characters are expanded to spaces, using 8-column tab stops. Tabs in output generated by the tested code are not modified. Because any hard tabs in the sample output *are* expanded, this means that if the code output includes hard tabs, the only way the doctest can pass is if the :const:`NORMALIZE_WHITESPACE` option or :ref:`directive <doctest-directives>` is in effect. Alternatively, the test can be rewritten to capture the output and compare it to an expected value as part of the test. This handling of tabs in the source was arrived at through trial and error, and has proven to be the least error prone way of handling them. It is possible to use a different algorithm for handling tabs by writing a custom :class:`DocTestParser` class.
fr: Tous les caractères de tabulation insécables (*hard tab characters*) sont convertis en espaces, en utilisant des taquets de tabulation de 8 espaces. Les tabulations se trouvant dans la sortie générée par le code test ne sont pas modifiées. Comme tout caractère de tabulation insécable *est* converti, ceci veut dire que si le code de sortie inclut des caractères de tabulation insécables, alors la seule façon que le *doctest* peut réussir est si l'option :const:`NORMALIZE_WHITESPACE` ou si :ref:`directive <doctest-directives>` a cours. De façon alternative, le test peut être ré-écrit afin de capturer la sortie et de la comparer à un ensemble de valeurs attendues, et ce, en tant qu'étape du test. Cette gestion des tabulations à la source a été obtenue suite à un processus d'essais et d'erreurs ; il a été démontré que c'était là la façon de les gérer qui soit la moins susceptible de générer des erreurs. Il est possible d'utiliser un algorithme différent pour la gestion des tabulations en rédigeant une classe sur mesure :class:`DocTestParser`.

source: Output to stdout is captured, but not output to stderr (exception tracebacks are captured via a different means).
fr: La sortie vers *stdout* est capturée, mais pas la sortie vers *stderr* (les traces d'appel sont capturées par d'autres moyens).

source: If you continue a line via backslashing in an interactive session, or for any other reason use a backslash, you should use a raw docstring, which will preserve your backslashes exactly as you type them::
fr: Si vous souhaitez conserver les barres obliques inversées telles quelles lorsque vous terminez une ligne avec une barre oblique inversée dans une séance interactive, ou quand vous utilisez une telle barre pour toute autre raison, vous devez utiliser une *docstring* brute ::

source: Otherwise, the backslash will be interpreted as part of the string. For example, the ``\n`` above would be interpreted as a newline character. Alternatively, you can double each backslash in the doctest version (and not use a raw string)::
fr: Sinon, la barre oblique inversée est interprétée comme faisant partie de la chaîne de caractères. Par exemple, le ``\n`` ci-dessus est interprété comme un caractère de saut de ligne. De façon alternative, vous pouvez doubler chaque barre oblique inversée dans la version *doctest* (et n'utilisez pas dans ce cas de *docstring* brute) ::

source: The starting column doesn't matter::
fr: La colonne de départ n'a pas d'importance ::

source: and as many leading whitespace characters are stripped from the expected output as appeared in the initial ``'>>> '`` line that started the example.
fr: et autant d'espaces sont retirés de la sortie attendue qu'il y avait d'espaces avant la ligne commençant par ``'>>> '``.

source: What's the Execution Context?
fr: Quel est le contexte d'exécution ?

source: By default, each time :mod:`doctest` finds a docstring to test, it uses a *shallow copy* of :mod:`M`'s globals, so that running tests doesn't change the module's real globals, and so that one test in :mod:`M` can't leave behind crumbs that accidentally allow another test to work. This means examples can freely use any names defined at top-level in :mod:`M`, and names defined earlier in the docstring being run. Examples cannot see names defined in other docstrings.
fr: Par défaut, chaque fois que :mod:`doctest` trouve une *docstring* à tester, il utilise une *copie superficielle* des variables globales de :mod:`M`, de telle façon que l'exécution de tests ne change pas les variables globales réelles du module et que l'exécution d'un unique test dans :mod:`M` ne puisse laisser traîner des miettes pouvant accidentellement causer la réussite d'un autre test. Ceci signifie que les exemples peuvent utiliser librement n'importe quel nom défini au niveau supérieur dans :mod:`M` ainsi que les noms définis précédemment dans la *docstring* en cours d'exécution. Les exemples ne peuvent voir les noms définis dans d'autres *docstrings*.

source: You can force use of your own dict as the execution context by passing ``globs=your_dict`` to :func:`testmod` or :func:`testfile` instead.
fr: Vous pouvez forcer l'utilisation de votre propre *dict* comme contexte d'exécution en passant ``globs=your_dict`` à :func:`testmod` ou encore, à :func:`testfile`.

source: What About Exceptions?
fr: Qu'en est-il des exceptions ?

source: No problem, provided that the traceback is the only output produced by the example: just paste in the traceback. [#]_ Since tracebacks contain details that are likely to change rapidly (for example, exact file paths and line numbers), this is one case where doctest works hard to be flexible in what it accepts.
fr: Pas de problèmes, tant que la trace d'appels est la seule sortie produite par l'exemple : il suffit d'ajouter la trace. [#]_ Comme les traces d'appels contiennent des détails qui sont sujets à changement rapide (par exemple, le chemin exact vers un fichier et les numéros de ligne), ceci est un cas où *doctest* fait un effort pour être flexible dans ce qu'il accepte.

source: Simple example::
fr: Exemple simple ::

source: That doctest succeeds if :exc:`ValueError` is raised, with the ``list.remove(x): x not in list`` detail as shown.
fr: Ce *doctest* réussit si :exc:`ValueError` est levée, avec le détail ``list.remote(x): x not in list`` tel que montré.

source: The expected output for an exception must start with a traceback header, which may be either of the following two lines, indented the same as the first line of the example::
fr: La sortie attendue pour une exception doit commencer par un en-tête de trace d'appels, qui peut être l'une des deux lignes suivantes, avec la même indentation que la première ligne de l'exemple ::

source: The traceback header is followed by an optional traceback stack, whose contents are ignored by doctest. The traceback stack is typically omitted, or copied verbatim from an interactive session.
fr: L'en-tête de la trace d'appels est suivi par une pile optionnelle de trace d'appels, dont le contenu est ignoré par *doctest*. La trace d'appels est habituellement omise, ou est copiée verbatim à partir d'une séance interactive.

source: The traceback stack is followed by the most interesting part: the line(s) containing the exception type and detail. This is usually the last line of a traceback, but can extend across multiple lines if the exception has a multi-line detail::
fr: La pile de trace d'appels est suivie par la partie la plus intéressante : la ou les lignes contenant le type et le détail de l'exception. Ceci est habituellement la dernière ligne de la trace d'appels ; dans le cas où l'exception a un détail sur plusieurs lignes, il est possible de prolonger sur plusieurs lignes ::

source: The last three lines (starting with :exc:`ValueError`) are compared against the exception's type and detail, and the rest are ignored.
fr: Les trois dernières lignes (en commençant par :exc:`ValueError`) sont comparées avec le type et le détail de l'exception ; tout le reste est ignoré.

source: Best practice is to omit the traceback stack, unless it adds significant documentation value to the example. So the last example is probably better as::
fr: La pratique optimale est d'omettre la pile de trace d'appels, à moins que celle-ci ait une valeur significative de documentation de l'exemple. Ainsi, le dernier exemple est probablement meilleur tel qui suit ::

source: Note that tracebacks are treated very specially. In particular, in the rewritten example, the use of ``...`` is independent of doctest's :const:`ELLIPSIS` option. The ellipsis in that example could be left out, or could just as well be three (or three hundred) commas or digits, or an indented transcript of a Monty Python skit.
fr: Prenez note que les traces d'appels sont traitées de façon vraiment particulière. Précisément, dans l'exemple ré-écrit, l'utilisation de ``...`` est indépendante de l'option *doctest* :const:`ELLIPSIS`. Les points de suspension dans cet exemple peuvent être omis, ou peuvent aussi être trois (ou trois cents) virgules ou chiffres, ou une retranscription indentée d'une parodie de Monty Python.

source: Some details you should read once, but won't need to remember:
fr: Quelques détails que vous devriez lire une fois, mais que vous pouvez oublier :
