Repository: python/python-docs-fr
Catalog: library/doctest.po
Languages: fr

source: Doctest can't guess whether your expected output came from an exception traceback or from ordinary printing. So, e.g., an example that expects ``ValueError: 42 is prime`` will pass whether :exc:`ValueError` is actually raised or if the example merely prints that traceback text. In practice, ordinary output rarely begins with a traceback header line, so this doesn't create real problems.
fr: *Doctest* ne peut pas deviner si votre sortie attendue provient d'une trace d'appels issue d'une exception ou d'un affichage ordinaire. Ainsi, si nous avons un exemple s'attendant à obtenir ``ValueError: 42 is prime``, celui-ci réussira peu importe si :exc:`ValueError` est réellement levée ou si l'exemple affiche simplement ce texte de trace d'appels. Dans la pratique, une sortie ordinaire commence rarement par une ligne d'en-tête de trace d'appels ; ainsi, ceci ne pose pas de vrai problème.

source: Each line of the traceback stack (if present) must be indented further than the first line of the example, *or* start with a non-alphanumeric character. The first line following the traceback header indented the same and starting with an alphanumeric is taken to be the start of the exception detail. Of course this does the right thing for genuine tracebacks.
fr: Chaque ligne de la trace d'appel (s'il y en a) doit soit être indentée d'un niveau supplémentaire au niveau de la première ligne de l'exemple *ou* doit commencer par un caractère qui ne soit pas alphanumérique. La première ligne suivant l'en-tête de la trace d'appels qui soit indentée similairement et qui commence par un caractère alphanumérique est comprise comme étant le début du détail de l'exception. Bien sûr, ceci fait la chose adéquate pour les traces d'appels véritables.

source: When the :const:`IGNORE_EXCEPTION_DETAIL` doctest option is specified, everything following the leftmost colon and any module information in the exception name is ignored.
fr: Lorsque l'option de *doctest* :const:`IGNORE_EXCEPTION_DETAIL` est définie, tout ce qui suit le point-virgule se trouvant le plus à gauche ainsi que toute information liée au module dans le nom de l'exception sont ignorés.

source: The interactive shell omits the traceback header line for some :exc:`SyntaxError`\ s. But doctest uses the traceback header line to distinguish exceptions from non-exceptions. So in the rare case where you need to test a :exc:`SyntaxError` that omits the traceback header, you will need to manually add the traceback header line to your test example.
fr: Le shell interactif omet la ligne d'en-tête de la trace d'appels pour certaines erreurs :exc:`SyntaxError`. Ceci étant dit, *doctest* utilise la ligne d'en-tête de la trace d'appels afin de faire une distinction entre les exceptions et les autres types d'erreurs. Ainsi, dans les rares cas où vous avez besoin de tester une erreur :exc:`SyntaxError` qui omet l'en-tête de la trace d'appels, il vous est nécessaire d'ajouter manuellement la ligne d'en-tête de la trace d'appels à l'exemple de test.

source: For some :exc:`SyntaxError`\ s, Python displays the character position of the syntax error, using a ``^`` marker::
fr: Pour certaines erreurs :exc:`SyntaxError`, Python affiche la position du caractère de l'erreur de syntaxe, en utilisant un marqueur ``^`` ::

source: Since the lines showing the position of the error come before the exception type and detail, they are not checked by doctest. For example, the following test would pass, even though it puts the ``^`` marker in the wrong location::
fr: Comme les lignes dénotant la position de l'erreur précèdent le type et le détail de l'exception, elles ne sont pas vérifiées par *doctest*. Par exemple, le test suivant réussira, même si le marqueur ``^`` n'est pas à la bonne place ::

source: Option Flags
fr: Options de ligne de commande

source: A number of option flags control various aspects of doctest's behavior. Symbolic names for the flags are supplied as module constants, which can be :ref:`bitwise ORed <bitwise>` together and passed to various functions. The names can also be used in :ref:`doctest directives <doctest-directives>`, and may be passed to the doctest command line interface via the ``-o`` option.
fr: Un ensemble d'options de ligne de commande contrôle différents aspects du comportement de *doctest*. Pour les options, des noms symboliques sont fournis comme des constantes de module, qui peuvent être composés par un OU bit à bit (:ref:`bitwise ORed <bitwise>`) et passés à diverses fonctions. Les noms peuvent aussi être utilisés dans des :ref:`instructions doctest <doctest-directives>`, et peuvent être passés à l'interface de ligne de commande de *doctest* à l'aide de l'option ``-o``.

source: The ``-o`` command line option.
fr: L'option de ligne de commande ``-o``.

source: The first group of options define test semantics, controlling aspects of how doctest decides whether actual output matches an example's expected output:
fr: Le premier groupe d'options définit les sémantiques de test, de façon à contrôler comment *doctest* décide si la sortie obtenue correspond à la sortie attendue de l'exemple :

source: By default, if an expected output block contains just ``1``, an actual output block containing just ``1`` or just ``True`` is considered to be a match, and similarly for ``0`` versus ``False``. When :const:`DONT_ACCEPT_TRUE_FOR_1` is specified, neither substitution is allowed. The default behavior caters to that Python changed the return type of many functions from integer to boolean; doctests expecting "little integer" output still work in these cases. This option will probably go away, but not for several years.
fr: Par défaut, si un bloc de sortie attendu contient uniquement un ``1``, un vrai bloc de sortie contenant uniquement un ``1`` ou un ``True`` sera considéré comme étant une correspondance ; de façon similaire, nous avons une correspondance pour ``0`` et ``False``. Lorsque l'option :const:`DONT_ACCEPT_TRUE_FOR_1` est précisée, aucune de ces substitutions n'est acceptée. Le comportement par défaut s'ajuste au fait que Python a changé le type de renvoi de plusieurs fonctions, passant de nombres entiers à des booléens ; les *doctests* s'attendant à une sortie de "petit entier" (*little integer*) fonctionnent encore dans ces cas. Cette option disparaîtra probablement, mais pas avant plusieurs années.

source: By default, if an expected output block contains a line containing only the string ``<BLANKLINE>``, then that line will match a blank line in the actual output. Because a genuinely blank line delimits the expected output, this is the only way to communicate that a blank line is expected. When :const:`DONT_ACCEPT_BLANKLINE` is specified, this substitution is not allowed.
fr: Par défaut, si un bloc de sortie attendue contient une ligne contenant uniquement la chaîne de caractères ``<BLANKLINE>``, alors cette ligne sera en correspondance avec une ligne vide dans la sortie réelle. Puisqu'une véritable ligne vide permet de délimiter la sortie attendue, ceci est la seule façon de communiquer qu'une ligne vide est souhaitée. Lorsque l'option :const:`DONT_ACCEPT_BLANKLINE` est précisée, cette substitution n'est pas permise.

source: When specified, all sequences of whitespace (blanks and newlines) are treated as equal. Any sequence of whitespace within the expected output will match any sequence of whitespace within the actual output. By default, whitespace must match exactly. :const:`NORMALIZE_WHITESPACE` is especially useful when a line of expected output is very long, and you want to wrap it across multiple lines in your source.
fr: Lorsque précisé, toutes les séquences de caractères d'espacement et de caractères de saut de ligne sont traitées comme équivalentes. Toute séquence de caractères d'espacement à l'intérieur de la sortie attendue correspondra alors à toute séquence de caractères d'espacement à l'intérieur de la sortie réelle. Par défaut, les caractères d'espacement doivent correspondre de façon exacte. L'option :const:`NORMALIZE_WHITESPACE` est particulièrement utile lorsqu'une ligne de sortie attendue est très longue, et que l'on souhaite la répartir sur plusieurs lignes dans le fichier source.

source: When specified, an ellipsis marker (``...``) in the expected output can match any substring in the actual output. This includes substrings that span line boundaries, and empty substrings, so it's best to keep usage of this simple. Complicated uses can lead to the same kinds of "oops, it matched too much!" surprises that ``.*`` is prone to in regular expressions.
fr: Lorsque précisé, un marqueur de points de suspension (``...``) dans la sortie attendue peut correspondre à n'importe quelle partie de chaîne de caractères dans la sortie réelle. Ceci inclut les parties qui traversent les frontières de lignes, ainsi que les parties vides de chaînes de caractères ; ainsi, il est préférable d'en faire une utilisation simple. Les usages complexes mènent aux mêmes surprises du type "oups, il y avait trop de correspondances !" que l'utilisation de ``.*`` dans les expressions régulières.

source: :const:`IGNORE_EXCEPTION_DETAIL` now also ignores any information relating to the module containing the exception under test.
fr: Maintenant, :const:`IGNORE_EXCEPTION_DETAIL` permet aussi d'ignorer toute information liée au module contenant l'exception qui est en train d'être testée.

source: When specified, do not run the example at all. This can be useful in contexts where doctest examples serve as both documentation and test cases, and an example should be included for documentation purposes, but should not be checked. E.g., the example's output might be random; or the example might depend on resources which would be unavailable to the test driver.
fr: Lorsque précisé, cesse complètement l'exécution de tous les exemples. Ceci peut être utile dans des contextes où les exemples *doctest* sont à la fois de la documentation et des cas de tests, et qu'un exemple doit être inclus pour des raisons de documentation, mais ne devrait pas être vérifié. Par exemple, la sortie de l'exemple doit être aléatoire ; ou encore, lorsque l'exemple peut dépendre de ressources inatteignables pour l'exécuteur de test.

source: The SKIP flag can also be used for temporarily "commenting out" examples.
fr: L'option *SKIP* peut aussi être utilisée temporairement afin de commenter des exemples et d'en empêcher l'exécution.

source: A bitmask or'ing together all the comparison flags above.
fr: Un masque binaire effectuant une composition avec OU de toutes les options de comparaisons ci-dessus.

source: The second group of options controls how test failures are reported:
fr: Le deuxième groupe d'options détermine comment les échecs de tests sont signalés :

source: When specified, failures that involve multi-line expected and actual outputs are displayed using a unified diff.
fr: Lorsque précisé, les défaillances qui font intervenir des sorties attendues et réelles multi-lignes sont affichées dans une *diff* unifiée.

source: When specified, failures that involve multi-line expected and actual outputs will be displayed using a context diff.
fr: Lorsque précisé, les défaillances qui font intervenir des sorties attendues et réelles multi-lignes sont affichées dans une *diff* de contexte.

source: When specified, differences are computed by ``difflib.Differ``, using the same algorithm as the popular :file:`ndiff.py` utility. This is the only method that marks differences within lines as well as across lines. For example, if a line of expected output contains digit ``1`` where actual output contains letter ``l``, a line is inserted with a caret marking the mismatching column positions.
fr: Lorsque précisé, les différences sont obtenues grâce à ``difflib.Differ``, en utilisant le même algorithme que le populaire utilitaire :file:`ndiff.py`. Ceci est la seule méthode qui puisse faire la différence à l'intérieur des lignes ainsi que parmi les lignes prises conjointement. Par exemple, si une ligne de sortie attendue contient le chiffre ``1`` alors que la sortie réelle contient la lettre ``l``, une ligne est insérée avec un marqueur caret démarquant les positions de colonnes où il n'y a pas de correspondance.

source: When specified, display the first failing example in each doctest, but suppress output for all remaining examples. This will prevent doctest from reporting correct examples that break because of earlier failures; but it might also hide incorrect examples that fail independently of the first failure. When :const:`REPORT_ONLY_FIRST_FAILURE` is specified, the remaining examples are still run, and still count towards the total number of failures reported; only the output is suppressed.
fr: Lorsque précisé, le premier exemple défaillant de chaque *doctest* est affiché, mais la sortie est supprimée pour tous les autres exemples. Ceci empêche *doctest* de rapporter les exemples adéquats qui échouent du fait d'échecs précédents ; ceci peut aussi cacher des exemples inadéquats qui échouent de façon indépendante au premier échec. Lorsque :const:`REPORT_ONLY_FIRST_FAILURE` est précisé, les exemples restants sont toujours exécutés, et sont toujours comptabilisés dans le nombre total des lignes échouant ; seulement la sortie est omise.

source: When specified, exit after the first failing example and don't attempt to run the remaining examples. Thus, the number of failures reported will be at most 1. This flag may be useful during debugging, since examples after the first failure won't even produce debugging output.
fr: Lorsque précisé, mettre fin à l'exécution après le premier exemple défaillant et ne pas essayer d'exécuter les exemples restants. Ainsi, le nombre d'échecs rapporté sera au plus un (1). Cette option peut être utile durant le débogage, étant donné que les exemples suivant le premier échec ne produiront aucune sortie de débogage.

source: The doctest command line accepts the option ``-f`` as a shorthand for ``-o FAIL_FAST``.
fr: La ligne de commande de *doctest* accepte l'option ``-f`` comme un raccourci de ``-o FAIL_FAST``.

source: A bitmask or'ing together all the reporting flags above.
fr: Un masque binaire effectuant une composition avec le OU de toutes les options de signalement ci-dessus.

source: There is also a way to register new option flag names, though this isn't useful unless you intend to extend :mod:`doctest` internals via subclassing:
fr: Il y a aussi une façon d'enregistrer des nouveaux noms d'option, quoique ceci n'est pas utile sauf dans le cas où vous devez faire une extension pour le code interne de :mod:`doctest` par le biais d'une sous-classe :

source: Create a new option flag with a given name, and return the new flag's integer value. :func:`register_optionflag` can be used when subclassing :class:`OutputChecker` or :class:`DocTestRunner` to create new options that are supported by your subclasses. :func:`register_optionflag` should always be called using the following idiom::
fr: Crée une nouvelle option avec un nom donné, et renvoie la valeur en nombre entier de la nouvelle option. La fonction :func:`register_optionflag` peut être utilisée lors de la création de sous-classes à partir de :class:`OutputChecker` ou :class:`DocTestRunner` pour créer de nouvelles options qui sont supportées par vos sous-classes. La fonction :func:`register_optionflag` devrait toujours être appelée par l'expression suivante ::

source: Directives
fr: Instructions

source: Doctest directives may be used to modify the :ref:`option flags <doctest-options>` for an individual example. Doctest directives are special Python comments following an example's source code:
fr: Les instructions *doctest* peuvent être utilisées afin de modifier les :ref:`options <doctest-options>` pour un exemple individuel. Les instructions *doctest* sont des commentaires Python spéciaux suivant le code source d'un exemple :

source: An example's doctest directives modify doctest's behavior for that single example. Use ``+`` to enable the named behavior, or ``-`` to disable it.
fr: Les instructions d'un exemple *doctest* modifient le comportement de *doctest* et ce, seulement pour cet exemple. Utilisez ``+`` pour activer le comportement nommé, ou ``-`` pour le désactiver.

source: Note that since all options are disabled by default, and directives apply only to the example they appear in, enabling options (via ``+`` in a directive) is usually the only meaningful choice. However, option flags can also be passed to functions that run doctests, establishing different defaults. In such cases, disabling an option via ``-`` in a directive can be useful.
fr: Prendre note que puisque toutes les options sont désactivées par défaut, et comme les instructions s'appliquent uniquement aux exemples dans lesquelles elles apparaissent, activer les options (par le biais de ``+`` dans une instruction) est habituellement le seul choix ayant du sens. Toutefois, les options peuvent aussi être passées aux fonctions qui exécutent les *doctests*, définissant de nouvelles valeurs par défaut. Dans de tels cas, désactiver une option par l'utilisation de ``-`` dans une instruction peut être utile.

source: Warnings
fr: Avertissements

source: :mod:`doctest` is serious about requiring exact matches in expected output. If even a single character doesn't match, the test fails. This will probably surprise you a few times, as you learn exactly what Python does and doesn't guarantee about output. For example, when printing a set, Python doesn't guarantee that the element is printed in any particular order, so a test like ::
fr: Le module :mod:`doctest` est rigoureux pour ce qui est d'inclure des correspondances exactes dans la sortie attendue. Si un seul caractère ne correspond pas, le test échoue. Ceci vous surprendra probablement quelques fois, alors que vous apprenez exactement ce que Python garantit et ne garantit pas pour qui est des sorties. Par exemple, lorsqu'on affiche un ensemble (set), Python ne garantit pas que les éléments sont affichés dans un ordre particulier ; ainsi un test tel que ::

source: is vulnerable! One workaround is to do ::
fr: est vulnérable ! Une alternative est de faire ::

source: instead. Another is to do ::
fr: à la place. Une autre façon de faire est ::

source: There are others, but you get the idea.
fr: Il y en a d'autres, mais vous saisissez l'idée.

source: Floating-point numbers are also subject to small output variations across platforms, because Python defers to the platform C library for float formatting, and C libraries vary widely in quality here. ::
fr: Les nombres à virgule flottante sont aussi sujets à de petites variations à la sortie, tout dépendamment de la plateforme utilisée, étant donné que Python s'en remet à la bibliothèque de la plateforme C pour la mise-en-forme des *floats*, et les bibliothèques C varient grandement pour ce qui de leur qualité sur ce point. ::

source: Simple fractions are also easier for people to understand, and that makes for better documentation.
fr: Les fractions simples sont aussi plus faciles à comprendre, et cela fait une meilleure documentation.

source: Basic API
fr: API de base

source: The functions :func:`testmod` and :func:`testfile` provide a simple interface to doctest that should be sufficient for most basic uses. For a less formal introduction to these two functions, see sections :ref:`doctest-simple-testmod` and :ref:`doctest-simple-testfile`.
fr: Les fonctions :func:`testmod` et :func:`testfile` fournissent une interface simple pour *doctest* qui est suffisante pour les cas d'usage les plus élémentaires. Pour une introduction moins formelle à ces deux fonctions, voir les sections :ref:`doctest-simple-testmod` et :ref:`doctest-simple-testfile`.

source: All arguments except *filename* are optional, and should be specified in keyword form.
fr: Tous les arguments sauf *filename* sont optionnels, et doivent être précisés sous forme lettrée.

source: Test examples in the file named *filename*. Return ``(failure_count, test_count)``.
fr: Teste les exemples dans le fichier nommé *filename*. Renvoie ``(failure_count, test_count)``.

source: Optional argument *module_relative* specifies how the filename should be interpreted:
fr: L'argument optionnel *module_relative* précise comment le nom de fichier doit être interprété :

source: If *module_relative* is ``True`` (the default), then *filename* specifies an OS-independent module-relative path. By default, this path is relative to the calling module's directory; but if the *package* argument is specified, then it is relative to that package. To ensure OS-independence, *filename* should use ``/`` characters to separate path segments, and may not be an absolute path (i.e., it may not begin with ``/``).
fr: Si *module_relative* prend la valeur ``True`` (la valeur par défaut), alors *filename* précise un chemin relatif au module qui soit indépendant du système d'exploitation (*OS*). Par défaut, ce chemin est relatif au répertoire du module appelant ; mais si l'argument *package* est précisé, alors il est relatif à ce paquet. Pour garantir l'indépendance quant au système d'exploitation, *filename* doit utiliser des caractères ``/`` pour séparer chaque segment de chemin, et ne peut pas être un chemin absolu (c'est-à-dire qu'il ne peut pas commencer par ``/``).

source: If *module_relative* is ``False``, then *filename* specifies an OS-specific path. The path may be absolute or relative; relative paths are resolved with respect to the current working directory.
fr: Si *module_relative* prend la valeur ``False``, alors *filename* précise un chemin en fonction du système d'exploitation. Le chemin peut être absolu ou relatif ; les chemins relatifs sont résolus en rapport au répertoire actif.

source: Optional argument *name* gives the name of the test; by default, or if ``None``, ``os.path.basename(filename)`` is used.
fr: L'option *name* désigne le nom du test ; par défaut, ou si ``None`` est passé en argument, ``os.path.basename(filename)`` est utilisé.

source: Optional argument *package* is a Python package or the name of a Python package whose directory should be used as the base directory for a module-relative filename. If no package is specified, then the calling module's directory is used as the base directory for module-relative filenames. It is an error to specify *package* if *module_relative* is ``False``.
fr: L'option *package* est un paquet Python ou le nom d'un paquet Python dont le répertoire doit être utilisé comme le répertoire principal pour un nom de fichier lié à un module. Si aucun paquet n'est spécifié, le répertoire du module appelé à l'exécution est utilisé comme le répertoire principal pour les noms de fichiers liés au module. C'est une erreur que de spécifier *package* si *module_relative* a ``False`` comme valeur.

source: Optional argument *globs* gives a dict to be used as the globals when executing examples. A new shallow copy of this dict is created for the doctest, so its examples start with a clean slate. By default, or if ``None``, a new empty dict is used.
fr: L'option *globs* spécifie un *dict* à utiliser comme *globals* lorsque des exemples sont exécutés. Une copie superficielle de ce *dict* est créée pour le *doctest* ; ainsi, ces exemples commencent avec un état vide. Par défaut, ou si ``None`` est passé en argument, un nouveau *dict* vide est utilisé.
