Repository: python/python-docs-fr
Catalog: library/email.compat32-message.po
Languages: fr

source: :mod:`email.message.Message`: Representing an email message using the :data:`~email.policy.compat32` API
fr: :mod:`email.message.Message` : représentation d'un message électronique à l'aide de l'API :data:`~email.policy.compat32`

source: The :class:`Message` class is very similar to the :class:`~email.message.EmailMessage` class, without the methods added by that class, and with the default behavior of certain other methods being slightly different. We also document here some methods that, while supported by the :class:`~email.message.EmailMessage` class, are not recommended unless you are dealing with legacy code.
fr: La classe :class:`Message` est très similaire à la classe :class:`~email.message.EmailMessage`, sans les méthodes ajoutées par cette classe et avec le comportement par défaut légèrement différent pour certaines autres méthodes. Nous documentons également ici certaines méthodes qui, bien que prises en charge par la classe :class:`~email.message.EmailMessage`, ne sont pas recommandées, sauf si vous avez affaire à du code hérité.

source: The philosophy and structure of the two classes is otherwise the same.
fr: La philosophie et la structure des deux classes sont par ailleurs les mêmes.

source: This document describes the behavior under the default (for :class:`Message`) policy :attr:`~email.policy.Compat32`. If you are going to use another policy, you should be using the :class:`~email.message.EmailMessage` class instead.
fr: Ce document décrit le comportement avec les règles par défaut (pour :class:`Message`) :attr:`~email.policy.Compat32`. Si vous envisagez d'utiliser d'autres règles, vous devriez plutôt utiliser la classe :class:`~email.message.EmailMessage`.

source: An email message consists of *headers* and a *payload*. Headers must be :rfc:`5322` style names and values, where the field name and value are separated by a colon. The colon is not part of either the field name or the field value. The payload may be a simple text message, or a binary object, or a structured sequence of sub-messages each with their own set of headers and their own payload. The latter type of payload is indicated by the message having a MIME type such as :mimetype:`multipart/\*` or :mimetype:`message/rfc822`.
fr: Un message électronique se compose d'*en-têtes* et d'une *charge utile*. Les en-têtes doivent être des noms et des valeurs de style :rfc:`5322`, où le nom et la valeur du champ sont séparés par deux-points. Les deux-points ne font partie ni du nom du champ ni de la valeur du champ. La charge utile peut être un simple message texte, ou un objet binaire, ou une séquence structurée de sous-messages chacun avec son propre ensemble d'en-têtes et sa propre charge utile. Ce dernier type de charge utile est indiqué par le message ayant un type MIME tel que :mimetype:`multipart/\*` ou :mimetype:`message/rfc822`.

source: The conceptual model provided by a :class:`Message` object is that of an ordered dictionary of headers with additional methods for accessing both specialized information from the headers, for accessing the payload, for generating a serialized version of the message, and for recursively walking over the object tree. Note that duplicate headers are supported but special methods must be used to access them.
fr: Le modèle conceptuel fourni par un objet :class:`Message` est celui d'un dictionnaire ordonné d'en-têtes avec des méthodes supplémentaires pour accéder à la fois aux informations spécialisées des en-têtes, pour accéder à la charge utile, pour générer une version sérialisée du message et pour parcourir récursivement l'arbre d'objets. Notez que les en-têtes en double sont pris en charge mais que des méthodes spéciales doivent être utilisées pour y accéder.

source: The :class:`Message` pseudo-dictionary is indexed by the header names, which must be ASCII values. The values of the dictionary are strings that are supposed to contain only ASCII characters; there is some special handling for non-ASCII input, but it doesn't always produce the correct results. Headers are stored and returned in case-preserving form, but field names are matched case-insensitively. There may also be a single envelope header, also known as the *Unix-From* header or the ``From_`` header. The *payload* is either a string or bytes, in the case of simple message objects, or a list of :class:`Message` objects, for MIME container documents (e.g. :mimetype:`multipart/\*` and :mimetype:`message/rfc822`).
fr: Le pseudo-dictionnaire :class:`Message` est indicé par les noms d'en-tête, qui doivent être des valeurs ASCII. Les valeurs du dictionnaire sont des chaînes censées contenir uniquement des caractères ASCII ; il existe une gestion spéciale pour les entrées non ASCII, mais cela ne produit pas toujours les résultats corrects. Les en-têtes sont stockés et renvoyés sous une forme respectant la casse, mais les noms de champ sont mis en correspondance sans tenir compte de la casse. Il peut également y avoir un seul en-tête d'enveloppe, également appelé en-tête *Unix-From* ou en-tête ``From_``. La *charge utile* est soit une chaîne ou des octets, dans le cas d'objets message simples, soit une liste d'objets :class:`Message`, pour les documents conteneurs MIME (par exemple :mimetype:`multipart/\*` et :mimetype:`message/rfc822`).

source: Here are the methods of the :class:`Message` class:
fr: Voici les méthodes de la classe :class:`Message` :

source: If *policy* is specified (it must be an instance of a :mod:`~email.policy` class) use the rules it specifies to update and serialize the representation of the message. If *policy* is not set, use the :class:`compat32 <email.policy.Compat32>` policy, which maintains backward compatibility with the Python 3.2 version of the email package. For more information see the :mod:`~email.policy` documentation.
fr: Si *policy* est spécifié (il doit s'agir d'une instance d'une classe :mod:`~email.policy`), utilise les règles spécifiées pour mettre à jour et sérialiser la représentation du message. Si *policy* n'est pas défini, utilise les règles :class:`compat32 <email.policy.Compat32>`, qui maintient la rétrocompatibilité avec la version Python 3.2 du paquet de messagerie. Pour plus d'informations, consultez la documentation :mod:`~email.policy`.

source: The *policy* keyword argument was added.
fr: l'argument nommé *policy* a été ajouté.

source: Return the entire message flattened as a string. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. For backward compatibility reasons, *maxheaderlen* defaults to ``0``, so if you want a different value you must override it explicitly (the value specified for *max_line_length* in the policy will be ignored by this method). The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the ``Generator``.
fr: Renvoie le message entier aplati sous forme de chaîne. Lorsque l'option *unixfrom* est vraie, l'en-tête de l'enveloppe est inclus dans la chaîne renvoyée. *unixfrom* par défaut est ``False``. Pour des raisons de compatibilité descendante, *maxheaderlen* est par défaut à ``0``, donc si vous voulez une valeur différente, vous devez la remplacer explicitement (la valeur spécifiée pour *max_line_length* dans la politique sera ignorée par cette méthode). L'argument *policy* peut être utilisé pour remplacer les règles par défaut obtenues à partir de l'instance de message. Cela peut être utilisé pour contrôler une partie du formatage produit par la méthode, puisque la *policy* spécifiée est transmise au ``Generator``.

source: Flattening the message may trigger changes to the :class:`Message` if defaults need to be filled in to complete the transformation to a string (for example, MIME boundaries may be generated or modified).
fr: L'aplatissement du message peut déclencher des changements dans :class:`Message` si les valeurs par défaut doivent être renseignées pour terminer la transformation en chaîne (par exemple, les limites MIME peuvent être générées ou modifiées).

source: Note that this method is provided as a convenience and may not always format the message the way you want. For example, by default it does not do the mangling of lines that begin with ``From`` that is required by the Unix mbox format. For more flexibility, instantiate a :class:`~email.generator.Generator` instance and use its :meth:`~email.generator.Generator.flatten` method directly. For example::
fr: Notez que cette méthode est fournie à titre de commodité et peut ne pas toujours formater le message comme vous le souhaitez. Par exemple, par défaut, elle ne reformate pas les lignes qui commencent par ``From`` qui est requis par le format *mbox* Unix. Pour plus de flexibilité, instanciez une instance :class:`~email.generator.Generator` et utilisez sa méthode :meth:`~email.generator.Generator.flatten` directement. Par exemple ::

source: If the message object contains binary data that is not encoded according to RFC standards, the non-compliant data will be replaced by unicode "unknown character" code points. (See also :meth:`.as_bytes` and :class:`~email.generator.BytesGenerator`.)
fr: Si l'objet message contient des données binaires qui ne sont pas encodées selon les normes RFC, les données non conformes seront remplacées par des points de code Unicode « caractère inconnu » (voir aussi :meth:`.as_bytes` et :class:`~email.generator.BytesGenerator`).

source: the *policy* keyword argument was added.
fr: l'argument nommé *policy* a été ajouté.

source: Return the entire message flattened as a bytes object. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the ``BytesGenerator``.
fr: Renvoie le message entier aplati en tant qu'objet bytes. Lorsque l'option *unixfrom* est vraie, l'en-tête de l'enveloppe est inclus dans la chaîne renvoyée. *unixfrom* par défaut est ``False``. L'argument *policy* peut être utilisé pour remplacer les règles par défaut obtenues à partir de l'instance de message. Cela peut être utilisé pour contrôler une partie du formatage produit par la méthode, puisque la *policy* spécifiée est passée au ``BytesGenerator``.

source: Note that this method is provided as a convenience and may not always format the message the way you want. For example, by default it does not do the mangling of lines that begin with ``From`` that is required by the Unix mbox format. For more flexibility, instantiate a :class:`~email.generator.BytesGenerator` instance and use its :meth:`~email.generator.BytesGenerator.flatten` method directly. For example::
fr: Notez que cette méthode est fournie à titre de commodité et peut ne pas toujours formater le message comme vous le souhaitez. Par exemple, par défaut, elle ne reformate pas les lignes qui commencent par ``From`` qui est requis par le format *mbox* Unix. Pour plus de flexibilité, instanciez une instance :class:`~email.generator.BytesGenerator` et utilisez sa méthode :meth:`~email.generator.BytesGenerator.flatten` directement. Par exemple ::

source: Return ``True`` if the message's payload is a list of sub-\ :class:`Message` objects, otherwise return ``False``. When :meth:`is_multipart` returns ``False``, the payload should be a string object (which might be a CTE encoded binary payload). (Note that :meth:`is_multipart` returning ``True`` does not necessarily mean that "msg.get_content_maintype() == 'multipart'" will return the ``True``. For example, ``is_multipart`` will return ``True`` when the :class:`Message` is of type ``message/rfc822``.)
fr: Renvoie ``True`` si la charge utile du message est une liste d'objets sous-\ :class:`Message`, sinon renvoie ``False``. Lorsque :meth:`is_multipart` renvoie ``False``, la charge utile doit être un objet chaîne (qui peut être une charge utile binaire encodée CTE). (Notez que :meth:`is_multipart` renvoyant ``True`` ne signifie pas nécessairement que ``msg.get_content_maintype() == 'multipart'`` renvoie ``True``. Par exemple, ``is_multipart`` renvoie ``True`` lorsque le :class:`Message` est de type ``message/rfc822``.)

source: Set the message's envelope header to *unixfrom*, which should be a string.
fr: Définit l'en-tête de l'enveloppe du message sur *unixfrom*, qui doit être une chaîne.

source: Return the message's envelope header. Defaults to ``None`` if the envelope header was never set.
fr: Renvoie l'en-tête de l'enveloppe du message. La valeur par défaut est ``None`` si l'en-tête de l'enveloppe n'a jamais été défini.

source: Add the given *payload* to the current payload, which must be ``None`` or a list of :class:`Message` objects before the call. After the call, the payload will always be a list of :class:`Message` objects. If you want to set the payload to a scalar object (e.g. a string), use :meth:`set_payload` instead.
fr: Ajoute le *payload* donné à la charge utile actuelle, qui doit être ``None`` ou une liste d'objets :class:`Message` avant l'appel. Après l'appel, la charge utile sera toujours une liste d'objets :class:`Message`. Si vous souhaitez définir la charge utile sur un objet scalaire (par exemple, une chaîne), utilisez :meth:`set_payload` à la place.

source: This is a legacy method. On the :class:`~email.emailmessage.EmailMessage` class its functionality is replaced by :meth:`~email.message.EmailMessage.set_content` and the related ``make`` and ``add`` methods.
fr: Il s'agit d'une ancienne méthode. Dans la classe :class:`~email.emailmessage.EmailMessage` sa fonctionnalité est remplacée par :meth:`~email.message.EmailMessage.set_content` et les méthodes associées ``make`` et ``add``.

source: Return the current payload, which will be a list of :class:`Message` objects when :meth:`is_multipart` is ``True``, or a string when :meth:`is_multipart` is ``False``. If the payload is a list and you mutate the list object, you modify the message's payload in place.
fr: Renvoie la charge utile actuelle, qui est une liste d'objets :class:`Message` lorsque :meth:`is_multipart` est ``True``, ou une chaîne lorsque :meth:`is_multipart` est ``False``. Si la charge utile est une liste et que vous modifiez l'objet liste, vous modifiez la charge utile du message « sur place ».

source: With optional argument *i*, :meth:`get_payload` will return the *i*-th element of the payload, counting from zero, if :meth:`is_multipart` is ``True``. An :exc:`IndexError` will be raised if *i* is less than 0 or greater than or equal to the number of items in the payload. If the payload is a string (i.e. :meth:`is_multipart` is ``False``) and *i* is given, a :exc:`TypeError` is raised.
fr: Avec l'argument optionnel *i*, :meth:`get_payload` renvoie le *i*:sup:`ème` élément de la charge utile, en partant de zéro, si :meth:`is_multipart` vaut ``True``. Une :exc:`IndexError` est levée si *i* est inférieur à 0 ou supérieur ou égal au nombre d'éléments dans la charge utile. Si la charge utile est une chaîne (c'est-à-dire que :meth:`is_multipart` est ``False``) et que *i* est donné, une :exc:`TypeError` est levée.

source: Optional *decode* is a flag indicating whether the payload should be decoded or not, according to the :mailheader:`Content-Transfer-Encoding` header. When ``True`` and the message is not a multipart, the payload will be decoded if this header's value is ``quoted-printable`` or ``base64``. If some other encoding is used, or :mailheader:`Content-Transfer-Encoding` header is missing, the payload is returned as-is (undecoded). In all cases the returned value is binary data. If the message is a multipart and the *decode* flag is ``True``, then ``None`` is returned. If the payload is base64 and it was not perfectly formed (missing padding, characters outside the base64 alphabet), then an appropriate defect will be added to the message's defect property (:class:`~email.errors.InvalidBase64PaddingDefect` or :class:`~email.errors.InvalidBase64CharactersDefect`, respectively).
fr: *decode* est un indicateur facultatif indiquant si la charge utile doit être décodée ou non, selon l'en-tête :mailheader:`Content-Transfer-Encoding`. Lorsqu'il vaut ``True`` et que le message n'est pas en plusieurs parties, la charge utile est décodée si la valeur de cet en-tête est ``quoted-printable`` ou ``base64``. Si un autre encodage est utilisé, ou si l'en-tête :mailheader:`Content-Transfer-Encoding` est manquant, la charge utile est renvoyée telle quelle (non décodée). Dans tous les cas, la valeur renvoyée est une donnée binaire. Si le message est en plusieurs parties et que l'indicateur *decode* est ``True``, alors ``None`` est renvoyé. Si la charge utile est en base64 et qu'elle n'a pas été parfaitement formée (remplissage manquant, caractères en dehors de l'alphabet base64), alors un défaut approprié est ajouté à la propriété de défaut du message (:class:`~email.errors.InvalidBase64PaddingDefect` ou :class:`~email.errors.InvalidBase64CharactersDefect`, respectivement).

source: When *decode* is ``False`` (the default) the body is returned as a string without decoding the :mailheader:`Content-Transfer-Encoding`. However, for a :mailheader:`Content-Transfer-Encoding` of 8bit, an attempt is made to decode the original bytes using the ``charset`` specified by the :mailheader:`Content-Type` header, using the ``replace`` error handler. If no ``charset`` is specified, or if the ``charset`` given is not recognized by the email package, the body is decoded using the default ASCII charset.
fr: Lorsque *decode* est ``False`` (valeur par défaut), le corps est renvoyé sous forme de chaîne sans décoder le :mailheader:`Content-Transfer-Encoding`. Cependant, pour un :mailheader:`Content-Transfer-Encoding` de 8 bits, une tentative est faite pour décoder les octets d'origine en utilisant le ``charset`` spécifié par l'en-tête :mailheader:`Content-Type`, en utilisant le gestionnaire d'erreurs ``replace``. Si aucun ``charset`` n'est spécifié, ou si le ``charset`` donné n'est pas reconnu par le paquet de messagerie, le corps est décodé en utilisant le jeu de caractères ASCII par défaut.

source: This is a legacy method. On the :class:`~email.emailmessage.EmailMessage` class its functionality is replaced by :meth:`~email.message.EmailMessage.get_content` and :meth:`~email.message.EmailMessage.iter_parts`.
fr: Il s'agit d'une ancienne méthode. Dans la classe :class:`~email.emailmessage.EmailMessage` sa fonctionnalité est remplacée par :meth:`~email.message.EmailMessage.get_content` et :meth:`~email.message.EmailMessage.iter_parts`.

source: Set the entire message object's payload to *payload*. It is the client's responsibility to ensure the payload invariants. Optional *charset* sets the message's default character set; see :meth:`set_charset` for details.
fr: Définit la charge utile de l'objet message entier à *payload*. Il est de la responsabilité du client de s'assurer des invariants de la charge utile. Le *charset* facultatif définit le jeu de caractères par défaut du message ; voir :meth:`set_charset` pour plus de détails.

source: This is a legacy method. On the :class:`~email.emailmessage.EmailMessage` class its functionality is replaced by :meth:`~email.message.EmailMessage.set_content`.
fr: Il s'agit d'une ancienne méthode. Dans la classe :class:`~email.emailmessage.EmailMessage` sa fonctionnalité est remplacée par :meth:`~email.message.EmailMessage.set_content`.

source: Set the character set of the payload to *charset*, which can either be a :class:`~email.charset.Charset` instance (see :mod:`email.charset`), a string naming a character set, or ``None``. If it is a string, it will be converted to a :class:`~email.charset.Charset` instance. If *charset* is ``None``, the ``charset`` parameter will be removed from the :mailheader:`Content-Type` header (the message will not be otherwise modified). Anything else will generate a :exc:`TypeError`.
fr: Définit le jeu de caractères de la charge utile à *charset*, qui peut être soit une instance de :class:`~email.charset.Charset` (voir :mod:`email.charset`), une chaîne nommant un jeu de caractères ou ``None``. S'il s'agit d'une chaîne, elle est convertie en une instance :class:`~email.charset.Charset`. Si *charset* est ``None``, le paramètre ``charset`` est supprimé de l'en-tête :mailheader:`Content-Type` (le message n'est pas modifié autrement). Tout le reste lève une :exc:`TypeError`.

source: If there is no existing :mailheader:`MIME-Version` header one will be added. If there is no existing :mailheader:`Content-Type` header, one will be added with a value of :mimetype:`text/plain`. Whether the :mailheader:`Content-Type` header already exists or not, its ``charset`` parameter will be set to *charset.output_charset*. If *charset.input_charset* and *charset.output_charset* differ, the payload will be re-encoded to the *output_charset*. If there is no existing :mailheader:`Content-Transfer-Encoding` header, then the payload will be transfer-encoded, if needed, using the specified :class:`~email.charset.Charset`, and a header with the appropriate value will be added. If a :mailheader:`Content-Transfer-Encoding` header already exists, the payload is assumed to already be correctly encoded using that :mailheader:`Content-Transfer-Encoding` and is not modified.
fr: S'il n'y a pas d'en-tête :mailheader:`MIME-Version` existant, un en-tête est ajouté. S'il n'y a pas d'en-tête :mailheader:`Content-Type`, un en-tête est ajouté avec une valeur de :mimetype:`text/plain`. Que l'en-tête :mailheader:`Content-Type` existe déjà ou non, son paramètre ``charset`` est défini sur *charset.output_charset*. Si *charset.input_charset* et *charset.output_charset* diffèrent, la charge utile est ré-encodée dans le *output_charset*. S'il n'y a pas d'en-tête :mailheader:`Content-Transfer-Encoding` existant, alors la charge utile est encodée par transfert, si nécessaire, en utilisant le :class:`~email.charset.Charset` spécifié et un en-tête avec cette valeur est ajouté. Si un en-tête :mailheader:`Content-Transfer-Encoding` existe déjà, la charge utile est supposée être déjà correctement encodée à l'aide de cet en-tête :mailheader:`Content-Transfer-Encoding` et n'est pas modifiée.

source: This is a legacy method. On the :class:`~email.emailmessage.EmailMessage` class its functionality is replaced by the *charset* parameter of the :meth:`email.emailmessage.EmailMessage.set_content` method.
fr: Il s'agit d'une ancienne méthode. Dans la classe :class:`~email.emailmessage.EmailMessage` sa fonctionnalité est remplacée par le paramètre *charset* de la méthode :meth:`email.emailmessage.EmailMessage.set_content`.

source: Return the :class:`~email.charset.Charset` instance associated with the message's payload.
fr: Renvoie l'instance :class:`~email.charset.Charset` associée à la charge utile du message.

source: This is a legacy method. On the :class:`~email.emailmessage.EmailMessage` class it always returns ``None``.
fr: Il s'agit d'une ancienne méthode. Dans la classe :class:`~email.emailmessage.EmailMessage`, elle renvoie toujours ``None``.
