Repository: python/python-docs-fr
Catalog: library/email.charset.po
Languages: fr

source: :mod:`email.charset`: Representing character sets
fr: :mod:`email.charset` : représentation des jeux de caractères

source: **Source code:** :source:`Lib/email/charset.py`
fr: **Code source :** :source:`Lib/email/charset.py`

source: This module is part of the legacy (``Compat32``) email API. In the new API only the aliases table is used.
fr: Ce module fait partie de l'ancienne API de messagerie (``Compat32``). Dans la nouvelle API, seule la table des alias est utilisée.

source: The remaining text in this section is the original documentation of the module.
fr: Le texte restant de cette section est la documentation originale de ce module.

source: This module provides a class :class:`Charset` for representing character sets and character set conversions in email messages, as well as a character set registry and several convenience methods for manipulating this registry. Instances of :class:`Charset` are used in several other modules within the :mod:`email` package.
fr: Ce module fournit une classe :class:`Charset` pour représenter les jeux de caractères et les conversions de jeux de caractères dans les messages électroniques, ainsi qu'un registre de jeux de caractères et plusieurs méthodes pratiques pour manipuler ce registre. Les instances de :class:`Charset` sont utilisées dans plusieurs autres modules du paquet :mod:`email`.

source: Import this class from the :mod:`email.charset` module.
fr: Importez cette classe depuis le module :mod:`email.charset`.

source: Map character sets to their email properties.
fr: Associe les jeux de caractères à leurs propriétés d'e-mail.

source: This class provides information about the requirements imposed on email for a specific character set. It also provides convenience routines for converting between character sets, given the availability of the applicable codecs. Given a character set, it will do its best to provide information on how to use that character set in an email message in an RFC-compliant way.
fr: Cette classe fournit des informations sur les exigences imposées aux e-mails pour un jeu de caractères spécifique. Elle fournit également des routines pratiques pour la conversion entre les jeux de caractères, compte tenu de la disponibilité des codecs applicables. Étant donné un jeu de caractères, elle fait de son mieux pour fournir des informations sur la façon d'utiliser ce jeu de caractères dans un message électronique d'une manière conforme à la RFC.

source: Certain character sets must be encoded with quoted-printable or base64 when used in email headers or bodies. Certain character sets must be converted outright, and are not allowed in email.
fr: Certains jeux de caractères doivent être encodés avec *quoted-printable* ou en *base64* lorsqu'ils sont utilisés dans les en-têtes ou les corps des e-mails. Certains jeux de caractères doivent être convertis directement et ne sont pas autorisés dans les e-mails.

source: Optional *input_charset* is as described below; it is always coerced to lower case. After being alias normalized it is also used as a lookup into the registry of character sets to find out the header encoding, body encoding, and output conversion codec to be used for the character set. For example, if *input_charset* is ``iso-8859-1``, then headers and bodies will be encoded using quoted-printable and no output conversion codec is necessary. If *input_charset* is ``euc-jp``, then headers will be encoded with base64, bodies will not be encoded, but output text will be converted from the ``euc-jp`` character set to the ``iso-2022-jp`` character set.
fr: Le *input_charset* facultatif est tel que décrit ci-dessous ; il est toujours contraint en minuscules. Après avoir été normalisé par alias, il est également utilisé comme recherche dans le registre des jeux de caractères pour trouver le codage d'en-tête, le codage de corps et le codec de conversion de sortie à utiliser pour le jeu de caractères. Par exemple, si *input_charset* vaut ``iso-8859-1``, alors les en-têtes et les corps seront encodés en utilisant *quoted-printable* et aucun codec de conversion de sortie n'est nécessaire. Si *input_charset* vaut ``euc-jp``, alors les en-têtes seront encodés en *base64*, les corps ne seront pas encodés, mais le texte de sortie sera converti du jeu de caractères ``euc-jp`` vers le jeu de caractères ``iso-2022-jp``.

source: :class:`Charset` instances have the following data attributes:
fr: Les instances de :class:`Charset` ont les attributs de données suivants :

source: The initial character set specified. Common aliases are converted to their *official* email names (e.g. ``latin_1`` is converted to ``iso-8859-1``). Defaults to 7-bit ``us-ascii``.
fr: Jeu de caractères initial spécifié. Les alias communs sont convertis en leurs noms de messagerie *officiels* (par exemple, ``latin_1`` est converti en ``iso-8859-1``). Par défaut, ``us-ascii`` 7 bits.

source: If the character set must be encoded before it can be used in an email header, this attribute will be set to ``Charset.QP`` (for quoted-printable), ``Charset.BASE64`` (for base64 encoding), or ``Charset.SHORTEST`` for the shortest of QP or BASE64 encoding. Otherwise, it will be ``None``.
fr: Si le jeu de caractères doit être encodé avant de pouvoir être utilisé dans un en-tête d'e-mail, cet attribut est défini sur ``Charset.QP`` (pour *quoted-printable*), ``Charset.BASE64`` (pour l'encodage en *base64*), ou ``Charset.SHORTEST`` pour le plus court des encodages QP ou BASE64. Sinon, c'est ``None``.

source: Same as *header_encoding*, but describes the encoding for the mail message's body, which indeed may be different than the header encoding. ``Charset.SHORTEST`` is not allowed for *body_encoding*.
fr: Identique à *header_encoding*, mais décrit l'encodage du corps du message électronique, qui peut effectivement être différent de l'encodage de l'en-tête. ``Charset.SHORTEST`` n'est pas autorisé pour *body_encoding*.

source: Some character sets must be converted before they can be used in email headers or bodies. If the *input_charset* is one of them, this attribute will contain the name of the character set output will be converted to. Otherwise, it will be ``None``.
fr: Certains jeux de caractères doivent être convertis avant de pouvoir être utilisés dans les en-têtes ou le corps des e-mails. Si le *input_charset* est un jeu de ce type, alors cet attribut contient le nom du jeu de caractères vers lequel la sortie sera convertie. Sinon, il vaut ``None``.

source: The name of the Python codec used to convert the *input_charset* to Unicode. If no conversion codec is necessary, this attribute will be ``None``.
fr: Nom du codec Python utilisé pour convertir le *input_charset* en Unicode. Si aucun codec de conversion n'est nécessaire, cet attribut vaut ``None``.

source: The name of the Python codec used to convert Unicode to the *output_charset*. If no conversion codec is necessary, this attribute will have the same value as the *input_codec*.
fr: Nom du codec Python utilisé pour convertir Unicode en *output_charset*. Si aucun codec de conversion n'est nécessaire, cet attribut a la même valeur que le *input_codec*.

source: :class:`Charset` instances also have the following methods:
fr: Les instances de :class:`Charset` ont également les méthodes suivantes :

source: Return the content transfer encoding used for body encoding.
fr: Renvoie l'encodage de transfert de contenu utilisé pour l'encodage du corps.

source: This is either the string ``quoted-printable`` or ``base64`` depending on the encoding used, or it is a function, in which case you should call the function with a single argument, the Message object being encoded. The function should then set the :mailheader:`Content-Transfer-Encoding` header itself to whatever is appropriate.
fr: Il s'agit soit de la chaîne ``quoted-printable`` ou ``base64`` selon l'encodage utilisé, soit d'une fonction, vous devez alors appeler la fonction avec un seul argument, l'objet Message étant encodé. La fonction doit ensuite définir l'en-tête :mailheader:`Content-Transfer-Encoding` à la valeur appropriée.

source: Returns the string ``quoted-printable`` if *body_encoding* is ``QP``, returns the string ``base64`` if *body_encoding* is ``BASE64``, and returns the string ``7bit`` otherwise.
fr: Renvoie la chaîne ``quoted-printable`` si *body_encoding* est ``QP``, renvoie la chaîne ``base64`` si *body_encoding* est ``BASE64`` et renvoie la chaîne ``7bit`` sinon.

source: Return the output character set.
fr: Renvoie le jeu de caractères de sortie.

source: This is the *output_charset* attribute if that is not ``None``, otherwise it is *input_charset*.
fr: C'est l'attribut *output_charset* si ce n'est pas ``None``, sinon c'est *input_charset*.

source: Header-encode the string *string*.
fr: Encode la chaîne *string* pour un en-tête.

source: The type of encoding (base64 or quoted-printable) will be based on the *header_encoding* attribute.
fr: Le type d'encodage (*base64* ou *quoted-printable*) est basé sur l'attribut *header_encoding*.

source: Header-encode a *string* by converting it first to bytes.
fr: Encode *string* en la convertissant d'abord en octets, pour un en-tête.

source: This is similar to :meth:`header_encode` except that the string is fit into maximum line lengths as given by the argument *maxlengths*, which must be an iterator: each element returned from this iterator will provide the next maximum line length.
fr: C'est similaire à :meth:`header_encode` sauf que la chaîne est adaptée aux longueurs de ligne maximales indiquées par l'argument *maxlengths*, qui doit être un itérateur : chaque élément renvoyé par cet itérateur fournit la prochaine longueur de ligne maximale.

source: Body-encode the string *string*.
fr: Encode la chaîne *string* pour un usage en corps de message.

source: The type of encoding (base64 or quoted-printable) will be based on the *body_encoding* attribute.
fr: Le type d'encodage (*base64* ou *quoted-printable*) est basé sur l'attribut *body_encoding*.

source: The :class:`Charset` class also provides a number of methods to support standard operations and built-in functions.
fr: La classe :class:`Charset` fournit également un certain nombre de méthodes pour prendre en charge les opérations standard et les fonctions intégrées.

source: Returns *input_charset* as a string coerced to lower case. :meth:`__repr__` is an alias for :meth:`__str__`.
fr: Renvoie *input_charset* sous la forme d'une chaîne contrainte en minuscules. :meth:`__repr__` est un alias pour :meth:`__str__`.

source: This method allows you to compare two :class:`Charset` instances for equality.
fr: Cette méthode vous permet de tester l'égalité de deux instances de :class:`Charset`.

source: This method allows you to compare two :class:`Charset` instances for inequality.
fr: Cette méthode vous permet de tester l'inégalité de deux instances de :class:`Charset`.

source: The :mod:`email.charset` module also provides the following functions for adding new entries to the global character set, alias, and codec registries:
fr: Le module :mod:`email.charset` fournit également les fonctions suivantes pour ajouter de nouvelles entrées à l'ensemble des jeux de caractères globaux, aux registres d'alias et de codec :

source: Add character properties to the global registry.
fr: Ajoute des propriétés relatives d'un jeu de caractères dans le registre global.

source: *charset* is the input character set, and must be the canonical name of a character set.
fr: *charset* est le jeu de caractères d'entrée et doit être le nom canonique d'un jeu de caractères.

source: Optional *header_enc* and *body_enc* is either ``Charset.QP`` for quoted-printable, ``Charset.BASE64`` for base64 encoding, ``Charset.SHORTEST`` for the shortest of quoted-printable or base64 encoding, or ``None`` for no encoding. ``SHORTEST`` is only valid for *header_enc*. The default is ``None`` for no encoding.
fr: *header_enc* et *body_enc* (facultatifs) sont soit ``Charset.QP`` pour *quoted-printable*, ``Charset.BASE64`` pour l'encodage *base64*, ``Charset.SHORTEST`` pour le plus court entre *quoted-printable* et *base64*, ou ``None`` pour aucun encodage. ``SHORTEST`` n'est valide que pour *header_enc*. La valeur par défaut est ``None`` pour aucun encodage.

source: Optional *output_charset* is the character set that the output should be in. Conversions will proceed from input charset, to Unicode, to the output charset when the method :meth:`Charset.convert` is called. The default is to output in the same character set as the input.
fr: *output_charset* (facultatif) est le jeu de caractères dans lequel doit être la sortie. Les conversions se poursuivent du jeu de caractères d'entrée, vers Unicode, vers le jeu de caractères de sortie lorsque la méthode :meth:`Charset.convert` est appelée. La valeur par défaut est de sortir dans le même jeu de caractères que l'entrée.

source: Both *input_charset* and *output_charset* must have Unicode codec entries in the module's character set-to-codec mapping; use :func:`add_codec` to add codecs the module does not know about. See the :mod:`codecs` module's documentation for more information.
fr: *input_charset* et *output_charset* doivent avoir des entrées de codec Unicode dans la table de correspondances du jeu de caractères au codec du module ; utilisez :func:`add_codec` pour ajouter des codecs que le module ne connaît pas. Voir la documentation du module :mod:`codecs` pour plus d'informations.

source: The global character set registry is kept in the module global dictionary ``CHARSETS``.
fr: Le registre de jeux de caractères global est conservé dans le dictionnaire global du module ``CHARSETS``.

source: Add a character set alias. *alias* is the alias name, e.g. ``latin-1``. *canonical* is the character set's canonical name, e.g. ``iso-8859-1``.
fr: Ajoute un alias de jeu de caractères. *alias* est le nom d'alias, par ex. ``latin-1``. *canonical* est le nom canonique du jeu de caractères, par ex. ``iso-8859-1``.

source: The global charset alias registry is kept in the module global dictionary ``ALIASES``.
fr: Le registre global des alias du jeu de caractères est conservé dans le dictionnaire global du module ``ALIASES``.

source: Add a codec that map characters in the given character set to and from Unicode.
fr: Ajoute un codec qui fait correspondre les caractères du jeu de caractères donné vers et depuis Unicode.

source: *charset* is the canonical name of a character set. *codecname* is the name of a Python codec, as appropriate for the second argument to the :class:`str`'s :meth:`~str.encode` method.
fr: *charset* est le nom canonique d'un jeu de caractères. *codecname* est le nom d'un codec Python (c.-à-d. une valeur valable comme second argument de la méthode :meth:`~str.encode` de :class:`str`).
