Repository: python/python-docs-fr
Catalog: library/email.utils.po
Languages: fr

source: :mod:`email.utils`: Miscellaneous utilities
fr: :mod:`email.utils` : utilitaires divers

source: **Source code:** :source:`Lib/email/utils.py`
fr: **Code source :** :source:`Lib/email/utils.py`

source: There are a couple of useful utilities provided in the :mod:`email.utils` module:
fr: Il y a quelques utilitaires utiles fournis dans le module :mod:`email.utils` :

source: Return local time as an aware datetime object. If called without arguments, return current time. Otherwise *dt* argument should be a :class:`~datetime.datetime` instance, and it is converted to the local time zone according to the system time zone database. If *dt* is naive (that is, ``dt.tzinfo`` is ``None``), it is assumed to be in local time. In this case, a positive or zero value for *isdst* causes ``localtime`` to presume initially that summer time (for example, Daylight Saving Time) is or is not (respectively) in effect for the specified time. A negative value for *isdst* causes the ``localtime`` to attempt to divine whether summer time is in effect for the specified time.
fr: Renvoie l'heure locale en tant qu'objet *datetime* avisé. S'il est appelé sans arguments, renvoie l'heure actuelle. Sinon, l'argument *dt* doit être une instance :class:`~datetime.datetime`, et il est converti dans le fuseau horaire local en fonction de la base de données des fuseaux horaires du système. Si *dt* est naïf (c'est-à-dire que ``dt.tzinfo`` vaut ``None``), il est supposé être en heure locale. Dans ce cas, une valeur positive ou nulle pour *isdst* amène ``localtime`` à supposer initialement que l'heure d'été est ou n'est pas (respectivement) en vigueur pour l'heure spécifiée. Une valeur négative pour *isdst* fait que ``localtime`` tente de deviner si l'heure d'été est en vigueur pour l'heure spécifiée.

source: Returns a string suitable for an :rfc:`2822`\ -compliant :mailheader:`Message-ID` header. Optional *idstring* if given, is a string used to strengthen the uniqueness of the message id. Optional *domain* if given provides the portion of the msgid after the '@'. The default is the local hostname. It is not normally necessary to override this default, but may be useful certain cases, such as a constructing distributed system that uses a consistent domain name across multiple hosts.
fr: Renvoie une chaîne adaptée à un en-tête :mailheader:`Message-ID` compatible :rfc:`2822`. *idstring*, s'il est fourni, est une chaîne utilisée pour renforcer l'unicité de l'identifiant du message. Le *domain* facultatif, s'il est fourni, fournit la partie du *msgid* après le '@'. La valeur par défaut est le nom d'hôte local. Il n'est normalement pas nécessaire de remplacer cette valeur par défaut, mais cela peut être utile dans certains cas, comme la construction d'un système distribué qui utilise un nom de domaine cohérent sur plusieurs hôtes.

source: Added the *domain* keyword.
fr: ajout du mot-clé *domaine*.

source: The remaining functions are part of the legacy (``Compat32``) email API. There is no need to directly use these with the new API, since the parsing and formatting they provide is done automatically by the header parsing machinery of the new API.
fr: Les fonctions restantes font partie de l'ancienne API de messagerie (``Compat32``). Il n'est pas nécessaire de les utiliser directement avec la nouvelle API, car l'analyse et le formatage qu'elles fournissent sont effectués automatiquement par le mécanisme d'analyse d'en-tête de la nouvelle API.

source: Return a new string with backslashes in *str* replaced by two backslashes, and double quotes replaced by backslash-double quote.
fr: Renvoie une nouvelle chaîne avec les barres obliques inverses (*backslash*) dans *str* remplacées par deux barres obliques inverses et les guillemets doubles remplacés par des guillemets doubles échappés par une barre oblique inverse.

source: Return a new string which is an *unquoted* version of *str*. If *str* ends and begins with double quotes, they are stripped off. Likewise if *str* ends and begins with angle brackets, they are stripped off.
fr: Renvoie une nouvelle chaîne qui est une version *sans guillemets* de *str*. Si *str* se termine et commence par des guillemets doubles, ils sont supprimés. De même, si *str* est encadrée par des chevrons mathématiques, ils sont supprimés.

source: Parse address -- which should be the value of some address-containing field such as :mailheader:`To` or :mailheader:`Cc` -- into its constituent *realname* and *email address* parts. Returns a tuple of that information, unless the parse fails, in which case a 2-tuple of ``('', '')`` is returned.
fr: Analyse l'adresse – qui devrait être la valeur d'un champ contenant une adresse tel que :mailheader:`To` ou :mailheader:`Cc` – dans ses parties constituantes *realname* et *email address*. Renvoie un *n*-uplet de cette information, sauf si l'analyse échoue, alors un couple ``('', '')`` est renvoyé.

source: The inverse of :meth:`parseaddr`, this takes a 2-tuple of the form ``(realname, email_address)`` and returns the string value suitable for a :mailheader:`To` or :mailheader:`Cc` header. If the first element of *pair* is false, then the second element is returned unmodified.
fr: L'inverse de :meth:`parseaddr`, elle prend un couple de la forme ``(realname, email_address)`` et renvoie la valeur de chaîne appropriée pour un en-tête :mailheader:`To` ou :mailheader:`Cc`. Si le premier élément de *pair* s'évalue à faux, alors le deuxième élément est renvoyé sans modification.

source: Optional *charset* is the character set that will be used in the :rfc:`2047` encoding of the ``realname`` if the ``realname`` contains non-ASCII characters. Can be an instance of :class:`str` or a :class:`~email.charset.Charset`. Defaults to ``utf-8``.
fr: Le *charset* optionnel est le jeu de caractères qui est utilisé dans l'encodage :rfc:`2047` du ``realname`` si le ``realname`` contient des caractères non-ASCII. Cela peut être une instance de :class:`str` ou un :class:`~email.charset.Charset`. La valeur par défaut est ``utf-8``.

source: Added the *charset* option.
fr: ajout de l'option *charset*.

source: This method returns a list of 2-tuples of the form returned by ``parseaddr()``. *fieldvalues* is a sequence of header field values as might be returned by :meth:`Message.get_all <email.message.Message.get_all>`. Here's a simple example that gets all the recipients of a message::
fr: Cette méthode renvoie une liste de couples de la forme renvoyée par ``parseaddr()``. *fieldvalues* est une séquence de valeurs de champ d'en-tête pouvant être renvoyée par :meth:`Message.get_all <email.message.Message.get_all>`. Voici un exemple simple qui récupère tous les destinataires d'un message ::

source: Attempts to parse a date according to the rules in :rfc:`2822`. however, some mailers don't follow that format as specified, so :func:`parsedate` tries to guess correctly in such cases. *date* is a string containing an :rfc:`2822` date, such as ``"Mon, 20 Nov 1995 19:12:08 -0500"``. If it succeeds in parsing the date, :func:`parsedate` returns a 9-tuple that can be passed directly to :func:`time.mktime`; otherwise ``None`` will be returned. Note that indexes 6, 7, and 8 of the result tuple are not usable.
fr: Tente d'analyser une date selon les règles de la :rfc:`2822`. Cependant, certains expéditeurs ne suivent pas ce format comme spécifié, donc :func:`parsedate` fait son possible dans de tels cas. *date* est une chaîne contenant une date :rfc:`2822`, telle que ``"Mon, 20 Nov 1995 19:12:08 -0500"``. Si elle réussit à analyser la date, :func:`parsedate` renvoie un 9-uplet qui peut être passé directement à :func:`time.mktime` ; sinon ``None`` est renvoyé. Notez que les indices 6, 7 et 8 du *n*-uplet résultat ne sont pas utilisables.

source: Performs the same function as :func:`parsedate`, but returns either ``None`` or a 10-tuple; the first 9 elements make up a tuple that can be passed directly to :func:`time.mktime`, and the tenth is the offset of the date's timezone from UTC (which is the official term for Greenwich Mean Time) [#]_. If the input string has no timezone, the last element of the tuple returned is ``0``, which represents UTC. Note that indexes 6, 7, and 8 of the result tuple are not usable.
fr: Effectue la même fonction que :func:`parsedate`, mais renvoie soit ``None`` ou un 10-uplet ; les 9 premiers éléments constituent un *n*-uplet qui peut être passé directement à :func:`time.mktime`, et le dixième est le décalage du fuseau horaire de la date par rapport à UTC (qui est le terme officiel pour *Greenwich Mean Time*) [#]_. Si la chaîne d'entrée n'a pas de fuseau horaire, le dernier élément du *n*-uplet renvoyé est ``0``, qui représente l'UTC. Notez que les indices 6, 7 et 8 du *n*-uplet résultat ne sont pas utilisables.

source: The inverse of :func:`format_datetime`. Performs the same function as :func:`parsedate`, but on success returns a :mod:`~datetime.datetime`; otherwise ``ValueError`` is raised if *date* contains an invalid value such as an hour greater than 23 or a timezone offset not between -24 and 24 hours. If the input date has a timezone of ``-0000``, the ``datetime`` will be a naive ``datetime``, and if the date is conforming to the RFCs it will represent a time in UTC but with no indication of the actual source timezone of the message the date comes from. If the input date has any other valid timezone offset, the ``datetime`` will be an aware ``datetime`` with the corresponding a :class:`~datetime.timezone` :class:`~datetime.tzinfo`.
fr: L'inverse de :func:`format_datetime`. Effectue la même fonction que :func:`parsedate` mais, en cas de succès, renvoie un :mod:`~datetime.datetime` ; sinon une ``ValueError`` est levée si *date* contient une valeur invalide telle qu'une heure supérieure à 23 ou un décalage de fuseau horaire non compris entre −24 et 24 heures. Si la date d'entrée a un fuseau horaire de ``-0000``, le ``datetime`` sera un ``datetime`` naïf, et si la date est conforme aux RFC, elle représentera une heure en UTC mais sans indication du fuseau horaire source réel du message d'où provient la date. Si la date d'entrée a un autre décalage de fuseau horaire valide, le ``datetime`` sera un ``datetime`` avisé avec le :class:`~datetime.timezone` :class:`~datetime.tzinfo` adéquat.

source: Turn a 10-tuple as returned by :func:`parsedate_tz` into a UTC timestamp (seconds since the Epoch). If the timezone item in the tuple is ``None``, assume local time.
fr: Transforme un 10-uplet renvoyé par :func:`parsedate_tz` en un horodatage UTC (en secondes depuis *Epoch*). Si l'élément de fuseau horaire dans le *n*-uplet est ``None``, elle considère que l'heure est locale.

source: Returns a date string as per :rfc:`2822`, e.g.::
fr: Renvoie une chaîne de date conforme à la :rfc:`2822`, par exemple ::

source: Optional *timeval* if given is a floating point time value as accepted by :func:`time.gmtime` and :func:`time.localtime`, otherwise the current time is used.
fr: *timeval*, s'il est fourni, est une valeur de temps à virgule flottante telle qu'acceptée par :func:`time.gmtime` et :func:`time.localtime`, sinon l'heure actuelle est utilisée.

source: Optional *localtime* is a flag that when ``True``, interprets *timeval*, and returns a date relative to the local timezone instead of UTC, properly taking daylight savings time into account. The default is ``False`` meaning UTC is used.
fr: L'option *localtime* est un indicateur qui, lorsqu'il est ``True``, interprète *timeval* et renvoie une date relative au fuseau horaire local au lieu de UTC, en tenant correctement compte de l'heure d'été. La valeur par défaut est ``False``, ce qui signifie que l'UTC est utilisée.

source: Optional *usegmt* is a flag that when ``True``, outputs a date string with the timezone as an ascii string ``GMT``, rather than a numeric ``-0000``. This is needed for some protocols (such as HTTP). This only applies when *localtime* is ``False``. The default is ``False``.
fr: L'option *usegmt* est un indicateur qui, lorsqu'il est ``True``, affiche une chaîne de date avec le fuseau horaire sous la forme de la chaîne ASCII ``GMT``, plutôt qu'un ``-0000`` numérique. C'est nécessaire pour certains protocoles (tels que HTTP). Cela ne s'applique que lorsque *localtime* est ``False``. La valeur par défaut est ``False``.

source: Like ``formatdate``, but the input is a :mod:`datetime` instance. If it is a naive datetime, it is assumed to be "UTC with no information about the source timezone", and the conventional ``-0000`` is used for the timezone. If it is an aware ``datetime``, then the numeric timezone offset is used. If it is an aware timezone with offset zero, then *usegmt* may be set to ``True``, in which case the string ``GMT`` is used instead of the numeric timezone offset. This provides a way to generate standards conformant HTTP date headers.
fr: Comme ``formatdate``, mais l'entrée est une instance :mod:`datetime`. S'il s'agit d'un groupe date-heure naïf, il est considéré être « UTC sans information sur le fuseau horaire source », et le ``-0000`` conventionnel est utilisé pour le fuseau horaire. S'il s'agit d'un ``datetime`` avisé, alors le décalage numérique du fuseau horaire est utilisé. S'il s'agit d'un groupe date-heure avisé avec un décalage de fuseau horaire de zéro, alors *usegmt* peut être défini sur ``True``, la chaîne ``GMT`` est alors utilisée à la place du décalage numérique du fuseau horaire. Cela fournit un moyen de générer des en-têtes de date HTTP conformes aux normes.

source: Decode the string *s* according to :rfc:`2231`.
fr: Décode la chaîne *s* selon la :rfc:`2231`.

source: Encode the string *s* according to :rfc:`2231`. Optional *charset* and *language*, if given is the character set name and language name to use. If neither is given, *s* is returned as-is. If *charset* is given but *language* is not, the string is encoded using the empty string for *language*.
fr: Encode la chaîne *s* selon la :rfc:`2231`. *charset* et *language*, s'ils sont fournis, indiquent le jeu de caractères et le nom de la langue à utiliser. Si aucun n'est donné, *s* est renvoyé telle quelle. Si *charset* est donné mais que *language* ne l'est pas, la chaîne est encodée en utilisant la chaîne vide pour *language*.

source: When a header parameter is encoded in :rfc:`2231` format, :meth:`Message.get_param <email.message.Message.get_param>` may return a 3-tuple containing the character set, language, and value. :func:`collapse_rfc2231_value` turns this into a unicode string. Optional *errors* is passed to the *errors* argument of :class:`str`'s :func:`~str.encode` method; it defaults to ``'replace'``. Optional *fallback_charset* specifies the character set to use if the one in the :rfc:`2231` header is not known by Python; it defaults to ``'us-ascii'``.
fr: Lorsqu'un paramètre d'en-tête est encodé au format :rfc:`2231`, :meth:`Message.get_param <email.message.Message.get_param>` peut renvoyer un triplet contenant le jeu de caractères, la langue et la valeur. :func:`collapse_rfc2231_value` transforme cela en une chaîne Unicode. *errors* (facultatif) est passé à l'argument *errors* de la méthode :func:`~str.encode` de :class:`str` ; sa valeur par défaut est ``'replace'``. *fallback_charset* (facultatif) spécifie le jeu de caractères à utiliser si celui de l'en-tête :rfc:`2231` n'est pas connu de Python ; sa valeur par défaut est ``'us-ascii'``.

source: For convenience, if the *value* passed to :func:`collapse_rfc2231_value` is not a tuple, it should be a string and it is returned unquoted.
fr: Pour plus de commodité, si la *valeur* transmise à :func:`collapse_rfc2231_value` n'est pas un *n*-uplet, ce doit être une chaîne et elle est renvoyée sans guillemets.

source: Decode parameters list according to :rfc:`2231`. *params* is a sequence of 2-tuples containing elements of the form ``(content-type, string-value)``.
fr: Décode la liste des paramètres selon la :rfc:`2231`. *params* est une séquence de couples contenant des éléments de la forme ``(content-type, string-value)``.

source: Footnotes
fr: Notes

source: Note that the sign of the timezone offset is the opposite of the sign of the ``time.timezone`` variable for the same timezone; the latter variable follows the POSIX standard while this module follows :rfc:`2822`.
fr: Notez que le signe du décalage horaire est l'opposé du signe de la variable ``time.timezone`` pour le même fuseau horaire ; cette dernière variable suit la norme POSIX tandis que ce module suit la :rfc:`2822`.
