Repository: python/python-docs-fr
Catalog: library/email.compat32-message.po
Languages: fr

source: Return the ``charset`` parameter of the :mailheader:`Content-Type` header, coerced to lower case. If there is no :mailheader:`Content-Type` header, or if that header has no ``charset`` parameter, *failobj* is returned.
fr: Renvoie le paramètre ``charset`` de l'en-tête :mailheader:`Content-Type`, mis en minuscules. S'il n'y a pas d'en-tête :mailheader:`Content-Type`, ou si cet en-tête n'a pas de paramètre ``charset``, *failobj* est renvoyé.

source: Note that this method differs from :meth:`get_charset` which returns the :class:`~email.charset.Charset` instance for the default encoding of the message body.
fr: Notez que cette méthode diffère de :meth:`get_charset` qui renvoie l'instance :class:`~email.charset.Charset` avec l'encodage par défaut du corps du message.

source: Return a list containing the character set names in the message. If the message is a :mimetype:`multipart`, then the list will contain one element for each subpart in the payload, otherwise, it will be a list of length 1.
fr: Renvoie une liste contenant les noms des jeux de caractères dans le message. Si le message est un :mimetype:`multipart`, alors la liste contient un élément pour chaque sous-partie dans la charge utile, sinon, c'est une liste de longueur 1.

source: Each item in the list will be a string which is the value of the ``charset`` parameter in the :mailheader:`Content-Type` header for the represented subpart. However, if the subpart has no :mailheader:`Content-Type` header, no ``charset`` parameter, or is not of the :mimetype:`text` main MIME type, then that item in the returned list will be *failobj*.
fr: Chaque élément de la liste est une chaîne qui est la valeur du paramètre ``charset`` dans l'en-tête :mailheader:`Content-Type` pour la sous-partie représentée. Cependant, si la sous-partie n'a pas d'en-tête :mailheader:`Content-Type`, pas de paramètre ``charset``, ou n'est pas du type MIME principal :mimetype:`text`, alors cet élément dans la liste renvoyée est *failobj*.

source: Return the lowercased value (without parameters) of the message's :mailheader:`Content-Disposition` header if it has one, or ``None``. The possible values for this method are *inline*, *attachment* or ``None`` if the message follows :rfc:`2183`.
fr: Renvoie la valeur en minuscules (sans paramètres) de l'en-tête :mailheader:`Content-Disposition` du message s'il en a un, ou ``None``. Les valeurs possibles pour cette méthode sont *inline*, *attachment* ou ``None`` si le message suit la :rfc:`2183`.

source: The :meth:`walk` method is an all-purpose generator which can be used to iterate over all the parts and subparts of a message object tree, in depth-first traversal order. You will typically use :meth:`walk` as the iterator in a ``for`` loop; each iteration returns the next subpart.
fr: La méthode :meth:`walk` est un générateur polyvalent qui peut être utilisé pour itérer sur toutes les parties et sous-parties d'une arborescence d'objets de message, dans l'ordre de parcours en profondeur d'abord. Vous utiliserez généralement :meth:`walk` comme itérateur dans une boucle ``for`` ; chaque itération renvoie la sous-partie suivante.

source: Here's an example that prints the MIME type of every part of a multipart message structure:
fr: Voici un exemple qui imprime le type MIME de chaque partie d'une structure de message en plusieurs parties :

source: ``walk`` iterates over the subparts of any part where :meth:`is_multipart` returns ``True``, even though ``msg.get_content_maintype() == 'multipart'`` may return ``False``. We can see this in our example by making use of the ``_structure`` debug helper function:
fr: ``walk`` itère sur les sous-parties de toute partie où :meth:`is_multipart` renvoie ``True``, même si ``msg.get_content_maintype() == 'multipart'`` peut renvoyer ``False``. Nous pouvons le voir dans notre exemple en utilisant la fonction d'aide au débogage ``_structure`` :

source: Here the ``message`` parts are not ``multiparts``, but they do contain subparts. ``is_multipart()`` returns ``True`` and ``walk`` descends into the subparts.
fr: Ici, les parties ``message`` ne sont pas des ``multiparts``, mais elles contiennent des sous-parties. ``is_multipart()`` renvoie ``True`` et ``walk`` descend dans les sous-parties.

source: :class:`Message` objects can also optionally contain two instance attributes, which can be used when generating the plain text of a MIME message.
fr: Les objets :class:`Message` peuvent aussi éventuellement contenir deux attributs d'instance, qui peuvent être utilisés lors de la génération du texte brut d'un message MIME.

source: The format of a MIME document allows for some text between the blank line following the headers, and the first multipart boundary string. Normally, this text is never visible in a MIME-aware mail reader because it falls outside the standard MIME armor. However, when viewing the raw text of the message, or when viewing the message in a non-MIME aware reader, this text can become visible.
fr: Le format d'un document MIME permet d'insérer du texte entre la ligne vide suivant les en-têtes et la première chaîne de délimitation en plusieurs parties. Normalement, ce texte n'est jamais visible dans un lecteur de courrier compatible MIME car il ne fait pas partie du cadre MIME standard. Toutefois, lors de l'affichage du texte brut du message ou lors de l'affichage du message dans un lecteur non compatible MIME, ce texte peut devenir visible.

source: The *preamble* attribute contains this leading extra-armor text for MIME documents. When the :class:`~email.parser.Parser` discovers some text after the headers but before the first boundary string, it assigns this text to the message's *preamble* attribute. When the :class:`~email.generator.Generator` is writing out the plain text representation of a MIME message, and it finds the message has a *preamble* attribute, it will write this text in the area between the headers and the first boundary. See :mod:`email.parser` and :mod:`email.generator` for details.
fr: L'attribut *preamble* contient ce texte hors-cadre de tête pour les documents MIME. Lorsque :class:`~email.parser.Parser` découvre du texte après les en-têtes mais avant la première chaîne de délimitation, il attribue ce texte à l'attribut *preamble* du message. Lorsque :class:`~email.generator.Generator` écrit la représentation en texte brut d'un message MIME, et qu'il trouve que le message a un attribut *preamble*, il écrit ce texte dans la zone entre les en-têtes et la première frontière. Voir :mod:`email.parser` et :mod:`email.generator` pour plus de détails.

source: Note that if the message object has no preamble, the *preamble* attribute will be ``None``.
fr: Notez que si l'objet message n'a pas de préambule, l'attribut *preamble* est ``None``.

source: The *epilogue* attribute acts the same way as the *preamble* attribute, except that it contains text that appears between the last boundary and the end of the message.
fr: L'attribut *epilogue* agit de la même manière que l'attribut *preamble*, sauf qu'il contient du texte qui apparaît entre la dernière limite et la fin du message.

source: You do not need to set the epilogue to the empty string in order for the :class:`~email.generator.Generator` to print a newline at the end of the file.
fr: Vous n'avez pas besoin de définir l'épilogue sur la chaîne vide pour que :class:`~email.generator.Generator` imprime une nouvelle ligne à la fin du fichier.

source: The *defects* attribute contains a list of all the problems found when parsing this message. See :mod:`email.errors` for a detailed description of the possible parsing defects.
fr: L'attribut *defects* contient une liste de tous les problèmes rencontrés lors de l'analyse de ce message. Voir :mod:`email.errors` pour une description détaillée des défauts d'analyse possibles.
