Repository: python/python-docs-fr
Catalog: library/email.examples.po
Languages: fr

source: :mod:`email`: Examples
fr: :mod:`email`: Exemples

source: Here are a few examples of how to use the :mod:`email` package to read, write, and send simple email messages, as well as more complex MIME messages.
fr: Cette page contient quelques exemples de l'utilisation du package :mod:`email` pour lire, écrire, et envoyer de simples messages mail, ainsi que des messages MIME plus complexes.

source: First, let's see how to create and send a simple text message (both the text content and the addresses may contain unicode characters):
fr: Premièrement, regardons comment créer et envoyer un message avec simplement du texte (le contenu textuel et les adresses peuvent tous deux contenir des caractères Unicodes) :

source: Parsing :rfc:`822` headers can easily be done by the using the classes from the :mod:`~email.parser` module:
fr: Analyser des entêtes :rfc:`822` peut être aisément réalisé en utilisant les classes du module :mod:`~email.parser` :

source: Here's an example of how to send a MIME message containing a bunch of family pictures that may be residing in a directory:
fr: Voici un exemple de l'envoi d'un message MIME contenant une série de photos de famille qui sont stockés ensemble dans un dossier :

source: Here's an example of how to send the entire contents of a directory as an email message: [1]_
fr: Voici un exemple d'envoi du contenu d'un dossier entier en tant que message mail : [1]_

source: Here's an example of how to unpack a MIME message like the one above, into a directory of files:
fr: Voici un exemple de comment décomposer un message MIME comme celui ci-dessus en tant que fichiers dans un dossier :

source: Here's an example of how to create an HTML message with an alternative plain text version. To make things a bit more interesting, we include a related image in the html part, and we save a copy of what we are going to send to disk, as well as sending it.
fr: Voici un exemple de création d'un message HTML avec une version en texte comme alternative. Pour rendre les choses un peu plus intéressantes, nous incluons aussi une image dans la partie HTML, nous sauvons une copie du message sur le disque, et nous l'envoyons.

source: If we were sent the message from the last example, here is one way we could process it:
fr: Si on nous avait envoyé le message de l'exemple précédent, voici la manière avec laquelle nous pourrions le traiter :

source: Up to the prompt, the output from the above is:
fr: La sortie textuelle du code ci dessus est :

source: Footnotes
fr: Notes

source: Thanks to Matthew Dixon Cowles for the original inspiration and examples.
fr: Merci à Matthew Dixon Cowles pour l'inspiration originale et les exemples.
