Repository: python/python-docs-fr
Catalog: library/email.policy.po
Languages: fr

source: **Source code:** :source:`Lib/email/policy.py`
fr: **Code source :** :source:`Lib/email/policy.py`

source: The :mod:`email` package's prime focus is the handling of email messages as described by the various email and MIME RFCs. However, the general format of email messages (a block of header fields each consisting of a name followed by a colon followed by a value, the whole block followed by a blank line and an arbitrary 'body'), is a format that has found utility outside of the realm of email. Some of these uses conform fairly closely to the main email RFCs, some do not. Even when working with email, there are times when it is desirable to break strict compliance with the RFCs, such as generating emails that interoperate with email servers that do not themselves follow the standards, or that implement extensions you want to use in ways that violate the standards.
fr: Le principal objectif du paquet :mod:`email` est la gestion des messages électroniques comme décrit par les diverses RFC de messagerie et MIME. Cependant, le format général des messages électroniques (un bloc de champs d'en-tête composés chacun d'un nom suivi de deux-points suivi d'une valeur, le bloc entier suivi d'une ligne vide et d'un « corps » arbitraire), est un format qui a trouvé son utilité en dehors du domaine du courrier électronique. Certaines de ces utilisations sont assez conformes aux principales RFC de messagerie, d'autres non. Même lorsque vous travaillez avec des e-mails, il est parfois souhaitable de ne pas respecter strictement les RFC, par exemple en générant des e-mails qui interagissent avec des serveurs de messagerie qui ne respectent pas eux-mêmes les normes ou qui implémentent des extensions que vous souhaitez utiliser d'une manière qui enfreint les normes.

source: Policy objects give the email package the flexibility to handle all these disparate use cases.
fr: Les objets de définition de politique donnent au paquet de messagerie la flexibilité nécessaire pour gérer tous ces cas d'utilisation disparates.

source: A :class:`Policy` object encapsulates a set of attributes and methods that control the behavior of various components of the email package during use. :class:`Policy` instances can be passed to various classes and methods in the email package to alter the default behavior. The settable values and their defaults are described below.
fr: Un objet :class:`Policy` encapsule un ensemble d'attributs et de méthodes qui contrôlent le comportement de divers composants du paquet de messagerie lors de son utilisation. Les instances :class:`Policy` peuvent être transmises à diverses classes et méthodes dans le paquet de courrier électronique pour modifier le comportement par défaut. Les valeurs réglables et leurs valeurs par défaut sont décrites ci-dessous.

source: There is a default policy used by all classes in the email package. For all of the :mod:`~email.parser` classes and the related convenience functions, and for the :class:`~email.message.Message` class, this is the :class:`Compat32` policy, via its corresponding pre-defined instance :const:`compat32`. This policy provides for complete backward compatibility (in some cases, including bug compatibility) with the pre-Python3.3 version of the email package.
fr: Il existe une politique par défaut utilisée par toutes les classes dans le paquet de messagerie. Pour toutes les classes :mod:`~email.parser` et les fonctions pratiques associées, et pour la classe :class:`~email.message.Message`, il s'agit de la politique :class:`Compat32`, via son instance correspondante prédéfinie :const:`compat32`. Cette politique fournit une rétrocompatibilité complète (dans certains cas, y compris la compatibilité des bogues) avec la version pré-Python3.3 du paquet de messagerie.

source: This default value for the *policy* keyword to :class:`~email.message.EmailMessage` is the :class:`EmailPolicy` policy, via its pre-defined instance :data:`~default`.
fr: Cette valeur par défaut pour le paramètre nommé *policy* de :class:`~email.message.EmailMessage` est la politique :class:`EmailPolicy`, via son instance prédéfinie :data:`~default`.

source: When a :class:`~email.message.Message` or :class:`~email.message.EmailMessage` object is created, it acquires a policy. If the message is created by a :mod:`~email.parser`, a policy passed to the parser will be the policy used by the message it creates. If the message is created by the program, then the policy can be specified when it is created. When a message is passed to a :mod:`~email.generator`, the generator uses the policy from the message by default, but you can also pass a specific policy to the generator that will override the one stored on the message object.
fr: Lorsqu'un objet :class:`~email.message.Message` ou :class:`~email.message.EmailMessage` est créé, il acquiert une politique. Si le message est créé par un :mod:`~email.parser`, la politique transmise à l'analyseur est la politique utilisée par le message qu'il crée. Si le message est créé par le programme, la stratégie peut être spécifiée lors de sa création. Lorsqu'un message est passé à un :mod:`~email.generator`, le générateur utilise la politique du message par défaut, mais vous pouvez également passer une politique spécifique au générateur qui remplace celle stockée sur l'objet message.

source: The default value for the *policy* keyword for the :mod:`email.parser` classes and the parser convenience functions **will be changing** in a future version of Python. Therefore you should **always specify explicitly which policy you want to use** when calling any of the classes and functions described in the :mod:`~email.parser` module.
fr: La valeur par défaut du paramètre nommé *policy* pour les classes :mod:`email.parser` et les fonctions pratiques de l'analyseur **va changer** dans une future version de Python. Par conséquent, vous devez **toujours spécifier explicitement la stratégie que vous souhaitez utiliser** lors de l'appel de l'une des classes et fonctions décrites dans le module :mod:`~email.parser`.

source: The first part of this documentation covers the features of :class:`Policy`, an :term:`abstract base class` that defines the features that are common to all policy objects, including :const:`compat32`. This includes certain hook methods that are called internally by the email package, which a custom policy could override to obtain different behavior. The second part describes the concrete classes :class:`EmailPolicy` and :class:`Compat32`, which implement the hooks that provide the standard behavior and the backward compatible behavior and features, respectively.
fr: La première partie de cette documentation couvre les fonctionnalités de :class:`Policy`, une :term:`classe mère abstraite <abstract base class>` qui définit les fonctionnalités communes à tous les objets de stratégie, y compris :const:`compat32`. Cela inclut certaines méthodes automatiques (*hooks* en anglais) appelées en interne par le paquet de messagerie, qu'une stratégie personnalisée peut remplacer pour obtenir un comportement différent. La deuxième partie décrit les classes concrètes :class:`EmailPolicy` et :class:`Compat32`, qui implémentent les points d'entrée automatiques qui fournissent respectivement le comportement standard et le comportement et les fonctionnalités rétrocompatibles.

source: :class:`Policy` instances are immutable, but they can be cloned, accepting the same keyword arguments as the class constructor and returning a new :class:`Policy` instance that is a copy of the original but with the specified attributes values changed.
fr: Les instances :class:`Policy` sont immuables, mais elles peuvent être clonées, en acceptant les mêmes arguments nommés que le constructeur de classe et en renvoyant une nouvelle instance :class:`Policy` qui est une copie de l'original mais avec les valeurs d'attributs spécifiées modifiées.

source: As an example, the following code could be used to read an email message from a file on disk and pass it to the system ``sendmail`` program on a Unix system:
fr: Par exemple, le code suivant peut être utilisé pour lire un message électronique à partir d'un fichier sur le disque et le transmettre au programme système ``sendmail`` sur un système Unix :

source: Here we are telling :class:`~email.generator.BytesGenerator` to use the RFC correct line separator characters when creating the binary string to feed into ``sendmail's`` ``stdin``, where the default policy would use ``\n`` line separators.
fr: Ici, nous disons à :class:`~email.generator.BytesGenerator` d'utiliser les caractères de séparation de ligne corrects de la RFC lors de la création de la chaîne binaire à fournir à ``stdin`` de ``sendmail``, où la politique par défaut utiliserait ``\n`` comme séparateur de ligne.

source: Some email package methods accept a *policy* keyword argument, allowing the policy to be overridden for that method. For example, the following code uses the :meth:`~email.message.Message.as_bytes` method of the *msg* object from the previous example and writes the message to a file using the native line separators for the platform on which it is running::
fr: Certaines méthodes du paquet de messagerie acceptent un argument nommé *policy*, permettant à la politique d'être remplacée pour cette méthode. Par exemple, le code suivant utilise la méthode :meth:`~email.message.Message.as_bytes` de l'objet *msg* de l'exemple précédent et écrit le message dans un fichier en utilisant les séparateurs de ligne natifs de la plate-forme sur laquelle il est en cours d'exécution ::

source: Policy objects can also be combined using the addition operator, producing a policy object whose settings are a combination of the non-default values of the summed objects::
fr: Les objets de stratégie peuvent également être combinés à l'aide de l'opérateur d'addition, produisant un objet de stratégie dont les paramètres sont une combinaison des objets additionnées (en ne prenant en compte que les paramètres données explicitement) ::

source: This operation is not commutative; that is, the order in which the objects are added matters. To illustrate::
fr: Cette opération n'est pas commutative ; c'est-à-dire que l'ordre dans lequel les objets sont ajoutés est important. Pour illustrer ::

source: This is the :term:`abstract base class` for all policy classes. It provides default implementations for a couple of trivial methods, as well as the implementation of the immutability property, the :meth:`clone` method, and the constructor semantics.
fr: C'est la :term:`classe mère abstraite <abstract base class>` pour toutes les classes de définition de politique. Elle fournit des implémentations par défaut pour quelques méthodes triviales, ainsi que l'implémentation de la propriété d'immutabilité, la méthode :meth:`clone` et la sémantique du constructeur.

source: The constructor of a policy class can be passed various keyword arguments. The arguments that may be specified are any non-method properties on this class, plus any additional non-method properties on the concrete class. A value specified in the constructor will override the default value for the corresponding attribute.
fr: Le constructeur d'une classe de définition de politique peut recevoir divers arguments nommés. Les arguments qui peuvent être spécifiés sont toutes les propriétés qui ne sont pas des méthodes sur cette classe, plus toutes les propriétés qui ne sont pas des méthodes supplémentaires sur la classe concrète. Une valeur spécifiée dans le constructeur remplace la valeur par défaut de l'attribut correspondant.

source: This class defines the following properties, and thus values for the following may be passed in the constructor of any policy class:
fr: Cette classe définit les propriétés suivantes, et ainsi les valeurs des éléments suivants peuvent être passées dans le constructeur de n'importe quelle classe de définition de politique :

source: The maximum length of any line in the serialized output, not counting the end of line character(s). Default is 78, per :rfc:`5322`. A value of ``0`` or :const:`None` indicates that no line wrapping should be done at all.
fr: La longueur maximale de toute ligne dans la sortie sérialisée, sans compter le(s) caractère(s) de fin de ligne. La valeur par défaut est 78, selon la :rfc:`5322`. Une valeur de ``0`` ou :const:`None` indique qu'aucun retour à la ligne ne doit être fait.

source: The string to be used to terminate lines in serialized output. The default is ``\n`` because that's the internal end-of-line discipline used by Python, though ``\r\n`` is required by the RFCs.
fr: La chaîne à utiliser pour terminer les lignes dans la sortie sérialisée. La valeur par défaut est ``\n`` car c'est la définition interne de fin de ligne utilisée par Python, bien que ``\r\n`` soit requis par les RFC.

source: Controls the type of Content Transfer Encodings that may be or are required to be used. The possible values are:
fr: Contrôle le type d'encodage de contenu qui peut ou doit être utilisé. Les valeurs possibles sont :

source: all data must be "7 bit clean" (ASCII-only). This means that where necessary data will be encoded using either quoted-printable or base64 encoding.
fr: toutes les données doivent être « complétement 7 bits » (ASCII uniquement). Cela signifie que si nécessaire, les données seront encodées à l'aide de l'encodage *quoted-printable* ou *base64*.

source: data is not constrained to be 7 bit clean. Data in headers is still required to be ASCII-only and so will be encoded (see :meth:`fold_binary` and :attr:`~EmailPolicy.utf8` below for exceptions), but body parts may use the ``8bit`` CTE.
fr: les données ne sont pas contraintes d'être uniquement sur 7 bits. Les données dans les en-têtes doivent toujours être en ASCII uniquement et seront donc encodées (voir :meth:`fold_binary` et :attr:`~EmailPolicy.utf8` ci-dessous pour les exceptions), mais les parties du corps peuvent utiliser le ``8bit`` CTE.

source: A ``cte_type`` value of ``8bit`` only works with ``BytesGenerator``, not ``Generator``, because strings cannot contain binary data. If a ``Generator`` is operating under a policy that specifies ``cte_type=8bit``, it will act as if ``cte_type`` is ``7bit``.
fr: Une valeur ``cte_type`` de ``8bit`` ne fonctionne qu'avec ``BytesGenerator``, et pas avec ``Generator`` car les chaînes ne peuvent pas contenir de données binaires. Si un ``Generator`` fonctionne sous une politique qui spécifie ``cte_type=8bit``, il agit comme si ``cte_type`` était ``7bit``.

source: If :const:`True`, any defects encountered will be raised as errors. If :const:`False` (the default), defects will be passed to the :meth:`register_defect` method.
fr: Si :const:`True`, tous les défauts rencontrés sont signalés comme des erreurs. Si :const:`False` (la valeur par défaut), les défauts sont passés à la méthode :meth:`register_defect`.

source: If :const:`True`, lines starting with *"From "* in the body are escaped by putting a ``>`` in front of them. This parameter is used when the message is being serialized by a generator. Default: :const:`False`.
fr: Si :const:`True`, les lignes commençant par *"From "* dans le corps sont échappées en mettant un ``>`` devant elles. Ce paramètre est utilisé lorsque le message est sérialisé par un générateur. Par défaut, vaut :const:`False`.

source: A factory function for constructing a new empty message object. Used by the parser when building messages. Defaults to ``None``, in which case :class:`~email.message.Message` is used.
fr: Une fonction de fabrique pour construire un nouvel objet de message vide. Utilisé par l'analyseur lors de la construction des messages. La valeur par défaut est ``None``, :class:`~email.message.Message` est alors utilisé.

source: The following :class:`Policy` method is intended to be called by code using the email library to create policy instances with custom settings:
fr: La méthode :class:`Policy` suivante est destinée à être appelée par le code à l'aide de la bibliothèque de messagerie pour créer des instances de stratégie avec des paramètres personnalisés :

source: Return a new :class:`Policy` instance whose attributes have the same values as the current instance, except where those attributes are given new values by the keyword arguments.
fr: Renvoie une nouvelle instance de :class:`Policy` dont les attributs ont les mêmes valeurs que l'instance actuelle, sauf si ces attributs reçoivent de nouvelles valeurs par les arguments nommés.

source: The remaining :class:`Policy` methods are called by the email package code, and are not intended to be called by an application using the email package. A custom policy must implement all of these methods.
fr: Les méthodes :class:`Policy` restantes sont appelées par le code du paquet de messagerie et ne sont pas destinées à être appelées par une application utilisant le paquet de messagerie. Une stratégie personnalisée doit implémenter toutes ces méthodes.

source: Handle a *defect* found on *obj*. When the email package calls this method, *defect* will always be a subclass of :class:`~email.errors.Defect`.
fr: Gère un *defect* trouvé sur *obj*. Lorsque le paquet de messagerie appelle cette méthode, *defect* est toujours une sous-classe de :class:`~email.errors.Defect`.

source: The default implementation checks the :attr:`raise_on_defect` flag. If it is ``True``, *defect* is raised as an exception. If it is ``False`` (the default), *obj* and *defect* are passed to :meth:`register_defect`.
fr: L'implémentation par défaut vérifie le drapeau :attr:`raise_on_defect`. Si c'est ``True``, *defect* est levé comme une exception. Si c'est ``False`` (par défaut), *obj* et *defect* sont passés à :meth:`register_defect`.

source: Register a *defect* on *obj*. In the email package, *defect* will always be a subclass of :class:`~email.errors.Defect`.
fr: Enregistre un *defect* sur *obj*. Dans le paquet de messagerie, *defect* sera toujours une sous-classe de :class:`~email.errors.Defect`.

source: The default implementation calls the ``append`` method of the ``defects`` attribute of *obj*. When the email package calls :attr:`handle_defect`, *obj* will normally have a ``defects`` attribute that has an ``append`` method. Custom object types used with the email package (for example, custom ``Message`` objects) should also provide such an attribute, otherwise defects in parsed messages will raise unexpected errors.
fr: L'implémentation par défaut appelle la méthode ``append`` de l'attribut ``defects`` de *obj*. Lorsque le paquet de courrier électronique appelle :attr:`handle_defect`, *obj* a normalement un attribut ``defects`` qui a une méthode ``append``. Les types d'objets personnalisés utilisés avec le paquet de messagerie (par exemple, les objets ``Message`` personnalisés) doivent également fournir un tel attribut, sinon les défauts dans les messages analysés généreront des erreurs inattendues.

source: Return the maximum allowed number of headers named *name*.
fr: Renvoie le nombre maximal autorisé d'en-têtes nommés *name*.

source: Called when a header is added to an :class:`~email.message.EmailMessage` or :class:`~email.message.Message` object. If the returned value is not ``0`` or ``None``, and there are already a number of headers with the name *name* greater than or equal to the value returned, a :exc:`ValueError` is raised.
fr: Appelé lorsqu'un en-tête est ajouté à un objet :class:`~email.message.EmailMessage` ou :class:`~email.message.Message`. Si la valeur renvoyée n'est pas ``0`` ou ``None``, et qu'il y a déjà un certain nombre d'en-têtes avec le nom *name* supérieur ou égal à la valeur renvoyée, une :exc:`ValueError` est levée.

source: Because the default behavior of ``Message.__setitem__`` is to append the value to the list of headers, it is easy to create duplicate headers without realizing it. This method allows certain headers to be limited in the number of instances of that header that may be added to a ``Message`` programmatically. (The limit is not observed by the parser, which will faithfully produce as many headers as exist in the message being parsed.)
fr: Parce que le comportement par défaut de ``Message.__setitem__`` est d'ajouter la valeur à la liste des en-têtes, il est facile de créer des en-têtes en double sans s'en rendre compte. Cette méthode permet à certains en-têtes d'être limités dans le nombre d'instances de cet en-tête qui peuvent être ajoutées à un ``Message`` par programme (la limite n'est pas respectée par l'analyseur, qui produit fidèlement autant d'en-têtes qu'il en existe dans le message analysé).

source: The default implementation returns ``None`` for all header names.
fr: L'implémentation par défaut renvoie ``None`` pour tous les noms d'en-tête.

source: The email package calls this method with a list of strings, each string ending with the line separation characters found in the source being parsed. The first line includes the field header name and separator. All whitespace in the source is preserved. The method should return the ``(name, value)`` tuple that is to be stored in the ``Message`` to represent the parsed header.
fr: Le paquet de courrier électronique appelle cette méthode avec une liste de chaînes, chaque chaîne se terminant par les caractères de séparation de ligne trouvés dans la source analysée. La première ligne comprend le nom de l'en-tête de champ et le séparateur. Tous les espaces blancs dans la source sont préservés. La méthode doit renvoyer le couple ``(name, value)`` qui doit être stocké dans le ``Message`` pour représenter l'en-tête analysé.

source: If an implementation wishes to retain compatibility with the existing email package policies, *name* should be the case preserved name (all characters up to the '``:``' separator), while *value* should be the unfolded value (all line separator characters removed, but whitespace kept intact), stripped of leading whitespace.
fr: Si une implémentation souhaite conserver la compatibilité avec les politiques de paquet de messagerie existantes, *name* doit être le nom préservé de la casse (tous les caractères jusqu'au séparateur ``:``), tandis que *value* doit être la valeur dépliée (c.-à-d. tous les caractères de séparation de ligne supprimés, mais les espaces blancs conservés intacts), dépouillés des espaces blancs de tête.

source: *sourcelines* may contain surrogateescaped binary data.
fr: *sourcelines* peut contenir des données binaires échappées de substitution.

source: There is no default implementation
fr: Il n'y a pas d'implémentation par défaut

source: The email package calls this method with the name and value provided by the application program when the application program is modifying a ``Message`` programmatically (as opposed to a ``Message`` created by a parser). The method should return the ``(name, value)`` tuple that is to be stored in the ``Message`` to represent the header.
fr: Le paquet de courrier électronique appelle cette méthode avec le nom et la valeur fournis par le programme d'application lorsque le programme d'application modifie un ``Message`` par programme (par opposition à un ``Message`` créé par un analyseur). La méthode doit renvoyer le couple ``(name, value)`` qui doit être stocké dans le ``Message`` pour représenter l'en-tête.

source: If an implementation wishes to retain compatibility with the existing email package policies, the *name* and *value* should be strings or string subclasses that do not change the content of the passed in arguments.
fr: Si une implémentation souhaite conserver la compatibilité avec les politiques existantes du paquet de messagerie, le *name* et la *value* doivent être des chaînes ou des sous-classes de chaînes qui ne modifient pas le contenu des arguments transmis.
