Repository: python/python-docs-fr
Catalog: library/email.contentmanager.po
Languages: fr

source: **Source code:** :source:`Lib/email/contentmanager.py`
fr: **Code source :** :source:`Lib/email/contentmanager.py`

source: Base class for content managers. Provides the standard registry mechanisms to register converters between MIME content and other representations, as well as the ``get_content`` and ``set_content`` dispatch methods.
fr: Classe mère pour les gestionnaires de contenu. Fournit les mécanismes de registre standard pour enregistrer les convertisseurs entre le contenu MIME et d'autres représentations, ainsi que les méthodes de répartition ``get_content`` et ``set_content``.

source: Look up a handler function based on the ``mimetype`` of *msg* (see next paragraph), call it, passing through all arguments, and return the result of the call. The expectation is that the handler will extract the payload from *msg* and return an object that encodes information about the extracted data.
fr: Recherche une fonction de gestion en se basant sur le ``mimetype`` de *msg* (voir le paragraphe suivant), l'appelle en lui passant tous les arguments et renvoie le résultat de l'appel. Le gestionnaire doit extraire la charge utile de *msg* et renvoyer un objet qui encode les informations relatives aux données extraites.

source: To find the handler, look for the following keys in the registry, stopping with the first one found:
fr: Pour trouver le gestionnaire, recherche les clés suivantes dans le registre, en s'arrêtant à la première trouvée :

source: the string representing the full MIME type (``maintype/subtype``)
fr: une chaîne représentant le type MIME complet (``maintype/subtype``) ;

source: the string representing the ``maintype``
fr: une chaîne représentant le ``maintype`` ;

source: the empty string
fr: une chaîne vide.

source: If none of these keys produce a handler, raise a :exc:`KeyError` for the full MIME type.
fr: Si aucune de ces clés ne produit de gestionnaire, lève une :exc:`KeyError` pour le type MIME complet.

source: If the ``maintype`` is ``multipart``, raise a :exc:`TypeError`; otherwise look up a handler function based on the type of *obj* (see next paragraph), call :meth:`~email.message.EmailMessage.clear_content` on the *msg*, and call the handler function, passing through all arguments. The expectation is that the handler will transform and store *obj* into *msg*, possibly making other changes to *msg* as well, such as adding various MIME headers to encode information needed to interpret the stored data.
fr: Si le ``maintype`` est ``multipart``, lève une :exc:`TypeError` ; sinon recherche une fonction de gestion en se basant sur le type de *obj* (voir le paragraphe suivant), appelle :meth:`~email.message.EmailMessage.clear_content` sur le *msg* et appelle la fonction de gestion en lui passant tous les arguments. Le gestionnaire doit transformer et stocker *obj* en *msg*, apportant éventuellement d'autres modifications à *msg* également, comme l'ajout de divers en-têtes MIME pour coder les informations nécessaires à l'interprétation des données stockées.

source: To find the handler, obtain the type of *obj* (``typ = type(obj)``), and look for the following keys in the registry, stopping with the first one found:
fr: Pour trouver le gestionnaire, récupère le type de *obj* (``typ = type(obj)``) et recherche les clés suivantes dans le registre, en s'arrêtant à la première trouvée :

source: the type itself (``typ``)
fr: le type lui-même (``typ``) ;

source: the type's fully qualified name (``typ.__module__ + '.' + typ.__qualname__``).
fr: le nom complet du type (``typ.__module__ + '.' + typ.__qualname__``) ;

source: Also add a :mailheader:`MIME-Version` header if one is not present (see also :class:`.MIMEPart`).
fr: Ajoute également un en-tête :mailheader:`MIME-Version` s'il n'y en a pas (voir aussi :class:`.MIMEPart`).

source: Record the function *handler* as the handler for *key*. For the possible values of *key*, see :meth:`get_content`.
fr: Enregistre la fonction *handler* comme gestionnaire pour *key*. Pour les valeurs possibles de *key*, voir :meth:`get_content`.

source: Record *handler* as the function to call when an object of a type matching *typekey* is passed to :meth:`set_content`. For the possible values of *typekey*, see :meth:`set_content`.
fr: Enregistre *handler* comme fonction à appeler lorsqu'un objet d'un type correspondant à *typekey* est passé à :meth:`set_content`. Pour les valeurs possibles de *typekey*, voir :meth:`set_content`.

source: Content Manager Instances
fr: Instances de gestionnaires de contenus

source: Currently the email package provides only one concrete content manager, :data:`raw_data_manager`, although more may be added in the future. :data:`raw_data_manager` is the :attr:`~email.policy.EmailPolicy.content_manager` provided by :attr:`~email.policy.EmailPolicy` and its derivatives.
fr: Actuellement, le paquet *email* ne fournit qu'un seul gestionnaire de contenu concret, :data:`raw_data_manager`, bien que d'autres puissent être ajoutés à l'avenir. :data:`raw_data_manager` est le :attr:`~email.policy.EmailPolicy.content_manager` fourni par :attr:`~email.policy.EmailPolicy` et ses dérivés.

source: This content manager provides only a minimum interface beyond that provided by :class:`~email.message.Message` itself: it deals only with text, raw byte strings, and :class:`~email.message.Message` objects. Nevertheless, it provides significant advantages compared to the base API: ``get_content`` on a text part will return a unicode string without the application needing to manually decode it, ``set_content`` provides a rich set of options for controlling the headers added to a part and controlling the content transfer encoding, and it enables the use of the various ``add_`` methods, thereby simplifying the creation of multipart messages.
fr: Ce gestionnaire de contenu ne fournit qu'une interface minimale au-delà de celle fournie par :class:`~email.message.Message` lui-même : il prend seulement en charge le texte, les chaînes d'octets brutes et les objets :class:`~email.message.Message`. Néanmoins, il offre des avantages significatifs par rapport à l'API de base : ``get_content`` sur une partie de texte renvoie une chaîne Unicode sans que l'application ait besoin de la décoder manuellement, ``set_content`` fournit de nombreuses options pour contrôler les en-têtes ajoutés à une partie et l'encodage du transfert de contenu, et il permet l'utilisation des différentes méthodes ``add_``, ce qui simplifie la création de messages en plusieurs parties.

source: Return the payload of the part as either a string (for ``text`` parts), an :class:`~email.message.EmailMessage` object (for ``message/rfc822`` parts), or a ``bytes`` object (for all other non-multipart types). Raise a :exc:`KeyError` if called on a ``multipart``. If the part is a ``text`` part and *errors* is specified, use it as the error handler when decoding the payload to unicode. The default error handler is ``replace``.
fr: Renvoie la charge utile de la partie sous la forme d'une chaîne (pour les parties ``text``), d'un objet :class:`~email.message.EmailMessage` (pour les parties ``message/rfc822``) ou d'un objet ``bytes`` (pour tous les autres types à l'exception de *multipart*). Lève une :exc:`KeyError` si cette méthode est appelée sur un ``multipart``. S'il s'agit d'une partie ``text`` et que *errors* est spécifié, ce paramètre est utilisé comme gestionnaire d'erreurs lors du décodage de la charge utile en Unicode. Le gestionnaire d'erreurs par défaut est ``replace``.

source: Add headers and payload to *msg*:
fr: Ajoute des en-têtes et une charge utile à *msg* :

source: Add a :mailheader:`Content-Type` header with a ``maintype/subtype`` value.
fr: Ajoute un en-tête :mailheader:`Content-Type` avec une valeur ``maintype/subtype``.

source: For ``str``, set the MIME ``maintype`` to ``text``, and set the subtype to *subtype* if it is specified, or ``plain`` if it is not.
fr: Pour ``str``, définit le ``maintype`` MIME à ``text`` et définit le sous-type à *subtype* s'il est spécifié, ou à ``plain`` s'il ne l'est pas.

source: For ``bytes``, use the specified *maintype* and *subtype*, or raise a :exc:`TypeError` if they are not specified.
fr: Pour ``bytes``, utilise les *maintype* et *subtype* spécifiés, ou lève une :exc:`TypeError` s'ils ne sont pas spécifiés.

source: For :class:`~email.message.EmailMessage` objects, set the maintype to ``message``, and set the subtype to *subtype* if it is specified or ``rfc822`` if it is not. If *subtype* is ``partial``, raise an error (``bytes`` objects must be used to construct ``message/partial`` parts).
fr: Pour les objets :class:`~email.message.EmailMessage`, définit le type principal (*maintype*) à ``message`` et définit le sous-type à *subtype* s'il est spécifié ou à ``rfc822`` s'il ne l'est pas. Si *subtype* est ``partial``, lève une erreur (les objets ``bytes`` doivent être utilisés pour construire les parties ``message/partial``).

source: If *charset* is provided (which is valid only for ``str``), encode the string to bytes using the specified character set. The default is ``utf-8``. If the specified *charset* is a known alias for a standard MIME charset name, use the standard charset instead.
fr: Si *charset* est fourni (qui n'est valide que pour ``str``), encode la chaîne en octets en utilisant le jeu de caractères spécifié. La valeur par défaut est ``utf-8``. Si le *charset* spécifié est un alias connu pour un nom de jeu de caractères MIME standard, utilise plutôt le jeu de caractères standard.

source: If *cte* is set, encode the payload using the specified content transfer encoding, and set the :mailheader:`Content-Transfer-Encoding` header to that value. Possible values for *cte* are ``quoted-printable``, ``base64``, ``7bit``, ``8bit``, and ``binary``. If the input cannot be encoded in the specified encoding (for example, specifying a *cte* of ``7bit`` for an input that contains non-ASCII values), raise a :exc:`ValueError`.
fr: Si *cte* est défini, encode la charge utile à l'aide de l'encodage de transfert de contenu spécifié et définit l'en-tête :mailheader:`Content-Transfer-Encoding` à cette valeur. Les valeurs possibles pour *cte* sont ``quoted-printable``, ``base64``, ``7bit``, ``8bit`` et ``binary``. Si l'entrée ne peut pas être encodée dans l'encodage spécifié (par exemple, en spécifiant un *cte* de ``7bit`` pour une entrée qui contient des valeurs non-ASCII), lève une :exc:`ValueError`.

source: For ``str`` objects, if *cte* is not set use heuristics to determine the most compact encoding.
fr: Pour les objets ``str``, si *cte* n'est pas défini, utilise une heuristique pour déterminer l'encodage le plus compact.

source: For :class:`~email.message.EmailMessage`, per :rfc:`2046`, raise an error if a *cte* of ``quoted-printable`` or ``base64`` is requested for *subtype* ``rfc822``, and for any *cte* other than ``7bit`` for *subtype* ``external-body``. For ``message/rfc822``, use ``8bit`` if *cte* is not specified. For all other values of *subtype*, use ``7bit``.
fr: Pour :class:`~email.message.EmailMessage`, selon la :rfc:`2046`, pour le *subtype* ``rfc822``, lève une erreur pour un *cte* valant ``quoted-printable`` ou ``base64``. Pour le *subtype* ``external-body``, lève une erreur pour tout *cte* autre que ``7bit``. Pour ``message/rfc822``, la valeur par défaut de *cte* est ``8bit``. Pour toutes les autres valeurs de *sous-type*, la valeur par défaut de *cte* est ``7bit``.

source: A *cte* of ``binary`` does not actually work correctly yet. The ``EmailMessage`` object as modified by ``set_content`` is correct, but :class:`~email.generator.BytesGenerator` does not serialize it correctly.
fr: la valeur ``binary`` pour *cte* ne fonctionne pas encore correctement. L'objet ``EmailMessage`` tel que modifié par ``set_content`` est correct, mais :class:`~email.generator.BytesGenerator` ne le sérialise pas correctement.

source: If *disposition* is set, use it as the value of the :mailheader:`Content-Disposition` header. If not specified, and *filename* is specified, add the header with the value ``attachment``. If *disposition* is not specified and *filename* is also not specified, do not add the header. The only valid values for *disposition* are ``attachment`` and ``inline``.
fr: Si *disposition* est spécifié, utilise cette valeur pour l'en-tête :mailheader:`Content-Disposition`. S'il n'est pas spécifié et que *filename* est spécifié, utilise la valeur ``attachment`` pour l'en-tête. Si ni *disposition* ni *filename* ne sont spécifiés, n'ajoute pas cet en-tête. Les seules valeurs valides pour *disposition* sont ``attachment`` et ``inline``.

source: If *filename* is specified, use it as the value of the ``filename`` parameter of the :mailheader:`Content-Disposition` header.
fr: Si *filename* est spécifié, utilise cette valeur pour le paramètre ``filename`` de l'en-tête :mailheader:`Content-Disposition`.

source: If *cid* is specified, add a :mailheader:`Content-ID` header with *cid* as its value.
fr: Si *cid* est spécifié, ajoute un en-tête :mailheader:`Content-ID` avec cette valeur.

source: If *params* is specified, iterate its ``items`` method and use the resulting ``(key, value)`` pairs to set additional parameters on the :mailheader:`Content-Type` header.
fr: Si *params* est spécifié, itère sur sa méthode ``items`` et utilise les paires ``(clé, valeur)`` résultantes pour définir des paramètres supplémentaires dans l'en-tête :mailheader:`Content-Type`.

source: If *headers* is specified and is a list of strings of the form ``headername: headervalue`` or a list of ``header`` objects (distinguished from strings by having a ``name`` attribute), add the headers to *msg*.
fr: Si *headers* est spécifié et est une liste de chaînes de la forme ``headername: headervalue`` ou une liste d'objets ``header`` (distingués des chaînes par l'attribut ``name``), ajoute ces en-têtes à *msg*.

source: Footnotes
fr: Notes

source: Originally added in 3.4 as a :term:`provisional module <provisional package>`
fr: Initialement ajouté dans 3.4 en tant que :term:`paquet provisoire <provisional package>`.
