Repository: python/python-docs-fr
Catalog: library/email.headerregistry.po
Languages: fr

source: The following classes are the classes used to represent data parsed from structured headers and can, in general, be used by an application program to construct structured values to assign to specific headers.
fr: Les classes suivantes sont les classes utilisées pour représenter les données analysées à partir d'en-têtes structurés et peuvent, en général, être utilisées par un programme d'application pour construire des valeurs structurées à affecter à des en-têtes spécifiques.

source: The class used to represent an email address. The general form of an address is::
fr: Classe utilisée pour représenter une adresse e-mail. La forme générale d'une adresse est :

source: or::
fr: ou ::

source: where each part must conform to specific syntax rules spelled out in :rfc:`5322`.
fr: où chaque partie doit se conformer à des règles de syntaxe spécifiques énoncées dans la :rfc:`5322`.

source: As a convenience *addr_spec* can be specified instead of *username* and *domain*, in which case *username* and *domain* will be parsed from the *addr_spec*. An *addr_spec* must be a properly RFC quoted string; if it is not ``Address`` will raise an error. Unicode characters are allowed and will be property encoded when serialized. However, per the RFCs, unicode is *not* allowed in the username portion of the address.
fr: Pour plus de commodité, *addr_spec* peut être spécifié à la place de *username* et *domain*, *username* et *domain* sont alors analysés à partir de *addr_spec*. Une *addr_spec* doit être une chaîne correctement entre guillemets RFC ; si ce n'est pas le cas, ``Address`` lève une erreur. Les caractères Unicode sont autorisés et sont encodés proprement lors de la sérialisation. Cependant, selon les RFC, l’Unicode n'est *pas* autorisé dans la partie nom d'utilisateur de l'adresse.

source: The display name portion of the address, if any, with all quoting removed. If the address does not have a display name, this attribute will be an empty string.
fr: Partie du nom d'affichage de l'adresse, le cas échéant, avec toutes les citations supprimées. Si l'adresse n'a pas de nom d'affichage, cet attribut est une chaîne vide.

source: The ``username`` portion of the address, with all quoting removed.
fr: Partie ``username`` de l'adresse, sans guillemets.

source: The ``domain`` portion of the address.
fr: Partie ``domain`` de l'adresse.

source: The ``username@domain`` portion of the address, correctly quoted for use as a bare address (the second form shown above). This attribute is not mutable.
fr: Partie ``username@domain`` de l'adresse, correctement citée pour une utilisation en tant qu'adresse nue (la deuxième forme illustrée ci-dessus). Cet attribut n'est pas modifiable.

source: The ``str`` value of the object is the address quoted according to :rfc:`5322` rules, but with no Content Transfer Encoding of any non-ASCII characters.
fr: La valeur ``str`` de l'objet est l'adresse entre guillemets selon les règles de la :rfc:`5322`, mais sans encodage de contenu pour les caractères non-ASCII.

source: To support SMTP (:rfc:`5321`), ``Address`` handles one special case: if ``username`` and ``domain`` are both the empty string (or ``None``), then the string value of the ``Address`` is ``<>``.
fr: Pour prendre en charge SMTP (:rfc:`5321`), ``Address`` gère un cas particulier : si ``username`` et ``domain`` sont tous deux la chaîne vide (ou ``None``), alors la valeur de chaîne de ``Address`` est ``<>``.

source: The class used to represent an address group. The general form of an address group is::
fr: Classe utilisée pour représenter un groupe d'adresses. La forme générale d'un groupe d'adresses est :

source: As a convenience for processing lists of addresses that consist of a mixture of groups and single addresses, a ``Group`` may also be used to represent single addresses that are not part of a group by setting *display_name* to ``None`` and providing a list of the single address as *addresses*.
fr: Pour faciliter le traitement des listes d'adresses composées d'un mélange de groupes et d'adresses uniques, un ``Group`` peut également être utilisé pour représenter des adresses uniques qui ne font pas partie d'un groupe en définissant *display_name* sur ``None`` et en fournissant une liste de l'adresse unique sous la forme *adresses*.

source: The ``display_name`` of the group. If it is ``None`` and there is exactly one ``Address`` in ``addresses``, then the ``Group`` represents a single address that is not in a group.
fr: ``display_name`` du groupe. Si c'est ``None`` et qu'il y a exactement une ``Adress`` dans ``adresses``, alors le ``Group`` représente une seule adresse qui n'est pas dans un groupe.

source: A possibly empty tuple of :class:`.Address` objects representing the addresses in the group.
fr: *n*-uplet éventuellement vide d'objets :class:`.Address` représentant les adresses du groupe.

source: The ``str`` value of a ``Group`` is formatted according to :rfc:`5322`, but with no Content Transfer Encoding of any non-ASCII characters. If ``display_name`` is none and there is a single ``Address`` in the ``addresses`` list, the ``str`` value will be the same as the ``str`` of that single ``Address``.
fr: La valeur ``str`` d'un ``Group`` est formatée selon la :rfc:`5322`, mais sans encodage de contenu pour les caractères non-ASCII. Si ``display_name`` est ``None`` et qu'il y a une seule ``Address`` dans la liste ``addresses``, la valeur ``str`` est la même que la ``str`` de cette seule ``Adress``.

source: Footnotes
fr: Notes

source: Originally added in 3.3 as a :term:`provisional module <provisional package>`
fr: Ajouté à l'origine dans 3.3 en tant que :term:`paquet provisoire <provisional package>`
