Repository: python/python-docs-fr
Catalog: library/email.headerregistry.po
Languages: fr

source: **Source code:** :source:`Lib/email/headerregistry.py`
fr: **Code source :** :source:`Lib/email/headerregistry.py`

source: Headers are represented by customized subclasses of :class:`str`. The particular class used to represent a given header is determined by the :attr:`~email.policy.EmailPolicy.header_factory` of the :mod:`~email.policy` in effect when the headers are created. This section documents the particular ``header_factory`` implemented by the email package for handling :RFC:`5322` compliant email messages, which not only provides customized header objects for various header types, but also provides an extension mechanism for applications to add their own custom header types.
fr: Les en-têtes sont représentés par des sous-classes personnalisées de :class:`str`. La classe particulière utilisée pour représenter un en-tête donné est déterminée par :attr:`~email.policy.EmailPolicy.header_factory` de la :mod:`~email.policy` en vigueur lorsque les en-têtes sont créés. Cette section documente la ``header_factory`` particulière implémentée par le paquet de messagerie pour la gestion des messages électroniques conformes à la :RFC:`5322`, qui fournit non seulement des objets d'en-tête personnalisés pour différents types d'en-tête, mais fournit également un mécanisme d'extension permettant aux applications d'ajouter leurs propres types d'en-tête personnalisés.

source: When using any of the policy objects derived from :data:`~email.policy.EmailPolicy`, all headers are produced by :class:`.HeaderRegistry` and have :class:`.BaseHeader` as their last base class. Each header class has an additional base class that is determined by the type of the header. For example, many headers have the class :class:`.UnstructuredHeader` as their other base class. The specialized second class for a header is determined by the name of the header, using a lookup table stored in the :class:`.HeaderRegistry`. All of this is managed transparently for the typical application program, but interfaces are provided for modifying the default behavior for use by more complex applications.
fr: Lors de l'utilisation de l'un des objets de définition de politique dérivés de :data:`~email.policy.EmailPolicy`, tous les en-têtes sont produits par :class:`.HeaderRegistry` et ont :class:`.BaseHeader` comme dernière classe mère. Chaque classe d'en-tête a une classe mère supplémentaire qui est déterminée par le type de l'en-tête. Par exemple, de nombreux en-têtes ont la classe :class:`.UnstructuredHeader` comme autre classe mère. La deuxième classe spécialisée pour un en-tête est déterminée par le nom de l'en-tête, en utilisant un tableau de recherche stocké dans :class:`.HeaderRegistry`. Tout cela est géré de manière transparente pour le programme d'application typique, mais des interfaces sont fournies pour modifier le comportement par défaut pour une utilisation par des applications plus complexes.

source: The sections below first document the header base classes and their attributes, followed by the API for modifying the behavior of :class:`.HeaderRegistry`, and finally the support classes used to represent the data parsed from structured headers.
fr: Les sections ci-dessous documentent d'abord les classes mères d'en-tête et leurs attributs, suivies de l'API pour modifier le comportement de :class:`.HeaderRegistry`, et enfin les classes de gestion utilisées pour représenter les données analysées à partir d'en-têtes structurés.

source: *name* and *value* are passed to ``BaseHeader`` from the :attr:`~email.policy.EmailPolicy.header_factory` call. The string value of any header object is the *value* fully decoded to unicode.
fr: *name* et *value* sont passés à ``BaseHeader`` à partir de l'appel :attr:`~email.policy.EmailPolicy.header_factory`. La valeur de chaîne de tout objet d'en-tête est la *value* entièrement décodée en Unicode.

source: This base class defines the following read-only properties:
fr: Cette classe mère définit les propriétés en lecture seule suivantes :

source: The name of the header (the portion of the field before the ':'). This is exactly the value passed in the :attr:`~email.policy.EmailPolicy.header_factory` call for *name*; that is, case is preserved.
fr: Nom de l'en-tête (la partie du champ avant le ``:``). C'est exactement la valeur passée dans l'appel :attr:`~email.policy.EmailPolicy.header_factory` pour *name* ; c'est-à-dire que la casse est préservée.

source: A tuple of :exc:`~email.errors.HeaderDefect` instances reporting any RFC compliance problems found during parsing. The email package tries to be complete about detecting compliance issues. See the :mod:`~email.errors` module for a discussion of the types of defects that may be reported.
fr: *n*-uplet d'instances :exc:`~email.errors.HeaderDefect` signalant tout problème de conformité avec les RFC détecté lors de l'analyse. Le paquet d'e-mails tente d'être complet en ce qui concerne la détection des problèmes de conformité. Voir le module :mod:`~email.errors` pour une discussion sur les types de défauts qui peuvent être signalés.

source: The maximum number of headers of this type that can have the same ``name``. A value of ``None`` means unlimited. The ``BaseHeader`` value for this attribute is ``None``; it is expected that specialized header classes will override this value as needed.
fr: Nombre maximum d'en-têtes de ce type pouvant avoir le même ``name``. Une valeur de ``None`` signifie illimité. La valeur ``BaseHeader`` pour cet attribut est ``None`` ; les classes d'en-tête spécialisées sont censées remplacer cette valeur si nécessaire.

source: ``BaseHeader`` also provides the following method, which is called by the email library code and should not in general be called by application programs:
fr: ``BaseHeader`` fournit également la méthode suivante, qui est appelée par le code de la bibliothèque de messagerie et ne doit généralement pas être appelée par les programmes d'application :

source: Return a string containing :attr:`~email.policy.Policy.linesep` characters as required to correctly fold the header according to *policy*. A :attr:`~email.policy.Policy.cte_type` of ``8bit`` will be treated as if it were ``7bit``, since headers may not contain arbitrary binary data. If :attr:`~email.policy.EmailPolicy.utf8` is ``False``, non-ASCII data will be :rfc:`2047` encoded.
fr: Renvoie une chaîne contenant les caractères :attr:`~email.policy.Policy.linesep` nécessaires pour remettre en forme correctement l'en-tête conformément à *policy*. Un :attr:`~email.policy.Policy.cte_type` de ``8bit`` est traité comme s'il s'agissait de ``7bit``, car les en-têtes ne peuvent pas contenir de données binaires arbitraires. Si :attr:`~email.policy.EmailPolicy.utf8` est ``False``, les données non-ASCII seront encodées selon la :rfc:`2047`.

source: ``BaseHeader`` by itself cannot be used to create a header object. It defines a protocol that each specialized header cooperates with in order to produce the header object. Specifically, ``BaseHeader`` requires that the specialized class provide a :func:`classmethod` named ``parse``. This method is called as follows::
fr: ``BaseHeader`` seule ne peut pas être utilisée pour créer un objet d'en-tête. Elle définit un protocole avec lequel chaque en-tête spécialisé coopère afin de produire l'objet d'en-tête. Plus précisément, ``BaseHeader`` nécessite que la classe spécialisée fournisse une :func:`classmethod` nommée ``parse``. Cette méthode s'appelle comme suit ::

source: ``kwds`` is a dictionary containing one pre-initialized key, ``defects``. ``defects`` is an empty list. The parse method should append any detected defects to this list. On return, the ``kwds`` dictionary *must* contain values for at least the keys ``decoded`` and ``defects``. ``decoded`` should be the string value for the header (that is, the header value fully decoded to unicode). The parse method should assume that *string* may contain content-transfer-encoded parts, but should correctly handle all valid unicode characters as well so that it can parse un-encoded header values.
fr: ``kwds`` est un dictionnaire contenant une clé pré-initialisée : ``defects``. ``defects`` est une liste vide. La méthode d'analyse doit ajouter tous les défauts détectés à cette liste. Au retour, le dictionnaire ``kwds`` *doit* contenir des valeurs pour au moins les clés ``decoded`` et ``defects``. ``decoded`` doit être la valeur de la chaîne pour l'en-tête (c'est-à-dire la valeur de l'en-tête entièrement décodée en Unicode). La méthode d'analyse doit supposer que *string* peut contenir des parties codées par transfert de contenu, mais doit également gérer correctement tous les caractères Unicode valides afin de pouvoir analyser les valeurs d'en-tête non codées.

source: ``BaseHeader``'s ``__new__`` then creates the header instance, and calls its ``init`` method. The specialized class only needs to provide an ``init`` method if it wishes to set additional attributes beyond those provided by ``BaseHeader`` itself. Such an ``init`` method should look like this::
fr: ``__new__`` de ``BaseHeader`` crée ensuite l'instance d'en-tête et appelle sa méthode ``init``. La classe spécialisée n'a besoin de fournir une méthode ``init`` que si elle souhaite définir des attributs supplémentaires au-delà de ceux fournis par ``BaseHeader`` lui-même. Une telle méthode ``init`` devrait ressembler à ceci ::

source: That is, anything extra that the specialized class puts in to the ``kwds`` dictionary should be removed and handled, and the remaining contents of ``kw`` (and ``args``) passed to the ``BaseHeader`` ``init`` method.
fr: Autrement dit, tout ce que la classe spécialisée ajoute au dictionnaire ``kwds`` doit être supprimé et géré, et le contenu restant de ``kw`` (et ``args``) est passé à la méthode ``init`` de ``BaseHeader``.

source: An "unstructured" header is the default type of header in :rfc:`5322`. Any header that does not have a specified syntax is treated as unstructured. The classic example of an unstructured header is the :mailheader:`Subject` header.
fr: Un en-tête « non structuré » est le type d'en-tête par défaut dans la :rfc:`5322`. Tout en-tête qui n'a pas de syntaxe spécifiée est traité comme non structuré. L'exemple classique d'en-tête non structuré est l'en-tête :mailheader:`Subject`.

source: In :rfc:`5322`, an unstructured header is a run of arbitrary text in the ASCII character set. :rfc:`2047`, however, has an :rfc:`5322` compatible mechanism for encoding non-ASCII text as ASCII characters within a header value. When a *value* containing encoded words is passed to the constructor, the ``UnstructuredHeader`` parser converts such encoded words into unicode, following the :rfc:`2047` rules for unstructured text. The parser uses heuristics to attempt to decode certain non-compliant encoded words. Defects are registered in such cases, as well as defects for issues such as invalid characters within the encoded words or the non-encoded text.
fr: Dans la :rfc:`5322`, un en-tête non structuré est une séquence de texte arbitraire dans le jeu de caractères ASCII. :rfc:`2047`, cependant, possède un mécanisme compatible :rfc:`5322` pour encoder du texte non-ASCII en tant que caractères ASCII dans une valeur d'en-tête. Lorsqu'une *value* contenant des mots encodés est passée au constructeur, l'analyseur ``UnstructuredHeader`` convertit ces mots encodés en Unicode, en suivant les règles de la :rfc:`2047` pour le texte non structuré. L'analyseur utilise des heuristiques pour tenter de décoder certains mots codés non conformes. Des défauts sont enregistrés dans de tels cas, ainsi que des défauts pour des problèmes tels que des caractères non valides dans les mots codés ou le texte non codé.

source: This header type provides no additional attributes.
fr: Ce type d'en-tête ne fournit aucun attribut supplémentaire.

source: :rfc:`5322` specifies a very specific format for dates within email headers. The ``DateHeader`` parser recognizes that date format, as well as recognizing a number of variant forms that are sometimes found "in the wild".
fr: La :rfc:`5322` spécifie un format très spécifique pour les dates dans les en-têtes de courrier électronique. L'analyseur ``DateHeader`` reconnaît ce format de date, ainsi qu'un certain nombre de formes variantes que l'on trouve parfois « dans la nature ».

source: This header type provides the following additional attributes:
fr: Ce type d'en-tête fournit les attributs supplémentaires suivants :

source: If the header value can be recognized as a valid date of one form or another, this attribute will contain a :class:`~datetime.datetime` instance representing that date. If the timezone of the input date is specified as ``-0000`` (indicating it is in UTC but contains no information about the source timezone), then :attr:`.datetime` will be a naive :class:`~datetime.datetime`. If a specific timezone offset is found (including ``+0000``), then :attr:`.datetime` will contain an aware ``datetime`` that uses :class:`datetime.timezone` to record the timezone offset.
fr: Si la valeur d'en-tête peut être reconnue comme une date valide d'une forme ou d'une autre, cet attribut contient une instance :class:`~datetime.datetime` représentant cette date. Si le fuseau horaire de la date d'entrée est spécifié comme ``-0000`` (indiquant qu'il est en UTC mais ne contient aucune information sur le fuseau horaire source), alors :attr:`.datetime` est une :class:`~datetime.datetime` naïve. Si un décalage de fuseau horaire spécifique est trouvé (y compris ``+0000``), alors :attr:`.datetime` contient un ``datetime`` avisé qui utilise :class:`datetime.timezone` pour enregistrer le décalage lié au fuseau horaire.

source: The ``decoded`` value of the header is determined by formatting the ``datetime`` according to the :rfc:`5322` rules; that is, it is set to::
fr: La valeur ``decoded`` de l'en-tête est déterminée en formatant le ``datetime`` selon les règles de la :rfc:`5322` ; c'est-à-dire qu'elle est définie sur ::

source: When creating a ``DateHeader``, *value* may be :class:`~datetime.datetime` instance. This means, for example, that the following code is valid and does what one would expect::
fr: Lors de la création d'un ``DateHeader``, *value* peut être une instance de :class:`~datetime.datetime`. Cela signifie, par exemple, que le code suivant est valide et fait ce à quoi on pourrait s'attendre ::

source: Because this is a naive ``datetime`` it will be interpreted as a UTC timestamp, and the resulting value will have a timezone of ``-0000``. Much more useful is to use the :func:`~email.utils.localtime` function from the :mod:`~email.utils` module::
fr: Comme il s'agit d'un ``datetime`` naïf, il est interprété comme un horodatage UTC et la valeur résultante a un fuseau horaire de ``-0000``. Il est beaucoup plus utile d'utiliser la fonction :func:`~email.utils.localtime` du module :mod:`~email.utils` ::

source: This example sets the date header to the current time and date using the current timezone offset.
fr: Cet exemple définit l'en-tête de date sur l'heure et la date actuelles à l'aide du décalage horaire actuel.

source: Address headers are one of the most complex structured header types. The ``AddressHeader`` class provides a generic interface to any address header.
fr: Les en-têtes d'adresse sont l'un des types d'en-têtes structurés les plus complexes. La classe ``AddressHeader`` fournit une interface générique à n'importe quel en-tête d'adresse.

source: A tuple of :class:`.Group` objects encoding the addresses and groups found in the header value. Addresses that are not part of a group are represented in this list as single-address ``Groups`` whose :attr:`~.Group.display_name` is ``None``.
fr: *n*-uplet d'objets :class:`.Group` encodant les adresses et les groupes trouvés dans la valeur d'en-tête. Les adresses qui ne font pas partie d'un groupe sont représentées dans cette liste comme des ``Groups`` à adresse unique dont :attr:`~.Group.display_name` est ``None``.

source: A tuple of :class:`.Address` objects encoding all of the individual addresses from the header value. If the header value contains any groups, the individual addresses from the group are included in the list at the point where the group occurs in the value (that is, the list of addresses is "flattened" into a one dimensional list).
fr: *n*-uplet d'objets :class:`.Address` encodant toutes les adresses individuelles à partir de la valeur d'en-tête. Si la valeur d'en-tête contient des groupes, les adresses individuelles du groupe sont incluses dans la liste au point où le groupe apparaît dans la valeur (c'est-à-dire que la liste d'adresses est « aplatie » en une liste unidimensionnelle).

source: The ``decoded`` value of the header will have all encoded words decoded to unicode. :class:`~encodings.idna` encoded domain names are also decoded to unicode. The ``decoded`` value is set by :ref:`joining <meth-str-join>` the :class:`str` value of the elements of the ``groups`` attribute with ``', '``.
fr: La valeur ``decoded`` de l'en-tête a tous les mots codés décodés en Unicode. Les noms de domaine encodés en :class:`~encodings.idna` sont également décodés en Unicode. La valeur ``decoded`` est définie en :ref:`joignant <meth-str-join>` la valeur :class:`str` des éléments de l'attribut ``groups`` avec ``', '``.

source: A list of :class:`.Address` and :class:`.Group` objects in any combination may be used to set the value of an address header. ``Group`` objects whose ``display_name`` is ``None`` will be interpreted as single addresses, which allows an address list to be copied with groups intact by using the list obtained from the ``groups`` attribute of the source header.
fr: Une liste d'objets :class:`.Address` et :class:`.Group` dans n'importe quelle combinaison peut être utilisée pour définir la valeur d'un en-tête d'adresse. Les objets ``Group`` dont le ``display_name`` est ``None`` sont interprétés comme des adresses uniques, ce qui permet de copier une liste d'adresses avec des groupes intacts en utilisant la liste obtenue à partir de l'attribut ``groups`` de l'en-tête source.

source: A subclass of :class:`.AddressHeader` that adds one additional attribute:
fr: Sous-classe de :class:`.AddressHeader` qui ajoute un attribut supplémentaire :

source: The single address encoded by the header value. If the header value actually contains more than one address (which would be a violation of the RFC under the default :mod:`~email.policy`), accessing this attribute will result in a :exc:`ValueError`.
fr: Adresse unique codée par la valeur d'en-tête. Si la valeur d'en-tête contient en fait plus d'une adresse (ce qui serait une violation de la RFC sous la valeur par défaut :mod:`~email.policy`), l'accès à cet attribut lève une :exc:`ValueError`.

source: Many of the above classes also have a ``Unique`` variant (for example, ``UniqueUnstructuredHeader``). The only difference is that in the ``Unique`` variant, :attr:`~.BaseHeader.max_count` is set to 1.
fr: La plupart des classes ci-dessus ont également une variante ``Unique`` (par exemple, ``UniqueUnstructuredHeader``). La seule différence est que dans la variante ``Unique``, :attr:`~.BaseHeader.max_count` est définie sur 1.

source: There is really only one valid value for the :mailheader:`MIME-Version` header, and that is ``1.0``. For future proofing, this header class supports other valid version numbers. If a version number has a valid value per :rfc:`2045`, then the header object will have non-``None`` values for the following attributes:
fr: Il n'y a vraiment qu'une seule valeur valide pour l'en-tête :mailheader:`MIME-Version`, et c'est ``1.0``. Au cas où, cette classe d'en-tête prend en charge d'autres numéros de version valides. Si un numéro de version a une valeur valide selon la :rfc:`2045`, alors l'objet d'en-tête a des valeurs autres que ``None`` pour les attributs suivants :

source: The version number as a string, with any whitespace and/or comments removed.
fr: Numéro de version sous forme de chaîne, sans espaces ni commentaires.

source: The major version number as an integer
fr: Numéro de version majeure sous forme d'entier

source: The minor version number as an integer
fr: Numéro de version mineure sous forme d'entier

source: MIME headers all start with the prefix 'Content-'. Each specific header has a certain value, described under the class for that header. Some can also take a list of supplemental parameters, which have a common format. This class serves as a base for all the MIME headers that take parameters.
fr: Les en-têtes MIME commencent tous par le préfixe ``'Content-'``. Chaque en-tête spécifique a une certaine valeur, décrite par la classe de cet en-tête. Certains peuvent également prendre une liste de paramètres supplémentaires, qui ont un format commun. Cette classe sert de base à tous les en-têtes MIME qui prennent des paramètres.

source: A dictionary mapping parameter names to parameter values.
fr: Dictionnaire de correspondance entre les noms de paramètres et leurs valeurs.

source: A :class:`ParameterizedMIMEHeader` class that handles the :mailheader:`Content-Type` header.
fr: Classe :class:`ParameterizedMIMEHeader` qui gère l'en-tête :mailheader:`Content-Type`.

source: The content type string, in the form ``maintype/subtype``.
fr: Chaîne de type de contenu, sous la forme ``maintype/subtype``.

source: A :class:`ParameterizedMIMEHeader` class that handles the :mailheader:`Content-Disposition` header.
fr: Classe :class:`ParameterizedMIMEHeader` qui gère l'en-tête :mailheader:`Content-Disposition`.

source: ``inline`` and ``attachment`` are the only valid values in common use.
fr: ``inline`` et ``attachment`` sont les seules valeurs valides couramment utilisées.

source: Handles the :mailheader:`Content-Transfer-Encoding` header.
fr: Gère l'en-tête :mailheader:`Content-Transfer-Encoding`.

source: Valid values are ``7bit``, ``8bit``, ``base64``, and ``quoted-printable``. See :rfc:`2045` for more information.
fr: Les valeurs valides sont ``7bit``, ``8bit``, ``base64`` et ``quoted-printable``. Voir la :rfc:`2045` pour plus d'informations.

source: The default mappings are:
fr: Les correspondances par défaut sont :

source: ``HeaderRegistry`` has the following methods:
fr: ``HeaderRegistry`` a les méthodes suivantes :

source: *name* is the name of the header to be mapped. It will be converted to lower case in the registry. *cls* is the specialized class to be used, along with *base_class*, to create the class used to instantiate headers that match *name*.
fr: *name* est le nom de l'en-tête à faire correspondre. Il est converti en minuscules dans le registre. *cls* est la classe spécialisée à utiliser, avec *base_class*, pour créer la classe utilisée pour instancier les en-têtes qui correspondent à *name*.

source: Construct and return a class to handle creating a *name* header.
fr: Construit et renvoie une classe pour gérer la création d'un en-tête *name*.

source: Retrieves the specialized header associated with *name* from the registry (using *default_class* if *name* does not appear in the registry) and composes it with *base_class* to produce a class, calls the constructed class's constructor, passing it the same argument list, and finally returns the class instance created thereby.
fr: Récupère l'en-tête spécialisé associé à *name* du registre (en utilisant *default_class* si *name* n'apparaît pas dans le registre) et le compose avec *base_class* pour produire une classe, appelle le constructeur de la classe construite, en lui passant la même liste d'arguments, et renvoie enfin l'instance de classe ainsi créée.
