Repository: python/python-docs-fr
Catalog: library/email.encoders.po
Languages: fr

source: :mod:`email.encoders`: Encoders
fr: :mod:`email.encoders` : Encodeurs

source: **Source code:** :source:`Lib/email/encoders.py`
fr: **Code source :** :source:`Lib/email/encoders.py`

source: This module is part of the legacy (``Compat32``) email API. In the new API the functionality is provided by the *cte* parameter of the :meth:`~email.message.EmailMessage.set_content` method.
fr: Ce module fait partie du code patrimonial (``Compat32``) de l'API mail. Dans la nouvelle API la fonctionnalité est fournie par le paramètre *cte* de la méthode :meth:`~email.message.EmailMessage.set_content`.

source: The remaining text in this section is the original documentation of the module.
fr: Le texte restant de cette section est la documentation originale de ce module.

source: When creating :class:`~email.message.Message` objects from scratch, you often need to encode the payloads for transport through compliant mail servers. This is especially true for :mimetype:`image/\*` and :mimetype:`text/\*` type messages containing binary data.
fr: Au moment de la création d'objets :class:`~email.message.Message` à la main, il est souvent nécessaire d'encoder les charges utiles pour le transport à travers des serveurs mail conformes. C'est particulièrement vrai pour les messages de type :mimetype:`image/\*` et :mimetype:`text/\*` contenant des données binaires.

source: Note that these functions are not meaningful for a multipart message. They must be applied to individual subparts instead, and will raise a :exc:`TypeError` if passed a message whose type is multipart.
fr: À noter que ces fonctions n'ont pas de sens dans le cadre d'un message en plusieurs parties. Elles doivent à la place être appliquées aux sous-parties individuelles, et lèvent :exc:`TypeError` si on leur passe un message en plusieurs parties.

source: Here are the encoding functions provided:
fr: Voici les fonctions d'encodages fournies :

source: Encodes the payload into quoted-printable form and sets the :mailheader:`Content-Transfer-Encoding` header to ``quoted-printable`` [#]_. This is a good encoding to use when most of your payload is normal printable data, but contains a few unprintable characters.
fr: Encode la charge utile au format Quoted-Printable, et assigne ``quoted-printable`` [#]_ à l'en-tête :mailheader:`Content-Transfer-Encoding`. C'est un bon encodage à utiliser quand la majorité de la charge utile contient essentiellement des données imprimables, à l'exceptions de quelques caractères.

source: Encodes the payload into base64 form and sets the :mailheader:`Content-Transfer-Encoding` header to ``base64``. This is a good encoding to use when most of your payload is unprintable data since it is a more compact form than quoted-printable. The drawback of base64 encoding is that it renders the text non-human readable.
fr: Encode la charge utile au format *base64*, et assigne ``base64`` à l'en-tête :mailheader:`Content-Transfer-Encoding`. C'est un bon encodage à utiliser quand la majorité de la charge utile est non imprimable puisque c'est une forme plus compacte que *quoted-printable*.

source: This doesn't actually modify the message's payload, but it does set the :mailheader:`Content-Transfer-Encoding` header to either ``7bit`` or ``8bit`` as appropriate, based on the payload data.
fr: Ceci ne modifie pas effectivement la charge utile du message, mais va bien en revanche assigner la valeur ``7bit`` ou ``8bit`` à l'en-tête :mailheader:`Content-Transfer-Encoding` selon la nature de la charge utile.

source: This does nothing; it doesn't even set the :mailheader:`Content-Transfer-Encoding` header.
fr: Ceci ne fait rien; et ne va même pas changer la valeur de l'en-tête :mailheader:`Content-Transfer-Encoding`.

source: Footnotes
fr: Notes

source: Note that encoding with :meth:`encode_quopri` also encodes all tabs and space characters in the data.
fr: À noter que l'encodage avec :meth:`encode_quopri` encode également tous les caractères tabulation et espace.
