Repository: python/python-docs-fr
Catalog: library/email.iterators.po
Languages: fr

source: :mod:`email.iterators`: Iterators
fr: :mod:`email.iterators`: Itérateurs

source: **Source code:** :source:`Lib/email/iterators.py`
fr: **Code source :** :source:`Lib/email/iterators.py`

source: Iterating over a message object tree is fairly easy with the :meth:`Message.walk <email.message.Message.walk>` method. The :mod:`email.iterators` module provides some useful higher level iterations over message object trees.
fr: Itérer sur l'arborescence d'un objet message est plutôt simple avec la méthode :meth:`Message.walk <email.message.Message.walk>`. Le module :mod:`email.iterators` fournit des fonctionnalités d'itérations de plus haut niveau sur les arbres d'objets messages.

source: This iterates over all the payloads in all the subparts of *msg*, returning the string payloads line-by-line. It skips over all the subpart headers, and it skips over any subpart with a payload that isn't a Python string. This is somewhat equivalent to reading the flat text representation of the message from a file using :meth:`~io.TextIOBase.readline`, skipping over all the intervening headers.
fr: Cette fonction permet d'itérer sur tous les contenus de tous les éléments de *msg*, en retournant les contenus sous forme de chaînes de caractères ligne par ligne. Il saute les entêtes des sous éléments, et tous les sous éléments dont le contenu n'est pas une chaîne de caractères Python. C'est en quelque sorte équivalent à une lecture plate d'une représentation textuelle du message à partir d'un fichier en utilisant :meth:`~io.TextIOBase.readline`, et en sautant toutes les entêtes intermédiaires.

source: Optional *decode* is passed through to :meth:`Message.get_payload <email.message.Message.get_payload>`.
fr: Le paramètre optionnel *decode* est transmis à la méthode :meth:`Message.get_payload <email.message.Message.get_payload>`.

source: This iterates over all the subparts of *msg*, returning only those subparts that match the MIME type specified by *maintype* and *subtype*.
fr: Cette fonction permet d'itérer sur tous les sous éléments de *msg*, en retournant seulement les sous éléments qui correspondent au type MIME spécifié par *maintype* et *subtype*.

source: Note that *subtype* is optional; if omitted, then subpart MIME type matching is done only with the main type. *maintype* is optional too; it defaults to :mimetype:`text`.
fr: Notez que le paramètre *subtype* est optionnel ; s'il n'est pas présent, alors le type MIME du sous élément est seulement composé du type principal. *maintype* est également optionnel ; sa valeur par défaut est :mimetype:`text`.

source: Thus, by default :func:`typed_subpart_iterator` returns each subpart that has a MIME type of :mimetype:`text/\*`.
fr: En conséquence, par défaut, :func:`typed_subpart_iterator` retourne chaque sous élément qui a un type MIME de type :mimetype:`text/\*`.

source: The following function has been added as a useful debugging tool. It should *not* be considered part of the supported public interface for the package.
fr: La fonction suivante a été ajouté en tant qu'un outil de débogage. Elle *ne devrait pas* être considérée comme une interface publique supportée pour ce paquet.

source: Prints an indented representation of the content types of the message object structure. For example:
fr: Affiche une représentation indentée des types de contenu de la structure de l'objet message. Par exemple :

source: Optional *fp* is a file-like object to print the output to. It must be suitable for Python's :func:`print` function. *level* is used internally. *include_default*, if true, prints the default type as well.
fr: Le paramètre optionnel *fp* est un objet fichier-compatible dans lequel on peut imprimer le flux de sortie. Il doit être approprié pour la fonction de Python :func:`print`. *level* est utilisé en interne. *include_default*, si vrai, affiche aussi le type par défaut.
