Repository: python/python-docs-fr
Catalog: library/email.message.po
Languages: fr

source: The format of a MIME document allows for some text between the blank line following the headers, and the first multipart boundary string. Normally, this text is never visible in a MIME-aware mail reader because it falls outside the standard MIME armor. However, when viewing the raw text of the message, or when viewing the message in a non-MIME aware reader, this text can become visible.
fr: Le format d'un document MIME permet d'insérer du texte entre la ligne vide suivant les en-têtes et la première chaîne de délimitation en plusieurs parties. Normalement, ce texte n'est jamais visible dans un lecteur de courrier compatible MIME car il ne fait pas partie de l'attirail MIME standard. Toutefois, lors de l'affichage du texte brut du message ou lors de l'affichage du message dans un lecteur non compatible MIME, ce texte peut devenir visible.

source: The *preamble* attribute contains this leading extra-armor text for MIME documents. When the :class:`~email.parser.Parser` discovers some text after the headers but before the first boundary string, it assigns this text to the message's *preamble* attribute. When the :class:`~email.generator.Generator` is writing out the plain text representation of a MIME message, and it finds the message has a *preamble* attribute, it will write this text in the area between the headers and the first boundary. See :mod:`email.parser` and :mod:`email.generator` for details.
fr: L'attribut *preamble* contient ce texte hors cadre de tête pour les documents MIME. Lorsque :class:`~email.parser.Parser` découvre du texte après les en-têtes mais avant la première chaîne de délimitation, il attribue ce texte à l'attribut *preamble* du message. Lorsque :class:`~email.generator.Generator` écrit la représentation en texte brut d'un message MIME, et qu'il trouve que le message a un attribut *preamble*, il écrit ce texte dans la zone entre les en-têtes et la première limite. Voir :mod:`email.parser` et :mod:`email.generator` pour plus de détails.

source: Note that if the message object has no preamble, the *preamble* attribute will be ``None``.
fr: Notez que si l'objet message n'a pas de préambule, l'attribut *preamble* est ``None``.

source: The *epilogue* attribute acts the same way as the *preamble* attribute, except that it contains text that appears between the last boundary and the end of the message. As with the :attr:`~EmailMessage.preamble`, if there is no epilog text this attribute will be ``None``.
fr: L'attribut *epilogue* agit de la même manière que l'attribut *preamble*, sauf qu'il contient du texte qui apparaît entre la dernière limite et la fin du message. Comme avec :attr:`~EmailMessage.preamble`, s'il n'y a pas de texte d'épilogue, cet attribut est ``None``.

source: The *defects* attribute contains a list of all the problems found when parsing this message. See :mod:`email.errors` for a detailed description of the possible parsing defects.
fr: L'attribut *defects* contient une liste de tous les problèmes rencontrés lors de l'analyse de ce message. Voir :mod:`email.errors` pour une description détaillée des défauts d'analyse possibles.

source: This class represents a subpart of a MIME message. It is identical to :class:`EmailMessage`, except that no :mailheader:`MIME-Version` headers are added when :meth:`~EmailMessage.set_content` is called, since sub-parts do not need their own :mailheader:`MIME-Version` headers.
fr: Cette classe représente une sous-partie d'un message MIME. Elle est identique à :class:`EmailMessage`, sauf qu'aucun en-tête :mailheader:`MIME-Version` n'est ajouté lorsque :meth:`~EmailMessage.set_content` est appelée, car les sous-parties n'ont pas besoin de leurs propres en-têtes :mailheader:`MIME-Version`.

source: Footnotes
fr: Notes

source: Originally added in 3.4 as a :term:`provisional module <provisional package>`. Docs for legacy message class moved to :ref:`compat32_message`.
fr: Ajouté à l'origine dans 3.4 en tant que :term:`module provisoire <paquet provisoire>`. Les documents pour la classe de message héritée ont été déplacés dans :ref:`compat32_message`.
