Repository: python/python-docs-fr
Catalog: library/email.policy.po
Languages: fr

source: The email package calls this method with the *name* and *value* currently stored in the ``Message`` when that header is requested by the application program, and whatever the method returns is what is passed back to the application as the value of the header being retrieved. Note that there may be more than one header with the same name stored in the ``Message``; the method is passed the specific name and value of the header destined to be returned to the application.
fr: Le paquet de courrier électronique appelle cette méthode avec le *name* et la *value* actuellement stockés dans le ``Message`` lorsque cet en-tête est demandé par le programme d'application, et tout ce que la méthode renvoie est ce qui est renvoyé à l'application comme valeur de l'en-tête récupéré. Notez qu'il peut y avoir plus d'un en-tête avec le même nom stocké dans le ``Message`` ; la méthode reçoit le nom et la valeur spécifiques de l'en-tête destiné à être renvoyé à l'application.

source: *value* may contain surrogateescaped binary data. There should be no surrogateescaped binary data in the value returned by the method.
fr: *value* peut contenir des données binaires de substitution échappées. Il ne doit pas y avoir de données binaires échappées de substitution dans la valeur renvoyée par la méthode.

source: The email package calls this method with the *name* and *value* currently stored in the ``Message`` for a given header. The method should return a string that represents that header "folded" correctly (according to the policy settings) by composing the *name* with the *value* and inserting :attr:`linesep` characters at the appropriate places. See :rfc:`5322` for a discussion of the rules for folding email headers.
fr: Le paquet de courrier électronique appelle cette méthode avec le *name* et la *value* actuellement stockés dans le ``Message`` pour un en-tête donné. La méthode doit renvoyer une chaîne qui représente correctement cet en-tête « plié » (selon les paramètres de la politique) en mettant en forme le couple *name* - *value* et en insérant les caractères :attr:`linesep` aux endroits appropriés. Voir :rfc:`5322` pour une discussion sur les règles de mise en forme (« pliage » ou *folding* en anglais) des en-têtes de courrier électronique.

source: *value* may contain surrogateescaped binary data. There should be no surrogateescaped binary data in the string returned by the method.
fr: *value* peut contenir des données binaires de substitution échappées. Il ne doit pas y avoir de données binaires échappées de substitution dans la chaîne renvoyée par la méthode.

source: The same as :meth:`fold`, except that the returned value should be a bytes object rather than a string.
fr: Identique à :meth:`fold`, sauf que la valeur renvoyée doit être un objet bytes plutôt qu'une chaîne.

source: *value* may contain surrogateescaped binary data. These could be converted back into binary data in the returned bytes object.
fr: *value* peut contenir des données binaires de substitution échappées. Celles-ci pourraient être reconverties en données binaires dans l'objet bytes renvoyé.

source: This concrete :class:`Policy` provides behavior that is intended to be fully compliant with the current email RFCs. These include (but are not limited to) :rfc:`5322`, :rfc:`2047`, and the current MIME RFCs.
fr: Cette :class:`Policy` concrète fournit un comportement destiné à être entièrement conforme aux RFC de messagerie actuelles. Ce qui inclut (mais n'est pas limité à) la :rfc:`5322`, la :rfc:`2047` et les RFC MIME actuelles.

source: This policy adds new header parsing and folding algorithms. Instead of simple strings, headers are ``str`` subclasses with attributes that depend on the type of the field. The parsing and folding algorithm fully implement :rfc:`2047` and :rfc:`5322`.
fr: Cette politique ajoute de nouveaux algorithmes d'analyse d'en-tête et de mise en forme (« pliage »). Au lieu de simples chaînes, les en-têtes sont des sous-classes ``str`` avec des attributs qui dépendent du type du champ. L'algorithme d'analyse et de pliage implémente entièrement la :rfc:`2047` et la :rfc:`5322`.

source: The default value for the :attr:`~email.policy.Policy.message_factory` attribute is :class:`~email.message.EmailMessage`.
fr: La valeur par défaut de l'attribut :attr:`~email.policy.Policy.message_factory` est :class:`~email.message.EmailMessage`.

source: In addition to the settable attributes listed above that apply to all policies, this policy adds the following additional attributes:
fr: Outre les attributs définissables répertoriés ci-dessus qui s'appliquent à toutes les règles, cette règle ajoute les attributs supplémentaires suivants :

source: If ``False``, follow :rfc:`5322`, supporting non-ASCII characters in headers by encoding them as "encoded words". If ``True``, follow :rfc:`6532` and use ``utf-8`` encoding for headers. Messages formatted in this way may be passed to SMTP servers that support the ``SMTPUTF8`` extension (:rfc:`6531`).
fr: Si c'est ``False``, suit la :rfc:`5322`, en prenant en charge les caractères non-ASCII dans les en-têtes en les encodant comme des « mots encodés ». Si c'est ``True``, suit la :rfc:`6532` et utilise l'encodage ``utf-8`` pour les en-têtes. Les messages formatés de cette manière peuvent être transmis aux serveurs SMTP qui gèrent l'extension ``SMTPUTF8`` (:rfc:`6531`).

source: If the value for a header in the ``Message`` object originated from a :mod:`~email.parser` (as opposed to being set by a program), this attribute indicates whether or not a generator should refold that value when transforming the message back into serialized form. The possible values are:
fr: Si la valeur d'un en-tête dans l'objet ``Message`` provient d'un :mod:`~email.parser` (au lieu d'être définie par un programme), cet attribut indique si un générateur doit ou non remettre en forme cette valeur lorsqu'il retransforme le message sous forme sérialisée. Les valeurs possibles sont :

source: all source values use original folding
fr: toutes les valeurs sources utilisent la mise en forme (*folding* en anglais) d'origine

source: source values that have any line that is longer than ``max_line_length`` will be refolded
fr: les valeurs sources dont une ligne est plus longue que ``max_line_length`` sont remises en forme

source: all values are refolded.
fr: toutes les valeurs sont remises en forme.

source: The default is ``long``.
fr: La valeur par défaut est ``long``.

source: A callable that takes two arguments, ``name`` and ``value``, where ``name`` is a header field name and ``value`` is an unfolded header field value, and returns a string subclass that represents that header. A default ``header_factory`` (see :mod:`~email.headerregistry`) is provided that supports custom parsing for the various address and date :RFC:`5322` header field types, and the major MIME header field stypes. Support for additional custom parsing will be added in the future.
fr: Appelable qui prend deux arguments, ``name`` et ``value``, où ``name`` est un nom de champ d'en-tête et ``value`` est une valeur de champ d'en-tête dépliée (c-à-d. sans retours à la ligne de mise en forme), et renvoie une sous-classe de chaîne qui représente cet en-tête. Un ``header_factory`` par défaut (voir :mod:`~email.headerregistry`) est fourni qui prend en charge l'analyse personnalisée pour les divers types de champs d'en-tête d'adresse et de date :RFC:`5322`, et les principaux types de champs d'en-tête MIME. La prise en charge d'une analyse personnalisée supplémentaire sera ajoutée à l'avenir.

source: An object with at least two methods: get_content and set_content. When the :meth:`~email.message.EmailMessage.get_content` or :meth:`~email.message.EmailMessage.set_content` method of an :class:`~email.message.EmailMessage` object is called, it calls the corresponding method of this object, passing it the message object as its first argument, and any arguments or keywords that were passed to it as additional arguments. By default ``content_manager`` is set to :data:`~email.contentmanager.raw_data_manager`.
fr: Objet avec au moins deux méthodes : *get_content* et *set_content*. Lorsque la méthode :meth:`~email.message.EmailMessage.get_content` ou :meth:`~email.message.EmailMessage.set_content` d'un objet :class:`~email.message.EmailMessage` est appelée, elle appelle la méthode correspondante de cet objet, en lui transmettant l'objet message comme premier argument, et tous les arguments positionnels ou nommés qui lui ont été transmis comme arguments supplémentaires. Par défaut, ``content_manager`` est défini sur :data:`~email.contentmanager.raw_data_manager`.

source: The class provides the following concrete implementations of the abstract methods of :class:`Policy`:
fr: La classe fournit les implémentations concrètes suivantes des méthodes abstraites de :class:`Policy` :

source: Returns the value of the :attr:`~email.headerregistry.BaseHeader.max_count` attribute of the specialized class used to represent the header with the given name.
fr: Renvoie la valeur de l'attribut :attr:`~email.headerregistry.BaseHeader.max_count` de la classe spécialisée utilisée pour représenter l'en-tête avec le nom donné.

source: The name is parsed as everything up to the '``:``' and returned unmodified. The value is determined by stripping leading whitespace off the remainder of the first line, joining all subsequent lines together, and stripping any trailing carriage return or linefeed characters.
fr: Le nom est analysé comme le reste jusqu'au ``:`` et renvoyé sans modification. La valeur est déterminée en supprimant les espaces blancs de début du reste de la première ligne, en joignant toutes les lignes suivantes et en supprimant tous les caractères de retour chariot ou de saut de ligne de fin.

source: The name is returned unchanged. If the input value has a ``name`` attribute and it matches *name* ignoring case, the value is returned unchanged. Otherwise the *name* and *value* are passed to ``header_factory``, and the resulting header object is returned as the value. In this case a ``ValueError`` is raised if the input value contains CR or LF characters.
fr: Le nom est renvoyé tel quel. Si la valeur d'entrée a un attribut ``name`` et qu'elle correspond à *name* sans tenir compte de la casse, la valeur est renvoyée inchangée. Sinon, le *name* et la *value* sont passés à ``header_factory``, et l'objet d'en-tête résultant est renvoyé comme valeur. Dans ce cas, une ``ValueError`` est levée si la valeur d'entrée contient des caractères CR ou LF.

source: If the value has a ``name`` attribute, it is returned to unmodified. Otherwise the *name*, and the *value* with any CR or LF characters removed, are passed to the ``header_factory``, and the resulting header object is returned. Any surrogateescaped bytes get turned into the unicode unknown-character glyph.
fr: Si la valeur a un attribut ``name``, elle est renvoyée sans modification. Sinon, le *name* et la *value* sans les caractères CR ou LF sont passés à ``header_factory``, et l'objet d'en-tête résultant est renvoyé. Tous les octets échappés de substitution sont transformés en glyphe Unicode de caractère inconnu.

source: Header folding is controlled by the :attr:`refold_source` policy setting. A value is considered to be a 'source value' if and only if it does not have a ``name`` attribute (having a ``name`` attribute means it is a header object of some sort). If a source value needs to be refolded according to the policy, it is converted into a header object by passing the *name* and the *value* with any CR and LF characters removed to the ``header_factory``. Folding of a header object is done by calling its ``fold`` method with the current policy.
fr: La mise en forme d'en-tête est contrôlée par le paramètre de politique :attr:`refold_source`. Une valeur est considérée comme une « valeur source » si et seulement si elle n'a pas d'attribut ``name`` (avoir un attribut ``name`` signifie qu'il s'agit d'un objet d'en-tête quelconque). Si une valeur source doit être mise en forme conformément à la politique, elle est convertie en un objet d'en-tête en passant le *name* et la *value* avec tous les caractères CR et LF supprimés à ``header_factory``. La mise en forme multi-lignes d'un objet d'en-tête (« pliage » ou *folding* en anglais) se fait en appelant sa méthode ``fold`` avec la politique actuelle.

source: Source values are split into lines using :meth:`~str.splitlines`. If the value is not to be refolded, the lines are rejoined using the ``linesep`` from the policy and returned. The exception is lines containing non-ascii binary data. In that case the value is refolded regardless of the ``refold_source`` setting, which causes the binary data to be CTE encoded using the ``unknown-8bit`` charset.
fr: Les valeurs sources sont divisées en lignes en utilisant :meth:`~str.splitlines`. Si la valeur ne doit pas être remise en forme, les lignes sont jointes en utilisant le caractère ``linesep`` de la politique et renvoyées. L'exception concerne les lignes contenant des données binaires non ASCII. Dans ce cas, la valeur est remise en forme quel que soit le paramètre ``refold_source``, ce qui entraîne le codage CTE des données binaires à l'aide du jeu de caractères ``unknown-8bit``.

source: The same as :meth:`fold` if :attr:`~Policy.cte_type` is ``7bit``, except that the returned value is bytes.
fr: Identique à :meth:`fold` si :attr:`~Policy.cte_type` vaut ``7bit``, sauf que la valeur renvoyée est de type *bytes*.

source: If :attr:`~Policy.cte_type` is ``8bit``, non-ASCII binary data is converted back into bytes. Headers with binary data are not refolded, regardless of the ``refold_header`` setting, since there is no way to know whether the binary data consists of single byte characters or multibyte characters.
fr: Si :attr:`~Policy.cte_type` est ``8bit``, les données binaires non-ASCII sont reconverties en octets. Les en-têtes contenant des données binaires ne sont pas remises en forme, quel que soit le paramètre ``refold_header``, puisqu'il n'y a aucun moyen de savoir si les données binaires sont constituées de caractères à un seul octet ou de caractères à plusieurs octets.

source: The following instances of :class:`EmailPolicy` provide defaults suitable for specific application domains. Note that in the future the behavior of these instances (in particular the ``HTTP`` instance) may be adjusted to conform even more closely to the RFCs relevant to their domains.
fr: Les instances suivantes de :class:`EmailPolicy` fournissent des valeurs par défaut adaptées à des domaines d'application spécifiques. Notez qu'à l'avenir, le comportement de ces instances (en particulier l'instance ``HTTP``) pourra être ajusté pour se conformer encore plus étroitement aux RFC relatives à leurs domaines.

source: An instance of ``EmailPolicy`` with all defaults unchanged. This policy uses the standard Python ``\n`` line endings rather than the RFC-correct ``\r\n``.
fr: Une instance de ``EmailPolicy`` avec toutes les valeurs par défaut inchangées. Cette politique utilise les fins de ligne standard Python ``\n`` plutôt que le ``\r\n`` conforme à la RFC.

source: Suitable for serializing messages in conformance with the email RFCs. Like ``default``, but with ``linesep`` set to ``\r\n``, which is RFC compliant.
fr: Convient pour la sérialisation des messages conformément aux RFC des e-mails. Comme ``default``, mais avec ``linesep`` défini sur ``\r\n``, ce qui est conforme à la RFC.

source: The same as ``SMTP`` except that :attr:`~EmailPolicy.utf8` is ``True``. Useful for serializing messages to a message store without using encoded words in the headers. Should only be used for SMTP transmission if the sender or recipient addresses have non-ASCII characters (the :meth:`smtplib.SMTP.send_message` method handles this automatically).
fr: Identique à ``SMTP`` sauf que :attr:`~EmailPolicy.utf8` vaut ``True``. Utile pour sérialiser des messages dans une banque de messages sans utiliser de mots encodés dans les en-têtes. Ne doit être utilisée pour la transmission SMTP que si les adresses de l'expéditeur ou du destinataire contiennent des caractères non ASCII (la méthode :meth:`smtplib.SMTP.send_message` gère cela automatiquement).

source: Suitable for serializing headers with for use in HTTP traffic. Like ``SMTP`` except that ``max_line_length`` is set to ``None`` (unlimited).
fr: Convient pour la sérialisation des en-têtes à utiliser dans le trafic HTTP. Comme ``SMTP`` sauf que ``max_line_length`` est défini sur ``None`` (illimité).

source: Convenience instance. The same as ``default`` except that ``raise_on_defect`` is set to ``True``. This allows any policy to be made strict by writing::
fr: Exemple de commodité. Identique à ``default`` sauf que ``raise_on_defect`` est défini sur ``True``. Cela permet de rendre stricte toute politique en écrivant ::

source: With all of these :class:`EmailPolicies <.EmailPolicy>`, the effective API of the email package is changed from the Python 3.2 API in the following ways:
fr: Avec toutes ces :class:`EmailPolicies <.EmailPolicy>`, l'API effective du paquet de messagerie est modifiée par rapport à l'API Python 3.2 de la manière suivante :

source: Setting a header on a :class:`~email.message.Message` results in that header being parsed and a header object created.
fr: Définir un en-tête sur un :class:`~email.message.Message` entraîne l'analyse de cet en-tête et la création d'un objet d'en-tête.

source: Fetching a header value from a :class:`~email.message.Message` results in that header being parsed and a header object created and returned.
fr: La récupération d'une valeur d'en-tête à partir d'un :class:`~email.message.Message` entraîne l'analyse de cet en-tête ainsi que la création et le renvoi d'un objet d'en-tête.

source: Any header object, or any header that is refolded due to the policy settings, is folded using an algorithm that fully implements the RFC folding algorithms, including knowing where encoded words are required and allowed.
fr: Tout objet d'en-tête, ou tout en-tête qui est remis en forme en raison des paramètres de politique, est mis en forme à l'aide d'un algorithme qui implémente entièrement les algorithmes de pliage de la RFC, notamment en sachant où les mots encodés sont requis et autorisés.

source: From the application view, this means that any header obtained through the :class:`~email.message.EmailMessage` is a header object with extra attributes, whose string value is the fully decoded unicode value of the header. Likewise, a header may be assigned a new value, or a new header created, using a unicode string, and the policy will take care of converting the unicode string into the correct RFC encoded form.
fr: Du point de vue de l'application, cela signifie que tout en-tête obtenu via :class:`~email.message.EmailMessage` est un objet d'en-tête avec des attributs supplémentaires, dont la valeur de chaîne est la valeur Unicode entièrement décodée de l'en-tête. De même, un en-tête peut se voir attribuer une nouvelle valeur, ou un nouvel en-tête créé, à l'aide d'une chaîne Unicode, et la politique se chargera de convertir la chaîne Unicode dans la forme encodée RFC correcte.

source: The header objects and their attributes are described in :mod:`~email.headerregistry`.
fr: Les objets d'en-tête et leurs attributs sont décrits dans :mod:`~email.headerregistry`.

source: This concrete :class:`Policy` is the backward compatibility policy. It replicates the behavior of the email package in Python 3.2. The :mod:`~email.policy` module also defines an instance of this class, :const:`compat32`, that is used as the default policy. Thus the default behavior of the email package is to maintain compatibility with Python 3.2.
fr: Cette :class:`Policy` concrète est la politique de rétrocompatibilité. Elle reproduit le comportement du paquet de courrier électronique dans Python 3.2. Le module :mod:`~email.policy` définit également une instance de cette classe, :const:`compat32`, qui est utilisée comme politique par défaut. Ainsi, le comportement par défaut du paquet de messagerie est de maintenir la compatibilité avec Python 3.2.

source: The following attributes have values that are different from the :class:`Policy` default:
fr: Les attributs suivants ont des valeurs différentes de la valeur par défaut de :class:`Policy` :

source: The default is ``True``.
fr: La valeur par défaut est ``True``.

source: The name and value are returned unmodified.
fr: Le nom et la valeur sont renvoyés sans modification.

source: If the value contains binary data, it is converted into a :class:`~email.header.Header` object using the ``unknown-8bit`` charset. Otherwise it is returned unmodified.
fr: Si la valeur contient des données binaires, elle est convertie en un objet :class:`~email.header.Header` en utilisant le jeu de caractères ``unknown-8bit``. Sinon, elle est renvoyée sans modification.

source: Headers are folded using the :class:`~email.header.Header` folding algorithm, which preserves existing line breaks in the value, and wraps each resulting line to the ``max_line_length``. Non-ASCII binary data are CTE encoded using the ``unknown-8bit`` charset.
fr: Les en-têtes sont mis en forme à l'aide de l'algorithme de pliage :class:`~email.header.Header`, qui préserve les sauts de ligne existants dans la valeur et encapsule chaque ligne résultante dans la ``max_line_length``. Les données binaires non-ASCII sont codées en CTE à l'aide du jeu de caractères ``unknown-8bit``.

source: Headers are folded using the :class:`~email.header.Header` folding algorithm, which preserves existing line breaks in the value, and wraps each resulting line to the ``max_line_length``. If ``cte_type`` is ``7bit``, non-ascii binary data is CTE encoded using the ``unknown-8bit`` charset. Otherwise the original source header is used, with its existing line breaks and any (RFC invalid) binary data it may contain.
fr: Les en-têtes sont mis en forme à l'aide de l'algorithme de pliage :class:`~email.header.Header`, qui préserve les sauts de ligne existants dans la valeur et encapsule chaque ligne résultante dans la ``max_line_length``. Si ``cte_type`` est ``7bit``, les données binaires non-ASCII sont encodées en CTE en utilisant le jeu de caractères ``unknown-8bit``. Sinon, l'en-tête source d'origine est utilisé, avec ses sauts de ligne existants et toutes les données binaires (non conformes à la RFC) qu'il peut contenir.

source: An instance of :class:`Compat32`, providing backward compatibility with the behavior of the email package in Python 3.2.
fr: Instance de :class:`Compat32`, offrant une rétrocompatibilité avec le comportement du paquet de messagerie dans Python 3.2.

source: Footnotes
fr: Notes

source: Originally added in 3.3 as a :term:`provisional feature <provisional package>`.
fr: Initialement ajouté dans 3.3 en tant que :term:`paquet provisoire <provisional package>`.
