Repository: python/python-docs-fr
Catalog: library/email.message.po
Languages: fr

source: If the value contains non-ASCII characters, the charset and language may be explicitly specified using the optional *charset* and *language* parameters. Optional *language* specifies the :rfc:`2231` language, defaulting to the empty string. Both *charset* and *language* should be strings. The default is to use the ``utf8`` *charset* and ``None`` for the *language*.
fr: Si la valeur contient des caractères non ASCII, le jeu de caractères et la langue peuvent être explicitement spécifiés à l'aide des paramètres facultatifs *charset* et *language*. L'option *language* spécifie la langue :rfc:`2231`, par défaut la chaîne vide. *charset* et *language* doivent être des chaînes. La valeur par défaut est ``utf8`` pour *charset* et ``None`` pour *language*.

source: If *replace* is ``False`` (the default) the header is moved to the end of the list of headers. If *replace* is ``True``, the header will be updated in place.
fr: Si *replace* est ``False`` (valeur par défaut), l'en-tête est déplacé à la fin de la liste des en-têtes. Si *replace* est ``True``, l'en-tête est mis à jour sur place.

source: Use of the *requote* parameter with :class:`EmailMessage` objects is deprecated.
fr: L'utilisation du paramètre *requote* avec les objets :class:`EmailMessage` est obsolète.

source: ``replace`` keyword was added.
fr: le paramètre nommé ``replace`` a été ajouté.

source: Remove the given parameter completely from the :mailheader:`Content-Type` header. The header will be re-written in place without the parameter or its value. Optional *header* specifies an alternative to :mailheader:`Content-Type`.
fr: Supprime complètement le paramètre donné de l'en-tête :mailheader:`Content-Type`. L'en-tête est réécrit en place sans le paramètre ou sa valeur. L'option *header* spécifie une alternative à :mailheader:`Content-Type`.

source: Return the value of the ``filename`` parameter of the :mailheader:`Content-Disposition` header of the message. If the header does not have a ``filename`` parameter, this method falls back to looking for the ``name`` parameter on the :mailheader:`Content-Type` header. If neither is found, or the header is missing, then *failobj* is returned. The returned string will always be unquoted as per :func:`email.utils.unquote`.
fr: Renvoie la valeur du paramètre ``filename`` de l'en-tête :mailheader:`Content-Disposition` du message. Si l'en-tête n'a pas de paramètre ``filename``, cette méthode revient à rechercher le paramètre ``name`` dans l'en-tête :mailheader:`Content-Type`. Si aucun n'est trouvé, ou si l'en-tête est manquant, alors *failobj* est renvoyé. La chaîne renvoyée est toujours sans guillemets selon :func:`email.utils.unquote`.

source: Return the value of the ``boundary`` parameter of the :mailheader:`Content-Type` header of the message, or *failobj* if either the header is missing, or has no ``boundary`` parameter. The returned string will always be unquoted as per :func:`email.utils.unquote`.
fr: Renvoie la valeur du paramètre ``boundary`` de l'en-tête :mailheader:`Content-Type` du message, ou *failobj* si l'en-tête est manquant ou n'a pas de paramètre ``boundary``. La chaîne renvoyée est toujours sans guillemets selon :func:`email.utils.unquote`.

source: Set the ``boundary`` parameter of the :mailheader:`Content-Type` header to *boundary*. :meth:`set_boundary` will always quote *boundary* if necessary. A :exc:`~email.errors.HeaderParseError` is raised if the message object has no :mailheader:`Content-Type` header.
fr: Définit le paramètre ``boundary`` de l'en-tête :mailheader:`Content-Type` sur *boundary*. :meth:`set_boundary` entoure *boundary* de guillemets si nécessaire. Une :exc:`~email.errors.HeaderParseError` est levée si l'objet message n'a pas d'en-tête :mailheader:`Content-Type`.

source: Note that using this method is subtly different from deleting the old :mailheader:`Content-Type` header and adding a new one with the new boundary via :meth:`add_header`, because :meth:`set_boundary` preserves the order of the :mailheader:`Content-Type` header in the list of headers.
fr: Notez que l'utilisation de cette méthode est légèrement différente de la suppression de l'ancien en-tête :mailheader:`Content-Type` et de l'ajout d'un nouveau avec la nouvelle délimitation via :meth:`add_header`, car :meth:`set_boundary` préserve l'ordre des en-têtes :mailheader:`Content-Type` dans la liste des en-têtes.

source: Return the ``charset`` parameter of the :mailheader:`Content-Type` header, coerced to lower case. If there is no :mailheader:`Content-Type` header, or if that header has no ``charset`` parameter, *failobj* is returned.
fr: Renvoie le paramètre ``charset`` de l'en-tête :mailheader:`Content-Type`, contraint en minuscules. S'il n'y a pas d'en-tête :mailheader:`Content-Type`, ou si cet en-tête n'a pas de paramètre ``charset``, *failobj* est renvoyé.

source: Return a list containing the character set names in the message. If the message is a :mimetype:`multipart`, then the list will contain one element for each subpart in the payload, otherwise, it will be a list of length 1.
fr: Renvoie la liste des noms des jeux de caractères dans le message. Si le message est un :mimetype:`multipart`, alors la liste contient un élément pour chaque sous-partie dans la charge utile, sinon c'est une liste de longueur 1.

source: Each item in the list will be a string which is the value of the ``charset`` parameter in the :mailheader:`Content-Type` header for the represented subpart. If the subpart has no :mailheader:`Content-Type` header, no ``charset`` parameter, or is not of the :mimetype:`text` main MIME type, then that item in the returned list will be *failobj*.
fr: Chaque élément de la liste est une chaîne qui est la valeur du paramètre ``charset`` dans l'en-tête :mailheader:`Content-Type` pour la sous-partie représentée. Si la sous-partie n'a pas d'en-tête :mailheader:`Content-Type`, pas de paramètre ``charset`` ou n'est pas du type MIME principal :mimetype:`text`, alors cet élément est *failobj* dans la liste renvoyée.

source: Return ``True`` if there is a :mailheader:`Content-Disposition` header and its (case insensitive) value is ``attachment``, ``False`` otherwise.
fr: Renvoie ``True`` s'il y a un en-tête :mailheader:`Content-Disposition` et que sa valeur (insensible à la casse) est ``attachment``, ``False`` sinon.

source: is_attachment is now a method instead of a property, for consistency with :meth:`~email.message.Message.is_multipart`.
fr: *is_attachment* est maintenant une méthode au lieu d'une propriété, par souci de cohérence avec :meth:`~email.message.Message.is_multipart`.

source: Return the lowercased value (without parameters) of the message's :mailheader:`Content-Disposition` header if it has one, or ``None``. The possible values for this method are *inline*, *attachment* or ``None`` if the message follows :rfc:`2183`.
fr: Renvoie la valeur en minuscules (sans paramètres) de l'en-tête :mailheader:`Content-Disposition` du message s'il en a un, ou ``None``. Les valeurs possibles pour cette méthode sont *inline*, *attachment* ou ``None`` si le message respecte la :rfc:`2183`.

source: The following methods relate to interrogating and manipulating the content (payload) of the message.
fr: Les méthodes suivantes concernent l'interrogation et la manipulation du contenu (charge utile) du message.

source: The :meth:`walk` method is an all-purpose generator which can be used to iterate over all the parts and subparts of a message object tree, in depth-first traversal order. You will typically use :meth:`walk` as the iterator in a ``for`` loop; each iteration returns the next subpart.
fr: La méthode :meth:`walk` est un générateur polyvalent qui peut être utilisé pour itérer sur toutes les parties et sous-parties d'un arbre d'objets de message, dans l'ordre de parcours en profondeur d'abord. L'utilisation classique est d'itérer avec :meth:`walk` dans une boucle ``for`` ; chaque itération renvoie la sous-partie suivante.

source: Here's an example that prints the MIME type of every part of a multipart message structure:
fr: Voici un exemple qui imprime le type MIME de chaque partie d'une structure de message en plusieurs parties :

source: ``walk`` iterates over the subparts of any part where :meth:`is_multipart` returns ``True``, even though ``msg.get_content_maintype() == 'multipart'`` may return ``False``. We can see this in our example by making use of the ``_structure`` debug helper function:
fr: ``walk`` itère sur les sous-parties de toute partie où :meth:`is_multipart` renvoie ``True``, même si ``msg.get_content_maintype() == 'multipart'`` peut renvoyer ``False``. Nous pouvons le voir dans notre exemple en utilisant la fonction d'aide au débogage ``_structure`` :

source: Here the ``message`` parts are not ``multiparts``, but they do contain subparts. ``is_multipart()`` returns ``True`` and ``walk`` descends into the subparts.
fr: Ici, les parties ``message`` ne sont pas des ``multiparts``, mais elles contiennent des sous-parties. ``is_multipart()`` renvoie ``True`` et ``walk`` descend dans les sous-parties.

source: Return the MIME part that is the best candidate to be the "body" of the message.
fr: Renvoie la partie MIME qui est la meilleure candidate pour être le corps du message.

source: *preferencelist* must be a sequence of strings from the set ``related``, ``html``, and ``plain``, and indicates the order of preference for the content type of the part returned.
fr: *preferencelist* doit être une séquence de chaînes de l'ensemble ``related``, ``html`` et ``plain``, et indique l'ordre de préférence pour le type de contenu de la partie renvoyée.

source: Start looking for candidate matches with the object on which the ``get_body`` method is called.
fr: Elle commence par rechercher des correspondances candidates avec l'objet sur lequel la méthode ``get_body`` est appelée.

source: If ``related`` is not included in *preferencelist*, consider the root part (or subpart of the root part) of any related encountered as a candidate if the (sub-)part matches a preference.
fr: Si ``related`` n'est pas inclus dans *preferencelist*, elle considère la partie racine (ou sous-partie de la partie racine) de tout lien rencontré comme candidat si la (sous-)partie correspond à une préférence.

source: When encountering a ``multipart/related``, check the ``start`` parameter and if a part with a matching :mailheader:`Content-ID` is found, consider only it when looking for candidate matches. Otherwise consider only the first (default root) part of the ``multipart/related``.
fr: Lorsqu'elle rencontre un ``multipart/related``, elle vérifie le paramètre ``start`` et si une partie avec un :mailheader:`Content-ID` correspondant est trouvée, elle la considère uniquement lors de la recherche de correspondances candidates. Sinon, elle ne considère que la première partie (racine par défaut) de ``multipart/related``.

source: If a part has a :mailheader:`Content-Disposition` header, only consider the part a candidate match if the value of the header is ``inline``.
fr: Si une partie a un en-tête :mailheader:`Content-Disposition`, elle ne considère la partie comme une correspondance candidate que si la valeur de l'en-tête est ``inline``.

source: If none of the candidates matches any of the preferences in *preferencelist*, return ``None``.
fr: Si aucun des candidats ne correspond à aucune des préférences dans *preferencelist*, elle renvoie ``None``.

source: Notes: (1) For most applications the only *preferencelist* combinations that really make sense are ``('plain',)``, ``('html', 'plain')``, and the default ``('related', 'html', 'plain')``. (2) Because matching starts with the object on which ``get_body`` is called, calling ``get_body`` on a ``multipart/related`` will return the object itself unless *preferencelist* has a non-default value. (3) Messages (or message parts) that do not specify a :mailheader:`Content-Type` or whose :mailheader:`Content-Type` header is invalid will be treated as if they are of type ``text/plain``, which may occasionally cause ``get_body`` to return unexpected results.
fr: Remarques : (1) Pour la plupart des applications, les seules combinaisons *preferencelist* qui ont vraiment un sens sont ``('plain',)``, ``('html', 'plain')`` et la valeur par défaut ``( 'related', 'html', 'plain')``. (2) Parce que la correspondance commence avec l'objet sur lequel ``get_body`` est appelée, appeler ``get_body`` sur un ``multipart/related`` renvoie l'objet lui-même à moins que *preferencelist* n'ait une valeur autre que celle par défaut. (3) Les messages (ou parties de message) qui ne spécifient pas un :mailheader:`Content-Type` ou dont l'en-tête :mailheader:`Content-Type` est invalide sont traités comme s'ils étaient de type ``text/plain``, ce qui peut occasionnellement amener ``get_body`` à renvoyer des résultats inattendus.

source: Return an iterator over all of the immediate sub-parts of the message that are not candidate "body" parts. That is, skip the first occurrence of each of ``text/plain``, ``text/html``, ``multipart/related``, or ``multipart/alternative`` (unless they are explicitly marked as attachments via :mailheader:`Content-Disposition: attachment`), and return all remaining parts. When applied directly to a ``multipart/related``, return an iterator over the all the related parts except the root part (ie: the part pointed to by the ``start`` parameter, or the first part if there is no ``start`` parameter or the ``start`` parameter doesn't match the :mailheader:`Content-ID` of any of the parts). When applied directly to a ``multipart/alternative`` or a non-``multipart``, return an empty iterator.
fr: Renvoie un itérateur sur toutes les sous-parties immédiates du message qui ne sont pas des parties de « corps » candidates. Autrement dit, elle ignore la première occurrence de chacun des éléments suivants : ``text/plain``, ``text/html``, ``multipart/related`` ou ``multipart/alternative`` (sauf s'ils sont explicitement marqués comme pièces jointes via :mailheader:`Content-Disposition: attachment`), et renvoie toutes les parties restantes. Lorsqu'elle est appliquée directement à un ``multipart/related``, renvoie un itérateur sur toutes les parties liées sauf la partie racine (c'est-à-dire la partie pointée par le paramètre ``start``, ou la première partie s'il n'y a pas de paramètre ``start`` ou si le paramètre ``start`` ne correspond pas au :mailheader:`Content-ID` de l'une des parties). Lorsqu'elle est appliquée directement à un ``multipart/alternative`` ou à un non-``multipart``, elle renvoie un itérateur vide.

source: Return an iterator over all of the immediate sub-parts of the message, which will be empty for a non-``multipart``. (See also :meth:`~email.message.EmailMessage.walk`.)
fr: Renvoie un itérateur sur toutes les sous-parties immédiates du message, qui seront vides pour une non-``multipart`` (voir aussi :meth:`~email.message.EmailMessage.walk`).

source: Call the :meth:`~email.contentmanager.ContentManager.get_content` method of the *content_manager*, passing self as the message object, and passing along any other arguments or keywords as additional arguments. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`.
fr: Appelle la méthode :meth:`~email.contentmanager.ContentManager.get_content` du *content_manager*, en passant *self* comme objet message et en passant tout autre argument ou mot-clé comme argument supplémentaire. Si *content_manager* n'est pas spécifié, utilise le ``content_manager`` spécifié par la :mod:`~email.policy` actuelle.

source: Call the :meth:`~email.contentmanager.ContentManager.set_content` method of the *content_manager*, passing self as the message object, and passing along any other arguments or keywords as additional arguments. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`.
fr: Appelle la méthode :meth:`~email.contentmanager.ContentManager.set_content` du *content_manager*, en passant *self* comme objet message et en passant tout autre argument ou mot-clé comme argument supplémentaire. Si *content_manager* n'est pas spécifié, utilise le ``content_manager`` spécifié par la :mod:`~email.policy` actuelle.

source: Convert a non-``multipart`` message into a ``multipart/related`` message, moving any existing :mailheader:`Content-` headers and payload into a (new) first part of the ``multipart``. If *boundary* is specified, use it as the boundary string in the multipart, otherwise leave the boundary to be automatically created when it is needed (for example, when the message is serialized).
fr: Convertit un message non-``multipart`` en un message ``multipart/related``, en déplaçant tous les en-têtes :mailheader:`Content-` existants et la charge utile dans une (nouvelle) première partie du ``multipart``. Si *boundary* est spécifié, elle l'utilise comme chaîne de délimitation dans le *multipart*, sinon elle laisse la délimitation être créée automatiquement lorsque cela est nécessaire (par exemple, lorsque le message est sérialisé).

source: Convert a non-``multipart`` or a ``multipart/related`` into a ``multipart/alternative``, moving any existing :mailheader:`Content-` headers and payload into a (new) first part of the ``multipart``. If *boundary* is specified, use it as the boundary string in the multipart, otherwise leave the boundary to be automatically created when it is needed (for example, when the message is serialized).
fr: Convertit un non-``multipart`` ou un ``multipart/related`` en un ``multipart/alternative``, en déplaçant tous les en-têtes :mailheader:`Content-` existants et la charge utile dans une (nouvelle) première partie du ``multipart``. Si *boundary* est spécifiée, l'utilise comme chaîne de délimitation dans le *multipart*, sinon laisse la délimitation être créée automatiquement lorsque cela est nécessaire (par exemple, lorsque le message est sérialisé).

source: Convert a non-``multipart``, a ``multipart/related``, or a ``multipart-alternative`` into a ``multipart/mixed``, moving any existing :mailheader:`Content-` headers and payload into a (new) first part of the ``multipart``. If *boundary* is specified, use it as the boundary string in the multipart, otherwise leave the boundary to be automatically created when it is needed (for example, when the message is serialized).
fr: Convertit un non-``multipart``, un ``multipart/related`` ou un ``multipart-alternative`` en un ``multipart/mixed``, en déplaçant tous les en-têtes :mailheader:`Content-` existants et charge utile dans une (nouvelle) première partie du ``multipart``. Si *boundary* est spécifiée, l'utilise comme chaîne de délimitation dans le *multipart*, sinon elle laisse la délimitation être créée automatiquement lorsque cela est nécessaire (par exemple, lorsque le message est sérialisé).

source: If the message is a ``multipart/related``, create a new message object, pass all of the arguments to its :meth:`set_content` method, and :meth:`~email.message.Message.attach` it to the ``multipart``. If the message is a non-``multipart``, call :meth:`make_related` and then proceed as above. If the message is any other type of ``multipart``, raise a :exc:`TypeError`. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`. If the added part has no :mailheader:`Content-Disposition` header, add one with the value ``inline``.
fr: Si le message est un ``multipart/related``, crée un nouvel objet message, passe tous les arguments à sa méthode :meth:`set_content` et le joint avec :meth:`~email.message.Message.attach` au ``multipart``. Si le message n'est pas en ``multipart``, appelle :meth:`make_related` puis procède comme ci-dessus. Si le message est un autre type de ``multipart``, lève une :exc:`TypeError`. Si *content_manager* n'est pas spécifié, utilise le ``content_manager`` spécifié par la :mod:`~email.policy` actuelle. Si la partie ajoutée n'a pas d'en-tête :mailheader:`Content-Disposition`, en ajoute un avec la valeur ``inline``.

source: If the message is a ``multipart/alternative``, create a new message object, pass all of the arguments to its :meth:`set_content` method, and :meth:`~email.message.Message.attach` it to the ``multipart``. If the message is a non-``multipart`` or ``multipart/related``, call :meth:`make_alternative` and then proceed as above. If the message is any other type of ``multipart``, raise a :exc:`TypeError`. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`.
fr: Si le message est un ``multipart/alternative``, crée un nouvel objet message, transmet tous les arguments à sa méthode :meth:`set_content` et le joint avec :meth:`~email.message.Message.attach` au ``multipart``. Si le message est non-``multipart`` ou ``multipart/related``, appelle :meth:`make_alternative` puis procède comme ci-dessus. Si le message est un autre type de ``multipart``, lève une :exc:`TypeError`. Si *content_manager* n'est pas spécifié, utilise le ``content_manager`` spécifié par la :mod:`~email.policy` actuelle.

source: If the message is a ``multipart/mixed``, create a new message object, pass all of the arguments to its :meth:`set_content` method, and :meth:`~email.message.Message.attach` it to the ``multipart``. If the message is a non-``multipart``, ``multipart/related``, or ``multipart/alternative``, call :meth:`make_mixed` and then proceed as above. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`. If the added part has no :mailheader:`Content-Disposition` header, add one with the value ``attachment``. This method can be used both for explicit attachments (:mailheader:`Content-Disposition: attachment`) and ``inline`` attachments (:mailheader:`Content-Disposition: inline`), by passing appropriate options to the ``content_manager``.
fr: Si le message est un ``multipart/mixed``, crée un nouvel objet message, passe tous les arguments à sa méthode :meth:`set_content` et le joint avec :meth:`~email.message.Message.attach` au ``multipart``. Si le message n'est pas en ``multipart``, ``multipart/related`` ou ``multipart/alternative``, appelle :meth:`make_mixed` puis procède comme ci-dessus. Si *content_manager* n'est pas spécifié, utilise le ``content_manager`` spécifié par la :mod:`~email.policy` actuelle. Si la partie ajoutée n'a pas d'en-tête :mailheader:`Content-Disposition`, en ajoute un avec la valeur ``attachment``. Cette méthode peut être utilisée à la fois pour les pièces jointes explicites (:mailheader:`Content-Disposition:attachment`) et les pièces jointes ``inline`` (:mailheader:`Content-Disposition:inline`), en passant les options appropriées au ``content_manager``.

source: Remove the payload and all of the headers.
fr: Supprime la charge utile et tous les en-têtes.

source: :class:`EmailMessage` objects have the following instance attributes:
fr: Les objets :class:`EmailMessage` ont les attributs d'instance suivants :
