Repository: python/python-docs-fr
Catalog: library/email.compat32-message.po
Languages: fr

source: The following methods implement a mapping-like interface for accessing the message's :rfc:`2822` headers. Note that there are some semantic differences between these methods and a normal mapping (i.e. dictionary) interface. For example, in a dictionary there are no duplicate keys, but here there may be duplicate message headers. Also, in dictionaries there is no guaranteed order to the keys returned by :meth:`keys`, but in a :class:`Message` object, headers are always returned in the order they appeared in the original message, or were added to the message later. Any header deleted and then re-added are always appended to the end of the header list.
fr: Les méthodes suivantes implémentent une interface de type correspondance pour accéder aux en-têtes :rfc:`2822` du message. Notez qu'il existe des différences sémantiques entre ces méthodes et une interface de correspondance normale (c'est-à-dire un dictionnaire). Par exemple, dans un dictionnaire, il n'y a pas de clés en double, mais ici, il peut y avoir des en-têtes de message en double. De plus, dans les dictionnaires, il n'y a pas d'ordre garanti pour les clés renvoyées par :meth:`keys`, mais dans un objet :class:`Message`, les en-têtes sont toujours renvoyés dans l'ordre dans lequel ils sont apparus dans le message d'origine, ou ont été ajoutés au message plus tard. Tout en-tête supprimé puis rajouté est toujours ajouté à la fin de la liste des en-têtes.

source: These semantic differences are intentional and are biased toward maximal convenience.
fr: Ces différences sémantiques sont intentionnelles et visent une commodité maximale.

source: Note that in all cases, any envelope header present in the message is not included in the mapping interface.
fr: Notez que dans tous les cas, tout en-tête d'enveloppe présent dans le message n'est pas inclus dans l'interface de correspondance.

source: In a model generated from bytes, any header values that (in contravention of the RFCs) contain non-ASCII bytes will, when retrieved through this interface, be represented as :class:`~email.header.Header` objects with a charset of ``unknown-8bit``.
fr: Dans un modèle généré à partir d'octets, toutes les valeurs d'en-tête qui (en violation des RFC) contiennent des octets non-ASCII sont, lorsqu'elles sont récupérées via cette interface, représentées comme des objets :class:`~email.header.Header` avec un *charset* à ``unknown-8bit``.

source: Return the total number of headers, including duplicates.
fr: Renvoie le nombre total d'en-têtes, y compris les doublons.

source: Return ``True`` if the message object has a field named *name*. Matching is done case-insensitively and *name* should not include the trailing colon. Used for the ``in`` operator, e.g.::
fr: Renvoie ``True`` si l'objet message a un champ nommé *name*. La correspondance est insensible à la casse et *name* ne doit pas inclure les deux-points à la fin. Utilisé pour l'opérateur ``in``, par exemple ::

source: Return the value of the named header field. *name* should not include the colon field separator. If the header is missing, ``None`` is returned; a :exc:`KeyError` is never raised.
fr: Renvoie la valeur du champ d'en-tête désigné. *name* ne doit pas inclure le séparateur de champ deux-points. Si l'en-tête est manquant, ``None`` est renvoyé ; :exc:`KeyError` n'est jamais levée.

source: Note that if the named field appears more than once in the message's headers, exactly which of those field values will be returned is undefined. Use the :meth:`get_all` method to get the values of all the extant named headers.
fr: Notez que si le champ désigné apparaît plus d'une fois dans les en-têtes du message, la valeur exacte renvoyée n'est pas définie. Utilisez la méthode :meth:`get_all` pour obtenir les valeurs de tous les en-têtes existants.

source: Add a header to the message with field name *name* and value *val*. The field is appended to the end of the message's existing fields.
fr: Ajoute un en-tête au message avec le nom de champ *name* et la valeur *val*. Le champ est ajouté à la fin des champs existants du message.

source: Note that this does *not* overwrite or delete any existing header with the same name. If you want to ensure that the new header is the only one present in the message with field name *name*, delete the field first, e.g.::
fr: Notez que cela n'écrase *pas* ou ne supprime aucun en-tête existant portant le même nom. Si vous voulez vous assurer que le nouvel en-tête est le seul présent dans le message avec le nom de champ *name*, supprimez d'abord le champ, par exemple ::

source: Delete all occurrences of the field with name *name* from the message's headers. No exception is raised if the named field isn't present in the headers.
fr: Supprime toutes les occurrences du champ portant le nom *name* des en-têtes du message. Aucune exception n'est levée si le champ désigné n'est pas présent dans les en-têtes.

source: Return a list of all the message's header field names.
fr: Renvoie une liste de tous les noms de champs d'en-tête du message.

source: Return a list of all the message's field values.
fr: Renvoie une liste de toutes les valeurs de champ du message.

source: Return a list of 2-tuples containing all the message's field headers and values.
fr: Renvoie une liste de couples contenant tous les en-têtes et valeurs de champs associées du message.

source: Here are some additional useful methods:
fr: Voici quelques méthodes supplémentaires utiles :

source: Return a list of all the values for the field named *name*. If there are no such named headers in the message, *failobj* is returned (defaults to ``None``).
fr: Renvoie la liste de toutes les valeurs du champ nommé *name*. S'il n'y a pas d'en-têtes de ce nom dans le message, *failobj* est renvoyé (la valeur par défaut est ``None``).

source: Extended header setting. This method is similar to :meth:`__setitem__` except that additional header parameters can be provided as keyword arguments. *_name* is the header field to add and *_value* is the *primary* value for the header.
fr: Définition de paramètres d'en-têtes étendus. Cette méthode est similaire à :meth:`__setitem__` sauf que des paramètres d'en-tête supplémentaires peuvent être fournis en tant qu'arguments nommés. *_name* est le champ d'en-tête à ajouter et *_value* est la valeur *primaire* de l'en-tête.

source: For each item in the keyword argument dictionary *_params*, the key is taken as the parameter name, with underscores converted to dashes (since dashes are illegal in Python identifiers). Normally, the parameter will be added as ``key="value"`` unless the value is ``None``, in which case only the key will be added. If the value contains non-ASCII characters, it can be specified as a three tuple in the format ``(CHARSET, LANGUAGE, VALUE)``, where ``CHARSET`` is a string naming the charset to be used to encode the value, ``LANGUAGE`` can usually be set to ``None`` or the empty string (see :rfc:`2231` for other possibilities), and ``VALUE`` is the string value containing non-ASCII code points. If a three tuple is not passed and the value contains non-ASCII characters, it is automatically encoded in :rfc:`2231` format using a ``CHARSET`` of ``utf-8`` and a ``LANGUAGE`` of ``None``.
fr: Pour chaque élément du dictionnaire d'arguments nommés *_params*, la clé est prise comme nom de paramètre, avec des traits de soulignement convertis en tirets (puisque les tirets sont illégaux dans les identifiants Python). Normalement, le paramètre est ajouté en tant que ``key="value"`` sauf si la valeur est ``None``, auquel cas seule la clé est ajoutée. Si la valeur contient des caractères non-ASCII, elle peut être spécifiée sous la forme d'un triplet au format ``(CHARSET, LANGUAGE, VALUE)``, où ``CHARSET`` est une chaîne nommant le jeu de caractères à utiliser pour coder la valeur, ``LANGUAGE`` peut généralement être défini sur ``None`` ou la chaîne vide (voir la :rfc:`2231` pour d'autres possibilités), et ``VALUE`` est la valeur de chaîne contenant des points de code non-ASCII. Si un triplet n'est pas passé et que la valeur contient des caractères non-ASCII, elle est automatiquement encodée au format :rfc:`2231` en utilisant un ``CHARSET`` à ``utf-8`` et un ``LANGUAGE`` à ``None``.

source: Here's an example::
fr: Voici un exemple ::

source: This will add a header that looks like ::
fr: Cela ajoute un en-tête qui ressemble à ::

source: An example with non-ASCII characters::
fr: Un exemple avec des caractères non-ASCII ::

source: Which produces ::
fr: qui produit ::

source: Replace a header. Replace the first header found in the message that matches *_name*, retaining header order and field name case. If no matching header was found, a :exc:`KeyError` is raised.
fr: Remplace un en-tête. Remplace le premier en-tête trouvé dans le message qui correspond à *_name*, en conservant l'ordre des en-têtes et la casse des noms de champs. Si aucun en-tête correspondant n'a été trouvé, une :exc:`KeyError` est levée.

source: Return the message's content type. The returned string is coerced to lower case of the form :mimetype:`maintype/subtype`. If there was no :mailheader:`Content-Type` header in the message the default type as given by :meth:`get_default_type` will be returned. Since according to :rfc:`2045`, messages always have a default type, :meth:`get_content_type` will always return a value.
fr: Renvoie le type de contenu du message. La chaîne renvoyée est convertie en minuscules sous la forme :mimetype:`maintype/subtype`. S'il n'y avait pas d'en-tête :mailheader:`Content-Type` dans le message, le type par défaut tel qu'indiqué par :meth:`get_default_type` est renvoyé. Puisque selon la :rfc:`2045`, les messages ont toujours un type par défaut, :meth:`get_content_type` renvoie toujours une valeur.

source: :rfc:`2045` defines a message's default type to be :mimetype:`text/plain` unless it appears inside a :mimetype:`multipart/digest` container, in which case it would be :mimetype:`message/rfc822`. If the :mailheader:`Content-Type` header has an invalid type specification, :rfc:`2045` mandates that the default type be :mimetype:`text/plain`.
fr: La :rfc:`2045` définit le type par défaut d'un message comme étant :mimetype:`text/plain` sauf s'il apparaît dans un conteneur :mimetype:`multipart/digest`, auquel cas ce serait :mimetype:`message/rfc822`. Si l'en-tête :mailheader:`Content-Type` a une spécification de type invalide, la :rfc:`2045` exige que le type par défaut soit :mimetype:`text/plain`.

source: Return the message's main content type. This is the :mimetype:`maintype` part of the string returned by :meth:`get_content_type`.
fr: Renvoie le type de contenu principal du message. C'est la partie :mimetype:`maintype` de la chaîne renvoyée par :meth:`get_content_type`.

source: Return the message's sub-content type. This is the :mimetype:`subtype` part of the string returned by :meth:`get_content_type`.
fr: Renvoie le type de sous-contenu du message. C'est la partie :mimetype:`subtype` de la chaîne renvoyée par :meth:`get_content_type`.

source: Return the default content type. Most messages have a default content type of :mimetype:`text/plain`, except for messages that are subparts of :mimetype:`multipart/digest` containers. Such subparts have a default content type of :mimetype:`message/rfc822`.
fr: Renvoie le type de contenu par défaut. La plupart des messages ont un type de contenu par défaut de :mimetype:`text/plain`, à l'exception des messages qui sont des sous-parties des conteneurs :mimetype:`multipart/digest`. Ces sous-parties ont un type de contenu par défaut de :mimetype:`message/rfc822`.

source: Set the default content type. *ctype* should either be :mimetype:`text/plain` or :mimetype:`message/rfc822`, although this is not enforced. The default content type is not stored in the :mailheader:`Content-Type` header.
fr: Définit le type de contenu par défaut. *ctype* doit être :mimetype:`text/plain` ou :mimetype:`message/rfc822`, bien que cela ne soit pas appliqué. Le type de contenu par défaut n'est pas stocké dans l'en-tête :mailheader:`Content-Type`.

source: Return the message's :mailheader:`Content-Type` parameters, as a list. The elements of the returned list are 2-tuples of key/value pairs, as split on the ``'='`` sign. The left hand side of the ``'='`` is the key, while the right hand side is the value. If there is no ``'='`` sign in the parameter the value is the empty string, otherwise the value is as described in :meth:`get_param` and is unquoted if optional *unquote* is ``True`` (the default).
fr: Renvoie les paramètres :mailheader:`Content-Type` du message, sous forme de liste. Les éléments de la liste renvoyée sont des couples clé-valeur, ayant été séparés sur le signe ``'='``. Le côté gauche du ``'='`` est la clé, tandis que le côté droit est la valeur. S'il n'y a pas de signe ``'='`` dans le paramètre, la valeur est la chaîne vide, sinon la valeur est telle que décrite dans :meth:`get_param` et n'est pas entre guillemets si l'option *unquote* est ``True`` (la valeur par défaut).

source: Optional *failobj* is the object to return if there is no :mailheader:`Content-Type` header. Optional *header* is the header to search instead of :mailheader:`Content-Type`.
fr: *failobj* (facultatif) est l'objet à renvoyer s'il n'y a pas d'en-tête :mailheader:`Content-Type`. *header* (facultatif) est l'en-tête à rechercher au lieu de :mailheader:`Content-Type`.

source: This is a legacy method. On the :class:`~email.emailmessage.EmailMessage` class its functionality is replaced by the *params* property of the individual header objects returned by the header access methods.
fr: Il s'agit d'une ancienne méthode. Dans la classe :class:`~email.emailmessage.EmailMessage`, sa fonctionnalité est remplacée par la propriété *params* des objets d'en-tête individuels renvoyés par les méthodes d'accès aux en-têtes.

source: Return the value of the :mailheader:`Content-Type` header's parameter *param* as a string. If the message has no :mailheader:`Content-Type` header or if there is no such parameter, then *failobj* is returned (defaults to ``None``).
fr: Renvoie la valeur du paramètre *param* de l'en-tête :mailheader:`Content-Type` sous forme de chaîne. Si le message n'a pas d'en-tête :mailheader:`Content-Type` ou s'il n'y a pas un tel paramètre, alors *failobj* est renvoyé (par défaut à ``None``).

source: Optional *header* if given, specifies the message header to use instead of :mailheader:`Content-Type`.
fr: *header* s'il est fourni, spécifie l'en-tête de message à utiliser à la place de :mailheader:`Content-Type`.

source: Parameter keys are always compared case insensitively. The return value can either be a string, or a 3-tuple if the parameter was :rfc:`2231` encoded. When it's a 3-tuple, the elements of the value are of the form ``(CHARSET, LANGUAGE, VALUE)``. Note that both ``CHARSET`` and ``LANGUAGE`` can be ``None``, in which case you should consider ``VALUE`` to be encoded in the ``us-ascii`` charset. You can usually ignore ``LANGUAGE``.
fr: Les clés en paramètre sont toujours comparées sans tenir compte de la casse. La valeur de retour peut être soit une chaîne, soit un triplet si le paramètre a été encodé selon la :rfc:`2231`. Lorsqu'il s'agit d'un triplet, les éléments de la valeur sont de la forme ``(CHARSET, LANGUAGE, VALUE)``. Notez que ``CHARSET`` et ``LANGUAGE`` peuvent être ``None``, vous devriez alors considérer que ``VALUE`` est encodé dans le jeu de caractères ``us-ascii``. Vous pouvez généralement ignorer ``LANGUAGE``.

source: If your application doesn't care whether the parameter was encoded as in :rfc:`2231`, you can collapse the parameter value by calling :func:`email.utils.collapse_rfc2231_value`, passing in the return value from :meth:`get_param`. This will return a suitably decoded Unicode string when the value is a tuple, or the original string unquoted if it isn't. For example::
fr: Si votre application ne se soucie pas de savoir si le paramètre a été encodé conformément à la :rfc:`2231`, vous pouvez réduire la valeur du paramètre en appelant :func:`email.utils.collapse_rfc2231_value`, en transmettant la valeur de retour de :meth:`get_param`. Cela renverra une chaîne Unicode convenablement décodée lorsque la valeur est un *n*-uplet, ou la chaîne d'origine sans guillemets si ce n'est pas le cas. Par exemple ::

source: In any case, the parameter value (either the returned string, or the ``VALUE`` item in the 3-tuple) is always unquoted, unless *unquote* is set to ``False``.
fr: Dans tous les cas, la valeur du paramètre (soit la chaîne renvoyée, soit l'élément ``VALUE`` dans le triplet) est toujours sans guillemets, sauf si *unquote* est défini sur ``False``.

source: Set a parameter in the :mailheader:`Content-Type` header. If the parameter already exists in the header, its value will be replaced with *value*. If the :mailheader:`Content-Type` header as not yet been defined for this message, it will be set to :mimetype:`text/plain` and the new parameter value will be appended as per :rfc:`2045`.
fr: Définit un paramètre dans l'en-tête :mailheader:`Content-Type`. Si le paramètre existe déjà dans l'en-tête, sa valeur est remplacée par *value*. Si l'en-tête :mailheader:`Content-Type` n'a pas encore été défini pour ce message, il est défini à :mimetype:`text/plain` et la nouvelle valeur du paramètre est ajoutée conformément à la :rfc:`2045`.

source: Optional *header* specifies an alternative header to :mailheader:`Content-Type`, and all parameters will be quoted as necessary unless optional *requote* is ``False`` (the default is ``True``).
fr: L'option *header* spécifie un en-tête alternatif à :mailheader:`Content-Type`, et tous les paramètres seront entre guillemets si nécessaire sauf si l'option *requote* est ``False`` (la valeur par défaut est ``True``).

source: If optional *charset* is specified, the parameter will be encoded according to :rfc:`2231`. Optional *language* specifies the RFC 2231 language, defaulting to the empty string. Both *charset* and *language* should be strings.
fr: Si *charset* est spécifié, le paramètre est encodé selon la :rfc:`2231`. *language* (facultatif) spécifie la langue RFC 2231, par défaut c'est la chaîne vide. *charset* et *language* doivent être des chaînes.

source: If *replace* is ``False`` (the default) the header is moved to the end of the list of headers. If *replace* is ``True``, the header will be updated in place.
fr: Si *replace* est ``False`` (valeur par défaut), l'en-tête est déplacé à la fin de la liste des en-têtes. Si *replace* est ``True``, l'en-tête est mis à jour « sur place ».

source: ``replace`` keyword was added.
fr: l'argument nommé ``replace`` a été ajouté.

source: Remove the given parameter completely from the :mailheader:`Content-Type` header. The header will be re-written in place without the parameter or its value. All values will be quoted as necessary unless *requote* is ``False`` (the default is ``True``). Optional *header* specifies an alternative to :mailheader:`Content-Type`.
fr: Supprime complètement le paramètre donné de l'en-tête :mailheader:`Content-Type`. L'en-tête est réécrit « sur place » sans le paramètre ou sa valeur. Toutes les valeurs seront entre guillemets si nécessaire sauf si *requote* est ``False`` (la valeur par défaut est ``True``). L'option *header* spécifie une alternative à :mailheader:`Content-Type`.

source: Set the main type and subtype for the :mailheader:`Content-Type` header. *type* must be a string in the form :mimetype:`maintype/subtype`, otherwise a :exc:`ValueError` is raised.
fr: Définit le type principal et le sous-type de l'en-tête :mailheader:`Content-Type`. *type* doit être une chaîne sous la forme :mimetype:`maintype/subtype`, sinon une :exc:`ValueError` est levée.

source: This method replaces the :mailheader:`Content-Type` header, keeping all the parameters in place. If *requote* is ``False``, this leaves the existing header's quoting as is, otherwise the parameters will be quoted (the default).
fr: Cette méthode remplace l'en-tête :mailheader:`Content-Type`, en gardant tous les paramètres en place. Si *requote* est ``False``, cela laisse les guillemets de l'en-tête existant tels quels, sinon les paramètres sont mis entre guillemets (par défaut).

source: An alternative header can be specified in the *header* argument. When the :mailheader:`Content-Type` header is set a :mailheader:`MIME-Version` header is also added.
fr: Un en-tête alternatif peut être spécifié dans l'argument *header*. Lorsque l'en-tête :mailheader:`Content-Type` est défini, un en-tête :mailheader:`MIME-Version` est également ajouté.

source: This is a legacy method. On the :class:`~email.emailmessage.EmailMessage` class its functionality is replaced by the ``make_`` and ``add_`` methods.
fr: Il s'agit d'une ancienne méthode. Dans la classe :class:`~email.emailmessage.EmailMessage` sa fonctionnalité est remplacée par les méthodes ``make_`` et ``add_``.

source: Return the value of the ``filename`` parameter of the :mailheader:`Content-Disposition` header of the message. If the header does not have a ``filename`` parameter, this method falls back to looking for the ``name`` parameter on the :mailheader:`Content-Type` header. If neither is found, or the header is missing, then *failobj* is returned. The returned string will always be unquoted as per :func:`email.utils.unquote`.
fr: Renvoie la valeur du paramètre ``filename`` de l'en-tête :mailheader:`Content-Disposition` du message. Si l'en-tête n'a pas de paramètre ``filename``, cette méthode revient à rechercher le paramètre ``name`` dans l'en-tête :mailheader:`Content-Type`. Si aucun n'est trouvé, ou si l'en-tête est manquant, alors *failobj* est renvoyé. La chaîne renvoyée est toujours sans guillemets comme indiqué par :func:`email.utils.unquote`.

source: Return the value of the ``boundary`` parameter of the :mailheader:`Content-Type` header of the message, or *failobj* if either the header is missing, or has no ``boundary`` parameter. The returned string will always be unquoted as per :func:`email.utils.unquote`.
fr: Renvoie la valeur du paramètre ``boundary`` de l'en-tête :mailheader:`Content-Type` du message, ou *failobj* si l'en-tête est manquant ou n'a pas de paramètre ``boundary``. La chaîne renvoyée est toujours sans guillemets comme indiqué par :func:`email.utils.unquote`.

source: Set the ``boundary`` parameter of the :mailheader:`Content-Type` header to *boundary*. :meth:`set_boundary` will always quote *boundary* if necessary. A :exc:`~email.errors.HeaderParseError` is raised if the message object has no :mailheader:`Content-Type` header.
fr: Définit le paramètre ``boundary`` de l'en-tête :mailheader:`Content-Type` sur *boundary*. :meth:`set_boundary` met toujours *boundary* entre guillemets si nécessaire. Une :exc:`~email.errors.HeaderParseError` est levée si l'objet message n'a pas d'en-tête :mailheader:`Content-Type`.

source: Note that using this method is subtly different than deleting the old :mailheader:`Content-Type` header and adding a new one with the new boundary via :meth:`add_header`, because :meth:`set_boundary` preserves the order of the :mailheader:`Content-Type` header in the list of headers. However, it does *not* preserve any continuation lines which may have been present in the original :mailheader:`Content-Type` header.
fr: Notez que l'utilisation de cette méthode est légèrement différente de la suppression de l'ancien en-tête :mailheader:`Content-Type` et de l'ajout d'un nouveau avec la nouvelle limite via :meth:`add_header`, car :meth:`set_boundary` préserve l'ordre des en-têtes :mailheader:`Content-Type` dans la liste des en-têtes. Cependant, elle ne conserve *pas* les lignes de continuation qui auraient pu être présentes dans l'en-tête original :mailheader:`Content-Type`.
