Repository: python/python-docs-fr
Catalog: library/email.message.po
Languages: fr

source: **Source code:** :source:`Lib/email/message.py`
fr: **Code source :** :source:`Lib/email/message.py`

source: The central class in the :mod:`email` package is the :class:`EmailMessage` class, imported from the :mod:`email.message` module. It is the base class for the :mod:`email` object model. :class:`EmailMessage` provides the core functionality for setting and querying header fields, for accessing message bodies, and for creating or modifying structured messages.
fr: La classe centrale du paquet :mod:`email` est la classe :class:`EmailMessage`, importée du module :mod:`email.message`. C'est la classe mère du modèle d'objet :mod:`email`. :class:`EmailMessage` fournit la fonctionnalité de base pour définir et interroger les champs d'en-tête, pour accéder au corps des messages et pour créer ou modifier des messages structurés.

source: An email message consists of *headers* and a *payload* (which is also referred to as the *content*). Headers are :rfc:`5322` or :rfc:`6532` style field names and values, where the field name and value are separated by a colon. The colon is not part of either the field name or the field value. The payload may be a simple text message, or a binary object, or a structured sequence of sub-messages each with their own set of headers and their own payload. The latter type of payload is indicated by the message having a MIME type such as :mimetype:`multipart/\*` or :mimetype:`message/rfc822`.
fr: Un message électronique se compose d'en-têtes (*headers*) et d'une *charge utile* (*payload* en anglais, également appelée *contenu* – *content* en anglais). Les en-têtes sont des noms et valeurs de champ de style :rfc:`5322` ou :rfc:`6532`, où le nom et la valeur du champ sont séparés par deux points. Les deux-points ne font partie ni du nom du champ ni de la valeur du champ. La charge utile peut être un simple message texte, un objet binaire ou une séquence structurée de sous-messages chacun avec son propre ensemble d'en-têtes et sa propre charge utile. Ce dernier type de charge utile est indiqué par le message ayant un type MIME tel que :mimetype:`multipart/\*` ou :mimetype:`message/rfc822`.

source: The conceptual model provided by an :class:`EmailMessage` object is that of an ordered dictionary of headers coupled with a *payload* that represents the :rfc:`5322` body of the message, which might be a list of sub-``EmailMessage`` objects. In addition to the normal dictionary methods for accessing the header names and values, there are methods for accessing specialized information from the headers (for example the MIME content type), for operating on the payload, for generating a serialized version of the message, and for recursively walking over the object tree.
fr: Le modèle conceptuel fourni par un objet :class:`EmailMessage` est celui d'un dictionnaire ordonné d'en-têtes couplé à une *charge utile* qui représente le corps :rfc:`5322` du message, qui peut être une liste de sous-objets ``EmailMessage``. En plus des méthodes de dictionnaire normales pour accéder aux noms et valeurs d'en-têtes, il existe des méthodes pour accéder à des informations spécialisées à partir des en-têtes (par exemple le type de contenu MIME), pour agir sur la charge utile, pour générer une version sérialisée du message et pour parcourir récursivement l'arborescence d'objets.

source: The *payload* is either a string or bytes object, in the case of simple message objects, or a list of :class:`EmailMessage` objects, for MIME container documents such as :mimetype:`multipart/\*` and :mimetype:`message/rfc822` message objects.
fr: La *charge utile* est soit une chaîne ou un objet d'octets, dans le cas d'objets de message simples, soit une liste d'objets :class:`EmailMessage` pour les documents de conteneur MIME tels que :mimetype:`multipart/\*` et les objets messages :mimetype:`message/rfc822`.

source: If *policy* is specified use the rules it specifies to update and serialize the representation of the message. If *policy* is not set, use the :class:`~email.policy.default` policy, which follows the rules of the email RFCs except for line endings (instead of the RFC mandated ``\r\n``, it uses the Python standard ``\n`` line endings). For more information see the :mod:`~email.policy` documentation.
fr: Si *policy* est spécifiée, Python utilise les règles qu'elle spécifie pour mettre à jour et sérialiser la représentation du message. Si *policy* n'est pas définie, Python utilise la politique :class:`~email.policy.default`, qui suit les règles des RFC de messagerie sauf pour les fins de ligne (au lieu de ``\r\n`` indiqués par la RFC, il utilise les fins de ligne standard Python ``\n``). Pour plus d'informations, consultez la documentation :mod:`~email.policy`.

source: Flattening the message may trigger changes to the :class:`EmailMessage` if defaults need to be filled in to complete the transformation to a string (for example, MIME boundaries may be generated or modified).
fr: L'aplatissement du message peut déclencher des changements dans :class:`EmailMessage` si les valeurs par défaut doivent être renseignées pour terminer la transformation en chaîne (par exemple, les limites MIME peuvent être générées ou modifiées).

source: Note that this method is provided as a convenience and may not be the most useful way to serialize messages in your application, especially if you are dealing with multiple messages. See :class:`email.generator.Generator` for a more flexible API for serializing messages. Note also that this method is restricted to producing messages serialized as "7 bit clean" when :attr:`~email.policy.EmailPolicy.utf8` is ``False``, which is the default.
fr: Notez que cette méthode est fournie à titre de commodité et n'est peut-être pas la méthode la plus utile pour sérialiser les messages dans votre application, en particulier si vous traitez plusieurs messages. Voir :class:`email.generator.Generator` pour une API plus flexible pour la sérialisation des messages. Notez également que cette méthode est limitée à la production de messages sérialisés en « 7 bits propres » lorsque :attr:`~email.policy.EmailPolicy.utf8` est ``False``, qui est la valeur par défaut.

source: the default behavior when *maxheaderlen* is not specified was changed from defaulting to 0 to defaulting to the value of *max_line_length* from the policy.
fr: le comportement par défaut lorsque *maxheaderlen* n'est pas spécifié est passé de la valeur par défaut à 0 à la valeur par défaut de *max_line_length* de la politique.

source: Equivalent to ``as_string(policy=self.policy.clone(utf8=True))``. Allows ``str(msg)`` to produce a string containing the serialized message in a readable format.
fr: Équivalent à ``as_string(policy=self.policy.clone(utf8=True))``. Permet à ``str(msg)`` de produire une chaîne contenant le message sérialisé dans un format lisible.

source: the method was changed to use ``utf8=True``, thus producing an :rfc:`6531`-like message representation, instead of being a direct alias for :meth:`as_string`.
fr: la méthode a été modifiée pour utiliser ``utf8=True``, produisant ainsi une représentation de message semblable à :rfc:`6531`, au lieu d'être un alias direct pour :meth:`as_string`.

source: Return the entire message flattened as a bytes object. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the :class:`~email.generator.BytesGenerator`.
fr: Renvoie le message entier aplati en tant qu'objet bytes. Lorsque l'option *unixfrom* est vraie, l'en-tête de l'enveloppe est inclus dans la chaîne renvoyée. *unixfrom* par défaut est ``False``. L'argument *policy* peut être utilisé pour remplacer la politique par défaut obtenue à partir de l'instance de message. Cela peut être utilisé pour contrôler une partie du formatage produit par la méthode, puisque la *policy* spécifiée sera transmise à :class:`~email.generator.BytesGenerator`.

source: Note that this method is provided as a convenience and may not be the most useful way to serialize messages in your application, especially if you are dealing with multiple messages. See :class:`email.generator.BytesGenerator` for a more flexible API for serializing messages.
fr: Notez que cette méthode est fournie à titre de commodité et n'est peut-être pas la méthode la plus utile pour sérialiser les messages dans votre application, en particulier si vous traitez plusieurs messages. Voir :class:`email.generator.BytesGenerator` pour une API plus flexible pour la sérialisation des messages.

source: Return ``True`` if the message's payload is a list of sub-\ :class:`EmailMessage` objects, otherwise return ``False``. When :meth:`is_multipart` returns ``False``, the payload should be a string object (which might be a CTE encoded binary payload). Note that :meth:`is_multipart` returning ``True`` does not necessarily mean that "msg.get_content_maintype() == 'multipart'" will return the ``True``. For example, ``is_multipart`` will return ``True`` when the :class:`EmailMessage` is of type ``message/rfc822``.
fr: Renvoie ``True`` si la charge utile du message est une liste d'objets :class:`EmailMessage`, sinon renvoie ``False``. Lorsque :meth:`is_multipart` renvoie ``False``, la charge utile doit être un objet chaîne (qui peut être une charge utile binaire encodée CTE). Notez que :meth:`is_multipart` renvoyant ``True`` ne signifie pas nécessairement que ``msg.get_content_maintype() == 'multipart'`` renvoie ``True``. Par exemple, ``is_multipart`` renvoie ``True`` lorsque le :class:`EmailMessage` est de type ``message/rfc822``.

source: Set the message's envelope header to *unixfrom*, which should be a string. (See :class:`~mailbox.mboxMessage` for a brief description of this header.)
fr: Définit l'en-tête de l'enveloppe du message sur *unixfrom*, qui doit être une chaîne (voir :class:`~mailbox.mboxMessage` pour une brève description de cet en-tête).

source: Return the message's envelope header. Defaults to ``None`` if the envelope header was never set.
fr: Renvoie l'en-tête de l'enveloppe du message. La valeur par défaut est ``None`` si l'en-tête de l'enveloppe n'a jamais été défini.

source: The following methods implement the mapping-like interface for accessing the message's headers. Note that there are some semantic differences between these methods and a normal mapping (i.e. dictionary) interface. For example, in a dictionary there are no duplicate keys, but here there may be duplicate message headers. Also, in dictionaries there is no guaranteed order to the keys returned by :meth:`keys`, but in an :class:`EmailMessage` object, headers are always returned in the order they appeared in the original message, or in which they were added to the message later. Any header deleted and then re-added is always appended to the end of the header list.
fr: Les méthodes suivantes implémentent l'interface de type correspondance pour accéder aux en-têtes du message. Notez qu'il existe des différences sémantiques entre ces méthodes et une interface de correspondance normale (c'est-à-dire un dictionnaire). Par exemple, dans un dictionnaire, il n'y a pas de clés en double, mais ici, il peut y avoir des en-têtes de message en double. De plus, dans les dictionnaires, il n'y a pas d'ordre garanti pour les clés renvoyées par :meth:`keys`, mais dans un objet :class:`EmailMessage`, les en-têtes sont toujours renvoyés dans l'ordre dans lequel ils sont apparus dans le message d'origine, ou dans lequel ils ont été ajoutés au message plus tard. Tout en-tête supprimé puis rajouté est toujours ajouté à la fin de la liste des en-têtes.

source: These semantic differences are intentional and are biased toward convenience in the most common use cases.
fr: Ces différences sémantiques sont intentionnelles et privilégient la commodité dans les cas d'utilisation les plus courants.

source: Note that in all cases, any envelope header present in the message is not included in the mapping interface.
fr: Notez que dans tous les cas, tout en-tête d'enveloppe présent dans le message n'est pas inclus dans l'interface de correspondance.

source: Return the total number of headers, including duplicates.
fr: Renvoie le nombre total d'en-têtes, y compris les doublons.

source: Return ``True`` if the message object has a field named *name*. Matching is done without regard to case and *name* does not include the trailing colon. Used for the ``in`` operator. For example::
fr: Renvoie ``True`` si l'objet message a un champ nommé *name*. La correspondance est effectuée sans tenir compte de la casse et *name* n'inclut pas les deux-points de fin. Utilisé pour l'opérateur ``in``. Par exemple ::

source: Return the value of the named header field. *name* does not include the colon field separator. If the header is missing, ``None`` is returned; a :exc:`KeyError` is never raised.
fr: Renvoie la valeur du champ d'en-tête nommé. *name* n'inclut pas le séparateur de champ deux-points. Si l'en-tête est manquant, ``None`` est renvoyée ; :exc:`KeyError` n'est jamais levée.

source: Note that if the named field appears more than once in the message's headers, exactly which of those field values will be returned is undefined. Use the :meth:`get_all` method to get the values of all the extant headers named *name*.
fr: Notez que si le champ nommé apparaît plus d'une fois dans les en-têtes du message, il n'est pas défini la valeur de quel champ est renvoyée. Utilisez la méthode :meth:`get_all` pour obtenir les valeurs de tous les en-têtes existants nommés *name*.

source: Using the standard (non-``compat32``) policies, the returned value is an instance of a subclass of :class:`email.headerregistry.BaseHeader`.
fr: En utilisant les politiques standard (non-``compat32``), la valeur renvoyée est une instance d'une sous-classe de :class:`email.headerregistry.BaseHeader`.

source: Add a header to the message with field name *name* and value *val*. The field is appended to the end of the message's existing headers.
fr: Ajoute un en-tête au message avec le nom de champ *name* et la valeur *val*. Le champ est ajouté à la fin des en-têtes existants du message.

source: Note that this does *not* overwrite or delete any existing header with the same name. If you want to ensure that the new header is the only one present in the message with field name *name*, delete the field first, e.g.::
fr: Notez que cela n'écrase *pas* ou ne supprime aucun en-tête existant portant le même nom. Si vous voulez vous assurer que le nouvel en-tête est le seul présent dans le message avec le nom de champ *name*, supprimez d'abord le champ, par exemple ::

source: Delete all occurrences of the field with name *name* from the message's headers. No exception is raised if the named field isn't present in the headers.
fr: Supprime toutes les occurrences du champ portant le nom *name* des en-têtes du message. Aucune exception n'est levée si le champ nommé n'est pas présent dans les en-têtes.

source: Return a list of all the message's header field names.
fr: Renvoie une liste de tous les noms de champs d'en-tête du message.

source: Return a list of all the message's field values.
fr: Renvoie une liste de toutes les valeurs de champ du message.

source: Return a list of 2-tuples containing all the message's field headers and values.
fr: Renvoie une liste de couples contenant tous les en-têtes et valeurs de champ du message.

source: Here are some additional useful header related methods:
fr: Voici quelques méthodes supplémentaires utiles liées aux en-têtes :

source: Return a list of all the values for the field named *name*. If there are no such named headers in the message, *failobj* is returned (defaults to ``None``).
fr: Renvoie la liste de toutes les valeurs du champ nommé *name*. S'il n'y a pas d'en-têtes nommés de ce type dans le message, *failobj* est renvoyé (la valeur par défaut est ``None``).

source: Extended header setting. This method is similar to :meth:`__setitem__` except that additional header parameters can be provided as keyword arguments. *_name* is the header field to add and *_value* is the *primary* value for the header.
fr: Étend les en-têtes. Cette méthode est similaire à :meth:`__setitem__` sauf que des paramètres d'en-tête supplémentaires peuvent être fournis en tant qu'arguments nommés. *_name* est le champ d'en-tête à ajouter et *_value* est la valeur *primaire* de l'en-tête.

source: For each item in the keyword argument dictionary *_params*, the key is taken as the parameter name, with underscores converted to dashes (since dashes are illegal in Python identifiers). Normally, the parameter will be added as ``key="value"`` unless the value is ``None``, in which case only the key will be added.
fr: Pour chaque élément du dictionnaire d'arguments nommés *_params*, la clé est prise comme nom de paramètre, avec des traits de soulignement convertis en tirets (puisque les tirets sont illégaux dans les identifiants Python). Normalement, le paramètre est ajouté en tant que ``key="value"`` sauf si la valeur est ``None``, auquel cas seule la clé est ajoutée.

source: If the value contains non-ASCII characters, the charset and language may be explicitly controlled by specifying the value as a three tuple in the format ``(CHARSET, LANGUAGE, VALUE)``, where ``CHARSET`` is a string naming the charset to be used to encode the value, ``LANGUAGE`` can usually be set to ``None`` or the empty string (see :rfc:`2231` for other possibilities), and ``VALUE`` is the string value containing non-ASCII code points. If a three tuple is not passed and the value contains non-ASCII characters, it is automatically encoded in :rfc:`2231` format using a ``CHARSET`` of ``utf-8`` and a ``LANGUAGE`` of ``None``.
fr: Si la valeur contient des caractères non-ASCII, le jeu de caractères et la langue peuvent être explicitement contrôlés en spécifiant la valeur sous la forme d'un triplet au format ``(CHARSET, LANGUAGE, VALUE)``, où ``CHARSET`` est une chaîne nommant le jeu de caractères à utiliser pour encoder la valeur, ``LANGUAGE`` peut généralement être défini sur ``None`` ou sur la chaîne vide (voir :rfc:`2231` pour d'autres possibilités) et ``VALUE`` est la chaîne contenant les valeurs des points de code non-ASCII. Si un triplet n'est pas passé et que la valeur contient des caractères non-ASCII, elle est automatiquement encodée au format :rfc:`2231` en utilisant ``utf-8`` comme ``CHARSET`` et ``None`` comme ``LANGUAGE``.

source: Here is an example::
fr: Voici un exemple ::

source: This will add a header that looks like ::
fr: Cela ajoute un en-tête qui ressemble à ::

source: An example of the extended interface with non-ASCII characters::
fr: Un exemple d'interface étendue avec des caractères non-ASCII ::

source: Replace a header. Replace the first header found in the message that matches *_name*, retaining header order and field name case of the original header. If no matching header is found, raise a :exc:`KeyError`.
fr: Remplace un en-tête. Remplace le premier en-tête trouvé dans le message qui correspond à *_name*, en conservant l'ordre des en-têtes et la casse du nom de champ de l'en-tête d'origine. Si aucun en-tête correspondant n'est trouvé, lève une :exc:`KeyError`.

source: Return the message's content type, coerced to lower case of the form :mimetype:`maintype/subtype`. If there is no :mailheader:`Content-Type` header in the message return the value returned by :meth:`get_default_type`. If the :mailheader:`Content-Type` header is invalid, return ``text/plain``.
fr: Renvoie le type de contenu du message, contraint en minuscules de la forme :mimetype:`maintype/subtype`. S'il n'y a pas d'en-tête :mailheader:`Content-Type` dans le message, renvoie la valeur renvoyée par :meth:`get_default_type`. Si l'en-tête :mailheader:`Content-Type` n'est pas valide, renvoie ``text/plain``.

source: (According to :rfc:`2045`, messages always have a default type, :meth:`get_content_type` will always return a value. :rfc:`2045` defines a message's default type to be :mimetype:`text/plain` unless it appears inside a :mimetype:`multipart/digest` container, in which case it would be :mimetype:`message/rfc822`. If the :mailheader:`Content-Type` header has an invalid type specification, :rfc:`2045` mandates that the default type be :mimetype:`text/plain`.)
fr: (Selon la :rfc:`2045`, les messages ont toujours un type par défaut, :meth:`get_content_type` renvoie toujours une valeur. La :rfc:`2045` définit le type par défaut d'un message comme étant :mimetype:`text/plain` à moins qu'il n'apparaisse dans un conteneur :mimetype:`multipart/digest`, auquel cas ce serait :mimetype:`message/rfc822`. Si l'en-tête :mailheader:`Content-Type` a une spécification de type invalide, la :rfc:`2045` exige que le type par défaut soit :mimetype:`text/plain`.)

source: Return the message's main content type. This is the :mimetype:`maintype` part of the string returned by :meth:`get_content_type`.
fr: Renvoie le type de contenu principal du message. C'est la partie :mimetype:`maintype` de la chaîne renvoyée par :meth:`get_content_type`.

source: Return the message's sub-content type. This is the :mimetype:`subtype` part of the string returned by :meth:`get_content_type`.
fr: Renvoie le type de sous-contenu du message. C'est la partie :mimetype:`subtype` de la chaîne renvoyée par :meth:`get_content_type`.

source: Return the default content type. Most messages have a default content type of :mimetype:`text/plain`, except for messages that are subparts of :mimetype:`multipart/digest` containers. Such subparts have a default content type of :mimetype:`message/rfc822`.
fr: Renvoie le type de contenu par défaut. La plupart des messages ont un type de contenu :mimetype:`text/plain` par défaut, à l'exception des messages qui sont des sous-parties des conteneurs :mimetype:`multipart/digest`. Ces sous-parties ont un type de contenu par défaut de :mimetype:`message/rfc822`.

source: Set the default content type. *ctype* should either be :mimetype:`text/plain` or :mimetype:`message/rfc822`, although this is not enforced. The default content type is not stored in the :mailheader:`Content-Type` header, so it only affects the return value of the ``get_content_type`` methods when no :mailheader:`Content-Type` header is present in the message.
fr: Définit le type de contenu par défaut. *ctype* doit être :mimetype:`text/plain` ou :mimetype:`message/rfc822`, bien que cela ne soit pas imposé. Le type de contenu par défaut n'est pas stocké dans l'en-tête :mailheader:`Content-Type`, il n'affecte donc que la valeur de retour des méthodes ``get_content_type`` lorsqu'aucun en-tête :mailheader:`Content-Type` n'est présent dans le message .

source: Set a parameter in the :mailheader:`Content-Type` header. If the parameter already exists in the header, replace its value with *value*. When *header* is ``Content-Type`` (the default) and the header does not yet exist in the message, add it, set its value to :mimetype:`text/plain`, and append the new parameter value. Optional *header* specifies an alternative header to :mailheader:`Content-Type`.
fr: Définit un paramètre dans l'en-tête :mailheader:`Content-Type`. Si le paramètre existe déjà dans l'en-tête, remplace sa valeur par *value*. Lorsque *header* est ``Content-Type`` (la valeur par défaut) et que l'en-tête n'existe pas encore dans le message, l'ajoute, définit sa valeur sur :mimetype:`text/plain` et ajoute la nouvelle valeur du paramètre. *header* facultatif spécifie un en-tête alternatif à :mailheader:`Content-Type`.
