Repository: python/python-docs-fr
Catalog: library/email.errors.po
Languages: fr

source: :mod:`email.errors`: Exception and Defect classes
fr: :mod:`email.errors` : exceptions et classes pour les anomalies

source: **Source code:** :source:`Lib/email/errors.py`
fr: **Code source :** :source:`Lib/email/errors.py`

source: The following exception classes are defined in the :mod:`email.errors` module:
fr: Les classes d'exception suivantes sont définies dans le module :mod:`email.errors` :

source: This is the base class for all exceptions that the :mod:`email` package can raise. It is derived from the standard :exc:`Exception` class and defines no additional methods.
fr: Exception de base, dont héritent toutes les exceptions du paquet :mod:`email`. Cette classe hérite de la classe native :exc:`Exception` et ne définit aucune méthode additionnelle.

source: This is the base class for exceptions raised by the :class:`~email.parser.Parser` class. It is derived from :exc:`MessageError`. This class is also used internally by the parser used by :mod:`~email.headerregistry`.
fr: Exception de base pour les exceptions levées par la classe :class:`~email.parser.Parser`. Elle hérite de :exc:`MessageError`. Cette classe est aussi utilisée en interne par l'analyseur de :mod:`~email.headerregistry`.

source: Raised under some error conditions when parsing the :rfc:`5322` headers of a message, this class is derived from :exc:`MessageParseError`. The :meth:`~email.message.EmailMessage.set_boundary` method will raise this error if the content type is unknown when the method is called. :class:`~email.header.Header` may raise this error for certain base64 decoding errors, and when an attempt is made to create a header that appears to contain an embedded header (that is, there is what is supposed to be a continuation line that has no leading whitespace and looks like a header).
fr: Cette exception, dérivée de :exc:`MessageParseError`, est levée sous différentes conditions lors de l'analyse des en-têtes :rfc:`5322` du message. Lorsque la méthode :meth:`~email.message.EmailMessage.set_boundary` est invoquée, elle lève cette erreur si le type du contenu est inconnu. La classe :class:`~email.header.Header` lève cette exception pour certains types d'erreurs provenant du décodage base64. Elle la lève aussi quand un en-tête est créé et qu'il semble contenir un en-tête imbriqué, c'est-à-dire que la ligne qui suit ressemble à un en-tête et ne commence pas par des caractères d'espacement.

source: Deprecated and no longer used.
fr: Obsolète, n'est plus utilisé.

source: Raised when a payload is added to a :class:`~email.message.Message` object using :meth:`add_payload`, but the payload is already a scalar and the message's :mailheader:`Content-Type` main type is not either :mimetype:`multipart` or missing. :exc:`MultipartConversionError` multiply inherits from :exc:`MessageError` and the built-in :exc:`TypeError`.
fr: Cette exception est levée quand le contenu, que la méthode :meth:`add_payload` essaie d'ajouter à l'objet :class:`~email.message.Message`, est déjà un scalaire et que le type principal du message :mailheader:`Content-Type` est manquant ou différent de :mimetype:`multipart`. :exc:`MultipartConversionError` hérite à la fois de :exc:`MessageError` et de :exc:`TypeError`.

source: Since :meth:`Message.add_payload` is deprecated, this exception is rarely raised in practice. However the exception may also be raised if the :meth:`~email.message.Message.attach` method is called on an instance of a class derived from :class:`~email.mime.nonmultipart.MIMENonMultipart` (e.g. :class:`~email.mime.image.MIMEImage`).
fr: Comme la méthode :meth:`Message.add_payload` est obsolète, cette exception est rarement utilisée. Néanmoins, elle peut être levée si la méthode :meth:`~email.message.Message.attach` est invoquée sur une instance de classe dérivée de :class:`~email.mime.nonmultipart.MIMENonMultipart` (p. ex. :class:`~email.mime.image.MIMEImage`).

source: Here is the list of the defects that the :class:`~email.parser.FeedParser` can find while parsing messages. Note that the defects are added to the message where the problem was found, so for example, if a message nested inside a :mimetype:`multipart/alternative` had a malformed header, that nested message object would have a defect, but the containing messages would not.
fr: Voici la liste des anomalies que peut identifier :class:`~email.parser.FeedParser` pendant l'analyse des messages. Notez que les anomalies sont signalées à l'endroit où elles sont détectées : par exemple, dans le cas d'une malformation de l'en-tête d'un message imbriqué dans un message de type :mimetype:`multipart/alternative`, l'anomalie est signalée sur le message imbriqué seulement.

source: All defect classes are subclassed from :class:`email.errors.MessageDefect`.
fr: Toutes les anomalies sont des sous-classes de :class:`email.errors.MessageDefect`.

source: :class:`NoBoundaryInMultipartDefect` -- A message claimed to be a multipart, but had no :mimetype:`boundary` parameter.
fr: :class:`NoBoundaryInMultipartDefect` — Un message qui prétend être composite (*multipart* en anglais), mais qui ne contient pas de séparateur :mimetype:`boundary`.

source: :class:`StartBoundaryNotFoundDefect` -- The start boundary claimed in the :mailheader:`Content-Type` header was never found.
fr: :class:`StartBoundaryNotFoundDefect` — Le message ne contient pas le séparateur de départ indiqué dans le :mailheader:`Content-Type`.

source: :class:`CloseBoundaryNotFoundDefect` -- A start boundary was found, but no corresponding close boundary was ever found.
fr: :class:`CloseBoundaryNotFoundDefect` — Le séparateur de départ a été trouvé, mais pas le séparateur de fin correspondant.

source: :class:`FirstHeaderLineIsContinuationDefect` -- The message had a continuation line as its first header line.
fr: :class:`FirstHeaderLineIsContinuationDefect` — La première ligne de l'en-tête du message est une ligne de continuation.

source: :class:`MisplacedEnvelopeHeaderDefect` - A "Unix From" header was found in the middle of a header block.
fr: :class:`MisplacedEnvelopeHeaderDefect` — Un en-tête *Unix From* est présent à l'intérieur d'un bloc d'en-tête.

source: :class:`MissingHeaderBodySeparatorDefect` - A line was found while parsing headers that had no leading white space but contained no ':'. Parsing continues assuming that the line represents the first line of the body.
fr: :class:`MissingHeaderBodySeparatorDefect` — Une ligne d'en-tête ne contient pas de caractères d'espacement au début et aucun « : ». L'analyse continue en supposant qu'il s'agit donc de la première ligne du corps du message.

source: :class:`MalformedHeaderDefect` -- A header was found that was missing a colon, or was otherwise malformed.
fr: :class:`MalformedHeaderDefect` -- Un en-tête est mal formé ou il manque un « : ».

source: This defect has not been used for several Python versions.
fr: Cette anomalie est obsolète depuis plusieurs versions de Python.

source: :class:`MultipartInvariantViolationDefect` -- A message claimed to be a :mimetype:`multipart`, but no subparts were found. Note that when a message has this defect, its :meth:`~email.message.Message.is_multipart` method may return ``False`` even though its content type claims to be :mimetype:`multipart`.
fr: :class:`MultipartInvariantViolationDefect` — Le message indique être de type :mimetype:`multipart`, mais aucune pièce jointe n'a été trouvée. Notez que, dans ce cas, la méthode :meth:`~email.message.Message.is_multipart` peut renvoyer ``False`` même si le type de contenu est :mimetype:`multipart`.

source: :class:`InvalidBase64PaddingDefect` -- When decoding a block of base64 encoded bytes, the padding was not correct. Enough padding is added to perform the decode, but the resulting decoded bytes may be invalid.
fr: :class:`InvalidBase64PaddingDefect` — Remplissage incorrect d'un bloc d'octets encodés en base64. Des caractères de remplissage ont été ajoutés pour permettre le décodage, mais le résultat du décodage peut être invalide.

source: :class:`InvalidBase64CharactersDefect` -- When decoding a block of base64 encoded bytes, characters outside the base64 alphabet were encountered. The characters are ignored, but the resulting decoded bytes may be invalid.
fr: :class:`InvalidBase64CharactersDefect` — Des caractères n'appartenant pas à l'alphabet base64 ont été rencontrés lors du décodage d'un bloc d'octets encodés en base64. Les caractères ont été ignorés, mais le résultat du décodage peut être invalide.

source: :class:`InvalidBase64LengthDefect` -- When decoding a block of base64 encoded bytes, the number of non-padding base64 characters was invalid (1 more than a multiple of 4). The encoded block was kept as-is.
fr: :class:`InvalidBase64LengthDefect` — Le nombre de caractères (autres que de remplissage) d'un bloc d'octets encodés en base64 est invalide (1 de plus qu'un multiple de 4). Le bloc encodé n'a pas été modifié.

source: :class:`InvalidDateDefect` -- When decoding an invalid or unparsable date field. The original value is kept as-is.
fr: :class:`InvalidDateDefect` — Le champ de date est invalide. La valeur est laissée telle-quelle.
