Repository: python/python-docs-fr
Catalog: library/ensurepip.po
Languages: fr

source: :mod:`ensurepip` --- Bootstrapping the ``pip`` installer
fr: :mod:`ensurepip` — Amorçage de l'installateur ``pip``

source: The :mod:`ensurepip` package provides support for bootstrapping the ``pip`` installer into an existing Python installation or virtual environment. This bootstrapping approach reflects the fact that ``pip`` is an independent project with its own release cycle, and the latest available stable version is bundled with maintenance and feature releases of the CPython reference interpreter.
fr: Le module :mod:`ensurepip` met en place l'installateur ``pip`` dans un environnement Python, classique ou virtuel. Ce principe d'amorçage a été choisi car ``pip`` est un projet séparé de Python avec son propre cycle de versions. Il permet en particulier d'embarquer la version la plus récente de ``pip`` dans les mises à jour de maintenance de l'interpréteur CPython comme dans les nouvelles versions principales.

source: In most cases, end users of Python shouldn't need to invoke this module directly (as ``pip`` should be bootstrapped by default), but it may be needed if installing ``pip`` was skipped when installing Python (or when creating a virtual environment) or after explicitly uninstalling ``pip``.
fr: Dans la plupart des cas, il n'est pas nécessaire de recourir à ce module. ``pip`` est le plus souvent déjà installé pour vous. Cependant, ``ensurepip`` peut s'avérer utile si l'installation de ``pip`` a été sautée au moment de l'installation de Python (ou en créant un environnement virtuel), ou bien si ``pip`` a été désinstallé par l'utilisateur.

source: This module *does not* access the internet. All of the components needed to bootstrap ``pip`` are included as internal parts of the package.
fr: Ce module n'accède *pas* au réseau. Tout ce qu'il faut pour amorcer ``pip`` est compris dans le paquet.

source: The end user guide for installing Python packages
fr: Guide de l'utilisateur final pour installer des paquets Python

source: :pep:`453`: Explicit bootstrapping of pip in Python installations
fr: :pep:`453` : Amorçage explicite de pip dans les installations de Python

source: The original rationale and specification for this module.
fr: Les motivations pour l'ajout de ce module et sa spécification d'origine

source: Command line interface
fr: Interface en ligne de commande

source: The command line interface is invoked using the interpreter's ``-m`` switch.
fr: On fait appel à l'interface en ligne de commande à l'aide de l'option ``-m`` de l'interpréteur.

source: The simplest possible invocation is::
fr: L'invocation la plus simple est ::

source: This invocation will install ``pip`` if it is not already installed, but otherwise does nothing. To ensure the installed version of ``pip`` is at least as recent as the one available in ``ensurepip``, pass the ``--upgrade`` option::
fr: Cette commande installe ``pip`` s'il n'est pas déjà présent. Sinon, elle ne fait rien. Pour s'assurer que la version de ``pip`` est au moins aussi récente que celle embarquée dans ``ensurepip``, passer l'option ``--upgrade`` ::

source: By default, ``pip`` is installed into the current virtual environment (if one is active) or into the system site packages (if there is no active virtual environment). The installation location can be controlled through two additional command line options:
fr: ``pip`` est installé par défaut dans l'environnement virtuel courant, s'il y en a un, ou bien dans le dossier ``site-packages`` du système. L'emplacement d'installation se règle à travers deux options :

source: ``--root <dir>``: Installs ``pip`` relative to the given root directory rather than the root of the currently active virtual environment (if any) or the default root for the current Python installation.
fr: ``--root <dossier>`` : installe ``pip`` sur un chemin relatif à la racine *dossier* au lieu de la racine de l'environnement virtuel ou la racine par défaut de l'installation de Python.

source: ``--user``: Installs ``pip`` into the user site packages directory rather than globally for the current Python installation (this option is not permitted inside an active virtual environment).
fr: ``--user`` : installe ``pip`` dans le dossier ``site-packages`` propre à l'utilisateur au lieu du dossier global de l'installation de Python. Cette option n'est pas valide dans un environnement virtuel.

source: By default, the scripts ``pipX`` and ``pipX.Y`` will be installed (where X.Y stands for the version of Python used to invoke ``ensurepip``). The scripts installed can be controlled through two additional command line options:
fr: Par défaut, les commandes ``pipX`` et ``pipX.Y`` sont créées (où X.Y est la version de Python avec laquelle ``ensurepip`` est utilisé). Cela se contrôle par deux options supplémentaires :

source: ``--altinstall``: if an alternate installation is requested, the ``pipX`` script will *not* be installed.
fr: ``--altinstall`` : dans ce mode d'« installation parallèle », seule la commande ``pipX.Y`` est ajoutée, et pas la commande ``pipX``.

source: ``--default-pip``: if a "default pip" installation is requested, the ``pip`` script will be installed in addition to the two regular scripts.
fr: ``--default-pip`` : ce mode d'« installation de la version par défaut » crée la commande ``pip`` en plus de ``pipX`` et ``pipX.Y``.

source: Providing both of the script selection options will trigger an exception.
fr: Combiner ces deux options conduit à une exception.

source: Module API
fr: API du module

source: :mod:`ensurepip` exposes two functions for programmatic use:
fr: Le module :mod:`ensurepip` définit deux fonctions pour utilisation dans les programmes :

source: Returns a string specifying the available version of pip that will be installed when bootstrapping an environment.
fr: Renvoie, sous forme de chaîne, la version de ``pip`` qui serait installée par ``ensurepip``.

source: Bootstraps ``pip`` into the current or designated environment.
fr: Amorce ``pip`` dans l'environnement courant ou un environnement spécifique.

source: *root* specifies an alternative root directory to install relative to. If *root* is ``None``, then installation uses the default install location for the current environment.
fr: Passer *root* permet de changer la racine du chemin d'installation. Si *root* vaut ``None`` (la valeur par défaut), l'installation se fait dans la racine par défaut pour l'environnement courant.

source: *upgrade* indicates whether or not to upgrade an existing installation of an earlier version of ``pip`` to the available version.
fr: *upgrade* indique s'il faut ou non effectuer la mise à jour d'une éventuelle version plus ancienne de ``pip`` déjà installée vers la version embarquée dans ``ensurepip``.

source: *user* indicates whether to use the user scheme rather than installing globally.
fr: Si *user* vaut vrai, ``pip`` est mis dans des chemins qui le rendent disponible pour cet utilisateur uniquement, et non pour tous les utilisateurs de l'installation de Python.

source: By default, the scripts ``pipX`` and ``pipX.Y`` will be installed (where X.Y stands for the current version of Python).
fr: Par défaut, les commandes créées sont ``pipX`` et ``pipX.Y`` (où X.Y est la version de Python).

source: If *altinstall* is set, then ``pipX`` will *not* be installed.
fr: Si *altinstall* vaut vrai, ``pipX`` n'est pas créée.

source: If *default_pip* is set, then ``pip`` will be installed in addition to the two regular scripts.
fr: Si *default_pip* vaut vrai, la commande ``pip`` est créée en plus des deux autres.

source: Setting both *altinstall* and *default_pip* will trigger :exc:`ValueError`.
fr: Le fait de combiner *altinstall* et *default_pip* lève l'exception :exc:`ValueError`.

source: *verbosity* controls the level of output to :data:`sys.stdout` from the bootstrapping operation.
fr: *verbosity* règle le niveau de verbosité des messages émis sur :data:`sys.stdout` pendant l'amorçage.

source: Raises an :ref:`auditing event <auditing>` ``ensurepip.bootstrap`` with argument ``root``.
fr: Cette fonction lève un :ref:`événement d'audit <auditing>` ``ensurepip.bootstrap`` avec l'argument ``root``.

source: The bootstrapping process has side effects on both ``sys.path`` and ``os.environ``. Invoking the command line interface in a subprocess instead allows these side effects to be avoided.
fr: Le processus d'amorçage a des effets de bord sur ``sys.path`` et ``os.environ``. Pour les éviter, on peut appeler l'interface en ligne de commande dans un sous-processus.

source: The bootstrapping process may install additional modules required by ``pip``, but other software should not assume those dependencies will always be present by default (as the dependencies may be removed in a future version of ``pip``).
fr: L'amorçage peut installer des modules supplémentaires qui sont requis pour ``pip``. Les autres programmes ne doivent pas prendre pour acquise la présence de ces modules, car ``pip`` pourrait dans une version future se passer de ces dépendances.
