Repository: python/python-docs-fr
Catalog: library/enum.po
Languages: fr

source: :mod:`enum` --- Support for enumerations
fr: :mod:`enum` — Énumérations

source: **Source code:** :source:`Lib/enum.py`
fr: **Code source :** :source:`Lib/enum.py`

source: This page contains the API reference information. For tutorial information and discussion of more advanced topics, see
fr: Cette page contient les informations de référence de l'API. Pour des informations sur le didacticiel et une discussion sur des sujets plus avancés, reportez-vous à

source: :ref:`Basic Tutorial <enum-basic-tutorial>`
fr: :ref:`Tutoriel de base <enum-basic-tutorial>`

source: :ref:`Advanced Tutorial <enum-advanced-tutorial>`
fr: :ref:`Tutoriel avancé <enum-advanced-tutorial>`

source: :ref:`Enum Cookbook <enum-cookbook>`
fr: :ref:`Recettes pour les énumérations <enum-cookbook>`

source: An enumeration:
fr: Une énumération :

source: is a set of symbolic names (members) bound to unique values
fr: est un ensemble de noms symboliques (appelés membres) liés à des valeurs uniques,

source: uses *call* syntax to return members by value
fr: utilise la syntaxe *d'appel* pour renvoyer les valeurs de ses membres,

source: uses *index* syntax to return members by name
fr: utilise la syntaxe *d'indiçage* pour renvoyer les noms de ses membres.

source: Enumerations are created either by using :keyword:`class` syntax, or by using function-call syntax::
fr: Les énumérations sont créées soit en utilisant la syntaxe :keyword:`class`, soit en utilisant la syntaxe d'appel de fonction ::

source: Even though we can use :keyword:`class` syntax to create Enums, Enums are not normal Python classes. See :ref:`How are Enums different? <enum-class-differences>` for more details.
fr: Même si on peut utiliser la syntaxe :keyword:`class` pour créer des énumérations, les *Enums* ne sont pas des vraies classes Python. Lisez :ref:`En quoi les énumérations sont-elles différentes ? <enum-class-differences>` pour plus de détails.

source: Module Contents
fr: Contenu du module

source: The ``type`` for Enum and its subclasses.
fr: Le ``type`` d'*Enum* et de ses sous-classes.

source: Base class for creating enumerated constants.
fr: Classe mère pour créer une énumération de constantes.

source: Base class for creating enumerated constants that are also subclasses of :class:`int`. (`Notes`_)
fr: Classe mère pour créer une énumération de constantes qui sont également des sous-classes de :class:`int` (`notes`_).

source: Base class for creating enumerated constants that are also subclasses of :class:`str`. (`Notes`_)
fr: Classe mère pour créer une énumération de constantes qui sont également des sous-classes de :class:`str` (`notes`_).

source: Base class for creating enumerated constants that can be combined using the bitwise operations without losing their :class:`Flag` membership.
fr: Classe mère pour créer une énumération de constantes pouvant être combinées avec des opérateurs de comparaison bit-à-bit, sans perdre leur qualité de :class:`Flag`.

source: Base class for creating enumerated constants that can be combined using the bitwise operators without losing their :class:`IntFlag` membership. :class:`IntFlag` members are also subclasses of :class:`int`. (`Notes`_)
fr: Classe mère pour créer une énumération de constantes pouvant être combinées avec des opérateurs de comparaison bit-à-bit, sans perdre leur qualité de :class:`IntFlag`. Les membres de :class:`IntFlag` sont aussi des sous-classes de :class:`int` (`notes`_).

source: An enumeration with the values ``CONTINUOUS``, ``NAMED_FLAGS``, and ``UNIQUE``, for use with :func:`verify` to ensure various constraints are met by a given enumeration.
fr: Énumération avec les valeurs ``CONTINUOUS``, ``NAMED_FLAGS`` et ``UNIQUE``, à utiliser avec :func:`verify` pour s'assurer que diverses contraintes sont satisfaites par une énumération donnée.

source: An enumeration with the values ``STRICT``, ``CONFORM``, ``EJECT``, and ``KEEP`` which allows for more fine-grained control over how invalid values are dealt with in an enumeration.
fr: Énumération avec les valeurs ``STRICT``, ``CONFORM``, ``EJECT`` et ``KEEP`` qui permet un contrôle plus précis sur la façon dont les valeurs invalides sont traitées dans une énumération.

source: Instances are replaced with an appropriate value for Enum members. :class:`StrEnum` defaults to the lower-cased version of the member name, while other Enums default to 1 and increase from there.
fr: Les instances sont remplacées par une valeur appropriée pour les membres de l'énumération. :class:`StrEnum` utilise par défaut la version minuscule du nom du membre, tandis que les autres énumérations utilisent 1 par défaut et puis augmentent.

source: Allows :class:`Enum` members to have attributes without conflicting with member names.
fr: Permet aux membres d'une :class:`Enum` d'avoir des attributs sans entrer en conflit avec les noms des membres.

source: Enum class decorator that ensures only one name is bound to any one value.
fr: Décorateur de classe qui garantit qu'une valeur ne puisse être associée qu'à un seul nom.

source: Enum class decorator that checks user-selectable constraints on an enumeration.
fr: Décorateur de classe qui vérifie des contraintes personnalisées pour une énumération.

source: Make ``obj`` a member. Can be used as a decorator.
fr: Fait de ``obj`` un membre. Peut être utilisé comme décorateur.

source: Do not make ``obj`` a member. Can be used as a decorator.
fr: Fait que ``obj`` n'est pas un membre. Peut être utilisé comme décorateur.

source: Data Types
fr: Types de données

source: *EnumType* is the :term:`metaclass` for *enum* enumerations. It is possible to subclass *EnumType* -- see :ref:`Subclassing EnumType <enumtype-examples>` for details.
fr: *EnumType* est la :term:`métaclasse <metaclass>` pour les énumérations. Il est possible de sous-classer *EnumType* ­— voir :ref:`Sous-classer EnumType <enumtype-examples>` pour plus de détails.

source: Returns ``True`` if member belongs to the ``cls``::
fr: Renvoie ``True`` si le membre appartient à ``cls`` ::

source: In Python 3.12 it will be possible to check for member values and not just members; until then, a ``TypeError`` will be raised if a non-Enum-member is used in a containment check.
fr: Dans Python 3.12, il sera possible de vérifier les valeurs des membres et pas seulement les membres ; en attendant, une ``TypeError`` est levée si un membre non-Enum est utilisé dans une vérification d'appartenance.

source: Returns ``['__class__', '__doc__', '__members__', '__module__']`` and the names of the members in *cls*::
fr: Renvoie ``['__class__', '__doc__', '__members__', '__module__']`` et les noms des membres de *cls* ::

source: Returns the Enum member in *cls* matching *name*, or raises an :exc:`AttributeError`::
fr: Renvoie le membre de l'énumération *cls* correspondant à *name* ou lève une :exc:`AttributeError` ::

source: Returns each member in *cls* in definition order::
fr: Renvoie chaque membre de *cls* dans l'ordre de définition ::

source: Returns the number of member in *cls*::
fr: Renvoie le nombre de membres de *cls* ::

source: Returns each member in *cls* in reverse definition order::
fr: Renvoie chaque membre de *cls* dans l'ordre inverse de définition ::

source: *Enum* is the base class for all *enum* enumerations.
fr: *Enum* est la classe mère de toutes les énumérations.

source: The name used to define the ``Enum`` member::
fr: Le nom utilisé pour définir le membre de l'``Enum`` ::

source: The value given to the ``Enum`` member::
fr: La valeur attribuée au membre de l'``Enum`` ::

source: Enum member values
fr: Valeurs des membres d'une *Enum*

source: ``_ignore_`` is only used during creation and is removed from the enumeration once creation is complete.
fr: ``_ignore_`` n'est utilisé que lors de la création et est supprimé de l'énumération une fois la création terminée.

source: ``_ignore_`` is a list of names that will not become members, and whose names will also be removed from the completed enumeration. See :ref:`TimePeriod <enum-time-period>` for an example.
fr: ``_ignore_`` est une liste de noms qui ne deviendront pas membres et qui seront également supprimés de l'énumération terminée. Voir :ref:`Intervalle de temps <enum-time-period>` pour un exemple.

source: This method is called in two different ways:
fr: Cette méthode peut être appelée de deux manières différentes :

source: to look up an existing member:
fr: pour chercher un membre existant :

source: The enum class being called.
fr: Classe de l'énumération concernée.

source: The value to lookup.
fr: Valeur à chercher.

source: to use the ``cls`` enum to create a new enum:
fr: pour utiliser l'énumération ``cls`` afin de créer une nouvelle énumération :

source: The name of the new Enum to create.
fr: Nom de la nouvelle énumération à créer.

source: The names/values of the members for the new Enum.
fr: Couples nom-valeur des membres de la nouvelle énumération.

source: The name of the module the new Enum is created in.
fr: Nom du module dans lequel la classe *Enum* se trouve.

source: The actual location in the module where this Enum can be found.
fr: Position dans le module où la classe *Enum* se trouve.

source: A mix-in type for the new Enum.
fr: Type à mélanger pour la nouvelle énumération.

source: Returns ``['__class__', '__doc__', '__module__', 'name', 'value']`` and any public methods defined on *self.__class__*::
fr: Renvoie ``['__class__', '__doc__', '__module__', 'name', 'value']`` et toutes les méthodes publiques définies pour *self.__class__* ::

source: The name of the member being defined (e.g. 'RED').
fr: Nom du membre en cours de définition (par ex. ``RED``).

source: The start value for the Enum; the default is 1.
fr: Valeur de départ pour l'énumération ; 1 par défaut.

source: The number of members currently defined, not including this one.
fr: Nombre de membres actuellement définis, le membre actuel n'étant pas inclus.

source: A list of the previous values.
fr: Liste des valeurs précédentes.

source: A *staticmethod* that is used to determine the next value returned by :class:`auto`::
fr: Méthode statique utilisée pour déterminer la prochaine valeur à renvoyer par :class:`auto` ::

source: A *classmethod* that is used to further configure subsequent subclasses. By default, does nothing.
fr: Méthode de classe utilisée pour personnaliser davantage les sous-classes à venir. Ne fait rien par défaut.

source: A *classmethod* for looking up values not found in *cls*. By default it does nothing, but can be overridden to implement custom search behavior::
fr: Méthode de classe pour chercher des valeurs non trouvées dans *cls*. Ne fait rien par défaut mais peut être surchargée pour implémenter un comportement personnalisé de recherche ::

source: Returns the string used for *repr()* calls. By default, returns the *Enum* name, member name, and value, but can be overridden::
fr: Renvoie la chaîne utilisée pour les appels à *repr()*. Par défaut, renvoie le nom de l'énumération, le nom du membre et sa valeur, mais peut être surchargée ::

source: Returns the string used for *str()* calls. By default, returns the *Enum* name and member name, but can be overridden::
fr: Renvoie la chaîne utilisée pour les appels à *str()*. Par défaut, renvoie le nom *Enum* et le nom du membre, mais peut être remplacé ::

source: Using :class:`auto` with :class:`Enum` results in integers of increasing value, starting with ``1``.
fr: L'utilisation de :class:`auto` avec :class:`Enum` donne des nombres entiers de valeur croissante, en commençant par ``1``.

source: *IntEnum* is the same as *Enum*, but its members are also integers and can be used anywhere that an integer can be used. If any integer operation is performed with an *IntEnum* member, the resulting value loses its enumeration status.
fr: *IntEnum* est identique à *Enum*, mais ses membres sont également des entiers et peuvent être utilisés partout où un entier peut être utilisé. Si une opération sur un entier est effectuée avec un membre *IntEnum*, la valeur résultante perd son statut de membre d'énumération.

source: Using :class:`auto` with :class:`IntEnum` results in integers of increasing value, starting with ``1``.
fr: L'utilisation de :class:`auto` avec :class:`IntEnum` donne des entiers de valeur croissante, en commençant par ``1``.

source: *StrEnum* is the same as *Enum*, but its members are also strings and can be used in most of the same places that a string can be used. The result of any string operation performed on or with a *StrEnum* member is not part of the enumeration.
fr: *StrEnum* est identique à *Enum*, mais ses membres sont également des chaînes et peuvent être utilisés dans la plupart des endroits où une chaîne peut être utilisée. Le résultat de toute opération de chaîne effectuée sur ou avec un membre *StrEnum* ne fait pas partie de l'énumération.

source: Using :class:`auto` with :class:`StrEnum` results in the lower-cased member name as the value.
fr: L'utilisation de :class:`auto` avec :class:`StrEnum` donne le nom du membre en minuscule comme valeur.

source: *Flag* members support the bitwise operators ``&`` (*AND*), ``|`` (*OR*), ``^`` (*XOR*), and ``~`` (*INVERT*); the results of those operators are members of the enumeration.
fr: Les membres *Flag* prennent en charge les opérateurs bit-à-bit ``&`` (*ET*), ``|`` (*OU*), ``^`` (*OU EXCLUSIF*) et ``~`` (*NON*) ; les résultats de ces opérations sont membres de l'énumération.

source: Returns *True* if value is in self::
fr: Renvoie *True* si la valeur est dans *self* ::

source: Returns number of members in flag::
fr: Renvoie le nombre de membres de *Flag* ::

source: Returns *True* if any members in flag, *False* otherwise::
fr: Renvoie *True* s'il y a un membre dans les bits de *Flag*, *False* sinon ::

source: Returns current flag binary or'ed with other::
fr: Renvoie le *OU* logique entre le membre et *other* ::

source: Returns current flag binary and'ed with other::
fr: Renvoie le *ET* logique entre le membre et *other* ::

source: Returns current flag binary xor'ed with other::
fr: Renvoie le *OU Exclusif* logique entre le membre et *other* ::

source: Returns all the flags in *type(self)* that are not in self::
fr: Renvoie tous les membres de *type(self)* qui ne sont pas dans *self* (opération logique sur les bits) ::

source: Function used to format any remaining unnamed numeric values. Default is the value's repr; common choices are :func:`hex` and :func:`oct`.
fr: Fonction utilisée pour formater toutes les valeurs numériques sans nom restantes. La valeur par défaut est la représentation de la valeur ; les choix courants sont :func:`hex` et :func:`oct`.

source: Using :class:`auto` with :class:`Flag` results in integers that are powers of two, starting with ``1``.
fr: L'utilisation de :class:`auto` avec :class:`Flag` donne des entiers qui sont des puissances de deux, en commençant par ``1``.

source: The *repr()* of zero-valued flags has changed. It is now::
fr: La *repr()* des membres de valeur zéro a changé. C'est maintenant ::

source: *IntFlag* is the same as *Flag*, but its members are also integers and can be used anywhere that an integer can be used.
fr: *IntFlag* est identique à *Flag*, mais ses membres sont également des entiers et peuvent être utilisés partout où un entier peut être utilisé.

source: If any integer operation is performed with an *IntFlag* member, the result is not an *IntFlag*::
fr: Si une opération sur un entier est effectuée avec un membre d'un *IntFlag*, le résultat n'est pas un *IntFlag* ::

source: If a *Flag* operation is performed with an *IntFlag* member and:
fr: Si une opération *Flag* est effectuée avec un membre *IntFlag* et :

source: the result is a valid *IntFlag*: an *IntFlag* is returned
fr: le résultat est un *IntFlag* valide : un *IntFlag* est renvoyé ;

source: the result is not a valid *IntFlag*: the result depends on the *FlagBoundary* setting
fr: le résultat n'est pas un *IntFlag* valide : le résultat dépend du paramètre *FlagBoundary*.

source: The *repr()* of unnamed zero-valued flags has changed. It is now:
fr: La *repr()* des *intflag* sans nom à valeur nulle a changé. C'est maintenant :

source: Using :class:`auto` with :class:`IntFlag` results in integers that are powers of two, starting with ``1``.
fr: L'utilisation de :class:`auto` avec :class:`IntFlag` donne des entiers qui sont des puissances de deux, en commençant par ``1``.

source: *EnumCheck* contains the options used by the :func:`verify` decorator to ensure various constraints; failed constraints result in a :exc:`ValueError`.
fr: *EnumCheck* contient les options utilisées par le décorateur :func:`verify` pour assurer diverses contraintes ; si une contrainte n'est pas validée, une :exc:`ValueError` est levée.

source: Ensure that each value has only one name::
fr: Assure que chaque valeur n'a qu'un seul nom ::

source: Ensure that there are no missing values between the lowest-valued member and the highest-valued member::
fr: Assure qu'il n'y a pas de valeurs manquantes entre le membre ayant la valeur la plus faible et le membre ayant la valeur la plus élevée ::

source: CONTINUOUS and NAMED_FLAGS are designed to work with integer-valued members.
fr: CONTINUOUS et NAMED_FLAGS sont conçus pour fonctionner avec des membres à valeur entière.

source: *FlagBoundary* controls how out-of-range values are handled in *Flag* and its subclasses.
fr: *FlagBoundary* contrôle la façon dont les valeurs hors plage sont gérées dans *Flag* et ses sous-classes.

source: Out-of-range values cause a :exc:`ValueError` to be raised. This is the default for :class:`Flag`::
fr: Les valeurs hors plage provoquent la levée d'une :exc:`ValueError`. C'est la valeur par défaut pour :class:`Flag` ::

source: Out-of-range values have invalid values removed, leaving a valid *Flag* value::
fr: Les valeurs hors plage, invalides, sont supprimées laissant une valeur *Flag* valide ::

source: Out-of-range values lose their *Flag* membership and revert to :class:`int`. This is the default for :class:`IntFlag`::
fr: Les valeurs hors plage perdent leur appartenance à *Flag* et reviennent à :class:`int`. C'est la valeur par défaut pour :class:`IntFlag` ::

source: Out-of-range values are kept, and the *Flag* membership is kept. This is used for some stdlib flags:
fr: Les valeurs hors plage sont conservées et l'appartenance *Flag* est conservée. C'est utilisé pour certains drapeaux de la bibliothèque standard :

source: Supported ``__dunder__`` names
fr: Noms de la forme ``__dunder__`` disponibles

source: Supported ``_sunder_`` names
fr: Noms de la forme ``_sunder_`` disponibles

source: ``_name_`` -- name of the member
fr: ``_name_`` — nom du membre

source: ``_value_`` -- value of the member; can be set / modified in ``__new__``
fr: ``_value_`` — valeur du membre ; il est possible d'y accéder et de la modifier dans ``__new__``

source: ``_missing_`` -- a lookup function used when a value is not found; may be overridden
fr: ``_missing_`` — fonction de recherche appelée quand la valeur n'est pas trouvée ; elle peut être redéfinie

source: ``_ignore_`` -- a list of names, either as a :class:`list` or a :class:`str`, that will not be transformed into members, and will be removed from the final class
fr: ``_ignore_`` — liste de noms, sous la forme d'une :func:`list` ou d'une :func:`str`, qui ne sont pas convertis en membres et sont supprimés de la classe résultante

source: ``_order_`` -- used in Python 2/3 code to ensure member order is consistent (class attribute, removed during class creation)
fr: ``_order_`` — utilisée en Python 2 ou 3 pour s'assurer que l'ordre des membres est cohérent dans les différentes versions de Python (attribut de classe, supprimé durant la création de la classe)

source: ``_generate_next_value_`` -- used to get an appropriate value for an enum member; may be overridden
fr: ``_generate_next_value_`` — utilisée pour obtenir une valeur appropriée à affecter à un membre de l’énumération ; elle peut être redéfinie

source: For standard :class:`Enum` classes the next value chosen is the last value seen incremented by one.
fr: Pour les classes standard :class:`Enum`, la valeur suivante choisie est la dernière valeur vue incrémentée de un.

source: For :class:`Flag` classes the next value chosen will be the next highest power-of-two, regardless of the last value seen.
fr: Pour les classes :class:`Flag`, la valeur suivante choisie est la puissance de deux la plus élevée suivante, quelle que soit la dernière valeur vue.

source: Utilities and Decorators
fr: Utilitaires et décorateurs

source: ``_generate_next_value_`` can be overridden to customize the values used by *auto*.
fr: ``_generate_next_value_`` peut être surchargée pour personnaliser les valeurs produites par *auto*.

source: A decorator similar to the built-in *property*, but specifically for enumerations. It allows member attributes to have the same names as members themselves.
fr: Décorateur similaire au *property* natif, mais spécifique aux énumérations. Il permet aux attributs de membre d'avoir les mêmes noms que les membres eux-mêmes.

source: the *property* and the member must be defined in separate classes; for example, the *value* and *name* attributes are defined in the *Enum* class, and *Enum* subclasses can define members with the names ``value`` and ``name``.
fr: *property* et le membre doivent être définis dans des classes distinctes ; par exemple, les attributs *value* et *name* sont définis dans la classe *Enum*, et les sous-classes d'*Enum* peuvent définir des membres avec les noms ``value`` et ``name``.

source: A :keyword:`class` decorator specifically for enumerations. Members from :class:`EnumCheck` are used to specify which constraints should be checked on the decorated enumeration.
fr: Décorateur de :keyword:`classe <class>` spécifique aux énumérations. Utilisé pour spécifier quelles contraintes doivent être vérifiées par les membres de l':class:`EnumCheck` décorée.

source: A decorator for use in enums: its target will become a member.
fr: Décorateur à utiliser dans les énumérations : sa cible devient un membre.

source: A decorator for use in enums: its target will not become a member.
fr: Décorateur à utiliser dans les énumérations : sa cible ne devient pas un membre.

source: :class:`IntEnum`, :class:`StrEnum`, and :class:`IntFlag`
fr: :class:`IntEnum`, :class:`StrEnum` et :class:`IntFlag`

source: These three enum types are designed to be drop-in replacements for existing integer- and string-based values; as such, they have extra limitations:
fr: Ces trois types d'énumération sont conçus pour remplacer directement les valeurs existantes basées sur des entiers et des chaînes ; en tant que tels, ils ont des limitations supplémentaires :

source: ``__str__`` uses the value and not the name of the enum member
fr: ``__str__`` utilise la valeur et pas le nom du membre de l'énumération

source: ``__format__``, because it uses ``__str__``, will also use the value of the enum member instead of its name
fr: ``__format__``, parce qu'elle fait appel à ``__str__``, utilise également la valeur du membre de l'énumération au lieu de son nom

source: If you do not need/want those limitations, you can either create your own base class by mixing in the ``int`` or ``str`` type yourself::
fr: Si ces limitations ne vous conviennent pas, vous pouvez créer votre propre classe mère en mélangeant vous-même le type ``int`` ou ``str`` ::

source: or you can reassign the appropriate :meth:`str`, etc., in your enum::
fr: ou vous pouvez réassigner la :meth:`str` appropriée, etc., dans votre énumération ::
