Repository: python/python-docs-fr
Catalog: library/errno.po
Languages: fr

source: :mod:`errno` --- Standard errno system symbols
fr: :mod:`errno` — Symboles du système *errno* standard

source: This module makes available standard ``errno`` system symbols. The value of each symbol is the corresponding integer value. The names and descriptions are borrowed from :file:`linux/include/errno.h`, which should be pretty all-inclusive.
fr: Ce module met à disposition des symboles du système standard ``errno``. La valeur de chaque symbole est la valeur entière correspondante. Les noms et les descriptions sont empruntés à :file:`linux/include/errno.h`, qui devrait être assez exhaustif.

source: Dictionary providing a mapping from the errno value to the string name in the underlying system. For instance, ``errno.errorcode[errno.EPERM]`` maps to ``'EPERM'``.
fr: Dictionnaire associant la valeur *errno* au nom de chaîne dans le système sous-jacent. Par exemple, ``errno.errorcode[errno.EPERM]`` correspond à ``'EPERM'``.

source: To translate a numeric error code to an error message, use :func:`os.strerror`.
fr: Pour traduire un code d'erreur en message d'erreur, utilisez :func:`os.strerror`.

source: Of the following list, symbols that are not used on the current platform are not defined by the module. The specific list of defined symbols is available as ``errno.errorcode.keys()``. Symbols available can include:
fr: De la liste suivante, les symboles qui ne sont pas utilisés dans la plateforme actuelle ne sont pas définis par le module. La liste spécifique des symboles définis est disponible comme ``errno.errorcode.keys()``. Les symboles disponibles font partie de cette liste :

source: Operation not permitted
fr: Opération interdite

source: No such file or directory
fr: Fichier ou répertoire inexistant

source: No such process
fr: Processus inexistant

source: Interrupted system call.
fr: Appel système interrompu

source: This error is mapped to the exception :exc:`InterruptedError`.
fr: Cette erreur est associée à l'exception :exc:`InterruptedError`.

source: I/O error
fr: Erreur d'entrée-sortie

source: No such device or address
fr: Dispositif ou adresse inexistant

source: Arg list too long
fr: Liste d'arguments trop longue

source: Exec format error
fr: Erreur de format d'exécution

source: Bad file number
fr: Mauvais descripteur de fichier

source: No child processes
fr: Pas de processus fils

source: Try again
fr: Ressource temporairement indisponible (réessayez)

source: Out of memory
fr: Mémoire insuffisante

source: Permission denied
fr: Autorisation refusée

source: Bad address
fr: Mauvaise adresse

source: Block device required
fr: Dispositif de bloc requis

source: Device or resource busy
fr: Dispositif ou ressource occupé

source: File exists
fr: Fichier déjà existant

source: Cross-device link
fr: Lien inapproprié

source: No such device
fr: Dispositif inexistant

source: Not a directory
fr: Pas un répertoire

source: Is a directory
fr: Est un répertoire

source: Invalid argument
fr: Argument invalide

source: File table overflow
fr: Plus de descripteur de fichier disponible

source: Too many open files
fr: Trop de fichiers ouverts

source: Not a typewriter
fr: Opération de contrôle d'entrée-sortie invalide

source: Text file busy
fr: Fichier texte occupé

source: File too large
fr: Fichier trop grand

source: No space left on device
fr: Plus de place sur le dispositif

source: Illegal seek
fr: Recherche invalide

source: Read-only file system
fr: Système de fichiers en lecture seule

source: Too many links
fr: Trop de liens symboliques

source: Broken pipe
fr: Tube brisé

source: Math argument out of domain of func
fr: Argument mathématique hors du domaine de définition de la fonction

source: Math result not representable
fr: Résultat mathématique non représentable

source: Resource deadlock would occur
fr: Un interblocage se produirait sur cette ressource

source: File name too long
fr: Nom de fichier trop long

source: No record locks available
fr: Plus de verrou de fichier disponible

source: Function not implemented
fr: Fonction non implémentée

source: Directory not empty
fr: Dossier non vide

source: Too many symbolic links encountered
fr: Trop de liens symboliques trouvés

source: Operation would block
fr: L'opération bloquerait

source: No message of desired type
fr: Pas de message du type voulu

source: Identifier removed
fr: Identifiant supprimé

source: Channel number out of range
fr: Le numéro de canal est hors des limites

source: Level 2 not synchronized
fr: Le niveau 2 n'est pas synchronisé

source: Level 3 halted
fr: Niveau 3 stoppé

source: Level 3 reset
fr: Niveau 3 réinitialisé

source: Link number out of range
fr: Le numéro du lien est hors des limites

source: Protocol driver not attached
fr: Le pilote de protocole n'est pas attaché

source: No CSI structure available
fr: Pas de structure *CSI* disponible

source: Level 2 halted
fr: Niveau 2 stoppé

source: Invalid exchange
fr: Échange invalide

source: Invalid request descriptor
fr: Descripteur de requête invalide

source: Exchange full
fr: Échange complet

source: No anode
fr: Pas de *anode*

source: Invalid request code
fr: Code de requête invalide

source: Invalid slot
fr: *Slot* invalide

source: File locking deadlock error
fr: Interblocage lors du verrouillage de fichier

source: Bad font file format
fr: Mauvais format de fichier de police

source: Device not a stream
fr: Le périphérique n'est pas un flux

source: No data available
fr: Pas de donnée disponible

source: Timer expired
fr: Délai maximal atteint

source: Out of streams resources
fr: Pas assez de ressources de type flux

source: Machine is not on the network
fr: Machine hors réseau

source: Package not installed
fr: Paquet non installé

source: Object is remote
fr: L'objet est distant

source: Link has been severed
fr: Lien coupé

source: Advertise error
fr: Erreur d'annonce

source: Srmount error
fr: Erreur *Srmount*

source: Communication error on send
fr: Erreur de communication lors de l'envoi

source: Protocol error
fr: Erreur de protocole

source: Multihop attempted
fr: Transfert à sauts multiples essayé

source: RFS specific error
fr: erreur spécifique *RFS*

source: Not a data message
fr: Pas un message de données

source: Value too large for defined data type
fr: Valeur trop grande pour être stockée dans ce type de donnée

source: Name not unique on network
fr: Nom non-unique dans le réseau

source: File descriptor in bad state
fr: Descripteur de fichier en mauvais état

source: Remote address changed
fr: Adresse distante changée

source: Can not access a needed shared library
fr: Accès impossible à une bibliothèque partagée nécessaire

source: Accessing a corrupted shared library
fr: Accès à une bibliothèque partagée corrompue

source: .lib section in a.out corrupted
fr: Section *.lib* de *a.out* corrompue

source: Attempting to link in too many shared libraries
fr: Tentative de liaison entre trop de bibliothèques partagées

source: Cannot exec a shared library directly
fr: Impossible d'exécuter directement une bibliothèque partagée

source: Illegal byte sequence
fr: Séquence de *bytes* illégale

source: Interrupted system call should be restarted
fr: Appel système interrompu qui devrait être relancé

source: Streams pipe error
fr: Erreur d’enchaînement de flux

source: Too many users
fr: Trop d'utilisateurs

source: Socket operation on non-socket
fr: Opération d'interface de connexion alors que ce n'est pas une interface de connexion

source: Destination address required
fr: Adresse de destination obligatoire

source: Message too long
fr: Message trop long

source: Protocol wrong type for socket
fr: Mauvais type de protocole pour ce connecteur

source: Protocol not available
fr: Protocole pas disponible

source: Protocol not supported
fr: Protocole non géré

source: Socket type not supported
fr: Type de connecteur non géré

source: Operation not supported on transport endpoint
fr: Opération non gérée par cette fin de lien

source: Protocol family not supported
fr: Famille de protocole non gérée

source: Address family not supported by protocol
fr: Famille d'adresses non gérée par ce protocole

source: Address already in use
fr: Adresse déjà utilisée

source: Cannot assign requested address
fr: Impossible d'assigner l'adresse demandée

source: Network is down
fr: Le réseau est désactivé

source: Network is unreachable
fr: Réseau inaccessible

source: Network dropped connection because of reset
fr: Connexion annulée par le réseau

source: Software caused connection abort
fr: Connexion abandonnée

source: Connection reset by peer
fr: Connexion réinitialisée

source: No buffer space available
fr: Plus d'espace tampon disponible

source: Transport endpoint is already connected
fr: L'interface de connexion est déjà connectée

source: Transport endpoint is not connected
fr: L'interface de connexion n'est pas connectée

source: Cannot send after transport endpoint shutdown
fr: Impossible d'envoyer après l'arrêt du point final du transport

source: Too many references: cannot splice
fr: Trop de descripteurs : impossible d'effectuer la liaison

source: Connection timed out
fr: Délai maximal de connexion écoulé

source: Connection refused
fr: Connexion refusée

source: Host is down
fr: Hôte éteint

source: No route to host
fr: Pas de route vers l'hôte

source: Operation already in progress
fr: Connexion déjà en cours

source: Operation now in progress
fr: Opération en cours

source: Stale NFS file handle
fr: Descripteur de fichier NFS corrompu

source: Structure needs cleaning
fr: La structure a besoin d'être nettoyée

source: Not a XENIX named type file
fr: N'est pas un fichier nommé du type *XENIX*

source: No XENIX semaphores available
fr: Pas de sémaphore *XENIX* disponible

source: Is a named type file
fr: Est un fichier nommé

source: Remote I/O error
fr: Erreur d'entrées-sorties distante

source: Quota exceeded
fr: Quota dépassé
