Repository: python/python-docs-fr
Catalog: library/exceptions.po
Languages: fr

source: Raised by built-in function :func:`next` and an :term:`iterator`\'s :meth:`~iterator.__next__` method to signal that there are no further items produced by the iterator.
fr: Levée par la fonction native :func:`next` et la méthode :meth:`~iterator.__next__` d'un :term:`iterator` (itérateur) pour signaler qu'il n'y a pas d'autres éléments produits par l'itérateur.

source: When a :term:`generator` or :term:`coroutine` function returns, a new :exc:`StopIteration` instance is raised, and the value returned by the function is used as the :attr:`value` parameter to the constructor of the exception.
fr: Lorsqu'une fonction de type :term:`generator` ou :term:`coroutine` retourne une valeur, une nouvelle instance de :exc:`StopIteration` est levée, et la valeur retournée par la fonction est passée au paramètre :attr:`value` du constructeur de l'exception.

source: If a generator code directly or indirectly raises :exc:`StopIteration`, it is converted into a :exc:`RuntimeError` (retaining the :exc:`StopIteration` as the new exception's cause).
fr: Si le code d'un générateur lève, directement ou indirectement, une :exc:`StopIteration`, elle est convertie en :exc:`RuntimeError` (en conservant :exc:`StopIteration` comme cause de la nouvelle exception).

source: Added ``value`` attribute and the ability for generator functions to use it to return a value.
fr: Ajout de l'attribut ``value`` et de la possibilité pour les fonctions de générateur de l'utiliser pour retourner une valeur.

source: Introduced the RuntimeError transformation via ``from __future__ import generator_stop``, see :pep:`479`.
fr: Introduit la transformation des erreurs ``RuntimeError`` via ``from __future__ import generator_stop``, cf. :pep:`479`.

source: Enable :pep:`479` for all code by default: a :exc:`StopIteration` error raised in a generator is transformed into a :exc:`RuntimeError`.
fr: Active :pep:`479` pour tout le code par défaut : quand une erreur :exc:`StopIteration` est levée dans un générateur elle est transformée en une :exc:`RuntimeError`.

source: Raised when the parser encounters a syntax error. This may occur in an :keyword:`import` statement, in a call to the built-in functions :func:`compile`, :func:`exec`, or :func:`eval`, or when reading the initial script or standard input (also interactively).
fr: Levée lorsque l'analyseur syntaxique rencontre une erreur de syntaxe. Cela peut se produire dans une instruction :keyword:`import`, dans un appel aux fonctions natives :func:`compile`, :func:`exec` ou :func:`eval`, ou lors de la lecture du script initial ou de l'entrée standard (également de manière interactive).

source: The :func:`str` of the exception instance returns only the error message. Details is a tuple whose members are also available as separate attributes.
fr: La conversion en chaîne avec :func:`str` de l'instance de l'exception ne renvoie que le message d'erreur. L'argument ``details`` est un *n*-uplet dont les membres sont disponibles en tant qu'attributs séparés.

source: The name of the file the syntax error occurred in.
fr: Le nom du fichier dans lequel l'erreur de syntaxe a été rencontrée.

source: Which line number in the file the error occurred in. This is 1-indexed: the first line in the file has a ``lineno`` of 1.
fr: Le numéro de la ligne dans le fichier où l'erreur s'est produite. L'indiçage commence à 1 : ``lineno`` vaut 1 pour la première ligne du fichier.

source: The column in the line where the error occurred. This is 1-indexed: the first character in the line has an ``offset`` of 1.
fr: La colonne dans la ligne où l'erreur s'est produite. L'indiçage commence à 1 : ``offset`` vaut 1 pour le premier caractère de la ligne.

source: The source code text involved in the error.
fr: Le texte du code source impliqué dans l'erreur.

source: Which line number in the file the error occurred ends in. This is 1-indexed: the first line in the file has a ``lineno`` of 1.
fr: Le numéro de la dernière ligne produisant l'erreur. L'indiçage commence à 1 : ``lineno`` vaut 1 pour la première ligne du fichier.

source: The column in the end line where the error occurred finishes. This is 1-indexed: the first character in the line has an ``offset`` of 1.
fr: Le numéro de la dernière colonne (de la dernière ligne) produisant l'erreur. L'indiçage commence à 1 : ``offset`` vaut 1 pour le premier caractère de la ligne.

source: For errors in f-string fields, the message is prefixed by "f-string: " and the offsets are offsets in a text constructed from the replacement expression. For example, compiling f'Bad {a b} field' results in this args attribute: ('f-string: ...', ('', 1, 2, '(a b)\n', 1, 5)).
fr: Pour les erreurs dans les chaînes de formatage *f-strings*, le message commence par « f-string: » et les champs *offset* sont les décalages dans un texte construit à partir de l’expression de remplacement. Par exemple, compiler ``f'Bad {a b} field'`` produit cet attribut *args* : ``('f-string: ...', ('', 1, 2, '(a b)\n', 1, 5)).``

source: Added the :attr:`end_lineno` and :attr:`end_offset` attributes.
fr: Ajout des attributs :attr:`end_lineno` et :attr:`end_offset`.

source: Base class for syntax errors related to incorrect indentation. This is a subclass of :exc:`SyntaxError`.
fr: Classe mère pour les erreurs de syntaxe liées à une indentation incorrecte. C'est une sous-classe de :exc:`SyntaxError`.

source: Raised when indentation contains an inconsistent use of tabs and spaces. This is a subclass of :exc:`IndentationError`.
fr: Levée lorsqu'une indentation contient une utilisation incohérente des tabulations et des espaces. C'est une sous-classe de :exc:`IndentationError`.

source: Raised when the interpreter finds an internal error, but the situation does not look so serious to cause it to abandon all hope. The associated value is a string indicating what went wrong (in low-level terms).
fr: Levée lorsque l'interpréteur trouve une erreur interne, mais que la situation ne semble pas si grave au point de lui faire abandonner tout espoir. La valeur associée est une chaîne de caractères indiquant l'erreur qui est survenue (en termes bas niveau).

source: You should report this to the author or maintainer of your Python interpreter. Be sure to report the version of the Python interpreter (``sys.version``; it is also printed at the start of an interactive Python session), the exact error message (the exception's associated value) and if possible the source of the program that triggered the error.
fr: Vous devriez le signaler à l'auteur ou au responsable de votre interpréteur Python. Assurez-vous de signaler la version de l'interpréteur (``sys.version`` ; elle est également affichée au lancement d'une session interactive), le message d'erreur exact (la valeur associée à l'exception) et si possible le code source du programme qui a déclenché l'erreur.

source: This exception is raised by the :func:`sys.exit` function. It inherits from :exc:`BaseException` instead of :exc:`Exception` so that it is not accidentally caught by code that catches :exc:`Exception`. This allows the exception to properly propagate up and cause the interpreter to exit. When it is not handled, the Python interpreter exits; no stack traceback is printed. The constructor accepts the same optional argument passed to :func:`sys.exit`. If the value is an integer, it specifies the system exit status (passed to C's :c:func:`exit` function); if it is ``None``, the exit status is zero; if it has another type (such as a string), the object's value is printed and the exit status is one.
fr: Cette exception est levée par la fonction :func:`sys.exit`. Elle hérite de :exc:`BaseException` au lieu d':exc:`Exception` pour ne pas qu'elle soit interceptée accidentellement par du code qui intercepte :exc:`Exception`. Cela permet à l'exception de se propager correctement et de faire quitter l'interpréteur. Lorsqu'elle n'est pas gérée, l'interpréteur Python quitte ; aucune trace d'appels n'est affichée. Le constructeur accepte le même argument optionnel passé à :func:`sys.exit`. Si la valeur est un entier, elle spécifie l'état de sortie du système (passé à la fonction C :c:func:`exit`) ; si elle est ``None``, l'état de sortie est zéro ; si elle a un autre type (comme une chaîne de caractères), la valeur de l'objet est affichée et l'état de sortie est un.

source: A call to :func:`sys.exit` is translated into an exception so that clean-up handlers (:keyword:`finally` clauses of :keyword:`try` statements) can be executed, and so that a debugger can execute a script without running the risk of losing control. The :func:`os._exit` function can be used if it is absolutely positively necessary to exit immediately (for example, in the child process after a call to :func:`os.fork`).
fr: Un appel à :func:`sys.exit` est traduit en une exception pour que les gestionnaires de nettoyage (les clauses :keyword:`finally` des instructions :keyword:`try`) puissent être exécutés, et pour qu'un débogueur puisse exécuter un script sans courir le risque de perdre le contrôle. La fonction :func:`os._exit` peut être utilisée s'il est absolument nécessaire de sortir immédiatement (par exemple, dans le processus enfant après un appel à :func:`os.fork`).

source: The exit status or error message that is passed to the constructor. (Defaults to ``None``.)
fr: L'état de sortie ou le message d'erreur passé au constructeur. (``None`` par défaut.)

source: Raised when an operation or function is applied to an object of inappropriate type. The associated value is a string giving details about the type mismatch.
fr: Levée lorsqu'une opération ou fonction est appliquée à un objet d'un type inapproprié. La valeur associée est une chaîne de caractères donnant des détails sur le type d'inadéquation.

source: This exception may be raised by user code to indicate that an attempted operation on an object is not supported, and is not meant to be. If an object is meant to support a given operation but has not yet provided an implementation, :exc:`NotImplementedError` is the proper exception to raise.
fr: Cette exception peut être levée par du code utilisateur pour indiquer qu'une tentative d'opération sur un objet n'est pas prise en charge, et n'est pas censée l'être. Si un objet est destiné à prendre en charge une opération donnée mais n'a pas encore fourni une implémentation, lever :exc:`NotImplementedError` est plus approprié.

source: Passing arguments of the wrong type (e.g. passing a :class:`list` when an :class:`int` is expected) should result in a :exc:`TypeError`, but passing arguments with the wrong value (e.g. a number outside expected boundaries) should result in a :exc:`ValueError`.
fr: Le passage d'arguments du mauvais type (e.g. passer une :class:`list` quand un :class:`int` est attendu) devrait résulter en un :exc:`TypeError`, mais le passage d'arguments avec la mauvaise valeur (e.g. un nombre en dehors des limites attendues) devrait résulter en une :exc:`ValueError`.

source: Raised when a reference is made to a local variable in a function or method, but no value has been bound to that variable. This is a subclass of :exc:`NameError`.
fr: Levée lorsqu'une référence est faite à une variable locale dans une fonction ou une méthode, mais qu'aucune valeur n'a été liée à cette variable. C'est une sous-classe de :exc:`NameError`.

source: Raised when a Unicode-related encoding or decoding error occurs. It is a subclass of :exc:`ValueError`.
fr: Levée lorsqu'une erreur d'encodage ou de décodage liée à Unicode se produit. C'est une sous-classe de :exc:`ValueError`.

source: :exc:`UnicodeError` has attributes that describe the encoding or decoding error. For example, ``err.object[err.start:err.end]`` gives the particular invalid input that the codec failed on.
fr: :exc:`UnicodeError` a des attributs qui décrivent l'erreur d'encodage ou de décodage. Par exemple, ``err.object[err.start:err.end]`` donne l'entrée particulière invalide sur laquelle le codec a échoué.

source: The name of the encoding that raised the error.
fr: Le nom de l'encodage qui a provoqué l'erreur.

source: A string describing the specific codec error.
fr: Une chaîne de caractères décrivant l'erreur de codec spécifique.

source: The object the codec was attempting to encode or decode.
fr: L'objet que le codec essayait d'encoder ou de décoder.

source: The first index of invalid data in :attr:`object`.
fr: Le premier index des données invalides dans :attr:`object`.

source: The index after the last invalid data in :attr:`object`.
fr: L'index après la dernière donnée invalide dans :attr:`object`.

source: Raised when a Unicode-related error occurs during encoding. It is a subclass of :exc:`UnicodeError`.
fr: Levée lorsqu'une erreur liée à Unicode se produit durant l'encodage. C'est une sous-classe d':exc:`UnicodeError`.

source: Raised when a Unicode-related error occurs during decoding. It is a subclass of :exc:`UnicodeError`.
fr: Levée lorsqu'une erreur liée à Unicode se produit durant le décodage. C'est une sous-classe d':exc:`UnicodeError`.

source: Raised when a Unicode-related error occurs during translating. It is a subclass of :exc:`UnicodeError`.
fr: Levée lorsqu'une erreur liée à Unicode se produit durant la traduction. C'est une sous-classe d':exc:`UnicodeError`.

source: Raised when an operation or function receives an argument that has the right type but an inappropriate value, and the situation is not described by a more precise exception such as :exc:`IndexError`.
fr: Levée lorsqu'une opération ou fonction native reçoit un argument qui possède le bon type mais une valeur inappropriée, et que la situation n'est pas décrite par une exception plus précise telle que :exc:`IndexError`.

source: Raised when the second argument of a division or modulo operation is zero. The associated value is a string indicating the type of the operands and the operation.
fr: Levée lorsque le second argument d'une opération de division ou d'un modulo est zéro. La valeur associée est une chaîne indiquant le type des opérandes et de l'opération.

source: The following exceptions are kept for compatibility with previous versions; starting from Python 3.3, they are aliases of :exc:`OSError`.
fr: Les exceptions suivantes sont conservées pour la compatibilité avec les anciennes versions ; depuis Python 3.3, ce sont des alias d':exc:`OSError`.

source: Only available on Windows.
fr: Seulement disponible sous Windows.

source: OS exceptions
fr: Exceptions système

source: The following exceptions are subclasses of :exc:`OSError`, they get raised depending on the system error code.
fr: Les exceptions suivantes sont des sous-classes d':exc:`OSError`, elles sont levées en fonction du code d'erreur système.

source: In addition to those of :exc:`OSError`, :exc:`BlockingIOError` can have one more attribute:
fr: En plus de ceux de :exc:`OSError`, :exc:`BlockingIOError` peut avoir un attribut de plus :

source: An integer containing the number of characters written to the stream before it blocked. This attribute is available when using the buffered I/O classes from the :mod:`io` module.
fr: Un nombre entier contenant le nombre de caractères écrits dans le flux avant qu'il ne soit bloqué. Cet attribut est disponible lors de l'utilisation des classes tampon entrées-sorties du module :mod:`io`.

source: A base class for connection-related issues.
fr: Classe mère pour les problèmes de connexion.

source: Subclasses are :exc:`BrokenPipeError`, :exc:`ConnectionAbortedError`, :exc:`ConnectionRefusedError` and :exc:`ConnectionResetError`.
fr: Les sous-classes sont :exc:`BrokenPipeError`, :exc:`ConnectionAbortedError`, :exc:`ConnectionRefusedError` et :exc:`ConnectionResetError`.

source: Python now retries system calls when a syscall is interrupted by a signal, except if the signal handler raises an exception (see :pep:`475` for the rationale), instead of raising :exc:`InterruptedError`.
fr: Python relance maintenant les appels système lorsqu'ils sont interrompus par un signal, sauf si le gestionnaire de signal lève une exception (voir :pep:`475` pour les raisons), au lieu de lever :exc:`InterruptedError`.

source: All the above :exc:`OSError` subclasses were added.
fr: Toutes les sous-classes d':exc:`OSError` ci-dessus ont été ajoutées.

source: :pep:`3151` - Reworking the OS and IO exception hierarchy
fr: :pep:`3151` -- Refonte de la hiérarchie des exceptions système et IO

source: Warnings
fr: Avertissements

source: The following exceptions are used as warning categories; see the :ref:`warning-categories` documentation for more details.
fr: Les exceptions suivantes sont utilisées comme catégories d'avertissement ; voir :mod:`warning-categories` pour plus d'informations.

source: Base class for warning categories.
fr: Classe mère pour les catégories d'avertissement.

source: Base class for warnings generated by user code.
fr: Classe mère pour les avertissements générés par du code utilisateur.

source: Base class for warnings about deprecated features when those warnings are intended for other Python developers.
fr: Classe mère pour les avertissements sur les fonctionnalités obsolètes, lorsque ces avertissements sont destinés aux autres développeurs Python.

source: Ignored by the default warning filters, except in the ``__main__`` module (:pep:`565`). Enabling the :ref:`Python Development Mode <devmode>` shows this warning.
fr: Ignoré par les filtres d'avertissements par défaut, sauf dans le module ``__main__`` (:pep:`565`). Activer le :ref:`mode de développement de Python <devmode>` affiche cet avertissement.

source: The deprecation policy is described in :pep:`387`.
fr: La politique relative à l'obsolescence est décrite dans la :pep:`387`.

source: Base class for warnings about features which are obsolete and expected to be deprecated in the future, but are not deprecated at the moment.
fr: Classe mère pour les avertissements d'obsolescence programmée. Ils indiquent que la fonctionnalité peut encore être utilisée actuellement, mais qu'elle sera supprimée dans le futur.

source: This class is rarely used as emitting a warning about a possible upcoming deprecation is unusual, and :exc:`DeprecationWarning` is preferred for already active deprecations.
fr: Cette classe est rarement utilisée car émettre un avertissement à propos d’une obsolescence à venir est inhabituel, et :exc:`DeprecationWarning` est préféré pour les obsolescences actuelles.

source: Ignored by the default warning filters. Enabling the :ref:`Python Development Mode <devmode>` shows this warning.
fr: Ignoré par les filtres d'avertissements par défaut. Activer le :ref:`mode de développement de Python <devmode>` affiche cet avertissement.

source: Base class for warnings about dubious syntax.
fr: Classe mère pour les avertissements sur de la syntaxe douteuse.

source: Base class for warnings about dubious runtime behavior.
fr: Classe mère pour les avertissements sur les comportements d'exécution douteux.

source: Base class for warnings about deprecated features when those warnings are intended for end users of applications that are written in Python.
fr: Classe mère pour les avertissements à propos de fonctionnalités qui seront obsolètes dans le futur quand ces avertissements destinés aux utilisateurs finaux des applications écrites en Python.

source: Base class for warnings about probable mistakes in module imports.
fr: Classe mère pour les avertissements sur des erreurs probables dans les importations de modules.

source: Base class for warnings related to Unicode.
fr: Classe mère pour les avertissements liés à l'Unicode.

source: Base class for warnings related to encodings.
fr: Classe mère pour les avertissements liés à l'encodage des chaînes.

source: See :ref:`io-encoding-warning` for details.
fr: Voir :ref:`io-encoding-warning` pour plus d'informations.

source: Base class for warnings related to :class:`bytes` and :class:`bytearray`.
fr: Classe mère pour les avertissements liés à :class:`bytes` et :class:`bytearray`.

source: Base class for warnings related to resource usage.
fr: Classe mère pour les avertissements liés à l'utilisation des ressources.

source: Exception hierarchy
fr: Hiérarchie des exceptions

source: The class hierarchy for built-in exceptions is:
fr: La hiérarchie de classes pour les exceptions natives est la suivante :

source: statement
fr: instruction

source: __cause__ (exception attribute)
fr: ``__cause__`` (attribut d’exception)

source: __context__ (exception attribute)
fr: ``__context__`` (attribut d’exception)
