Repository: python/python-docs-fr
Catalog: library/exceptions.po
Languages: fr

source: Built-in Exceptions
fr: Exceptions natives

source: In Python, all exceptions must be instances of a class that derives from :class:`BaseException`. In a :keyword:`try` statement with an :keyword:`except` clause that mentions a particular class, that clause also handles any exception classes derived from that class (but not exception classes from which *it* is derived). Two exception classes that are not related via subclassing are never equivalent, even if they have the same name.
fr: En python, une exception est une instance d'une classe héritée de :class:`BaseException`. Dans un bloc :keyword:`try`, la clause :keyword:`except` traite non seulement la classe d'exception qu'elle mentionne, mais aussi toutes les classes dérivées de cette classe (contrairement à ses classes mères). Deux classes qui ne sont pas liées par héritage ne sont jamais équivalentes, même si elles ont le même nom.

source: User code can raise built-in exceptions. This can be used to test an exception handler or to report an error condition "just like" the situation in which the interpreter raises the same exception; but beware that there is nothing to prevent user code from raising an inappropriate error.
fr: Du code utilisateur peut lever des exceptions natives. Cela peut être utilisé pour tester un gestionnaire d'exception ou pour rapporter une condition d'erreur "comme si" c'était l'interpréteur qui levait cette exception ; mais attention car rien n'empêche du code utilisateur de lever une erreur inappropriée.

source: The built-in exception classes can be subclassed to define new exceptions; programmers are encouraged to derive new exceptions from the :exc:`Exception` class or one of its subclasses, and not from :exc:`BaseException`. More information on defining exceptions is available in the Python Tutorial under :ref:`tut-userexceptions`.
fr: Les classes d'exception natives peuvent être héritées pour définir de nouvelles exceptions ; les programmeurs sont encouragés à faire dériver les nouvelles exceptions de la classe :exc:`Exception` ou d'une de ses sous-classes, et non de :exc:`BaseException`. Plus d'informations sur la définition des exceptions sont disponibles dans le Tutoriel Python au chapitre :ref:`tut-userexceptions`.

source: Exception context
fr: Contexte des exceptions

source: This implicit exception context can be supplemented with an explicit cause by using :keyword:`!from` with :keyword:`raise`::
fr: Ce contexte implicite d'exception peut être complété par une cause explicite en utilisant :keyword:`!from` avec :keyword:`raise` ::

source: In either case, the exception itself is always shown after any chained exceptions so that the final line of the traceback always shows the last exception that was raised.
fr: Dans les deux cas, l'exception elle-même est toujours affichée après toutes les exceptions enchaînées, de sorte que la dernière ligne de la trace d'appels montre toujours la dernière exception qui a été levée.

source: Inheriting from built-in exceptions
fr: Hériter des exceptions natives

source: User code can create subclasses that inherit from an exception type. It's recommended to only subclass one exception type at a time to avoid any possible conflicts between how the bases handle the ``args`` attribute, as well as due to possible memory layout incompatibilities.
fr: Le code de l'utilisateur peut créer des sous-classes qui dérivent d'un type d'exception. Il est recommandé de ne dériver que d'un seul type d'exception à la fois pour éviter des conflits possibles dans la façon dont les classes mères traitent l'argument ``args`` ainsi que des incompatibilités potentielles avec l'utilisation de la mémoire.

source: Most built-in exceptions are implemented in C for efficiency, see: :source:`Objects/exceptions.c`. Some have custom memory layouts which makes it impossible to create a subclass that inherits from multiple exception types. The memory layout of a type is an implementation detail and might change between Python versions, leading to new conflicts in the future. Therefore, it's recommended to avoid subclassing multiple exception types altogether.
fr: La majorité des exceptions natives sont implémentées en C pour des raisons d'efficacité, voir :source:`Objects/exceptions.c`. L'architecture interne de certaines est telle que cela rend impossible la création de sous-classes qui dérivent de plusieurs types d'exceptions. L'agencement de la mémoire est un détail d'implémentation qui est sujet à changement d'une version de Python à l'autre, ce qui peut poser conflit dans le futur. Il est donc déconseillé de dériver de plusieurs types d'exceptions.

source: Base classes
fr: Classes mères

source: The following exceptions are used mostly as base classes for other exceptions.
fr: Les exceptions suivantes sont utilisées principalement en tant que classes mères pour d'autres exceptions.

source: The base class for all built-in exceptions. It is not meant to be directly inherited by user-defined classes (for that, use :exc:`Exception`). If :func:`str` is called on an instance of this class, the representation of the argument(s) to the instance are returned, or the empty string when there were no arguments.
fr: La classe mère pour toutes les exceptions natives. Elle n'est pas vouée à être héritée directement par des classes utilisateur (pour cela, utilisez :exc:`Exception`). Si :func:`str` est appelée sur une instance de cette classe, la représentation du ou des argument(s) de l'instance est retournée, ou la chaîne vide s'il n'y avait pas d'arguments.

source: The tuple of arguments given to the exception constructor. Some built-in exceptions (like :exc:`OSError`) expect a certain number of arguments and assign a special meaning to the elements of this tuple, while others are usually called only with a single string giving an error message.
fr: Le *n*-uplet d'arguments donné au constructeur d'exception. Certaines exceptions natives (comme :exc:`OSError`) attendent un certain nombre d'arguments et attribuent une signification spéciale aux éléments de ce *n*-uplet, alors que d'autres ne sont généralement appelées qu'avec une seule chaîne de caractères rendant un message d'erreur.

source: This method sets *tb* as the new traceback for the exception and returns the exception object. It was more commonly used before the exception chaining features of :pep:`3134` became available. The following example shows how we can convert an instance of ``SomeException`` into an instance of ``OtherException`` while preserving the traceback. Once raised, the current frame is pushed onto the traceback of the ``OtherException``, as would have happened to the traceback of the original ``SomeException`` had we allowed it to propagate to the caller. ::
fr: Cette méthode affecte *tb* comme la nouvelle trace d'appels de l'exception et renvoie l'objet exception. Elle était utilisée de façon plus courante avant que la fonctionnalité de chaînage des exceptions de la :pep:`3134` devienne disponible. L'exemple suivant démontre comment convertir une instance de ``SomeException`` en une instance de ``OtherException`` tout en préservant la pile d'appels. Une fois l'exception levée, le cadre courant est empilé sur la trace d'appels de ``OtherException``, comme cela se serait produit pour la trace d'appels de ``SomeException`` si on l'avait laissée se propager jusqu'à l'appelant ::

source: All built-in, non-system-exiting exceptions are derived from this class. All user-defined exceptions should also be derived from this class.
fr: Toutes les exceptions natives, qui n'entraînent pas une sortie du système dérivent de cette classe. Toutes les exceptions définies par l'utilisateur devraient également être dérivées de cette classe.

source: The base class for those built-in exceptions that are raised for various arithmetic errors: :exc:`OverflowError`, :exc:`ZeroDivisionError`, :exc:`FloatingPointError`.
fr: La classe mère pour les exceptions natives qui sont levées pour diverses erreurs arithmétiques : :exc:`OverflowError`, :exc:`ZeroDivisionError`, :exc:`FloatingPointError`.

source: Raised when a :ref:`buffer <bufferobjects>` related operation cannot be performed.
fr: Levée lorsqu'une opération liée à un :ref:`tampon <bufferobjects>` ne peut pas être exécutée.

source: The base class for the exceptions that are raised when a key or index used on a mapping or sequence is invalid: :exc:`IndexError`, :exc:`KeyError`. This can be raised directly by :func:`codecs.lookup`.
fr: La classe mère pour les exceptions qui sont levées lorsqu'une clé ou un index utilisé sur un tableau de correspondances ou une séquence est invalide : :exc:`IndexError`, :exc:`KeyError`. Peut être levée directement par :func:`codecs.lookup`.

source: Concrete exceptions
fr: Exceptions concrètes

source: The following exceptions are the exceptions that are usually raised.
fr: Les exceptions suivantes sont celles qui sont habituellement levées.

source: Raised when an :keyword:`assert` statement fails.
fr: Levée lorsqu'une instruction :keyword:`assert` échoue.

source: Raised when an attribute reference (see :ref:`attribute-references`) or assignment fails. (When an object does not support attribute references or attribute assignments at all, :exc:`TypeError` is raised.)
fr: Levée lorsqu'une référence ou une assignation d'attribut (voir :ref:`attribute-references`) échoue. (Lorsqu'un objet ne supporte pas du tout la référence ou l'assignation d'attribut, :exc:`TypeError` est levé.)

source: The :attr:`name` and :attr:`obj` attributes can be set using keyword-only arguments to the constructor. When set they represent the name of the attribute that was attempted to be accessed and the object that was accessed for said attribute, respectively.
fr: Les attributs :attr:`name` et :attr:`obj` peuvent être définis uniquement à l'aide d'arguments nommés passés au constructeur. Lorsqu'ils sont définis, ils représentent respectivement le nom de l'attribut pour lequel il y a eu une tentative d'accès et l'objet qui a été accédé pour cet attribut.

source: Added the :attr:`name` and :attr:`obj` attributes.
fr: Ajout des attributs :attr:`name` et :attr:`obj`.

source: Raised when the :func:`input` function hits an end-of-file condition (EOF) without reading any data. (N.B.: the :meth:`io.IOBase.read` and :meth:`io.IOBase.readline` methods return an empty string when they hit EOF.)
fr: Levée lorsque la fonction :func:`input` atteint une condition de fin de fichier (EOF) sans lire aucune donnée. (N.B. : les méthodes :meth:`io.IOBase.read` et :meth:`io.IOBase.readline` retournent une chaîne vide lorsqu'elles atteignent EOF.)

source: Not currently used.
fr: N’est pas utilisé pour le moment.

source: Raised when a :term:`generator` or :term:`coroutine` is closed; see :meth:`generator.close` and :meth:`coroutine.close`. It directly inherits from :exc:`BaseException` instead of :exc:`Exception` since it is technically not an error.
fr: Levée lorsqu'un :term:`generator` ou une :term:`coroutine` est fermé, voir :meth:`generator.close` et :meth:`coroutine.close`. Elle hérite directement de :exc:`BaseException` au lieu de :exc:`Exception` puisqu'il ne s'agit pas techniquement d'une erreur.

source: Raised when the :keyword:`import` statement has troubles trying to load a module. Also raised when the "from list" in ``from ... import`` has a name that cannot be found.
fr: Levée lorsque l'instruction :keyword:`import` a des problèmes pour essayer de charger un module. Également levée lorsque Python ne trouve pas un nom dans ``from ... import``.

source: Added the :attr:`name` and :attr:`path` attributes.
fr: Ajout des attributs :attr:`name` et :attr:`path`.

source: A subclass of :exc:`ImportError` which is raised by :keyword:`import` when a module could not be located. It is also raised when ``None`` is found in :data:`sys.modules`.
fr: Une sous-classe de :exc:`ImportError` qui est levée par :keyword:`import` lorsqu'un module n'a pas pu être localisé. Elle est généralement levée quand ``None`` est trouvé dans :data:`sys.modules`.

source: Raised when a sequence subscript is out of range. (Slice indices are silently truncated to fall in the allowed range; if an index is not an integer, :exc:`TypeError` is raised.)
fr: Levée lorsqu'un indice de séquence est hors de la plage. (Les indices de tranches (*slices*) sont tronqués silencieusement pour tomber dans la plage autorisée ; si un indice n'est pas un entier, :exc:`TypeError` est levée.)

source: Raised when a mapping (dictionary) key is not found in the set of existing keys.
fr: Levée lorsqu'une clef (de dictionnaire) n'est pas trouvée dans l'ensemble des clefs existantes.

source: Raised when the user hits the interrupt key (normally :kbd:`Control-C` or :kbd:`Delete`). During execution, a check for interrupts is made regularly. The exception inherits from :exc:`BaseException` so as to not be accidentally caught by code that catches :exc:`Exception` and thus prevent the interpreter from exiting.
fr: Levée lorsque l'utilisateur appuie sur la touche d'interruption (normalement :kbd:`Control-C` or :kbd:`Delete`). Pendant l'exécution, un contrôle des interruptions est effectué régulièrement. L'exception hérite de :exc:`BaseException` afin de ne pas être accidentellement interceptée par du code qui intercepte :exc:`Exception` et ainsi empêcher l'interpréteur de quitter.

source: Catching a :exc:`KeyboardInterrupt` requires special consideration. Because it can be raised at unpredictable points, it may, in some circumstances, leave the running program in an inconsistent state. It is generally best to allow :exc:`KeyboardInterrupt` to end the program as quickly as possible or avoid raising it entirely. (See :ref:`handlers-and-exceptions`.)
fr: Attraper une :exc:`KeyboardInterrupt` demande une considération particulière. Comme elle peut être levée à des moments imprévisibles, elle peut dans certains cas laisser le programme en cours d'exécution dans un état incohérent. Il est généralement préférable de laisser :exc:`KeyboardInterrupt` arrêter le programme aussi rapidement que possible ou d'éviter catégoriquement de la lever (voir :ref:`handlers-and-exceptions`).

source: Raised when an operation runs out of memory but the situation may still be rescued (by deleting some objects). The associated value is a string indicating what kind of (internal) operation ran out of memory. Note that because of the underlying memory management architecture (C's :c:func:`malloc` function), the interpreter may not always be able to completely recover from this situation; it nevertheless raises an exception so that a stack traceback can be printed, in case a run-away program was the cause.
fr: Levée lorsqu'une opération est à court de mémoire mais que la situation peut encore être rattrapée (en supprimant certains objets). La valeur associée est une chaîne de caractères indiquant quel type d'opération (interne) est à court de mémoire. À noter qu'en raison de l'architecture interne de gestion de la mémoire (la fonction :c:func:`malloc` du C), l'interpréteur peut ne pas toujours être capable de rattraper cette situation ; il lève néanmoins une exception pour qu'une pile d'appels puisse être affichée, dans le cas où un programme en cours d'exécution en était la cause.

source: Raised when a local or global name is not found. This applies only to unqualified names. The associated value is an error message that includes the name that could not be found.
fr: Levée lorsqu'un nom local ou global n'est pas trouvé. Ceci ne s'applique qu'aux noms non qualifiés. La valeur associée est un message d'erreur qui inclut le nom qui n'a pas pu être trouvé.

source: The :attr:`name` attribute can be set using a keyword-only argument to the constructor. When set it represent the name of the variable that was attempted to be accessed.
fr: L'attribut :attr:`name` doit être défini uniquement à l'aide d'un argument nommé passé au constructeur. Lorsqu'il est défini, il représente le nom de la variable pour laquelle il y a eu une tentative d'accès.

source: Added the :attr:`name` attribute.
fr: Ajout de l'attribut :attr:`name`.

source: This exception is derived from :exc:`RuntimeError`. In user defined base classes, abstract methods should raise this exception when they require derived classes to override the method, or while the class is being developed to indicate that the real implementation still needs to be added.
fr: Cette exception est dérivée de :exc:`RuntimeError`. Dans les classes mères définies par l'utilisateur, les méthodes abstraites devraient lever cette exception lorsqu'elles nécessitent des classes dérivées pour remplacer la méthode, ou lorsque la classe est en cours de développement pour indiquer que l'implémentation concrète doit encore être ajoutée.

source: It should not be used to indicate that an operator or method is not meant to be supported at all -- in that case either leave the operator / method undefined or, if a subclass, set it to :data:`None`.
fr: Elle ne devrait pas être utilisée pour indiquer qu'un opérateur ou qu'une méthode n'est pas destiné à être pris en charge du tout – dans ce cas, évitez de définir l'opérateur ou la méthode, ou s'il s'agit d'une sous-classe, assignez-le à :data:`None`.

source: This exception is raised when a system function returns a system-related error, including I/O failures such as "file not found" or "disk full" (not for illegal argument types or other incidental errors).
fr: Cette exception est levée lorsqu'une fonction système retourne une erreur liée au système, incluant les erreurs entrées-sorties telles que "fichier non trouvé" ou "disque plein" (pas pour les types d'arguments illégaux ou d'autres erreurs accidentelles).

source: The second form of the constructor sets the corresponding attributes, described below. The attributes default to :const:`None` if not specified. For backwards compatibility, if three arguments are passed, the :attr:`~BaseException.args` attribute contains only a 2-tuple of the first two constructor arguments.
fr: La deuxième forme du constructeur définit les attributs correspondants, décrits ci-dessous. Les attributs par défaut sont :const:`None` si non spécifiés. Pour la rétrocompatibilité, si trois arguments sont passés, l'attribut :attr:`~BaseException.args` contient seulement une paire avec les valeurs des deux premiers arguments du constructeur.

source: The constructor often actually returns a subclass of :exc:`OSError`, as described in `OS exceptions`_ below. The particular subclass depends on the final :attr:`.errno` value. This behaviour only occurs when constructing :exc:`OSError` directly or via an alias, and is not inherited when subclassing.
fr: Le constructeur retourne souvent une sous-classe d':exc:`OSError`, comme décrit dans `OS exceptions`_ ci-dessous. La sous-classe particulière dépend de la valeur finale d':attr:`.errno`. Ce comportement ne se produit que lors de la construction d':exc:`OSError` directement ou via un alias, et n'est pas hérité lors du sous-classement.

source: A numeric error code from the C variable :c:data:`errno`.
fr: Code d'erreur numérique de la variable C :c:data:`errno`.

source: Under Windows, this gives you the native Windows error code. The :attr:`.errno` attribute is then an approximate translation, in POSIX terms, of that native error code.
fr: Sous Windows, cela donne le code d'erreur Windows natif. L'attribut :attr:`.errno` est alors une traduction approximative, en termes POSIX, de ce code d'erreur natif.

source: Under Windows, if the *winerror* constructor argument is an integer, the :attr:`.errno` attribute is determined from the Windows error code, and the *errno* argument is ignored. On other platforms, the *winerror* argument is ignored, and the :attr:`winerror` attribute does not exist.
fr: Sous Windows, si l'argument du constructeur *winerror* est un entier, l'attribut :attr:`.errno` est déterminé à partir du code d'erreur Windows, et l'argument *errno* est ignoré. Sur d'autres plateformes, l'argument *winerror* est ignoré, et l'attribut :attr:`winerror` n'existe pas.

source: The corresponding error message, as provided by the operating system. It is formatted by the C functions :c:func:`perror` under POSIX, and :c:func:`FormatMessage` under Windows.
fr: Le message d'erreur correspondant, tel que fourni par le système d'exploitation. Il est formaté par les fonctions C :c:func:`perror` sous POSIX, et :c:func:`FormatMessage` sous Windows.

source: For exceptions that involve a file system path (such as :func:`open` or :func:`os.unlink`), :attr:`filename` is the file name passed to the function. For functions that involve two file system paths (such as :func:`os.rename`), :attr:`filename2` corresponds to the second file name passed to the function.
fr: Pour les exceptions qui font référence à un chemin d'accès au système de fichiers (comme :func:`open` ou :func:`os.unlink`), :attr:`filename` est le nom du fichier transmis à la fonction. Pour les fonctions qui font référence à deux chemins d'accès au système de fichiers (comme :func:`os.rename`), :attr:`filename2` correspond au deuxième nom de fichier passé à la fonction.

source: :exc:`EnvironmentError`, :exc:`IOError`, :exc:`WindowsError`, :exc:`socket.error`, :exc:`select.error` and :exc:`mmap.error` have been merged into :exc:`OSError`, and the constructor may return a subclass.
fr: :exc:`EnvironmentError`, :exc:`IOError`, :exc:`WindowsError`, :exc:`socket.error`, :exc:`select.error` et :exc:`mmap.error` ont fusionnées en :exc:`OSError`, et le constructeur peut renvoyer une sous-classe.

source: The :attr:`filename` attribute is now the original file name passed to the function, instead of the name encoded to or decoded from the :term:`filesystem encoding and error handler`. Also, the *filename2* constructor argument and attribute was added.
fr: L'attribut :attr:`filename` est maintenant le nom du fichier originel passé à la fonction, au lieu du nom encodé ou décodé à partir du :term:`gestionnaire d'encodage et d'erreur du système de fichiers <filesystem encoding and error handler>`. De plus, l'argument du constructeur et attribut *filename2* a été ajouté.

source: Previously, a plain :exc:`RuntimeError` was raised.
fr: Auparavant, une simple :exc:`RuntimeError` était levée.

source: This exception is derived from :exc:`RuntimeError`. It is raised when the interpreter detects that the maximum recursion depth (see :func:`sys.getrecursionlimit`) is exceeded.
fr: Cette exception est dérivée de :exc:`RuntimeError`. Elle est levée lorsque l'interpréteur détecte que la profondeur de récursivité maximale (voir :func:`sys.getrecursionlimit`) est dépassée.

source: This exception is raised when a weak reference proxy, created by the :func:`weakref.proxy` function, is used to access an attribute of the referent after it has been garbage collected. For more information on weak references, see the :mod:`weakref` module.
fr: Cette exception est levée lorsqu'un pointeur faible d'un objet proxy, créé par la fonction :func:`weakref.proxy`, est utilisé pour accéder à un attribut du référent après qu'il ait été récupéré par le ramasse-miettes. Pour plus d'informations sur les pointeurs faibles, voir le module :mod:`weakref`.

source: Raised when an error is detected that doesn't fall in any of the other categories. The associated value is a string indicating what precisely went wrong.
fr: Levée lorsqu'une erreur qui n'appartient à aucune des autres catégories est détectée. La valeur associée est une chaîne de caractères indiquant précisément ce qui s'est mal passé.
