Repository: python/python-docs-fr
Catalog: library/fileinput.po
Languages: fr

source: :mod:`fileinput` --- Iterate over lines from multiple input streams
fr: :mod:`fileinput` — Parcourt les lignes provenant de plusieurs entrées

source: **Source code:** :source:`Lib/fileinput.py`
fr: **Code source :** :source:`Lib/fileinput.py`

source: This module implements a helper class and functions to quickly write a loop over standard input or a list of files. If you just want to read or write one file see :func:`open`.
fr: Ce module offre une classe auxiliaire et des fonctions pour lire facilement l'entrée standard ou bien les fichiers d'une liste. Si vous n'avez besoin de lire ou écrire qu'un seul fichier, il suffit de :func:`open`.

source: The typical use is::
fr: Ce module s'utilise le plus couramment comme ceci :

source: This iterates over the lines of all files listed in ``sys.argv[1:]``, defaulting to ``sys.stdin`` if the list is empty. If a filename is ``'-'``, it is also replaced by ``sys.stdin`` and the optional arguments *mode* and *openhook* are ignored. To specify an alternative list of filenames, pass it as the first argument to :func:`.input`. A single file name is also allowed.
fr: Ce code traite une à une les lignes des fichiers de ``sys.argv[1:]``. Si cette liste est vide (pas d'argument en ligne de commande), il lit l'entrée standard. Le nom de fichier ``'-'`` est équivalent à l'entrée standard (les arguments facultatifs *mode* et *openhook* sont ignorés dans ce cas). On peut aussi passer la liste des fichiers comme argument à :func:`.input`, voire un nom de fichier unique.

source: All files are opened in text mode by default, but you can override this by specifying the *mode* parameter in the call to :func:`.input` or :class:`FileInput`. If an I/O error occurs during opening or reading a file, :exc:`OSError` is raised.
fr: Par défaut, tous les fichiers sont ouverts en mode texte. On peut changer ce comportement à l'aide du paramètre *mode* de la fonction :func:`.input` ou du constructeur de :class:`FileInput`. Si une erreur d'entrée-sortie se produit durant l'ouverture ou la lecture d'un fichier, l'exception :exc:`OSError` est levée.

source: :exc:`IOError` used to be raised; it is now an alias of :exc:`OSError`.
fr: :exc:`IOError` était levée auparavant, elle est devenue un alias de :exc:`OSError`.

source: If ``sys.stdin`` is used more than once, the second and further use will return no lines, except perhaps for interactive use, or if it has been explicitly reset (e.g. using ``sys.stdin.seek(0)``).
fr: Si ``sys.stdin`` apparaît plus d'une fois dans la liste, toutes les lignes sont consommées dès la première fois, sauf éventuellement en cas d'usage interactif ou si le flux d'entrée standard a été modifié dans l'intervalle (par exemple avec ``sys.stdin.seek(0)``).

source: Empty files are opened and immediately closed; the only time their presence in the list of filenames is noticeable at all is when the last file opened is empty.
fr: Les fichiers vides sont ouverts et refermés immédiatement. Ils ne sont pas détectables dans la liste des fichiers, sauf éventuellement dans le cas où le dernier fichier est vide.

source: Lines are returned with any newlines intact, which means that the last line in a file may not have one.
fr: Les caractères de saut de ligne sont préservés, donc toutes les lignes se terminent par un saut de ligne, sauf éventuellement la dernière ligne d'un fichier.

source: The following function is the primary interface of this module:
fr: La fonction suivante constitue l'interface principale du module :

source: Create an instance of the :class:`FileInput` class. The instance will be used as global state for the functions of this module, and is also returned to use during iteration. The parameters to this function will be passed along to the constructor of the :class:`FileInput` class.
fr: Crée une instance de :class:`FileInput`, qui devient l'état global pour toutes les fonctions du module. Elle est également renvoyée afin que l'utilisateur puisse la parcourir comme un objet itérable. Tous les paramètres de cette fonction sont transmis au constructeur de :class:`FileInput`.

source: The :class:`FileInput` instance can be used as a context manager in the :keyword:`with` statement. In this example, *input* is closed after the :keyword:`!with` statement is exited, even if an exception occurs::
fr: Les instances de :class:`FileInput` peuvent s'utiliser comme gestionnaires de contexte, avec l'instruction :keyword:`with`. Dans le code suivant, *input* est fermé lorsque le bloc :keyword:`!with` se termine, y compris si une exception l'a interrompu.

source: Can be used as a context manager.
fr: prise en charge du protocole de gestionnaire de contexte.

source: The keyword parameters *mode* and *openhook* are now keyword-only.
fr: les paramètres *mode* et *openhook* doivent être nommés.

source: The following functions use the global state created by :func:`fileinput.input`; if there is no active state, :exc:`RuntimeError` is raised.
fr: Toutes les fonctions suivantes font appel à l'état global du module mis en place par :func:`fileinput.input`. L'absence de cet état déclenche l'exception :exc:`RuntimeError`.

source: Return the name of the file currently being read. Before the first line has been read, returns ``None``.
fr: Renvoie le nom du fichier en train d'être lu, ou ``None`` avant la lecture de la toute première ligne.

source: Return the integer "file descriptor" for the current file. When no file is opened (before the first line and between files), returns ``-1``.
fr: Renvoie le descripteur de fichier (sous forme d'entier) utilisé pour lire le fichier courant. Si aucun fichier n'est ouvert (avant la première ligne et entre les fichiers), le résultat est ``-1``.

source: Return the cumulative line number of the line that has just been read. Before the first line has been read, returns ``0``. After the last line of the last file has been read, returns the line number of that line.
fr: Renvoie le numéro de la ligne qui vient d'être lue, en commençant par la première ligne du premier fichier. Avant cette toute première ligne, renvoie ``0``. Après la dernière ligne du dernier fichier, renvoie le numéro de cette ligne.

source: Return the line number in the current file. Before the first line has been read, returns ``0``. After the last line of the last file has been read, returns the line number of that line within the file.
fr: Renvoie le numéro de ligne relatif au fichier courant. Avant la toute première ligne, renvoie ``0``. Après la toute dernière ligne, renvoie le numéro de cette ligne par rapport à son fichier source.

source: Return ``True`` if the line just read is the first line of its file, otherwise return ``False``.
fr: Renvoie ``True`` ou ``False`` selon que la ligne qui vient d'être lue est la première du fichier.

source: Return ``True`` if the last line was read from ``sys.stdin``, otherwise return ``False``.
fr: ``True`` ou ``False`` selon que la dernière ligne lue provenait de ``sys.stdin`` ou non.

source: Close the current file so that the next iteration will read the first line from the next file (if any); lines not read from the file will not count towards the cumulative line count. The filename is not changed until after the first line of the next file has been read. Before the first line has been read, this function has no effect; it cannot be used to skip the first file. After the last line of the last file has been read, this function has no effect.
fr: Ferme le fichier courant et laisse la lecture se poursuivre au début du suivant (ou se terminer si c'était le dernier fichier ; dans ce cas cette fonction ne fait rien). Les lignes court-circuitées ne comptent pas dans les numéros des lignes des fichiers suivants. Le nom du fichier courant n'est pas modifié immédiatement, mais seulement après que la première ligne du fichier suivant a été lue. Cette fonction n'a pas d'effet avant la lecture de la première ligne (elle ne peut pas sauter le premier fichier).

source: Close the sequence.
fr: Ferme le fichier courant et termine la lecture en sautant les fichiers suivants.

source: The class which implements the sequence behavior provided by the module is available for subclassing as well:
fr: La classe qui implémente ce comportement du module est publique. On peut en créer des classes filles.

source: Class :class:`FileInput` is the implementation; its methods :meth:`filename`, :meth:`fileno`, :meth:`lineno`, :meth:`filelineno`, :meth:`isfirstline`, :meth:`isstdin`, :meth:`nextfile` and :meth:`close` correspond to the functions of the same name in the module. In addition it has a :meth:`~io.TextIOBase.readline` method which returns the next input line, and a :meth:`__getitem__` method which implements the sequence behavior. The sequence must be accessed in strictly sequential order; random access and :meth:`~io.TextIOBase.readline` cannot be mixed.
fr: :class:`FileInput` est l'implémentation principale du module. Ses méthodes :meth:`filename`, :meth:`fileno`, :meth:`lineno`, :meth:`filelineno`, :meth:`isfirstline`, :meth:`isstdin`, :meth:`nextfile` et :meth:`close` correspondent aux fonctions du même nom au niveau du module. Elle possède également une méthode :meth:`~io.TextIOBase.readline`, qui lit une nouvelle ligne et la renvoie, ainsi qu'une méthode :meth:`__getitem__` qui permet l'accès à un indice. Il faut lire les éléments de la séquence strictement dans l'ordre (l'accès à un indice arbitraire n'étant pas compatible avec :meth:`~io.TextIOBase.readline`).

source: With *mode* you can specify which file mode will be passed to :func:`open`. It must be one of ``'r'``, ``'rU'``, ``'U'`` and ``'rb'``.
fr: Le paramètre *mode* permet de préciser le mode d'ouverture des fichiers. Il est passé directement à :func:`open`. Les valeurs possibles sont ``'r'``, ``'rU'``, ``'U'`` et ``'rb'``.

source: The *openhook*, when given, must be a function that takes two arguments, *filename* and *mode*, and returns an accordingly opened file-like object. You cannot use *inplace* and *openhook* together.
fr: S'il est fourni, l'argument *openhook* est une fonction. Elle est appelée avec les paramètres *filename* et *mode*, et renvoie un objet fichier-compatible ouvert selon *mode*. Notez que *openhook* et *inplace* sont mutuellement exclusifs.

source: A :class:`FileInput` instance can be used as a context manager in the :keyword:`with` statement. In this example, *input* is closed after the :keyword:`!with` statement is exited, even if an exception occurs::
fr: Les objets :class:`FileInput` peuvent aussi fonctionner comme gestionnaires de contexte dans un bloc :keyword:`with`. Dans l'exemple suivant, *input* est fermé à la fin du bloc :keyword:`!with`, même arrêté par une exception.

source: The ``'rU'`` and ``'U'`` modes.
fr: modes ``'rU'`` et ``'U'``.

source: Support for :meth:`__getitem__` method is deprecated.
fr: accès à un indice avec :meth:`__getitem__`.

source: The keyword parameter *mode* and *openhook* are now keyword-only.
fr: les paramètres *mode* et *openhook* doivent impérativement être nommés.

source: **Optional in-place filtering:** if the keyword argument ``inplace=True`` is passed to :func:`fileinput.input` or to the :class:`FileInput` constructor, the file is moved to a backup file and standard output is directed to the input file (if a file of the same name as the backup file already exists, it will be replaced silently). This makes it possible to write a filter that rewrites its input file in place. If the *backup* parameter is given (typically as ``backup='.<some extension>'``), it specifies the extension for the backup file, and the backup file remains around; by default, the extension is ``'.bak'`` and it is deleted when the output file is closed. In-place filtering is disabled when standard input is read.
fr: **Filtrage sur place optionnel :** si ``inplace=True`` est passé à :func:`fileinput.input` ou au constructeur de :class:`FileInput`, chaque fichier d'entrée est déplacé vers une sauvegarde et la sortie standard est redirigée vers le fichier lui-même, ce qui permet d'écrire des filtres qui modifient directement les fichiers existants. Si le paramètre *backup* est fourni, il donne l'extension des fichiers de sauvegarde. Dans ce cas, la sauvegarde est conservée après l'opération. Par défaut, les fichiers de sauvegarde ont l'extension ``'.bak'`` et sont supprimés dès que le fichier de sortie est fermé. Si un fichier existe avec le même nom que la sauvegarde, il est écrasé. Le filtrage sur place ne fait rien pour l'entrée standard.

source: The two following opening hooks are provided by this module:
fr: Les deux fonctions suivantes fournissent des valeurs prédéfinies pour *openhook*.

source: Transparently opens files compressed with gzip and bzip2 (recognized by the extensions ``'.gz'`` and ``'.bz2'``) using the :mod:`gzip` and :mod:`bz2` modules. If the filename extension is not ``'.gz'`` or ``'.bz2'``, the file is opened normally (ie, using :func:`open` without any decompression).
fr: Ouvre de façon transparente les fichiers compressés avec gzip ou bzip2, à l'aide des modules :mod:`gzip` et :mod:`bz2`. Les fichiers compressés sont reconnus aux extensions ``'.gz'`` et ``'.bz2'``. Tous les fichiers qui n'ont pas l'une de ces deux extensions sont ouverts normalement (avec :func:`open`, sans décompression).

source: Returns a hook which opens each file with :func:`open`, using the given *encoding* and *errors* to read the file.
fr: Renvoie une fonction qui ouvre les fichiers en passant à :func:`open` les arguments *encoding* et *errors*. Le résultat peut être exploité à travers le point d'entrée automatique *openhook*.

source: Usage example: ``fi = fileinput.FileInput(openhook=fileinput.hook_encoded("utf-8", "surrogateescape"))``
fr: Exemple d'utilisation : ``fi = fileinput.FileInput(openhook=fileinput.hook_encoded("utf-8", "surrogateescape"))``.

source: Added the optional *errors* parameter.
fr: ajout du paramètre facultatif *errors*.
