Repository: python/python-docs-fr
Catalog: library/filecmp.po
Languages: fr

source: **Source code:** :source:`Lib/filecmp.py`
fr: **Code source :** :source:`Lib/filecmp.py`

source: The :mod:`filecmp` module defines functions to compare files and directories, with various optional time/correctness trade-offs. For comparing files, see also the :mod:`difflib` module.
fr: Le module :mod:`filecmp` définit les fonctions permettant de comparer les fichiers et les répertoires, avec différents compromis optionnels durée / exactitude. Pour comparer des fichiers, voir aussi le module :mod:`difflib`.

source: The :mod:`filecmp` module defines the following functions:
fr: Le module :mod:`filecmp` définit les fonctions suivantes :

source: Compare the files named *f1* and *f2*, returning ``True`` if they seem equal, ``False`` otherwise.
fr: Compare les fichiers nommés *f1* et *f2* , renvoie ``True`` s’ils semblent égaux, ``False`` sinon.

source: Note that no external programs are called from this function, giving it portability and efficiency.
fr: Notez qu'aucun programme externe n'est appelé à partir de cette fonction, ce qui lui confère des qualités de portabilité et d'efficacité.

source: This function uses a cache for past comparisons and the results, with cache entries invalidated if the :func:`os.stat` information for the file changes. The entire cache may be cleared using :func:`clear_cache`.
fr: Cette fonction utilise un cache pour les comparaisons antérieures et les résultats, les entrées du cache étant invalidées si les informations :func:`os.stat()` du fichier sont modifiées. La totalité du cache peut être effacée avec :func:`clear_cache()`.

source: Compare the files in the two directories *dir1* and *dir2* whose names are given by *common*.
fr: Compare les fichiers des deux répertoires *dir1* et *dir2* dont les noms sont donnés par *common*.

source: Returns three lists of file names: *match*, *mismatch*, *errors*. *match* contains the list of files that match, *mismatch* contains the names of those that don't, and *errors* lists the names of files which could not be compared. Files are listed in *errors* if they don't exist in one of the directories, the user lacks permission to read them or if the comparison could not be done for some other reason.
fr: Renvoie trois listes de noms de fichiers : *match* , *mismatch*, *errors*. *match* contient la liste des fichiers qui correspondent, *mismatch* contient les noms de ceux qui ne correspondent pas et *errors* répertorie les noms des fichiers qui n'ont pas pu être comparés. Les fichiers sont répertoriés dans *errors* s'ils n'existent pas dans l'un des répertoires, si l'utilisateur ne dispose pas de l'autorisation nécessaire pour les lire ou si la comparaison n'a pas pu être effectuée pour une autre raison.

source: The *shallow* parameter has the same meaning and default value as for :func:`filecmp.cmp`.
fr: Le paramètre *shallow* a la même signification et la même valeur par défaut que pour :func:`filecmp.cmp`.

source: For example, ``cmpfiles('a', 'b', ['c', 'd/e'])`` will compare ``a/c`` with ``b/c`` and ``a/d/e`` with ``b/d/e``. ``'c'`` and ``'d/e'`` will each be in one of the three returned lists.
fr: Par exemple, ``cmpfiles('a', 'b', ['c', 'd/e'])`` compare ``a/c`` et ``b/c`` et ``a/d/e`` avec ``b/d/e``. ``'c'`` et ``'d/e'`` seront chacun dans l'une des trois listes renvoyées.

source: Clear the filecmp cache. This may be useful if a file is compared so quickly after it is modified that it is within the mtime resolution of the underlying filesystem.
fr: Efface le cache *filecmp*. Cela peut être utile si un fichier est comparé juste après avoir été modifié (dans un délai inférieur à la résolution *mtime* du système de fichiers sous-jacent).

source: The :class:`dircmp` class
fr: La classe :class:`dircmp`

source: The :class:`dircmp` class provides the following methods:
fr: La classe :class:`dircmp` fournit les méthodes suivantes :

source: Print (to :data:`sys.stdout`) a comparison between *a* and *b*.
fr: Affiche (sur :data:`sys.stdout`) une comparaison entre *a* et *b*.

source: Print a comparison between *a* and *b* and common immediate subdirectories.
fr: Affiche une comparaison entre *a* et *b* et les sous-répertoires immédiats communs.

source: Print a comparison between *a* and *b* and common subdirectories (recursively).
fr: Affiche une comparaison entre a et b et les sous-répertoires communs (récursivement).

source: The :class:`dircmp` class offers a number of interesting attributes that may be used to get various bits of information about the directory trees being compared.
fr: La classe :class:`dircmp` offre un certain nombre d'attributs intéressants qui peuvent être utilisés pour obtenir diverses informations sur les arborescences de répertoires comparées.

source: The directory *a*.
fr: Le répertoire *a*.

source: The directory *b*.
fr: Le répertoire *b*.

source: Files and subdirectories in *a*, filtered by *hide* and *ignore*.
fr: Fichiers et sous-répertoires dans *a* , filtrés par *hide* et *ignore*.

source: Files and subdirectories in *b*, filtered by *hide* and *ignore*.
fr: Fichiers et sous-répertoires dans *b* , filtrés par *hide* et *ignore*.

source: Files and subdirectories in both *a* and *b*.
fr: Fichiers et sous-répertoires à la fois dans *a* et *b*.

source: Files and subdirectories only in *a*.
fr: Fichiers et sous-répertoires uniquement dans *a*.

source: Files and subdirectories only in *b*.
fr: Fichiers et sous-répertoires uniquement dans *b*.

source: Subdirectories in both *a* and *b*.
fr: Sous-répertoires à la fois dans *a* et *b*.

source: Files in both *a* and *b*.
fr: Fichiers à la fois dans *a* et *b*.

source: Names in both *a* and *b*, such that the type differs between the directories, or names for which :func:`os.stat` reports an error.
fr: Noms dans *a* et *b* , tels que le type diffère entre les répertoires, ou noms pour lesquels :func:`os.stat` signale une erreur.

source: Files which are identical in both *a* and *b*, using the class's file comparison operator.
fr: Fichiers identiques dans *a* et *b*, en utilisant l'opérateur de comparaison de fichiers de la classe.

source: Files which are in both *a* and *b*, whose contents differ according to the class's file comparison operator.
fr: Fichiers figurant à la fois dans *a* et dans *b* , dont le contenu diffère en fonction de l'opérateur de comparaison de fichiers de la classe.

source: Files which are in both *a* and *b*, but could not be compared.
fr: Fichiers à la fois dans *a* et dans *b* , mais ne pouvant pas être comparés.

source: List of directories ignored by :class:`dircmp` by default.
fr: Liste des répertoires ignorés par défaut par :class:`dircmp`.

source: Here is a simplified example of using the ``subdirs`` attribute to search recursively through two directories to show common different files::
fr: Voici un exemple simplifié d'utilisation de l'attribut ``subdirs`` pour effectuer une recherche récursive dans deux répertoires afin d'afficher des fichiers communs différents ::
