Repository: python/python-docs-fr
Catalog: library/fnmatch.po
Languages: fr

source: :mod:`fnmatch` --- Unix filename pattern matching
fr: :mod:`fnmatch` --- Filtrage par motif des noms de fichiers Unix

source: **Source code:** :source:`Lib/fnmatch.py`
fr: **Code source :** :source:`Lib/fnmatch.py`

source: This module provides support for Unix shell-style wildcards, which are *not* the same as regular expressions (which are documented in the :mod:`re` module). The special characters used in shell-style wildcards are:
fr: Ce module fournit la gestion des caractères de remplacement de style shell Unix, qui ne sont *pas* identiques à ceux utilisés dans les expressions régulières (documentés dans le module :mod:`re`). Les caractères spéciaux utilisés comme caractères de remplacement de style shell sont :

source: Pattern
fr: Motif

source: Meaning
fr: Signification

source: matches everything
fr: reconnaît n'importe quoi

source: matches any single character
fr: reconnaît n'importe quel caractère unique

source: matches any character in *seq*
fr: reconnaît n'importe quel caractère dans *seq*

source: matches any character not in *seq*
fr: reconnaît n'importe quel caractère qui n'est pas dans *seq*

source: For a literal match, wrap the meta-characters in brackets. For example, ``'[?]'`` matches the character ``'?'``.
fr: Pour une correspondance littérale, il faut entourer le métacaractère par des crochets. Par exemple, ``'[?]'`` reconnaît le caractère ``'?'``.

source: Test whether the *filename* string matches the *pattern* string, returning :const:`True` or :const:`False`. Both parameters are case-normalized using :func:`os.path.normcase`. :func:`fnmatchcase` can be used to perform a case-sensitive comparison, regardless of whether that's standard for the operating system.
fr: Teste si la chaîne de caractères *filename* correspond au motif *pattern*, en renvoyant :const:`True` ou :const:`False`. La casse de chacun des paramètres peut être normalisée en utilisant :func:`os.path.normcase`. :func:`fnmatchcase` peut être utilisée pour réaliser une comparaison sensible à la casse, indépendamment du système d'exploitation.

source: This example will print all file names in the current directory with the extension ``.txt``::
fr: Cet exemple affiche tous les noms de fichiers du répertoire courant ayant pour extension ``.txt`` : ::

source: Test whether *filename* matches *pattern*, returning :const:`True` or :const:`False`; the comparison is case-sensitive and does not apply :func:`os.path.normcase`.
fr: Teste si *filename* correspond au motif *pattern*, en renvoyant :const:`True` ou :const:`False` ; la comparaison est sensible à la casse et n'utilise pas la fonction :func:`os.path.normcase`.

source: Return the subset of the list of *names* that match *pattern*. It is the same as ``[n for n in names if fnmatch(n, pattern)]``, but implemented more efficiently.
fr: Renvoie un sous-ensemble de la liste *names* correspondant au motif *pattern*. Similaire à ``[n for n in names if fnmatch(n, pattern)]``, mais implémenté plus efficacement.

source: Return the shell-style *pattern* converted to a regular expression for using with :func:`re.match`.
fr: Renvoie le motif *pattern*, de style shell, converti en une expression régulière utilisable avec :func:`re.match`.

source: Example:
fr: Exemple :

source: Unix shell-style path expansion.
fr: Recherche de chemins de style shell Unix
