Repository: python/python-docs-fr
Catalog: library/fractions.po
Languages: fr

source: :mod:`fractions` --- Rational numbers
fr: :mod:`fractions` — Nombres rationnels

source: **Source code:** :source:`Lib/fractions.py`
fr: **Code source :** :source:`Lib/fractions.py`

source: The :mod:`fractions` module provides support for rational number arithmetic.
fr: Le module :mod:`fractions` fournit un support de l'arithmétique des nombres rationnels.

source: A Fraction instance can be constructed from a pair of integers, from another rational number, or from a string.
fr: Une instance de *Fraction* peut être construite depuis une paire d'entiers, depuis un autre nombre rationnel, ou depuis une chaîne de caractères.

source: The first version requires that *numerator* and *denominator* are instances of :class:`numbers.Rational` and returns a new :class:`Fraction` instance with value ``numerator/denominator``. If *denominator* is :const:`0`, it raises a :exc:`ZeroDivisionError`. The second version requires that *other_fraction* is an instance of :class:`numbers.Rational` and returns a :class:`Fraction` instance with the same value. The next two versions accept either a :class:`float` or a :class:`decimal.Decimal` instance, and return a :class:`Fraction` instance with exactly the same value. Note that due to the usual issues with binary floating-point (see :ref:`tut-fp-issues`), the argument to ``Fraction(1.1)`` is not exactly equal to 11/10, and so ``Fraction(1.1)`` does *not* return ``Fraction(11, 10)`` as one might expect. (But see the documentation for the :meth:`limit_denominator` method below.) The last version of the constructor expects a string or unicode instance. The usual form for this instance is::
fr: La première version demande que *numerator* et *denominator* soient des instance de :class:`numbers.Rational` et renvoie une instance de :class:`Fraction` valant ``numerator/denominator``. Si *denominator* vaut :const:`0`, une :exc:`ZeroDivisionError` est levée. La seconde version demande que *other_fraction* soit une instance de :class:`numbers.Rational` et renvoie une instance de :class:`Fraction` avec la même valeur. Les deux versions suivantes acceptent un :class:`float` ou une instance de :class:`decimal.Decimal`, et renvoient une instance de :class:`Fraction` avec exactement la même valeur. Notez que les problèmes usuels des virgules flottantes binaires (voir :ref:`tut-fp-issues`) font que ``Fraction(1.1)`` n'est pas exactement égal à 11/10, et donc ``Fraction(1.1)`` ne renvoie *pas* ``Fraction(11, 10)`` comme on pourrait le penser. (Mais référez-vous à la documentation de la méthode :meth:`limit_denominator` ci-dessous.) La dernière version du constructeur attend une chaîne de caractères ou Unicode. La représentation habituelle de cette forme est ::

source: where the optional ``sign`` may be either '+' or '-' and ``numerator`` and ``denominator`` (if present) are strings of decimal digits. In addition, any string that represents a finite value and is accepted by the :class:`float` constructor is also accepted by the :class:`Fraction` constructor. In either form the input string may also have leading and/or trailing whitespace. Here are some examples::
fr: où le ``sign`` optionnel peut être soit ``+`` soit ``-``, et ``numerator`` et ``denominator`` (si présent) sont des chaînes de chiffres décimaux. De plus, toute chaîne qui représente une valeur finie et acceptée par le constructeur de :class:`float` est aussi acceptée par celui de :class:`Fraction`. Dans ces deux formes, la chaîne d'entrée peut aussi contenir des espaces en début ou en fin de chaîne. Voici quelques exemples ::

source: The :class:`Fraction` constructor now accepts :class:`float` and :class:`decimal.Decimal` instances.
fr: Le constructeur de :class:`Fraction` accepte maintenant des instances de :class:`float` et :class:`decimal.Decimal`.

source: The :func:`math.gcd` function is now used to normalize the *numerator* and *denominator*. :func:`math.gcd` always return a :class:`int` type. Previously, the GCD type depended on *numerator* and *denominator*.
fr: La fonction :func:`math.gcd` est maintenant utilisée pour normaliser le *numerator* et le *denominator*. :func:`math.gcd` renvoie toujours un type :class:`int`. Auparavant, le type du PGCD dépendait du *numerator* et du *denominator*.

source: Numerator of the Fraction in lowest term.
fr: Numérateur de la fraction irréductible.

source: Denominator of the Fraction in lowest term.
fr: Dénominateur de la fraction irréductible.

source: Return a tuple of two integers, whose ratio is equal to the Fraction and with a positive denominator.
fr: Renvoie un *n*-uplet de deux entiers, dont le quotient est égal à la fraction et dont le dénominateur est positif.

source: Alternative constructor which only accepts instances of :class:`float` or :class:`numbers.Integral`. Beware that ``Fraction.from_float(0.3)`` is not the same value as ``Fraction(3, 10)``.
fr: Ce constructeur alternatif accepte (uniquement) des nombres à virgule flottante, de classe :class:`float`, ou plus généralement des instances de :class:`numbers.Integral`. Attention, ``Fraction.from_float(0.3)`` est différent de ``Fraction(3, 10)``.

source: From Python 3.2 onwards, you can also construct a :class:`Fraction` instance directly from a :class:`float`.
fr: Depuis Python 3.2, vous pouvez aussi construire une instance de :class:`Fraction` directement depuis un :class:`float`.

source: Alternative constructor which only accepts instances of :class:`decimal.Decimal` or :class:`numbers.Integral`.
fr: Ce constructeur alternatif accepte (uniquement) les instances de :class:`decimal.Decimal` ou :class:`numbers.Integral`.

source: From Python 3.2 onwards, you can also construct a :class:`Fraction` instance directly from a :class:`decimal.Decimal` instance.
fr: Depuis Python 3.2, vous pouvez aussi construire une instance de :class:`Fraction` directement depuis une instance de :class:`decimal.Decimal`.

source: Finds and returns the closest :class:`Fraction` to ``self`` that has denominator at most max_denominator. This method is useful for finding rational approximations to a given floating-point number:
fr: Trouve et renvoie la :class:`Fraction` la plus proche de ``self`` qui a au plus *max_denominator* comme dénominateur. Cette méthode est utile pour trouver des approximations rationnelles de nombres flottants donnés :

source: or for recovering a rational number that's represented as a float:
fr: ou pour retrouver un nombre rationnel représenté par un flottant :

source: Returns the greatest :class:`int` ``<= self``. This method can also be accessed through the :func:`math.floor` function:
fr: Renvoie le plus grand :class:`int` ``<= self``. Cette méthode peut aussi être utilisée à travers la fonction :func:`math.floor`.

source: Returns the least :class:`int` ``>= self``. This method can also be accessed through the :func:`math.ceil` function.
fr: Renvoie le plus petit :class:`int` ``>= self``. Cette méthode peut aussi être utilisée à travers la fonction :func:`math.ceil`.

source: The first version returns the nearest :class:`int` to ``self``, rounding half to even. The second version rounds ``self`` to the nearest multiple of ``Fraction(1, 10**ndigits)`` (logically, if ``ndigits`` is negative), again rounding half toward even. This method can also be accessed through the :func:`round` function.
fr: La première version renvoie l':class:`int` le plus proche de ``self``, arrondissant les demis au nombre pair le plus proche. La seconde version arrondit ``self`` au plus proche multiple de ``Fraction(1, 10**ndigits)`` (logiquement, si ``ndigits`` est négatif), arrondissant toujours les demis au nombre pair le plus proche. Cette méthode peut aussi être utilisée à via la fonction :func:`round`.

source: The abstract base classes making up the numeric tower.
fr: Les classes abstraites représentant la hiérarchie des nombres.
