Repository: python/python-docs-fr
Catalog: library/functions.po
Languages: fr

source: If the object does not provide :meth:`__dir__`, the function tries its best to gather information from the object's :attr:`~object.__dict__` attribute, if defined, and from its type object. The resulting list is not necessarily complete and may be inaccurate when the object has a custom :func:`__getattr__`.
fr: Si l'objet ne fournit pas de méthode :meth:`__dir__`, la fonction fait de son mieux en rassemblant les informations de l'attribut :attr:`~object.__dict__` de l'objet, s'il est défini, et depuis son type. La liste résultante n'est pas nécessairement complète, et peut être erronée quand l'objet a une :func:`__getattr__` personnalisée.

source: The default :func:`dir` mechanism behaves differently with different types of objects, as it attempts to produce the most relevant, rather than complete, information:
fr: Le mécanisme par défaut de :func:`dir` se comporte différemment avec différents types d'objets, car elle préfère donner une information pertinente plutôt qu'exhaustive :

source: If the object is a module object, the list contains the names of the module's attributes.
fr: si l'objet est un module, la liste contiendra les noms des attributs du module ;

source: If the object is a type or class object, the list contains the names of its attributes, and recursively of the attributes of its bases.
fr: si l'objet est un type ou une classe, la liste contiendra les noms de ses attributs et, récursivement, des attributs de ses parents ;

source: Otherwise, the list contains the object's attributes' names, the names of its class's attributes, and recursively of the attributes of its class's base classes.
fr: autrement, la liste contient les noms des attributs de l'objet, le nom des attributs de la classe, et récursivement des attributs des parents de la classe.

source: The resulting list is sorted alphabetically. For example:
fr: La liste donnée est triée par ordre alphabétique, par exemple :

source: Because :func:`dir` is supplied primarily as a convenience for use at an interactive prompt, it tries to supply an interesting set of names more than it tries to supply a rigorously or consistently defined set of names, and its detailed behavior may change across releases. For example, metaclass attributes are not in the result list when the argument is a class.
fr: Étant donné que :func:`dir` est d'abord fournie pour son côté pratique en mode interactif, elle a tendance à fournir un ensemble de noms pertinents plutôt qu'un ensemble exhaustif et rigoureusement défini, son comportement peut aussi changer d'une version à l'autre. Par exemple, les attributs de méta-classes ne sont pas donnés lorsque l'argument est une classe.

source: Take two (non-complex) numbers as arguments and return a pair of numbers consisting of their quotient and remainder when using integer division. With mixed operand types, the rules for binary arithmetic operators apply. For integers, the result is the same as ``(a // b, a % b)``. For floating point numbers the result is ``(q, a % b)``, where *q* is usually ``math.floor(a / b)`` but may be 1 less than that. In any case ``q * b + a % b`` is very close to *a*, if ``a % b`` is non-zero it has the same sign as *b*, and ``0 <= abs(a % b) < abs(b)``.
fr: Prend deux nombres (qui ne sont pas des nombres complexes) et renvoie leur quotient et reste de leur division entière sous forme d'une paire de nombres. Avec des opérandes de types différents, les règles des opérateurs binaires s'appliquent. Pour deux entiers le résultat est le même que ``(a // b, a % b)``. Pour des nombres à virgule flottante le résultat est ``(q, a % b)``, où *q* est généralement ``math.floor(a / b)`` mais peut valoir 1 de moins. Dans tous les cas ``q * b + a % b`` est très proche de *a*. Si ``a % b`` est différent de zéro, il a le même signe que *b* et ``0 <= abs(a % b) < abs(b)``.

source: Return an enumerate object. *iterable* must be a sequence, an :term:`iterator`, or some other object which supports iteration. The :meth:`~iterator.__next__` method of the iterator returned by :func:`enumerate` returns a tuple containing a count (from *start* which defaults to 0) and the values obtained from iterating over *iterable*.
fr: Renvoie un objet énumérant. *iterable* doit être une séquence, un :term:`itérateur <iterator>`, ou tout autre objet prenant en charge l'itération. La méthode :meth:`~iterator.__next__` de l'itérateur donné par :func:`enumerate` renvoie un *n*-uplet contenant un compte (démarrant à *start*, 0 par défaut) et les valeurs obtenues de l'itération sur *iterable*.

source: Equivalent to::
fr: Équivalent à ::

source: The arguments are a string and optional globals and locals. If provided, *globals* must be a dictionary. If provided, *locals* can be any mapping object.
fr: Les arguments sont : une chaîne, et optionnellement des locales et des globales. S'il est fourni, *globals* doit être un dictionnaire. S'il est fourni, *locals* peut être n'importe quel objet *mapping*.

source: The *expression* argument is parsed and evaluated as a Python expression (technically speaking, a condition list) using the *globals* and *locals* dictionaries as global and local namespace. If the *globals* dictionary is present and does not contain a value for the key ``__builtins__``, a reference to the dictionary of the built-in module :mod:`builtins` is inserted under that key before *expression* is parsed. That way you can control what builtins are available to the executed code by inserting your own ``__builtins__`` dictionary into *globals* before passing it to :func:`eval`. If the *locals* dictionary is omitted it defaults to the *globals* dictionary. If both dictionaries are omitted, the expression is executed with the *globals* and *locals* in the environment where :func:`eval` is called. Note, *eval()* does not have access to the :term:`nested scopes <nested scope>` (non-locals) in the enclosing environment.
fr: L'argument *expression* est analysé et évalué comme une expression Python (techniquement, une *condition list*) en utilisant les dictionnaires *globals* et *locals* comme espaces de nommage global et local. Si le dictionnaire *globals* est présent mais ne contient pas de valeur pour la clé ``__builtins__``, une référence au dictionnaire du module :mod:`builtins` y est insérée avant qu'*expression* ne soit évaluée. Ainsi, vous pouvez contrôler quels objets natifs sont disponibles pour le code à exécuter en insérant votre propre dictionnaire ``__builtins__`` dans *globals* avant de le passer à :func:`eval`. Si le dictionnaire *locals* est omis, sa valeur par défaut est le dictionnaire *globals*. Si les deux dictionnaires sont omis, l'expression est exécutée avec les dictionnaires *globals* et *locals* dans l'environnement où :func:`eval` est appelée. Notez que *eval()* n'a pas accès aux :term:`portées imbriquées <nested scope>` (non locales) dans l'environnement englobant.

source: The return value is the result of the evaluated expression. Syntax errors are reported as exceptions. Example:
fr: La valeur de retour est le résultat de l'expression évaluée. Les erreurs de syntaxe sont signalées comme des exceptions. Exemple :

source: This function can also be used to execute arbitrary code objects (such as those created by :func:`compile`). In this case, pass a code object instead of a string. If the code object has been compiled with ``'exec'`` as the *mode* argument, :func:`eval`\'s return value will be ``None``.
fr: Cette fonction peut aussi être utilisée pour exécuter n'importe quel objet code (tels que ceux créés par :func:`compile`). Dans ce cas, donnez un objet code plutôt qu'une chaîne. Si l'objet code a été compilé avec l'argument *mode* à ``'exec'``, :func:`eval` renvoie ``None``.

source: If the given source is a string, then leading and trailing spaces and tabs are stripped.
fr: Si la source donnée est une chaîne, les espaces de début et de fin et les tabulations sont supprimées.

source: See :func:`ast.literal_eval` for a function that can safely evaluate strings with expressions containing only literals.
fr: Utilisez :func:`ast.literal_eval` si vous avez besoin d'une fonction qui peut évaluer en toute sécurité des chaînes avec des expressions ne contenant que des valeurs littérales.

source: Raises an :ref:`auditing event <auditing>` ``exec`` with the code object as the argument. Code compilation events may also be raised.
fr: Lève un :ref:`évènement d'audit <auditing>` ``exec`` avec l'objet de code comme argument. Les événements de compilation de code peuvent également être levés.

source: This function supports dynamic execution of Python code. *object* must be either a string or a code object. If it is a string, the string is parsed as a suite of Python statements which is then executed (unless a syntax error occurs). [#]_ If it is a code object, it is simply executed. In all cases, the code that's executed is expected to be valid as file input (see the section :ref:`file-input` in the Reference Manual). Be aware that the :keyword:`nonlocal`, :keyword:`yield`, and :keyword:`return` statements may not be used outside of function definitions even within the context of code passed to the :func:`exec` function. The return value is ``None``.
fr: Cette fonction permet l'exécution dynamique de code Python. *object* doit être soit une chaîne soit un objet code. Si c'est une chaîne, elle est d'abord analysée en une suite d'instructions Python qui sont ensuite exécutés (sauf erreur de syntaxe). [#]_ Si c'est un objet code, il est simplement exécuté. Dans tous les cas, le code fourni doit être valide selon les mêmes critères que s'il était un script dans un fichier (voir la section :ref:`Fichier d'entrée <file-input>` dans le manuel de référence du langage). Gardez en tête que les mots clés :keyword:`nonlocal`, :keyword:`yield` et :keyword:`return` ne peuvent pas être utilisés en dehors d'une fonction, même dans du code passé à :func:`exec`. La fonction renvoie ``None``.

source: In all cases, if the optional parts are omitted, the code is executed in the current scope. If only *globals* is provided, it must be a dictionary (and not a subclass of dictionary), which will be used for both the global and the local variables. If *globals* and *locals* are given, they are used for the global and local variables, respectively. If provided, *locals* can be any mapping object. Remember that at the module level, globals and locals are the same dictionary. If exec gets two separate objects as *globals* and *locals*, the code will be executed as if it were embedded in a class definition.
fr: Dans tous les cas, si les arguments optionnels sont omis, le code est exécuté dans le contexte actuel. Si seul *globals* est fourni, il doit être un dictionnaire (et pas une sous-classe de dictionnaire) utilisé pour les variables globales et locales. Si les deux sont fournis, ils sont utilisés respectivement pour les variables globales et locales. *locales* peut être n'importe quel objet de correspondance. Souvenez-vous qu'au niveau d'un module, les dictionnaires des locales et des globales ne sont qu'un. Si ``exec`` reçoit deux objets distincts dans *globals* et *locals*, le code est exécuté comme s'il était inclus dans une définition de classe.

source: If the *globals* dictionary does not contain a value for the key ``__builtins__``, a reference to the dictionary of the built-in module :mod:`builtins` is inserted under that key. That way you can control what builtins are available to the executed code by inserting your own ``__builtins__`` dictionary into *globals* before passing it to :func:`exec`.
fr: Si le dictionnaire *globals* ne contient pas de valeur pour la clé ``__builtins__``, une référence au dictionnaire du module :mod:`builtins` y est inséré. Cela vous permet de contrôler quelles fonctions natives sont exposées au code exécuté en insérant votre propre dictionnaire ``__builtins__`` dans *globals* avant de le donner à :func:`exec`.

source: The built-in functions :func:`globals` and :func:`locals` return the current global and local dictionary, respectively, which may be useful to pass around for use as the second and third argument to :func:`exec`.
fr: Les fonctions natives :func:`globals` et :func:`locals` renvoient respectivement les dictionnaires globaux et locaux, qui peuvent être utiles en deuxième et troisième argument de :func:`exec`.

source: The default *locals* act as described for function :func:`locals` below: modifications to the default *locals* dictionary should not be attempted. Pass an explicit *locals* dictionary if you need to see effects of the code on *locals* after function :func:`exec` returns.
fr: La valeur par défaut pour *locals* se comporte comme la fonction :func:`locals` : il est déconseillé de modifier le dictionnaire *locals* par défaut. Donnez un dictionnaire explicitement à *locals* si vous désirez observer l'effet du code sur les variables locales, après que :func:`exec` soit terminée.

source: Construct an iterator from those elements of *iterable* for which *function* returns true. *iterable* may be either a sequence, a container which supports iteration, or an iterator. If *function* is ``None``, the identity function is assumed, that is, all elements of *iterable* that are false are removed.
fr: Construit un itérateur depuis les éléments d'*iterable* pour lesquels *function* renvoie ``True``. *iterable* peut aussi bien être une séquence, un conteneur qui prend en charge l'itération, ou un itérateur. Si *function* est ``None``, la fonction identité est prise, c'est-à-dire que tous les éléments faux d'*iterable* sont supprimés.

source: Note that ``filter(function, iterable)`` is equivalent to the generator expression ``(item for item in iterable if function(item))`` if function is not ``None`` and ``(item for item in iterable if item)`` if function is ``None``.
fr: Notez que ``filter(function, iterable)`` est l'équivalent du générateur ``(item for item in iterable if function(item))`` si *function* n'est pas ``None``, et de ``(item for item in iterable if item)`` si *function* est ``None``.

source: See :func:`itertools.filterfalse` for the complementary function that returns elements of *iterable* for which *function* returns false.
fr: Voir :func:`itertools.filterfalse` pour la fonction complémentaire qui donne les éléments d'*iterable* pour lesquels *function* renvoie ``False``.

source: Return a floating point number constructed from a number or string *x*.
fr: Renvoie un nombre a virgule flottante depuis un nombre ou une chaîne *x*.

source: If the argument is a string, it should contain a decimal number, optionally preceded by a sign, and optionally embedded in whitespace. The optional sign may be ``'+'`` or ``'-'``; a ``'+'`` sign has no effect on the value produced. The argument may also be a string representing a NaN (not-a-number), or positive or negative infinity. More precisely, the input must conform to the ``floatvalue`` production rule in the following grammar, after leading and trailing whitespace characters are removed:
fr: Si l'argument est une chaîne, elle doit contenir un nombre décimal, éventuellement précédé d'un signe, et pouvant être entouré d'espaces. Le signe optionnel peut être ``'+'`` ou ``'-'``. Un signe ``'+'`` n'a pas d'effet sur la valeur produite. L'argument peut aussi être une chaîne représentant un *NaN* (*Not-a-Number* ou *pas un nombre* en français), l'infini positif, ou l'infini négatif. Plus précisément, l'argument doit se conformer à ``floatvalue`` tel que défini la grammaire suivante, après que les espaces en début et fin de chaîne aient été retirées :

source: Here ``digit`` is a Unicode decimal digit (character in the Unicode general category ``Nd``). Case is not significant, so, for example, "inf", "Inf", "INFINITY", and "iNfINity" are all acceptable spellings for positive infinity.
fr: Ici ``digit`` est un chiffre décimal Unicode (caractère de la catégorie générale Unicode ``Nd``). La casse n'y est pas significative, donc, par exemple, ``"inf"``, ``" Inf"``, ``"INFINITY"`` et ``" iNfiNity"`` sont tous des orthographes valides pour un infini positif.

source: Otherwise, if the argument is an integer or a floating point number, a floating point number with the same value (within Python's floating point precision) is returned. If the argument is outside the range of a Python float, an :exc:`OverflowError` will be raised.
fr: Autrement, si l'argument est un entier ou un nombre à virgule flottante, un nombre à virgule flottante de même valeur (en accord avec la précision des nombres à virgule flottante de Python) est donné. Si l'argument est en dehors de l'intervalle d'un nombre a virgule flottante pour Python, :exc:`OverflowError` est levée.

source: For a general Python object ``x``, ``float(x)`` delegates to ``x.__float__()``. If ``__float__()`` is not defined then it falls back to :meth:`__index__`.
fr: Pour un objet Python général ``x``, ``float(x)`` est délégué à ``x.__float__()``. Si ``__float__()`` n'est pas défini alors il est délégué à :meth:`__index__`.

source: If no argument is given, ``0.0`` is returned.
fr: Sans argument, ``0.0`` est renvoyé.

source: Examples::
fr: Exemples ::

source: The float type is described in :ref:`typesnumeric`.
fr: Le type *float* est décrit dans :ref:`typesnumeric`.

source: Falls back to :meth:`__index__` if :meth:`__float__` is not defined.
fr: revient à :meth:`__index__` si :meth:`__float__` n'est pas définie.

source: Convert a *value* to a "formatted" representation, as controlled by *format_spec*. The interpretation of *format_spec* will depend on the type of the *value* argument; however, there is a standard formatting syntax that is used by most built-in types: :ref:`formatspec`.
fr: Convertit une valeur en sa représentation « formatée », contrôlée par *format_spec*. L'interprétation de *format_spec* dépend du type de la valeur. Cependant, il existe une syntaxe standard utilisée par la plupart des types natifs : :ref:`formatspec`.

source: The default *format_spec* is an empty string which usually gives the same effect as calling :func:`str(value) <str>`.
fr: Par défaut, *format_spec* est une chaîne vide. Dans ce cas, appeler cette fonction a généralement le même effet qu'appeler :func:`str(value) <str>`.

source: A call to ``format(value, format_spec)`` is translated to ``type(value).__format__(value, format_spec)`` which bypasses the instance dictionary when searching for the value's :meth:`__format__` method. A :exc:`TypeError` exception is raised if the method search reaches :mod:`object` and the *format_spec* is non-empty, or if either the *format_spec* or the return value are not strings.
fr: Un appel à ``format(value, format_spec)`` est transformé en ``type(value).__format__(value, format_spec)``, qui contourne le dictionnaire de l'instance lors de la recherche de la méthode :meth:`__fornat__`. Une exception :exc:`TypeError` est levée si la recherche de la méthode atteint :mod:`object` et que *format_spec* n'est pas vide, ou si *format_spec* ou le résultat ne sont pas des chaînes de caractères.

source: ``object().__format__(format_spec)`` raises :exc:`TypeError` if *format_spec* is not an empty string.
fr: ``object().__format__(format_spec)`` lève :exc:`TypeError` si *format_spec* n'est pas une chaîne vide.

source: Return a new :class:`frozenset` object, optionally with elements taken from *iterable*. ``frozenset`` is a built-in class. See :class:`frozenset` and :ref:`types-set` for documentation about this class.
fr: Renvoie un nouveau :class:`frozenset`, dont les objets sont éventuellement tirés d'*iterable*. ``frozenset`` est une classe native. Voir :class:`frozenset` et :ref:`types-set` pour la documentation sur cette classe.

source: For other containers see the built-in :class:`set`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
fr: Pour d'autres conteneurs, voyez les classes natives :class:`set`, :class:`list`, :class:`tuple`, et :class:`dict`, ainsi que le module :mod:`collections`.

source: Return the value of the named attribute of *object*. *name* must be a string. If the string is the name of one of the object's attributes, the result is the value of that attribute. For example, ``getattr(x, 'foobar')`` is equivalent to ``x.foobar``. If the named attribute does not exist, *default* is returned if provided, otherwise :exc:`AttributeError` is raised. *name* need not be a Python identifier (see :func:`setattr`).
fr: Renvoie la valeur de l'attribut nommé *name* de l'objet *object*. *name* doit être une chaîne. Si la chaîne est le nom d'un des attributs de l'objet, le résultat est la valeur de cet attribut. Par exemple, ``getattr(x, 'foobar')`` est équivalent à ``x.foobar``. Si l'attribut n'existe pas, mais que *default* est fourni, celui-ci est renvoyé. Sinon l'exception :exc:`AttributeError` est levée. *name* n'a pas besoin d'être un identifiant Python (voir :func:`setattr`).

source: Since :ref:`private name mangling <private-name-mangling>` happens at compilation time, one must manually mangle a private attribute's (attributes with two leading underscores) name in order to retrieve it with :func:`getattr`.
fr: étant donné que la :ref:`transformation des noms privés <private-name-mangling>` se produit au moment de la compilation, il faut modifier manuellement le nom d'un attribut privé (attributs avec deux traits de soulignement en tête) afin de le récupérer avec :func:`getattr`.

source: Return the dictionary implementing the current module namespace. For code within functions, this is set when the function is defined and remains the same regardless of where the function is called.
fr: Renvoie le dictionnaire implémentant l'espace de nommage du module actuel. Pour le code dans les fonctions, il est défini lorsque la fonction est définie et reste le même quel que soit le moment où la fonction est appelée.

source: The arguments are an object and a string. The result is ``True`` if the string is the name of one of the object's attributes, ``False`` if not. (This is implemented by calling ``getattr(object, name)`` and seeing whether it raises an :exc:`AttributeError` or not.)
fr: Les arguments sont : un objet et une chaîne de caractères. Le résultat est ``True`` si la chaîne est le nom d'un des attributs de l'objet, sinon ``False`` (l'implémentation appelle ``getattr(object, name)`` et regarde si une exception :exc:`AttributeError` a été levée).

source: Return the hash value of the object (if it has one). Hash values are integers. They are used to quickly compare dictionary keys during a dictionary lookup. Numeric values that compare equal have the same hash value (even if they are of different types, as is the case for 1 and 1.0).
fr: Renvoie la valeur de hachage d'un objet (s'il en a une). Les valeurs de hachage sont des entiers. Elles sont utilisées pour comparer rapidement des clés de dictionnaire lors de leur recherche. Les valeurs numériques égales ont la même valeur de hachage (même si leurs types sont différents, comme pour ``1`` et ``1.0``).

source: For objects with custom :meth:`__hash__` methods, note that :func:`hash` truncates the return value based on the bit width of the host machine. See :meth:`__hash__` for details.
fr: Pour les objets dont la méthode :meth:`__hash__` est implémentée, notez que :func:`hash` tronque la valeur donnée en fonction du nombre de bits de la machine hôte. Voir :meth:`__hash__` pour plus d'information.
