Repository: python/python-docs-fr
Catalog: library/functions.po
Languages: fr

source: Also note that, aside from the zero argument form, :func:`super` is not limited to use inside methods. The two argument form specifies the arguments exactly and makes the appropriate references. The zero argument form only works inside a class definition, as the compiler fills in the necessary details to correctly retrieve the class being defined, as well as accessing the current instance for ordinary methods.
fr: Notez aussi que, en dehors de sa forme sans arguments, :func:`super` peut être utilisée en dehors des méthodes. La forme à deux arguments est précise et donne tous les arguments exactement, donnant les références appropriées. La forme sans arguments fonctionne seulement à l'intérieur d'une définition de classe, puisque c'est le compilateur qui donne les détails nécessaires à propos de la classe en cours de définition, ainsi qu'accéder à l'instance courante pour les méthodes ordinaires.

source: For practical suggestions on how to design cooperative classes using :func:`super`, see `guide to using super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.
fr: Pour des suggestions pratiques sur la conception de classes coopératives utilisant :func:`super`, consultez `guide to using super() <http://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.

source: Rather than being a function, :class:`tuple` is actually an immutable sequence type, as documented in :ref:`typesseq-tuple` and :ref:`typesseq`.
fr: Plutôt qu'être une fonction, :class:`tuple` est en fait un type de séquence immuable, comme documenté dans :ref:`typesseq-tuple` et :ref:`typesseq`.

source: With one argument, return the type of an *object*. The return value is a type object and generally the same object as returned by :attr:`object.__class__ <instance.__class__>`.
fr: Avec un argument, renvoie le type d'*object*. La valeur renvoyée est un objet type et généralement la même que la valeur de l'attribut :attr:`object.__class__ <instance.__class__>`.

source: The :func:`isinstance` built-in function is recommended for testing the type of an object, because it takes subclasses into account.
fr: La fonction native :func:`isinstance` est recommandée pour tester le type d'un objet, car elle prend en compte l'héritage.

source: See also :ref:`bltin-type-objects`.
fr: Voir aussi :ref:`bltin-type-objects`.

source: Subclasses of :class:`type` which don't override ``type.__new__`` may no longer use the one-argument form to get the type of an object.
fr: Les sous-classes de :class:`type` qui ne redéfinissent pas ``type.__new__`` ne doivent plus utiliser la forme à un argument pour récupérer le type d'un objet.

source: Return the :attr:`~object.__dict__` attribute for a module, class, instance, or any other object with a :attr:`~object.__dict__` attribute.
fr: Renvoie l'attribut :attr:`~object.__dict__` d'un module, d'une classe, d'une instance ou de n'importe quel objet avec un attribut :attr:`~object.__dict__`.

source: Objects such as modules and instances have an updateable :attr:`~object.__dict__` attribute; however, other objects may have write restrictions on their :attr:`~object.__dict__` attributes (for example, classes use a :class:`types.MappingProxyType` to prevent direct dictionary updates).
fr: Certains objets, comme les modules et les instances, ont un attribut :attr:`~object.__dict__` modifiable ; cependant, d'autres objets peuvent avoir des restrictions en écriture sur leurs attributs :attr:`~object.__dict__` (par exemple, les classes utilisent un :class:`types.MappingProxyType` pour éviter les modifications directes du dictionnaire).

source: Without an argument, :func:`vars` acts like :func:`locals`. Note, the locals dictionary is only useful for reads since updates to the locals dictionary are ignored.
fr: Sans argument, :func:`vars` se comporte comme :func:`locals`. Notez que le dictionnaire des variables locales n'est utile qu'en lecture, car ses écritures sont ignorées.

source: :func:`zip` in conjunction with the ``*`` operator can be used to unzip a list::
fr: :func:`zip` peut être utilisée conjointement avec l'opérateur ``*`` pour dézipper une liste ::

source: This is an advanced function that is not needed in everyday Python programming, unlike :func:`importlib.import_module`.
fr: C'est une fonction avancée qui n'est pas fréquemment nécessaire, contrairement à :func:`importlib.import_module`.

source: This function is invoked by the :keyword:`import` statement. It can be replaced (by importing the :mod:`builtins` module and assigning to ``builtins.__import__``) in order to change semantics of the :keyword:`!import` statement, but doing so is **strongly** discouraged as it is usually simpler to use import hooks (see :pep:`302`) to attain the same goals and does not cause issues with code which assumes the default import implementation is in use. Direct use of :func:`__import__` is also discouraged in favor of :func:`importlib.import_module`.
fr: Cette fonction est invoquée via l'instruction :keyword:`import`. Elle peut être remplacée (en important le module :mod:`builtins` et en y remplaçant ``builtins.__import__``) afin de changer la sémantique de l'instruction :keyword:`!import`, mais c'est extrêmement déconseillé, car il est plus simple d'utiliser des points d'entrée pour les importations (*import hooks*, voir la :pep:`302`) pour le même résultat sans perturber du code s'attendant à trouver l'implémentation par défaut. L'usage direct de :func:`__import__` est aussi déconseillé en faveur de :func:`importlib.import_module`.

source: *level* specifies whether to use absolute or relative imports. ``0`` (the default) means only perform absolute imports. Positive values for *level* indicate the number of parent directories to search relative to the directory of the module calling :func:`__import__` (see :pep:`328` for the details).
fr: *level* permet de choisir entre importation absolue ou relative. ``0`` (par défaut) force à effectuer uniquement des importations absolues. Une valeur positive indique le nombre de dossiers parents relativement au dossier du module appelant :func:`__import__` (voir la :pep:`328`).

source: When the *name* variable is of the form ``package.module``, normally, the top-level package (the name up till the first dot) is returned, *not* the module named by *name*. However, when a non-empty *fromlist* argument is given, the module named by *name* is returned.
fr: Lorsque la variable *name* est de la forme ``package.module``, normalement, le paquet de plus haut niveau (le nom jusqu'au premier point) est renvoyé, et *pas* le module nommé par *name*. Cependant, lorsqu'un argument *fromlist* est fourni, le module nommé par *name* est renvoyé.

source: For example, the statement ``import spam`` results in bytecode resembling the following code::
fr: Par exemple, l'instruction ``import spam`` renvoie un code intermédiaire (*bytecode* en anglais) ressemblant au code suivant ::

source: The statement ``import spam.ham`` results in this call::
fr: L'instruction ``import spam.ham`` appelle ::

source: Note how :func:`__import__` returns the toplevel module here because this is the object that is bound to a name by the :keyword:`import` statement.
fr: Notez comment :func:`__import__` renvoie ici le module de plus haut niveau parce que c'est l'objet lié à un nom par l'instruction :keyword:`import`.

source: On the other hand, the statement ``from spam.ham import eggs, sausage as saus`` results in ::
fr: En revanche, l'instruction ``from spam.ham import eggs, sausage as saus`` donne ::

source: Here, the ``spam.ham`` module is returned from :func:`__import__`. From this object, the names to import are retrieved and assigned to their respective names.
fr: Ici le module ``spam.ham`` est renvoyé par :func:`__import__`. De cet objet, les noms à importer sont récupérés et assignés à leurs noms respectifs.

source: If you simply want to import a module (potentially within a package) by name, use :func:`importlib.import_module`.
fr: Si vous voulez simplement importer un module (potentiellement dans un paquet) par son nom, utilisez :func:`importlib.import_module`.

source: Negative values for *level* are no longer supported (which also changes the default value to 0).
fr: les valeurs négatives pour *level* ne sont plus prises en charge (et sa valeur par défaut est 0).

source: When the command line options :option:`-E` or :option:`-I` are being used, the environment variable :envvar:`PYTHONCASEOK` is now ignored.
fr: Quand les options :option:`-E` ou :option:`-I` sont précisées dans la ligne de commande, la variable d'environnement :envvar:`PYTHONCASEOK` est ignorée.

source: Footnotes
fr: Notes

source: Note that the parser only accepts the Unix-style end of line convention. If you are reading the code from a file, make sure to use newline conversion mode to convert Windows or Mac-style newlines.
fr: Notez que l'analyseur n'accepte que des fin de lignes de style Unix. Si vous lisez le code depuis un fichier, assurez-vous d'utiliser la conversion de retours à la ligne pour convertir les fin de lignes Windows et Mac.
