Repository: python/python-docs-fr
Catalog: library/functions.po
Languages: fr

source: Built-in Functions
fr: Fonctions natives

source: The Python interpreter has a number of functions and types built into it that are always available. They are listed here in alphabetical order.
fr: L'interpréteur Python propose quelques fonctions et types natifs qui sont toujours disponibles. Ils sont listés ici par ordre alphabétique.

source: Return the absolute value of a number. The argument may be an integer, a floating point number, or an object implementing :meth:`__abs__`. If the argument is a complex number, its magnitude is returned.
fr: Renvoie la valeur absolue d'un nombre. L'argument peut être un nombre entier, un nombre à virgule flottante, ou tout objet définissant :meth:`__abs__`. Si l'argument est un nombre complexe, son module est renvoyé.

source: Return an :term:`asynchronous iterator` for an :term:`asynchronous iterable`. Equivalent to calling ``x.__aiter__()``.
fr: Renvoie un :term:`itérateur asynchrone <asynchronous iterator>` pour l':term:`itérable asynchrone <asynchronous iterable>` donné. Équivaut à appeler ``x.__aiter__()``.

source: Note: Unlike :func:`iter`, :func:`aiter` has no 2-argument variant.
fr: Remarque : contrairement à :func:`iter`, :func:`aiter` n'a pas de variante à 2 arguments.

source: Return ``True`` if all elements of the *iterable* are true (or if the iterable is empty). Equivalent to::
fr: Renvoie ``True`` si tous les éléments de *iterable* sont vrais (ou s'il est vide). Équivaut à ::

source: When awaited, return the next item from the given :term:`asynchronous iterator`, or *default* if given and the iterator is exhausted.
fr: Lorsqu'il est attendu, renvoie l'élément suivant à partir de l':term:`itérateur asynchrone <asynchronous iterator>` donné, ou *default* s'il est fourni et que l'itérateur est épuisé.

source: This is the async variant of the :func:`next` builtin, and behaves similarly.
fr: Il s'agit de la variante asynchrone de la fonction native :func:`next` et elle se comporte de la même manière.

source: This calls the :meth:`~object.__anext__` method of *async_iterator*, returning an :term:`awaitable`. Awaiting this returns the next value of the iterator. If *default* is given, it is returned if the iterator is exhausted, otherwise :exc:`StopAsyncIteration` is raised.
fr: Renvoie un :term:`attendable <awaitable>` en appelant la méthode :meth:`~object.__anext__` de *async_iterator*. L'attente renvoie la prochaine valeur de l'itérateur. Si *default* est fourni, il est renvoyé si l'itérateur est épuisé, sinon :exc:`StopAsyncIteration` est levée.

source: Return ``True`` if any element of the *iterable* is true. If the iterable is empty, return ``False``. Equivalent to::
fr: Renvoie ``True`` si au moins un élément de *iterable* est vrai. ``False`` est renvoyé dans le cas où *iterable* est vide. Équivaut à ::

source: Convert an integer number to a binary string prefixed with "0b". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`__index__` method that returns an integer. Some examples:
fr: Convertit un nombre entier en binaire dans une chaîne avec le préfixe ``0b``. Le résultat est une expression Python valide. Si *x* n'est pas un :class:`int`, il doit définir une méthode :meth:`__index__` donnant un nombre entier. Voici quelques exemples :

source: If the prefix "0b" is desired or not, you can use either of the following ways.
fr: Vous pouvez contrôler l'affichage du préfixe ``"0b"`` à l'aide d'un des moyens suivants.

source: See also :func:`format` for more information.
fr: Voir aussi :func:`format` pour plus d'informations.

source: *x* is now a positional-only parameter.
fr: *x* est désormais un argument exclusivement optionnel.

source: This function drops you into the debugger at the call site. Specifically, it calls :func:`sys.breakpointhook`, passing ``args`` and ``kws`` straight through. By default, ``sys.breakpointhook()`` calls :func:`pdb.set_trace()` expecting no arguments. In this case, it is purely a convenience function so you don't have to explicitly import :mod:`pdb` or type as much code to enter the debugger. However, :func:`sys.breakpointhook` can be set to some other function and :func:`breakpoint` will automatically call that, allowing you to drop into the debugger of choice. If :func:`sys.breakpointhook` is not accessible, this function will raise :exc:`RuntimeError`.
fr: Cette fonction vous place dans le débogueur lorsqu'elle est appelée. Plus précisément, elle appelle :func:`sys.breakpointhook`, en lui passant les arguments ``args`` et ``kws``. Par défaut, ``sys.breakpointhook()`` appelle :func:`pdb.set_trace()` qui n'attend aucun argument. Dans ce cas, c'est purement une fonction de commodité donc vous n'avez pas à importer explicitement :mod:`pdb` ou à taper plus de code pour entrer dans le débogueur. Cependant, il est possible d'affecter une autre fonction à :func:`sys.breakpointhook`, que :func:`breakpoint` appellera automatiquement, vous permettant ainsi de basculer dans le débogueur de votre choix. Si :func:`sys.breakpointhook` n'est pas accessible, cette fonction lève :exc:`RuntimeError`.

source: Raises an :ref:`auditing event <auditing>` ``builtins.breakpoint`` with argument ``breakpointhook``.
fr: Lève un :ref:`évènement d'audit <auditing>` ``builtins.breakpoint`` avec l'argument ``breakpointhook``.

source: Return a new array of bytes. The :class:`bytearray` class is a mutable sequence of integers in the range 0 <= x < 256. It has most of the usual methods of mutable sequences, described in :ref:`typesseq-mutable`, as well as most methods that the :class:`bytes` type has, see :ref:`bytes-methods`.
fr: Renvoie un nouveau tableau d'octets. La classe :class:`bytearray` est une séquence muable de nombres entiers dans l'intervalle 0 <= x < 256. Il possède la plupart des méthodes des séquences variables, décrites dans :ref:`typesseq-mutable`, ainsi que la plupart des méthodes de la classe :class:`bytes`, voir :ref:`bytes-methods`.

source: The optional *source* parameter can be used to initialize the array in a few different ways:
fr: Le paramètre optionnel *source* peut être utilisé pour initialiser le tableau de plusieurs façons :

source: If it is a *string*, you must also give the *encoding* (and optionally, *errors*) parameters; :func:`bytearray` then converts the string to bytes using :meth:`str.encode`.
fr: si c'est une *chaîne*, vous devez aussi donner le paramètre *encoding* pour l'encodage (et éventuellement *errors*). La fonction :func:`bytearray` convertit ensuite la chaîne en octets via la méthode :meth:`str.encode` ;

source: If it is an *integer*, the array will have that size and will be initialized with null bytes.
fr: si c'est un *entier*, le tableau a cette taille et est initialisé d'octets *null* ;

source: If it is an *iterable*, it must be an iterable of integers in the range ``0 <= x < 256``, which are used as the initial contents of the array.
fr: si c'est un *itérable*, il doit itérer sur des nombres entier dans l'intervalle ``0 <= x < 256``, qui sont utilisés pour initialiser le contenu du tableau.

source: Without an argument, an array of size 0 is created.
fr: Sans argument, un tableau vide est créé.

source: See also :ref:`binaryseq` and :ref:`typebytearray`.
fr: Voir :ref:`binaryseq` et :ref:`typebytearray`.

source: Return a new "bytes" object which is an immutable sequence of integers in the range ``0 <= x < 256``. :class:`bytes` is an immutable version of :class:`bytearray` -- it has the same non-mutating methods and the same indexing and slicing behavior.
fr: Renvoie un nouvel objet *bytes*, qui est une séquence immuable de nombres entiers dans l'intervalle ``0 <= x < 256``. Un :class:`bytes` est une version immuable de :class:`bytearray` — avec les mêmes méthodes d'accès, et le même comportement lors de l'indexation ou du découpage.

source: Accordingly, constructor arguments are interpreted as for :func:`bytearray`.
fr: En conséquence, les arguments du constructeur sont les mêmes que pour :func:`bytearray`.

source: Bytes objects can also be created with literals, see :ref:`strings`.
fr: Les objets *bytes* peuvent aussi être créés à partir de littéraux, voir :ref:`strings`.

source: See also :ref:`binaryseq`, :ref:`typebytes`, and :ref:`bytes-methods`.
fr: Voir aussi :ref:`binaryseq`, :ref:`typebytes`, et :ref:`bytes-methods`.

source: Return :const:`True` if the *object* argument appears callable, :const:`False` if not. If this returns ``True``, it is still possible that a call fails, but if it is ``False``, calling *object* will never succeed. Note that classes are callable (calling a class returns a new instance); instances are callable if their class has a :meth:`__call__` method.
fr: Renvoie :const:`True` si l'argument *object* semble être appelable, sinon :const:`False`. Lorsqu'elle renvoie ``True``, il est toujours possible qu'un appel échoue. Cependant, lorsqu'elle renvoie ``False``, il n'est jamais possible d'appeler *object*. Notez qu'une classe est toujours appelable (appeler une classe donne une nouvelle instance) ; une instance n'est appelable que si sa classe définit une méthode :meth:`__call__`.

source: This function was first removed in Python 3.0 and then brought back in Python 3.2.
fr: cette fonction a d'abord été supprimée avec Python 3.0 puis elle a été remise dans Python 3.2.

source: Return the string representing a character whose Unicode code point is the integer *i*. For example, ``chr(97)`` returns the string ``'a'``, while ``chr(8364)`` returns the string ``'€'``. This is the inverse of :func:`ord`.
fr: Renvoie la chaîne représentant un caractère dont le code de caractère Unicode est le nombre entier *i*. Par exemple, ``chr(97)`` renvoie la chaîne de caractères ``'a'``, tandis que ``chr(8364)`` renvoie ``'€'``. Il s'agit de l'inverse de :func:`ord`.

source: The valid range for the argument is from 0 through 1,114,111 (0x10FFFF in base 16). :exc:`ValueError` will be raised if *i* is outside that range.
fr: L'intervalle valide pour cet argument est de ``0`` à ``1114111`` (``0x10FFFF`` en base 16). Une exception :exc:`ValueError` est levée si *i* est en dehors de l'intervalle.

source: Transform a method into a class method.
fr: Transforme une méthode en méthode de classe.

source: The ``@classmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
fr: La forme ``@classmethod`` est un :term:`décorateur <decorator>` de fonction — consultez :ref:`function` pour plus de détails.

source: A class method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``). The instance is ignored except for its class. If a class method is called for a derived class, the derived class object is passed as the implied first argument.
fr: Elle peut être appelée soit sur la classe (comme ``C.f()``) ou sur une instance (comme ``C().f()``). L'instance est ignorée, sauf pour déterminer sa classe. Si la méthode est appelée sur une instance de classe fille, c'est la classe fille qui sera donnée en premier argument implicite.

source: Class methods are different than C++ or Java static methods. If you want those, see :func:`staticmethod` in this section. For more information on class methods, see :ref:`types`.
fr: Les méthodes de classe sont différentes des méthodes statiques du C++ ou du Java. Si ce sont elles dont vous avez besoin, regardez du côté de :func:`staticmethod` dans cette section. Voir aussi :ref:`types`.

source: Class methods can now wrap other :term:`descriptors <descriptor>` such as :func:`property`.
fr: les méthodes de classe peuvent encapsuler d'autres :term:`descripteurs <descriptor>` comme :func:`property`.

source: Class methods now inherit the method attributes (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` and ``__annotations__``) and have a new ``__wrapped__`` attribute.
fr: les méthodes de classe peuvent maintenant hériter des attributs des méthodes (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` et ``__annotations__``) et ont un nouvel attribut ``__wrapped__``.

source: Compile the *source* into a code or AST object. Code objects can be executed by :func:`exec` or :func:`eval`. *source* can either be a normal string, a byte string, or an AST object. Refer to the :mod:`ast` module documentation for information on how to work with AST objects.
fr: Compile *source* en un objet code ou objet AST. Les objets code peuvent être exécutés par :func:`exec` ou :func:`eval`. *source* peut être une chaîne, une chaîne d'octets, ou un objet AST. Consultez la documentation du module :mod:`ast` pour des informations sur la manipulation d'objets AST.

source: The *filename* argument should give the file from which the code was read; pass some recognizable value if it wasn't read from a file (``'<string>'`` is commonly used).
fr: L'argument *filename* doit désigner le fichier depuis lequel le code a été lu. Donnez quelque chose de reconnaissable lorsqu'il n'a pas été lu depuis un fichier (typiquement ``"<string>"``).

source: The *mode* argument specifies what kind of code must be compiled; it can be ``'exec'`` if *source* consists of a sequence of statements, ``'eval'`` if it consists of a single expression, or ``'single'`` if it consists of a single interactive statement (in the latter case, expression statements that evaluate to something other than ``None`` will be printed).
fr: L'argument *mode* indique quel type de code doit être compilé : ``'exec'`` si *source* est une suite d'instructions, ``'eval'`` pour une seule expression, ou ``'single'`` s'il ne contient qu'une instruction interactive (dans ce dernier cas, les résultats d'expressions donnant autre chose que ``None`` sont affichés).

source: The optional arguments *flags* and *dont_inherit* control which :ref:`compiler options <ast-compiler-flags>` should be activated and which :ref:`future features <future>` should be allowed. If neither is present (or both are zero) the code is compiled with the same flags that affect the code that is calling :func:`compile`. If the *flags* argument is given and *dont_inherit* is not (or is zero) then the compiler options and the future statements specified by the *flags* argument are used in addition to those that would be used anyway. If *dont_inherit* is a non-zero integer then the *flags* argument is it -- the flags (future features and compiler options) in the surrounding code are ignored.
fr: Les arguments optionnels *flags* et *dont_inherit* contrôlent quelles :ref:`options de compilation <ast-compiler-flags>` seront activées et quelles :ref:`instructions future <future>` seront autorisées. Si aucun des deux n'est présent (ou que les deux sont à 0), le code est compilé avec les mêmes paramètres que le code appelant :func:`compile`. Si l'argument *flags* est fourni alors que *dont_inherit* ne l'est pas (ou vaut 0), les options de compilation et les instructions *futures* utilisées sont celles définies par *flags* en plus de celles qui auraient été utilisées. Si *dont_inherit* est un entier différent de zéro, *flags* est utilisé tel quel — les *flags* (instructions futures et options de compilation) valables pour le code encadrant *compile* sont ignorés.

source: Compiler options and future statements are specified by bits which can be bitwise ORed together to specify multiple options. The bitfield required to specify a given future feature can be found as the :attr:`~__future__._Feature.compiler_flag` attribute on the :class:`~__future__._Feature` instance in the :mod:`__future__` module. :ref:`Compiler flags <ast-compiler-flags>` can be found in :mod:`ast` module, with ``PyCF_`` prefix.
fr: Les instructions *future* sont contrôlées par des bits, il est ainsi possible d'en activer plusieurs en les combinant avec un *OU* binaire. Les bits requis pour demander une certaine fonctionnalité se trouvent dans l'attribut :attr:`~__future__._Feature.compiler_flag` de la classe :class:`~__future__.Feature` du module :mod:`__future__`. Les :ref:`options du compilateur <ast-compiler-flags>` se trouvent dans le module :mod:`ast`, avec le préfixe ``PyCF_``.

source: The argument *optimize* specifies the optimization level of the compiler; the default value of ``-1`` selects the optimization level of the interpreter as given by :option:`-O` options. Explicit levels are ``0`` (no optimization; ``__debug__`` is true), ``1`` (asserts are removed, ``__debug__`` is false) or ``2`` (docstrings are removed too).
fr: L'argument *optimize* indique le niveau d'optimisation du compilateur. La valeur par défaut est ``-1`` qui prend le niveau d'optimisation de l'interpréteur tel que reçu via l'option :option:`-O`. Les niveaux explicites sont : ``0`` (pas d'optimisation, ``__debug__`` est ``True``), ``1`` (les ``assert`` sont supprimés, ``__debug__`` est ``False``) ou ``2`` (les *docstrings* sont également supprimées).

source: This function raises :exc:`SyntaxError` if the compiled source is invalid, and :exc:`ValueError` if the source contains null bytes.
fr: Cette fonction lève une :exc:`SyntaxError` si la source n'est pas valide, et :exc:`ValueError` si la source contient des octets *null*.

source: If you want to parse Python code into its AST representation, see :func:`ast.parse`.
fr: Si vous voulez transformer du code Python en sa représentation AST, voyez :func:`ast.parse`.

source: Raises an :ref:`auditing event <auditing>` ``compile`` with arguments ``source`` and ``filename``. This event may also be raised by implicit compilation.
fr: Lève un :ref:`évènement d'audit <auditing>` ``compile`` avec les arguments ``source`` et ``filename``. Cet événement peut également être levé par une compilation implicite.

source: When compiling a string with multi-line code in ``'single'`` or ``'eval'`` mode, input must be terminated by at least one newline character. This is to facilitate detection of incomplete and complete statements in the :mod:`code` module.
fr: Lors de la compilation d'une chaîne de plusieurs lignes de code avec les modes ``'single'`` ou ``'eval'``, celles-ci doivent être terminées par au moins un retour à la ligne. Cela permet de faciliter la distinction entre les instructions complètes et incomplètes dans le module :mod:`code`.

source: It is possible to crash the Python interpreter with a sufficiently large/complex string when compiling to an AST object due to stack depth limitations in Python's AST compiler.
fr: Il est possible de faire planter l'interpréteur Python avec des chaînes suffisamment grandes ou complexes lors de la compilation d'un objet AST. Ceci est dû à limitation de la profondeur de la pile d'appels.

source: Previously, :exc:`TypeError` was raised when null bytes were encountered in *source*.
fr: précédemment, l'exception :exc:`TypeError` était levée quand un caractère nul était rencontré dans *source*.

source: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` can now be passed in flags to enable support for top-level ``await``, ``async for``, and ``async with``.
fr: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` peut maintenant être passée à *flags* pour permettre une gestion de ``await``, ``async for``, et ``async with`` de haut niveau.

source: Return a complex number with the value *real* + *imag*\*1j or convert a string or number to a complex number. If the first parameter is a string, it will be interpreted as a complex number and the function must be called without a second parameter. The second parameter can never be a string. Each argument may be any numeric type (including complex). If *imag* is omitted, it defaults to zero and the constructor serves as a numeric conversion like :class:`int` and :class:`float`. If both arguments are omitted, returns ``0j``.
fr: Renvoie un nombre complexe de valeur ``real + imag*1j``, ou convertit une chaîne ou un nombre en nombre complexe. Si le premier paramètre est une chaîne, il sera interprété comme un nombre complexe et la fonction doit être appelée sans second paramètre. Le second paramètre ne peut jamais être une chaîne. Chaque argument peut être de n'importe quel type numérique (même complexe). Si *imag* est omis, sa valeur par défaut est zéro, le constructeur effectue alors une simple conversion numérique comme le font :class:`int` ou :class:`float`. Si aucun argument n'est fourni, renvoie ``0j``.

source: For a general Python object ``x``, ``complex(x)`` delegates to ``x.__complex__()``. If ``__complex__()`` is not defined then it falls back to :meth:`__float__`. If ``__float__()`` is not defined then it falls back to :meth:`__index__`.
fr: Pour un objet Python général ``x``, ``complex(x)`` délègue à ``x.__complex__()``. Si ``__complex__()`` n'est pas défini, alors il délègue à :meth:`__float__`. Si ``__float__()`` n'est pas défini, alors il délègue à :meth:`__index__`.

source: When converting from a string, the string must not contain whitespace around the central ``+`` or ``-`` operator. For example, ``complex('1+2j')`` is fine, but ``complex('1 + 2j')`` raises :exc:`ValueError`.
fr: Lors de la conversion depuis une chaîne, elle ne doit pas contenir d'espaces autour des opérateurs binaires ``+`` ou ``-``. Par exemple ``complex('1+2j')`` est correct, mais ``complex('1 + 2j')`` lève une :exc:`ValueError`.

source: The complex type is described in :ref:`typesnumeric`.
fr: Le type complexe est décrit dans :ref:`typesnumeric`.

source: Grouping digits with underscores as in code literals is allowed.
fr: les chiffres peuvent être groupés avec des tirets bas comme dans les expressions littérales.

source: Falls back to :meth:`__index__` if :meth:`__complex__` and :meth:`__float__` are not defined.
fr: revient à :meth:`__index__` si :meth:`__complex__` et :meth:`__float__` ne sont pas définies.

source: This is a relative of :func:`setattr`. The arguments are an object and a string. The string must be the name of one of the object's attributes. The function deletes the named attribute, provided the object allows it. For example, ``delattr(x, 'foobar')`` is equivalent to ``del x.foobar``. *name* need not be a Python identifier (see :func:`setattr`).
fr: C'est une cousine de :func:`setattr`. Les arguments sont un objet et une chaîne. La chaîne doit être le nom de l'un des attributs de l'objet. La fonction supprime l'attribut nommé, si l'objet l'y autorise. Par exemple ``delattr(x, 'foobar')`` est l'équivalent de ``del x.foobar``. *name* n'a pas besoin d'être un identifiant Python (voir :func:`setattr`).

source: Create a new dictionary. The :class:`dict` object is the dictionary class. See :class:`dict` and :ref:`typesmapping` for documentation about this class.
fr: Créé un nouveau dictionnaire. L'objet :class:`dict` est la classe du dictionnaire. Voir :class:`dict` et :ref:`typesmapping` pour vous documenter sur cette classe.

source: For other containers see the built-in :class:`list`, :class:`set`, and :class:`tuple` classes, as well as the :mod:`collections` module.
fr: Pour les autres conteneurs, voir les classes natives :class:`list`, :class:`set`, et :class:`tuple`, ainsi que le module :mod:`collections`.

source: Without arguments, return the list of names in the current local scope. With an argument, attempt to return a list of valid attributes for that object.
fr: Sans argument, elle donne la liste des noms dans l'espace de nommage local. Avec un argument, elle essaye de donner une liste d'attributs valides pour cet objet.

source: If the object has a method named :meth:`__dir__`, this method will be called and must return the list of attributes. This allows objects that implement a custom :func:`__getattr__` or :func:`__getattribute__` function to customize the way :func:`dir` reports their attributes.
fr: Si l'objet a une méthode :meth:`__dir__`, elle est appelée et doit donner une liste d'attributs. Cela permet aux objets implémentant :func:`__getattr__` ou :func:`__getattribute__` de personnaliser ce que donnera :func:`dir`.
