Repository: python/python-docs-fr
Catalog: library/functions.po
Languages: fr

source: A custom opener can be used by passing a callable as *opener*. The underlying file descriptor for the file object is then obtained by calling *opener* with (*file*, *flags*). *opener* must return an open file descriptor (passing :mod:`os.open` as *opener* results in functionality similar to passing ``None``).
fr: Un *opener* personnalisé peut être utilisé en fournissant un appelable comme *opener*. Le descripteur de fichier de cet objet fichier sera alors obtenu en appelant *opener* avec (*file*, *flags*). *opener* doit renvoyer un descripteur de fichier ouvert (fournir :mod:`os.open` en tant qu'*opener* aura le même effet que donner ``None``).

source: The newly created file is :ref:`non-inheritable <fd_inheritance>`.
fr: Il n'est :ref:`pas possible d'hériter du fichier <fd_inheritance>` nouvellement créé.

source: The following example uses the :ref:`dir_fd <dir_fd>` parameter of the :func:`os.open` function to open a file relative to a given directory::
fr: L'exemple suivant utilise le paramètre :ref:`dir_fd <dir_fd>` de la fonction :func:`os.open` pour ouvrir un fichier relatif au dossier courant ::

source: The type of :term:`file object` returned by the :func:`open` function depends on the mode. When :func:`open` is used to open a file in a text mode (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, etc.), it returns a subclass of :class:`io.TextIOBase` (specifically :class:`io.TextIOWrapper`). When used to open a file in a binary mode with buffering, the returned class is a subclass of :class:`io.BufferedIOBase`. The exact class varies: in read binary mode, it returns an :class:`io.BufferedReader`; in write binary and append binary modes, it returns an :class:`io.BufferedWriter`, and in read/write mode, it returns an :class:`io.BufferedRandom`. When buffering is disabled, the raw stream, a subclass of :class:`io.RawIOBase`, :class:`io.FileIO`, is returned.
fr: Le type d'\ :term:`objet fichier <file object>` renvoyé par la fonction :func:`open` dépend du mode. Lorsque :func:`open` est utilisé pour ouvrir un fichier en mode texte (``w``, ``r``, ``wt``, ``rt``, etc.), il renvoie une classe fille de :class:`io.TextIOBase` (spécifiquement : :class:`io.TextIOWrapper`). Lors de l'ouverture d'un fichier en mode binaire avec tampon, la classe renvoyée sera une fille de :class:`io.BufferedIOBase`. La classe exacte varie : en lecture en mode binaire elle renvoie une :class:`io.BufferedReader`, en écriture et ajout en mode binaire c'est une :class:`io.BufferedWriter`, et en lecture-écriture, c'est une :class:`io.BufferedRandom`. Lorsque le tampon est désactivé, le flux brut, une classe fille de :class:`io.RawIOBase`, :class:`io.FileIO` est renvoyée.

source: Raises an :ref:`auditing event <auditing>` ``open`` with arguments ``file``, ``mode``, ``flags``.
fr: Lève un :ref:`évènement d'audit <auditing>` ``open`` avec les arguments ``file``, ``mode`` et ``flags``.

source: The ``mode`` and ``flags`` arguments may have been modified or inferred from the original call.
fr: Les arguments ``mode`` et ``flags`` peuvent avoir été modifiés ou déduits de l'appel original.

source: The *opener* parameter was added.
fr: ajout du paramètre *opener*.

source: The ``'x'`` mode was added.
fr: ajout du mode ``'x'``.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
fr: :exc:`IOError` était normalement levée, elle est maintenant un alias de :exc:`OSError`.

source: :exc:`FileExistsError` is now raised if the file opened in exclusive creation mode (``'x'``) already exists.
fr: :exc:`FileExistsError` est maintenant levée si le fichier ouvert en mode création exclusive (``'x'``) existe déjà.

source: The file is now non-inheritable.
fr: Il n'est plus possible d'hériter de *file*.

source: The ``'U'`` mode.
fr: Le mode ``'U'``.

source: If the system call is interrupted and the signal handler does not raise an exception, the function now retries the system call instead of raising an :exc:`InterruptedError` exception (see :pep:`475` for the rationale).
fr: Si l'appel système est interrompu et que le gestionnaire de signal ne lève aucune exception, la fonction réessaye l'appel système au lieu de lever une :exc:`InterruptedError` (voir la :pep:`475` pour la justification).

source: The ``'namereplace'`` error handler was added.
fr: ajout du gestionnaire d'erreurs ``'namereplace'``.

source: Support added to accept objects implementing :class:`os.PathLike`.
fr: prise en charge des objets implémentant :class:`os.PathLike`.

source: On Windows, opening a console buffer may return a subclass of :class:`io.RawIOBase` other than :class:`io.FileIO`.
fr: Sous Windows, ouvrir un *buffer* du terminal peut renvoyer une sous-classe de :class:`io.RawIOBase` autre que :class:`io.FileIO`.

source: Given a string representing one Unicode character, return an integer representing the Unicode code point of that character. For example, ``ord('a')`` returns the integer ``97`` and ``ord('€')`` (Euro sign) returns ``8364``. This is the inverse of :func:`chr`.
fr: Renvoie le nombre entier représentant le code Unicode du caractère représenté par la chaîne donnée. Par exemple, ``ord('a')`` renvoie le nombre entier ``97`` et ``ord('€')`` (symbole euro) renvoie ``8364``. Il s'agit de l'inverse de :func:`chr`.

source: Return *base* to the power *exp*; if *mod* is present, return *base* to the power *exp*, modulo *mod* (computed more efficiently than ``pow(base, exp) % mod``). The two-argument form ``pow(base, exp)`` is equivalent to using the power operator: ``base**exp``.
fr: Renvoie *base* puissance *exp* et, si *mod* est présent, donne *base* puissance *exp* modulo *mod* (calculé de manière plus efficiente que ``pow(base, exp) % mod``). La forme à deux arguments ``pow(base, exp)`` est équivalente à l'opérateur puissance : ``base**exp``.

source: For :class:`int` operands *base* and *exp*, if *mod* is present, *mod* must also be of integer type and *mod* must be nonzero. If *mod* is present and *exp* is negative, *base* must be relatively prime to *mod*. In that case, ``pow(inv_base, -exp, mod)`` is returned, where *inv_base* is an inverse to *base* modulo *mod*.
fr: Pour des opérandes *base* et *exp* de type :class:`int`, si *mod* est présent, *mod* doit également être de type entier et *mod* doit être non nul. Si *mod* est présent et que *exp* est négatif, *base* et *mod* doivent être premiers entre eux. Dans ce cas, ``pow(inv_base, -exp, mod)`` est renvoyé, où *inv_base* est un inverse de *base* modulo *mod*.

source: Here's an example of computing an inverse for ``38`` modulo ``97``::
fr: Voici un exemple de calcul d'un inverse de ``38`` modulo ``97`` ::

source: For :class:`int` operands, the three-argument form of ``pow`` now allows the second argument to be negative, permitting computation of modular inverses.
fr: Pour les opérandes :class:`int`, la forme à trois arguments de ``pow`` permet maintenant au deuxième argument d'être négatif, permettant le calcul des inverses modulaires.

source: Allow keyword arguments. Formerly, only positional arguments were supported.
fr: Autorise les arguments par mots-clés. Auparavant, seuls les arguments positionnels étaient autorisés.

source: All non-keyword arguments are converted to strings like :func:`str` does and written to the stream, separated by *sep* and followed by *end*. Both *sep* and *end* must be strings; they can also be ``None``, which means to use the default values. If no *objects* are given, :func:`print` will just write *end*.
fr: Tous les arguments positionnels sont convertis en chaîne comme le fait :func:`str`, puis écrits sur le flux, séparés par *sep* et terminés par *end*. *sep* et *end* doivent être des chaînes, ou ``None``, indiquant de prendre les valeurs par défaut. Si aucun *objects* n'est donné :func:`print` écris seulement *end*.

source: The *file* argument must be an object with a ``write(string)`` method; if it is not present or ``None``, :data:`sys.stdout` will be used. Since printed arguments are converted to text strings, :func:`print` cannot be used with binary mode file objects. For these, use ``file.write(...)`` instead.
fr: L'argument *file* doit être un objet avec une méthode ``write(string)`` ; s'il n'est pas fourni, ou vaut ``None``, :data:`sys.stdout` sera utilisé. Puisque les arguments affichés sont convertis en chaîne, :func:`print` ne peut pas être utilisé avec des fichiers ouverts en mode binaire. Pour ceux-ci utilisez plutôt ``file.write(...)``.

source: Added the *flush* keyword argument.
fr: ajout de l'argument nommé *flush*.

source: Return a property attribute.
fr: Renvoie un attribut propriété.

source: *fget* is a function for getting an attribute value. *fset* is a function for setting an attribute value. *fdel* is a function for deleting an attribute value. And *doc* creates a docstring for the attribute.
fr: *fget* est une fonction permettant d'obtenir la valeur d'un attribut. *fset* est une fonction pour en définir la valeur. *fdel* quant à elle permet de supprimer la valeur d'un attribut, et *doc* créé une *docstring* pour l'attribut.

source: A typical use is to define a managed attribute ``x``::
fr: Une utilisation courante : définir un attribut managé ``x`` ::

source: If given, *doc* will be the docstring of the property attribute. Otherwise, the property will copy *fget*'s docstring (if it exists). This makes it possible to create read-only properties easily using :func:`property` as a :term:`decorator`::
fr: S'il est donné, *doc* sera la *docstring* de l'attribut. Autrement la propriété copiera celle de *fget* (si elle existe). Cela rend possible la création de propriétés en lecture seule en utilisant simplement :func:`property` comme un :term:`décorateur <decorator>` ::

source: The ``@property`` decorator turns the :meth:`voltage` method into a "getter" for a read-only attribute with the same name, and it sets the docstring for *voltage* to "Get the current voltage."
fr: Le décorateur ``@property`` transforme la méthode :meth:`voltage` en un *getter* d'un attribut du même nom, et donne *"Get the current voltage"* comme *docstring* de *voltage*.

source: A property object has :attr:`~property.getter`, :attr:`~property.setter`, and :attr:`~property.deleter` methods usable as decorators that create a copy of the property with the corresponding accessor function set to the decorated function. This is best explained with an example::
fr: Un objet propriété a les méthodes :attr:`~property.getter`, :attr:`~property.setter` et :attr:`~property.deleter` utilisables comme décorateurs créant une copie de la propriété avec les accesseurs correspondants définis par la fonction de décoration. C'est plus clair avec un exemple ::

source: This code is exactly equivalent to the first example. Be sure to give the additional functions the same name as the original property (``x`` in this case.)
fr: Ce code est l'exact équivalent du premier exemple. Soyez attentifs à bien donner aux fonctions additionnelles le même nom que la propriété (``x`` dans ce cas).

source: The returned property object also has the attributes ``fget``, ``fset``, and ``fdel`` corresponding to the constructor arguments.
fr: L'objet propriété renvoyé à aussi les attributs ``fget``, ``fset`` et ``fdel`` correspondants aux arguments du constructeur.

source: The docstrings of property objects are now writeable.
fr: Les *docstrings* des objets propriété peuvent maintenant être écrits.

source: Rather than being a function, :class:`range` is actually an immutable sequence type, as documented in :ref:`typesseq-range` and :ref:`typesseq`.
fr: Contrairement aux apparences, :class:`range` n'est pas une fonction mais un type de séquence immuable, comme décrit dans :ref:`typesseq-range` et :ref:`typesseq`.

source: Return a reverse :term:`iterator`. *seq* must be an object which has a :meth:`__reversed__` method or supports the sequence protocol (the :meth:`__len__` method and the :meth:`__getitem__` method with integer arguments starting at ``0``).
fr: Renvoie un :term:`itérateur <iterator>` inversé. *seq* doit être un objet ayant une méthode :meth:`__reverse__` ou prenant en charge le protocole séquence (la méthode :meth:`__len__` et la méthode :meth:`__getitem__` avec des arguments entiers commençant à zéro).

source: Return *number* rounded to *ndigits* precision after the decimal point. If *ndigits* is omitted or is ``None``, it returns the nearest integer to its input.
fr: Renvoie *number* arrondi avec une précision de *ndigits* chiffres après la virgule. Si *ndigits* est omis (ou est ``None``), l'entier le plus proche est renvoyé.

source: For a general Python object ``number``, ``round`` delegates to ``number.__round__``.
fr: Pour tout autre objet Python ``number``, ``round`` délègue à ``number.__round__``.

source: The behavior of :func:`round` for floats can be surprising: for example, ``round(2.675, 2)`` gives ``2.67`` instead of the expected ``2.68``. This is not a bug: it's a result of the fact that most decimal fractions can't be represented exactly as a float. See :ref:`tut-fp-issues` for more information.
fr: Le comportement de :func:`round` avec les nombres à virgule flottante peut être surprenant : par exemple ``round(2.675, 2)`` donne ``2.67`` au lieu de ``2.68``. Ce n'est pas un bogue, mais dû au fait que la plupart des fractions de décimaux ne peuvent pas être représentés exactement en nombre a virgule flottante. Voir :ref:`tut-fp-issues` pour plus d'information.

source: Return a new :class:`set` object, optionally with elements taken from *iterable*. ``set`` is a built-in class. See :class:`set` and :ref:`types-set` for documentation about this class.
fr: Renvoie un nouveau :class:`set`, dont les éléments peuvent être extraits d'*iterable*. ``set`` est une classe native. Voir :class:`set` et :ref:`types-set` pour la documentation de cette classe.

source: For other containers see the built-in :class:`frozenset`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
fr: D'autres conteneurs existent, comme : :class:`frozenset`, :class:`list`, :class:`tuple`, et :class:`dict`, ainsi que le module :mod:`collections`.

source: Return a new sorted list from the items in *iterable*.
fr: Renvoie une nouvelle liste triée depuis les éléments d'*iterable*.

source: Has two optional arguments which must be specified as keyword arguments.
fr: A deux arguments optionnels qui doivent être nommés.

source: *key* specifies a function of one argument that is used to extract a comparison key from each element in *iterable* (for example, ``key=str.lower``). The default value is ``None`` (compare the elements directly).
fr: *key* spécifie une fonction d'un argument utilisé pour extraire une clé de comparaison de chaque élément de l'itérable (par exemple, ``key=str.lower``). La valeur par défaut est ``None`` (compare les éléments directement).

source: *reverse* is a boolean value. If set to ``True``, then the list elements are sorted as if each comparison were reversed.
fr: *reverse*, une valeur booléenne. Si elle est ``True``, la liste d'éléments est triée comme si toutes les comparaisons étaient inversées.

source: Use :func:`functools.cmp_to_key` to convert an old-style *cmp* function to a *key* function.
fr: Utilisez :func:`functools.cmp_to_key` pour convertir l'ancienne notation *cmp* en une fonction *key*.

source: The built-in :func:`sorted` function is guaranteed to be stable. A sort is stable if it guarantees not to change the relative order of elements that compare equal --- this is helpful for sorting in multiple passes (for example, sort by department, then by salary grade).
fr: La fonction native :func:`sorted` est garantie stable. Un tri est stable s'il garantit de ne pas changer l'ordre relatif des éléments égaux entre eux. C'est utile pour trier en plusieurs passes (par exemple par département puis par salaire).

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
fr: Pour des exemples de tris et un bref tutoriel, consultez :ref:`sortinghowto`.

source: Transform a method into a static method.
fr: Transforme une méthode en méthode statique.

source: A static method does not receive an implicit first argument. To declare a static method, use this idiom::
fr: Une méthode statique ne reçoit pas de premier argument implicitement. Voilà comment déclarer une méthode statique ::

source: The ``@staticmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
fr: La forme ``@staticmethod`` est un :term:`décorateur <decorator>` de fonction. Consultez :ref:`function` pour plus de détails.

source: Like all decorators, it is also possible to call ``staticmethod`` as a regular function and do something with its result. This is needed in some cases where you need a reference to a function from a class body and you want to avoid the automatic transformation to instance method. For these cases, use this idiom::
fr: Comme pour tous les décorateurs, il est possible d'appeler ``staticmethod`` comme une simple fonction, et faire quelque chose de son résultat. Ça peut être nécessaire dans le cas où vous voudriez une référence à la fonction depuis le corps d'une classe, et souhaiteriez éviter sa transformation en méthode d'instance. Pour ces cas, faites comme suit ::

source: For more information on static methods, see :ref:`types`.
fr: Pour plus d'informations sur les méthodes statiques, consultez :ref:`types`.

source: Return a :class:`str` version of *object*. See :func:`str` for details.
fr: Renvoie une version d'*object* sous forme de :class:`str`. Voir :func:`str` pour plus de détails.

source: ``str`` is the built-in string :term:`class`. For general information about strings, see :ref:`textseq`.
fr: ``str`` est la :term:`classe <class>` native des chaînes de caractères. Pour des informations générales à propos des chaînes, consultez :ref:`textseq`.

source: Sums *start* and the items of an *iterable* from left to right and returns the total. The *iterable*'s items are normally numbers, and the start value is not allowed to be a string.
fr: Additionne *start* et les éléments d'un *iterable* de gauche à droite et en donne le total. Les éléments de l'*iterable* sont normalement des nombres, et la valeur de *start* ne peut pas être une chaîne de caractères.

source: For some use cases, there are good alternatives to :func:`sum`. The preferred, fast way to concatenate a sequence of strings is by calling ``''.join(sequence)``. To add floating point values with extended precision, see :func:`math.fsum`\. To concatenate a series of iterables, consider using :func:`itertools.chain`.
fr: Pour certains cas, il existe de bonnes alternatives à :func:`sum`. La bonne méthode, et rapide, de concaténer une séquence de chaînes est d'appeler ``''.join(séquence)``. Pour additionner des nombres à virgule flottante avec une meilleure précision, voir :func:`math.fsum`. Pour concaténer une série d'itérables, utilisez plutôt :func:`itertools.chain`.

source: The *start* parameter can be specified as a keyword argument.
fr: le paramètre *start* peut être passé comme un argument nommé.

source: Return a proxy object that delegates method calls to a parent or sibling class of *type*. This is useful for accessing inherited methods that have been overridden in a class.
fr: Renvoie un objet mandataire (*proxy object* en anglais) déléguant les appels de méthode à une classe parente ou sœur de *type*. C'est utile pour accéder aux méthodes héritées qui ont été remplacées dans une classe.

source: The *object-or-type* determines the :term:`method resolution order` to be searched. The search starts from the class right after the *type*.
fr: Le *object-or-type* détermine quel :term:`ordre de résolution des méthodes <method resolution order>` est utilisé pour la recherche. La recherche commence à partir de la classe qui suit immédiatement le *type*.

source: For example, if :attr:`~class.__mro__` of *object-or-type* is ``D -> B -> C -> A -> object`` and the value of *type* is ``B``, then :func:`super` searches ``C -> A -> object``.
fr: Par exemple, si :attr:`~class.__mro__` de *object-or-type* est ``D -> B -> C -> A -> object`` et la valeur de *type* est ``B``, alors :func:`super` recherche ``C -> A -> object``.

source: The :attr:`~class.__mro__` attribute of the *object-or-type* lists the method resolution search order used by both :func:`getattr` and :func:`super`. The attribute is dynamic and can change whenever the inheritance hierarchy is updated.
fr: L'attribut :attr:`~class.__mro__` de *object-or-type* liste l'ordre de recherche de la méthode de résolution utilisée par :func:`getattr` et :func:`super`. L'attribut est dynamique et peut changer lorsque la hiérarchie d'héritage est modifiée.

source: If the second argument is omitted, the super object returned is unbound. If the second argument is an object, ``isinstance(obj, type)`` must be true. If the second argument is a type, ``issubclass(type2, type)`` must be true (this is useful for classmethods).
fr: Si le second argument est omis, l'objet *super* obtenu n'est pas lié. Si le second argument est un objet, ``isinstance(obj, type)`` doit être vrai. Si le second argument est un type, ``issubclass(type2, type)`` doit être vrai (c'est utile pour les méthodes de classe).

source: There are two typical use cases for *super*. In a class hierarchy with single inheritance, *super* can be used to refer to parent classes without naming them explicitly, thus making the code more maintainable. This use closely parallels the use of *super* in other programming languages.
fr: Il existe deux autres cas d'usage typiques pour *super*. Dans une hiérarchie de classes à héritage simple, *super* peut être utilisé pour obtenir la classe parente sans avoir à la nommer explicitement, rendant le code plus maintenable. Cet usage se rapproche de l'usage de *super* dans d'autres langages de programmation.

source: For both use cases, a typical superclass call looks like this::
fr: Dans tous les cas, un appel typique à une classe parente ressemble à ::

source: In addition to method lookups, :func:`super` also works for attribute lookups. One possible use case for this is calling :term:`descriptors <descriptor>` in a parent or sibling class.
fr: En plus de la recherche de méthodes, :func:`super` fonctionne également pour la recherche d'attributs. Un cas d'utilisation possible est l'appel d'un :term:`descripteur <descriptor>` d'une classe parente ou sœur.

source: Note that :func:`super` is implemented as part of the binding process for explicit dotted attribute lookups such as ``super().__getitem__(name)``. It does so by implementing its own :meth:`__getattribute__` method for searching classes in a predictable order that supports cooperative multiple inheritance. Accordingly, :func:`super` is undefined for implicit lookups using statements or operators such as ``super()[name]``.
fr: Notez que :func:`super` fait partie de l'implémentation du processus de liaison de recherche d'attributs pointés explicitement comme ``super().__getitem__(name)``. Il le fait en implémentant sa propre méthode :meth:`__getattribute__` pour rechercher les classes dans un ordre prévisible supportant l'héritage multiple coopératif. En conséquence, :func:`super` n'est pas défini pour les recherches implicites via des instructions ou des opérateurs tels que ``super()[name]``.
