Repository: python/python-docs-fr
Catalog: library/functions.po
Languages: fr

source: Invoke the built-in help system. (This function is intended for interactive use.) If no argument is given, the interactive help system starts on the interpreter console. If the argument is a string, then the string is looked up as the name of a module, function, class, method, keyword, or documentation topic, and a help page is printed on the console. If the argument is any other kind of object, a help page on the object is generated.
fr: Invoque le système d'aide natif (cette fonction est destinée à l'usage en mode interactif). Si aucun argument n'est fourni, le système d'aide démarre dans l'interpréteur. Si l'argument est une chaîne, celle-ci est recherchée comme le nom d'un module, d'une fonction, d'une classe, d'une méthode, d'un mot clé, ou d'un sujet de documentation, et une page d'aide est affichée sur la console. Si l'argument est d'un autre type, une page d'aide sur cet objet est générée.

source: This function is added to the built-in namespace by the :mod:`site` module.
fr: Cette fonction est ajoutée à l'espace de nommage natif par le module :mod:`site`.

source: Changes to :mod:`pydoc` and :mod:`inspect` mean that the reported signatures for callables are now more comprehensive and consistent.
fr: les changements aux modules :mod:`pydoc` et :mod:`inspect` rendent les signatures des appelables plus compréhensibles et cohérentes.

source: Convert an integer number to a lowercase hexadecimal string prefixed with "0x". If *x* is not a Python :class:`int` object, it has to define an :meth:`__index__` method that returns an integer. Some examples:
fr: Convertit un entier en chaîne hexadécimale préfixée de ``0x``. Si *x* n'est pas un :class:`int`, il doit définir une méthode :meth:`__index__` qui renvoie un entier. Quelques exemples :

source: If you want to convert an integer number to an uppercase or lower hexadecimal string with prefix or not, you can use either of the following ways:
fr: Si vous voulez convertir un nombre entier en chaîne hexadécimale, en majuscule ou non, préfixée ou non, vous pouvez utiliser l'une des méthodes suivantes :

source: See also :func:`int` for converting a hexadecimal string to an integer using a base of 16.
fr: Voir aussi :func:`int` pour convertir une chaîne hexadécimale en un entier (en affectant 16 à l'argument *base*).

source: To obtain a hexadecimal string representation for a float, use the :meth:`float.hex` method.
fr: Pour obtenir une représentation hexadécimale sous forme de chaîne d'un nombre à virgule flottante, utilisez la méthode :meth:`float.hex`.

source: Return the "identity" of an object. This is an integer which is guaranteed to be unique and constant for this object during its lifetime. Two objects with non-overlapping lifetimes may have the same :func:`id` value.
fr: Renvoie l'« identité » d'un objet. C'est un nombre entier garanti unique et constant pour cet objet durant sa durée de vie. Deux objets dont les durées de vie ne se chevauchent pas peuvent partager le même :func:`id`.

source: This is the address of the object in memory.
fr: c'est l'adresse de l'objet en mémoire.

source: If the *prompt* argument is present, it is written to standard output without a trailing newline. The function then reads a line from input, converts it to a string (stripping a trailing newline), and returns that. When EOF is read, :exc:`EOFError` is raised. Example::
fr: Si l'argument *prompt* est donné, il est écrit sur la sortie standard sans le retour à la ligne final. La fonction lit ensuite une ligne sur l'entrée standard et la convertit en chaîne (supprimant le retour à la ligne final) quelle renvoie. Lorsque EOF est lu, :exc:`EOFError` est levée. Exemple ::

source: If the :mod:`readline` module was loaded, then :func:`input` will use it to provide elaborate line editing and history features.
fr: Si le module :mod:`readline` est chargé, :func:`input` l'utilisera pour fournir des fonctionnalités d'édition et d'historique élaborées.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input`` with argument ``prompt``.
fr: Lève un :ref:`évènement d'audit <auditing>` ``builtins.input`` avec l'argument ``prompt``.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input`` with argument ``prompt`` before reading input
fr: Lève un :ref:`auditing event <auditing>` ``builtins.input`` avec l'argument ``prompt`` avant de lire l'entrée.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input/result`` with argument ``result``.
fr: Lève un :ref:`évènement d'audit <auditing>` ``builtins.input/result`` avec l'argument ``result``.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input/result`` with the result after successfully reading input.
fr: Lève un :ref:`événement d'audit <auditing>` ``builtins.input/result`` avec le résultat après avoir lu avec succès l'entrée.

source: Return an integer object constructed from a number or string *x*, or return ``0`` if no arguments are given. If *x* defines :meth:`__int__`, ``int(x)`` returns ``x.__int__()``. If *x* defines :meth:`__index__`, it returns ``x.__index__()``. If *x* defines :meth:`__trunc__`, it returns ``x.__trunc__()``. For floating point numbers, this truncates towards zero.
fr: Renvoie un entier construit depuis un nombre ou une chaîne *x*, ou ``0`` si aucun argument n'est fourni. Si *x* définit une méthode :meth:`__int__`, ``int(x)`` renvoie ``x.__int__()``. Si *x* définit :meth:`__index__`, ``int(x)`` renvoie ``x.__index__()`` Si *x* définit :meth:`__trunc__`, ``int(x)`` renvoie ``x.__trunc__()``. Les nombres à virgule flottante sont tronqués vers zéro.

source: A base-n integer string contains digits, each representing a value from 0 to n-1. The values 0--9 can be represented by any Unicode decimal digit. The values 10--35 can be represented by ``a`` to ``z`` (or ``A`` to ``Z``). The default *base* is 10. The allowed bases are 0 and 2--36. Base-2, -8, and -16 strings can be optionally prefixed with ``0b``/``0B``, ``0o``/``0O``, or ``0x``/``0X``, as with integer literals in code. For base 0, the string is interpreted in a similar way to an :ref:`integer literal in code <integers>`, in that the actual base is 2, 8, 10, or 16 as determined by the prefix. Base 0 also disallows leading zeros: ``int('010', 0)`` is not legal, while ``int('010')`` and ``int('010', 8)`` are.
fr: Une chaine représentant un entier en base *n* contient des chiffres, chacun représentant une valeur de 0 à n-1. Les valeurs 0 à 9 peuvent être représentées par n'importe lequel des chiffres décimaux Unicode. Les valeurs de 10 à 35 peuvent être représentées par ``a`` jusqu'à ``z`` (ou ``A`` à ``Z``). La *base* par défaut est 10. Les valeurs autorisées pour *base* sont 0 et 2 à 36. Les littéraux en base 2, 8, et 16 peuvent être préfixés avec ``0b``/``0B``, ``0o``/``0O``, ou ``0x``/``0X`` tout comme les littéraux dans le code. Fournir 0 comme *base* demande d'interpréter exactement comme un :ref:`entier littéral dans du code <integers>` Python, donc la base sera 2, 8, 10, ou 16 en fonction du préfixe. Indiquer 0 comme base interdit les zéros en tête, ainsi ``int('010', 0)`` n'est pas légal, alors que ``int('010')`` l'est tout comme ``int('010', 8)``.

source: The integer type is described in :ref:`typesnumeric`.
fr: Le type des entiers est décrit dans :ref:`typesnumeric`.

source: If *base* is not an instance of :class:`int` and the *base* object has a :meth:`base.__index__ <object.__index__>` method, that method is called to obtain an integer for the base. Previous versions used :meth:`base.__int__ <object.__int__>` instead of :meth:`base.__index__ <object.__index__>`.
fr: si *base* n'est pas une instance d':class:`int` et que *base* a une méthode :meth:`base.__index__ <object.__index__>`, cette méthode est appelée pour obtenir un entier pour cette base. Les versions précédentes utilisaient :meth:`base.__int__ <object.__int__>` au lieu de :meth:`base.__index__ <object.__index__>`.

source: Falls back to :meth:`__index__` if :meth:`__int__` is not defined.
fr: Revient à :meth:`__index__` si :meth:`__int__` n'est pas définie.

source: See also :ref:`typeiter`.
fr: Voir aussi :ref:`typeiter`.

source: One useful application of the second form of :func:`iter` is to build a block-reader. For example, reading fixed-width blocks from a binary database file until the end of file is reached::
fr: Une autre application utile de la deuxième forme de :func:`iter` est de construire un lecteur par blocs. Par exemple, lire des blocs de taille fixe d'une base de donnée binaire jusqu'à ce que la fin soit atteinte ::

source: Return the length (the number of items) of an object. The argument may be a sequence (such as a string, bytes, tuple, list, or range) or a collection (such as a dictionary, set, or frozen set).
fr: Renvoie la longueur (nombre d'éléments) d'un objet. L'argument peut être une séquence (telle qu'une chaîne de caractères ou d'octets, un *n*-uplet, une liste ou un intervalle) ou une collection (telle qu'un dictionnaire, un ensemble ou un ensemble figé).

source: Rather than being a function, :class:`list` is actually a mutable sequence type, as documented in :ref:`typesseq-list` and :ref:`typesseq`.
fr: Contrairement aux apparences, :class:`list` n'est pas une fonction mais un type séquentiel muable, comme décrit dans :ref:`typesseq-list` et :ref:`typesseq`.

source: Update and return a dictionary representing the current local symbol table. Free variables are returned by :func:`locals` when it is called in function blocks, but not in class blocks. Note that at the module level, :func:`locals` and :func:`globals` are the same dictionary.
fr: Met à jour et renvoie un dictionnaire représentant la table des symboles locaux. Les variables libres sont renvoyées par la fonction :func:`locals` lorsque celle-ci est appelée dans le corps d'une fonction, mais pas dans le corps d'une classe. Notez qu’au niveau d’un module, :func:`locals` et :func:`globals` sont le même dictionnaire.

source: The contents of this dictionary should not be modified; changes may not affect the values of local and free variables used by the interpreter.
fr: Le contenu de ce dictionnaire ne doit pas être modifié ; les changements n'affectent pas les valeurs des variables locales ou libres utilisées par l'interpréteur.

source: Return an iterator that applies *function* to every item of *iterable*, yielding the results. If additional *iterable* arguments are passed, *function* must take that many arguments and is applied to the items from all iterables in parallel. With multiple iterables, the iterator stops when the shortest iterable is exhausted. For cases where the function inputs are already arranged into argument tuples, see :func:`itertools.starmap`\.
fr: Renvoie un itérateur appliquant *function* à chaque élément de *iterable*, et donnant ses résultats au fur et à mesure avec ``yield``. Si d'autres *iterable* sont fournis, *function* doit prendre autant d'arguments, et sera appelée avec les éléments de tous les itérables en parallèle. Avec plusieurs itérables, l'itération s'arrête avec l'itérable le plus court. Pour les cas où les arguments sont déjà rangés sous forme de *n*-uplets, voir :func:`itertools.starmap`.

source: Return the largest item in an iterable or the largest of two or more arguments.
fr: Renvoie le plus grand élément d'un itérable, ou l'argument le plus grand parmi au moins deux arguments.

source: If one positional argument is provided, it should be an :term:`iterable`. The largest item in the iterable is returned. If two or more positional arguments are provided, the largest of the positional arguments is returned.
fr: Si un seul argument positionnel est fourni, il doit être :term:`itérable <iterable>`. Le plus grand élément de l'itérable est renvoyé. Si au moins deux arguments positionnels sont fournis, l'argument le plus grand sera renvoyé.

source: There are two optional keyword-only arguments. The *key* argument specifies a one-argument ordering function like that used for :meth:`list.sort`. The *default* argument specifies an object to return if the provided iterable is empty. If the iterable is empty and *default* is not provided, a :exc:`ValueError` is raised.
fr: Elle accepte deux arguments nommés optionnels. L'argument *key* spécifie une fonction à un argument permettant de trier comme pour :meth:`list.sort`. L'argument *default* fournit quant à lui un objet à donner si l'itérable fourni est vide. Si l'itérable est vide et que *default* n'est pas fourni, :exc:`ValueError` est levée.

source: If multiple items are maximal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc, reverse=True)[0]`` and ``heapq.nlargest(1, iterable, key=keyfunc)``.
fr: Si plusieurs éléments représentent la plus grande valeur, le premier rencontré est renvoyé. C'est cohérent avec d'autres outils préservant une stabilité lors du tri, tels que ``sorted(iterable, key=keyfunc, reverse=True)[0]`` et ``heapq.nlargest(1, iterable, key=keyfunc)``.

source: The *default* keyword-only argument.
fr: L'argument nommé (et seulement donné par son nom) *default*.

source: The *key* can be ``None``.
fr: l'argument *key* peut être ``None``.

source: Return a "memory view" object created from the given argument. See :ref:`typememoryview` for more information.
fr: Renvoie une « vue mémoire » (*memory view*) créée depuis l'argument. Voir :ref:`typememoryview` pour plus d'informations.

source: Return the smallest item in an iterable or the smallest of two or more arguments.
fr: Renvoie le plus petit élément d'un itérable ou le plus petit d'au moins deux arguments.

source: If one positional argument is provided, it should be an :term:`iterable`. The smallest item in the iterable is returned. If two or more positional arguments are provided, the smallest of the positional arguments is returned.
fr: Si un seul argument est fourni, il doit être :term:`itérable <iterable>`. Le plus petit élément de l'itérable est renvoyé. Si au moins deux arguments positionnels sont fournis, le plus petit argument positionnel est renvoyé.

source: If multiple items are minimal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc)[0]`` and ``heapq.nsmallest(1, iterable, key=keyfunc)``.
fr: Si plusieurs éléments sont minimaux, la fonction renvoie le premier rencontré. C'est cohérent avec d'autres outils préservant une stabilité lors du tri, tels que ``sorted(iterable, key=keyfunc)[0]`` et ``heapq.nsmallest(1, iterable, key=keyfunc)``.

source: :class:`object` does *not* have a :attr:`~object.__dict__`, so you can't assign arbitrary attributes to an instance of the :class:`object` class.
fr: :class:`object` n'a *pas* d'attribut :attr:`~object.__dict__`, vous ne pouvez donc pas assigner d'attributs arbitraires à une instance d':class:`object`.

source: Convert an integer number to an octal string prefixed with "0o". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`__index__` method that returns an integer. For example:
fr: Convertit un entier en sa représentation octale dans une chaîne préfixée de ``0o``. Le résultat est une expression Python valide. Si *x* n'est pas un objet :class:`int`, il doit définir une méthode :meth:`__index__` qui donne un entier, par exemple :

source: Open *file* and return a corresponding :term:`file object`. If the file cannot be opened, an :exc:`OSError` is raised. See :ref:`tut-files` for more examples of how to use this function.
fr: Ouvre *file* et donne un :term:`objet fichier <file object>` correspondant. Si le fichier ne peut pas être ouvert, une :exc:`OSError` est levée. Voir :ref:`tut-files` pour plus d'exemple d'utilisation de cette fonction.

source: Character
fr: Caractère

source: Meaning
fr: Signification

source: open for reading (default)
fr: ouvre en lecture (par défaut)

source: open for writing, truncating the file first
fr: ouvre en écriture, en effaçant le contenu du fichier

source: open for exclusive creation, failing if the file already exists
fr: ouvre pour une création exclusive, échouant si le fichier existe déjà

source: binary mode
fr: mode binaire

source: text mode (default)
fr: mode texte (par défaut)

source: open for updating (reading and writing)
fr: ouvre en modification (lecture et écriture)

source: As mentioned in the :ref:`io-overview`, Python distinguishes between binary and text I/O. Files opened in binary mode (including ``'b'`` in the *mode* argument) return contents as :class:`bytes` objects without any decoding. In text mode (the default, or when ``'t'`` is included in the *mode* argument), the contents of the file are returned as :class:`str`, the bytes having been first decoded using a platform-dependent encoding or using the specified *encoding* if given.
fr: Comme mentionné dans :ref:`io-overview`, Python fait la différence entre les entrées-sorties binaires et textes. Les fichiers ouverts en mode binaire (avec ``'b'`` dans *mode*) donnent leur contenu sous forme de :class:`bytes` sans décodage. En mode texte (par défaut, ou lorsque ``'t'`` est dans le *mode*), le contenu du fichier est donné sous forme de :class:`str`, les octets ayant été décodés au préalable en utilisant un encodage déduit de l'environnement ou *encoding* s'il est donné.

source: Python doesn't depend on the underlying operating system's notion of text files; all the processing is done by Python itself, and is therefore platform-independent.
fr: Python ne dépend pas de la représentation du fichier texte du système sous-jacent. Tout le traitement est effectué par Python lui-même, et est ainsi indépendant de la plate-forme.

source: Binary files are buffered in fixed-size chunks; the size of the buffer is chosen using a heuristic trying to determine the underlying device's "block size" and falling back on :attr:`io.DEFAULT_BUFFER_SIZE`. On many systems, the buffer will typically be 4096 or 8192 bytes long.
fr: Les fichiers binaires sont mis dans un tampon de taille fixe, dont la taille est choisie par une heuristique essayant de déterminer la taille des blocs du système sous-jacent, ou en utilisant par défaut :attr:`io.DEFAULT_BUFFER_SIZE`. Sur de nombreux systèmes, le tampon sera de 4096 ou 8192 octets.

source: "Interactive" text files (files for which :meth:`~io.IOBase.isatty` returns ``True``) use line buffering. Other text files use the policy described above for binary files.
fr: Les fichiers texte « interactifs » (fichiers pour lesquels :meth:`io.IOBase.isatty` renvoie ``True``) utilisent un tampon par lignes. Les autres fichiers texte sont traités comme les fichiers binaires.

source: *encoding* is the name of the encoding used to decode or encode the file. This should only be used in text mode. The default encoding is platform dependent (whatever :func:`locale.getpreferredencoding` returns), but any :term:`text encoding` supported by Python can be used. See the :mod:`codecs` module for the list of supported encodings.
fr: *encoding* est le nom de l'encodage utilisé pour encoder ou décoder le fichier. Il doit seulement être utilisé en mode texte. L'encodage par défaut dépend de la plateforme (ce que :func:`locale.getpreferredencoding` donne), mais n'importe quel :term:`encodage de texte <text encoding>` pris en charge par Python peut être utilisé. Voir :mod:`codecs` pour une liste des encodages pris en charge.

source: *errors* is an optional string that specifies how encoding and decoding errors are to be handled—this cannot be used in binary mode. A variety of standard error handlers are available (listed under :ref:`error-handlers`), though any error handling name that has been registered with :func:`codecs.register_error` is also valid. The standard names include:
fr: *errors* est une chaîne facultative spécifiant comment les erreurs d'encodage et de décodage sont gérées, ce n'est pas utilisable en mode binaire. De nombreux gestionnaires d'erreurs standards sont disponibles (listés sous :ref:`error-handlers`), aussi, tout nom de gestionnaire d'erreur enregistré avec :func:`codecs.register_error` est aussi un argument valide. Les noms standards sont :

source: ``'strict'`` to raise a :exc:`ValueError` exception if there is an encoding error. The default value of ``None`` has the same effect.
fr: ``'strict'`` pour lever une :exc:`ValueError` si une erreur d'encodage est rencontrée. La valeur par défaut, ``None``, a le même effet.

source: ``'ignore'`` ignores errors. Note that ignoring encoding errors can lead to data loss.
fr: ``'ignore'`` ignore les erreurs. Notez qu'ignorer les erreurs d'encodage peut mener à des pertes de données.

source: ``'replace'`` causes a replacement marker (such as ``'?'``) to be inserted where there is malformed data.
fr: ``'replace'`` insère un marqueur de substitution (tel que ``'?'``) en place des données mal formées.

source: ``'xmlcharrefreplace'`` is only supported when writing to a file. Characters not supported by the encoding are replaced with the appropriate XML character reference ``&#nnn;``.
fr: ``'xmlcharrefreplace'`` est seulement pris en charge à l'écriture vers un fichier. Les caractères non gérés par l'encodage sont remplacés par une entité XML de la forme ``&#nnn;``.

source: ``'backslashreplace'`` replaces malformed data by Python's backslashed escape sequences.
fr: ``'backslashreplace'`` remplace les données mal formées par des séquences d'échappement Python (utilisant des barres obliques inverses).

source: ``'namereplace'`` (also only supported when writing) replaces unsupported characters with ``\N{...}`` escape sequences.
fr: ``'namereplace'`` (aussi supporté lors de l'écriture) remplace les caractères non gérés par des séquences d'échappement ``\N{...}``.

source: When reading input from the stream, if *newline* is ``None``, universal newlines mode is enabled. Lines in the input can end in ``'\n'``, ``'\r'``, or ``'\r\n'``, and these are translated into ``'\n'`` before being returned to the caller. If it is ``''``, universal newlines mode is enabled, but line endings are returned to the caller untranslated. If it has any of the other legal values, input lines are only terminated by the given string, and the line ending is returned to the caller untranslated.
fr: Lors de la lecture, si *newline* est ``None``, le mode *universal newlines* est activé. Les lignes lues peuvent se terminer par ``'\n'``, ``'\r'``, ou ``'\r\n'``, et sont remplacées par ``'\n'``, avant d'être renvoyées à l'appelant. S'il vaut ``''``, le mode *universal newline* est activé mais les fins de ligne ne sont pas remplacées. S'il a n'importe quelle autre valeur autorisée, les lignes sont seulement terminées par la chaîne donnée, qui est rendue telle quelle.

source: When writing output to the stream, if *newline* is ``None``, any ``'\n'`` characters written are translated to the system default line separator, :data:`os.linesep`. If *newline* is ``''`` or ``'\n'``, no translation takes place. If *newline* is any of the other legal values, any ``'\n'`` characters written are translated to the given string.
fr: Lors de l'écriture, si *newline* est ``None``, chaque ``'\n'`` est remplacé par le séparateur de lignes par défaut du système :data:`os.linesep`. Si *newline* est ``''`` ou ``'\n'`` aucun remplacement n'est effectué. Si *newline* est un autre caractère valide, chaque ``'\n'`` sera remplacé par la chaîne donnée.
