Repository: python/python-docs-fr
Catalog: library/gc.po
Languages: fr

source: This module provides an interface to the optional garbage collector. It provides the ability to disable the collector, tune the collection frequency, and set debugging options. It also provides access to unreachable objects that the collector found but cannot free. Since the collector supplements the reference counting already used in Python, you can disable the collector if you are sure your program does not create reference cycles. Automatic collection can be disabled by calling ``gc.disable()``. To debug a leaking program call ``gc.set_debug(gc.DEBUG_LEAK)``. Notice that this includes ``gc.DEBUG_SAVEALL``, causing garbage-collected objects to be saved in gc.garbage for inspection.
fr: Ce module constitue une interface au ramasse-miettes facultatif. Il permet de désactiver le ramasse-miettes ou de régler la fréquence des passages. Il fournit des options de débogage, et donne aussi accès aux objets qui ne peuvent pas être détruits bien qu'ils aient été détectés comme non référencés. Le ramasse-miettes vient en complément du système de comptage de références, et peut donc être désactivé pour du code qui ne crée aucun cycle de références. On le désactive avec ``gc.disable()``. Pour remonter à la source d'une fuite de mémoire, utilisez ``gc.set_debug(gc.DEBUG_LEAK)``. Notez que ``gc.DEBUG_LEAK`` inclut ``gc.DEBUG_SAVEALL``. Cette dernière option fait que les objets inatteignables, au lieu d'être détruits, sont placés dans la liste ``gc.garbage`` pour pouvoir y être examinés.

source: The :mod:`gc` module provides the following functions:
fr: Le module :mod:`gc` contient les fonctions suivantes :

source: Enable automatic garbage collection.
fr: Active le ramasse-miettes.

source: Disable automatic garbage collection.
fr: Désactive le ramasse-miettes.

source: Return ``True`` if automatic collection is enabled.
fr: Renvoie ``True`` ou ``False`` selon que le ramasse-miettes est activé ou non.

source: With no arguments, run a full collection. The optional argument *generation* may be an integer specifying which generation to collect (from 0 to 2). A :exc:`ValueError` is raised if the generation number is invalid. The number of unreachable objects found is returned.
fr: Déclenche un passage du ramasse-miettes. En l'absence d'argument, un passage complet est effectué. Le paramètre *generation* permet de le limiter à une génération entre 0 et 2. Une exception :exc:`ValueError` est levée si le numéro de la génération n'est pas valide. Cette fonction renvoie le nombre d'objets inatteignables qui ont été détectés.

source: Set the garbage collection debugging flags. Debugging information will be written to ``sys.stderr``. See below for a list of debugging flags which can be combined using bit operations to control debugging.
fr: Change les options de débogage du ramasse-miettes, qui activent l'écriture d'informations sur ``sys.stderr``. Une liste d'options se trouve plus bas. Les options peuvent se combiner par les opérateurs bit à bit.

source: Return the debugging flags currently set.
fr: Renvoie les options de débogage actives.

source: New *generation* parameter.
fr: ajout du paramètre *generation*.

source: Raises an :ref:`auditing event <auditing>` ``gc.get_objects`` with argument ``generation``.
fr: Lève un :ref:`événement d'audit <auditing>` ``gc.get_objects`` avec l'argument ``generation``.

source: Return a list of three per-generation dictionaries containing collection statistics since interpreter start. The number of keys may change in the future, but currently each dictionary will contain the following items:
fr: Renvoie une liste de trois dictionnaires, un par génération. Ils contiennent des statistiques sur l'action du ramasse-miettes depuis le lancement de l'interpréteur. Les clés actuellement présentes sont les suivantes (d'autres pourraient être ajoutées dans des versions ultérieures) :

source: ``collections`` is the number of times this generation was collected;
fr: ``collections``, le nombre de fois où cette génération a été examinée par le ramasse-miettes ;

source: ``collected`` is the total number of objects collected inside this generation;
fr: ``collected``, le nombre total d'objets qui ont été détruits alors qu'ils étaient dans cette génération ;

source: ``uncollectable`` is the total number of objects which were found to be uncollectable (and were therefore moved to the :data:`garbage` list) inside this generation.
fr: ``uncollectable``, le nombre total d'objets qui ont été identifiés comme indestructibles (et donc ajoutés à la liste :data:`garbage`) au sein de cette génération.

source: Set the garbage collection thresholds (the collection frequency). Setting *threshold0* to zero disables collection.
fr: Règle les seuils de déclenchement du ramasse-miettes, qui déterminent sa fréquence de passage. Si *threshold0* est mis à zéro, le ramasse-miettes ne passe jamais.

source: The GC classifies objects into three generations depending on how many collection sweeps they have survived. New objects are placed in the youngest generation (generation ``0``). If an object survives a collection it is moved into the next older generation. Since generation ``2`` is the oldest generation, objects in that generation remain there after a collection. In order to decide when to run, the collector keeps track of the number object allocations and deallocations since the last collection. When the number of allocations minus the number of deallocations exceeds *threshold0*, collection starts. Initially only generation ``0`` is examined. If generation ``0`` has been examined more than *threshold1* times since generation ``1`` has been examined, then generation ``1`` is examined as well. With the third generation, things are a bit more complicated, see `Collecting the oldest generation <https://devguide.python.org/garbage_collector/#collecting-the-oldest-generation>`_ for more information.
fr: Les objets sont répartis en trois générations en fonction du nombre de passages du ramasse-miettes qui les ont laissés intacts. Les objets fraîchement créés sont placés dans la génération la plus jeune, numéro 0. À chaque fois qu'un objet persiste à la suite d'un passage du ramasse-miettes, il monte d'une génération, ceci jusqu'à la génération 2, la plus âgée. Le ramasse-miettes se déclenche en fonction du nombre d'allocations et de destructions depuis le passage précédent : lorsque les allocations moins les destructions font plus que *threshold0*, un passage est initié. Lors des premiers passages, seule la génération 0 est inspectée. La génération 1 est examinée périodiquement, lorsque le nombre de passages sur la génération 0 depuis le dernier passage ayant aussi examiné la génération 1 vient à excéder *threshold1*. Les règles pour la génération 2 sont plus complexes. Pour avoir des détails, voir `Collecting the oldest generation <https://devguide.python.org/garbage_collector/#collecting-the-oldest-generation>`_ (dans le guide du développeur, en anglais).

source: Return the current collection counts as a tuple of ``(count0, count1, count2)``.
fr: Renvoie un triplet des nombres totaux de passages effectués par génération.

source: Return the current collection thresholds as a tuple of ``(threshold0, threshold1, threshold2)``.
fr: Renvoie les seuils de passage sous la forme du triplet ``(threshold0, threshold1, threshold2)``.

source: Return the list of objects that directly refer to any of objs. This function will only locate those containers which support garbage collection; extension types which do refer to other objects but do not support garbage collection will not be found.
fr: Renvoie la liste des objets qui contiennent directement une référence à l'un quelconque des arguments. Il est à noter que cette fonction prend uniquement en compte les objets suivis par le ramasse-miettes, ce qui exclut les instances de certains types d'extension qui contiennent bien des références sans pour autant prendre en charge le ramassage des miettes.

source: Note that objects which have already been dereferenced, but which live in cycles and have not yet been collected by the garbage collector can be listed among the resulting referrers. To get only currently live objects, call :func:`collect` before calling :func:`get_referrers`.
fr: La liste renvoyée peut contenir des objets déjà isolés, mais maintenus en mémoire à cause d'un cycle. Pour les exclure, appelez :func:`collect` juste avant :func:`get_referrers`.

source: Care must be taken when using objects returned by :func:`get_referrers` because some of them could still be under construction and hence in a temporarily invalid state. Avoid using :func:`get_referrers` for any purpose other than debugging.
fr: La manipulation des objets renvoyés par :func:`get_referrers` est hasardeuse car ils risquent d'être encore en cours d'initialisation, donc dans un état temporairement instable. Mieux vaut réserver :func:`get_referrers` au débogage.

source: Raises an :ref:`auditing event <auditing>` ``gc.get_referrers`` with argument ``objs``.
fr: Lève un :ref:`événement d'audit <auditing>` ``gc.get_referrers`` avec l'argument ``objs``.

source: Return a list of objects directly referred to by any of the arguments. The referents returned are those objects visited by the arguments' C-level :c:member:`~PyTypeObject.tp_traverse` methods (if any), and may not be all objects actually directly reachable. :c:member:`~PyTypeObject.tp_traverse` methods are supported only by objects that support garbage collection, and are only required to visit objects that may be involved in a cycle. So, for example, if an integer is directly reachable from an argument, that integer object may or may not appear in the result list.
fr: Renvoie une liste des objets pointés par les références que contiennent les arguments. Ils sont déterminés en appelant, si présente, la méthode C :c:member:`~PyTypeObject.tp_traverse` de chaque argument, qui visite les objets auxquels cet argument fait référence. Il est à noter que :c:member:`~PyTypeObject.tp_traverse` n'est définie que par les objets qui gèrent le ramassage des miettes, et n'a l'obligation de visiter que les objets qui peuvent potentiellement faire partie d'un cycle. Ainsi, la liste renvoyée par cette fonction ne contient par forcément tous les objets qu'il est possible d'atteindre à partir des arguments. Par exemple, si l'un des arguments contient un entier, ce dernier objet peut être présent ou non dans la liste.

source: Raises an :ref:`auditing event <auditing>` ``gc.get_referents`` with argument ``objs``.
fr: Lève un :ref:`événement d'audit <auditing>` ``gc.get_referents`` avec l'argument ``objs``.

source: Returns ``True`` if the object is currently tracked by the garbage collector, ``False`` otherwise. As a general rule, instances of atomic types aren't tracked and instances of non-atomic types (containers, user-defined objects...) are. However, some type-specific optimizations can be present in order to suppress the garbage collector footprint of simple instances (e.g. dicts containing only atomic keys and values)::
fr: Renvoie ``True`` ou ``False`` selon que l'argument est suivi ou non par le ramasse-miettes. En règle générale, les objets atomiques ne sont pas suivis, tandis que les objets non-atomiques, tels que les conteneurs et instances de classes définies par l'utilisateur, le sont. Cependant, certains types présentent des optimisations qui permettent de se passer avantageusement du ramasse-miettes dans les cas simples, comme les dictionnaires dont toutes les clés et valeurs sont atomiques ::

source: Returns ``True`` if the given object has been finalized by the garbage collector, ``False`` otherwise. ::
fr: Renvoie ``True`` ou ``False`` selon que l'argument a été finalisé par le ramasse-miettes. ::

source: The following variables are provided for read-only access (you can mutate the values but should not rebind them):
fr: Les variables suivantes sont publiques, mais elles ne sont pas censées être modifiées (vous pouvez les muter, mais pas les redéfinir) :

source: A list of objects which the collector found to be unreachable but could not be freed (uncollectable objects). Starting with Python 3.4, this list should be empty most of the time, except when using instances of C extension types with a non-``NULL`` ``tp_del`` slot.
fr: Liste des objets indestructibles, que le ramasse-miettes n'a pas pu éliminer bien qu'ils soient inatteignables. Depuis Python 3.4, cette liste demeure la plupart du temps vide. Elle peut se remplir si le programme fait appel à des types d'extension définis en C avec un champ ``tp_del`` différent de ``NULL``.

source: If :const:`DEBUG_SAVEALL` is set, then all unreachable objects will be added to this list rather than freed.
fr: Si :const:`DEBUG_SAVEALL` est actif, tous les objets inatteignables sont ajoutés à cette liste au lieu d'être détruits.

source: If this list is non-empty at :term:`interpreter shutdown`, a :exc:`ResourceWarning` is emitted, which is silent by default. If :const:`DEBUG_UNCOLLECTABLE` is set, in addition all uncollectable objects are printed.
fr: Si cette liste n'est pas vide lors de l':term:`arrêt de l'interpréteur <interpreter shutdown>`, un :exc:`ResourceWarning` est émis (les avertissements de ce type sont silencieux par défaut). De plus, si :const:`DEBUG_UNCOLLECTABLE` est actif, tous les objets indestructibles sont affichés.

source: A list of callbacks that will be invoked by the garbage collector before and after collection. The callbacks will be called with two arguments, *phase* and *info*.
fr: Liste de fonctions de rappel lancées par le ramasse-miettes avant et après un passage. Elles prennent deux arguments, *phase* et *info*.

source: *phase* can be one of two values:
fr: *phase* peut prendre deux valeurs :

source: "start": The garbage collection is about to start.
fr: ``"start"`` lorsque le passage du ramasse-miettes est imminent.

source: "stop": The garbage collection has finished.
fr: ``"stop"`` lorsque le passage du ramasse-miettes vient de se terminer.

source: *info* is a dict providing more information for the callback. The following keys are currently defined:
fr: *info* est un dictionnaire qui donne plus d'informations à la fonction de rappel. Les clés suivantes sont actuellement présentes :

source: "generation": The oldest generation being collected.
fr: ``"generation"``, la génération la plus âgée intégrée à ce passage ;

source: "collected": When *phase* is "stop", the number of objects successfully collected.
fr: ``"collected"`` : si *phase* vaut ``"stop"``, le nombre d'objets détruits avec succès ;

source: "uncollectable": When *phase* is "stop", the number of objects that could not be collected and were put in :data:`garbage`.
fr: ``"uncollectable"`` : si *phase* vaut ``"stop"``, le nombre d'objets indestructibles ajoutés à :data:`garbage`.

source: Applications can add their own callbacks to this list. The primary use cases are:
fr: Toute application peut ajouter ses propres fonctions de rappel à cette liste. Voici les principales applications :

source: Gathering statistics about garbage collection, such as how often various generations are collected, and how long the collection takes.
fr: Faire des statistiques sur le passage du ramasse-miettes, par exemple la fréquence à laquelle chaque génération est examinée, ou bien le temps d'un passage ;

source: Allowing applications to identify and clear their own uncollectable types when they appear in :data:`garbage`.
fr: Identifier les types définis par une application dont les instances s'ajoutent à :data:`garbage` car elles sont indestructibles.

source: The following constants are provided for use with :func:`set_debug`:
fr: Les constantes suivantes définissent les options de débogage que l'on peut passer à :func:`set_debug` :

source: Print statistics during collection. This information can be useful when tuning the collection frequency.
fr: Affiche des statistiques durant les passages du ramasse-miettes. Utile pour pouvoir régler la fréquence des passages.

source: Print information on collectable objects found.
fr: Affiche des informations sur les objets détruits.

source: Print information of uncollectable objects found (objects which are not reachable but cannot be freed by the collector). These objects will be added to the ``garbage`` list.
fr: Affiche des informations sur les objets indestructibles (ceux qui sont ajoutés à la liste ``garbage``, qui sont inatteignables mais dont la mémoire ne peut pas être libérée).

source: Also print the contents of the :data:`garbage` list at :term:`interpreter shutdown`, if it isn't empty.
fr: Affiche également le contenu de :data:`garbage` à l':term:`arrêt de l'interpréteur <interpreter shutdown>`, pour peu que cette liste ne soit pas vide.

source: When set, all unreachable objects found will be appended to *garbage* rather than being freed. This can be useful for debugging a leaking program.
fr: Lorsque cette option est active, les objets inatteignables sont ajoutés à la liste *garbage* au lieu d'être supprimés. Ceci est utile pour déboguer une fuite de mémoire.

source: The debugging flags necessary for the collector to print information about a leaking program (equal to ``DEBUG_COLLECTABLE | DEBUG_UNCOLLECTABLE | DEBUG_SAVEALL``).
fr: Combinaison des options utiles au débogage d'une fuite de mémoire. Il s'agit d'un raccourci pour ``DEBUG_COLLECTABLE|DEBUG_UNCOLLECTABLE|DEBUG_SAVEALL``.
