Repository: python/python-docs-fr
Catalog: library/gettext.po
Languages: fr

source: The :mod:`gettext` module provides one additional class derived from :class:`NullTranslations`: :class:`GNUTranslations`. This class overrides :meth:`_parse` to enable reading GNU :program:`gettext` format :file:`.mo` files in both big-endian and little-endian format.
fr: Le module :mod:`gettext` fournit une classe supplémentaire qui hérite de :class:`NullTranslations` : :class:`GNUTranslations`. Cette classe surcharge :meth:`_parse` pour permettre de lire les fichiers GNU :program:`gettext` :file:`.mo` au format petit et gros-boutiste.

source: :class:`GNUTranslations` parses optional metadata out of the translation catalog. It is convention with GNU :program:`gettext` to include metadata as the translation for the empty string. This metadata is in :rfc:`822`\ -style ``key: value`` pairs, and should contain the ``Project-Id-Version`` key. If the key ``Content-Type`` is found, then the ``charset`` property is used to initialize the "protected" :attr:`_charset` instance variable, defaulting to ``None`` if not found. If the charset encoding is specified, then all message ids and message strings read from the catalog are converted to Unicode using this encoding, else ASCII is assumed.
fr: :class:`GNUTranslations` analyse les métadonnées optionnelles du catalogue de traduction. Il est d'usage avec GNU :program:`gettext` d'utiliser une métadonnée pour traduire la chaîne vide. Cette métadonnée est un ensemble de paires de la forme ``clef: valeur`` comme définie par la :rfc:`822`, et doit contenir la clef ``Project-Id-Version``. Si la clef ``Content-Type`` est trouvée dans une métadonnée, alors la propriété ``charset`` (jeu de caractères) est utilisée pour initialiser la variable d'instance "protégée" :attr:`_charset`, sinon cette dernière est positionnée à ``None``. Si l'encodage du jeu de caractères est spécifié, tous les messages (identifiants et chaînes de caractères) lus depuis le catalogue sont convertis en chaînes Unicode via cet encodage, ou via l'encodage ASCII si non renseigné.

source: Since message ids are read as Unicode strings too, all :meth:`*gettext` methods will assume message ids as Unicode strings, not byte strings.
fr: Et puisque les identifiants des messages sont également lus comme des chaînes Unicode, toutes les méthodes :meth:`*gettext` les considéreront ainsi, et pas comme des chaînes d'octets.

source: The entire set of key/value pairs are placed into a dictionary and set as the "protected" :attr:`_info` instance variable.
fr: La totalité des paires clef / valeur est insérée dans un dictionnaire et représente la variable d'instance "protégée" :attr:`_info`.

source: If the :file:`.mo` file's magic number is invalid, the major version number is unexpected, or if other problems occur while reading the file, instantiating a :class:`GNUTranslations` class can raise :exc:`OSError`.
fr: Si le nombre magique du fichier :file:`.mo` est invalide, le numéro de la version majeure inattendu, ou si d'autres problèmes apparaissent durant la lecture du fichier, instancier une classe :class:`GNUTranslations` peut lever une exception :exc:`OSError`.

source: The following methods are overridden from the base class implementation:
fr: Les méthodes suivantes, provenant de l'implémentation de la classe de base, ont été surchargée :

source: Look up the *message* id in the catalog and return the corresponding message string, as a Unicode string. If there is no entry in the catalog for the *message* id, and a fallback has been set, the look up is forwarded to the fallback's :meth:`~NullTranslations.gettext` method. Otherwise, the *message* id is returned.
fr: Recherche l'identifiant de *message* dans le catalogue et renvoie le message de la chaîne de caractères correspondante comme une chaîne Unicode. Si aucun identifiant n'a été trouvé pour *message* et qu'un substitut a été défini, la recherche est transmise à la méthode :meth:`~NullTranslations.gettext` du substitut. Sinon, l'identifiant de *message* est renvoyé.

source: Do a plural-forms lookup of a message id. *singular* is used as the message id for purposes of lookup in the catalog, while *n* is used to determine which plural form to use. The returned message string is a Unicode string.
fr: Effectue une recherche sur les formes plurielles de l'identifiant d'un message. *singular* est utilisé pour la recherche de l'identifiant dans le catalogue, alors que *n* permet de savoir quelle forme plurielle utiliser. La chaîne de caractère du message renvoyée est une chaîne Unicode.

source: If the message id is not found in the catalog, and a fallback is specified, the request is forwarded to the fallback's :meth:`~NullTranslations.ngettext` method. Otherwise, when *n* is 1 *singular* is returned, and *plural* is returned in all other cases.
fr: Si l'identifiant du message n'est pas trouvé dans le catalogue et qu'un substitut a été spécifié, la requête est transmise à la méthode :meth:`~NullTranslations.ngettext` du substitut. Sinon, est renvoyé *singular* lorsque *n* vaut 1, *plural* dans tous les autres cas.

source: Here is an example::
fr: Voici un exemple ::

source: Look up the *context* and *message* id in the catalog and return the corresponding message string, as a Unicode string. If there is no entry in the catalog for the *message* id and *context*, and a fallback has been set, the look up is forwarded to the fallback's :meth:`pgettext` method. Otherwise, the *message* id is returned.
fr: Recherche le *contexte* et l'identifiant de *message* dans le catalogue et renvoie le message de la chaîne de caractères correspondante comme une chaîne Unicode. Si aucun identifiant n'a été trouvé pour l'identifiant du *message* et du *context* et qu'un substitut a été défini, la recherche est transmise à la méthode :meth:`pgettext` du substitut. Sinon, l'identifiant de *message* est renvoyé.

source: Do a plural-forms lookup of a message id. *singular* is used as the message id for purposes of lookup in the catalog, while *n* is used to determine which plural form to use.
fr: Effectue une recherche sur les formes plurielles de l'identifiant d'un message. *singular* est utilisé pour la recherche de l'identifiant dans le catalogue, alors que *n* permet de savoir quelle forme plurielle utiliser.

source: If the message id for *context* is not found in the catalog, and a fallback is specified, the request is forwarded to the fallback's :meth:`npgettext` method. Otherwise, when *n* is 1 *singular* is returned, and *plural* is returned in all other cases.
fr: Si l'identifiant du message pour le *context* n'est pas trouvé dans le catalogue et qu'un substitut a été spécifié, la requête est transmise à la méthode :meth:`npgettext` du substitut. Sinon, est renvoyé *singular* lorsque *n* vaut 1, *plural* dans tous les autres cas.

source: Equivalent to :meth:`.gettext` and :meth:`.ngettext`, but the translation is returned as a byte string encoded in the preferred system encoding if no encoding was explicitly set with :meth:`~NullTranslations.set_output_charset`.
fr: Équivalent de :meth:`.gettext` et :meth:`.ngettext`, mais la traduction est renvoyée sous la forme d'une chaîne d'octets, encodée avec l'encodage du système si aucun autre n'a été défini avec :meth:`~NullTranslations.set_output_charset`.

source: Solaris message catalog support
fr: Support du catalogue de message de Solaris

source: The Solaris operating system defines its own binary :file:`.mo` file format, but since no documentation can be found on this format, it is not supported at this time.
fr: Le système d'exploitation Solaris possède son propre format de fichier binaire :file:`.mo`, mais pour l'heure, puisqu'on ne peut trouver de documentation sur ce format, il n'est pas géré.

source: The Catalog constructor
fr: Le constructeur *Catalog*

source: GNOME uses a version of the :mod:`gettext` module by James Henstridge, but this version has a slightly different API. Its documented usage was::
fr: GNOME utilise une version du module :mod:`gettext` de James Henstridge, mais qui a une API légèrement différente. D'après la documentation, elle s'utilise ainsi ::

source: For compatibility with this older module, the function :func:`Catalog` is an alias for the :func:`translation` function described above.
fr: Pour des raisons de compatibilité avec cet ancien module, la fonction :func:`Catalog` est un alias de la fonction :func:`translation` décrite ci-dessous.

source: One difference between this module and Henstridge's: his catalog objects supported access through a mapping API, but this appears to be unused and so is not currently supported.
fr: Une différence entre ce module et celui de Henstridge : les objets de son catalogue étaient accessibles depuis un schéma de l'API, mais cela semblait ne pas être utilisé et donc n'est pas pris en charge.

source: Internationalizing your programs and modules
fr: Internationaliser vos programmes et modules

source: Internationalization (I18N) refers to the operation by which a program is made aware of multiple languages. Localization (L10N) refers to the adaptation of your program, once internationalized, to the local language and cultural habits. In order to provide multilingual messages for your Python programs, you need to take the following steps:
fr: L'internationalisation (*I18N*) consiste à permettre à un programme de recevoir des traductions dans plusieurs langues. La localisation (*L10N*) consiste à adapter un programme à la langue et aux habitudes culturelles locales, une fois celui-ci internationalisé. Afin de fournir du texte multilingue à votre programme Python, les étapes suivantes sont nécessaires :

source: prepare your program or module by specially marking translatable strings
fr: préparer votre programme ou module en marquant spécifiquement les chaînes à traduire

source: run a suite of tools over your marked files to generate raw messages catalogs
fr: lancer une suite d'outils sur les fichiers contenant des chaînes à traduire pour générer des catalogues de messages brut

source: create language-specific translations of the message catalogs
fr: créer les traductions spécifiques à une langue des catalogues de messages

source: use the :mod:`gettext` module so that message strings are properly translated
fr: utiliser le module :mod:`gettext` pour que les chaînes de caractères soient bien traduites

source: In order to prepare your code for I18N, you need to look at all the strings in your files. Any string that needs to be translated should be marked by wrapping it in ``_('...')`` --- that is, a call to the function :func:`_`. For example::
fr: Afin de préparer votre code à être traduit (*I18N*), vous devrez rechercher toutes les chaînes de caractères de vos fichiers. À chaque chaîne de caractères à traduire doit être appliqué le marqueur ``_('...')`` --- c'est-à-dire en appelant la fonction :func:`_`. Par exemple ::

source: In this example, the string ``'writing a log message'`` is marked as a candidate for translation, while the strings ``'mylog.txt'`` and ``'w'`` are not.
fr: Dans cet exemple, la chaîne ``'writing a log message'`` est maquée comme traduite, contrairement aux chaînes ``'mylog.txt'`` et ``'w'``.

source: There are a few tools to extract the strings meant for translation. The original GNU :program:`gettext` only supported C or C++ source code but its extended version :program:`xgettext` scans code written in a number of languages, including Python, to find strings marked as translatable. `Babel <http://babel.pocoo.org/>`__ is a Python internationalization library that includes a :file:`pybabel` script to extract and compile message catalogs. François Pinard's program called :program:`xpot` does a similar job and is available as part of his `po-utils package <https://github.com/pinard/po-utils>`__.
fr: Il existe quelques outils pour extraire les chaînes de caractères destinées à la traduction. Le programme d'origine GNU :program:`gettext` ne prenait en charge que les codes sources en C ou C++, mais sa version étendue :program:`xgettext` peut lire du code écrit dans de nombreux langages, dont le Python, afin de trouver les chaînes notées comme traduisibles. `Babel <http://babel.pocoo.org/>`__ est une bibliothèque en Python d'internationalisation, qui inclut un script :file:`pybabel` permettant d'extraire et de compiler des catalogues de messages. Le programme de François Pinard, nommé :program:`xpot`, fait de même et est disponible dans son `paquet po-utils <https://github.com/pinard/po-utils>`__.

source: (Python also includes pure-Python versions of these programs, called :program:`pygettext.py` and :program:`msgfmt.py`; some Python distributions will install them for you. :program:`pygettext.py` is similar to :program:`xgettext`, but only understands Python source code and cannot handle other programming languages such as C or C++. :program:`pygettext.py` supports a command-line interface similar to :program:`xgettext`; for details on its use, run ``pygettext.py --help``. :program:`msgfmt.py` is binary compatible with GNU :program:`msgfmt`. With these two programs, you may not need the GNU :program:`gettext` package to internationalize your Python applications.)
fr: (Python inclut également des versions en Python de ces programmes, :program:`pygettext.py` et :program:`msgfmt.py`, que certaines distributions Python installeront pour vous. :program:`pygettext.py` est similaire à :program:`xgettext`, mais ne comprend que le code source écrit en Python et ne peut prendre en charge d'autres langages de programmation tels que le C ou C++. :program:`pygettext.py` possède une interface en ligne de commande similaire à celle de :program:`xgettext` --- pour plus de détails sur son utilisation, exécuter ``pygettext.py --help``. :program:`msgfmt.py` est compatible avec GNU :program:`msgfmt`. Avec ces deux programmes, vous ne devriez pas avoir besoin du paquet GNU :program:`gettext` pour internationaliser vos applications en Python.)

source: :program:`xgettext`, :program:`pygettext`, and similar tools generate :file:`.po` files that are message catalogs. They are structured human-readable files that contain every marked string in the source code, along with a placeholder for the translated versions of these strings.
fr: :program:`xgettext`, :program:`pygettext` et d'autres outils similaires génèrent des fichiers :file:`.po` représentant les catalogues de messages. Il s'agit de fichiers structurés et lisibles par un être humain, qui contiennent toutes les chaînes du code source marquées comme traduisible, ainsi que leur traduction à utiliser.

source: Copies of these :file:`.po` files are then handed over to the individual human translators who write translations for every supported natural language. They send back the completed language-specific versions as a :file:`<language-name>.po` file that's compiled into a machine-readable :file:`.mo` binary catalog file using the :program:`msgfmt` program. The :file:`.mo` files are used by the :mod:`gettext` module for the actual translation processing at run-time.
fr: Les copies de ces fichiers :file:`.po` sont ensuite remises à des êtres humains qui traduisent le contenu pour chaque langue naturelle prise en charge. Pour chacune des langues, ces derniers renvoient la version complétée sous la forme d'un fichier :file:`<code-langue>.po` qui a été compilé dans un fichier binaire :file:`.mo` représentant le catalogue lisible par une machine à l'aide du programme :program:`msgfmt`. Les fichiers :file:`.mo` sont utilisés par le module :mod:`gettext` pour la traduction lors de l'exécution.

source: How you use the :mod:`gettext` module in your code depends on whether you are internationalizing a single module or your entire application. The next two sections will discuss each case.
fr: La façon dont vous utilisez le module :mod:`gettext` dans votre code dépend de si vous internationalisez un seul module ou l'ensemble de votre application. Les deux sections suivantes traitent chacune des cas.

source: Localizing your module
fr: Localiser votre module

source: If you are localizing your module, you must take care not to make global changes, e.g. to the built-in namespace. You should not use the GNU :program:`gettext` API but instead the class-based API.
fr: Si vous localisez votre module, veillez à ne pas faire de changements globaux, e.g. dans l'espace de nommage natif. Vous ne devriez pas utiliser l’API GNU :program:`gettext` mais plutôt celle basée sur les classes.

source: Let's say your module is called "spam" and the module's various natural language translation :file:`.mo` files reside in :file:`/usr/share/locale` in GNU :program:`gettext` format. Here's what you would put at the top of your module::
fr: Disons que votre module s'appelle "spam" et que les fichiers :file:`.mo` de traduction dans les différentes langues naturelles soient dans :file:`/usr/share/locale` au format GNU :program:`gettext`. Voici ce que vous pouvez alors mettre en haut de votre module ::

source: Localizing your application
fr: Localiser votre application

source: If you are localizing your application, you can install the :func:`_` function globally into the built-in namespace, usually in the main driver file of your application. This will let all your application-specific files just use ``_('...')`` without having to explicitly install it in each file.
fr: Si vous localisez votre application, vous pouvez positionner la fonction :func:`_` de manière globale dans l'espace de nommage natif, généralement dans le fichier principal de votre application. Cela permettra à tous les fichiers de votre application de n'utiliser que ``_('...')`` sans devoir le redéfinir explicitement dans chaque fichier.

source: In the simple case then, you need only add the following bit of code to the main driver file of your application::
fr: Dans ce cas, vous n'aurez à ajouter que le bout de code suivant au fichier principal de votre application ::

source: If you need to set the locale directory, you can pass it into the :func:`install` function::
fr: Si vous avez besoin de définir le dossier des localisations, vous pouvez le mettre en argument de la fonction :func:`install` ::

source: Changing languages on the fly
fr: Changer de langue à la volée

source: If your program needs to support many languages at the same time, you may want to create multiple translation instances and then switch between them explicitly, like so::
fr: Si votre programme a besoin de prendre en charge plusieurs langues en même temps, vous pouvez créer plusieurs instances de traduction, puis basculer entre elles de façon explicite, comme ceci ::

source: Deferred translations
fr: Traductions différées

source: In most coding situations, strings are translated where they are coded. Occasionally however, you need to mark strings for translation, but defer actual translation until later. A classic example is::
fr: Dans la plupart des cas, en programmation, les chaînes de caractères sont traduites à l'endroit où on les écrit. Cependant, il peut arriver que vous ayez besoin de traduire une chaîne de caractères un peu plus loin. Un exemple classique est ::

source: Here, you want to mark the strings in the ``animals`` list as being translatable, but you don't actually want to translate them until they are printed.
fr: Ici, vous voulez marquer les chaînes de caractères de la liste ``animals`` comme étant traduisibles, mais ne les traduire qu'au moment de les afficher.

source: Here is one way you can handle this situation::
fr: Voici un moyen de gérer ce cas ::

source: This works because the dummy definition of :func:`_` simply returns the string unchanged. And this dummy definition will temporarily override any definition of :func:`_` in the built-in namespace (until the :keyword:`del` command). Take care, though if you have a previous definition of :func:`_` in the local namespace.
fr: Cela fonctionne car la définition factice de :func:`_` renvoie simplement la chaîne de caractères passée en entrée. Et cette définition factice va temporairement outrepasser toute autre définition de :func:`_` dans l'espace de nommage natif (jusqu'à l'utilisation de la commande :keyword:`del`). Attention toutefois si vous avez déjà une autre définition de :func:`_` dans l'espace de nommage local.

source: Note that the second use of :func:`_` will not identify "a" as being translatable to the :program:`gettext` program, because the parameter is not a string literal.
fr: À noter qu'à la deuxième utilisation de :func:`_`, "a" ne sera pas vue comme traduisible par le programme :program:`gettext` car ce n'est pas un chaîne au sens propre.

source: Another way to handle this is with the following example::
fr: Voici une autre solution ::

source: In this case, you are marking translatable strings with the function :func:`N_`, which won't conflict with any definition of :func:`_`. However, you will need to teach your message extraction program to look for translatable strings marked with :func:`N_`. :program:`xgettext`, :program:`pygettext`, ``pybabel extract``, and :program:`xpot` all support this through the use of the :option:`!-k` command-line switch. The choice of :func:`N_` here is totally arbitrary; it could have just as easily been :func:`MarkThisStringForTranslation`.
fr: Dans ce cas, les chaînes à traduire sont identifiées avec la fonction :func:`N_`, qui n'entre pas en conflit avec définition de :func:`_`. Cependant, il faudra apprendre à votre programme d'extraction de messages à rechercher les chaînes de caractères à traduire parmi celles ayant le marqueur :func:`N_`. :program:`xgettext`, :program:`pygettext`, ``pybabel extract`` et :program:`xpot` prennent tous en charge cela grâce à l'option en ligne de commande :option:`!-k`. Le choix du nom :func:`N_` ici est totalement arbitraire et aurait très bien pu être :func:`MarqueurDeTraduction`.

source: Acknowledgements
fr: Remerciements

source: The following people contributed code, feedback, design suggestions, previous implementations, and valuable experience to the creation of this module:
fr: Les personnes suivantes ont contribué au code, ont fait des retours, ont participé aux suggestions de conception et aux implémentations précédentes, et ont partagé leur expérience précieuse pour la création de ce module :

source: Footnotes
fr: Notes

source: The default locale directory is system dependent; for example, on RedHat Linux it is :file:`/usr/share/locale`, but on Solaris it is :file:`/usr/lib/locale`. The :mod:`gettext` module does not try to support these system dependent defaults; instead its default is :file:`{sys.prefix}/share/locale` (see :data:`sys.prefix`). For this reason, it is always best to call :func:`bindtextdomain` with an explicit absolute path at the start of your application.
fr: Le dossier par défaut pour les localisations dépend du système : par exemple, sur RedHat c'est :file:`/usr/share/locale`, mais sur Solaris c'est :file:`/usr/lib/locale`. Le module :mod:`gettext` n'essaie pas de prendre en charge ce paramètre système dépendant du système d'exploitation, mais utilise le dossier :file:`{sys.prefix}/share/locale` (voir :data:`sys.prefix`). C'est pour cette raison qu'il est toujours préférable d'appeler :func:`bindtextdomain` en donnant explicitement un chemin absolu au début de votre application.

source: See the footnote for :func:`bindtextdomain` above.
fr: Voir la note de :func:`bindtextdomain` ci-dessus.
