Repository: python/python-docs-fr
Catalog: library/gettext.po
Languages: fr

source: :mod:`gettext` --- Multilingual internationalization services
fr: :mod:`gettext` — Services d'internationalisation multilingue

source: **Source code:** :source:`Lib/gettext.py`
fr: **Code source :** :source:`Lib/gettext.py`

source: The :mod:`gettext` module provides internationalization (I18N) and localization (L10N) services for your Python modules and applications. It supports both the GNU :program:`gettext` message catalog API and a higher level, class-based API that may be more appropriate for Python files. The interface described below allows you to write your module and application messages in one natural language, and provide a catalog of translated messages for running under different natural languages.
fr: Le module :mod:`gettext` fournit un service d'internationalisation (*I18N*) et de localisation linguistique (*L10N*) pour vos modules et applications Python. Il est compatible avec l'API du catalogue de messages GNU :program:`gettext` et à un plus haut niveau, avec l'API basée sur les classes qui serait peut-être plus adaptée aux fichiers Python. L'interface décrite ci-dessous vous permet d'écrire les textes de vos modules et applications dans une langue naturelle, puis de fournir un catalogue de traductions pour les lancer ensuite dans d'autres langues naturelles.

source: Some hints on localizing your Python modules and applications are also given.
fr: Quelques astuces sur la localisation de vos modules et applications Python sont également données.

source: GNU :program:`gettext` API
fr: API GNU :program:`gettext`

source: The :mod:`gettext` module defines the following API, which is very similar to the GNU :program:`gettext` API. If you use this API you will affect the translation of your entire application globally. Often this is what you want if your application is monolingual, with the choice of language dependent on the locale of your user. If you are localizing a Python module, or if your application needs to switch languages on the fly, you probably want to use the class-based API instead.
fr: Le module :mod:`gettext` définit l'API suivante, qui est très proche de l'API de GNU :program:`gettext`. Si vous utilisez cette API, cela affectera la traduction de toute votre application. C'est souvent le comportement attendu si votre application est monolingue, avec le choix de la langue qui dépend des paramètres linguistiques de l'utilisateur. Si vous localisez un module Python ou si votre application a besoin de changer de langue à la volée, il est plus judicieux d'utiliser l'API basée sur des classes.

source: Bind the *domain* to the locale directory *localedir*. More concretely, :mod:`gettext` will look for binary :file:`.mo` files for the given domain using the path (on Unix): :file:`{localedir}/{language}/LC_MESSAGES/{domain}.mo`, where *language* is searched for in the environment variables :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES`, and :envvar:`LANG` respectively.
fr: Lie *domain* au répertoire *localedir* des localisations. Plus spécifiquement, :mod:`gettext` va chercher les fichiers binaires :file:`.mo` pour un domaine donné, en utilisant le chemin suivant (sous Unix) : :file:`{localedir}/{language}/LC_MESSAGES/{domain}.mo`, où *language* est recherché dans l'une des variables d'environnement suivantes : :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES` et :envvar:`LANG`.

source: If *localedir* is omitted or ``None``, then the current binding for *domain* is returned. [#]_
fr: Si *localedir* n'est pas renseigné ou vaut ``None``, alors le lien actuel de *domain* est renvoyé. [#]_

source: Bind the *domain* to *codeset*, changing the encoding of byte strings returned by the :func:`lgettext`, :func:`ldgettext`, :func:`lngettext` and :func:`ldngettext` functions. If *codeset* is omitted, then the current binding is returned.
fr: Lie *domain* à *codeset*, en changeant l'encodage des chaînes d'octets retournées par les fonctions :func:`lgettext`, :func:`ldgettext`, :func:`lngettext` et :func:`ldngettext`. Si *codeset* n'est pas renseigné, alors le lien actuel est renvoyé.

source: Change or query the current global domain. If *domain* is ``None``, then the current global domain is returned, otherwise the global domain is set to *domain*, which is returned.
fr: Change ou interroge le domaine global actuel. Si *domain* vaut ``None``, alors le domaine global actuel est renvoyé. Sinon, le domaine global est positionné à *domain*, puis renvoyé.

source: Return the localized translation of *message*, based on the current global domain, language, and locale directory. This function is usually aliased as :func:`_` in the local namespace (see examples below).
fr: Renvoie la traduction localisée de *message*, en se basant sur le domaine global actuel, la langue et le répertoire des localisations. Cette fonction est typiquement renommée :func:`_` dans le namespace courant (voir les exemples ci-dessous).

source: Like :func:`.gettext`, but look the message up in the specified *domain*.
fr: Comme :func:`gettext`, mais cherche le message dans le domaine spécifié.

source: Like :func:`.gettext`, but consider plural forms. If a translation is found, apply the plural formula to *n*, and return the resulting message (some languages have more than two plural forms). If no translation is found, return *singular* if *n* is 1; return *plural* otherwise.
fr: Comme :func:`gettext`, mais prend en compte les formes au pluriel. Si une traduction a été trouvée, utilise la formule pour trouver le pluriel à *n* et renvoie le message généré (quelques langues ont plus de deux formes au pluriel). Si aucune traduction n'a été trouvée, renvoie *singular* si *n* vaut 1, *plural* sinon.

source: The Plural formula is taken from the catalog header. It is a C or Python expression that has a free variable *n*; the expression evaluates to the index of the plural in the catalog. See `the GNU gettext documentation <https://www.gnu.org/software/gettext/manual/gettext.html>`__ for the precise syntax to be used in :file:`.po` files and the formulas for a variety of languages.
fr: La formule pour trouver le pluriel est récupérée dans l'entête du catalogue. C'est une expression en C ou en Python qui a une variable libre *n* et qui évalue l'index du pluriel dans le catalogue. Voir `la documentation de GNU gettext <https://www.gnu.org/software/gettext/manual/gettext.html>`__ pour la syntaxe précise à utiliser dans les fichiers :file:`.po` et pour les formules dans différents langues.

source: Like :func:`ngettext`, but look the message up in the specified *domain*.
fr: Comme :func:`ngettext`, mais cherche le message dans le domaine spécifié.

source: Similar to the corresponding functions without the ``p`` in the prefix (that is, :func:`gettext`, :func:`dgettext`, :func:`ngettext`, :func:`dngettext`), but the translation is restricted to the given message *context*.
fr: Semblable aux fonctions correspondantes sans le ``p`` dans le préfixe (c'est-à-dire :func:`gettext`, :func:`dgettext`, :func:`ngettext` et :func:`dngettext`), mais la traduction est limitée au *context* du message donné.

source: Equivalent to the corresponding functions without the ``l`` prefix (:func:`.gettext`, :func:`dgettext`, :func:`ngettext` and :func:`dngettext`), but the translation is returned as a byte string encoded in the preferred system encoding if no other encoding was explicitly set with :func:`bind_textdomain_codeset`.
fr: Équivalent aux fonctions correspondantes non préfixées par ``l`` (:func:`.gettext`, :func:`dgettext`, :func:`ngettext` et :func:`dngettext`), mais la traduction est retournée en tant que chaîne d'octets, encodée avec l'encodage du système si aucun autre n'a été explicitement défini avec :func:`bind_textdomain_codeset`.

source: These functions should be avoided in Python 3, because they return encoded bytes. It's much better to use alternatives which return Unicode strings instead, since most Python applications will want to manipulate human readable text as strings instead of bytes. Further, it's possible that you may get unexpected Unicode-related exceptions if there are encoding problems with the translated strings.
fr: Ces fonctions sont à éviter en Python 3 car elles renvoient des octets encodés. Il est préférable d'utiliser des alternatives qui renvoient de l'Unicode, puisque beaucoup d'applications Python voudront manipuler du texte lisible par des humains plutôt que des octets. En outre, il est possible que vous obteniez des exceptions non prévues liées à Unicode s'il y a des soucis d'encodage avec les chaînes de caractères traduites.

source: Note that GNU :program:`gettext` also defines a :func:`dcgettext` method, but this was deemed not useful and so it is currently unimplemented.
fr: Notez que GNU :program:`gettext` a aussi une méthode :func:`dcgettext`, mais elle a été considérée comme inutile et donc actuellement marquée comme non implémentée.

source: Here's an example of typical usage for this API::
fr: Voici un exemple classique d'utilisation de cette API ::

source: Class-based API
fr: API basée sur les classes

source: The class-based API of the :mod:`gettext` module gives you more flexibility and greater convenience than the GNU :program:`gettext` API. It is the recommended way of localizing your Python applications and modules. :mod:`!gettext` defines a :class:`GNUTranslations` class which implements the parsing of GNU :file:`.mo` format files, and has methods for returning strings. Instances of this class can also install themselves in the built-in namespace as the function :func:`_`.
fr: L'API du module :mod:`gettext` basée sur les classes vous donne plus de flexibilité et est plus pratique que l'API de GNU :program:`gettext`. Son utilisation est recommandée pour localiser vos applications et modules Python. :mod:`!gettext` définit une classe :class:`GNUTranslations` qui analyse syntaxiquement les fichiers au format GNU :file:`.mo`, et qui possède des méthodes pour renvoyer des chaînes de caractères. Les instances de cette classe "translations" peuvent également s'installer dans l'espace de nommage natif en tant que fonction :func:`_`.

source: This function implements the standard :file:`.mo` file search algorithm. It takes a *domain*, identical to what :func:`textdomain` takes. Optional *localedir* is as in :func:`bindtextdomain`. Optional *languages* is a list of strings, where each string is a language code.
fr: Cette fonction implémente l'algorithme standard de recherche de fichier :file:`mo`. Il prend en entrée un *domain*, tout comme la fonction :func:`textdomain`. Le paramètre optionnel *localedir* est le même que celui de :func:`bindtextdomain`. Le paramètre optionnel *langages* est une liste de chaînes de caractères correspondants au code d'une langue.

source: If *localedir* is not given, then the default system locale directory is used. [#]_ If *languages* is not given, then the following environment variables are searched: :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES`, and :envvar:`LANG`. The first one returning a non-empty value is used for the *languages* variable. The environment variables should contain a colon separated list of languages, which will be split on the colon to produce the expected list of language code strings.
fr: Si *localedir* n'est pas renseigné, alors le répertoire de la locale par défaut du système est utilisé. [#]_ Si *languages* n'est pas renseigné, alors les variables d'environnement suivantes sont utilisées : :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES` et :envvar:`LANG`. La première à renvoyer une valeur non vide est alors utilisée pour *languages*. Ces variables d'environnement doivent contenir une liste de langues, séparées par des deux-points, qui sera utilisée pour générer la liste des codes de langues attendue.

source: :func:`find` then expands and normalizes the languages, and then iterates through them, searching for an existing file built of these components:
fr: Recherche avec :func:`find`, découvre et normalise les langues, puis itère sur la liste obtenue afin de trouver un fichier de traduction existant et correspondant :

source: The first such file name that exists is returned by :func:`find`. If no such file is found, then ``None`` is returned. If *all* is given, it returns a list of all file names, in the order in which they appear in the languages list or the environment variables.
fr: Le premier nom de fichier trouvé est renvoyé par :func:`find`. Si aucun fichier n'a été trouvé, alors `None` est renvoyé. Si *all* est vrai, est renvoyée la liste de tous les noms de fichiers, dans l'ordre dans lequel ils apparaissent dans *languages* ou dans les variables d'environnement.

source: Return a :class:`*Translations` instance based on the *domain*, *localedir*, and *languages*, which are first passed to :func:`find` to get a list of the associated :file:`.mo` file paths. Instances with identical :file:`.mo` file names are cached. The actual class instantiated is *class_* if provided, otherwise :class:`GNUTranslations`. The class's constructor must take a single :term:`file object` argument. If provided, *codeset* will change the charset used to encode translated strings in the :meth:`~NullTranslations.lgettext` and :meth:`~NullTranslations.lngettext` methods.
fr: Renvoie une instance de la classe :class:`*Translations` en se basant sur *domain*, *localedir* et *languages*, qui sont d'abord passés en argument de :func:`find` afin d'obtenir une liste de chemin des fichiers :file:`.mo` associés. Les instances avec des noms de fichiers :file:`.mo` identiques sont mises en cache. La classe réellement instanciée est soit *class_* si renseigné, soit une classe :class:`GNUTranslations`. Le constructeur de cette classe doit prendre en argument un seul :term:`file object`. Si renseigné, *codeset* modifiera le jeu de caractères utilisé pour encoder les chaînes de caractères traduites, dans les méthodes :meth:`~NullTranslations.lgettext` et :meth:`~NullTranslations.lngettext`.

source: If multiple files are found, later files are used as fallbacks for earlier ones. To allow setting the fallback, :func:`copy.copy` is used to clone each translation object from the cache; the actual instance data is still shared with the cache.
fr: Si plusieurs fichiers ont été trouvés, les derniers sont utilisés comme substitut des premiers. Pour rendre possible cette substitution, :func:`copy.copy` est utilisé pour copier chaque objet traduit depuis le cache ; les vraies données de l'instance étant toujours recopiées dans le cache.

source: If no :file:`.mo` file is found, this function raises :exc:`OSError` if *fallback* is false (which is the default), and returns a :class:`NullTranslations` instance if *fallback* is true.
fr: Si aucun fichier :file:`.mo` n'a été trouvé, soit *fallback* vaut *False* (valeur par défaut) et une exception :exc:`OSError` est levée, soit *fallback* vaut *True* et une instance :class:`NullTranslations` est renvoyée.

source: :exc:`IOError` used to be raised instead of :exc:`OSError`.
fr: Avant, c'était l'exception :exc:`IOError` qui était levée, au lieu de :exc:`OSError`.

source: The *codeset* parameter.
fr: Le paramètre *codeset*.

source: This installs the function :func:`_` in Python's builtins namespace, based on *domain*, *localedir*, and *codeset* which are passed to the function :func:`translation`.
fr: Positionne la fonction :func:`_` dans l'espace de nommage natif de Python, en se basant sur *domain*, *localedir* et *codeset*, qui sont passés en argument de la fonction :func:`translation`.

source: For the *names* parameter, please see the description of the translation object's :meth:`~NullTranslations.install` method.
fr: Concernant le paramètre *names*, se référer à la description de la méthode :meth:`~NullTranslations.install`.

source: As seen below, you usually mark the strings in your application that are candidates for translation, by wrapping them in a call to the :func:`_` function, like this::
fr: Habituellement, la fonction :func:`_` est appliquée aux chaînes de caractères qui doivent être traduites comme suit ::

source: For convenience, you want the :func:`_` function to be installed in Python's builtins namespace, so it is easily accessible in all modules of your application.
fr: Pour plus de confort, il vaut mieux positionner la fonction :func:`_` dans l'espace de nommage natif de Python pour la rendre plus accessible dans tous les modules de votre application.

source: The :class:`NullTranslations` class
fr: La classe :class:`NullTranslations`

source: Translation classes are what actually implement the translation of original source file message strings to translated message strings. The base class used by all translation classes is :class:`NullTranslations`; this provides the basic interface you can use to write your own specialized translation classes. Here are the methods of :class:`!NullTranslations`:
fr: Les classes de traduction implémentent le fait de passer d'une chaîne de caractères du fichier original à traduire à la traduction de celle-ci. La classe de base utilisée est :class:`NullTranslations`. C'est l'interface de base à utiliser lorsque vous souhaitez écrire vos propres classes spécifiques à la traduction. Voici les méthodes de :class:`!NullTranslations` :

source: Takes an optional :term:`file object` *fp*, which is ignored by the base class. Initializes "protected" instance variables *_info* and *_charset* which are set by derived classes, as well as *_fallback*, which is set through :meth:`add_fallback`. It then calls ``self._parse(fp)`` if *fp* is not ``None``.
fr: Prend un paramètre optionnel un :term:`file object` *fp*, qui est ignoré par la classe de base. Initialise les variables d'instance "protégées" *_info* et *_chardet*, définies par des classes dérivées, tout comme *_fallback* qui est définie au travers de :meth:`add_fallback`. Puis appelle ``self._parse(fp)`` si *fp* ne vaut pas ``None``.

source: No-op in the base class, this method takes file object *fp*, and reads the data from the file, initializing its message catalog. If you have an unsupported message catalog file format, you should override this method to parse your format.
fr: Cette méthode, non exécutée dans la classe de base, prend en paramètre un objet fichier *fp* et lit les données de ce dernier. Si vous avez un catalogue de messages dont le format n'est pas pris en charge, vous devriez surcharger cette méthode pour analyser votre format.

source: Add *fallback* as the fallback object for the current translation object. A translation object should consult the fallback if it cannot provide a translation for a given message.
fr: Ajoute *fallback* comme objet de substitution pour l'objet de traduction courant. Un objet de traduction devrait interroger cet objet de substitution s'il ne peut fournir une traduction pour un message donné.

source: If a fallback has been set, forward :meth:`!gettext` to the fallback. Otherwise, return *message*. Overridden in derived classes.
fr: Si un objet de substitution a été défini, transmet :meth:`!gettext` à celui-ci. Sinon, renvoie *message*. Surchargé dans les classes dérivées.

source: If a fallback has been set, forward :meth:`!ngettext` to the fallback. Otherwise, return *singular* if *n* is 1; return *plural* otherwise. Overridden in derived classes.
fr: Si un objet de substitution a été défini, transmet :meth:`!ngettext` à celui-ci. Sinon, renvoie *singular* si *n* vaut 1, *plural* sinon. Surchargé dans les classes dérivées.

source: If a fallback has been set, forward :meth:`pgettext` to the fallback. Otherwise, return the translated message. Overridden in derived classes.
fr: Si un objet de substitution a été défini, transmet :meth:`pgettext` à celui-ci. Sinon, renvoie le message traduit. Surchargé dans les classes dérivées.

source: If a fallback has been set, forward :meth:`npgettext` to the fallback. Otherwise, return the translated message. Overridden in derived classes.
fr: Si un objet de substitution a été défini, transmet :meth:`npgettext` à celui-ci. Sinon, renvoie le message traduit. Surchargé dans les classes dérivées.

source: Equivalent to :meth:`.gettext` and :meth:`.ngettext`, but the translation is returned as a byte string encoded in the preferred system encoding if no encoding was explicitly set with :meth:`set_output_charset`. Overridden in derived classes.
fr: Équivalent de :meth:`.gettext` et :meth:`.ngettext`, mais la traduction est renvoyée sous la forme d'une chaîne d'octets, encodée avec l'encodage du système si aucun autre n'a été défini avec :meth:`set_output_charset`. Surchargé dans les classes dérivées.

source: These methods should be avoided in Python 3. See the warning for the :func:`lgettext` function.
fr: L'utilisation de ces méthodes doivent être évitée en Python 3. Voir l'avertissement de la fonction :func:`lgettext`.

source: Return the "protected" :attr:`_info` variable, a dictionary containing the metadata found in the message catalog file.
fr: Renvoie l'attribut "protégé" :attr:`_info`, dictionnaire contenant les métadonnées trouvées dans le fichier de catalogue de messages.

source: Return the encoding of the message catalog file.
fr: Renvoie l'encodage du fichier du catalogue de messages.

source: Return the encoding used to return translated messages in :meth:`.lgettext` and :meth:`.lngettext`.
fr: Renvoie l'encodage utilisé par :meth:`.lgettext` et :meth:`.lngettext` pour la traduction des messages.

source: Change the encoding used to return translated messages.
fr: Modifie l'encodage utilisé pour la traduction des messages.

source: This method installs :meth:`.gettext` into the built-in namespace, binding it to ``_``.
fr: Cette méthode positionne :meth:`.gettext` dans l'espace de nommage natif, en le liant à ``_``.

source: If the *names* parameter is given, it must be a sequence containing the names of functions you want to install in the builtins namespace in addition to :func:`_`. Supported names are ``'gettext'``, ``'ngettext'``, ``'pgettext'``, ``'npgettext'``, ``'lgettext'``, and ``'lngettext'``.
fr: Si le paramètre *names* est renseigné, celui-ci doit être une séquence contenant les noms des fonctions que vous souhaitez positionner dans l'espace de nommage natif, en plus de :func:`_`. Les noms pris en charge sont ``'gettext'``, ``'ngettext'``, ``'pgettext'``, ``'npgettext'``, ``'lgettext'`` et ``'lngettext'``.

source: Note that this is only one way, albeit the most convenient way, to make the :func:`_` function available to your application. Because it affects the entire application globally, and specifically the built-in namespace, localized modules should never install :func:`_`. Instead, they should use this code to make :func:`_` available to their module::
fr: Notez que ce n'est là qu'un moyen parmi d'autres, quoique le plus pratique, pour rendre la fonction :func:`_` accessible à votre application. Puisque cela affecte toute l'application, et plus particulièrement l'espace de nommage natif, les modules localisés ne devraient jamais y positionner :func:`_`. Au lieu de cela, ces derniers doivent plutôt utiliser le code suivant pour rendre :func:`_` accessible par leurs modules ::

source: This puts :func:`_` only in the module's global namespace and so only affects calls within this module.
fr: Cela met :func:`_` dans l'espace de nommage global du module uniquement et donc n'affectera ses appels que dans ce module.

source: Added ``'pgettext'`` and ``'npgettext'``.
fr: Ajout de ``'pgettext'`` et ``'npgettext'``.

source: The :class:`GNUTranslations` class
fr: La classe :class:`GNUTranslations`
