Repository: python/python-docs-fr
Catalog: library/glob.po
Languages: fr

source: :mod:`glob` --- Unix style pathname pattern expansion
fr: :mod:`glob` — Recherche de chemins de style Unix selon certains motifs

source: **Source code:** :source:`Lib/glob.py`
fr: **Code source :** :source:`Lib/glob.py`

source: For a literal match, wrap the meta-characters in brackets. For example, ``'[?]'`` matches the character ``'?'``.
fr: Pour une correspondance littérale, il faut entourer le métacaractère par des crochets. Par exemple, ``'[?]'`` reconnaît le caractère ``'?'``.

source: The :mod:`pathlib` module offers high-level path objects.
fr: Le module :mod:`pathlib` offre une représentation objet de haut niveau des chemins.

source: If *root_dir* is not ``None``, it should be a :term:`path-like object` specifying the root directory for searching. It has the same effect on :func:`glob` as changing the current directory before calling it. If *pathname* is relative, the result will contain paths relative to *root_dir*.
fr: Si *root_dir* n'est pas ``None``, cela doit être un :term:`objet simili-chemin <path-like object>` spécifiant le dossier racine de la recherche. Cela a le même effet sur :func:`glob` que de changer le dossier courant avant l'appel de la fonction. Si *pathname* est relatif, les chemins du résultat seront relatifs au *root_dir* .

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>` with the *dir_fd* parameter.
fr: Cette fonction prend en charge les :ref:`chemins relatifs aux descripteurs de dossier <dir_fd>` avec le paramètre *dir_fd*.

source: If *recursive* is true, the pattern "``**``" will match any files and zero or more directories, subdirectories and symbolic links to directories. If the pattern is followed by an :data:`os.sep` or :data:`os.altsep` then files will not match.
fr: Si *recursive* est vrai, le motif "``**``" reconnaît tous les fichiers, aucun ou plusieurs répertoires, sous-répertoires et liens symboliques aux répertoires. Si le motif est suivi par :data:`os.sep` ou :data:`os.altsep` alors les fichiers ne sont pas inclus dans le résultat.

source: Raises an :ref:`auditing event <auditing>` ``glob.glob`` with arguments ``pathname``, ``recursive``.
fr: Lève un :ref:`évènement d'audit <auditing>` ``glob.glob`` avec les arguments ``pathname``, ``recursive``.

source: Raises an :ref:`auditing event <auditing>` ``glob.glob/2`` with arguments ``pathname``, ``recursive``, ``root_dir``, ``dir_fd``.
fr: Lève un :ref:`évènement d'audit <auditing>` ``glob.glob/2`` avec les arguments ``pathname``, ``recursive``, ``root_dir``, ``dir_fd``.

source: Using the "``**``" pattern in large directory trees may consume an inordinate amount of time.
fr: Utiliser le motif "``**``" dans de grandes arborescences de dossier peut consommer une quantité de temps démesurée.

source: Support for recursive globs using "``**``".
fr: Prise en charge des chemins récursifs utilisant le motif "``**``".

source: Added the *root_dir* and *dir_fd* parameters.
fr: Paramètres *root_dir* et *dir_fd* ajoutés.

source: Return an :term:`iterator` which yields the same values as :func:`glob` without actually storing them all simultaneously.
fr: Renvoie un :term:`itérateur <iterator>` qui produit les mêmes valeurs que :func:`glob`, sans toutes les charger en mémoire simultanément.

source: Escape all special characters (``'?'``, ``'*'`` and ``'['``). This is useful if you want to match an arbitrary literal string that may have special characters in it. Special characters in drive/UNC sharepoints are not escaped, e.g. on Windows ``escape('//?/c:/Quo vadis?.txt')`` returns ``'//?/c:/Quo vadis[?].txt'``.
fr: Échappe tous les caractères spéciaux (``'?'``, ``'*'`` et ``'['``). Cela est utile pour reconnaître une chaîne de caractère littérale arbitraire qui contiendrait ce type de caractères. Les caractères spéciaux dans les disques et répertoires partagés (chemins UNC) ne sont pas échappés, e.g. sous Windows ``escape('//?/c:/Quo vadis?.txt')`` renvoie ``'//?/c:/Quo vadis[?].txt'``.

source: For example, consider a directory containing the following files: :file:`1.gif`, :file:`2.txt`, :file:`card.gif` and a subdirectory :file:`sub` which contains only the file :file:`3.txt`. :func:`glob` will produce the following results. Notice how any leading components of the path are preserved. ::
fr: Par exemple, considérons un répertoire contenant les fichiers suivants : :file:`1.gif`, :file:`2.txt`, :file:`card.gif` et un sous-répertoire :file:`sub` contenant seulement le fichier :file:`3.txt`. :func:`glob` produit les résultats suivants. Notons que les composantes principales des chemins sont préservées. ::

source: If the directory contains files starting with ``.`` they won't be matched by default. For example, consider a directory containing :file:`card.gif` and :file:`.card.gif`::
fr: Si le répertoire contient des fichiers commençant par ``.``, ils ne sont pas reconnus par défaut. Par exemple, considérons un répertoire contenant :file:`card.gif` et :file:`.card.gif` ::

source: Shell-style filename (not path) expansion
fr: Recherche de noms de fichiers de style shell (ne concerne pas les chemins)
