Repository: python/python-docs-fr
Catalog: library/gzip.po
Languages: fr

source: :mod:`gzip` --- Support for :program:`gzip` files
fr: :mod:`gzip` — Support pour les fichiers :program:`gzip`

source: **Source code:** :source:`Lib/gzip.py`
fr: **Code source :** :source:`Lib/gzip.py`

source: This module provides a simple interface to compress and decompress files just like the GNU programs :program:`gzip` and :program:`gunzip` would.
fr: Ce module fournit une interface simple pour compresser et décompresser des fichiers tout comme le font les programmes GNU :program:`gzip` et :program:`gunzip`.

source: The data compression is provided by the :mod:`zlib` module.
fr: La compression de données est fournie par le module :mod:`zlib`.

source: The :mod:`gzip` module provides the :class:`GzipFile` class, as well as the :func:`.open`, :func:`compress` and :func:`decompress` convenience functions. The :class:`GzipFile` class reads and writes :program:`gzip`\ -format files, automatically compressing or decompressing the data so that it looks like an ordinary :term:`file object`.
fr: Le module :mod:`gzip` fournit la classe :class:`GzipFile` ainsi que les fonctions pratiques :func:`.open`, :func:`compress` et :func:`decompress`. La classe :class:`GzipFile` lit et écrit des fichiers au format :program:`gzip`, compressant et décompressant automatiquement les données pour qu'elles aient l'apparence d'un objet :term:`file object` ordinaire.

source: Note that additional file formats which can be decompressed by the :program:`gzip` and :program:`gunzip` programs, such as those produced by :program:`compress` and :program:`pack`, are not supported by this module.
fr: Notez que les formats de fichier supplémentaires qui peuvent être décompressés par les programmes :program:`gzip` et :program:`gunzip`, comme ceux produits par le programmes :program:`compress` et :program:`pack`, ne sont pas gérés par ce module.

source: The module defines the following items:
fr: Le module définit les éléments suivants :

source: Open a gzip-compressed file in binary or text mode, returning a :term:`file object`.
fr: Ouvre un fichier compressé en *gzip* en mode binaire ou texte, renvoie un objet :term:`file object`.

source: The *filename* argument can be an actual filename (a :class:`str` or :class:`bytes` object), or an existing file object to read from or write to.
fr: L'argument *filename* peut être un nom de fichier (un objet :class:`str` ou :class:`bytes`) ou un objet fichier existant que l'on peut lire, ou où l'on peut écrire.

source: The *mode* argument can be any of ``'r'``, ``'rb'``, ``'a'``, ``'ab'``, ``'w'``, ``'wb'``, ``'x'`` or ``'xb'`` for binary mode, or ``'rt'``, ``'at'``, ``'wt'``, or ``'xt'`` for text mode. The default is ``'rb'``.
fr: L'argument *mode* peut-être ``'r'``, ``'rb'``, ``'a'``, ``'ab'``, ``'w'``, ``'wb'``, ``'x'`` ou ``'xb'`` pour le mode binaire ou ``'rt'``, ``'at'``, ``'wt'``, ou ``'xt'`` pour le mode texte. Le mode par défaut est ``'rb'``.

source: The *compresslevel* argument is an integer from 0 to 9, as for the :class:`GzipFile` constructor.
fr: L'argument *compresslevel* est un entier de 0 à 9, comme pour le constructeur de la classe :class:`GzipFile`.

source: For binary mode, this function is equivalent to the :class:`GzipFile` constructor: ``GzipFile(filename, mode, compresslevel)``. In this case, the *encoding*, *errors* and *newline* arguments must not be provided.
fr: En mode binaire, cette fonction est équivalente au constructeur de la classe :class:`GzipFile` : ``GzipFile(filename, mode, compresslevel)``. Dans ce cas, les arguments *encoding*, *errors* et *newline* ne doivent pas être fournis.

source: For text mode, a :class:`GzipFile` object is created, and wrapped in an :class:`io.TextIOWrapper` instance with the specified encoding, error handling behavior, and line ending(s).
fr: En mode texte, un objet :class:`GzipFile` est créé et empaqueté dans une instance de :class:`io.TextIOWrapper` avec l'encodage, la gestion d'erreur et les fins de ligne spécifiés.

source: Added support for *filename* being a file object, support for text mode, and the *encoding*, *errors* and *newline* arguments.
fr: Ajout de la prise en charge de *filename* en tant qu'objet *file*, du mode texte et des arguments *encoding*, *errors* et *newline*.

source: Added support for the ``'x'``, ``'xb'`` and ``'xt'`` modes.
fr: Ajout de la prise en charge des modes ``'x'``, ``'xb'`` et ``'xt'``.

source: Accepts a :term:`path-like object`.
fr: Accepte un :term:`path-like object`.

source: Constructor for the :class:`GzipFile` class, which simulates most of the methods of a :term:`file object`, with the exception of the :meth:`truncate` method. At least one of *fileobj* and *filename* must be given a non-trivial value.
fr: Constructeur de la classe :class:`GzipFile` qui simule la plupart des méthodes d'un objet :term:`file object` à l'exception de la méthode :meth:`truncate`. Au moins un des arguments *fileobj* et *filename* doit avoir une valeur non triviale.

source: The new class instance is based on *fileobj*, which can be a regular file, an :class:`io.BytesIO` object, or any other object which simulates a file. It defaults to ``None``, in which case *filename* is opened to provide a file object.
fr: La nouvelle instance de classe est basée sur *fileobj* qui peut être un fichier usuel, un objet :class:`io.BytesIO` ou tout autre objet qui simule un fichier. *fileobj* est par défaut à *None*, dans ce cas *filename* est ouvert afin de fournir un objet fichier.

source: When *fileobj* is not ``None``, the *filename* argument is only used to be included in the :program:`gzip` file header, which may include the original filename of the uncompressed file. It defaults to the filename of *fileobj*, if discernible; otherwise, it defaults to the empty string, and in this case the original filename is not included in the header.
fr: Quand *fileobj* n'est pas à ``None``, l'argument *filename* est uniquement utilisé pour être inclus dans l'entête du fichier :program:`gzip`, qui peut inclure le nom original du fichier décompressé. Il est par défaut défini avec le nom de fichier de *fileobj* s'il est discernable, sinon il est par défaut défini à une chaîne de caractères vide et dans ce cas le nom du fichier orignal n'est pas inclus dans l'entête.

source: The *mode* argument can be any of ``'r'``, ``'rb'``, ``'a'``, ``'ab'``, ``'w'``, ``'wb'``, ``'x'``, or ``'xb'``, depending on whether the file will be read or written. The default is the mode of *fileobj* if discernible; otherwise, the default is ``'rb'``.
fr: L'argument *mode* peut-être ``'r'``, ``'rb'``, ``'a'``, ``'ab'``, ``'w'``, ``'wb'``, ``'x'``, ou ``'xb'``, selon que le fichier va être lu ou écrit. Par défaut prend la valeur du mode de *fileobj* si discernable ; sinon, la valeur par défaut est ``'rb'``.

source: Note that the file is always opened in binary mode. To open a compressed file in text mode, use :func:`.open` (or wrap your :class:`GzipFile` with an :class:`io.TextIOWrapper`).
fr: Notez que le fichier est toujours ouvert en mode binaire. Pour ouvrir un fichier compressé en mode texte, utilisez la fonction :func:`.open` (ou empaquetez votre classe :class:`GzipFile` avec un :class:`io.TextIOWrapper`).

source: The *compresslevel* argument is an integer from ``0`` to ``9`` controlling the level of compression; ``1`` is fastest and produces the least compression, and ``9`` is slowest and produces the most compression. ``0`` is no compression. The default is ``9``.
fr: L'argument *compresslevel* est un entier de ``0`` à ``9`` contrôlant le niveau de compression,``1`` est le plus rapide et produit la compression la plus faible et ``9`` est le plus rapide et produit la compression la plus élevée. ``0`` désactive la compression. Par défaut à ``9``.

source: The *mtime* argument is an optional numeric timestamp to be written to the last modification time field in the stream when compressing. It should only be provided in compression mode. If omitted or ``None``, the current time is used. See the :attr:`mtime` attribute for more details.
fr: L'argument *mtime* est un *timestamp* numérique optionnel à écrire dans le champ de date de dernière modification du flux durant la compression. Il ne doit être défini qu'en mode compression. S'il est omis ou ``None``, la date courante est utilisée. Voir l'attribut :attr:`mtime` pour plus de détails.

source: Calling a :class:`GzipFile` object's :meth:`close` method does not close *fileobj*, since you might wish to append more material after the compressed data. This also allows you to pass an :class:`io.BytesIO` object opened for writing as *fileobj*, and retrieve the resulting memory buffer using the :class:`io.BytesIO` object's :meth:`~io.BytesIO.getvalue` method.
fr: Appeler la méthode :meth:`close` d'un objet :class:`GzipFile` ne ferme pas *fileobj*, puisque vous pourriez avoir besoin d'ajouter des informations après les données compressées. Cela vous permet aussi de passer un objet :class:`io.BytesIO` ouvert en écriture en tant que *fileobj* et récupérer le tampon mémoire final en utilisant la méthode :meth:`~io.BytesIO.getvalue` de l'objet :class:`io.BytesIO`.

source: :class:`GzipFile` supports the :class:`io.BufferedIOBase` interface, including iteration and the :keyword:`with` statement. Only the :meth:`truncate` method isn't implemented.
fr: :La classe :class:`GzipFile` implémente l'interface :class:`io.BufferedIOBase`, incluant l'itération, la déclaration :keyword:`with`. La méthode :meth:`truncate` est la seule non implémentée.

source: :class:`GzipFile` also provides the following method and attribute:
fr: La classe :class:`GzipFile` fournit aussi la méthode et l'attribut suivant :

source: Read *n* uncompressed bytes without advancing the file position. At most one single read on the compressed stream is done to satisfy the call. The number of bytes returned may be more or less than requested.
fr: Lit *n* octets non compressés sans avancer la position dans le fichier. Au plus une seule lecture sur le flux compressé est faite pour satisfaire l'appel. Le nombre d'octets retournés peut être supérieur ou inférieur au nombre demandé.

source: While calling :meth:`peek` does not change the file position of the :class:`GzipFile`, it may change the position of the underlying file object (e.g. if the :class:`GzipFile` was constructed with the *fileobj* parameter).
fr: Bien que l'appel à :meth:`peek` ne change pas la position dans le fichier de l'objet :class:`GzipFile`, il peut changer la position de l'objet de fichier sous-jacent (par exemple, si l'instance de :class:`GzipFile` a été construite avec le paramètre *fileobj*).

source: When decompressing, the value of the last modification time field in the most recently read header may be read from this attribute, as an integer. The initial value before reading any headers is ``None``.
fr: Lors de la décompression, la valeur du champ de date de dernière modification dans le dernier en-tête lu peut être lue à partir de cet attribut, comme un entier. La valeur initiale avant lecture d'un en-tête est ``None``.

source: All :program:`gzip` compressed streams are required to contain this timestamp field. Some programs, such as :program:`gunzip`\ , make use of the timestamp. The format is the same as the return value of :func:`time.time` and the :attr:`~os.stat_result.st_mtime` attribute of the object returned by :func:`os.stat`.
fr: Tous les flux compressés en :program:`gzip` doivent contenir ce champ *timestamp*. Certains programmes, comme :program:`gunzip`\ , utilisent ce *timestamp*. Ce format est le même que la valeur retour de :func:`time.time` et l'attribut :attr:`~os.stat_result.st_mtime` de l'objet retourné par :func:`os.stat`.

source: Support for the :keyword:`with` statement was added, along with the *mtime* constructor argument and :attr:`mtime` attribute.
fr: Ajout de la prise en charge du mot-clef :keyword:`with`, ainsi que de l'argument *mtime* du constructeur et de l'attribut :attr:`mtime`.

source: Support for zero-padded and unseekable files was added.
fr: Ajout de la prise en charge des fichiers non navigables ou commençant par des octets nuls.

source: The :meth:`io.BufferedIOBase.read1` method is now implemented.
fr: La méthode :meth:`io.BufferedIOBase.read1` est désormais implémentée.

source: Added support for the ``'x'`` and ``'xb'`` modes.
fr: Ajout de la prise en charge des modes ``'x'`` et ``'xb'``.

source: Added support for writing arbitrary :term:`bytes-like objects <bytes-like object>`. The :meth:`~io.BufferedIOBase.read` method now accepts an argument of ``None``.
fr: Ajout de la prise en charge de l'écriture d'objets :term:`bytes-like objects <bytes-like object>` arbitraires. La méthode :meth:`~io.BufferedIOBase.read` accepte désormais un argument de valeur ``None``.

source: Decompress the *data*, returning a :class:`bytes` object containing the uncompressed data.
fr: Décompresse les données *data*, retourne un objet :class:`bytes` contenant les données décompressées.

source: Examples of usage
fr: Exemples d'utilisation

source: Example of how to read a compressed file::
fr: Exemple montrant comment lire un fichier compressé ::

source: Example of how to create a compressed GZIP file::
fr: Exemple montrant comment créer un fichier GZIP ::

source: Example of how to GZIP compress an existing file::
fr: Exemple montrant comment compresser dans un GZIP un fichier existant ::

source: Example of how to GZIP compress a binary string::
fr: Exemple montrant comment compresser dans un GZIP un binaire dans une chaîne ::

source: The basic data compression module needed to support the :program:`gzip` file format.
fr: Le module de compression de données de base nécessaire pour gérer le format de fichier :program:`gzip`.

source: Command Line Interface
fr: Interface en ligne de commande

source: Command line options
fr: Options de la ligne de commande

source: Show the help message.
fr: Affiche le message d'aide.
