Repository: python/python-docs-fr
Catalog: library/hashlib.po
Languages: fr

source: *inner_size*: inner digest size (0 to 64 for BLAKE2b, 0 to 32 for BLAKE2s, 0 in sequential mode).
fr: *inner_size* : taille de l'empreinte interne (0 à 64 pour BLAKE2b, 0 à 32 pour BLAKE2s, 0 en mode séquentiel).

source: *last_node*: boolean indicating whether the processed node is the last one (``False`` for sequential mode).
fr: *last_node* : booléen indiquant si le nœud traité est le dernier (``False`` pour le mode séquentiel).

source: Explanation of tree mode parameters.
fr: Explication des paramètres du mode arbre.

source: See section 2.10 in `BLAKE2 specification <https://www.blake2.net/blake2_20130129.pdf>`_ for comprehensive review of tree hashing.
fr: Voir la section 2.10 dans `BLAKE2 specification <https://blake2.net/blake2_20130129.pdf>`_ pour une approche globale du hachage en mode arbre.

source: Constants
fr: Constantes

source: Salt length (maximum length accepted by constructors).
fr: Longueur du sel (longueur maximale acceptée par les constructeurs).

source: Personalization string length (maximum length accepted by constructors).
fr: Longueur de la chaîne de personnalisation (longueur maximale acceptée par les constructeurs).

source: Maximum key size.
fr: Taille maximale de clé.

source: Maximum digest size that the hash function can output.
fr: Taille maximale du message que peut fournir la fonction de hachage.

source: Examples
fr: Exemples

source: Simple hashing
fr: Hachage simple

source: To calculate hash of some data, you should first construct a hash object by calling the appropriate constructor function (:func:`blake2b` or :func:`blake2s`), then update it with the data by calling :meth:`~hash.update` on the object, and, finally, get the digest out of the object by calling :meth:`~hash.digest` (or :meth:`~hash.hexdigest` for hex-encoded string).
fr: Pour calculer l'empreinte (ou *hash*) d'une quantité de données, vous devez d'abord construire un objet de calcul d'empreinte en appelant la fonction constructeur appropriée (:func:`blake2b` or :func:`blake2s`), ensuite le mettre à jour avec les données en appelant la méthode :meth:`~hash.update` sur l'objet, et, pour finir, récupérer l'empreinte du message en appelant la méthode :meth:`~hash.digest` (ou :meth:`~hash.hexdigest` pour les chaînes hexadécimales).

source: As a shortcut, you can pass the first chunk of data to update directly to the constructor as the positional argument:
fr: En plus court, vous pouvez passer directement au constructeur, comme argument positionnel, le premier morceau du message pour le mettre directement à jour :

source: You can call :meth:`hash.update` as many times as you need to iteratively update the hash:
fr: Vous pouvez appeler la méthode :meth:`hash.update` autant de fois que nécessaire pour mettre à jour l'empreinte de manière itérative :

source: Using different digest sizes
fr: Production de tailles d'empreintes différentes

source: BLAKE2 has configurable size of digests up to 64 bytes for BLAKE2b and up to 32 bytes for BLAKE2s. For example, to replace SHA-1 with BLAKE2b without changing the size of output, we can tell BLAKE2b to produce 20-byte digests:
fr: BLAKE2 permet de configurer la taille des empreintes jusqu'à 64 octets pour BLAKE2b et jusqu'à 32 octets pour BLAKE2s. Par exemple, pour remplacer SHA-1 par BLAKE2b sans changer la taille de la sortie, nous pouvons dire à BLAKE2b de produire une empreinte de 20 octets :

source: Hash objects with different digest sizes have completely different outputs (shorter hashes are *not* prefixes of longer hashes); BLAKE2b and BLAKE2s produce different outputs even if the output length is the same:
fr: Les objets de calcul d'empreinte initialisés avec des tailles d'empreintes différentes ont des sorties complètement différentes (les condensats courts *ne sont pas* des préfixes de condensats plus longs) ; BLAKE2b et BLAKE2s produisent des sorties différentes même si les longueurs de sortie sont les mêmes :

source: Keyed hashing
fr: Hachage avec clé – Code d'authentification de message

source: Keyed hashing can be used for authentication as a faster and simpler replacement for `Hash-based message authentication code <https://en.wikipedia.org/wiki/HMAC>`_ (HMAC). BLAKE2 can be securely used in prefix-MAC mode thanks to the indifferentiability property inherited from BLAKE.
fr: Le hachage avec clé (*keyed hashing* en anglais) est une alternative plus simple et plus rapide à un `code d’authentification de message de hachage à clé <https://fr.wikipedia.org/wiki/Keyed-hash_message_authentication_code>`_ (HMAC). BLAKE2 peut être utilisé de manière sécurisée dans le mode préfixe MAC grâce à la propriété d'indifférentiabilité héritée de BLAKE.

source: This example shows how to get a (hex-encoded) 128-bit authentication code for message ``b'message data'`` with key ``b'pseudorandom key'``::
fr: Cet exemple montre comment obtenir un code d'authentification de message de 128 bits (en hexadécimal) pour un message ``b'message data'`` avec la clé ``b'pseudorandom key'`` ::

source: As a practical example, a web application can symmetrically sign cookies sent to users and later verify them to make sure they weren't tampered with::
fr: Comme exemple pratique, une application web peut chiffrer symétriquement les *cookies* envoyés aux utilisateurs et les vérifier plus tard pour être certaine qu'ils n'ont pas été altérés ::

source: Even though there's a native keyed hashing mode, BLAKE2 can, of course, be used in HMAC construction with :mod:`hmac` module::
fr: Même s'il possède en natif la création de code d'authentification de message (MAC), BLAKE2 peut, bien sûr, être utilisé pour construire un HMAC en combinaison avec le module :mod:`hmac` ::

source: Randomized hashing
fr: Hachage randomisé

source: By setting *salt* parameter users can introduce randomization to the hash function. Randomized hashing is useful for protecting against collision attacks on the hash function used in digital signatures.
fr: En définissant le paramètre *salt* les utilisateurs peuvent introduire de l'aléatoire dans la fonction de hachage. Le hachage randomisé est utile pour se protéger des attaques par collisions sur les fonctions de hachage utilisées dans les signatures numériques.

source: Randomized hashing is designed for situations where one party, the message preparer, generates all or part of a message to be signed by a second party, the message signer. If the message preparer is able to find cryptographic hash function collisions (i.e., two messages producing the same hash value), then they might prepare meaningful versions of the message that would produce the same hash value and digital signature, but with different results (e.g., transferring $1,000,000 to an account, rather than $10). Cryptographic hash functions have been designed with collision resistance as a major goal, but the current concentration on attacking cryptographic hash functions may result in a given cryptographic hash function providing less collision resistance than expected. Randomized hashing offers the signer additional protection by reducing the likelihood that a preparer can generate two or more messages that ultimately yield the same hash value during the digital signature generation process --- even if it is practical to find collisions for the hash function. However, the use of randomized hashing may reduce the amount of security provided by a digital signature when all portions of the message are prepared by the signer.
fr: Le hachage aléatoire est conçu pour les situations où une partie, le préparateur du message, génère tout ou partie d'un message à signer par une seconde partie, le signataire du message. Si le préparateur du message est capable de trouver des collisions sur la fonction cryptographique de hachage (c.-à-d. deux messages produisant la même valeur une fois hachés), alors il peut préparer plusieurs versions du message, ayant un sens, qui produiront les mêmes empreintes et même signature mais avec des résultats différents (par exemple transférer 1 000 000 $ sur un compte plutôt que 10 $). Les fonctions cryptographiques de hachage ont été conçues avec comme but premier de résister aux collisions, mais la concentration actuelle d'attaques sur les fonctions de hachage peut avoir pour conséquence qu'une fonction de hachage donnée soit moins résistante qu'attendu. Le hachage aléatoire offre au signataire une protection supplémentaire en réduisant la probabilité que le préparateur puisse générer deux messages ou plus qui renverront la même empreinte lors du processus de génération de la signature — même s'il existe un moyen pratique de trouver des collisions sur la fonction de hachage. Toutefois, l'utilisation du hachage aléatoire peut réduire le niveau de sécurité fourni par une signature numérique si tous les morceaux du message sont préparés par le signataire.

source: (`NIST SP-800-106 "Randomized Hashing for Digital Signatures" <https://csrc.nist.gov/pubs/sp/800/106/final>`_)
fr: (`NIST SP-800-106 "Randomized Hashing for Digital Signatures" <https://csrc.nist.gov/pubs/sp/800/106/final>`_, article en anglais)

source: In BLAKE2 the salt is processed as a one-time input to the hash function during initialization, rather than as an input to each compression function.
fr: Dans BLAKE2, le sel est passé une seule fois lors de l'initialisation de la fonction de hachage, plutôt qu'à chaque appel de la fonction de hachage.

source: *Salted hashing* (or just hashing) with BLAKE2 or any other general-purpose cryptographic hash function, such as SHA-256, is not suitable for hashing passwords. See `BLAKE2 FAQ <https://www.blake2.net/#qa>`_ for more information.
fr: *Salted hashing* (ou un hachage simple) avec BLAKE2 ou toute autre fonction de hachage générique, comme SHA-256, ne convient pas pour obscurcir des mots de passe. Voir `la FAQ BLAKE2 <https://blake2.net/#qa>`_ (page en anglais) pour plus d'informations.

source: Personalization
fr: Personnalisation

source: Sometimes it is useful to force hash function to produce different digests for the same input for different purposes. Quoting the authors of the Skein hash function:
fr: Parfois il est utile de forcer une fonction de hachage à produire différentes empreintes de message d'une même entrée pour différentes utilisations. Pour citer les auteurs de la fonction de hachage Skein :

source: We recommend that all application designers seriously consider doing this; we have seen many protocols where a hash that is computed in one part of the protocol can be used in an entirely different part because two hash computations were done on similar or related data, and the attacker can force the application to make the hash inputs the same. Personalizing each hash function used in the protocol summarily stops this type of attack.
fr: Nous recommandons que tous les développeurs d'application considèrent sérieusement de faire cela ; nous avons vu de nombreux protocoles où une empreinte était calculée à un endroit du protocole pour être utilisée à un autre endroit car deux calculs d'empreintes étaient réalisés sur des données similaires ou liées, et qu'un attaquant peut forcer une application à prendre en entrée la même empreinte. Personnaliser chaque fonction de hachage utilisée dans le protocole stoppe immédiatement ce genre d'attaque.

source: (`The Skein Hash Function Family <https://www.schneier.com/wp-content/uploads/2016/02/skein.pdf>`_, p. 21)
fr: (`The Skein Hash Function Family <https://www.schneier.com/wp-content/uploads/2016/02/skein.pdf>`_, p. 21, article en anglais)

source: BLAKE2 can be personalized by passing bytes to the *person* argument::
fr: BLAKE2 peut être personnalisé en passant des *bytes* à l'argument *person* ::

source: Personalization together with the keyed mode can also be used to derive different keys from a single one.
fr: La personnalisation et le *keyed mode* peuvent être utilisés ensemble pour dériver différentes clés à partir d'une seule.

source: Tree mode
fr: Mode Arbre

source: Here's an example of hashing a minimal tree with two leaf nodes::
fr: L'exemple ci-dessous présente comment hacher un arbre minimal avec deux nœuds terminaux ::

source: This example uses 64-byte internal digests, and returns the 32-byte final digest::
fr: Cet exemple utilise en interne des empreintes de 64 octets, et produit finalement des empreintes 32 octets ::

source: Credits
fr: Crédits

source: BLAKE2_ was designed by *Jean-Philippe Aumasson*, *Samuel Neves*, *Zooko Wilcox-O'Hearn*, and *Christian Winnerlein* based on SHA-3_ finalist BLAKE_ created by *Jean-Philippe Aumasson*, *Luca Henzen*, *Willi Meier*, and *Raphael C.-W. Phan*.
fr: BLAKE2_ a été conçu par *Jean-Philippe Aumasson*, *Samuel Neves*, *Zooko Wilcox-O'Hearn*, et *Christian Winnerlein*. Il est basé la version BLAKE_ qui a participé à la finale de la compétition du NIST SHA-3_ créée par *Jean-Philippe Aumasson*, *Luca Henzen*, *Willi Meier*, et *Raphael C.-W. Phan*.

source: It uses core algorithm from ChaCha_ cipher designed by *Daniel J. Bernstein*.
fr: Il utilise le cœur de l'algorithme de chiffrement de ChaCha_ conçu par *Daniel J. Bernstein*.

source: The stdlib implementation is based on pyblake2_ module. It was written by *Dmitry Chestnykh* based on C implementation written by *Samuel Neves*. The documentation was copied from pyblake2_ and written by *Dmitry Chestnykh*.
fr: L'implémentation dans la bibliothèque standard est basée sur le module pyblake2_. Elle a été écrite par *Dmitry Chestnykh* et est basée sur l'implémentation C écrite par *Samuel Neves*. La documentation a été copiée depuis pyblake2_ et écrite par *Dmitry Chestnykh*.

source: The C code was partly rewritten for Python by *Christian Heimes*.
fr: Le code C a été partiellement réécrit pour Python par *Christian Heimes*.

source: The following public domain dedication applies for both C hash function implementation, extension code, and this documentation:
fr: Le transfert dans le domaine public s'applique pour l'implémentation C de la fonction de hachage, ses extensions et cette documentation :

source: To the extent possible under law, the author(s) have dedicated all copyright and related and neighboring rights to this software to the public domain worldwide. This software is distributed without any warranty.
fr: Tout en restant dans les limites de la loi, le(s) auteur(s) a (ont) donné tous les droits d’auteur et droits connexes et voisins de ce logiciel au domaine public dans le monde entier. Ce logiciel est distribué sans aucune garantie.

source: You should have received a copy of the CC0 Public Domain Dedication along with this software. If not, see https://creativecommons.org/publicdomain/zero/1.0/.
fr: Vous devriez recevoir avec ce logiciel une copie de la licence *CC0 Public Domain Dedication*. Sinon, voir https://creativecommons.org/publicdomain/zero/1.0/.

source: The following people have helped with development or contributed their changes to the project and the public domain according to the Creative Commons Public Domain Dedication 1.0 Universal:
fr: Les personnes suivantes ont aidé au développement ou contribué aux modifications du projet et au domaine public selon la licence Creative Commons Public Domain Dedication 1.0 Universal :

source: A module to generate message authentication codes using hashes.
fr: Un module pour générer des codes d'authentification utilisant des *hash*.

source: Another way to encode binary hashes for non-binary environments.
fr: Un autre moyen d'encoder des *hash* binaires dans des environnements non binaires.

source: The FIPS 180-4 publication on Secure Hash Algorithms.
fr: La publication FIPS 180-4 sur les algorithmes de hachage sécurisés.

source: The FIPS 202 publication on the SHA-3 Standard.
fr: La publication FIPS 202 sur le standard SHA-3.

source: Official BLAKE2 website.
fr: Site officiel de BLAKE2.

source: Wikipedia article with information on which algorithms have known issues and what that means regarding their use.
fr: Article Wikipedia contenant les informations relatives aux algorithmes ayant des problèmes et leur interprétation au regard de leur utilisation.

source: NIST Recommendation for Password-Based Key Derivation.
fr: Recommandations du NIST pour la dérivation de clé à partir de mot de passe (ressource en anglais).
