Repository: python/python-docs-fr
Catalog: library/hashlib.po
Languages: fr

source: :mod:`!hashlib` --- Secure hashes and message digests
fr: :mod:`hashlib` --- Algorithmes de hachage sécurisés et synthèse de messages

source: **Source code:** :source:`Lib/hashlib.py`
fr: **Code source :** :source:`Lib/hashlib.py`

source: This module implements a common interface to many different secure hash and message digest algorithms. Included are the FIPS secure hash algorithms SHA1, SHA224, SHA256, SHA384, SHA512, (defined in `the FIPS 180-4 standard`_), the SHA-3 series (defined in `the FIPS 202 standard`_) as well as RSA's MD5 algorithm (defined in internet :rfc:`1321`). The terms "secure hash" and "message digest" are interchangeable. Older algorithms were called message digests. The modern term is secure hash.
fr: Ce module implémente une interface commune à différents algorithmes de hachage sécurisés et de synthèse de messages. Sont inclus les algorithmes standards FIPS de hachage SHA1, SHA224, SHA256, SHA384, et SHA512 (définis dans FIPS 180-2), la série SHA-3 (définis dans FIPS 202), ainsi que l'algorithme MD5 de RSA (défini par la :rfc:`1321`). Les termes « algorithmes de hachage sécurisé » et « algorithme de synthèse de message » sont interchangeables. Les anciens algorithmes étaient appelés « algorithmes de synthèse de messages ». Le terme moderne est « algorithme de hachage sécurisé ».

source: If you want the adler32 or crc32 hash functions, they are available in the :mod:`zlib` module.
fr: Si vous préférez utiliser les fonctions de hachage *adler32* ou *crc32*, elles sont disponibles dans le module :mod:`zlib`.

source: Hash algorithms
fr: Algorithmes de hachage

source: There is one constructor method named for each type of :dfn:`hash`. All return a hash object with the same simple interface. For example: use :func:`sha256` to create a SHA-256 hash object. You can now feed this object with :term:`bytes-like objects <bytes-like object>` (normally :class:`bytes`) using the :meth:`update<hash.update>` method. At any point you can ask it for the :dfn:`digest` of the concatenation of the data fed to it so far using the :meth:`digest()<hash.digest>` or :meth:`hexdigest()<hash.hexdigest>` methods.
fr: Il y a un constructeur nommé selon chaque type de calcul d'empreinte (:dfn:`hash`). Tous renvoient un objet haché avec la même interface. Par exemple : utilisez :func:`sha256` pour créer un objet de calcul d'empreinte avec l'algorithme SHA-256. Vous pouvez maintenant utiliser cet objet avec des :term:`objets octets-compatibles <bytes-like object>` (normalement des :class:`bytes`) en utilisant la méthode :meth:`update<hash.update>`. À tout moment vous pouvez demander l'empreinte (aussi appelée le :dfn:`digest` ou le condensat) de la concaténation des données fournies en utilisant les méthodes :meth:`digest()<hash.digest>` ou :meth:`hexdigest()<hash.hexdigest>`.

source: To allow multithreading, the Python :term:`GIL` is released while computing a hash supplied more than 2047 bytes of data at once in its constructor or :meth:`.update<hash.update>` method.
fr: pour de meilleures performances avec de multiples fils d'exécution, le :term:`GIL` Python est relâché pour des données dont la taille est supérieure à 2047 octets lors de leur création ou leur mise à jour (méthode :meth:`.update<hash.update>`.).

source: Constructors for hash algorithms that are always present in this module are :func:`sha1`, :func:`sha224`, :func:`sha256`, :func:`sha384`, :func:`sha512`, :func:`sha3_224`, :func:`sha3_256`, :func:`sha3_384`, :func:`sha3_512`, :func:`shake_128`, :func:`shake_256`, :func:`blake2b`, and :func:`blake2s`. :func:`md5` is normally available as well, though it may be missing or blocked if you are using a rare "FIPS compliant" build of Python. These correspond to :data:`algorithms_guaranteed`.
fr: Les constructeurs pour les algorithmes de hachage qui sont toujours présents dans ce module sont :func:`sha1`, :func:`sha224`, :func:`sha256`, :func:`sha384`, :func:`sha512`, :func:`sha3_224`, :func:`sha3_256`, :func:`sha3_384`, :func:`sha3_512`, :func:`shake_128`, :func:`shake_256`, :func:`blake2b`, et :func:`blake2s`. :func:`md5` est normalement disponible aussi, mais il peut être manquant ou bloqué si vous utilisez une forme rare de Python « conforme FIPS ». Cette liste correspond au résultat de la fonction :data:`algorithms_guaranteed`.

source: Some algorithms have known hash collision weaknesses (including MD5 and SHA1). Refer to `Attacks on cryptographic hash algorithms`_ and the `hashlib-seealso`_ section at the end of this document.
fr: Certains algorithmes ont des faiblesses connues relatives à la collision (MD5 et SHA1 inclus). Se référer à `Fonction de hachage cryptographique`_ et à la section `Voir aussi`_ à la fin du document.

source: SHA3 (Keccak) and SHAKE constructors :func:`sha3_224`, :func:`sha3_256`, :func:`sha3_384`, :func:`sha3_512`, :func:`shake_128`, :func:`shake_256` were added. :func:`blake2b` and :func:`blake2s` were added.
fr: les constructeurs SHA3 (Keccak) et SHAKE :func:`sha3_224`, :func:`sha3_256`, :func:`sha3_384`, :func:`sha3_512`, :func:`shake_128`, :func:`shake_256` ont été ajoutés. :func:`blake2b` et :func:`blake2s` ont été ajoutés.

source: All hashlib constructors take a keyword-only argument *usedforsecurity* with default value ``True``. A false value allows the use of insecure and blocked hashing algorithms in restricted environments. ``False`` indicates that the hashing algorithm is not used in a security context, e.g. as a non-cryptographic one-way compression function.
fr: tous les constructeurs de *hashlib* prennent un argument mot-clé uniquement *usedforsecurity* avec la valeur par défaut ``True``. Une valeur fausse permet l'utilisation d'algorithmes de hachage non sécurisés et bloqués dans des environnements restreints. ``False`` indique que l'algorithme de hachage ne sera pas utilisé dans un contexte de sécurité, par exemple en tant que fonction de compression à sens unique non cryptographique.

source: Hashlib now uses SHA3 and SHAKE from OpenSSL if it provides it.
fr: *Hashlib* utilise désormais SHA3 et SHAKE d'OpenSSL s'il les fournit.

source: Usage
fr: Utilisation

source: More condensed:
fr: En plus condensé :

source: Constructors
fr: Constructeurs

source: Hashlib provides the following constant module attributes:
fr: *Hashlib* fournit les constantes de module suivantes :

source: A set containing the names of the hash algorithms guaranteed to be supported by this module on all platforms. Note that 'md5' is in this list despite some upstream vendors offering an odd "FIPS compliant" Python build that excludes it.
fr: Ensemble contenant les noms des algorithmes de hachage garantis d'être implémentés par ce module sur toutes les plate-formes. Notez que *md5* est dans cette liste bien que certains éditeurs diffusent une implémentation Python dont la bibliothèque « compatible FIPS » le bloque.

source: A set containing the names of the hash algorithms that are available in the running Python interpreter. These names will be recognized when passed to :func:`new`. :attr:`algorithms_guaranteed` will always be a subset. The same algorithm may appear multiple times in this set under different names (thanks to OpenSSL).
fr: Ensemble contenant les noms des algorithmes de hachage disponibles dans l'interpréteur Python. Ces noms sont reconnus lorsqu'ils sont passés à la fonction :func:`new`. :attr:`algorithms_guaranteed` est toujours un sous-ensemble. Le même algorithme peut apparaître plusieurs fois dans cet ensemble sous un nom différent (grâce à OpenSSL).

source: Hash Objects
fr: Objets de calcul d'empreinte

source: The following values are provided as constant attributes of the hash objects returned by the constructors:
fr: Les valeurs suivantes sont fournies en tant qu'attributs constants des objets de calcul d'empreintes renvoyés par les constructeurs :

source: The size of the resulting hash in bytes.
fr: La taille du *hash* résultant en octets.

source: The internal block size of the hash algorithm in bytes.
fr: La taille interne d'un bloc de l'algorithme de hachage en octets.

source: A hash object has the following attributes:
fr: L'objet de hachage possède les attributs suivants :

source: The canonical name of this hash, always lowercase and always suitable as a parameter to :func:`new` to create another hash of this type.
fr: Le nom canonique de cette fonction de hachage, toujours en minuscule et que vous pouvez toujours transmettre à la fonction :func:`new` pour créer un autre objet de calcul d'empreinte de ce type.

source: The name attribute has been present in CPython since its inception, but until Python 3.4 was not formally specified, so may not exist on some platforms.
fr: l'attribut *name* est présent dans CPython depuis sa création, mais n'était pas spécifié formellement jusqu'à Python 3.4, il peut ne pas exister sur certaines plate-formes.

source: A hash object has the following methods:
fr: L'objet de calcul d'empreinte possède les méthodes suivantes :

source: Update the hash object with the :term:`bytes-like object`. Repeated calls are equivalent to a single call with the concatenation of all the arguments: ``m.update(a); m.update(b)`` is equivalent to ``m.update(a+b)``.
fr: Met à jour l'objet de hachage avec :term:`bytes-like object`. Les appels répétés sont équivalents à un simple appel avec la concaténation de tous les arguments : ``m.update(a); m.update(b)`` est équivalent à ``m.update(a+b)``.

source: Return the digest of the data passed to the :meth:`update` method so far. This is a bytes object of size :attr:`digest_size` which may contain bytes in the whole range from 0 to 255.
fr: Renvoie l'empreinte (le *hash*) des données passées à la méthode :meth:`update`. C'est un objet de type *bytes* de taille :attr:`digest_size` qui contient des octets dans l'intervalle 0 à 255.

source: Like :meth:`digest` except the digest is returned as a string object of double length, containing only hexadecimal digits. This may be used to exchange the value safely in email or other non-binary environments.
fr: Comme la méthode :meth:`digest` sauf que l'empreinte renvoyée est une chaîne de caractères dont la longueur est double, contenant seulement des chiffres hexadécimaux. Elle peut être utilisée pour échanger sans risque des valeurs dans les *e-mails* ou dans les environnements non binaires.

source: Return a copy ("clone") of the hash object. This can be used to efficiently compute the digests of data sharing a common initial substring.
fr: Renvoie une copie ("clone") de l'objet de calcul de hachage. Cela peut être utilisé pour calculer efficacement des empreintes de données qui commencent par la même sous-chaine.

source: SHAKE variable length digests
fr: Empreintes de messages de taille variable SHAKE

source: The :func:`shake_128` and :func:`shake_256` algorithms provide variable length digests with length_in_bits//2 up to 128 or 256 bits of security. As such, their digest methods require a length. Maximum length is not limited by the SHAKE algorithm.
fr: Les algorithmes :func:`shake_128` et :func:`shake_256` produisent des empreintes (ou condensats) de longueur variable avec des ``longueurs_en_bits // 2`` jusqu'à 128 ou 256 bits. Leurs méthodes de calcul d'empreinte requièrent une longueur. Les longueurs maximales ne sont pas limitées par l'algorithme SHAKE.

source: Return the digest of the data passed to the :meth:`~hash.update` method so far. This is a bytes object of size *length* which may contain bytes in the whole range from 0 to 255.
fr: Renvoie l'empreinte des données passées à la méthode :meth:`~hash.update`. C'est un objet de type *bytes* de taille *length* qui contient des octets dans l'intervalle 0 à 255.

source: Like :meth:`digest` except the digest is returned as a string object of double length, containing only hexadecimal digits. This may be used to exchange the value in email or other non-binary environments.
fr: Comme la méthode :meth:`digest` sauf que l'empreinte renvoyée est une chaîne de caractères dont la longueur est double, contenant seulement des chiffres hexadécimaux. Elle peut être utilisée pour échanger sans risque des valeurs dans les *e-mails* ou dans les environnements non binaires.

source: Example use:
fr: Exemple :

source: File hashing
fr: Calcul d'empreinte (ou hachage) de fichiers

source: The hashlib module provides a helper function for efficient hashing of a file or file-like object.
fr: Le module *hashlib* fournit une fonction utilitaire pour calculer efficacement l'empreinte (aussi appelée condensat) d'un fichier ou d'un objet fichier-compatible.

source: Return a digest object that has been updated with contents of file object.
fr: Renvoie un objet de calcul d'empreinte qui a été mis à jour avec le contenu de *fileobj*.

source: *fileobj* must be a file-like object opened for reading in binary mode. It accepts file objects from builtin :func:`open`, :class:`~io.BytesIO` instances, SocketIO objects from :meth:`socket.socket.makefile`, and similar. The function may bypass Python's I/O and use the file descriptor from :meth:`~io.IOBase.fileno` directly. *fileobj* must be assumed to be in an unknown state after this function returns or raises. It is up to the caller to close *fileobj*.
fr: *fileobj* doit être un objet fichier-compatible ouvert en lecture en mode binaire. Sont acceptés les instances d'objets fichiers produites par la fonction native :func:`open`, :class:`~io.BytesIO`, les objets connecteurs produits par :meth:`socket.socket.makefile` et similaires. La fonction peut court-circuiter les entrées-sorties de Python et utiliser directement le descripteur de fichier de :meth:`~io.IOBase.fileno`. Vous devez supposer que *fileobj* est dans un état inconnu après le retour de cette fonction ou si elle a levé une exception. C'est à l'appelant de fermer *fileobj*.

source: *digest* must either be a hash algorithm name as a *str*, a hash constructor, or a callable that returns a hash object.
fr: *digest* doit être un nom d'algorithme de hachage fourni en tant que *str*, un constructeur de hachage ou un appelable qui renvoie un objet de hachage.

source: Example:
fr: Exemple :

source: Key derivation
fr: Dérivation de clé

source: Key derivation and key stretching algorithms are designed for secure password hashing. Naive algorithms such as ``sha1(password)`` are not resistant against brute-force attacks. A good password hashing function must be tunable, slow, and include a `salt <https://en.wikipedia.org/wiki/Salt_%28cryptography%29>`_.
fr: Les algorithmes de dérivation de clés et d'étirement de clés sont conçus pour le hachage sécurisé de mots de passe. Des algorithmes naïfs comme ``sha1(password)`` ne sont pas résistants aux attaques par force brute. Une bonne fonction de hachage doit être paramétrable, lente et inclure un `salage <https://fr.wikipedia.org/wiki/Salage_(cryptographie)>`_.

source: The function provides PKCS#5 password-based key derivation function 2. It uses HMAC as pseudorandom function.
fr: La fonction fournit une fonction de dérivation conforme à PKCS#5 (*Public Key Cryptographic Standards #5 v2.0*). Elle utilise HMAC comme fonction de génération d'un pseudo-aléa.

source: The string *hash_name* is the desired name of the hash digest algorithm for HMAC, e.g. 'sha1' or 'sha256'. *password* and *salt* are interpreted as buffers of bytes. Applications and libraries should limit *password* to a sensible length (e.g. 1024). *salt* should be about 16 or more bytes from a proper source, e.g. :func:`os.urandom`.
fr: La chaîne de caractères *hash_name* est le nom de l'algorithme de hachage désiré pour le HMAC, par exemple ``"sha1"`` ou ``"sha256"``. *password* et *salt* sont interprétés comme des tampons d'octets. Les applications et bibliothèques doivent limiter *password* à une longueur raisonnable (comme ``1024``). *salt* doit être de 16 octets ou plus et provenir d'une source correcte, e.g. :func:`os.urandom`.

source: The number of *iterations* should be chosen based on the hash algorithm and computing power. As of 2022, hundreds of thousands of iterations of SHA-256 are suggested. For rationale as to why and how to choose what is best for your application, read *Appendix A.2.2* of NIST-SP-800-132_. The answers on the `stackexchange pbkdf2 iterations question`_ explain in detail.
fr: Le nombre d'*itérations* doit être choisi en fonction de l'algorithme de hachage et de la puissance de calcul. À partir de 2022, des centaines de milliers d'itérations de SHA-256 sont suggérées. Pour savoir pourquoi et comment choisir ce qui convient le mieux à votre application, lisez *l'annexe A.2.2* du NIST-SP-800-132_ (ressource en anglais). Les réponses contenues dans la question sur le site *stackexchange* `nombre d'itérations recommandées lorsqu'on utilise pbkdf2`_ (page en anglais) expliquent tout en détail.

source: *dklen* is the length of the derived key in bytes. If *dklen* is ``None`` then the digest size of the hash algorithm *hash_name* is used, e.g. 64 for SHA-512.
fr: *dklen* est la longueur de la clé dérivée. Si *dklen* vaut ``None`` alors Python utilise la taille du condensat produit par l'algorithme de hachage *hash_name*, par exemple 64 pour SHA-512.

source: The function provides scrypt password-based key derivation function as defined in :rfc:`7914`.
fr: La fonction fournit la fonction de dérivation de clé *scrypt* comme définie dans la :rfc:`7914`.

source: *password* and *salt* must be :term:`bytes-like objects <bytes-like object>`. Applications and libraries should limit *password* to a sensible length (e.g. 1024). *salt* should be about 16 or more bytes from a proper source, e.g. :func:`os.urandom`.
fr: *password* et *salt* doivent être des :term:`objets octets-compatibles <bytes-like object>`. Les applications et bibliothèques doivent limiter *password* à une longueur raisonnable (par ex. 1024). *salt* doit être de 16 octets ou plus et provenir d'une source correcte, par ex. :func:`os.urandom`.

source: *n* is the CPU/Memory cost factor, *r* the block size, *p* parallelization factor and *maxmem* limits memory (OpenSSL 1.1.0 defaults to 32 MiB). *dklen* is the length of the derived key in bytes.
fr: *n* est le facteur de coût CPU/Mémoire, *r* la taille de bloc, *p* le facteur de parallélisation et *maxmem* limite l'utilisation de la mémoire (OpenSSL 1.1.0 limite à 32 Mio par défaut). *dklen* est la longueur de la clé dérivée en octets.

source: BLAKE2_ is a cryptographic hash function defined in :rfc:`7693` that comes in two flavors:
fr: BLAKE2_ est une fonction de hachage cryptographique définie dans la :rfc:`7693` et disponible en deux versions :

source: **BLAKE2b**, optimized for 64-bit platforms and produces digests of any size between 1 and 64 bytes,
fr: **BLAKE2b**, optimisée pour les plates-formes 64 bits et produisant des condensats de toutes tailles entre 1 et 64 octets,

source: **BLAKE2s**, optimized for 8- to 32-bit platforms and produces digests of any size between 1 and 32 bytes.
fr: **BLAKE2s**, optimisée pour les plates-formes de 8 à 32 bits et produisant des empreintes de toutes tailles entre 1 et 32 octets.

source: BLAKE2 supports **keyed mode** (a faster and simpler replacement for HMAC_), **salted hashing**, **personalization**, and **tree hashing**.
fr: BLAKE2 gère diverses fonctionnalités comme le **keyed mode** (plus rapide et plus simple que HMAC_), **salted hashing**, **personalization** et le **tree hashing**.

source: Hash objects from this module follow the API of standard library's :mod:`hashlib` objects.
fr: Les objets de calcul d'empreinte de ce module suivent l'API des objets du module :mod:`hashlib` de la bibliothèque standard.

source: Creating hash objects
fr: Création d'objets de calcul d'empreinte

source: New hash objects are created by calling constructor functions:
fr: Les nouveaux objets de calcul d'empreinte sont créés en appelant les constructeurs :

source: These functions return the corresponding hash objects for calculating BLAKE2b or BLAKE2s. They optionally take these general parameters:
fr: Ces fonctions produisent l'objet de calcul d'empreinte correspondant aux algorithmes BLAKE2b ou BLAKE2s. Elles prennent ces paramètres optionnels :

source: *data*: initial chunk of data to hash, which must be :term:`bytes-like object`. It can be passed only as positional argument.
fr: *data* : morceau initial de données à hacher, qui doit être un :term:`objet octets-compatible <bytes-like object>`. Il ne peut être passé que comme argument positionnel.

source: *digest_size*: size of output digest in bytes.
fr: *digest_size* : taille en octets de l'empreinte produite.

source: *key*: key for keyed hashing (up to 64 bytes for BLAKE2b, up to 32 bytes for BLAKE2s).
fr: *key* : clé pour les codes d'authentification de message *keyed hashing* (jusqu'à 64 octets pour BLAKE2b, jusqu'à 32 octets pour BLAKE2s).

source: *salt*: salt for randomized hashing (up to 16 bytes for BLAKE2b, up to 8 bytes for BLAKE2s).
fr: *salt* : sel pour le hachage randomisé *randomized hashing* (jusqu'à 16 octets pour BLAKE2b, jusqu'à 8 octets pour BLAKE2s).

source: *person*: personalization string (up to 16 bytes for BLAKE2b, up to 8 bytes for BLAKE2s).
fr: *person* : chaîne de personnalisation (jusqu'à 16 octets pour BLAKE2b, jusqu'à 8 octets pour BLAKE2s).

source: The following table shows limits for general parameters (in bytes):
fr: Le tableau suivant présente les limites des paramètres généraux (en octets) :

source: BLAKE2 specification defines constant lengths for salt and personalization parameters, however, for convenience, this implementation accepts byte strings of any size up to the specified length. If the length of the parameter is less than specified, it is padded with zeros, thus, for example, ``b'salt'`` and ``b'salt\x00'`` is the same value. (This is not the case for *key*.)
fr: les spécifications de BLAKE2 définissent des longueurs constantes pour les sel et chaînes de personnalisation. Toutefois, par commodité, cette implémentation accepte des chaînes d'octets de n'importe quelle taille jusqu'à la longueur spécifiée. Si la longueur du paramètre est moindre par rapport à celle spécifiée, il est complété par des zéros. Ainsi, par exemple, ``b'salt'`` et ``b'salt\x00'`` sont la même valeur (ce n'est pas le cas pour *key*).

source: These sizes are available as module `constants`_ described below.
fr: Ces tailles sont disponibles en tant que `constantes`_ du module et décrites ci-dessous.

source: Constructor functions also accept the following tree hashing parameters:
fr: Les fonctions constructeurs acceptent aussi les paramètres suivants pour le calcul d'empreintes en mode arbre :

source: *fanout*: fanout (0 to 255, 0 if unlimited, 1 in sequential mode).
fr: *fanout* : *étalement* (0 à 255, 0 si illimité, 1 correspond au mode séquentiel).

source: *depth*: maximal depth of tree (1 to 255, 255 if unlimited, 1 in sequential mode).
fr: *depth* : profondeur maximale de l'arbre (1 à 255, 255 si illimité, 1 correspond au mode séquentiel).

source: *leaf_size*: maximal byte length of leaf (0 to ``2**32-1``, 0 if unlimited or in sequential mode).
fr: *leaf_size* : taille maximale en octets d'une feuille (0 à ``2**32-1``, 0 si illimité ou en mode séquentiel).

source: *node_offset*: node offset (0 to ``2**64-1`` for BLAKE2b, 0 to ``2**48-1`` for BLAKE2s, 0 for the first, leftmost, leaf, or in sequential mode).
fr: *node_offset* : décalage du nœud (0 à ``2**64-1`` pour BLAKE2b, 0 à ``2**48-1`` pour BLAKE2s, 0 pour la première feuille la plus à gauche, ou en mode séquentiel).

source: *node_depth*: node depth (0 to 255, 0 for leaves, or in sequential mode).
fr: *node_depth* : profondeur du nœud (0 à 255, 0 pour les feuilles, ou en mode séquentiel).
