Repository: python/python-docs-fr
Catalog: library/hmac.po
Languages: fr

source: :mod:`hmac` --- Keyed-Hashing for Message Authentication
fr: :mod:`hmac` — Authentification de messages par hachage en combinaison avec une clé secrète

source: **Source code:** :source:`Lib/hmac.py`
fr: **Code source :** :source:`Lib/hmac.py`

source: This module implements the HMAC algorithm as described by :rfc:`2104`.
fr: Ce module implémente l'algorithme HMAC tel que décrit par la :rfc:`2104`.

source: Return a new hmac object. *key* is a bytes or bytearray object giving the secret key. If *msg* is present, the method call ``update(msg)`` is made. *digestmod* is the digest name, digest constructor or module for the HMAC object to use. It may be any name suitable to :func:`hashlib.new`. Despite its argument position, it is required.
fr: Renvoie un nouvel objet HMAC. *key* est un objet *byte* ou *bytearray* représentant la clé secrète. Si *msg* est présent, un appel à ``update(msg)`` est effectué. *digestmod* permet de choisir l’algorithme à utiliser par l’objet HMAC, il accepte un nom de fonction de hachage (peut être tout ce qui convient à :func:`hashlib.new`), un constructeur de fonction de hachage ou un module implémentant la PEP 247. Bien qu’il soit après *msg*, *digestmod* est un paramètre obligatoire.

source: Parameter *key* can be a bytes or bytearray object. Parameter *msg* can be of any type supported by :mod:`hashlib`. Parameter *digestmod* can be the name of a hash algorithm.
fr: Le paramètre *key* peut être un *byte* ou un objet *bytearray*. Le paramètre *msg* peut être de n'importe quel type pris en charge par :mod:`hashlib`. Le paramètre *digestmod* peut être le nom d'un algorithme de hachage.

source: MD5 as implicit default digest for *digestmod* is deprecated. The digestmod parameter is now required. Pass it as a keyword argument to avoid awkwardness when you do not have an initial msg.
fr: MD5 en tant qu’algorithme cryptographique par défaut implicite pour *digestmod* est obsolète. Le paramètre *digestmod* est maintenant requis. Passez-le en argument nommé pour éviter la bizarrerie que ça donnerait quand vous n'avez pas un *msg* initial.

source: Return digest of *msg* for given secret *key* and *digest*. The function is equivalent to ``HMAC(key, msg, digest).digest()``, but uses an optimized C or inline implementation, which is faster for messages that fit into memory. The parameters *key*, *msg*, and *digest* have the same meaning as in :func:`~hmac.new`.
fr: Renvoie le code d'authentification de *msg*, pour la clé secrète *key* et à l'algorithme *digest* donné. La fonction est équivalente à ``HMAC(key, msg, digest).digest()``, mais elle utilise une implémentation optimisée en C ou *inline*, qui est plus rapide pour les messages dont la taille leur permet de tenir en mémoire vive. Les paramètres *key*, *msg* et *digest* ont la même signification que pour :func:`~hmac.new`.

source: CPython implementation detail, the optimized C implementation is only used when *digest* is a string and name of a digest algorithm, which is supported by OpenSSL.
fr: Détail d'implémentation CPython, l'implémentation C optimisée n'est utilisée que lorsque le *digest* est une chaîne de caractères et le nom d'un algorithme de hachage implémenté dans OpenSSL.

source: An HMAC object has the following methods:
fr: Un objet HMAC a les méthodes suivantes :

source: Update the hmac object with *msg*. Repeated calls are equivalent to a single call with the concatenation of all the arguments: ``m.update(a); m.update(b)`` is equivalent to ``m.update(a + b)``.
fr: Met à jour l'objet HMAC avec *msg*. Des appels répétés sont équivalents à un seul appel avec la concaténation de tous les arguments : ``m.update(a); m.update(b)`` est équivalent à ``m.update(a + b)``.

source: Parameter *msg* can be of any type supported by :mod:`hashlib`.
fr: Le paramètre *msg* peut être de n'importe quel type géré par :mod:`hashlib`.

source: Return the digest of the bytes passed to the :meth:`update` method so far. This bytes object will be the same length as the *digest_size* of the digest given to the constructor. It may contain non-ASCII bytes, including NUL bytes.
fr: Renvoie le condensat des octets passés à la méthode :meth:`update` jusque là. L'objet *bytes* renvoyé sera de la même longueur que la *digest_size* de la fonction de hachage donnée au constructeur. Il peut contenir des octets qui ne sont pas dans la table ASCII, y compris des octets NUL.

source: When comparing the output of :meth:`digest` to an externally-supplied digest during a verification routine, it is recommended to use the :func:`compare_digest` function instead of the ``==`` operator to reduce the vulnerability to timing attacks.
fr: Si vous devez vérifier la sortie de :meth:`digest` avec un condensat obtenu par ailleurs par un service extérieur durant une routine de vérification, il est recommandé d'utiliser la fonction :func:`compare_digest` au lieu de l'opérateur ``==`` afin de réduire la vulnérabilité aux attaques temporelles.

source: When comparing the output of :meth:`hexdigest` to an externally-supplied digest during a verification routine, it is recommended to use the :func:`compare_digest` function instead of the ``==`` operator to reduce the vulnerability to timing attacks.
fr: Si l'on compare la sortie de :meth:`hexdigest` avec celle d'un condensat connu obtenu par un service extérieur durant une routine de vérification, il est recommandé d'utiliser la fonction :func:`compare_digest` au lieu de l'opérateur ``==`` afin de réduire la vulnérabilité aux attaques basées sur les temps de réponse.

source: A hash object has the following attributes:
fr: Un objet *code d'authentification de message* (HMAC) possède les attributs suivants :

source: The size of the resulting HMAC digest in bytes.
fr: La taille du code d'authentification (c-à-d de l'empreinte cryptographique) en octets.

source: The internal block size of the hash algorithm in bytes.
fr: La taille interne d'un bloc de l'algorithme de hachage en octets.

source: The canonical name of this HMAC, always lowercase, e.g. ``hmac-md5``.
fr: Le nom canonique de ce HMAC, toujours en lettres minuscules, par exemple ``hmac-md5``.

source: This module also provides the following helper function:
fr: Ce module fournit également la fonction utilitaire suivante :

source: Return ``a == b``. This function uses an approach designed to prevent timing analysis by avoiding content-based short circuiting behaviour, making it appropriate for cryptography. *a* and *b* must both be of the same type: either :class:`str` (ASCII only, as e.g. returned by :meth:`HMAC.hexdigest`), or a :term:`bytes-like object`.
fr: Renvoie ``a == b``. Cette fonction a été conçue pour prévenir les attaques temporelles en évitant l'implémentation de courts-circuits basés sur le contenu, ce qui la rend appropriée pour de la cryptographie. *a* et *b* doivent être du même type : soit :class:`str` (caractères ASCII seulement, comme retourné par :meth:`HMAC.hexdigest` par exemple), ou :term:`bytes-like object`.

source: If *a* and *b* are of different lengths, or if an error occurs, a timing attack could theoretically reveal information about the types and lengths of *a* and *b*—but not their values.
fr: Si *a* et *b* sont de longueurs différentes ou si une erreur se produit, une attaque temporelle pourrait en théorie obtenir des informations sur les types et longueurs de *a* et de *b*, mais pas sur leurs valeurs.

source: The Python module providing secure hash functions.
fr: Le module Python fournissant des fonctions de hachage sécurisé.
