Repository: python/python-docs-fr
Catalog: library/html.parser.po
Languages: fr

source: :mod:`html.parser` --- Simple HTML and XHTML parser
fr: :mod:`html.parser`— Un analyseur syntaxique simple pour HTML et XHTML

source: **Source code:** :source:`Lib/html/parser.py`
fr: **Code source :** :source:`Lib/html/parser.py`

source: This module defines a class :class:`HTMLParser` which serves as the basis for parsing text files formatted in HTML (HyperText Mark-up Language) and XHTML.
fr: Ce module définit une classe :class:`HTMLParser` qui sert de base pour l'analyse syntaxique de fichiers texte formatés HTML (*HyperText Mark-up Language*, le « langage de balisage hypertexte ») et XHTML (*EXtensible HyperText Markup Language*, le « langage extensible de balisage hypertexte »).

source: Create a parser instance able to parse invalid markup.
fr: Crée une instance d'analyseur capable de traiter tout balisage, même invalide.

source: If *convert_charrefs* is ``True`` (the default), all character references (except the ones in ``script``/``style`` elements) are automatically converted to the corresponding Unicode characters.
fr: Si *convert_charrefs* est ``True`` (valeur par défaut), toute référence de caractère (sauf ceux enchâssés dans des éléments ``script``/``style``) est automatiquement convertie en son caractère Unicode.

source: An :class:`.HTMLParser` instance is fed HTML data and calls handler methods when start tags, end tags, text, comments, and other markup elements are encountered. The user should subclass :class:`.HTMLParser` and override its methods to implement the desired behavior.
fr: Une instance de :class:`.HTMLParser` est alimentée par des données HTML. Elle fait appel à des méthodes offrant un traitement spécifique quand est rencontré un élément de balisage : balise ouvrante ou fermante, textes, commentaires… Pour implémenter le comportement désiré, l'utilisateur crée une sous-classe de :class:`.HTMLParser` en surchargeant ses méthodes.

source: This parser does not check that end tags match start tags or call the end-tag handler for elements which are closed implicitly by closing an outer element.
fr: Cet analyseur ne vérifie ni que les balises fermantes correspondent aux balises ouvrantes, ni n'invoque le gestionnaire de balises fermantes pour les éléments implicitement fermés par un élément extérieur.

source: *convert_charrefs* keyword argument added.
fr: L'argument *convert_charrefs* a été ajouté.

source: The default value for argument *convert_charrefs* is now ``True``.
fr: La valeur par défaut de l'argument *convert_charrefs* est désormais ``True``.

source: Example HTML Parser Application
fr: Exemple d'application de l'analyseur HTML

source: As a basic example, below is a simple HTML parser that uses the :class:`HTMLParser` class to print out start tags, end tags, and data as they are encountered::
fr: Comme exemple simple, un analyseur HTML minimal qui utilise la classe :class:`HTMLParser` pour afficher les balises ouvrantes, les balises fermantes ainsi que les données quand elles apparaissent ::

source: The output will then be:
fr: La sortie est alors :

source: :class:`.HTMLParser` Methods
fr: Méthodes de la classe :class:`.HTMLParser`

source: :class:`HTMLParser` instances have the following methods:
fr: Les instances de :class:`HTMLParser` disposent des méthodes suivantes :

source: Feed some text to the parser. It is processed insofar as it consists of complete elements; incomplete data is buffered until more data is fed or :meth:`close` is called. *data* must be :class:`str`.
fr: Alimente l'analyseur avec du texte. Ce texte est traité dans la mesure où il constitue des éléments complets ; les données incomplètes sont mises dans un tampon jusqu'à ce que d'autres données soient fournies ou que la méthode :meth:`close` soit appelée. L'argument *data* doit être de classe :class:`str`.

source: Force processing of all buffered data as if it were followed by an end-of-file mark. This method may be redefined by a derived class to define additional processing at the end of the input, but the redefined version should always call the :class:`HTMLParser` base class method :meth:`close`.
fr: Force le traitement de toutes les données du tampon comme si elles étaient suivies par un caractère *fin de fichier*. Cette méthode peut-être redéfinie par une classe dérivée pour ajouter des traitements supplémentaires à la fin de l'entrée, mais la version redéfinie devra impérativement appeler la méthode :meth:`close` de la classe de base :class:`HTMLParser`.

source: Reset the instance. Loses all unprocessed data. This is called implicitly at instantiation time.
fr: Réinitialise l'instance. Toutes les données non traitées sont perdues. Cette méthode est appelée implicitement lors de l'instanciation.

source: Return current line number and offset.
fr: Renvoie le numéro de ligne et le numéro du caractère dans la ligne où le curseur est positionné.

source: The following methods are called when data or markup elements are encountered and they are meant to be overridden in a subclass. The base class implementations do nothing (except for :meth:`~HTMLParser.handle_startendtag`):
fr: Les méthodes suivantes sont appelées lors de la rencontre de données ou d'éléments de balisage ; elles sont destinées à être surchargées par la sous-classe. L'implémentation de la classe de base ne fait rien (sauf pour ce qui est de :meth:`~HTMLParser.handle_startendtag`) :

source: This method is called to handle the start tag of an element (e.g. ``<div id="main">``).
fr: Cette méthode est appelée pour traiter une balise ouvrante (p. ex. ``<div id="main">``).

source: The *tag* argument is the name of the tag converted to lower case. The *attrs* argument is a list of ``(name, value)`` pairs containing the attributes found inside the tag's ``<>`` brackets. The *name* will be translated to lower case, and quotes in the *value* have been removed, and character and entity references have been replaced.
fr: L'argument *tag* contient le nom de la balise en minuscules. L'argument *attrs* contient une liste de *n-uplets* ``(name, value)`` regroupant les attributs présents entre les symboles ``<`` et ``>`` de la balise. Le paramètre *name* est converti en minuscule ; les guillemets sont supprimés du paramètre *value* et toute entité de référence ou de caractère est remplacée.

source: For instance, for the tag ``<A HREF="https://www.cwi.nl/">``, this method would be called as ``handle_starttag('a', [('href', 'https://www.cwi.nl/')])``.
fr: Par exemple, pour la balise ``<A HREF="https://www.cwi.nl/">``, cette méthode est appelée par ``handle_starttag('a', [('href', 'https://www.cwi.nl/')])``.

source: All entity references from :mod:`html.entities` are replaced in the attribute values.
fr: Toute référence d'entité présente dans :mod:`html.entities` est remplacée dans la valeur des attributs.

source: This method is called to handle the end tag of an element (e.g. ``</div>``).
fr: Cette méthode est appelée pour traiter les balises fermantes (p. ex. ``</div>``).

source: The *tag* argument is the name of the tag converted to lower case.
fr: L'argument *tag* est le nom de la balise en minuscules.

source: Similar to :meth:`handle_starttag`, but called when the parser encounters an XHTML-style empty tag (``<img ... />``). This method may be overridden by subclasses which require this particular lexical information; the default implementation simply calls :meth:`handle_starttag` and :meth:`handle_endtag`.
fr: Traitée de façon similaire à :meth:`handle_starttag`, mais appelée quand l'analyseur rencontre une balise vide de type *XHTML* (p. ex. ``<img ... />``). Cette méthode peut-être surchargée par les sous-classes demandant cette information lexicale ; l'implémentation par défaut appelle simplement :meth:`handle_starttag` et :meth:`handle_endtag`.

source: This method is called to process arbitrary data (e.g. text nodes and the content of ``<script>...</script>`` and ``<style>...</style>``).
fr: Cette méthode est appelée pour traiter toute donnée arbitraire (p. ex. les nœuds textuels ou les contenus de ``<script>...</script>`` et ``<style>...</style>``).

source: This method is called to process a named character reference of the form ``&name;`` (e.g. ``&gt;``), where *name* is a general entity reference (e.g. ``'gt'``). This method is never called if *convert_charrefs* is ``True``.
fr: Cette méthode est appelée pour traiter les références nommées de caractères de la forme ``&name;`` (p. ex. ``&gt;``), où *name* est une référence à une entité générique (p. ex. ``'gt'``). Cette méthode n'est jamais appelée si *convert_charrefs* vaut ``True``.

source: This method is called to process decimal and hexadecimal numeric character references of the form ``&#NNN;`` and ``&#xNNN;``. For example, the decimal equivalent for ``&gt;`` is ``&#62;``, whereas the hexadecimal is ``&#x3E;``; in this case the method will receive ``'62'`` or ``'x3E'``. This method is never called if *convert_charrefs* is ``True``.
fr: Cette méthode est appelée pour traiter les références de caractères décimales et hexadécimales de la forme ``&#NNN;`` et ``&#xNNN;``. Par exemple, l'équivalent décimal de ``&gt;`` est ``&#62;``, son équivalent hexadécimal étant ``&#x3E;`` ; dans ce cas, la méthode reçoit ``'62'`` or ``'x3E'``. Cette méthode n'est jamais appelée si *convert_charrefs* est ``True``.

source: This method is called when a comment is encountered (e.g. ``<!--comment-->``).
fr: Cette méthode est appelée quand un commentaire (p. ex. ``<!--commentaire-->``) est rencontré.

source: For example, the comment ``<!-- comment -->`` will cause this method to be called with the argument ``' comment '``.
fr: Par exemple, le commentaire ``<!-- commentaire -->`` provoque l'appel de cette méthode avec l'argument ``' commentaire '``.

source: The content of Internet Explorer conditional comments (condcoms) will also be sent to this method, so, for ``<!--[if IE 9]>IE9-specific content<![endif]-->``, this method will receive ``'[if IE 9]>IE9-specific content<![endif]'``.
fr: Le contenu des commentaires conditionnels d'Internet Explorer (*condcoms*) ne sont pas traités de manière particulière par l'analyseur. Ils sont passés à cette méthode comme tous les autres commentaires. Ainsi, pour ``<!--[if IE 9]>Contenu spécifique à IE9<![endif]-->``, cette méthode sera appelée avec ``'[if IE 9]>Contenu spécifique à IE9<![endif]'``.

source: This method is called to handle an HTML doctype declaration (e.g. ``<!DOCTYPE html>``).
fr: Cette méthode est appelée pour traiter la déclaration *doctype* de HTML (p. ex. ``<!DOCTYPE html>``).

source: The *decl* parameter will be the entire contents of the declaration inside the ``<!...>`` markup (e.g. ``'DOCTYPE html'``).
fr: Le paramètre *decl* contient la totalité de la déclaration contenue dans le balisage ``<!...>`` (p. ex. ``'DOCTYPE html'``).

source: Method called when a processing instruction is encountered. The *data* parameter will contain the entire processing instruction. For example, for the processing instruction ``<?proc color='red'>``, this method would be called as ``handle_pi("proc color='red'")``. It is intended to be overridden by a derived class; the base class implementation does nothing.
fr: Méthode appelée quand une instruction de traitement est rencontrée. Le paramètre *data* contient la totalité de l'instruction de traitement. Par exemple, pour l'instruction de traitement ``<?proc color='rouge'>``, cette méthode est appelée par ``handle_pi("proc color='rouge'")``. Elle est destinée à être surchargée dans une classe dérivée ; la classe de base ne réalise aucun traitement.

source: The :class:`HTMLParser` class uses the SGML syntactic rules for processing instructions. An XHTML processing instruction using the trailing ``'?'`` will cause the ``'?'`` to be included in *data*.
fr: La classe :class:`HTMLParser` utilise les règles syntaxiques de **SGML** pour traiter les instructions de traitement. Une instruction de traitement *XHTML* utilisant une terminaison en ``'?'`` se traduit par l'inclusion de ce ``'?'`` dans *data*.

source: This method is called when an unrecognized declaration is read by the parser.
fr: Cette méthode est appelée quand une déclaration non reconnue est lue par l'analyseur.

source: The *data* parameter will be the entire contents of the declaration inside the ``<![...]>`` markup. It is sometimes useful to be overridden by a derived class. The base class implementation does nothing.
fr: Le paramètre *data* contient toute la déclaration enchâssée dans le balisage ``<![...]>``. Il est parfois utile de le surcharger dans une classe dérivée. L'implémentation de la classe de base ne réalise aucune opération.

source: Examples
fr: Exemples

source: The following class implements a parser that will be used to illustrate more examples::
fr: La classe suivante implémente un analyseur qui est utilisé dans les exemples ci-dessous ::

source: Parsing a doctype::
fr: Traitement du *doctype* ::

source: Parsing an element with a few attributes and a title::
fr: Analyse d'un élément avec un titre et des attributs ::

source: The content of ``script`` and ``style`` elements is returned as is, without further parsing::
fr: Le contenu des éléments ``script`` et ``style`` est renvoyé tel quel (sans autre traitement) ::

source: Parsing comments::
fr: Traitement des commentaires ::

source: Parsing named and numeric character references and converting them to the correct char (note: these 3 references are all equivalent to ``'>'``)::
fr: L'analyse des caractères nommés et des références numériques de caractères et leur conversion en leur caractère correct (note : ces trois références sont équivalentes à ``'>'``) ::

source: Feeding incomplete chunks to :meth:`~HTMLParser.feed` works, but :meth:`~HTMLParser.handle_data` might be called more than once (unless *convert_charrefs* is set to ``True``)::
fr: Il est possible de fournir des portions de code incomplètes à :meth:`~HTMLParser.feed`, mais alors il est possible que :meth:`~HTMLParser.handle_data` soit appelée plusieurs fois, à moins que *convert_charrefs* soit ``True`` ::

source: Parsing invalid HTML (e.g. unquoted attributes) also works::
fr: L'analyse de code *HTML* non valide (p. ex. des attributs sans guillemets) fonctionne également ::
