Repository: python/python-docs-fr
Catalog: library/http.client.po
Languages: fr

source: :mod:`http.client` --- HTTP protocol client
fr: :mod:`http.client` — Client pour le protocole HTTP

source: **Source code:** :source:`Lib/http/client.py`
fr: **Code source :** :source:`Lib/http/client.py`

source: The `Requests package <https://requests.readthedocs.io/en/master/>`_ is recommended for a higher-level HTTP client interface.
fr: Le paquet `Requests <https://requests.readthedocs.io/en/master/>`_ est recommandé pour une interface client HTTP de plus haut niveau.

source: HTTPS support is only available if Python was compiled with SSL support (through the :mod:`ssl` module).
fr: L'implémentation d'HTTPS n'est disponible que si Python a été compilé avec la prise en charge de SSL (au moyen du module :mod:`ssl`).

source: The module provides the following classes:
fr: Le module fournit les classes suivantes :

source: For example, the following calls all create instances that connect to the server at the same host and port::
fr: Par exemple, tous les appels suivants créent des instances qui se connectent à un serveur sur le même hôte et le même port ::

source: *source_address* was added.
fr: Le paramètre *source_address* a été ajouté.

source: *blocksize* parameter was added.
fr: Le paramètre *blocksize* a été ajouté.

source: A subclass of :class:`HTTPConnection` that uses SSL for communication with secure servers. Default port is ``443``. If *context* is specified, it must be a :class:`ssl.SSLContext` instance describing the various SSL options.
fr: Cette sous-classe de :class:`HTTPConnection` utilise SSL pour communiquer avec des serveurs sécurisés. Le port par défaut est ``443``. Si le paramètre *context* est fourni, ce doit être une instance de :class:`ssl.SSLContext` décrivant les diverses options SSL.

source: Please read :ref:`ssl-security` for more information on best practices.
fr: Il est conseillé de lire :ref:`ssl-security` pour plus d'informations sur les bonnes pratiques.

source: *source_address*, *context* and *check_hostname* were added.
fr: Les paramètres *source_address*, *context* et *check_hostname* ont été ajoutés.

source: This class now supports HTTPS virtual hosts if possible (that is, if :data:`ssl.HAS_SNI` is true).
fr: Cette classe implémente désormais les hôtes virtuels HTTPS dans la mesure du possible (c'est-à-dire si :data:`ssl.HAS_SNI` est vrai).

source: The *strict* parameter was removed. HTTP 0.9-style "Simple Responses" are no longer supported.
fr: Le paramètre *strict* a été supprimé. Les « réponses simples » de HTTP 0.9 ne sont plus prises en charge.

source: This class now performs all the necessary certificate and hostname checks by default. To revert to the previous, unverified, behavior :func:`ssl._create_unverified_context` can be passed to the *context* parameter.
fr: Cette classe réalise maintenant par défaut toutes les vérifications de certificat et de nom d'hôte. Pour revenir au comportement antérieur, sans vérification, :func:`ssl._create_unverified_context` peut être passé au paramètre *context*.

source: This class now enables TLS 1.3 :attr:`ssl.SSLContext.post_handshake_auth` for the default *context* or when *cert_file* is passed with a custom *context*.
fr: Cette classe sélectionne désormais TLS 1.3 pour :attr:`ssl.SSLContext.post_handshake_auth` dans le *context* par défaut ou quand *cert_file* est fourni avec une valeur de *context* personnalisée.

source: This class now sends an ALPN extension with protocol indicator ``http/1.1`` when no *context* is given. Custom *context* should set ALPN protocols with :meth:`~ssl.SSLContext.set_alpn_protocol`.
fr: Cette classe envoie désormais une extension ALPN avec un indicateur de protocole ``http/1.1`` quand *context* n'est pas fourni. Un *context* personnalisé doit définir les protocoles ALPN avec :meth:`~ssl.SSLContext.set_alpn_protocol`.

source: *key_file* and *cert_file* are deprecated in favor of *context*. Please use :meth:`ssl.SSLContext.load_cert_chain` instead, or let :func:`ssl.create_default_context` select the system's trusted CA certificates for you.
fr: Les paramètres *key_file* et *cert_file* sont rendus obsolètes par *context*. Veuillez plutôt utiliser :meth:`ssl.SSLContext.load_cert_chain`, ou laissez :func:`ssl.create_default_context` sélectionner les certificats racines de confiance du système pour vous.

source: The *check_hostname* parameter is also deprecated; the :attr:`ssl.SSLContext.check_hostname` attribute of *context* should be used instead.
fr: Le paramètre *check_hostname* est de même obsolète : utilisez l'attribut :attr:`ssl.SSLContext.check_hostname` de *context* à la place.

source: Class whose instances are returned upon successful connection. Not instantiated directly by user.
fr: Classe dont les instances sont renvoyées dès qu'une connexion est établie. Cette classe n'est jamais instanciée directement par l'utilisateur.

source: The *strict* parameter was removed. HTTP 0.9 style "Simple Responses" are no longer supported.
fr: Le paramètre *strict* a été supprimé. Les « réponses simples » de HTTP 0.9 ne sont plus prises en charge.

source: This module provides the following function:
fr: Ce module fournit les fonctions suivantes :

source: Parse the headers from a file pointer *fp* representing a HTTP request/response. The file has to be a :class:`BufferedIOBase` reader (i.e. not text) and must provide a valid :rfc:`2822` style header.
fr: Analyse les en-têtes à partir d'un pointeur de fichier *fp* représentant une requête/réponse HTTP. Le fichier doit être un lecteur de classe :class:`BufferedIOBase` (c'est-à-dire non textuel) et doit impérativement renvoyer un en-tête valide selon la :rfc:`2822`.

source: This function returns an instance of :class:`http.client.HTTPMessage` that holds the header fields, but no payload (the same as :attr:`HTTPResponse.msg` and :attr:`http.server.BaseHTTPRequestHandler.headers`). After returning, the file pointer *fp* is ready to read the HTTP body.
fr: Cette fonction renvoie une instance de :class:`http.client.HTTPMessage` qui contient les champs d'en-tête, mais pas la charge utile (de même que :attr:`HTTPResponse.msg` et :attr:`http.server.BaseHTTPRequestHandler.headers`). Après le retour, le pointeur de fichier *fp* est prêt à lire le corps HTTP.

source: :meth:`parse_headers` does not parse the start-line of a HTTP message; it only parses the ``Name: value`` lines. The file has to be ready to read these field lines, so the first line should already be consumed before calling the function.
fr: La méthode :meth:`parse_headers` n'analyse pas la ligne initiale d'un message HTTP ; elle n'analyse que les lignes ``Name: value``. Le fichier doit être prêt à lire ces lignes de champs, aussi la première ligne doit déjà avoir été consommée avant l'appel de la fonction.

source: The following exceptions are raised as appropriate:
fr: Les exceptions suivantes sont levées selon les cas :

source: The base class of the other exceptions in this module. It is a subclass of :exc:`Exception`.
fr: La classe de base des autres exceptions de ce module. C'est une sous-classe de :exc:`Exception`.

source: A subclass of :exc:`HTTPException`.
fr: Sous-classe de :exc:`HTTPException`.

source: A subclass of :exc:`HTTPException`, raised if a port is given and is either non-numeric or empty.
fr: Sous-classe de :exc:`HTTPException`, levée si le port donné n'est pas numérique ou est vide.

source: A subclass of :exc:`ImproperConnectionState`.
fr: Sous-classe de :exc:`ImproperConnectionState`.

source: A subclass of :exc:`HTTPException`. Raised if a server responds with a HTTP status code that we don't understand.
fr: Sous-classe de :exc:`HTTPException`. Levée si un serveur répond avec un code d'état HTTP qui n'est pas compris.

source: A subclass of :exc:`HTTPException`. Raised if an excessively long line is received in the HTTP protocol from the server.
fr: Sous-classe de :exc:`HTTPException`. Levée si une ligne du protocole HTTP est excessivement longue dans ce qui provient du serveur.

source: A subclass of :exc:`ConnectionResetError` and :exc:`BadStatusLine`. Raised by :meth:`HTTPConnection.getresponse` when the attempt to read the response results in no data read from the connection, indicating that the remote end has closed the connection.
fr: Sous-classe de :exc:`ConnectionResetError` et :exc:`BadStatusLine`. Levée par la méthode :meth:`HTTPConnection.getresponse` quand la tentative de lire la réponse n'aboutit à aucune donnée provenant de la connexion, indiquant ainsi que la partie distante a fermé celle-ci.

source: Previously, :exc:`BadStatusLine`\ ``('')`` was raised.
fr: Antérieurement, :exc:`BadStatusLine`\ ``('')`` était levée.

source: The constants defined in this module are:
fr: Les constantes définies dans ce module sont :

source: The default port for the HTTP protocol (always ``80``).
fr: Le port par défaut du protocole HTTP (toujours ``80``).

source: The default port for the HTTPS protocol (always ``443``).
fr: Le port par défaut du protocole HTTPS (toujours ``443``).

source: This dictionary maps the HTTP 1.1 status codes to the W3C names.
fr: Ce dictionnaire associe les codes d'états HTTP 1.1 à leurs noms tels que définis par le W3C.

source: Example: ``http.client.responses[http.client.NOT_FOUND]`` is ``'Not Found'``.
fr: Par exemple : ``http.client.responses[http.client.NOT_FOUND]`` est ``'Not Found'``.

source: See :ref:`http-status-codes` for a list of HTTP status codes that are available in this module as constants.
fr: Voir :ref:`http-status-codes` pour une liste des codes d'état HTTP qui sont disponibles comme constantes dans ce module.

source: HTTPConnection Objects
fr: Les objets HTTPConnection

source: :class:`HTTPConnection` instances have the following methods:
fr: Les instances de la classe :class:`HTTPConnection` possèdent les méthodes suivantes :

source: This will send a request to the server using the HTTP request method *method* and the selector *url*.
fr: Envoie une requête à un serveur en utilisant la méthode *method* de requête HTTP et le sélecteur *url*.

source: If *body* is specified, the specified data is sent after the headers are finished. It may be a :class:`str`, a :term:`bytes-like object`, an open :term:`file object`, or an iterable of :class:`bytes`. If *body* is a string, it is encoded as ISO-8859-1, the default for HTTP. If it is a bytes-like object, the bytes are sent as is. If it is a :term:`file object`, the contents of the file is sent; this file object should support at least the ``read()`` method. If the file object is an instance of :class:`io.TextIOBase`, the data returned by the ``read()`` method will be encoded as ISO-8859-1, otherwise the data returned by ``read()`` is sent as is. If *body* is an iterable, the elements of the iterable are sent as is until the iterable is exhausted.
fr: Si *body* est passé en paramètre, les données transmises sont envoyées à la suite des en-têtes. Ce paramètre peut-être une :class:`str`, un :term:`objet octet-comptatible <bytes-like object>`, un :term:`objet fichier <file object>` préalablement ouvert, ou un itérable de classe :class:`bytes`. Si *body* est une chaîne, elle est encodée en ISO-8859-1, valeur par défaut pour HTTP. Si c'est un objet octet-compatible, les octets sont envoyés tels quels. Si c'est un :term:`objet fichier <file object>`, le contenu du fichier est envoyé ; cet objet fichier doit implémenter au moins la méthode ``read()``. Si l'objet fichier est une instance de :class:`io.TextIOBase`, les données renvoyées par la méthode ``read()`` sont encodées en ISO-8859-1, sinon les données renvoyées par ``read()`` sont envoyées telles quelles. Si *body* est un itérable, les éléments de cet itérable sont envoyés jusqu'à ce que l'itérable soit vide.

source: The *headers* argument should be a mapping of extra HTTP headers to send with the request.
fr: L'argument *headers* doit contenir les en-têtes HTTP supplémentaires sous forme de dictionnaire. Ces en-têtes sont transmis dans la requête.

source: If *headers* contains neither Content-Length nor Transfer-Encoding, but there is a request body, one of those header fields will be added automatically. If *body* is ``None``, the Content-Length header is set to ``0`` for methods that expect a body (``PUT``, ``POST``, and ``PATCH``). If *body* is a string or a bytes-like object that is not also a :term:`file <file object>`, the Content-Length header is set to its length. Any other type of *body* (files and iterables in general) will be chunk-encoded, and the Transfer-Encoding header will automatically be set instead of Content-Length.
fr: Si *headers* ne contient ni ``Content-Length:`` ni ``Transfer-Encoding:``, mais qu'un corps de requête est fourni, un de ces en-têtes est ajouté automatiquement. Si *body* est ``None``, l'en-tête ``Content-Length:`` est paramétré à ``0`` pour les méthodes qui attendent un corps (``PUT``, ``POST``, et ``PATCH``). Si *body* est une chaîne ou un objet de type octets qui n'est pas un (:term:`objet fichier <file object>`), l'en-tête ``Content-Length`` est paramétré à sa longueur. Un *body* de tout autre type (fichiers ou itérables en général) est encodé par morceaux et l'en-tête ``Transfer-Encoding`` est automatiquement paramétré à la place de ``Content-Length``.

source: The *encode_chunked* argument is only relevant if Transfer-Encoding is specified in *headers*. If *encode_chunked* is ``False``, the HTTPConnection object assumes that all encoding is handled by the calling code. If it is ``True``, the body will be chunk-encoded.
fr: L'argument *encode_chunked* n'est pertinent que si l'en-tête ``Transfer-Encoding:`` est présent. Si *encode_chunked* est ``False``, l'objet HTTPConnection suppose que l'encodage est géré par le code d'appel. S'il vaut ``True``, le corps est encodé par morceaux.

source: Chunked transfer encoding has been added to the HTTP protocol version 1.1. Unless the HTTP server is known to handle HTTP 1.1, the caller must either specify the Content-Length, or must pass a :class:`str` or bytes-like object that is not also a file as the body representation.
fr: L'encodage pour les transferts par morceaux a été ajouté à la version 1.1 du protocole HTTP. À moins que le serveur HTTP sache gérer HTTP 1.1, l'appelant doit soit spécifier l'en-tête ``Content-Length:``, soit passer la représentation du corps de message dans un objet de classe :class:`str` ou un objet octet-compatible qui ne soit pas un fichier.

source: *body* can now be an iterable.
fr: *body* peut désormais être un itérable.

source: If neither Content-Length nor Transfer-Encoding are set in *headers*, file and iterable *body* objects are now chunk-encoded. The *encode_chunked* argument was added. No attempt is made to determine the Content-Length for file objects.
fr: Si parmi les en-têtes ne figure ni ``Content-Length:``, ni ``Transfer-Encoding:``, les objets fichiers et itérables *body* sont désormais encodés par morceaux. L'argument *encode_chunked* a été ajouté. Aucune tentative n'est faite pour essayer de déterminer la valeur de l'en-tête ``Content-Length`` pour un objet fichier.

source: Should be called after a request is sent to get the response from the server. Returns an :class:`HTTPResponse` instance.
fr: Doit être appelé après qu'une requête a été envoyée pour récupérer la réponse du serveur. Renvoie une instance de :class:`HTTPResponse`.

source: Note that you must have read the whole response before you can send a new request to the server.
fr: Notez que la totalité de la réponse doit être lue avant de pouvoir envoyer une nouvelle requête au serveur.

source: If a :exc:`ConnectionError` or subclass is raised, the :class:`HTTPConnection` object will be ready to reconnect when a new request is sent.
fr: Si une exception :exc:`ConnectionError` ou une de ses sous-classes est levée, l'objet de classe :class:`HTTPConnection` sera prêt à se reconnecter quand une nouvelle requête sera envoyée.

source: Set the debugging level. The default debug level is ``0``, meaning no debugging output is printed. Any value greater than ``0`` will cause all currently defined debug output to be printed to stdout. The ``debuglevel`` is passed to any new :class:`HTTPResponse` objects that are created.
fr: Règle le niveau de débogage. Le niveau de débogage par défaut est ``0`` (aucune sortie de débogage n'est affichée). Toute valeur plus grande que ``0`` provoque l'affichage sur ``sys.stdout`` de toutes les sorties de débogage actuellement définies. Le paramètre ``debuglevel`` est passé à tout nouvel objet de classe :class:`HTTPResponse` qui est créé.

source: Set the host and the port for HTTP Connect Tunnelling. This allows running the connection through a proxy server.
fr: Paramètre l'hôte et le port pour le tunnel de connexion HTTP. Il permet de réaliser la connexion au travers d'un serveur mandataire.

source: The host and port arguments specify the endpoint of the tunneled connection (i.e. the address included in the CONNECT request, *not* the address of the proxy server).
fr: Les arguments d'hôte et de port indiquent le point de terminaison de la connexion par tunnel (c'est-à-dire l'adresse incluse dans la requête CONNECT, et non l'adresse du serveur mandataire).

source: The headers argument should be a mapping of extra HTTP headers to send with the CONNECT request.
fr: L'argument *headers* doit contenir les en-têtes HTTP supplémentaires sous forme d'un dictionnaire. Ceux-ci seront envoyés avec la requête CONNECT.

source: For example, to tunnel through a HTTPS proxy server running locally on port 8080, we would pass the address of the proxy to the :class:`HTTPSConnection` constructor, and the address of the host that we eventually want to reach to the :meth:`~HTTPConnection.set_tunnel` method::
fr: Par exemple, pour un tunnel traversant un serveur mandataire HTTPS accessible localement sur le port 8080, nous devons passer l'adresse du serveur mandataire au constructeur de la classe :class:`HTTPSConnection`, en plus de l'éventuelle adresse de l'hôte que nous voulons atteindre, qui elle doit être passée à la méthode :meth:`~HTTPConnection.set_tunnel` ::

source: Connect to the server specified when the object was created. By default, this is called automatically when making a request if the client does not already have a connection.
fr: Se connecte au serveur spécifié quand l'objet est créé. Par défaut, est appelée automatiquement lorsqu'une requête est faite alors que le client ne s'est pas connecté au préalable.

source: Raises an :ref:`auditing event <auditing>` ``http.client.connect`` with arguments ``self``, ``host``, ``port``.
fr: Lève un :ref:`évènement d'audit <auditing>` ``http.client.connect`` contenant les arguments ``self``, ``host``, ``port``.

source: Close the connection to the server.
fr: Ferme la connexion au serveur.

source: Buffer size in bytes for sending a file-like message body.
fr: Taille en octets du tampon utilisé pour transmettre un corps de message de type fichier.

source: As an alternative to using the :meth:`request` method described above, you can also send your request step by step, by using the four functions below.
fr: Plutôt que d'utiliser la méthode :meth:`request` décrite plus haut, il est également possible d'envoyer une requête étape par étape en utilisant les quatre fonctions ci-dessous.

source: This should be the first call after the connection to the server has been made. It sends a line to the server consisting of the *method* string, the *url* string, and the HTTP version (``HTTP/1.1``). To disable automatic sending of ``Host:`` or ``Accept-Encoding:`` headers (for example to accept additional content encodings), specify *skip_host* or *skip_accept_encoding* with non-False values.
fr: Ce doit être le premier appel une fois que la connexion au serveur a été réalisée. Est envoyée au serveur une ligne consistant en la chaîne *method*, la chaîne d'*url*, et la version du protocole HTTP (``HTTP/1.1``). Pour désactiver l'envoi automatique des en-têtes ``Host:`` ou ``Accept-Encoding:`` (par exemple pour accepter des encodages supplémentaires de contenus), il est nécessaire de passer les paramètres *skip_host* ou *skip_accept_encoding* avec des valeurs différentes de ``False``.

source: Send an :rfc:`822`\ -style header to the server. It sends a line to the server consisting of the header, a colon and a space, and the first argument. If more arguments are given, continuation lines are sent, each consisting of a tab and an argument.
fr: Envoie un en-tête de style :rfc:`822` au serveur. Elle envoie au serveur une ligne regroupant un en-tête, une espace, un ``:``, une espace et le premier argument. Si plusieurs arguments sont donnés, des lignes de continuation sont envoyées, chacune d'elle étant constituée d'une espace suivie d'un argument.

source: Send a blank line to the server, signalling the end of the headers. The optional *message_body* argument can be used to pass a message body associated with the request.
fr: Envoie une ligne blanche au serveur, signalant la fin des en-têtes. L'argument optionnel *message_body* peut-être utilisé pour passer le corps du message associé à la requête.

source: If *encode_chunked* is ``True``, the result of each iteration of *message_body* will be chunk-encoded as specified in :rfc:`7230`, Section 3.3.1. How the data is encoded is dependent on the type of *message_body*. If *message_body* implements the :ref:`buffer interface <bufferobjects>` the encoding will result in a single chunk. If *message_body* is a :class:`collections.abc.Iterable`, each iteration of *message_body* will result in a chunk. If *message_body* is a :term:`file object`, each call to ``.read()`` will result in a chunk. The method automatically signals the end of the chunk-encoded data immediately after *message_body*.
fr: Si *encode_chunked* est ``True``, le résultat de chaque itération sur *message_body* est un morceau encodé selon la :rfc:`7230`, section 3.3.1. La façon dont les données sont encodées dépend du type de *message_body*. Si *message_body* implémente l':ref:`interface tampon <bufferobjects>` l'encodage donne un unique morceau. Si *message_body* est un itérable de classe :class:`collections.abc.Iterable`, chaque itération sur *message_body* donne un morceau. Si *message_body* est un :term:`fichier objet <file object>`, chaque appel à ``.read()`` renvoie un morceau. La méthode signale automatiquement la fin des données encodées par morceaux immédiatement après *message_body*.

source: Due to the chunked encoding specification, empty chunks yielded by an iterator body will be ignored by the chunk-encoder. This is to avoid premature termination of the read of the request by the target server due to malformed encoding.
fr: Selon la spécification de l'encodage des morceaux, les morceaux vides renvoyés par un itérateur associé au corps du message sont ignorés par l'encodeur de morceaux. Ce comportement est choisi pour éviter que la lecture de la requête par le serveur cible ne se termine prématurément pour cause d'encodage mal formé.

source: Chunked encoding support. The *encode_chunked* parameter was added.
fr: Implémentation de l'encodage (pour les transferts) par morceaux. Le paramètre *encode_chunked* a été ajouté.

source: Send data to the server. This should be used directly only after the :meth:`endheaders` method has been called and before :meth:`getresponse` is called.
fr: Envoie les données au serveur. Elle ne peut être utilisée directement qu'une fois la méthode :meth:`endheaders` a été appelée et avant que la méthode :meth:`getresponse` ait été appelée.

source: Raises an :ref:`auditing event <auditing>` ``http.client.send`` with arguments ``self``, ``data``.
fr: Lève un :ref:`évènement d'audit <auditing>` ``http.client.send`` avec comme arguments ``self``, ``data``.

source: HTTPResponse Objects
fr: Les objets HTTPResponse
