Repository: python/python-docs-fr
Catalog: library/http.client.po
Languages: fr

source: An :class:`HTTPResponse` instance wraps the HTTP response from the server. It provides access to the request headers and the entity body. The response is an iterable object and can be used in a with statement.
fr: Une instance de :class:`HTTPResponse` encapsule la réponse HTTP du serveur. Elle fournit un accès aux en-têtes et au corps de la réponse. La réponse est un objet itérable pouvant être utilisé avec l'instruction ``with``.

source: The :class:`io.BufferedIOBase` interface is now implemented and all of its reader operations are supported.
fr: L'interface de la classe :class:`io.BufferedIOBase` est désormais implémentée et toutes ses opérations de lecture sont gérées.

source: Reads and returns the response body, or up to the next *amt* bytes.
fr: Lit et renvoie soit tout le corps de la réponse soit une partie de celui-ci se limitant aux *amt* octets suivants.

source: Reads up to the next len(b) bytes of the response body into the buffer *b*. Returns the number of bytes read.
fr: Lit les prochains ``len(b)`` octets du corps de la réponse et les place dans le tampon *b*. Renvoie le nombre d'octets lus.

source: Return a list of (header, value) tuples.
fr: Renvoie une liste d'*n*-uplets ``(en-tête, valeur)``.

source: Return the ``fileno`` of the underlying socket.
fr: Renvoie le ``fileno`` du connecteur réseau sous-jacent.

source: A :class:`http.client.HTTPMessage` instance containing the response headers. :class:`http.client.HTTPMessage` is a subclass of :class:`email.message.Message`.
fr: Une instance de :class:`http.client.HTTPMessage` contenant les en-têtes de la réponse. La classe :class:`http.client.HTTPMessage` est une sous-classe de la classe :class:`email.message.Message`.

source: HTTP protocol version used by server. 10 for HTTP/1.0, 11 for HTTP/1.1.
fr: La version du protocole HTTP utilisée par le serveur : 10 pour HTTP/1.0, 11 pour HTTP/1.1.

source: URL of the resource retrieved, commonly used to determine if a redirect was followed.
fr: L'URL de la ressource récupérée, utilisée habituellement pour déterminer si une redirection a été suivie.

source: Headers of the response in the form of an :class:`email.message.EmailMessage` instance.
fr: Les en-têtes de la réponse sous la forme d'une instance de :class:`email.message.EmailMessage`.

source: Status code returned by server.
fr: Code d'état renvoyé par le serveur.

source: Reason phrase returned by server.
fr: Phrase renvoyée par le serveur et indiquant la cause.

source: A debugging hook. If :attr:`debuglevel` is greater than zero, messages will be printed to stdout as the response is read and parsed.
fr: Un point d'entrée pour débogage. Si :attr:`debuglevel` est plus grand que zéro, les messages sont envoyés à ``sys.stdout`` pendant la lecture et l'analyse de la réponse.

source: Is ``True`` if the stream is closed.
fr: Vaut ``True`` si le flux est terminé.

source: Deprecated in favor of :attr:`~HTTPResponse.url`.
fr: Rendu obsolète par :attr:`~HTTPResponse.url`.

source: Deprecated in favor of :attr:`~HTTPResponse.headers`.
fr: Rendu obsolète par :attr:`~HTTPResponse.headers`.

source: Deprecated in favor of :attr:`~HTTPResponse.status`.
fr: Rendu obsolète par :attr:`~HTTPResponse.status`.

source: Examples
fr: Exemples

source: Here is an example session that uses the ``GET`` method::
fr: Voici un exemple de session utilisant la méthode ``GET`` ::

source: Here is an example session that uses the ``HEAD`` method. Note that the ``HEAD`` method never returns any data. ::
fr: Voici un exemple de session utilisant la méthode ``HEAD``. Notez que la méthode ``HEAD`` ne renvoie jamais de données. ::

source: HTTPMessage Objects
fr: Les objets HTTPMessage

source: An :class:`http.client.HTTPMessage` instance holds the headers from an HTTP response. It is implemented using the :class:`email.message.Message` class.
fr: Une instance de classe :class:`http.client.HTTPMessage` contient les en-têtes d'une réponse HTTP. Elle est implémentée en utilisant la classe :class:`email.message.Message`.
