Repository: python/python-docs-fr
Catalog: library/idle.po
Languages: fr

source: IDLE assumes that files with a known .py* extension contain Python code and that other files do not. Run Python code with the Run menu.
fr: *IDLE* suppose que les fichiers avec une extension en *.py\** reconnue contiennent du code Python, mais pas les autres fichiers. Exécutez du code Python avec le menu *Run*.

source: Key bindings
fr: Raccourcis clavier

source: In this section, 'C' refers to the :kbd:`Control` key on Windows and Unix and the :kbd:`Command` key on macOS.
fr: Dans cette section, *"C"* renvoie à la touche :kbd:`Contrôle`sous Windows et *Unix* et à la touche :kbd:`Commande` sous *macOS*.

source: :kbd:`Backspace` deletes to the left; :kbd:`Del` deletes to the right
fr: :kbd:`Retour arrière` supprime à gauche ; :kbd:`Suppr` supprime à droite

source: :kbd:`C-Backspace` delete word left; :kbd:`C-Del` delete word to the right
fr: :kbd:`C-Retour arrière` supprime le mot à gauche ; :kbd:`C-Suppr` supprime le mot à droite

source: Arrow keys and :kbd:`Page Up`/:kbd:`Page Down` to move around
fr: Utilisez les touches flèche et :kbd:`Page Haut` / :kbd:`Page Bas` pour vous déplacer

source: :kbd:`C-LeftArrow` and :kbd:`C-RightArrow` moves by words
fr: :kbd:`C-Flèche Gauche` et :kbd:`C-Flèche Droite` déplacent de mot en mot

source: :kbd:`Home`/:kbd:`End` go to begin/end of line
fr: :kbd:`Début`/:kbd:`Fin` vont au début / à la fin de la ligne

source: :kbd:`C-Home`/:kbd:`C-End` go to begin/end of file
fr: :kbd:`C-Début` / :kbd:`C-Fin` vont au début / à la fin du fichier

source: Some useful Emacs bindings are inherited from Tcl/Tk:
fr: Quelques raccourcis *Emacs* utiles sont hérités de *Tcl/Tk* :

source: :kbd:`C-a` beginning of line
fr: :kbd:`C-a` début de ligne

source: :kbd:`C-e` end of line
fr: :kbd:`C-e` fin de ligne

source: :kbd:`C-k` kill line (but doesn't put it in clipboard)
fr: :kbd:`C-k` supprime la ligne (mais ne la met pas dans le presse-papier)

source: :kbd:`C-l` center window around the insertion point
fr: :kbd:`C-l` centre la fenêtre autour du point d’insertion

source: :kbd:`C-b` go backward one character without deleting (usually you can also use the cursor key for this)
fr: :kbd:`C-b` recule d'un caractère sans le supprimer (habituellement vous pouvez également utiliser les touches flèches pour faire cela)

source: :kbd:`C-f` go forward one character without deleting (usually you can also use the cursor key for this)
fr: :kbd:`C-f` avance d'un caractère sans le supprimer (habituellement vous pouvez également utiliser les touches flèches pour faire cela)

source: :kbd:`C-p` go up one line (usually you can also use the cursor key for this)
fr: :kbd:`C-p` remonte d'une ligne (habituellement vous pouvez également utiliser les touches flèches pour faire cela)

source: :kbd:`C-d` delete next character
fr: :kbd:`C-d` supprime le caractère suivant

source: Standard keybindings (like :kbd:`C-c` to copy and :kbd:`C-v` to paste) may work. Keybindings are selected in the Configure IDLE dialog.
fr: Les raccourcis clavier standards (comme :kbd:`C-c` pour copier et :kbd:`C-v` pour coller) peuvent fonctionner. Les raccourcis clavier sont sélectionnés dans la fenêtre de configuration d'*IDLE*.

source: Automatic indentation
fr: Indentation automatique

source: After a block-opening statement, the next line is indented by 4 spaces (in the Python Shell window by one tab). After certain keywords (break, return etc.) the next line is dedented. In leading indentation, :kbd:`Backspace` deletes up to 4 spaces if they are there. :kbd:`Tab` inserts spaces (in the Python Shell window one tab), number depends on Indent width. Currently, tabs are restricted to four spaces due to Tcl/Tk limitations.
fr: Après une structure d'ouverture de bloc, la prochaine ligne est indentée de 4 espaces (dans la console Python d'une tabulation). Après certains mots-clefs (*break*, *return* etc) la ligne suivante est *dédentée*. Dans une indentation au début de la ligne, :kbd:`Retour arrière` supprime jusqu'à 4 espaces s'il y en a. :kbd:`Tab` insère des espaces (dans la console, une tabulation), en nombre dépendant de la configuration. Les tabulations sont actuellement restreintes à quatre espaces à cause de limitations de *Tcl/Tk*.

source: See also the indent/dedent region commands on the :ref:`Format menu <format-menu>`.
fr: Cf. les commandes *indent/dedent region* dans le :ref:`menu *Format* <format-menu>`.

source: Completions
fr: Complétions

source: Calltips
fr: Info-bulles

source: Code Context
fr: Contexte du code

source: Within an editor window containing Python code, code context can be toggled in order to show or hide a pane at the top of the window. When shown, this pane freezes the opening lines for block code, such as those beginning with ``class``, ``def``, or ``if`` keywords, that would have otherwise scrolled out of view. The size of the pane will be expanded and contracted as needed to show the all current levels of context, up to the maximum number of lines defined in the Configure IDLE dialog (which defaults to 15). If there are no current context lines and the feature is toggled on, a single blank line will display. Clicking on a line in the context pane will move that line to the top of the editor.
fr: Dans une fenêtre d'édition contenant du code Python, le contexte du code peut être activé pour afficher ou cacher une zone en haut de la fenêtre. Quand elle est affichée, cette zone gèle les lignes ouvrant le bloc de code, comme celles qui commencent par les mots-clés ``class``, ``def`` ou ``if``, qui auraient autrement été cachées plus haut dans le fichier. La taille de cette zone varie automatiquement selon ce qui est nécessaire pour afficher tous les niveaux de contexte, jusqu'à un nombre maximal de lignes défini dans la fenêtre de configuration d'*IDLE* (valeur qui vaut 15 par défaut). S'il n'y a pas de lignes de contexte et que cette fonctionnalité est activée, une unique ligne vide est affichée. Un clic sur une ligne dans la zone de contexte déplace cette ligne en haut de l'éditeur.

source: The text and background colors for the context pane can be configured under the Highlights tab in the Configure IDLE dialog.
fr: Les couleurs de texte et du fond pour la zone de contexte peuvent être configurées dans l'onglet *Highlights* de la fenêtre de configuration d'*IDLE*.

source: Python Shell window
fr: Fenêtre de console Python

source: With IDLE's Shell, one enters, edits, and recalls complete statements. Most consoles and terminals only work with a single physical line at a time.
fr: Avec la console d'*IDLE*, vous pouvez saisir, éditer et rappeler des commandes entières. La plupart des consoles et des terminaux ne travaillent qu'avec une seule ligne physique à la fois.

source: When one pastes code into Shell, it is not compiled and possibly executed until one hits :kbd:`Return`. One may edit pasted code first. If one pastes more that one statement into Shell, the result will be a :exc:`SyntaxError` when multiple statements are compiled as if they were one.
fr: Quand du texte est collé dans la console, il n'est ni compilé, ni exécuté jusqu'à la ce qu'on saisisse :kbd:`Entrée`. On peut éditer le code collé d'abord. Si plus d'une commande est collée dans la console, une :exc:`SyntaxError` est levée si plusieurs commandes sont compilées comme une seule.

source: The editing features described in previous subsections work when entering code interactively. IDLE's Shell window also responds to the following keys.
fr: Les fonctionnalités d'édition décrites dans les sous-sections suivantes fonctionnent du code est saisi de façon interactive. La fenêtre de console d'*IDLE* réagit également aux touches suivantes.

source: :kbd:`C-c` interrupts executing command
fr: :kbd:`C-c` interrompt l'exécution de la commande

source: :kbd:`C-d` sends end-of-file; closes window if typed at a ``>>>`` prompt
fr: :kbd:`C-d` envoie fin-de-fichier (*EOF*) ; cela ferme la fenêtre s'il est saisi à une invite ``>>>``

source: :kbd:`Alt-/` (Expand word) is also useful to reduce typing
fr: :kbd:`Alt-/` (Compléter le mot) est également utile pour réduire la quantité de texte saisie

source: Command history
fr: Historique des commandes

source: :kbd:`Alt-p` retrieves previous command matching what you have typed. On macOS use :kbd:`C-p`.
fr: :kbd:`Alt-p` récupère la précédente commande qui correspond à ce que vous avez saisi. Sous *macOS*, utilisez :kbd:`C-p`.

source: :kbd:`Alt-n` retrieves next. On macOS use :kbd:`C-n`.
fr: :kbd:`Alt-n` récupère la suivante. Sous *macOS*, utilisez :kbd:`C-n`.

source: :kbd:`Return` while on any previous command retrieves that command
fr: :kbd:`Entrée` sur une des commandes précédentes récupère cette commande

source: Text colors
fr: Coloration du texte

source: Idle defaults to black on white text, but colors text with special meanings. For the shell, these are shell output, shell error, user output, and user error. For Python code, at the shell prompt or in an editor, these are keywords, builtin class and function names, names following ``class`` and ``def``, strings, and comments. For any text window, these are the cursor (when present), found text (when possible), and selected text.
fr: *IDLE* affiche par défaut le texte en noir sur blanc mais colore le texte qui possède une signification spéciale. Pour la console, ceci concerne les sorties de la console et de l'utilisateur ainsi que les erreurs de l'utilisateur. Pour le code Python, dans l'invite de commande de la console ou sur un éditeur, ce sont les mots-clefs, noms de fonctions et de classes incluses par défaut, les noms suivant ``class`` et ``def``, les chaînes de caractères et les commentaires. Pour n'importe quelle fenêtre de texte, ce sont le curseur (si présent), le texte trouvé (s'il y en a) et le texte sélectionné.

source: Text coloring is done in the background, so uncolorized text is occasionally visible. To change the color scheme, use the Configure IDLE dialog Highlighting tab. The marking of debugger breakpoint lines in the editor and text in popups and dialogs is not user-configurable.
fr: La coloration du texte est faite en arrière-plan, donc du texte non coloré est parfois visible. Pour changer les couleurs, utilisez l'onglet *Highlighting* de la fenêtre de configuration d'*IDLE*. Le marquage des points d'arrêt du débogueur dans l'éditeur et du texte dans les dialogues n'est pas configurable.

source: Startup and code execution
fr: Démarrage et exécution du code

source: Upon startup with the ``-s`` option, IDLE will execute the file referenced by the environment variables :envvar:`IDLESTARTUP` or :envvar:`PYTHONSTARTUP`. IDLE first checks for ``IDLESTARTUP``; if ``IDLESTARTUP`` is present the file referenced is run. If ``IDLESTARTUP`` is not present, IDLE checks for ``PYTHONSTARTUP``. Files referenced by these environment variables are convenient places to store functions that are used frequently from the IDLE shell, or for executing import statements to import common modules.
fr: Quand il est démarré avec l'option ``-s``, *IDLE* exécutera le fichier référencé par la variable d'environnement :envvar:`IDLE*STARTUP` ou :envvar:`PYTHONSTARTUP`. *IDLE* cherche d'abord ``IDLESTARTUP`` ; si ``IDLESTARTUP`` est présent, le fichier référencé est exécuté. Si ``IDLESTARTUP`` n'est pas présent, alors *IDLE* cherche ``PYTHONSTARTUP``. Les fichiers référencés par ces variables d'environnement sont de bons endroits pour stocker des fonctions qui sont utilisées fréquemment depuis la console d'*IDLE* ou pour exécuter des commandes d'importation des modules communs.

source: In addition, ``Tk`` also loads a startup file if it is present. Note that the Tk file is loaded unconditionally. This additional file is ``.Idle.py`` and is looked for in the user's home directory. Statements in this file will be executed in the Tk namespace, so this file is not useful for importing functions to be used from IDLE's Python shell.
fr: De plus, ``Tk`` charge lui aussi un fichier de démarrage s'il est présent. Notez que le fichier de *Tk* est chargé sans condition. Ce fichier additionnel est ``.Idle.py`` et est recherché dans le dossier personnel de l'utilisateur. Les commandes dans ce fichier sont exécutées dans l'espace de nommage de *Tk*, donc ce fichier n'est pas utile pour importer des fonctions à utiliser depuis la console Python d'*IDLE*.

source: Command line usage
fr: Utilisation de la ligne de commande

source: If there are arguments:
fr: S'il y a des arguments :

source: If ``-``, ``-c``, or ``r`` is used, all arguments are placed in ``sys.argv[1:...]`` and ``sys.argv[0]`` is set to ``''``, ``'-c'``, or ``'-r'``. No editor window is opened, even if that is the default set in the Options dialog.
fr: Si ``-``, ``-c`` ou ``-r`` sont utilisés, tous les arguments sont placés dans ``sys.argv[1:...]`` et ``sys.argv[0]`` est assigné à `''``, ``'-c'``, ou ``'-r'``. Aucune fenêtre d'édition n'est ouverte, même si c'est le comportement par défaut fixé dans la fenêtre d'options.

source: Otherwise, arguments are files opened for editing and ``sys.argv`` reflects the arguments passed to IDLE itself.
fr: Sinon, les arguments sont des fichiers ouverts pour édition et ``sys.argv`` reflète les arguments passés à *IDLE* lui-même.

source: Startup failure
fr: Échec au démarrage

source: A common cause of failure is a user-written file with the same name as a standard library module, such as *random.py* and *tkinter.py*. When such a file is located in the same directory as a file that is about to be run, IDLE cannot import the stdlib file. The current fix is to rename the user file.
fr: Une cause d'échec courant est un fichier écrit par l'utilisateur avec le même nom qu'un module de la bibliothèque standard, comme *random.py* et *tkinter.py*. Quand un fichier de ce genre est enregistré dans le même répertoire qu'un fichier à exécuter, *IDLE* ne peut pas importer le fichier standard. La solution actuelle consiste à renommer le fichier de l'utilisateur.

source: Though less common than in the past, an antivirus or firewall program may stop the connection. If the program cannot be taught to allow the connection, then it must be turned off for IDLE to work. It is safe to allow this internal connection because no data is visible on external ports. A similar problem is a network mis-configuration that blocks connections.
fr: Même si c'est plus rare qu'avant, un antivirus ou un pare-feu peuvent interrompre la connexion. Si le programme ne peut pas être paramétré pour autoriser la connexion, alors il doit être éteint pour qu'*IDLE* puisse fonctionner. Cette connexion interne est sûre car aucune donnée n'est visible depuis un port extérieur. Un problème similaire est une mauvaise configuration du réseau qui bloque les connexions.

source: Python installation issues occasionally stop IDLE: multiple versions can clash, or a single installation might need admin access. If one undo the clash, or cannot or does not want to run as admin, it might be easiest to completely remove Python and start over.
fr: Des problèmes d'installation de Python stoppent parfois *IDLE* : il peut y avoir un conflit de versions ou bien l'installation peut nécessiter des privilèges administrateurs. Si on corrige le conflit , ou qu'on ne peut ou ne veut pas accorder de privilège, il peut être plus facile de désinstaller complètement Python et de recommencer.

source: Running user code
fr: Exécuter le code de l'utilisateur

source: By default, IDLE runs user code in a separate OS process rather than in the user interface process that runs the shell and editor. In the execution process, it replaces ``sys.stdin``, ``sys.stdout``, and ``sys.stderr`` with objects that get input from and send output to the Shell window. The original values stored in ``sys.__stdin__``, ``sys.__stdout__``, and ``sys.__stderr__`` are not touched, but may be ``None``.
fr: Par défaut, *IDLE* exécute le code de l'utilisateur dans un processus système séparé plutôt que dans le processus d'interface utilisateur qui exécute la console et l'éditeur. Dans le processus d'exécution, il remplace ``sys.stdin``, ``sys.stdout`` et ``sys.stderr`` par des objets qui récupèrent les entrées et envoient les sorties à la fenêtre de console. Les valeurs originales stockées dans ``sys.__stdin__``, ``sys.__stdout__`` et ``sys.__stderr__`` ne sont pas touchées, mais peuvent être ``None``.

source: IDLE's standard stream replacements are not inherited by subprocesses created in the execution process, whether directly by user code or by modules such as multiprocessing. If such subprocess use ``input`` from sys.stdin or ``print`` or ``write`` to sys.stdout or sys.stderr, IDLE should be started in a command line window. The secondary subprocess will then be attached to that window for input and output.
fr: Les remplacements des flux standards par *IDLE* ne sont pas hérités par les sous-processus créés dans le processus d'exécution, directement par le code de l'utilisateur ou par des modules comme *multiprocessing*. Si de tels modules utilisent ``input`` à partir de *sys.stdin* ou ``write`` à *sys.stdout* ou *sys.stderr*, *IDLE* doit être démarré dans une fenêtre de ligne de commande. Le sous-processus secondaire sera ensuite attaché à cette fenêtre pour les entrées et les sorties.

source: If ``sys`` is reset by user code, such as with ``importlib.reload(sys)``, IDLE's changes are lost and input from the keyboard and output to the screen will not work correctly.
fr: Si ``sys`` est réinitialisé par le code de l'utilisateur, comme avec ``importlib.reload(sys)``, les changements d'*IDLE* seront perdus et l'entrée du clavier et la sortie à l'écran ne fonctionneront pas correctement.

source: When Shell has the focus, it controls the keyboard and screen. This is normally transparent, but functions that directly access the keyboard and screen will not work. These include system-specific functions that determine whether a key has been pressed and if so, which.
fr: Quand la console est au premier plan, elle contrôle le clavier et l'écran. Ceci est normalement transparent, mais les fonctions qui accèdent directement au clavier et à l'écran ne fonctionneront pas. Ceci inclut des fonctions spécifiques du système qui déterminent si une touche a été pressée et, le cas échéant, laquelle.

source: The IDLE code running in the execution process adds frames to the call stack that would not be there otherwise. IDLE wraps ``sys.getrecursionlimit`` and ``sys.setrecursionlimit`` to reduce the effect of the additional stack frames.
fr: Le code IDLE tournant dans le processus d'exécution ajoute des appels de fonctions à la pile d'appels qui ne seraient pas là autrement. IDLE encapsule ``sys.getrecursionlimit`` et ``sys.setrecursionlimit`` pour réduire l'effet des piles de fonctions supplémentaires.

source: When user code raises SystemExit either directly or by calling sys.exit, IDLE returns to a Shell prompt instead of exiting.
fr: Lorsque l'utilisateur lève `SystemExit` directement ou en appelant ``sys.exit``, IDLE revient au terminal IDLE au lieu de quitter.

source: User output in Shell
fr: Sortie de l'utilisateur sur la console

source: When a program outputs text, the result is determined by the corresponding output device. When IDLE executes user code, ``sys.stdout`` and ``sys.stderr`` are connected to the display area of IDLE's Shell. Some of its features are inherited from the underlying Tk Text widget. Others are programmed additions. Where it matters, Shell is designed for development rather than production runs.
fr: Quand un programme affiche du texte, le résultat est déterminé par le support d'affichage correspondant. Quand *IDLE* exécute du code de l'utilisateur, ``sys.stdout`` et ``sys.stderr`` sont connectées à la zone d'affichage de la console d'*IDLE*. Certaines de ces fonctionnalités sont héritées des widgets *Tk* sous-jacents. D'autres sont des additions programmées. Quand cela importe, la console est conçue pour le développement plutôt que l'exécution en production.

source: For instance, Shell never throws away output. A program that sends unlimited output to Shell will eventually fill memory, resulting in a memory error. In contrast, some system text windows only keep the last n lines of output. A Windows console, for instance, keeps a user-settable 1 to 9999 lines, with 300 the default.
fr: Par exemple, la console ne supprime jamais de sortie. Un programme qui écrit à l'infini dans la console finira par remplir la mémoire, ce qui entraînera un erreur mémoire. Par ailleurs, certains systèmes de fenêtres textuelles ne conservent que les n dernières lignes de sortie. Une console Windows, par exemple, conserve une quantité de lignes configurable entre 1 et 9999, avec une valeur par défaut de 300.

source: A Tk Text widget, and hence IDLE's Shell, displays characters (codepoints) in the BMP (Basic Multilingual Plane) subset of Unicode. Which characters are displayed with a proper glyph and which with a replacement box depends on the operating system and installed fonts. Tab characters cause the following text to begin after the next tab stop. (They occur every 8 'characters'). Newline characters cause following text to appear on a new line. Other control characters are ignored or displayed as a space, box, or something else, depending on the operating system and font. (Moving the text cursor through such output with arrow keys may exhibit some surprising spacing behavior.) ::
fr: Un widget *Text* de *Tk* et donc la console d'*IDLE*, affiche des caractères (points de code) dans le sous-ensemble *BMP* (*Basic Multilingual Plane*) d'Unicode. Quels caractères sont affichés avec le bon glyphe et lesquels sont affichés avec un caractère de remplacement dépend du système d'exploitation et des polices installées. Les caractères de tabulation font que le texte suivant commencera après le prochain taquet de tabulation (ils sont placés tous les 8 *"caractères"*). Les caractères saut de ligne font apparaître le texte suivant sur une nouvelle ligne. Les autres caractères de contrôle sont ignorés ou affichés sous forme d'espace, de boîte, ou d'autre chose, selon le système d'exploitation et la police (déplacer le curseur de texte sur un affichage de ce genre peut provoquer un comportement surprenant du point de vue de l'espacement). ::

source: The ``repr`` function is used for interactive echo of expression values. It returns an altered version of the input string in which control codes, some BMP codepoints, and all non-BMP codepoints are replaced with escape codes. As demonstrated above, it allows one to identify the characters in a string, regardless of how they are displayed.
fr: La fonction ``repr`` est utilisée pour l'affichage interactif de la valeur des expressions. Elle renvoie une version modifiée de la chaîne en entrée dans laquelle les codes de contrôle, certains points de code *BMP* et tous les points de code non *BMP* sont remplacés par des caractères d'échappement. Comme montré ci-dessus, ceci permet d'identifier les caractères dans une chaîne, quelle que soit la façon dont elle est affichée.

source: Normal and error output are generally kept separate (on separate lines) from code input and each other. They each get different highlight colors.
fr: Les sorties standard et d'erreur sont généralement séparées (sur des lignes séparées) de l'entrée de code et entre elles. Elles ont chacune une coloration différente.
