Repository: python/python-docs-fr
Catalog: library/idle.po
Languages: fr

source: **Source code:** :source:`Lib/idlelib/`
fr: **Code source** : :source:`Lib/idlelib/`

source: IDLE is Python's Integrated Development and Learning Environment.
fr: *IDLE* est l'environnement de développement et d'apprentissage intégré de Python (*Integrated Development and Learning Environment*).

source: IDLE has the following features:
fr: *IDLE* a les fonctionnalités suivantes :

source: coded in 100% pure Python, using the :mod:`tkinter` GUI toolkit
fr: codé à 100% en pur Python, en utilisant l'outil d'interfaçage graphique :mod:`tkinter`

source: cross-platform: works mostly the same on Windows, Unix, and macOS
fr: multiplateformes : fonctionne de la même manière sous Windows, *Unix* et *macOS*

source: Python shell window (interactive interpreter) with colorizing of code input, output, and error messages
fr: Console Python (interpréteur interactif) avec coloration du code entré, des sorties et des messages d'erreur

source: multi-window text editor with multiple undo, Python colorizing, smart indent, call tips, auto completion, and other features
fr: éditeur de texte multi-fenêtres avec annulations multiples, coloration Python, indentation automatique, aide pour les appels de fonction, *autocomplétion*, parmi d'autres fonctionnalités

source: search within any window, replace within editor windows, and search through multiple files (grep)
fr: recherche dans n'importe quelle fenêtre, remplacement dans une fenêtre d'édition et recherche dans des fichiers multiples (*grep*)

source: debugger with persistent breakpoints, stepping, and viewing of global and local namespaces
fr: débogueur avec points d'arrêt persistants, pas-à-pas et visualisation des espaces de nommage locaux et globaux

source: configuration, browsers, and other dialogs
fr: configuration, navigateur et d'autres fenêtres de dialogue

source: IDLE has two main window types, the Shell window and the Editor window. It is possible to have multiple editor windows simultaneously. On Windows and Linux, each has its own top menu. Each menu documented below indicates which window type it is associated with.
fr: *IDLE* a deux principaux types de fenêtre, la fenêtre de console et la fenêtre d'édition. Il est possible d'avoir de multiples fenêtres d'édition ouvertes simultanément. Sous Windows et Linux, chacune a son propre menu. Chaque menu documenté ci-dessous indique à quel type de fenêtre il est associé.

source: Output windows, such as used for Edit => Find in Files, are a subtype of editor window. They currently have the same top menu but a different default title and context menu.
fr: Les fenêtre d'affichage, comme celles qui sont utilisées pour *Edit => Find in Files*, sont un sous-type de fenêtre d'édition. Elles possèdent actuellement le même menu principal mais un titre par défaut et un menu contextuel différents.

source: On macOS, there is one application menu. It dynamically changes according to the window currently selected. It has an IDLE menu, and some entries described below are moved around to conform to Apple guidelines.
fr: Sous *macOS*, il y a un menu d'application. Il change dynamiquement en fonction de la fenêtre active. Il a un menu *IDLE* et certaines entrées décrites ci-dessous sont déplacées conformément aux directives d'Apple.

source: File menu (Shell and Editor)
fr: Menu *File* (Console et Éditeur)

source: Create a new file editing window.
fr: Crée une nouvelle fenêtre d'édition.

source: Open an existing file with an Open dialog.
fr: Ouvre un fichier existant avec une fenêtre de dialogue pour l'ouverture.

source: Open a list of recent files. Click one to open it.
fr: Ouvre une liste des fichiers récents. Cliquez sur l'un d'eux pour l'ouvrir.

source: Open an existing module (searches sys.path).
fr: Ouvre un module existant (cherche dans *sys.path*).

source: Show functions, classes, and methods in the current Editor file in a tree structure. In the shell, open a module first.
fr: Montre les fonctions, classes et méthodes dans une arborescence pour le fichier en cours d'édition. Dans la console, ouvre d'abord un module.

source: Show sys.path directories, modules, functions, classes and methods in a tree structure.
fr: Affiche les dossiers de *sys.path*, les modules, fonctions, classes et méthodes dans une arborescence.

source: Save the current window to the associated file, if there is one. Windows that have been changed since being opened or last saved have a \* before and after the window title. If there is no associated file, do Save As instead.
fr: Enregistre la fenêtre active sous le fichier associé, s'il existe. Les fenêtres qui ont été modifiées depuis leur ouverture ou leur dernier enregistrement ont un \* avant et après le titre de la fenêtre. S'il n'y a aucun fichier associé, exécute *Save As* à la place.

source: Save the current window with a Save As dialog. The file saved becomes the new associated file for the window.
fr: Enregistre la fenêtre active avec une fenêtre de dialogue d'enregistrement. Le fichier enregistré devient le nouveau fichier associé pour cette fenêtre.

source: Save the current window to different file without changing the associated file.
fr: Enregistre la fenêtre active sous un fichier différent sans changer le fichier associé.

source: Print the current window to the default printer.
fr: Imprime la fenêtre active avec l'imprimante par défaut.

source: Close the current window (ask to save if unsaved).
fr: Ferme la fenêtre active (demande à enregistrer si besoin).

source: Close all windows and quit IDLE (ask to save unsaved windows).
fr: Ferme toutes les fenêtres et quitte *IDLE* (demande à enregistrer les fenêtres non sauvegardées).

source: Edit menu (Shell and Editor)
fr: Menu *Edit* (console et éditeur)

source: Undo the last change to the current window. A maximum of 1000 changes may be undone.
fr: Annule le dernier changement dans la fenêtre active. Un maximum de 1000 changements peut être annulé.

source: Redo the last undone change to the current window.
fr: Ré-applique le dernier changement annulé dans la fenêtre active.

source: Copy selection into the system-wide clipboard; then delete the selection.
fr: Copie la sélection dans le presse-papier global ; puis supprime la sélection.

source: Copy selection into the system-wide clipboard.
fr: Copie la sélection dans le presse-papier global.

source: Insert contents of the system-wide clipboard into the current window.
fr: Insère le contenu du presse-papier global dans la fenêtre active.

source: The clipboard functions are also available in context menus.
fr: Les fonctions du presse-papier sont aussi disponibles dans les menus contextuels.

source: Select the entire contents of the current window.
fr: Sélectionne la totalité du contenu de la fenêtre active.

source: Open a search dialog with many options
fr: Ouvre une fenêtre de recherche avec de nombreuses options

source: Repeat the last search, if there is one.
fr: Répète la dernière recherche, s'il y en a une.

source: Search for the currently selected string, if there is one.
fr: Cherche la chaîne sélectionnée, s'il y en a une.

source: Open a file search dialog. Put results in a new output window.
fr: Ouvre une fenêtre de recherche de fichiers. Présente les résultats dans une nouvelle fenêtre d'affichage.

source: Open a search-and-replace dialog.
fr: Ouvre une fenêtre de recherche et remplacement.

source: Expand a prefix you have typed to match a full word in the same window; repeat to get a different expansion.
fr: Complète un préfixe que vous avez saisi pour correspondre à un mot complet de la même fenêtre ; recommencez pour obtenir un autre complément.

source: After an unclosed parenthesis for a function, open a small window with function parameter hints. See :ref:`Calltips <calltips>` in the Editing and navigation section below.
fr: Après une parenthèse ouverte pour une fonction, ouvre une petite fenêtre avec des indications sur les paramètres de la fonction. Reportez-vous à :ref:`Aides aux appels <calltips>` dans la section Édition et navigation ci-dessous.

source: Highlight the surrounding parenthesis.
fr: Surligne les parenthèses encadrantes.

source: Format menu (Editor window only)
fr: Menu *Format* (fenêtre d'édition uniquement)

source: Shift selected lines right by the indent width (default 4 spaces).
fr: Décale les lignes sélectionnées vers la droite d'un niveau d'indentation (4 espaces par défaut).

source: Shift selected lines left by the indent width (default 4 spaces).
fr: Décale les lignes sélectionnées vers la gauche d'un niveau d'indentation (4 espaces par défaut).

source: Insert ## in front of selected lines.
fr: Insère ## devant les lignes sélectionnées.

source: Remove leading # or ## from selected lines.
fr: Enlève les # ou ## au début des lignes sélectionnées.

source: Turn *leading* stretches of spaces into tabs. (Note: We recommend using 4 space blocks to indent Python code.)
fr: Transforme les blocs d'espaces *au début des lignes* en tabulations. (Note : Nous recommandons d'utiliser des blocs de 4 espaces pour indenter du code Python.)

source: Turn *all* tabs into the correct number of spaces.
fr: Transforme *toutes* les tabulations en le bon nombre d'espaces.

source: Open a dialog to switch between indenting with spaces and tabs.
fr: Ouvre une boîte de dialogue permettant de passer des espaces aux tabulations (et inversement) pour l'indentation.

source: Open a dialog to change indent width. The accepted default by the Python community is 4 spaces.
fr: Ouvre une boîte de dialogue pour changer la taille de l'indentation. La valeur par défaut acceptée par la communauté Python est de 4 espaces.

source: Reformat the current blank-line-delimited paragraph in comment block or multiline string or selected line in a string. All lines in the paragraph will be formatted to less than N columns, where N defaults to 72.
fr: Reformate le paragraphe actif, délimité par des lignes vides, en un bloc de commentaires, ou la chaîne de caractères multi-lignes ou ligne sélectionnée en chaîne de caractères. Toutes les lignes du paragraphe seront formatées à moins de N colonnes, avec N valant 72 par défaut.

source: Remove trailing space and other whitespace characters after the last non-whitespace character of a line by applying str.rstrip to each line, including lines within multiline strings. Except for Shell windows, remove extra newlines at the end of the file.
fr: Enlève les espaces après le dernier caractère non blanc d'une ligne en appliquant *str.rstrip* à chaque ligne, y compris les lignes avec des chaînes de caractères multi-lignes. À l'exception des fenêtres de terminal, supprime les lignes supplémentaires à la fin du fichier.

source: Run menu (Editor window only)
fr: Menu *Run* (fenêtre d'édition uniquement)

source: Do :ref:`Check Module <check-module>`. If no error, restart the shell to clean the environment, then execute the module. Output is displayed in the Shell window. Note that output requires use of ``print`` or ``write``. When execution is complete, the Shell retains focus and displays a prompt. At this point, one may interactively explore the result of execution. This is similar to executing a file with ``python -i file`` at a command line.
fr: Applique :ref:`Check Module <check-module>` (ci-dessus). S'il n'y a pas d'erreur, redémarre la console pour nettoyer l'environnement, puis exécute le module. Les sorties sont affichées dans la fenêtre de console. Notez qu'une sortie requiert l'utilisation de ``print`` ou ``write``. Quand l'exécution est terminée, la console reste active et affiche une invite de commande. À ce moment, vous pouvez explorer interactivement le résultat de l'exécution. Ceci est similaire à l'exécution d'un fichier avec ``python -i fichier`` sur un terminal.

source: Same as :ref:`Run Module <run-module>`, but run the module with customized settings. *Command Line Arguments* extend :data:`sys.argv` as if passed on a command line. The module can be run in the Shell without restarting.
fr: Similaire à :ref:`Run Module <run-module>`, mais lance le module avec des paramètres personnalisés. Les *Command Line Arguments* se rajoutent à :data:`sys.argv` comme s'ils étaient passés par la ligne de commande. Le module peut être lancé dans le terminal sans avoir à le redémarrer.

source: Check the syntax of the module currently open in the Editor window. If the module has not been saved IDLE will either prompt the user to save or autosave, as selected in the General tab of the Idle Settings dialog. If there is a syntax error, the approximate location is indicated in the Editor window.
fr: Vérifie la syntaxe du module actuellement ouvert dans la fenêtre d'édition. Si le module n'a pas été enregistré, *IDLE* va soit demander à enregistrer à l'utilisateur, soit enregistrer automatiquement, selon l'option sélectionnée dans l'onglet *General* de la fenêtre de configuration d'*IDLE*. S'il y a une erreur de syntaxe, l'emplacement approximatif est indiqué dans la fenêtre d'édition.

source: Python Shell
fr: Console Python

source: Open or wake up the Python Shell window.
fr: Ouvre ou active la fenêtre de console Python.

source: Shell menu (Shell window only)
fr: Menu Shell (fenêtre de console uniquement)

source: Scroll the shell window to the last Shell restart.
fr: Fait défiler la fenêtre de console jusqu'au dernier redémarrage de la console.

source: Cycle through earlier commands in history which match the current entry.
fr: Parcours les commandes précédentes dans l'historique qui correspondent à l'entrée actuelle.

source: Cycle through later commands in history which match the current entry.
fr: Parcours les commandes suivantes dans l'historique qui correspondent à l'entrée actuelle.

source: Stop a running program.
fr: Arrête un programme en cours d'exécution.

source: Debug menu (Shell window only)
fr: Menu *Debug* (fenêtre de console uniquement)

source: Look on the current line. with the cursor, and the line above for a filename and line number. If found, open the file if not already open, and show the line. Use this to view source lines referenced in an exception traceback and lines found by Find in Files. Also available in the context menu of the Shell window and Output windows.
fr: Cherche, sur la ligne active et la ligne en-dessous, un nom de fichier et un numéro de ligne. Le cas échéant, ouvre le fichier s'il n'est pas encore ouvert et montre la ligne. Utilisez ceci pour visualiser les lignes de code source référencées dans un *traceback* d'exception et les lignes trouvées par *Find in Files*. Également disponible dans le menu contextuel des fenêtres de console et d'affichage.

source: Debugger (toggle)
fr: *Debugger* ([dés]activer)

source: When activated, code entered in the Shell or run from an Editor will run under the debugger. In the Editor, breakpoints can be set with the context menu. This feature is still incomplete and somewhat experimental.
fr: Quand cette fonctionnalité est activée, le code saisi dans la console ou exécuté depuis un Éditeur s'exécutera avec le débogueur. Dans l'Éditeur, des points d'arrêt peuvent être placés avec le menu contextuel. Cette fonctionnalité est encore incomplète et plus ou moins expérimentale.

source: Show the stack traceback of the last exception in a tree widget, with access to locals and globals.
fr: Montre l'état de la pile au moment de la dernière erreur dans une arborescence, avec accès aux variables locales et globales.

source: Toggle automatically opening the stack viewer on an unhandled exception.
fr: Active ou désactive l'ouverture automatique de l'afficheur de pile après une erreur non gérée.

source: Options menu (Shell and Editor)
fr: Menu *Options* (console et éditeur)

source: Open a configuration dialog and change preferences for the following: fonts, indentation, keybindings, text color themes, startup windows and size, additional help sources, and extensions. On macOS, open the configuration dialog by selecting Preferences in the application menu. For more details, see :ref:`Setting preferences <preferences>` under Help and preferences.
fr: Ouvre une fenêtre de configuration et change les préférences pour les éléments suivants : police, indentation, raccourcis clavier, thème de coloration du texte, taille et nature de la fenêtre au lancement, sources d'aide additionnelles et extensions. Sous *macOS*, ouvrez la fenêtre de configuration en sélectionnant *Preferences* dans le menu de l'application. Pour plus de détails, référez-vous à :ref:`Modifier les préférences <preferences>` dans Aide et paramètres.

source: Most configuration options apply to all windows or all future windows. The option items below only apply to the active window.
fr: La plupart des paramètres de configuration s'appliquent à toutes les fenêtres, ouvertes ou non. Les éléments d'option ci-dessous s'appliquent uniquement à la fenêtre active.

source: Show/Hide Code Context (Editor Window only)
fr: *Show/Hide Code Context* (fenêtres d'édition uniquement)

source: Open a pane at the top of the edit window which shows the block context of the code which has scrolled above the top of the window. See :ref:`Code Context <code-context>` in the Editing and Navigation section below.
fr: Fais passer la fenêtre de taille normale à maximale. La taille de départ par défaut est de 40 lignes par 80 caractères, sauf changement dans l'onglet *General* de la fenêtre de configuration d'*IDLE*. Consultez :ref:`Code Context <code-context>` dans la section « Édition et navigation » ci-dessous.

source: Show/Hide Line Numbers (Editor Window only)
fr: *Show/Hide Line Numbers* (fenêtre de l'éditeur uniquement)

source: Open a column to the left of the edit window which shows the number of each line of text. The default is off, which may be changed in the preferences (see :ref:`Setting preferences <preferences>`).
fr: Ajoute une colonne à gauche de la fenêtre d'édition qui indique le numéro de chaque ligne de texte. Cette colonne est désactivée par défaut, ce qui peut être modifié dans les préférences (voir :ref:`Modifier les préférences <preferences>`).

source: Toggles the window between normal size and maximum height. The initial size defaults to 40 lines by 80 chars unless changed on the General tab of the Configure IDLE dialog. The maximum height for a screen is determined by momentarily maximizing a window the first time one is zoomed on the screen. Changing screen settings may invalidate the saved height. This toggle has no effect when a window is maximized.
fr: Bascule la fenêtre entre la taille normale et la hauteur maximale. La taille initiale par défaut est de 40 lignes par 80 caractères, sauf si elle est modifiée dans l'onglet « *General* » de la boîte de dialogue « Configure IDLE ». La hauteur maximale d'un écran est déterminée en maximisant momentanément une fenêtre lors du premier zoom sur l'écran. La modification des paramètres d'écran peut invalider la hauteur enregistrée. Cette bascule n'a aucun effet lorsqu'une fenêtre est agrandie.

source: Window menu (Shell and Editor)
fr: Menu *Windows* (console et éditeur)

source: Lists the names of all open windows; select one to bring it to the foreground (deiconifying it if necessary).
fr: Liste les noms de toutes les fenêtres ouvertes ; sélectionnez-en une pour l'amener au premier plan (en l'ouvrant si nécessaire).

source: Help menu (Shell and Editor)
fr: Menu *Help* (console et éditeur)

source: Display version, copyright, license, credits, and more.
fr: Affiche la version, les copyrights, la licence, les crédits, entre autres.

source: Display this IDLE document, detailing the menu options, basic editing and navigation, and other tips.
fr: Affiche ce document *IDLE*, qui détaille les options des menus, les bases de l'édition et de la navigation ainsi que d'autres astuces.

source: Access local Python documentation, if installed, or start a web browser and open docs.python.org showing the latest Python documentation.
fr: Accède à la documentation Python locale, si installée, ou ouvre docs.python.org dans un navigateur pour afficher la documentation Python la plus récente.

source: Run the turtledemo module with example Python code and turtle drawings.
fr: Exécute le module *turtledemo* avec des exemples de code Python et de dessins *turtle*.

source: Additional help sources may be added here with the Configure IDLE dialog under the General tab. See the :ref:`Help sources <help-sources>` subsection below for more on Help menu choices.
fr: Des sources d'aide supplémentaires peuvent être ajoutées ici avec la fenêtre de configuration d'*IDLE* dans l'onglet *General*. Référez-vous à la sous-section :ref:`Sources d'aide <help-sources>` ci-dessous pour plus de détails sur les choix du menu d'aide.

source: Context Menus
fr: Menus Contextuels

source: Open a context menu by right-clicking in a window (Control-click on macOS). Context menus have the standard clipboard functions also on the Edit menu.
fr: Vous pouvez ouvrir un menu contextuel par un clic droit dans une fenêtre (Contrôle-clic sous *macOS*). Les menus contextuels ont les fonctions de presse-papier standard, également disponibles dans le menu *Edit*.

source: Editor windows also have breakpoint functions. Lines with a breakpoint set are specially marked. Breakpoints only have an effect when running under the debugger. Breakpoints for a file are saved in the user's ``.idlerc`` directory.
fr: Les fenêtres d'édition ont aussi des fonctions de points d'arrêt. Les lignes sur lesquelles est défini un point d'arrêt sont marquées de manière spéciale. Les points d'arrêt n'ont d'effet que lorsque l'exécution se déroule sous débogueur. Les points d'arrêt pour un fichier sont enregistrés dans le dossier ``.idlerc`` de l'utilisateur.

source: Set a breakpoint on the current line.
fr: Place un point d'arrêt sur la ligne active.

source: Clear the breakpoint on that line.
fr: Enlève le point d'arrêt sur cette ligne.

source: Shell and Output windows also have the following.
fr: Les fenêtres de console et d'affichage disposent en plus des éléments suivants.

source: Same as in Debug menu.
fr: Même effet que dans le menu *Debug*.

source: The Shell window also has an output squeezing facility explained in the *Python Shell window* subsection below.
fr: Les fenêtres de console ont également une fonction de réduction des sorties détaillée dans la sous-section *fenêtre de console de Python* ci-dessous.

source: If the cursor is over an output line, squeeze all the output between the code above and the prompt below down to a 'Squeezed text' label.
fr: Si le curseur est sur une ligne d'affichage, compacte toute la sortie entre le code au-dessus et l'invite en-dessous en un bouton *"Squeezed text"*.

source: Editing and navigation
fr: Édition et navigation

source: Editor windows
fr: Fenêtre d'édition

source: IDLE may open editor windows when it starts, depending on settings and how you start IDLE. Thereafter, use the File menu. There can be only one open editor window for a given file.
fr: *IDLE* peut ouvrir une fenêtre d'édition quand il démarre, selon les paramètres et la manière dont vous démarrez *IDLE*. Ensuite, utilisez le menu *File*. Il ne peut y avoir qu'une fenêtre d'édition pour un fichier donné.

source: The title bar contains the name of the file, the full path, and the version of Python and IDLE running the window. The status bar contains the line number ('Ln') and column number ('Col'). Line numbers start with 1; column numbers with 0.
fr: La barre de titre contient le nom du fichier, le chemin absolu et la version de Python et d'*IDLE* s'exécutant dans la fenêtre. La barre de statut contient le numéro de ligne ("*Ln"*) et le numéro de la colonne ("*Col"*). Les numéros de ligne commencent à 1 ; les numéros de colonne commencent à 0.
