Repository: python/python-docs-fr
Catalog: library/idle.po
Languages: fr

source: For SyntaxError tracebacks, the normal '^' marking where the error was detected is replaced by coloring the text with an error highlight. When code run from a file causes other exceptions, one may right click on a traceback line to jump to the corresponding line in an IDLE editor. The file will be opened if necessary.
fr: Pour les *traceback* de *SyntaxError*, le *"^"* habituel marquant l'endroit où l'erreur a été détectée est remplacé par la coloration et le surlignage du texte avec une erreur. Quand du code exécuté depuis un fichier cause d'autres exceptions, un clic droit sur la ligne du *traceback* permet d'accéder à la ligne correspondante dans un éditeur *IDLE*. Le fichier est ouvert si nécessaire.

source: Shell has a special facility for squeezing output lines down to a 'Squeezed text' label. This is done automatically for output over N lines (N = 50 by default). N can be changed in the PyShell section of the General page of the Settings dialog. Output with fewer lines can be squeezed by right clicking on the output. This can be useful lines long enough to slow down scrolling.
fr: La console a une fonctionnalité spéciale pour réduire les lignes de sorties à une étiquette *"Squeezed text"*. Ceci est fait automatiquement pour un sortie de plus de N lignes (N = 50 par défaut). N peut être changé dans la section *PyShell* de la page *General* de la fenêtre de configuration. Les sorties avec moins de lignes peuvent être réduites par un clic droit sur la sortie. Ceci peut être utile sur des lignes si longues qu'elles ralentissent la navigation.

source: Squeezed output is expanded in place by double-clicking the label. It can also be sent to the clipboard or a separate view window by right-clicking the label.
fr: Les sorties réduites sont étendues sur place en double-cliquant sur l'étiquette Elles peuvent aussi être envoyées au presse-papier ou sur un fenêtre séparée par un clic-droit sur l'étiquette.

source: Developing tkinter applications
fr: Développer des applications *tkinter*

source: IDLE is intentionally different from standard Python in order to facilitate development of tkinter programs. Enter ``import tkinter as tk; root = tk.Tk()`` in standard Python and nothing appears. Enter the same in IDLE and a tk window appears. In standard Python, one must also enter ``root.update()`` to see the window. IDLE does the equivalent in the background, about 20 times a second, which is about every 50 milliseconds. Next enter ``b = tk.Button(root, text='button'); b.pack()``. Again, nothing visibly changes in standard Python until one enters ``root.update()``.
fr: *IDLE* est intentionnellement différent de Python standard dans le but de faciliter le développement des programmes *tkinter*. Saisissez ``import *tkinter* as tk; root = tk.Tk()`` avec Python standard, rien n'apparaît. Saisissez la même chose dans *IDLE* et une fenêtre *tk* apparaît. En Python standard, il faut également saisir ``root.update()`` pour voir la fenêtre. *IDLE* fait un équivalent mais en arrière-plan, environ 20 fois par seconde, soit environ toutes les 50 millisecondes. Ensuite, saisissez ``b = tk.Button(root, text='button'); b.pack()``. De la même manière, aucun changement n'est visible en Python standard jusqu'à la saisie de ``root.update()``.

source: Most tkinter programs run ``root.mainloop()``, which usually does not return until the tk app is destroyed. If the program is run with ``python -i`` or from an IDLE editor, a ``>>>`` shell prompt does not appear until ``mainloop()`` returns, at which time there is nothing left to interact with.
fr: La plupart des programmes *tkinter* exécutent ``root.mainloop()``, qui d'habitude ne renvoie pas jusqu'à ce que l'application *tk* soit détruite. Si le programme est exécuté avec ``python -i``ou depuis un éditeur *IDLE*, une invite de commande ``>>>`` n'apparaît pas tant que ``mainloop()`` ne termine pas, c'est-à-dire quand il ne reste plus rien avec lequel interagir.

source: When running a tkinter program from an IDLE editor, one can comment out the mainloop call. One then gets a shell prompt immediately and can interact with the live application. One just has to remember to re-enable the mainloop call when running in standard Python.
fr: Avec un programme *tkinter* exécuté depuis un éditeur *IDLE*, vous pouvez immédiatement commenter l'appel à *mainloop*. On a alors accès à une invite de commande et on peut interagir en direct avec l'application. Il faut juste se rappeler de réactiver l'appel à *mainloop* lors de l'exécution en Python standard.

source: Running without a subprocess
fr: Exécution sans sous-processus

source: If the attempt to make the socket connection fails, Idle will notify you. Such failures are sometimes transient, but if persistent, the problem may be either a firewall blocking the connection or misconfiguration of a particular system. Until the problem is fixed, one can run Idle with the -n command line switch.
fr: Si la tentative de connexion par le *socket* échoue, *IDLE* vous le notifie. Ce genre d'échec est parfois temporaire, mais s'il persiste, le problème peut soit venir d'un pare-feu qui bloque la connexion ou d'une mauvaise configuration dans un système particulier. Jusqu'à ce que le problème soit résolu, vous pouvez exécuter *IDLE* avec l'option *-n* de la ligne de commande.

source: If IDLE is started with the -n command line switch it will run in a single process and will not create the subprocess which runs the RPC Python execution server. This can be useful if Python cannot create the subprocess or the RPC socket interface on your platform. However, in this mode user code is not isolated from IDLE itself. Also, the environment is not restarted when Run/Run Module (F5) is selected. If your code has been modified, you must reload() the affected modules and re-import any specific items (e.g. from foo import baz) if the changes are to take effect. For these reasons, it is preferable to run IDLE with the default subprocess if at all possible.
fr: Si *IDLE* est démarré avec l'option *-n* de la ligne de commande, il s'exécute dans un seul processus et ne crée pas de sous-processus pour exécuter le serveur RPC d'exécution de Python. Ceci peut être utile si Python ne peut pas créer de sous-processus ou de connecteur *RPC* sur votre plateforme. Cependant, dans ce mode, le code de l'utilisateur n'est pas isolé de *IDLE* lui-même. De plus, l'environnement n'est pas réinitialisé quand *Run/Run Module* (`F5`) est sélectionné. Si votre code a été modifié, vous devez *reload*() les modules affectés et ré-importer tous les éléments spécifiques (e.g. *from foo import baz*) pour que les changements prennent effet. Pour toutes ces raisons, il est préférable d'exécuter *IDLE* avec le sous-processus par défaut si c'est possible.

source: Help and preferences
fr: Aide et préférences

source: Help sources
fr: Sources d'aide

source: Help menu entry "IDLE Help" displays a formatted html version of the IDLE chapter of the Library Reference. The result, in a read-only tkinter text window, is close to what one sees in a web browser. Navigate through the text with a mousewheel, the scrollbar, or up and down arrow keys held down. Or click the TOC (Table of Contents) button and select a section header in the opened box.
fr: L'entrée du menu d'aide *"IDLE Help"* affiche une version *html* formatée du chapitre sur *IDLE* de la *Library Reference*. Le résultat, dans une fenêtre de texte *tkinter* en lecture-seule, est proche de ce qu'on voit dans un navigateur. Naviguez dans le texte avec la molette de la souris, la barre de défilement ou avec les touches directionnelles du clavier enfoncées. Ou cliquez sur le bouton TOC (*Table of Contents* : sommaire) et sélectionnez un titre de section dans l'espace ouvert.

source: Help menu entry "Python Docs" opens the extensive sources of help, including tutorials, available at ``docs.python.org/x.y``, where 'x.y' is the currently running Python version. If your system has an off-line copy of the docs (this may be an installation option), that will be opened instead.
fr: L'entrée du menu d'aide *"Python Docs"* ouvre les sources d'aide détaillées, incluant des tutoriels, disponibles sur https://docs.python.org/x.y, avec *"x.y"* la version de Python en cours d'exécution. Si votre système a une copie locale de la documentation (cela peut être une option d'installation), c'est elle qui est ouverte.

source: Selected URLs can be added or removed from the help menu at any time using the General tab of the Configure IDLE dialog.
fr: Les URL sélectionnées peuvent être ajoutées ou enlevées du menu d'aide à n'importe quel moment en utilisant l'onglet « *General* » de la fenêtre « Configure IDLE ».

source: Setting preferences
fr: Modifier les préférences

source: The font preferences, highlighting, keys, and general preferences can be changed via Configure IDLE on the Option menu. Non-default user settings are saved in a ``.idlerc`` directory in the user's home directory. Problems caused by bad user configuration files are solved by editing or deleting one or more of the files in ``.idlerc``.
fr: Les préférences de polices, surlignage, touches et les préférences générales peuvent être changées via « Configure IDLE » dans le menu « Options ». Les paramètres modifiés par l'utilisateur sont enregistrés dans un dossier ``.idlerc`` dans le dossier personnel de l'utilisateur. Les problèmes causés par des fichiers de configuration utilisateur corrompus sont résolus en modifiant ou en supprimant un ou plusieurs fichiers dans *.idlerc*.

source: On the Font tab, see the text sample for the effect of font face and size on multiple characters in multiple languages. Edit the sample to add other characters of personal interest. Use the sample to select monospaced fonts. If particular characters have problems in Shell or an editor, add them to the top of the sample and try changing first size and then font.
fr: Dans l'onglet *Fonts*, regardez les échantillons de texte pour voir l'effet de la police et de la taille sur de multiples caractères de multiples langues. Éditez les échantillons pour ajouter d'autres caractères qui vous intéressent. Utilisez les échantillons pour sélectionner les polices à largeur constante. Si certains caractères posent des difficultés dans la console ou l'éditeur, ajoutez-les en haut des échantillons et essayez de changer d'abord la taille, puis la fonte.

source: On the Highlights and Keys tab, select a built-in or custom color theme and key set. To use a newer built-in color theme or key set with older IDLEs, save it as a new custom theme or key set and it well be accessible to older IDLEs.
fr: Dans les onglets *Highlights* et *Keys*, sélectionnez un ensemble de couleurs et de raccourcis pré-inclus ou personnalisé. Pour utiliser un ensemble de couleurs et de raccourcis récent avec une version d'*IDLE* plus ancienne, enregistrez-le en tant que nouveau thème ou ensemble de raccourcis personnalisé ; il sera alors accessible aux *IDLE* plus anciens.

source: IDLE on macOS
fr: *IDLE* sous *macOS*

source: Under System Preferences: Dock, one can set "Prefer tabs when opening documents" to "Always". This setting is not compatible with the tk/tkinter GUI framework used by IDLE, and it breaks a few IDLE features.
fr: Dans *System Preferences: Dock*, on peut mettre *"Prefer tabs when opening documents"* à la valeur *"Always"*. Ce paramètre n'est pas compatible avec le cadriciel *tk/tkinter* utilisé par *IDLE* et il casse quelques fonctionnalités d'*IDLE*.

source: IDLE contains an extension facility. Preferences for extensions can be changed with the Extensions tab of the preferences dialog. See the beginning of config-extensions.def in the idlelib directory for further information. The only current default extension is zzdummy, an example also used for testing.
fr: *IDLE* inclut un outil d'extensions. Les préférences pour les extensions peuvent être changées avec l'onglet Extensions de la fenêtre de préférences. Lisez le début de *config-extensions.def* dans le dossier *idlelib* pour plus d'informations. La seule extension actuellement utilisée par défaut est *zzdummy*, un exemple également utilisé pour les tests.
