Repository: python/python-docs-fr
Catalog: library/inspect.po
Languages: fr

source: :mod:`inspect` --- Inspect live objects
fr: :mod:`inspect` — Inspection d'objets

source: **Source code:** :source:`Lib/inspect.py`
fr: **Code source :** :source:`Lib/inspect.py`

source: The :mod:`inspect` module provides several useful functions to help get information about live objects such as modules, classes, methods, functions, tracebacks, frame objects, and code objects. For example, it can help you examine the contents of a class, retrieve the source code of a method, extract and format the argument list for a function, or get all the information you need to display a detailed traceback.
fr: Le module :mod:`inspect` implémente plusieurs fonctions permettant d'obtenir de l'information à propos d'objets tels que les modules, classes, méthodes, fonctions, traces de piles, cadres d'exécution et objets code. Par exemple, il permet d'inspecter le contenu d'une classe, de retrouver le code source d'une méthode, d'extraire et de mettre en forme une liste d'arguments pour une fonction, ou obtenir toute l'information nécessaire pour afficher une pile d'appels détaillée.

source: There are four main kinds of services provided by this module: type checking, getting source code, inspecting classes and functions, and examining the interpreter stack.
fr: Ce module donne accès à 4 types de services : vérification de typage, obtention de code source, inspection de classes et de fonctions et examen de la pile d'exécution.

source: Types and members
fr: Types et membres

source: The :func:`getmembers` function retrieves the members of an object such as a class or module. The functions whose names begin with "is" are mainly provided as convenient choices for the second argument to :func:`getmembers`. They also help you determine when you can expect to find the following special attributes:
fr: La fonction :func:`getmembers` retrouve les membres d'un objet, tel qu'une classe ou un module. Les fonctions avec le préfixe *is* sont pratiques en tant que deuxième argument à :func:`getmembers`. Elles permettent aussi de déterminer si on peut s'attendre à trouver les attributs spéciaux suivants :

source: Attribute
fr: Attribut

source: documentation string
fr: texte de documentation

source: filename (missing for built-in modules)
fr: nom de fichier (inexistant pour les fonctions natives)

source: class
fr: classe

source: name with which this class was defined
fr: nom de la classe lors de sa définition

source: qualified name
fr: nom qualifié

source: name of module in which this class was defined
fr: nom du module contenant la classe lors de sa définition

source: method
fr: méthode

source: name with which this method was defined
fr: nom de la méthode lors de sa définition

source: function object containing implementation of method
fr: objet fonction contenant l'implémentation de la méthode

source: instance to which this method is bound, or ``None``
fr: instance à laquelle cette méthode est liée, ou ``None``

source: name of module in which this method was defined
fr: nom du module contenant la méthode lors de sa définition

source: function
fr: fonction

source: name with which this function was defined
fr: nom de la fonction lors de sa définition

source: code object containing compiled function :term:`bytecode`
fr: objet code contenant le :term:`code intermédiaire <bytecode>` d'une fonction compilée

source: tuple of any default values for positional or keyword parameters
fr: *n*-uplet de valeurs par défaut pour arguments positionnels ou nommés

source: mapping of any default values for keyword-only parameters
fr: tableau de correspondance de valeurs par défaut pour les paramètres nommés

source: global namespace in which this function was defined
fr: espace de nommage global lors de la définition de la fonction

source: mapping of parameters names to annotations; ``"return"`` key is reserved for return annotations.
fr: tableau de correspondance des paramètres à leur annotation ; ``"return"`` est un mot-clé réservé pour les annotations de type renvoyé.

source: name of module in which this function was defined
fr: nom du module contenant la fonction lors de sa définition

source: frame object at this level
fr: objet cadre à ce niveau

source: index of last attempted instruction in bytecode
fr: index de la dernière instruction lancée dans le code intermédiaire (``bytecode``)

source: current line number in Python source code
fr: numéro de ligne courant dans le code source Python

source: next inner traceback object (called by this level)
fr: trace de pile interne suivante (appel par le cadre courant)

source: frame
fr: cadre

source: next outer frame object (this frame's caller)
fr: trace d'exécution externe suivante (le contexte appelant du cadre courant)

source: builtins namespace seen by this frame
fr: espace de nommage natif du cadre courant

source: code object being executed in this frame
fr: objet code exécuté dans le cadre courant

source: global namespace seen by this frame
fr: espace de nommage global tel que vu par cadre courant

source: local namespace seen by this frame
fr: espace de nommage local du cadre courant

source: tracing function for this frame, or ``None``
fr: fonction de traçage du cadre courant, ou ``None``

source: number of arguments (not including keyword only arguments, \* or \*\* args)
fr: nombre d'arguments (excluant les arguments *keyword-only*, \* ou \*\*)

source: string of raw compiled bytecode
fr: texte du code intermédiaire compilé

source: tuple of names of cell variables (referenced by containing scopes)
fr: *n*-uplet du nom des cellules variables (référencées par leur contexte)

source: tuple of constants used in the bytecode
fr: *n*-uplet des constantes utilisées dans le code intermédiaire (``bytecode``)

source: name of file in which this code object was created
fr: nom du fichier dans lequel cet objet code a été créé

source: number of first line in Python source code
fr: numéro de la première ligne dans le code source Python

source: bitmap of ``CO_*`` flags, read more :ref:`here <inspect-module-co-flags>`
fr: **bitmap** des options ``CO_*``, voir plus :ref:`ici <inspect-module-co-flags>`

source: encoded mapping of line numbers to bytecode indices
fr: tableau de correspondance encodée des numéros de ligne aux numéros d'indices du code intermédiaire (``bytecode``)

source: tuple of names of free variables (referenced via a function's closure)
fr: *n*-uplet des noms de variables libres (référencées par la fermeture (*closure* en anglais) d'une fonction)

source: number of positional only arguments
fr: nombre d'arguments positionnels

source: number of keyword only arguments (not including \*\* arg)
fr: nombre d'arguments *keywords-only* (excluant les arguments \*\*)

source: name with which this code object was defined
fr: nom de l'objet code lors de sa définition

source: number of local variables
fr: nombre de variables locales

source: virtual machine stack space required
fr: espace requis pour la pile de la machine virtuelle

source: tuple of names of arguments and local variables
fr: *n*-uplet des noms des arguments et variables locales

source: name
fr: nom

source: is the generator running?
fr: est-ce que le générateur est en cours d'exécution ?

source: object being iterated by ``yield from``, or ``None``
fr: objet pointé par l'itérateur ``yield from``, ou ``None``

source: object being awaited on, or ``None``
fr: objet sur lequel on attend (*await*) présentement, ou ``None``

source: is the coroutine running?
fr: est-ce que la coroutine est en cours d'exécution ?

source: where coroutine was created, or ``None``. See |coroutine-origin-link|
fr: lieu de création de la coroutine, ou ``None``. Voir |coroutine-origin-link|

source: original name of this function or method
fr: nom originel de cette fonction ou méthode

source: instance to which a method is bound, or ``None``
fr: instance à laquelle est liée une méthode, ou ``None``

source: Add ``__qualname__`` and ``gi_yieldfrom`` attributes to generators.
fr: ajout des attributs ``__qualname`` et ``gi_yieldfrom`` aux générateurs.

source: The ``__name__`` attribute of generators is now set from the function name, instead of the code name, and it can now be modified.
fr: L'attribut ``__name__`` du générateur est maintenant déterminé par le nom de la fonction, plutôt que le nom du code, et peut maintenant être modifié.

source: Add ``cr_origin`` attribute to coroutines.
fr: Ajout de l'attribut ``cr_origin`` aux coroutines.

source: Return all the members of an object in a list of ``(name, value)`` pairs sorted by name. If the optional *predicate* argument—which will be called with the ``value`` object of each member—is supplied, only members for which the predicate returns a true value are included.
fr: Renvoie tous les membres d'un objet sous la forme d'une liste de paires ``(nom, valeur)``, ordonnée par nom. Si l'argument *predicate* (qui sera appelé avec la ``valeur`` de chaque membre) est fourni, seuls les membres pour lequel le prédicat est vrai seront inclus.

source: :func:`getmembers` will only return class attributes defined in the metaclass when the argument is a class and those attributes have been listed in the metaclass' custom :meth:`__dir__`.
fr: :func:`getmembers` renvoie les attributs de classe définis dans la métaclasse seulement lorsque l'argument est une classe et que ces attributs ont été listés dans la méthode personnalisée :meth:`__dir__` de cette métaclasse.

source: Return the name of the module named by the file *path*, without including the names of enclosing packages. The file extension is checked against all of the entries in :func:`importlib.machinery.all_suffixes`. If it matches, the final path component is returned with the extension removed. Otherwise, ``None`` is returned.
fr: Renvoie le nom du module indiqué par le fichier *path*, excluant le nom des paquets englobants. L'extension du fichier est vérifiée parmi toutes les entrées renvoyées par :func:`importlib.machinery.all_suffixes`. S'il y a une correspondance, le chemin final est renvoyé, sans l'extension. Autrement, ``None`` est renvoyé.

source: Note that this function *only* returns a meaningful name for actual Python modules - paths that potentially refer to Python packages will still return ``None``.
fr: Notez que cette fonction renvoie un nom significatif *seulement* pour les modules Python - les chemins qui réfèrent à des paquets Python donnent toujours ``None``.

source: The function is based directly on :mod:`importlib`.
fr: La fonction est basée directement sur :mod:`importlib`.

source: Return ``True`` if the object is a module.
fr: Renvoie ``True`` si l'objet est un module.

source: Return ``True`` if the object is a class, whether built-in or created in Python code.
fr: Renvoie ``True`` si l'objet est une classe, qu'il s'agisse d'un objet natif ou qu'elle soit écrite en Python.

source: Return ``True`` if the object is a bound method written in Python.
fr: Renvoie ``True`` si l'objet est une méthode liée écrite en Python.

source: Return ``True`` if the object is a Python function, which includes functions created by a :term:`lambda` expression.
fr: Renvoie ``True`` si l'objet est une fonction Python, ce qui inclut les fonctions créées par une expression :term:`lambda <lambda>`.

source: Return ``True`` if the object is a Python generator function.
fr: Renvoie ``True`` si l'objet est un générateur.

source: Functions wrapped in :func:`functools.partial` now return ``True`` if the wrapped function is a Python generator function.
fr: les fonctions englobées dans :func:`functools.partial` renvoient maintenant ``True`` si la fonction englobée est un générateur Python.

source: Return ``True`` if the object is a generator.
fr: Renvoie ``True`` si l'objet est un générateur.

source: Return ``True`` if the object is a :term:`coroutine function` (a function defined with an :keyword:`async def` syntax).
fr: Renvoie ``True`` si l'objet est une :term:`fonction coroutine <coroutine function>` (une fonction définie avec une syntaxe :keyword:`async def`).

source: Functions wrapped in :func:`functools.partial` now return ``True`` if the wrapped function is a :term:`coroutine function`.
fr: les fonctions englobées par :func:`functools.partial` renvoient maintenant ``True`` si la fonction englobée est une :term:`coroutine <coroutine function>`.

source: Return ``True`` if the object is a :term:`coroutine` created by an :keyword:`async def` function.
fr: Renvoie ``True`` si l'objet est une :term:`coroutine <coroutine>` créée par une fonction :keyword:`async def`.

source: Return ``True`` if the object can be used in :keyword:`await` expression.
fr: Renvoie ``True`` si l'objet peut être utilisé par une expression :keyword:`await`.

source: Can also be used to distinguish generator-based coroutines from regular generators::
fr: Peut aussi être utilisé pour distinguer les coroutines basées sur un générateur des générateurs normaux ::

source: Return ``True`` if the object is an :term:`asynchronous generator` function, for example::
fr: Renvoie ``True`` si l'objet est un :term:`générateur asynchrone <asynchronous generator>`, par exemple ::

source: Functions wrapped in :func:`functools.partial` now return ``True`` if the wrapped function is a :term:`asynchronous generator` function.
fr: les fonctions englobées par :func:`functools.partial` renvoient maintenant ``True`` si la fonction englobée est une fonction :term:`génératrice asynchrone <asynchronous generator>`.

source: Return ``True`` if the object is an :term:`asynchronous generator iterator` created by an :term:`asynchronous generator` function.
fr: Renvoie ``True`` si l'objet est un :term:`itérateur de générateur asynchrone <asynchronous generator iterator>` créé par une fonction :term:`génératrice asynchrone <asynchronous generator>`.

source: Return ``True`` if the object is a traceback.
fr: Renvoie ``True`` si l'objet est une trace d'exécution.

source: Return ``True`` if the object is a frame.
fr: Renvoie ``True`` si l'objet est un cadre.

source: Return ``True`` if the object is a code.
fr: Renvoie ``True`` si l'objet est un code.

source: Return ``True`` if the object is a built-in function or a bound built-in method.
fr: Renvoie ``True`` si l'objet est une fonction native ou une méthode liée native.

source: Return ``True`` if the object is a user-defined or built-in function or method.
fr: Renvoie ``True`` si l'objet est une fonction, qu'elle soit définie par l'utilisateur, native, ou une méthode.

source: Return ``True`` if the object is an abstract base class.
fr: Renvoie ``True`` si l'objet est une classe de base abstraite.

source: Return ``True`` if the object is a method descriptor, but not if :func:`ismethod`, :func:`isclass`, :func:`isfunction` or :func:`isbuiltin` are true.
fr: Renvoie ``True`` si l'objet est un descripteur de méthode sauf si :func:`ismethod`, :func:`isclass`, :func:`isfunction` ou :func:`isbuiltin` sont vrais (``True``).

source: This, for example, is true of ``int.__add__``. An object passing this test has a :meth:`~object.__get__` method but not a :meth:`~object.__set__` method, but beyond that the set of attributes varies. A :attr:`~definition.__name__` attribute is usually sensible, and :attr:`__doc__` often is.
fr: Cela est par exemple vrai pour ``int.__add__``. Un objet qui passe ce test a une méthode :meth:`~object.__get__`, pas de méthode :meth:`~object.__set__`, sans être regardant sur les autres les attributs. Un attribut :attr:`~definition.__name__` sera souvent présent et :attr:`__doc__` également.

source: Methods implemented via descriptors that also pass one of the other tests return ``False`` from the :func:`ismethoddescriptor` test, simply because the other tests promise more -- you can, e.g., count on having the :attr:`__func__` attribute (etc) when an object passes :func:`ismethod`.
fr: Les méthodes implémentées via descripteurs et qui passent l'un ou l'autre des tests renvoie ``False`` pour :func:`ismethoddescriptor`, simplement parce que les autres tests garantissent davantage — vous pouvez supposer l'existence d'un attribut :attr:`__func__` (etc.) lorsqu'un objet renvoie ``True`` pour :func:`ismethod` .

source: Return ``True`` if the object is a data descriptor.
fr: Renvoie ``True`` si l'objet est un descripteur de données.

source: Data descriptors have a :attr:`~object.__set__` or a :attr:`~object.__delete__` method. Examples are properties (defined in Python), getsets, and members. The latter two are defined in C and there are more specific tests available for those types, which is robust across Python implementations. Typically, data descriptors will also have :attr:`~definition.__name__` and :attr:`__doc__` attributes (properties, getsets, and members have both of these attributes), but this is not guaranteed.
fr: Les descripteurs de données ont une méthode :attr:`~object.__set__` ou :attr:`~object.__delete__`. Par exemple les propriétés (définies en Python), *getsets* et les membres. Les 2 derniers sont définis en C et il existe des tests plus spécifiques disponibles pour ceux-ci qui sont robustes à travers les implémentations Python. Normalement, les descripteurs de données auront aussi les attributs :attr:`~definition.__name__` et :attr:`~definition.__doc__` (les propriétés, *getsets* et membres auront les deux), mais cela n'est pas garanti.

source: Return ``True`` if the object is a getset descriptor.
fr: Renvoie ``True`` si l'objet est un descripteur *getset*.

source: getsets are attributes defined in extension modules via :c:type:`PyGetSetDef` structures. For Python implementations without such types, this method will always return ``False``.
fr: *getsets* sont des attributs définis dans des extensions de modules via des structures :c:type:`PyGetSetDef`. Pour les implémentations Python ne possédant pas ces types, cette méthode renvoie toujours ``False``.

source: Return ``True`` if the object is a member descriptor.
fr: Renvoie ``True`` si l'objet est un membre descripteur.

source: Member descriptors are attributes defined in extension modules via :c:type:`PyMemberDef` structures. For Python implementations without such types, this method will always return ``False``.
fr: Les membres descripteurs sont des attributs définis dans des extensions de modules via des structures :c:type:`PyMemberDef`. Pour les implémentations Python ne possédant pas ces types, cette méthode renvoie toujours ``False``.

source: Retrieving source code
fr: Récupération du code source

source: Documentation strings are now inherited if not overridden.
fr: les chaînes de documentation sont maintenant héritées si elles ne sont pas surchargées.

source: Return in a single string any lines of comments immediately preceding the object's source code (for a class, function, or method), or at the top of the Python source file (if the object is a module). If the object's source code is unavailable, return ``None``. This could happen if the object has been defined in C or the interactive shell.
fr: Renvoie en une chaîne de caractères toute ligne de commentaire qui précède immédiatement le code source de l'objet (pour une classe, fonction ou méthode) ou en début d'un fichier de code source Python (si l'objet est un module). Si le code source de l'objet n'est pas disponible, renvoie ``None``. Cela peut se produire si l'objet a été défini en C ou dans un interpréteur interactif.

source: Return the name of the (text or binary) file in which an object was defined. This will fail with a :exc:`TypeError` if the object is a built-in module, class, or function.
fr: Renvoie le nom du fichier (texte ou binaire) dans lequel un objet a été défini. Cette méthode échoue avec :exc:`TypeError` si l'objet est un module, une classe ou une fonction native.

source: Return a list of source lines and starting line number for an object. The argument may be a module, class, method, function, traceback, frame, or code object. The source code is returned as a list of the lines corresponding to the object and the line number indicates where in the original source file the first line of code was found. An :exc:`OSError` is raised if the source code cannot be retrieved.
fr: Renvoie une liste de lignes du code source et le numéro de la première ligne d'un objet. L'argument peut être un module, classe, méthode, fonction, trace d'exécution, cadre ou objet code. Le code source est renvoyé comme une liste des lignes correspondant à l'objet, et le numéro de ligne indique la position à laquelle la première ligne de code a été trouvée. Une :exc:`OSError` est levée si le code source ne peut être retrouvé.

source: :exc:`OSError` is raised instead of :exc:`IOError`, now an alias of the former.
fr: :exc:`OSError` est levé plutôt que :exc:`IOError`, qui est maintenant un alias de ce premier.

source: Return the text of the source code for an object. The argument may be a module, class, method, function, traceback, frame, or code object. The source code is returned as a single string. An :exc:`OSError` is raised if the source code cannot be retrieved.
fr: Renvoie le texte du code source pour un objet. L'argument peut être un module, classe, méthode, fonction, trace de pile, cadre ou objet code. Le code source est renvoyé comme une seule chaîne de caractères. :exc:`OSError` est levé si le code source ne peut être retrouvé.

source: Clean up indentation from docstrings that are indented to line up with blocks of code.
fr: Nettoie les indentations des chaînes de documentation qui sont indentées de manières à s'aligner avec les blocs de code.

source: All leading whitespace is removed from the first line. Any leading whitespace that can be uniformly removed from the second line onwards is removed. Empty lines at the beginning and end are subsequently removed. Also, all tabs are expanded to spaces.
fr: Enlève tous les espaces blancs en début de ligne à partir de la première. Tout espace blanc en début de ligne qui puisse être enlevé de manière uniforme à partir de la seconde ligne le sera. Les lignes vides en début et en fin de document seront ensuite enlevées. Les tabulations seront converties en espaces.

source: Introspecting callables with the Signature object
fr: Introspection des appelables avec l'objet Signature

source: The Signature object represents the call signature of a callable object and its return annotation. To retrieve a Signature object, use the :func:`signature` function.
fr: L'objet Signature représente la signature de l'appel et de la valeur renvoyée d'un objet appelable. Utilisez la fonction :func:`signature` pour obtenir ces signatures.

source: Return a :class:`Signature` object for the given ``callable``::
fr: Renvoie un objet :class:`Signature` pour un ``appelable`` ::

source: Accepts a wide range of Python callables, from plain functions and classes to :func:`functools.partial` objects.
fr: La fonction accepte une grande étendue d'appelables Python, des fonctions et classes jusqu'aux objets :func:`functools.partials`.

source: A slash(/) in the signature of a function denotes that the parameters prior to it are positional-only. For more info, see :ref:`the FAQ entry on positional-only parameters <faq-positional-only-arguments>`.
fr: Une barre oblique (``/``) dans la signature d'une fonction dénote que les paramètres qui précèdent sont exclusivement positionnels. Pour plus d'information, voir :ref:`l'entrée de la FAQ sur les arguments exclusivement positionnels <faq-positional-only-arguments>`.

source: ``follow_wrapped`` parameter. Pass ``False`` to get a signature of ``callable`` specifically (``callable.__wrapped__`` will not be used to unwrap decorated callables.)
fr: paramètre ``follow_wrapped``. Passez ``False`` pour obtenir une signature ``callable`` plus spécifiquement (``callable.__wrapped__`` ne sera pas utilisé pour dépouiller un appelable décoré.)
