Repository: python/python-docs-fr
Catalog: library/inspect.po
Languages: fr

source: *stop* is an optional callback accepting an object in the wrapper chain as its sole argument that allows the unwrapping to be terminated early if the callback returns a true value. If the callback never returns a true value, the last object in the chain is returned as usual. For example, :func:`signature` uses this to stop unwrapping if any object in the chain has a ``__signature__`` attribute defined.
fr: *stop* est une fonction de *callback* optionnelle qui accepte un objet de la chaîne englobée comme son seul argument et permet d'arrêter le déballage avant la fin si la fonction de *callback* renvoie une valeur vraie. Si la fonction *callback* ne renvoie jamais une valeur vraie, le dernier objet de la chaîne est renvoyé comme d'habitude. Par exemple, :func:`signature` utilise ceci pour arrêter le déballage si un objet dans la chaîne définit un attribut ``__signature__``.

source: :exc:`ValueError` is raised if a cycle is encountered.
fr: :exc:`ValueError` est levée si un cycle est rencontré.

source: The interpreter stack
fr: La pile d'interpréteur

source: Return a named tuple instead of a tuple.
fr: renvoie un *n*-uplet nommé plutôt qu'un *n*-uplet simple.

source: Keeping references to frame objects, as found in the first element of the frame records these functions return, can cause your program to create reference cycles. Once a reference cycle has been created, the lifespan of all objects which can be accessed from the objects which form the cycle can become much longer even if Python's optional cycle detector is enabled. If such cycles must be created, it is important to ensure they are explicitly broken to avoid the delayed destruction of objects and increased memory consumption which occurs.
fr: Conserver des références à des objets cadre, tel que trouvé dans le 1er élément des enregistrements de cadres que ces fonctions renvoient, peut créer des cycles de référence dans votre programme. Lorsqu'un cycle de référence a été créé, la durée de vie de tous les objets pouvant être accessibles par ces objets peut être grandement augmentée, même si le détecteur de cycle (optionnel) de Python est activé. Si ces cycles doivent être créés, il est important de s'assurer qu'ils soient explicitement brisés pour éviter la destruction reportée des objets et l'augmentation résultante de l'utilisation de la mémoire.

source: Though the cycle detector will catch these, destruction of the frames (and local variables) can be made deterministic by removing the cycle in a :keyword:`finally` clause. This is also important if the cycle detector was disabled when Python was compiled or using :func:`gc.disable`. For example::
fr: Bien que le détecteur trouvera ces cycles, la destruction des cadres (et variables locales) peut être fait de manière déterministe en enlevant les cycles dans une clause :keyword:`finally`. Cela est important si le détecteur de cycle a été désactivé lors de la compilation du code Python ou en utilisant :func:`gc.disable`. Par exemple ::

source: If you want to keep the frame around (for example to print a traceback later), you can also break reference cycles by using the :meth:`frame.clear` method.
fr: Pour conserver ces cadres (par exemple pour imprimer une trace d'exécution plus tard), vous pouvez briser ces cycles de référence en utilisant la méthode :meth:`frame.clear`.

source: The optional *context* argument supported by most of these functions specifies the number of lines of context to return, which are centered around the current line.
fr: L'argument optionnel *context* supporté par la plupart de ces méthodes spécifie le nombre de lignes de contexte à renvoyer, qui sera centré autour de la ligne courante.

source: A list of :term:`named tuples <named tuple>` ``FrameInfo(frame, filename, lineno, function, code_context, index)`` is returned.
fr: une liste de :term:`n-uplet nommé <named tuple>` ``FrameInfo(frame, filename, lineno, function, code_context, index)`` est renvoyée.

source: Return the frame object for the caller's stack frame.
fr: Renvoie l'objet cadre de la pile pour le cadre de l’appelant.

source: This function relies on Python stack frame support in the interpreter, which isn't guaranteed to exist in all implementations of Python. If running in an implementation without Python stack frame support this function returns ``None``.
fr: cette fonction nécessite que l'interpréteur Python implémente une pile de cadres d'appel, ce qui n'est pas forcément le cas de toutes les implémentations Python. Si le code s'exécute dans une implémentation Python n'implémentant pas la pile de cadres, cette fonction renvoie ``None``.

source: Fetching attributes statically
fr: Recherche dynamique d'attributs

source: Both :func:`getattr` and :func:`hasattr` can trigger code execution when fetching or checking for the existence of attributes. Descriptors, like properties, will be invoked and :meth:`__getattr__` and :meth:`__getattribute__` may be called.
fr: :func:`getattr` et :func:`hasattr` peuvent tous deux engendrer l'exécution de code lors la recherche ou vérification de l'existence d'attributs. Les descripteurs, comme les propriétés, seront invoqués et :meth:`__getattr__` et :meth:`__getattribute__` peuvent être appelés.

source: For cases where you want passive introspection, like documentation tools, this can be inconvenient. :func:`getattr_static` has the same signature as :func:`getattr` but avoids executing code when it fetches attributes.
fr: Pour les cas où une introspection passive est désirée, comme des outils de documentation, cela peut être inconvenable. :func:`getattr_static` possède la même signature que :func:`getattr`, mais évite l'exécution de code lors de la recherche d'attributs.

source: Retrieve attributes without triggering dynamic lookup via the descriptor protocol, :meth:`__getattr__` or :meth:`__getattribute__`.
fr: Retrouve des attributs sans lancer une recherche dynamique via le protocole descripteur, :meth:`__getattr__` ou :meth:`__getattribute__`.

source: Note: this function may not be able to retrieve all attributes that getattr can fetch (like dynamically created attributes) and may find attributes that getattr can't (like descriptors that raise AttributeError). It can also return descriptors objects instead of instance members.
fr: Note : cette fonction ne retrouve pas forcément tous les attributs renvoyés par *getattr* (tel que des attributs générés dynamiquement) et pourrait retrouver des attributs non retrouvés par *getattr* (tel que des descripteurs qui lèvent un *AttributeError*). Elle peut aussi donner des objets descripteurs, plutôt que des membres d'instance.

source: If the instance :attr:`~object.__dict__` is shadowed by another member (for example a property) then this function will be unable to find instance members.
fr: Si l'instance :attr:`~object.__dict__` est cachée (*shadowed*) par un autre membre (par exemple une propriété), cette fonction ne pourra pas retrouver les membres de l'instance.

source: :func:`getattr_static` does not resolve descriptors, for example slot descriptors or getset descriptors on objects implemented in C. The descriptor object is returned instead of the underlying attribute.
fr: :func:`getattr_static` ne résout pas les descripteurs, par exemple *slot descriptors* ou les descripteurs *getset* des objets implémentés en C. Le descripteur de l'objet est renvoyé plutôt que l'attribut sous-jacent.

source: You can handle these with code like the following. Note that for arbitrary getset descriptors invoking these may trigger code execution::
fr: Vous pouvez gérer ces cas à l'aide du code suivant. Notez que pour des descripteurs arbitraires *getset* les invoquant, de l'exécution de code pourrait être lancée :

source: Current State of Generators and Coroutines
fr: État courant de Générateurs et Coroutines

source: When implementing coroutine schedulers and for other advanced uses of generators, it is useful to determine whether a generator is currently executing, is waiting to start or resume or execution, or has already terminated. :func:`getgeneratorstate` allows the current state of a generator to be determined easily.
fr: Lors de l'implémentation d'ordonnanceur de coroutine et autres utilisations avancées de générateurs, il est utile de déterminer si un générateur est présentement en cours d'exécution, en attente de démarrage ou de continuation, ou s'il a déjà terminé. :func:`getgeneratorstate` permet d'aisément déterminer l'état courant d'un générateur.

source: Get current state of a generator-iterator.
fr: Donne l'état courant d'un générateur-itérateur.

source: Possible states are:
fr: Les états possibles :

source: GEN_CREATED: Waiting to start execution.
fr: GEN_CREATED : En attente de démarrage d'exécution.

source: GEN_RUNNING: Currently being executed by the interpreter.
fr: GEN_RUNNING : En cours d'exécution par l'interpréteur.

source: GEN_SUSPENDED: Currently suspended at a yield expression.
fr: GEN_SUSPENDED : Présentement suspendu à une expression *yield*.

source: GEN_CLOSED: Execution has completed.
fr: GEN_CLOSED : L'exécution est complétée.

source: Get current state of a coroutine object. The function is intended to be used with coroutine objects created by :keyword:`async def` functions, but will accept any coroutine-like object that has ``cr_running`` and ``cr_frame`` attributes.
fr: Donne l'état courant d'un objet coroutine. L'utilisation est prévue avec des objets coroutine créés avec des fonctions :keyword:`async def`, mais accepte n'importe quel objet semblable à une coroutine qui définisse des attributs ``cr_running`` ``cr_frame``.

source: CORO_CREATED: Waiting to start execution.
fr: CORO_CREATED : En attente de démarrage d'exécution.

source: CORO_RUNNING: Currently being executed by the interpreter.
fr: CORO_RUNNING : En cours d'exécution par l'interpréteur.

source: CORO_SUSPENDED: Currently suspended at an await expression.
fr: CORO_SUSPENDED : Suspendu à une expression *await*.

source: CORO_CLOSED: Execution has completed.
fr: CORO_CLOSED : Exécution complétée.

source: The current internal state of the generator can also be queried. This is mostly useful for testing purposes, to ensure that internal state is being updated as expected:
fr: L'état courant interne du générateur peut aussi être vérifié. Ceci est utile pour des tests, afin d'assurer que l'état interne est mise à jour tel que prévu :

source: Get the mapping of live local variables in *generator* to their current values. A dictionary is returned that maps from variable names to values. This is the equivalent of calling :func:`locals` in the body of the generator, and all the same caveats apply.
fr: Donne une correspondance de variables locales dans *generator* avec les valeurs courantes. Un dictionnaire est renvoyé, établissant la correspondance entre variables et valeurs. Ceci est équivalent à appeler :func:`locals` dans le corps du générateur et les mêmes restrictions s'appliquent.

source: If *generator* is a :term:`generator` with no currently associated frame, then an empty dictionary is returned. :exc:`TypeError` is raised if *generator* is not a Python generator object.
fr: Si *generator* est un :term:`générateur <generator>` sans cadre courant associé, alors un dictionnaire vide est renvoyé. :exc:`TypeError` est levé sir *generator* n'est pas un objet générateur Python.

source: This function relies on the generator exposing a Python stack frame for introspection, which isn't guaranteed to be the case in all implementations of Python. In such cases, this function will always return an empty dictionary.
fr: Cette fonction repose sur l'exposition d'une pile de cadres Python par le générateur pour l'introspection, ce qui n'est pas garanti dans toutes les implémentations Python. Dans un tel cas, cette fonction renvoie toujours un dictionnaire vide.

source: This function is analogous to :func:`~inspect.getgeneratorlocals`, but works for coroutine objects created by :keyword:`async def` functions.
fr: Cette fonction est semblable à :func:`~inspect.getgeneratorlocals`, mais fonctionne pour des objets coroutines créés avec des fonctions :keyword:`async def`.

source: Code Objects Bit Flags
fr: Bit d'option des objets code

source: Python code objects have a ``co_flags`` attribute, which is a bitmap of the following flags:
fr: Les objets de code Python ont un attribut ``co_flags``, ce qui est un *bitmap* des valeurs suivantes :

source: The code object is optimized, using fast locals.
fr: L'objet code est optimisé, utilisant des variables locales rapides.

source: If set, a new dict will be created for the frame's ``f_locals`` when the code object is executed.
fr: Si défini, un nouveau dictionnaire sera créé pour le ``f_locals`` du cadre courant lorsque l'objet code est exécuté.

source: The code object has a variable positional parameter (``*args``-like).
fr: L'objet code possède un paramètre de variable positionnel (``*args`` ou semblable).

source: The code object has a variable keyword parameter (``**kwargs``-like).
fr: L'objet code possède une paramètre par mot-clé variable (``**kwargs`` ou semblable).

source: The flag is set when the code object is a nested function.
fr: L'option est définie lorsque le code est une fonction imbriquée.

source: The flag is set when the code object is a generator function, i.e. a generator object is returned when the code object is executed.
fr: L'option est définie lorsque l'objet code est une fonction génératrice, c'est-à-dire qu'un objet générateur est renvoyé lorsque le code objet est exécuté.

source: The flag is set when the code object is a coroutine function. When the code object is executed it returns a coroutine object. See :pep:`492` for more details.
fr: L'option est définie lorsque le code objet est une fonction coroutine. Lors que le code objet est exécuté, il renvoie un objet coroutine. Voir :pep:`492` pour plus de détails.

source: The flag is used to transform generators into generator-based coroutines. Generator objects with this flag can be used in ``await`` expression, and can ``yield from`` coroutine objects. See :pep:`492` for more details.
fr: L'option est utilisée pour transformer un générateur en une coroutine basée sur un générateur. Les objets générateurs avec cette option peuvent être utilisés dans une expression ``await`` et un objet coroutine ``yield from``. Voir :pep:`492` pour plus de détails.

source: The flag is set when the code object is an asynchronous generator function. When the code object is executed it returns an asynchronous generator object. See :pep:`525` for more details.
fr: L'option est définie lorsque l'objet code est une fonction génératrice asynchrone. Lorsque l'objet code est exécuté, il renvoie un objet générateur asynchrone. Voir :pep:`525` pour les détails.

source: The flags are specific to CPython, and may not be defined in other Python implementations. Furthermore, the flags are an implementation detail, and can be removed or deprecated in future Python releases. It's recommended to use public APIs from the :mod:`inspect` module for any introspection needs.
fr: Ces options sont spécifiques à CPython et pourraient ne pas être définies dans d'autres implémentations Python. De plus, les options constituent des détails d'implémentation et pourraient être enlevées ou dépréciées dans des versions ultérieures. Il est recommandé d'utiliser les APIs publiques de :mod:`inspect` pour tous les besoins d'introspection.

source: Command Line Interface
fr: Interface en ligne de commande

source: The :mod:`inspect` module also provides a basic introspection capability from the command line.
fr: Le module :mod:`inspect` fournit également des capacités d'introspection de base en ligne de commande.

source: By default, accepts the name of a module and prints the source of that module. A class or function within the module can be printed instead by appended a colon and the qualified name of the target object.
fr: Par défaut, il accepte le nom d'un module et affiche la source de ce module. Une classe ou fonction à l'intérieur du module peut également être affichée en ajoutant un ":" et le nom qualifié de l'objet désiré.

source: Print information about the specified object rather than the source code
fr: Affiche de l'information à propos de l'objet spécifié plutôt que du code source.
