Repository: python/python-docs-fr
Catalog: library/inspect.po
Languages: fr

source: Some callables may not be introspectable in certain implementations of Python. For example, in CPython, some built-in functions defined in C provide no metadata about their arguments.
fr: Certains appelables ne peuvent bénéficier d'introspection dans certains environnements Python. Par exemple, en CPython, certaines fonctions natives définies en C ne fournissent aucune métadonnée sur leurs arguments.

source: A Signature object represents the call signature of a function and its return annotation. For each parameter accepted by the function it stores a :class:`Parameter` object in its :attr:`parameters` collection.
fr: L'objet Signature représente la signature d'appel d'une fonction et son annotation de type. Pour chaque paramètre accepté par une fonction, il conserve un objet :class:`Parameter` dans sa collection :attr:`parameters`.

source: The optional *parameters* argument is a sequence of :class:`Parameter` objects, which is validated to check that there are no parameters with duplicate names, and that the parameters are in the right order, i.e. positional-only first, then positional-or-keyword, and that parameters with defaults follow parameters without defaults.
fr: L'argument optionnel *parameters* est une séquence d'objets :class:`Parameters`, qui permet de vérifier qu'il n'y a pas de duplication de noms de paramètres, que les paramètres sont dans le bon ordre (positionnels d'abord, positionnels ou nommés ensuite et que les paramètres avec valeurs par défaut sont placés après ceux qui n'en ont pas).

source: The optional *return_annotation* argument, can be an arbitrary Python object, is the "return" annotation of the callable.
fr: L'argument optionnel *return_annotation* pouvant être un objet Python arbitraire, est l'annotation du type renvoyé par appelable.

source: Signature objects are *immutable*. Use :meth:`Signature.replace` to make a modified copy.
fr: Les objets Signatures sont *immuables*. Utilisez :meth:`Signature.replace` pour en faire une copie modifiée.

source: Signature objects are picklable and hashable.
fr: les objets Signature sont *pickable* (sérialisables avec Pickle) et hachables.

source: A special class-level marker to specify absence of a return annotation.
fr: Un marqueur spécial, accessible via ``Signature.empty``, indiquant l'absence d'une annotation de type renvoyé.

source: An ordered mapping of parameters' names to the corresponding :class:`Parameter` objects. Parameters appear in strict definition order, including keyword-only parameters.
fr: Une table de correspondance ordonnée des noms de paramètres avec les objets :class:`Parameter`. Les paramètres apparaissent dans l'ordre strict de leur définition, incluant les paramètres exclusivement nommés.

source: Python only explicitly guaranteed that it preserved the declaration order of keyword-only parameters as of version 3.7, although in practice this order had always been preserved in Python 3.
fr: Python ne garantit explicitement la préservation de l'ordre des paramètres exclusivement nommés que depuis la version 3.7, bien qu'en pratique cet ordre a toujours été préservé sous Python 3.

source: The "return" annotation for the callable. If the callable has no "return" annotation, this attribute is set to :attr:`Signature.empty`.
fr: L'annotation du type renvoyé par l'appelable. Si l'appelable n'a pas d'annotation de type, cet attribut est évalué à :attr:`Signature.empty`.

source: Create a mapping from positional and keyword arguments to parameters. Returns :class:`BoundArguments` if ``*args`` and ``**kwargs`` match the signature, or raises a :exc:`TypeError`.
fr: Crée une table de correspondance entre les arguments positionnels et nommés avec les paramètres. Renvoie :class:`BoundArguments` si ``*args`` et ``**kwargs`` concordent avec la signature, autrement lève une :exc:`TypeError`.

source: Works the same way as :meth:`Signature.bind`, but allows the omission of some required arguments (mimics :func:`functools.partial` behavior.) Returns :class:`BoundArguments`, or raises a :exc:`TypeError` if the passed arguments do not match the signature.
fr: Fonctionne de manière similaire à :meth:`Signature.bind`, mais permet l'omission de certains arguments (semblable au comportement de :func:`functools.partial`). Renvoie :class:`BoundArguments`, ou lève une :exc:`TypeError` si l'argument passé ne correspond pas à la signature.

source: Create a new Signature instance based on the instance replace was invoked on. It is possible to pass different ``parameters`` and/or ``return_annotation`` to override the corresponding properties of the base signature. To remove return_annotation from the copied Signature, pass in :attr:`Signature.empty`.
fr: Crée une nouvelle instance de Signature sur la base de l'instance sur laquelle la méthode est invoquée. Il est possible de passer différents paramètres et/ou annotations de type pour remplacer les propriétés correspondantes de la signature de base. Pour enlever les annotations de type de la copie de la Signature, lui passer :attr:`Signature.empty`.

source: This method simplifies subclassing of :class:`Signature`::
fr: Cette méthode simplifie l'héritage de :class:`Signature` ::

source: Parameter objects are *immutable*. Instead of modifying a Parameter object, you can use :meth:`Parameter.replace` to create a modified copy.
fr: Les objets *Parameter* sont *immuables*. Utilisez :meth:`Parameter.replace` pour créer une copie modifiée.

source: Parameter objects are picklable and hashable.
fr: les objets *Parameters* sont *pickable* (sérialisables avec Pickle) et hachable.

source: A special class-level marker to specify absence of default values and annotations.
fr: Un marqueur spécial, accessible via ``Parameters.empty`` indiquant l'absence de valeurs par défaut et d'annotations.

source: The name of the parameter as a string. The name must be a valid Python identifier.
fr: Le nom du paramètre (chaîne de caractères). Le nom doit être un identifiant Python valide.

source: CPython generates implicit parameter names of the form ``.0`` on the code objects used to implement comprehensions and generator expressions.
fr: CPython génère un nom de paramètre implicite de forme ``.0`` sur les objets de code utilisés pour implémenter les compréhensions et expressions génératrices.

source: These parameter names are exposed by this module as names like ``implicit0``.
fr: ces paramètres sont exposés par ce module par des noms de forme ``implicit0``.

source: The default value for the parameter. If the parameter has no default value, this attribute is set to :attr:`Parameter.empty`.
fr: La valeur par défaut de ce paramètre. Si le paramètre n'a pas de valeur par défaut, cet attribut vaut :attr:`Parameter.empty`.

source: The annotation for the parameter. If the parameter has no annotation, this attribute is set to :attr:`Parameter.empty`.
fr: L'annotation du paramètre. Si le paramètre n'a pas d'annotation, cet attribut est défini à :attr:`Parameter.empty`.

source: Describes how argument values are bound to the parameter. Possible values (accessible via :class:`Parameter`, like ``Parameter.KEYWORD_ONLY``):
fr: Décrit comment les valeurs d'argument sont liées au paramètre. Les valeurs possibles (accessibles par :class:`Parameter`, tel que ``Parameter.KEYWORD_ONLY``) :

source: Name
fr: Nom

source: Meaning
fr: Signification

source: Value must be supplied as a positional argument. Positional only parameters are those which appear before a ``/`` entry (if present) in a Python function definition.
fr: La valeur doit être donnée comme argument positionnel. Les arguments exclusivement positionnels sont ceux qui apparaissent avant une entrée ``/`` (si présente) dans une définition de fonction Python.

source: Value may be supplied as either a keyword or positional argument (this is the standard binding behaviour for functions implemented in Python.)
fr: La valeur peut être donnée comme argument nommé ou positionnel (ce qui est l'affectation de variable standard pour les fonctions implémentées en Python).

source: A tuple of positional arguments that aren't bound to any other parameter. This corresponds to a ``*args`` parameter in a Python function definition.
fr: Un *n*-uplet d'arguments positionnels qui ne sont affectés à aucun autre paramètre. Cela correspond à un paramètre ``*args`` dans une définition de fonction Python.

source: Value must be supplied as a keyword argument. Keyword only parameters are those which appear after a ``*`` or ``*args`` entry in a Python function definition.
fr: La valeur doit être donnée comme argument nommé. Les arguments exclusivement nommés sont ceux qui apparaissent après un ``*`` ou ``*args`` dans une définition de fonction Python.

source: A dict of keyword arguments that aren't bound to any other parameter. This corresponds to a ``**kwargs`` parameter in a Python function definition.
fr: Un dictionnaire d'arguments nommés qui ne sont liés à aucun autre paramètre. Cela correspond à une expression ``**kwargs`` dans une définition de fonction Python.

source: Example: print all keyword-only arguments without default values::
fr: Exemple : afficher tous les arguments exclusivement nommés sans valeur par défaut :

source: Describes a enum value of Parameter.kind.
fr: Décrit une énumération de valeurs de ``Parameter.kind``.

source: Example: print all descriptions of arguments::
fr: Exemple : afficher toutes les descriptions d'arguments ::

source: Create a new Parameter instance based on the instance replaced was invoked on. To override a :class:`Parameter` attribute, pass the corresponding argument. To remove a default value or/and an annotation from a Parameter, pass :attr:`Parameter.empty`.
fr: Crée une nouvelle instance de *Parameter* sur la base de l'instance sur laquelle la méthode est invoquée. Pour redéfinir un attribut :class:`Parameter`, lui passer l'argument correspondant. Pour enlever les valeurs par défaut et/ou les annotations de retour de la copie du Parameter, lui passer :attr:`Parameter.empty`.

source: In Python 3.3 Parameter objects were allowed to have ``name`` set to ``None`` if their ``kind`` was set to ``POSITIONAL_ONLY``. This is no longer permitted.
fr: en Python 3.3, un objet Parameter pouvait avoir ``name`` à ``None`` si son attribut ``kind`` valait ``POSITIONAL_ONLY``. Cela n'est plus possible.

source: Result of a :meth:`Signature.bind` or :meth:`Signature.bind_partial` call. Holds the mapping of arguments to the function's parameters.
fr: Le résultat d'un appel à :meth:`Signature.bind` ou :meth:`Signature.bind_partial`. Contient la correspondance entre les arguments et les paramètres de la fonction.

source: A mutable mapping of parameters' names to arguments' values. Contains only explicitly bound arguments. Changes in :attr:`arguments` will reflect in :attr:`args` and :attr:`kwargs`.
fr: Une correspondance muable entre les noms de paramètres et les valeurs des arguments. Contient seulement les arguments liés explicitement. Les changements dans :attr:`arguments` sont reflétés dans :attr:`args` et :attr:`kwargs`.

source: Should be used in conjunction with :attr:`Signature.parameters` for any argument processing purposes.
fr: Doit être utilisé en combinaison avec :attr:`Signature.parameters` pour le traitement d'arguments.

source: Arguments for which :meth:`Signature.bind` or :meth:`Signature.bind_partial` relied on a default value are skipped. However, if needed, use :meth:`BoundArguments.apply_defaults` to add them.
fr: Les arguments pour lesquels :meth:`Signature.bind` ou :meth:`Signature.bind_partial` supposent une valeur par défaut sont ignorés. Au besoin, utiliser :meth:`BoundArguments.apply_defaults` pour les inclure.

source: :attr:`arguments` is now of type :class:`dict`. Formerly, it was of type :class:`collections.OrderedDict`.
fr: :attr:`arguments` est maintenant de type :class:`dict`. Anciennement, il était de type :class:`collections.OrderedDict`.

source: A tuple of positional arguments values. Dynamically computed from the :attr:`arguments` attribute.
fr: Un *n*-uplets des valeurs d'arguments positionnels. Évalué dynamiquement à partir de l'attribut :attr:`arguments`.

source: A dict of keyword arguments values. Dynamically computed from the :attr:`arguments` attribute.
fr: Un dictionnaire des valeurs des arguments nommés. Évalué dynamiquement à partir de l'attribut :attr:`arguments`.

source: A reference to the parent :class:`Signature` object.
fr: Une référence à l'objet :class:`Signature` de la classe parente.

source: Set default values for missing arguments.
fr: Assigne les valeurs par défaut pour les arguments manquants.

source: For variable-positional arguments (``*args``) the default is an empty tuple.
fr: Pour les arguments positionnels variables (``*args``) la valeur par défaut est un *n*-uplet vide.

source: For variable-keyword arguments (``**kwargs``) the default is an empty dict.
fr: Pour les arguments nommés variables (``**kwargs``) la valeur par défaut est un dictionnaire vide.

source: The :attr:`args` and :attr:`kwargs` properties can be used to invoke functions::
fr: Les propriétés :attr:`args` et :attr:`kwargs` peuvent être utilisées pour l'appel de fonctions ::

source: The detailed specification, implementation details and examples.
fr: La spécification détaillée, détails d'implémentation et exemples.

source: Classes and functions
fr: Classes et fonctions

source: Arrange the given list of classes into a hierarchy of nested lists. Where a nested list appears, it contains classes derived from the class whose entry immediately precedes the list. Each entry is a 2-tuple containing a class and a tuple of its base classes. If the *unique* argument is true, exactly one entry appears in the returned structure for each class in the given list. Otherwise, classes using multiple inheritance and their descendants will appear multiple times.
fr: Organise la liste de classes donnée en une hiérarchie de listes imbriquées. Lorsqu'une liste imbriquée apparaît, elle contient les classes dérivées de la classe dont l'entrée précède immédiatement cette liste. Chaque entrée est une paire contenant la classe et un *n*-uplet de ses classes de base. Si l'argument *unique* est vrai, exactement une entrée apparaît dans la structure renvoyée pour chaque classe de la liste donnée en argument. Autrement, les classes utilisant l'héritage multiple et ses descendantes apparaissent plusieurs fois.

source: Get the names and default values of a Python function's parameters. A :term:`named tuple` is returned:
fr: Obtenir les noms et les valeurs par défaut des paramètres de fonction Python. Un :term:`n-uplet nommé <named tuple>` est renvoyé :

source: *args* is a list of the positional parameter names. *varargs* is the name of the ``*`` parameter or ``None`` if arbitrary positional arguments are not accepted. *varkw* is the name of the ``**`` parameter or ``None`` if arbitrary keyword arguments are not accepted. *defaults* is an *n*-tuple of default argument values corresponding to the last *n* positional parameters, or ``None`` if there are no such defaults defined. *kwonlyargs* is a list of keyword-only parameter names in declaration order. *kwonlydefaults* is a dictionary mapping parameter names from *kwonlyargs* to the default values used if no argument is supplied. *annotations* is a dictionary mapping parameter names to annotations. The special key ``"return"`` is used to report the function return value annotation (if any).
fr: *args* est une liste de noms de paramètres positionnels. *varargs* est le nom du paramètre ``*`` ou ``None`` si les arguments positionnels arbitraires ne sont pas acceptés. *varkw* est le nom du paramètre ``**``, ou ``None`` si les paramètres arbitraires nommés ne sont pas acceptés. *defaults* est un *n*-uplet des valeurs des arguments par défaut correspondant aux derniers *n* arguments positionnels, ou ``None`` si aucun défaut n'est défini. *kwonlyargs* est une liste d'arguments exclusivement nommés, ordonnée selon l'ordre de déclaration. *kwonlydefaults* est un dictionnaire de correspondance entre les noms de paramètres de *kwonlyargs* et les valeurs par défaut utilisées si aucun argument n'est donné. *annotations* est un dictionnaire de correspondance entre les noms de paramètres et les annotations. La clef spéciale ``"return"`` est utilisée pour obtenir la valeur de retour de l'annotation la fonction (si elle existe).

source: Note that :func:`signature` and :ref:`Signature Object <inspect-signature-object>` provide the recommended API for callable introspection, and support additional behaviours (like positional-only arguments) that are sometimes encountered in extension module APIs. This function is retained primarily for use in code that needs to maintain compatibility with the Python 2 ``inspect`` module API.
fr: Notez que :func:`signature` et :ref:`Signature Object <inspect-signature-object>` fournissent l'API recommandé pour l’introspection d'appelables et prennent en charge des comportements additionnels (comme les arguments exclusivement positionnels) qui sont parfois rencontrés dans les APIs des modules d'extension. Cette fonction et maintenue principalement pour maintenir la compatibilité avec l'API du module ``inspect`` de Python 2.

source: This function is now based on :func:`signature`, but still ignores ``__wrapped__`` attributes and includes the already bound first parameter in the signature output for bound methods.
fr: cette fonction est maintenant basée sur :func:`signature`, mais ignore toujours les attributs ``_wrapped_`` et inclue le premier paramètre (déjà lié) dans la signature des méthodes liées.

source: This method was previously documented as deprecated in favour of :func:`signature` in Python 3.5, but that decision has been reversed in order to restore a clearly supported standard interface for single-source Python 2/3 code migrating away from the legacy :func:`getargspec` API.
fr: cette méthode fût précédemment documentée comme dépréciée en faveur de :func:`signature` en Python 3.5, mais cette décision fût renversée afin de ré-introduire une interface standard clairement supportée pour du code unifié Python 2/3 migrant pour se départir de l'API :func:`getargspec`.

source: Get information about arguments passed into a particular frame. A :term:`named tuple` ``ArgInfo(args, varargs, keywords, locals)`` is returned. *args* is a list of the argument names. *varargs* and *keywords* are the names of the ``*`` and ``**`` arguments or ``None``. *locals* is the locals dictionary of the given frame.
fr: Obtenir de l'information sur les arguments passés à un cadre particulier. Un :term:`n-uplet nommé <named tuple>` ``ArgInfo(args, varargs, keywords, locals)`` est renvoyé. *args* est une liste de noms d'arguments. *varags* et *keywords* sont les noms des arguments ``*`` et ``**`` ou ``None``. *locals* est le dictionnaire des variables locales du cadre courant.

source: This function was inadvertently marked as deprecated in Python 3.5.
fr: Cette fonction fût dépréciée par inadvertance en Python 3.5.

source: Format a pretty argument spec from the four values returned by :func:`getargvalues`. The format\* arguments are the corresponding optional formatting functions that are called to turn names and values into strings.
fr: Formatage lisible des quatre valeurs renvoyées par :func:`getargvalues`. Les arguments format\* sont des fonctions de formatage optionnelles qui sont appelées pour convertir les noms et valeurs en chaînes de caractères.

source: Return a tuple of class cls's base classes, including cls, in method resolution order. No class appears more than once in this tuple. Note that the method resolution order depends on cls's type. Unless a very peculiar user-defined metatype is in use, cls will be the first element of the tuple.
fr: Renvoie un *n*-uplet des classes de base de *cls*, incluant *cls*, selon le l'ordre de résolution des méthodes (*method resolution order*). Aucune classe n'apparaît plus d'une fois dans ce *n*-uplet. Notez que le l'ordre de résolution des méthodes dépend du type de *cls*. Exception faite d'une utilisation très particulière de la métaclasse définie par l'usager, *cls* sera toujours le premier élément du tuple.

source: Bind the *args* and *kwds* to the argument names of the Python function or method *func*, as if it was called with them. For bound methods, bind also the first argument (typically named ``self``) to the associated instance. A dict is returned, mapping the argument names (including the names of the ``*`` and ``**`` arguments, if any) to their values from *args* and *kwds*. In case of invoking *func* incorrectly, i.e. whenever ``func(*args, **kwds)`` would raise an exception because of incompatible signature, an exception of the same type and the same or similar message is raised. For example::
fr: Lie *args* et *kwds* aux arguments nommés de la fonction ou méthode Python *func*, comme si elle était appelée avec ceux-ci. Pour les méthodes liées, lie aussi le premier argument (normalement appelé ``self``) à l'instance associée. Un dictionnaire est renvoyé, une correspondance entre les noms des arguments (incluant les noms des arguments ``*`` et ``**``, s'ils existent) et leurs valeurs obtenues de *args* et *kwds*. Lors d'une invocation incorrecte de *func*, i.e. lorsque ``func(*args, **kwds)`` lèverait une exception en raison de signature incompatible, une exception du même type et de message identique ou similaire est levée. Par exemple ::

source: Use :meth:`Signature.bind` and :meth:`Signature.bind_partial` instead.
fr: utilisez plutôt :meth:`Signature.bind` et :meth:`Signature.bind_partial`.

source: Get the mapping of external name references in a Python function or method *func* to their current values. A :term:`named tuple` ``ClosureVars(nonlocals, globals, builtins, unbound)`` is returned. *nonlocals* maps referenced names to lexical closure variables, *globals* to the function's module globals and *builtins* to the builtins visible from the function body. *unbound* is the set of names referenced in the function that could not be resolved at all given the current module globals and builtins.
fr: Obtenir la correspondance de nom de références externes d'une fonction ou méthode Python *func* avec leur valeur courante. Un :term:`n-uplet nommé <named tuple>` ``ClosureVars(nonlocals, globals, builtins, unbound)`` est renvoyé. *nonlocals* établit une correspondance des noms capturés par les fermetures lexicales, *globals* au module de la fonction et *builtins* aux noms natifs visibles depuis le corps de la fonction. *unbound* est un ensemble de noms référencés dans la fonction ne trouvant aucune résolution dans les valeurs globales du module courant ni à travers le lexique natif.

source: :exc:`TypeError` is raised if *func* is not a Python function or method.
fr: :exc:`TypeError` est levée si *func* n'est ni une fonction ni une méthode Python.

source: Get the object wrapped by *func*. It follows the chain of :attr:`__wrapped__` attributes returning the last object in the chain.
fr: Obtenir l'objet englobé par *func*. Suit une chaîne d'attributs de :attr:`__wrapped__`, renvoyant le dernier objet de la chaîne.
