Repository: python/python-docs-fr
Catalog: library/json.po
Languages: fr

source: Implement this method in a subclass such that it returns a serializable object for *o*, or calls the base implementation (to raise a :exc:`TypeError`).
fr: Implémentez cette méthode dans une sous-classe afin qu'elle renvoie un objet sérialisable pour *o*, ou appelle l'implémentation de base (qui lèvera une :exc:`TypeError`).

source: For example, to support arbitrary iterators, you could implement default like this::
fr: Par exemple, pour supporter des itérateurs arbitraires, vous pourriez implémenter *default* comme cela ::

source: Return a JSON string representation of a Python data structure, *o*. For example::
fr: Renvoie une chaîne JSON représentant la structure de données Python *o*. Par exemple ::

source: Encode the given object, *o*, and yield each string representation as available. For example::
fr: Encode l'objet *o* donné, et produit chaque chaîne représentant l'objet selon disponibilité. Par exemple ::

source: Subclass of :exc:`ValueError` with the following additional attributes:
fr: Sous-classe de :exc:`ValueError` avec les attributs additionnels suivants :

source: The unformatted error message.
fr: Le message d'erreur non formaté.

source: The JSON document being parsed.
fr: Le document JSON actuellement traité.

source: The start index of *doc* where parsing failed.
fr: L'index de *doc* à partir duquel l'analyse a échoué.

source: The line corresponding to *pos*.
fr: La ligne correspondant à *pos*.

source: The column corresponding to *pos*.
fr: La colonne correspondant à *pos*.

source: Standard Compliance and Interoperability
fr: Conformité au standard et Interopérabilité

source: The JSON format is specified by :rfc:`7159` and by `ECMA-404 <http://www.ecma-international.org/publications/standards/Ecma-404.htm>`_. This section details this module's level of compliance with the RFC. For simplicity, :class:`JSONEncoder` and :class:`JSONDecoder` subclasses, and parameters other than those explicitly mentioned, are not considered.
fr: Le format JSON est spécifié par la :rfc:`7159` et le standard `ECMA-404 <http://www.ecma-international.org/publications/standards/Ecma-404.htm>`_. Cette section détaille la conformité à la RFC au niveau du module. Pour faire simple, les sous-classes de :class:`JSONEncoder` et :class:`JSONDecoder`, et les paramètres autres que ceux explicitement mentionnés ne sont pas considérés.

source: This module does not comply with the RFC in a strict fashion, implementing some extensions that are valid JavaScript but not valid JSON. In particular:
fr: Ce module ne se conforme pas strictement à la RFC, implémentant quelques extensions qui sont valides en JavaScript mais pas en JSON. En particulier :

source: Infinite and NaN number values are accepted and output;
fr: Les nombres infinis et *NaN* sont acceptés et retranscrits ;

source: Repeated names within an object are accepted, and only the value of the last name-value pair is used.
fr: Les noms répétés au sein d'un objet sont acceptés, seule la valeur du dernier couple nom/valeur sera utilisée.

source: Since the RFC permits RFC-compliant parsers to accept input texts that are not RFC-compliant, this module's deserializer is technically RFC-compliant under default settings.
fr: Comme la RFC permet aux analyseurs conformes d'accepter des textes en entrée non conformes, le déserialiseur de ce module avec ses paramètres par défaut est techniquement conforme à la RFC.

source: Character Encodings
fr: Encodage des caractères

source: The RFC requires that JSON be represented using either UTF-8, UTF-16, or UTF-32, with UTF-8 being the recommended default for maximum interoperability.
fr: La RFC requiert que le JSON soit représenté en utilisant l'encodage UTF-8, UTF-16 ou UTF-32, avec UTF-8 recommandé par défaut pour une interopérabilité maximale.

source: As permitted, though not required, by the RFC, this module's serializer sets *ensure_ascii=True* by default, thus escaping the output so that the resulting strings only contain ASCII characters.
fr: Comme cela est permis par la RFC, bien que non requis, le sérialiseur du module active *ensure_ascii=True* par défaut, échappant ainsi la sortie de façon à ce que les chaînes résultants ne contiennent que des caractères ASCII.

source: Other than the *ensure_ascii* parameter, this module is defined strictly in terms of conversion between Python objects and :class:`Unicode strings <str>`, and thus does not otherwise directly address the issue of character encodings.
fr: Outre le paramètre *ensure_ascii*, les conversions entre objets Python et :class:`chaînes Unicode <str>` de ce module sont strictement définies, et ne rencontrent donc pas directement le problème de l'encodage des caractères.

source: The RFC prohibits adding a byte order mark (BOM) to the start of a JSON text, and this module's serializer does not add a BOM to its output. The RFC permits, but does not require, JSON deserializers to ignore an initial BOM in their input. This module's deserializer raises a :exc:`ValueError` when an initial BOM is present.
fr: La RFC interdit d'ajouter un *byte* marqueur d'ordre (BOM) au début du texte JSON, et le sérialiseur de ce module n'ajoute pas de tel BOM. La RFC permet, mais ne requiert pas, que les déserialiseurs JSON ignorent ces BOM. Le déserialiseur de ce module lève une :exc:`ValueError` quand un BOM est présent au début du fichier.

source: The RFC does not explicitly forbid JSON strings which contain byte sequences that don't correspond to valid Unicode characters (e.g. unpaired UTF-16 surrogates), but it does note that they may cause interoperability problems. By default, this module accepts and outputs (when present in the original :class:`str`) code points for such sequences.
fr: La RFC n'interdit pas explicitement les chaînes JSON contenant des séquences de *bytes* ne correspondant à aucun caractère Unicode valide (p. ex. les *surrogates* UTF-16 sans correspondance), mais précise que cela peut causer des problèmes d'interopérabilité. Par défaut, ce module accepte et retranscrit (quand présents dans la :class:`str` originale) les *code points* de telles séquences.

source: Infinite and NaN Number Values
fr: Valeurs numériques infinies et NaN

source: The RFC does not permit the representation of infinite or NaN number values. Despite that, by default, this module accepts and outputs ``Infinity``, ``-Infinity``, and ``NaN`` as if they were valid JSON number literal values::
fr: La RFC ne permet pas la représentation des nombres infinis ou des *NaN*. Néanmoins, par défaut, ce module accepte et retranscrit ``Infinity``, ``-Infinity`` et ``NaN`` comme s'ils étaient des valeurs numériques littérales JSON valides ::

source: In the serializer, the *allow_nan* parameter can be used to alter this behavior. In the deserializer, the *parse_constant* parameter can be used to alter this behavior.
fr: Dans le sérialiseur, le paramètre *allow_nan* peut être utilisé pour altérer ce comportement. Dans le déserialiseur, le paramètre *parse_constant* peut être utilisé pour altérer ce comportement.

source: Repeated Names Within an Object
fr: Noms répétés au sein d'un objet

source: The RFC specifies that the names within a JSON object should be unique, but does not mandate how repeated names in JSON objects should be handled. By default, this module does not raise an exception; instead, it ignores all but the last name-value pair for a given name::
fr: La RFC spécifie que les noms au sein d'un objet JSON doivent être uniques, mais ne décrit pas comment les noms répétés doivent être gérés. Par défaut, ce module ne lève pas d'exception ; à la place, il ignore tous les couples nom/valeur sauf le dernier pour un nom donné ::

source: The *object_pairs_hook* parameter can be used to alter this behavior.
fr: Le paramètre *object_pairs_hook* peut être utilisé pour altérer ce comportement.

source: Top-level Non-Object, Non-Array Values
fr: Valeurs de plus haut niveau autres qu'objets ou tableaux

source: The old version of JSON specified by the obsolete :rfc:`4627` required that the top-level value of a JSON text must be either a JSON object or array (Python :class:`dict` or :class:`list`), and could not be a JSON null, boolean, number, or string value. :rfc:`7159` removed that restriction, and this module does not and has never implemented that restriction in either its serializer or its deserializer.
fr: L'ancienne version de JSON spécifiée par l'obsolète :rfc:`4627` demandait à ce que la valeur de plus haut niveau du texte JSON soit un objet ou un tableau JSON (:class:`dict` ou :class:`list` Python), et ne soit pas *null*, un nombre, ou une chaîne de caractères. La :rfc:`7159` a supprimé cette restriction, jamais implémentée par ce module, que ce soit dans le sérialiseur ou le déserialiseur.

source: Regardless, for maximum interoperability, you may wish to voluntarily adhere to the restriction yourself.
fr: Cependant, pour une interopérabilité maximale, vous pourriez volontairement souhaiter adhérer à cette restriction par vous-même.

source: Implementation Limitations
fr: Limitations de l'implémentation

source: Some JSON deserializer implementations may set limits on:
fr: Certaines implémentations de déserialiseurs JSON peuvent avoir des limites sur :

source: the size of accepted JSON texts
fr: la taille des textes JSON acceptés ;

source: the maximum level of nesting of JSON objects and arrays
fr: le niveau maximum d'objets et tableaux JSON imbriqués ;

source: the range and precision of JSON numbers
fr: l'intervalle et la précision des nombres JSON ;

source: the content and maximum length of JSON strings
fr: le contenu et la longueur maximale des chaînes JSON.

source: This module does not impose any such limits beyond those of the relevant Python datatypes themselves or the Python interpreter itself.
fr: Ce module n'impose pas de telles limites si ce n'est celles inhérentes aux types de données Python ou à l'interpréteur.

source: When serializing to JSON, beware any such limitations in applications that may consume your JSON. In particular, it is common for JSON numbers to be deserialized into IEEE 754 double precision numbers and thus subject to that representation's range and precision limitations. This is especially relevant when serializing Python :class:`int` values of extremely large magnitude, or when serializing instances of "exotic" numerical types such as :class:`decimal.Decimal`.
fr: Lors d'une sérialisation JSON, faites attention à ces limitations dans les applications qui utiliseraient votre JSON. En particulier, il est commun pour les nombres JSON d'être déserialisés vers des nombres IEEE 754 à précision double, et donc sujets à l'intervalle et aux limitations sur la précision de cette représentation. Cela est d'autant plus important lors de la sérialisation de valeurs :class:`int` Python de forte magnitude, ou d'instances de types numériques « exotiques » comme :class:`decimal.Decimal`.

source: Command Line Interface
fr: Interface en ligne de commande

source: **Source code:** :source:`Lib/json/tool.py`
fr: **Code source :** :source:`Lib/json/tool.py`

source: The :mod:`json.tool` module provides a simple command line interface to validate and pretty-print JSON objects.
fr: Le module :mod:`json.tool` fournit une simple interface en ligne de commande pour valider et réécrire élégamment des objets JSON.

source: If the optional ``infile`` and ``outfile`` arguments are not specified, :attr:`sys.stdin` and :attr:`sys.stdout` will be used respectively:
fr: Si les arguments optionnels ``infile`` et ``outfile`` ne sont pas spécifiés, :attr:`sys.stdin` et :attr:`sys.stdout` seront utilisés respectivement :

source: The output is now in the same order as the input. Use the :option:`--sort-keys` option to sort the output of dictionaries alphabetically by key.
fr: La sortie conserve maintenant l'ordre des données de l'entrée. Utilisez l'option :option:`--sort-keys` pour sortir des dictionnaires triés alphabétiquement par clés.

source: Command line options
fr: Options de la ligne de commande

source: The JSON file to be validated or pretty-printed:
fr: Le fichier JSON à valider ou réécrire élégamment :

source: If *infile* is not specified, read from :attr:`sys.stdin`.
fr: Si *infile* n'est pas spécifié, lit le document depuis :attr:`sys.stdin`.

source: Write the output of the *infile* to the given *outfile*. Otherwise, write it to :attr:`sys.stdout`.
fr: Écrit la sortie générée par *infile* vers le fichier *outfile* donné. Autrement, écrit sur :attr:`sys.stdout`.

source: Sort the output of dictionaries alphabetically by key.
fr: Trie alphabétiquement les dictionnaires par clés.

source: Parse every input line as separate JSON object.
fr: Transforme chaque ligne d'entrée en un objet JSON individuel.

source: Show the help message.
fr: Affiche le message d'aide.

source: Footnotes
fr: Notes

source: As noted in `the errata for RFC 7159 <https://www.rfc-editor.org/errata_search.php?rfc=7159>`_, JSON permits literal U+2028 (LINE SEPARATOR) and U+2029 (PARAGRAPH SEPARATOR) characters in strings, whereas JavaScript (as of ECMAScript Edition 5.1) does not.
fr: Comme noté dans `l'errata de la RFC 7159 <https://www.rfc-editor.org/errata_search.php?rfc=7159>`_, JSON autorise les caractères littéraux U+2028 (*LINE SEPARATOR*) et U+2029 (*PARAGRAPH SEPARATOR*) dans les chaînes de caractères, alors que Javascript (selon le standard ECMAScript édition 5.1) ne le permet pas.
