Repository: python/python-docs-fr
Catalog: library/json.po
Languages: fr

source: :mod:`json` --- JSON encoder and decoder
fr: :mod:`json` — Encodage et décodage JSON

source: **Source code:** :source:`Lib/json/__init__.py`
fr: **Code source :** :source:`Lib/json/__init__.py`

source: `JSON (JavaScript Object Notation) <http://json.org>`_, specified by :rfc:`7159` (which obsoletes :rfc:`4627`) and by `ECMA-404 <http://www.ecma-international.org/publications/standards/Ecma-404.htm>`_, is a lightweight data interchange format inspired by `JavaScript <https://en.wikipedia.org/wiki/JavaScript>`_ object literal syntax (although it is not a strict subset of JavaScript [#rfc-errata]_ ).
fr: `JSON (JavaScript Object Notation) <http://json.org>`_, spécifié par la :rfc:`7159` (qui rend la :rfc:`4627` obsolète) et par le standard `ECMA-404 <http://www.ecma-international.org/publications/standards/Ecma-404.htm>`_, est une interface légère d'échange de données inspirée par la syntaxe des objets littéraux `JavaScript <https://fr.wikipedia.org/wiki/JavaScript>`_ (bien que ce ne soit pas un sous-ensemble strict de Javascript [#rfc-errata]_ ).

source: :mod:`json` exposes an API familiar to users of the standard library :mod:`marshal` and :mod:`pickle` modules.
fr: :mod:`json` expose une API familière aux utilisateurs des modules de la bibliothèque standard :mod:`marshal` et :mod:`pickle`.

source: Encoding basic Python object hierarchies::
fr: Encodage d'objets Python basiques ::

source: Compact encoding::
fr: Encodage compact ::

source: Pretty printing::
fr: Affichage élégant ::

source: Decoding JSON::
fr: Décodage JSON ::

source: Specializing JSON object decoding::
fr: Spécialisation du décodage JSON pour un objet ::

source: Extending :class:`JSONEncoder`::
fr: Étendre la classe :class:`JSONEncoder` ::

source: Using :mod:`json.tool` from the shell to validate and pretty-print:
fr: Utiliser :mod:`json.tool` depuis le *shell* pour valider et afficher élégamment :

source: See :ref:`json-commandline` for detailed documentation.
fr: Voir :ref:`json-commandline` pour une documentation détaillée.

source: JSON is a subset of `YAML <http://yaml.org/>`_ 1.2. The JSON produced by this module's default settings (in particular, the default *separators* value) is also a subset of YAML 1.0 and 1.1. This module can thus also be used as a YAML serializer.
fr: JSON est un sous-ensemble de `YAML <http://yaml.org/>`_ 1.2. Le JSON produit par les paramètres par défaut de ce module (en particulier, la valeur par défaut de *separators*) est aussi un sous ensemble de YAML 1.0 et 1.1. Ce module peut alors aussi être utilisé comme sérialiseur YAML.

source: This module's encoders and decoders preserve input and output order by default. Order is only lost if the underlying containers are unordered.
fr: Les encodeurs et décodeurs de ce module conservent l'ordre d'entrée et de sortie par défaut. L'ordre n'est perdu que si les conteneurs sous-jacents ne sont pas ordonnés.

source: Prior to Python 3.7, :class:`dict` was not guaranteed to be ordered, so inputs and outputs were typically scrambled unless :class:`collections.OrderedDict` was specifically requested. Starting with Python 3.7, the regular :class:`dict` became order preserving, so it is no longer necessary to specify :class:`collections.OrderedDict` for JSON generation and parsing.
fr: Avant Python 3.7, :class:`dict` n'était pas garanti d'être ordonné, donc les entrées et sorties étaient généralement mélangées sauf si :class:`collections.OrderedDict` était spécifiquement utilisé. À partir de Python 3.7, la classe :class:`dict` est devenue une classe qui conserve son ordre, il n'est donc plus nécessaire de préciser :class:`collections.OrderedDict` pour générer et analyser du JSON.

source: Basic Usage
fr: Utilisation basique

source: Serialize *obj* as a JSON formatted stream to *fp* (a ``.write()``-supporting :term:`file-like object`) using this :ref:`conversion table <py-to-json-table>`.
fr: Sérialise *obj* comme un flux JSON formaté vers *fp* (un :term:`file-like object` gérant ``.write()``) utilisant cette :ref:`table de conversion <py-to-json-table>`.

source: If *skipkeys* is true (default: ``False``), then dict keys that are not of a basic type (:class:`str`, :class:`int`, :class:`float`, :class:`bool`, ``None``) will be skipped instead of raising a :exc:`TypeError`.
fr: Si *skipkeys* est vrai (faux par défaut), alors les clefs de dictionnaires qui ne sont pas de types basiques (:class:`str`, :class:`int`, :class:`float`, :class:`bool`, ``None``) seront ignorées, elles provoquent normalement la levée d'une :exc:`TypeError`.

source: The :mod:`json` module always produces :class:`str` objects, not :class:`bytes` objects. Therefore, ``fp.write()`` must support :class:`str` input.
fr: Le module :mod:`json` produit toujours des objets :class:`str`, et non des objets :class:`bytes`. ``fp.write()`` doit ainsi supporter un objet :class:`str` en entrée.

source: If *ensure_ascii* is true (the default), the output is guaranteed to have all incoming non-ASCII characters escaped. If *ensure_ascii* is false, these characters will be output as-is.
fr: Si *ensure_ascii* est vrai (par défaut), il est garanti que les caractères non ASCII soient tous échappés sur la sortie. Si *ensure_ascii* est faux, ces caractères seront écrits comme tels.

source: If *check_circular* is false (default: ``True``), then the circular reference check for container types will be skipped and a circular reference will result in an :exc:`OverflowError` (or worse).
fr: Si *check_circular* est faux (vrai par défaut), la vérification des références circulaires pour les conteneurs sera ignorée, et une référence circulaire résultera en une :exc:`OverflowError` (ou pire).

source: If *allow_nan* is false (default: ``True``), then it will be a :exc:`ValueError` to serialize out of range :class:`float` values (``nan``, ``inf``, ``-inf``) in strict compliance of the JSON specification. If *allow_nan* is true, their JavaScript equivalents (``NaN``, ``Infinity``, ``-Infinity``) will be used.
fr: Si *allow_nan* est faux (vrai par défaut), une :exc:`ValueError` sera levée lors de la sérialisation de valeurs :class:`float` extérieures aux bornes (``nan``, ``inf``, ``-inf``), en respect strict de la spécification JSON. Si *allow_nan* est vrai, leurs équivalents JavaScript (``NaN``, ``Infinity``, ``-Infinity``) seront utilisés.

source: If *indent* is a non-negative integer or string, then JSON array elements and object members will be pretty-printed with that indent level. An indent level of 0, negative, or ``""`` will only insert newlines. ``None`` (the default) selects the most compact representation. Using a positive integer indent indents that many spaces per level. If *indent* is a string (such as ``"\t"``), that string is used to indent each level.
fr: Si *indent* est un nombre entier positif ou une chaîne de caractères, les éléments de tableaux et les membres d'objets JSON seront affichés élégamment avec ce niveau d'indentation. Un niveau d'indentation de 0, négatif, ou ``""`` n'insérera que des retours à la ligne. ``None`` (la valeur par défaut) choisit la représentation la plus compacte. Utiliser un entier positif comme indentation indente d'autant d'espaces par niveau. Si *indent* est une chaîne (telle que ``"\t"``), cette chaîne est utilisée pour indenter à chaque niveau.

source: Allow strings for *indent* in addition to integers.
fr: Autorise les chaînes en plus des nombres entiers pour *indent*.

source: If specified, *separators* should be an ``(item_separator, key_separator)`` tuple. The default is ``(', ', ': ')`` if *indent* is ``None`` and ``(',', ': ')`` otherwise. To get the most compact JSON representation, you should specify ``(',', ':')`` to eliminate whitespace.
fr: Si spécifié, *separators* doit être un *tuple* ``(item_separator, key_separator)``. Sa valeur par défaut est ``(', ', ': ')`` si *indent* est ``None``, et ``(',', ': ')`` autrement. Pour obtenir la représentation JSON la plus compacte possible, vous devriez spécifier ``(',', ':')`` pour éliminer les espacements.

source: Use ``(',', ': ')`` as default if *indent* is not ``None``.
fr: Utilise ``(',', ': ')`` par défaut si *indent* n'est pas ``None``.

source: If specified, *default* should be a function that gets called for objects that can't otherwise be serialized. It should return a JSON encodable version of the object or raise a :exc:`TypeError`. If not specified, :exc:`TypeError` is raised.
fr: Si spécifié, *default* doit être une fonction qui sera appelée pour les objets qui ne peuvent être sérialisés autrement. Elle doit renvoyer une représentation de l'objet sérialisable en JSON ou lever une :exc:`TypeError`. Si non spécifié, une :exc:`TypeError` sera levée pour les types non sérialisables.

source: If *sort_keys* is true (default: ``False``), then the output of dictionaries will be sorted by key.
fr: Si *sort_keys* est vrai (faux par défaut), les dictionnaires seront retranscrits triés selon leurs clés.

source: To use a custom :class:`JSONEncoder` subclass (e.g. one that overrides the :meth:`default` method to serialize additional types), specify it with the *cls* kwarg; otherwise :class:`JSONEncoder` is used.
fr: Pour utiliser une sous-classe :class:`JSONEncoder` personnalisée (p. ex. une qui redéfinit la méthode :meth:`default` pour sérialiser des types additionnels), spécifiez-la avec le paramètre nommé *cls* ; autrement, :class:`JSONEncoder` est utilisée.

source: All optional parameters are now :ref:`keyword-only <keyword-only_parameter>`.
fr: Tous les paramètres optionnels sont maintenant des :ref:`keyword-only <keyword-only_parameter>`.

source: Unlike :mod:`pickle` and :mod:`marshal`, JSON is not a framed protocol, so trying to serialize multiple objects with repeated calls to :func:`dump` using the same *fp* will result in an invalid JSON file.
fr: À l'inverse de :mod:`pickle` et :mod:`marshal`, JSON n'est pas un protocole par trames, donc essayer de sérialiser de multiples objets par des appels répétés à :func:`dump` en utilisant le même *fp* résultera en un fichier JSON invalide.

source: Serialize *obj* to a JSON formatted :class:`str` using this :ref:`conversion table <py-to-json-table>`. The arguments have the same meaning as in :func:`dump`.
fr: Sérialise *obj* vers un JSON formaté :class:`str`, en utilisant cette :ref:`table de conversion <py-to-json-table>`. Les arguments ont la même signification que ceux de :func:`dump`.

source: Keys in key/value pairs of JSON are always of the type :class:`str`. When a dictionary is converted into JSON, all the keys of the dictionary are coerced to strings. As a result of this, if a dictionary is converted into JSON and then back into a dictionary, the dictionary may not equal the original one. That is, ``loads(dumps(x)) != x`` if x has non-string keys.
fr: Les clés dans les couples JSON clé/valeur sont toujours de type :class:`str`. Quand un dictionnaire est converti en JSON, toutes les clés du dictionnaire sont transformées en chaînes de caractères. Ce qui fait que si un dictionnaire est converti en JSON et reconverti en dictionnaire, le résultat peut ne pas être égal à l'original. Ainsi, ``loads(dumps(x)) != x`` si x contient des clés qui ne sont pas des chaînes.

source: Deserialize *fp* (a ``.read()``-supporting :term:`text file` or :term:`binary file` containing a JSON document) to a Python object using this :ref:`conversion table <json-to-py-table>`.
fr: Déserialise *fp* (un :term:`text file` ou un :term:`binary file` supportant ``.read()`` et contenant un document JSON) vers un objet Python en utilisant cette :ref:`table de conversion <json-to-py-table>`.

source: *object_hook* is an optional function that will be called with the result of any object literal decoded (a :class:`dict`). The return value of *object_hook* will be used instead of the :class:`dict`. This feature can be used to implement custom decoders (e.g. `JSON-RPC <http://www.jsonrpc.org>`_ class hinting).
fr: *object_hook* est une fonction optionnelle qui sera appelée avec le résultat de chaque objet littéral décodé (chaque :class:`dict`). La valeur de retour de *object_hook* sera utilisée à la place du :class:`dict`. Cette fonctionnalité peut être utilisée pour implémenter des décodeurs personnalisés (p. ex. les *class hinting* de `JSON-RPC <http://www.jsonrpc.org>`_).

source: *object_pairs_hook* is an optional function that will be called with the result of any object literal decoded with an ordered list of pairs. The return value of *object_pairs_hook* will be used instead of the :class:`dict`. This feature can be used to implement custom decoders. If *object_hook* is also defined, the *object_pairs_hook* takes priority.
fr: *object_pairs_hook* est une fonction optionnelle qui sera appelé pour chaque objet littéral décodé, avec une liste ordonnée de couples. La valeur de retour de *object_pairs_hook* sera utilisée à la place du :class:`dict`. Cette fonctionnalité peut être utilisée pour implémenter des décodeurs personnalisés. *object_pairs_hook* prend la priorité sur *object_hook*, si cette dernière est aussi définie.

source: Added support for *object_pairs_hook*.
fr: Ajout du support de *object_pairs_hook*.

source: *parse_float*, if specified, will be called with the string of every JSON float to be decoded. By default, this is equivalent to ``float(num_str)``. This can be used to use another datatype or parser for JSON floats (e.g. :class:`decimal.Decimal`).
fr: *parse_float*, si spécifiée, sera appelée pour chaque nombre réel JSON à décoder sous forme d'une chaîne de caractères. Par défaut, elle est équivalente à ``float(num_str)``. Cela peut servir à utiliser un autre type de données ou un autre analyseur pour les nombres réels JSON (p. ex. :class:`decimal.Decimal`).

source: *parse_int*, if specified, will be called with the string of every JSON int to be decoded. By default, this is equivalent to ``int(num_str)``. This can be used to use another datatype or parser for JSON integers (e.g. :class:`float`).
fr: *parse_int*, si spécifiée, sera appelée pour chaque nombre entier JSON à décoder sous forme d'une chaîne de caractères. Par défaut, elle est équivalente à ``int(num_str)``. Cela peut servir à utiliser un autre type de données ou un autre analyseur pour les nombres entiers JSON (p. ex. :class:`float`).

source: *parse_constant*, if specified, will be called with one of the following strings: ``'-Infinity'``, ``'Infinity'``, ``'NaN'``. This can be used to raise an exception if invalid JSON numbers are encountered.
fr: *parse_constant*, si spécifiée, sera appelée avec l'une des chaînes de caractères suivantes : ``'-Infinity'``, ``'Infinity'`` ou ``'NaN'``. Cela peut servir à lever une exception si des nombres JSON invalides sont rencontrés.

source: *parse_constant* doesn't get called on 'null', 'true', 'false' anymore.
fr: *parse_constant* n'est plus appelée pour *null*, *true* ou *false*.

source: To use a custom :class:`JSONDecoder` subclass, specify it with the ``cls`` kwarg; otherwise :class:`JSONDecoder` is used. Additional keyword arguments will be passed to the constructor of the class.
fr: Pour utiliser une sous-classe :class:`JSONDecoder` personnalisée, spécifiez-la avec l'argument nommé ``cls`` ; autrement, :class:`JSONDecoder` est utilisée. Les arguments nommés additionnels seront passés au constructeur de cette classe.

source: If the data being deserialized is not a valid JSON document, a :exc:`JSONDecodeError` will be raised.
fr: Si les données à déserialiser ne sont pas un document JSON valide, une :exc:`JSONDecodeError` sera levée.

source: *fp* can now be a :term:`binary file`. The input encoding should be UTF-8, UTF-16 or UTF-32.
fr: *fp* peut maintenant être un :class:`binary file`. Son encodage doit être UTF-8, UTF-16 ou UTF-32.

source: Deserialize *s* (a :class:`str`, :class:`bytes` or :class:`bytearray` instance containing a JSON document) to a Python object using this :ref:`conversion table <json-to-py-table>`.
fr: Déserialise *s* (une instance de :class:`str`, :class:`bytes` ou :class:`bytearray` contenant un document JSON) vers un objet Python en utilisant cette :ref:`table de conversion <json-to-py-table>`.

source: The other arguments have the same meaning as in :func:`load`, except *encoding* which is ignored and deprecated since Python 3.1.
fr: Les autres arguments ont la même signification que pour :func:`load`, à l'exception d'*encoding* qui est ignoré et obsolète depuis Python 3.1.

source: *encoding* keyword argument.
fr: L'argument nommé *encodage*.

source: *s* can now be of type :class:`bytes` or :class:`bytearray`. The input encoding should be UTF-8, UTF-16 or UTF-32.
fr: *s* peut maintenant être de type :class:`bytes` ou :class:`bytearray`. L'encodage d'entrée doit être UTF-8, UTF-16 ou UTF-32.

source: Encoders and Decoders
fr: Encodeurs et décodeurs

source: Simple JSON decoder.
fr: Décodeur simple JSON.

source: Performs the following translations in decoding by default:
fr: Applique par défaut les conversions suivantes en décodant :

source: object
fr: objet

source: number (int)
fr: *number* (nombre entier)

source: number (real)
fr: *number* (nombre réel)

source: It also understands ``NaN``, ``Infinity``, and ``-Infinity`` as their corresponding ``float`` values, which is outside the JSON spec.
fr: Les valeurs ``NaN``, ``Infinity`` et ``-Infinity`` sont aussi comprises comme leurs valeurs ``float`` correspondantes, bien que ne faisant pas partie de la spécification JSON.

source: *object_hook*, if specified, will be called with the result of every JSON object decoded and its return value will be used in place of the given :class:`dict`. This can be used to provide custom deserializations (e.g. to support JSON-RPC class hinting).
fr: *object_hook*, si spécifiée, sera appelée avec le résultat de chaque objet JSON décodé et sa valeur de retour sera utilisée à la place du :class:`dict` donné. Cela peut être utilisé pour apporter des déserialisations personnalisées (p. ex. pour supporter les *class hinting* de JSON-RPC).

source: *object_pairs_hook*, if specified will be called with the result of every JSON object decoded with an ordered list of pairs. The return value of *object_pairs_hook* will be used instead of the :class:`dict`. This feature can be used to implement custom decoders. If *object_hook* is also defined, the *object_pairs_hook* takes priority.
fr: *object_pairs_hook*, si spécifiée, sera appelée avec le résultat de chaque objet JSON décodé avec une liste ordonnée de couples. Sa valeur de retour sera utilisée à la place du :class:`dict`. Cette fonctionnalité peut être utilisée pour implémenter des décodeurs personnalisés. *object_pairs_hook* prend la priorité sur *object_hook*, si cette dernière est aussi définie.

source: If *strict* is false (``True`` is the default), then control characters will be allowed inside strings. Control characters in this context are those with character codes in the 0--31 range, including ``'\t'`` (tab), ``'\n'``, ``'\r'`` and ``'\0'``.
fr: Si *strict* est faux (``True`` par défaut), alors les caractères de contrôle seront autorisés à l'intérieur des chaînes. Les caractères de contrôle dans ce contexte sont ceux dont les codes sont dans l'intervalle 0--31, incluant ``'\t'`` (tabulation), ``'\n'``, ``'\r'`` et ``'\0'``.

source: All parameters are now :ref:`keyword-only <keyword-only_parameter>`.
fr: Tous les paramètres sont maintenant des :ref:`keyword-only <keyword-only_parameter>`.

source: Return the Python representation of *s* (a :class:`str` instance containing a JSON document).
fr: Renvoie la représentation Python de *s* (une instance :class:`str` contenant un document JSON).

source: :exc:`JSONDecodeError` will be raised if the given JSON document is not valid.
fr: Une :exc:`JSONDecodeError` sera levée si le document JSON donné n'est pas valide.

source: Decode a JSON document from *s* (a :class:`str` beginning with a JSON document) and return a 2-tuple of the Python representation and the index in *s* where the document ended.
fr: Décode en document JSON depuis *s* (une instance :class:`str` débutant par un document JSON) et renvoie un *tuple* de 2 éléments contenant la représentation Python de l'objet et l'index dans *s* où le document se terminait.

source: This can be used to decode a JSON document from a string that may have extraneous data at the end.
fr: Elle peut être utilisée pour décoder un document JSON depuis une chaîne qui peut contenir des données supplémentaires à la fin.

source: Extensible JSON encoder for Python data structures.
fr: Encodeur JSON extensible pour les structures de données Python.

source: Supports the following objects and types by default:
fr: Supporte par défaut les objets et types suivants :

source: int, float, int- & float-derived Enums
fr: *int*, *float*, et *Enums* dérivées d'*int* ou de *float*

source: Added support for int- and float-derived Enum classes.
fr: Ajout du support des classes *Enum* dérivées d'*int* ou de *float*.

source: To extend this to recognize other objects, subclass and implement a :meth:`default` method with another method that returns a serializable object for ``o`` if possible, otherwise it should call the superclass implementation (to raise :exc:`TypeError`).
fr: Pour l'étendre afin de reconnaître d'autres types d'objets, il suffit d'en créer une sous-classe et d'implémenter une nouvelle méthode :meth:`default` qui renverrait si possible un objet sérialisable pour ``o``, ou ferait appel à l'implémentation de la classe mère (qui lèverait une :exc:`TypeError`).

source: If *skipkeys* is false (the default), then it is a :exc:`TypeError` to attempt encoding of keys that are not :class:`str`, :class:`int`, :class:`float` or ``None``. If *skipkeys* is true, such items are simply skipped.
fr: Si *skipkeys* est faux (par défaut), une :exc:`TypeError` sera levée lors de l'encodage de clés autres que des :class:`str`, des :class:`int`, des :class:`float` ou ``None``. Si *skipkeys* est vrai, ces éléments sont simplement ignorés.

source: If *check_circular* is true (the default), then lists, dicts, and custom encoded objects will be checked for circular references during encoding to prevent an infinite recursion (which would cause an :exc:`OverflowError`). Otherwise, no such check takes place.
fr: Si *check_circular* est vrai (par défaut), une vérification aura lieu sur les listes, dictionnaires et objets personnalisés, afin de détecter les références circulaires et éviter les récursions infinies (qui causeraient une :exc:`OverflowError`). Autrement, la vérification n'a pas lieu.

source: If *allow_nan* is true (the default), then ``NaN``, ``Infinity``, and ``-Infinity`` will be encoded as such. This behavior is not JSON specification compliant, but is consistent with most JavaScript based encoders and decoders. Otherwise, it will be a :exc:`ValueError` to encode such floats.
fr: Si *allow_nan* est vrai (par défaut), alors ``NaN``, ``Infinity`` et ``-Infinity`` seront encodés comme tels. Ce comportement ne respecte pas la spécification JSON, mais est cohérent avec le majorité des encodeurs/décodeurs JavaScript. Autrement, une :exc:`ValueError` sera levée pour de telles valeurs.

source: If *sort_keys* is true (default: ``False``), then the output of dictionaries will be sorted by key; this is useful for regression tests to ensure that JSON serializations can be compared on a day-to-day basis.
fr: Si *sort_keys* est vrai (``False`` par défaut), alors les dictionnaires seront triés par clés en sortie ; cela est utile lors de tests de régression pour pouvoir comparer les sérialisations JSON au jour le jour.
