Repository: python/python-docs-fr
Catalog: library/linecache.po
Languages: fr

source: :mod:`linecache` --- Random access to text lines
fr: :mod:`linecache` — Accès direct aux lignes d'un texte

source: **Source code:** :source:`Lib/linecache.py`
fr: **Code source :** :source:`Lib/linecache.py`

source: The :mod:`linecache` module allows one to get any line from a Python source file, while attempting to optimize internally, using a cache, the common case where many lines are read from a single file. This is used by the :mod:`traceback` module to retrieve source lines for inclusion in the formatted traceback.
fr: Le module :mod:`linecache` permet d'obtenir n'importe quelle ligne d'un fichier source Python. Le cas classique où de nombreuses lignes sont accédées est optimisé en utilisant un cache interne. C'est utilisé par le module :mod:`traceback` pour récupérer les lignes à afficher dans les piles d'appels.

source: The :func:`tokenize.open` function is used to open files. This function uses :func:`tokenize.detect_encoding` to get the encoding of the file; in the absence of an encoding token, the file encoding defaults to UTF-8.
fr: Les fichiers sont ouverts par la fonction :func:`tokenize.open`. Cette fonction utilise :func:`tokenize.detect_encoding` pour obtenir l'encodage du fichier. En l'absence d'un BOM et d'un cookie d'encodage, c'est l'encodage UTF-8 qui sera utilisé.

source: The :mod:`linecache` module defines the following functions:
fr: Le module :mod:`linecache` définit les fonctions suivantes :

source: Get line *lineno* from file named *filename*. This function will never raise an exception --- it will return ``''`` on errors (the terminating newline character will be included for lines that are found).
fr: Récupère la ligne *lineno* du fichier *filename*. Cette fonction ne lèvera jamais d'exception, elle préfèrera renvoyer ``''`` en cas d'erreur (le caractère de retour à la ligne sera inclus pour les lignes existantes).

source: Clear the cache. Use this function if you no longer need lines from files previously read using :func:`getline`.
fr: Nettoie le cache. Utilisez cette fonction si vous n'avez plus besoin des lignes des fichiers précédemment lus via :func:`getline`.

source: Check the cache for validity. Use this function if files in the cache may have changed on disk, and you require the updated version. If *filename* is omitted, it will check all the entries in the cache.
fr: Vérifie la validité du cache. Utilisez cette fonction si les fichiers du cache pourraient avoir changé sur le disque, et que vous en voudriez une version à jour. Sans *filename*, toutes les entrées du cache seront vérifiées.

source: Capture enough detail about a non-file-based module to permit getting its lines later via :func:`getline` even if *module_globals* is ``None`` in the later call. This avoids doing I/O until a line is actually needed, without having to carry the module globals around indefinitely.
fr: Récupère suffisamment d'informations sur un module situé hors du système de fichiers pour récupérer ses lignes plus tard via :func:`getline`, même si *module_globals* devient ``None``. Cela évite de lire le fichier avant d'avoir besoin d'une ligne, tout en évitant de conserver les globales du module indéfiniment.

source: Example::
fr: Exemple ::
