Repository: python/python-docs-fr
Catalog: library/locale.po
Languages: fr

source: :mod:`locale` --- Internationalization services
fr: :mod:`locale` — Services d'internationalisation

source: The :mod:`locale` module opens access to the POSIX locale database and functionality. The POSIX locale mechanism allows programmers to deal with certain cultural issues in an application, without requiring the programmer to know all the specifics of each country where the software is executed.
fr: Le module :mod:`locale` donne accès à la base de données et aux fonctionnalités des paramètres linguistiques définis par POSIX. Le mécanisme des paramètres linguistiques de POSIX permet aux développeurs de faire face à certaines problématiques culturelles dans une application, sans avoir à connaître toutes les spécificités de chaque pays où le logiciel est exécuté.

source: The :mod:`locale` module is implemented on top of the :mod:`_locale` module, which in turn uses an ANSI C locale implementation if available.
fr: Le module :mod:`locale` est implémenté au-dessus du module :mod:`_locale`, qui lui-même utilise l'implémentation du paramètre régional ANSI C si disponible.

source: The :mod:`locale` module defines the following exception and functions:
fr: Le module :mod:`locale` définit l'exception et les fonctions suivantes :

source: Exception raised when the locale passed to :func:`setlocale` is not recognized.
fr: Exception levée lorsque le paramètre régional passé en paramètre de :func:`setlocale` n'est pas reconnu.

source: If *locale* is given and not ``None``, :func:`setlocale` modifies the locale setting for the *category*. The available categories are listed in the data description below. *locale* may be a string, or an iterable of two strings (language code and encoding). If it's an iterable, it's converted to a locale name using the locale aliasing engine. An empty string specifies the user's default settings. If the modification of the locale fails, the exception :exc:`Error` is raised. If successful, the new locale setting is returned.
fr: Si *locale* ne vaut pas ``None``, :func:`setlocale` modifie le paramètre régional pour la catégorie *category*. Les catégories disponibles sont listées dans la description des données ci-dessous. *locale* peut être une chaîne de caractères ou un itérable de deux chaînes de caractères (code de la langue et encodage). Si c'est un itérable, il est converti en un nom de paramètre régional à l'aide du moteur de normalisation fait pour. Si c'est une chaîne vide, les paramètres par défaut de l'utilisateur sont utilisés. Si la modification du paramètre régional échoue, l'exception :exc:`Error` est levée. Si elle fonctionne, le nouveau paramètre est renvoyé.

source: If *locale* is omitted or ``None``, the current setting for *category* is returned.
fr: Si *locale* est omis ou vaut ``None``, le paramètre actuel de *category* est renvoyé.

source: :func:`setlocale` is not thread-safe on most systems. Applications typically start with a call of ::
fr: :func:`setlocale` n'est pas *thread-safe* sur la plupart des systèmes. Les applications commencent généralement par un appel de : ::

source: This sets the locale for all categories to the user's default setting (typically specified in the :envvar:`LANG` environment variable). If the locale is not changed thereafter, using multithreading should not cause problems.
fr: Cela définit les paramètres régionaux dans toutes les catégories sur ceux par défaut de l'utilisateur (habituellement spécifiés dans la variable d'environnement :envvar:`LANG`). Si les paramètres régionaux ne sont pas modifiés par la suite, l'utilisation de fils d'exécution ne devrait pas poser de problèmes.

source: Returns the database of the local conventions as a dictionary. This dictionary has the following strings as keys:
fr: Renvoie la base de données des conventions locales sous forme de dictionnaire. Ce dictionnaire a les chaînes de caractères suivantes comme clés :

source: Category
fr: Catégorie

source: Key
fr: Clé

source: Meaning
fr: Signification

source: Decimal point character.
fr: Caractère du séparateur décimal (entre la partie entière et la partie décimale).

source: Sequence of numbers specifying which relative positions the ``'thousands_sep'`` is expected. If the sequence is terminated with :const:`CHAR_MAX`, no further grouping is performed. If the sequence terminates with a ``0``, the last group size is repeatedly used.
fr: Séquence de nombres spécifiant les positions relatives attendues pour ``'thousands_sep'`` (séparateur de milliers). Si la séquence se termine par :const:`CHAR_MAX`, aucun autre regroupement n'est effectué. Si la séquence se termine par un ``0``, la dernière taille du groupe est utilisée à plusieurs reprises.

source: Character used between groups.
fr: Caractère utilisé entre les groupes (séparateur de milliers).

source: International currency symbol.
fr: Symbole monétaire international.

source: Local currency symbol.
fr: Symbole monétaire local.

source: Whether the currency symbol precedes the value (for positive resp. negative values).
fr: Si le symbole monétaire précède ou non la valeur (pour les valeurs positives et négatives, respectivement).

source: Whether the currency symbol is separated from the value by a space (for positive resp. negative values).
fr: Si le symbole monétaire est séparé de la valeur par une espace ou non (pour les valeurs positives et négatives, respectivement).

source: Decimal point used for monetary values.
fr: Séparateur décimal (entre la partie entière et la partie décimale) utilisé pour les valeurs monétaires.

source: Number of fractional digits used in local formatting of monetary values.
fr: Nombre de décimales utilisées dans le format local des valeurs monétaires.

source: Number of fractional digits used in international formatting of monetary values.
fr: Nombre de décimales utilisées dans le format international des valeurs monétaires.

source: Group separator used for monetary values.
fr: Séparateur de groupe utilisé pour les valeurs monétaires.

source: Equivalent to ``'grouping'``, used for monetary values.
fr: Équivalent de ``'grouping'``, utilisé pour les valeurs monétaires.

source: Symbol used to annotate a positive monetary value.
fr: Symbole utilisé pour indiquer qu'une valeur monétaire est positive.

source: Symbol used to annotate a negative monetary value.
fr: Symbole utilisé pour indiquer qu'une valeur monétaire est négative.

source: The position of the sign (for positive resp. negative values), see below.
fr: Position du signe (pour les valeurs positives et négatives, respectivement), voir ci-dessous.

source: All numeric values can be set to :const:`CHAR_MAX` to indicate that there is no value specified in this locale.
fr: Toutes les valeurs numériques peuvent être définies à :const:`CHAR_MAX` pour indiquer qu'il n'y a pas de valeur spécifiée pour ces paramètres régionaux.

source: The possible values for ``'p_sign_posn'`` and ``'n_sign_posn'`` are given below.
fr: Les valeurs possibles pour ``'p_sign_posn'`` et ``'n_sign_posn'`` sont données ci-dessous.

source: Value
fr: Valeur

source: Explanation
fr: Explication

source: Currency and value are surrounded by parentheses.
fr: Le symbole monétaire et la valeur sont entourés de parenthèses.

source: The sign should precede the value and currency symbol.
fr: Le signe doit précéder la valeur et le symbole monétaire.

source: The sign should follow the value and currency symbol.
fr: Le signe doit suivre la valeur et le symbole monétaire.

source: The sign should immediately precede the value.
fr: Le signe doit précéder immédiatement la valeur.

source: The sign should immediately follow the value.
fr: Le signe doit suivre immédiatement la valeur.

source: Nothing is specified in this locale.
fr: Rien n'est spécifié dans ces paramètres régionaux.

source: The function now sets temporarily the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale in some cases.
fr: La fonction définit maintenant la valeur du paramètre ``LC_CTYPE`` à celle du paramètre ``LC_NUMERIC`` temporairement dans certains cas.

source: Return some locale-specific information as a string. This function is not available on all systems, and the set of possible options might also vary across platforms. The possible argument values are numbers, for which symbolic constants are available in the locale module.
fr: Renvoie quelques informations spécifiques aux paramètres régionaux sous forme de chaîne. Cette fonction n'est pas disponible sur tous les systèmes et l'ensemble des options possibles peut également varier d'une plateforme à l'autre. Les valeurs possibles pour les arguments sont des nombres, pour lesquels des constantes symboliques sont disponibles dans le module *locale*.

source: The :func:`nl_langinfo` function accepts one of the following keys. Most descriptions are taken from the corresponding description in the GNU C library.
fr: La fonction :func:`nl_langinfo` accepte l'une des clés suivantes. La plupart des descriptions sont extraites des descriptions correspondantes dans la bibliothèque GNU C.

source: Get a string with the name of the character encoding used in the selected locale.
fr: Récupère une chaîne avec le nom de l'encodage des caractères utilisé par le paramètre régional sélectionné.

source: Get a string that can be used as a format string for :func:`time.strftime` to represent date and time in a locale-specific way.
fr: Récupère une chaîne qui peut être utilisée comme une chaîne de format par :func:`time.strftime` afin de représenter la date et l'heure pour un paramètre régional spécifique.

source: Get a string that can be used as a format string for :func:`time.strftime` to represent a date in a locale-specific way.
fr: Récupère une chaîne qui peut être utilisée comme une chaîne de format par :func:`time.strftime` afin de représenter une date pour un paramètre régional spécifique.

source: Get a string that can be used as a format string for :func:`time.strftime` to represent a time in a locale-specific way.
fr: Récupère une chaîne qui peut être utilisée comme une chaîne de format par :func:`time.strftime` afin de représenter une heure pour un paramètre régional spécifique.

source: Get a format string for :func:`time.strftime` to represent time in the am/pm format.
fr: Récupère une chaîne de format pour :func:`time.strftime` afin de représenter l'heure au format am / pm.

source: Get the name of the n-th day of the week.
fr: Récupère le nom du n-ième jour de la semaine.

source: This follows the US convention of :const:`DAY_1` being Sunday, not the international convention (ISO 8601) that Monday is the first day of the week.
fr: Cela suit la convention américaine qui définit :const:`DAY_1` comme étant dimanche, et non la convention internationale (ISO 8601) où lundi est le premier jour de la semaine.

source: Get the abbreviated name of the n-th day of the week.
fr: Récupère l'abréviation du n-ième jour de la semaine.

source: Get the name of the n-th month.
fr: Récupère le nom du n-ième mois.

source: Get the abbreviated name of the n-th month.
fr: Récupère l'abréviation du n-ième mois.

source: Get the radix character (decimal dot, decimal comma, etc.).
fr: Récupère le caractère de séparation *radix* (point décimal, virgule décimale, etc.).

source: Get the separator character for thousands (groups of three digits).
fr: Récupère le caractère de séparation des milliers (groupes de 3 chiffres).

source: Get a regular expression that can be used with the regex function to recognize a positive response to a yes/no question.
fr: Récupère une expression régulière qui peut être utilisée par la fonction *regex* pour reconnaître une réponse positive à une question fermée (oui / non).

source: The expression is in the syntax suitable for the :c:func:`regex` function from the C library, which might differ from the syntax used in :mod:`re`.
fr: L'expression est dans une syntaxe adaptée à la fonction :c:func:`regex` de la bibliothèque C, qui peut différer de la syntaxe utilisée par :mod:`re`.

source: Get a regular expression that can be used with the regex(3) function to recognize a negative response to a yes/no question.
fr: Récupère une expression régulière qui peut être utilisée par la fonction *regex(3)* pour reconnaître une réponse négative à une question fermée (oui / non).

source: Get the currency symbol, preceded by "-" if the symbol should appear before the value, "+" if the symbol should appear after the value, or "." if the symbol should replace the radix character.
fr: Récupère le symbole monétaire, précédé de « - » si le symbole doit apparaître avant la valeur, « + » s'il doit apparaître après la valeur, ou « . » s'il doit remplacer le caractère de séparation *radix*.

source: Get a string that represents the era used in the current locale.
fr: Récupère une chaîne qui représente l'ère utilisée pour le paramètre régional actuel.

source: Most locales do not define this value. An example of a locale which does define this value is the Japanese one. In Japan, the traditional representation of dates includes the name of the era corresponding to the then-emperor's reign.
fr: La plupart des paramètres régionaux ne définissent pas cette valeur. Un exemple de région qui définit bien cette valeur est le japonais. Au Japon, la représentation traditionnelle des dates comprend le nom de l'ère correspondant au règne de l'empereur de l'époque.

source: Normally it should not be necessary to use this value directly. Specifying the ``E`` modifier in their format strings causes the :func:`time.strftime` function to use this information. The format of the returned string is not specified, and therefore you should not assume knowledge of it on different systems.
fr: Normalement, il ne devrait pas être nécessaire d'utiliser cette valeur directement. Spécifier le modificateur ``E`` dans leurs chaînes de format provoque l'utilisation de cette information par la fonction :func:`time.strftime`. Le format de la chaîne renvoyée n'est pas spécifié, et vous ne devez donc pas supposer en avoir connaissance sur des systèmes différents.

source: Get a format string for :func:`time.strftime` to represent date and time in a locale-specific era-based way.
fr: Récupère la chaîne de format pour :func:`time.strftime` afin de représenter la date et l'heure pour un paramètre régional spécifique basée sur une ère.

source: Get a format string for :func:`time.strftime` to represent a date in a locale-specific era-based way.
fr: Récupère la chaîne de format pour :func:`time.strftime` afin de représenter une date pour un paramètre régional spécifique basée sur une ère.

source: Get a format string for :func:`time.strftime` to represent a time in a locale-specific era-based way.
fr: Récupère la chaîne de format pour :func:`time.strftime` afin de représenter une heure pour un paramètre régional spécifique basée sur une ère.

source: Get a representation of up to 100 values used to represent the values 0 to 99.
fr: Récupère une représentation de 100 valeurs maximum utilisées pour représenter les valeurs de 0 à 99.

source: Tries to determine the default locale settings and returns them as a tuple of the form ``(language code, encoding)``.
fr: Tente de déterminer les paramètres régionaux par défaut, puis les renvoie sous la forme d'un n-uplet ``(code de la langue, encodage)``.

source: According to POSIX, a program which has not called ``setlocale(LC_ALL, '')`` runs using the portable ``'C'`` locale. Calling ``setlocale(LC_ALL, '')`` lets it use the default locale as defined by the :envvar:`LANG` variable. Since we do not want to interfere with the current locale setting we thus emulate the behavior in the way described above.
fr: D'après POSIX, un programme qui n'a pas appelé ``setlocale(LC_ALL, '')`` fonctionne en utilisant le paramètre régional portable ``'C'``. Appeler ``setlocale(LC_ALL, '')`` lui permet d'utiliser les paramètres régionaux par défaut définis par la variable :envvar:`LANG`. Comme nous ne voulons pas interférer avec les paramètres régionaux actuels, nous émulons donc le comportement décrit ci-dessus.

source: To maintain compatibility with other platforms, not only the :envvar:`LANG` variable is tested, but a list of variables given as envvars parameter. The first found to be defined will be used. *envvars* defaults to the search path used in GNU gettext; it must always contain the variable name ``'LANG'``. The GNU gettext search path contains ``'LC_ALL'``, ``'LC_CTYPE'``, ``'LANG'`` and ``'LANGUAGE'``, in that order.
fr: Afin de maintenir la compatibilité avec d'autres plateformes, non seulement la variable :envvar:`LANG` est testée, mais c'est aussi le cas pour toute une liste de variables passés en paramètre via *envvars*. La première variable à être définie sera utilisée. *envvars* utilise par défaut le chemin de recherche utilisé dans GNU *gettext* ; il doit toujours contenir le nom de variable ``'LANG'``. Le chemin de recherche de GNU *gettext* contient ``'LC_ALL'``, ``'LC_CTYPE'``, ``'LANG'`` et ``'LANGUAGE'``, dans cet ordre.

source: Except for the code ``'C'``, the language code corresponds to :rfc:`1766`. *language code* and *encoding* may be ``None`` if their values cannot be determined.
fr: À l'exception du code ``'C'``, le code d'une langue correspond à la :rfc:`1766`. Le *code de la langue* et l'*encodage* peuvent valoir ``None`` si leur valeur ne peut être déterminée.

source: Returns the current setting for the given locale category as sequence containing *language code*, *encoding*. *category* may be one of the :const:`LC_\*` values except :const:`LC_ALL`. It defaults to :const:`LC_CTYPE`.
fr: Renvoie les réglages actuels pour la catégorie de paramètres régionaux donnée, sous la forme d'une séquence contenant le *code de la langue* et l'*encodage*. La catégorie *category* peut être l'une des valeurs :const:`LC_\*` à l'exception de :const:`LC_ALL`. La valeur par défaut est :const:`LC_CTYPE`.

source: On some systems, it is necessary to invoke :func:`setlocale` to obtain the user preferences, so this function is not thread-safe. If invoking setlocale is not necessary or desired, *do_setlocale* should be set to ``False``.
fr: Sur certains systèmes, il est nécessaire d'invoquer :func:`setlocale` pour obtenir les préférences de l'utilisateur, cette fonction n'est donc pas utilisable sans protection dans les programmes à fils d'exécutions multiples. Si l'appel de ``setlocale`` n'est pas nécessaire ou souhaité, *do_setlocale* doit être réglé à ``False``.

source: Returns a normalized locale code for the given locale name. The returned locale code is formatted for use with :func:`setlocale`. If normalization fails, the original name is returned unchanged.
fr: Renvoie un code normalisé pour le nom du paramètre régional fourni. Ce code renvoyé est structuré de façon à être utilisé avec :func:`setlocale`. Si la normalisation échoue, le nom d'origine est renvoyé inchangé.

source: If the given encoding is not known, the function defaults to the default encoding for the locale code just like :func:`setlocale`.
fr: Si l'encodage donné n'est pas connu, la fonction utilise l'encodage par défaut pour le code du paramètre régional, tout comme :func:`setlocale`.

source: Sets the locale for *category* to the default setting.
fr: Définit le paramètre régional de la catégorie *category* au réglage par défaut.

source: The default setting is determined by calling :func:`getdefaultlocale`. *category* defaults to :const:`LC_ALL`.
fr: Le réglage par défaut est déterminé en appelant :func:`getdefaultlocale`. La catégorie *category* vaut par défaut :const:`LC_ALL`.

source: Compares two strings according to the current :const:`LC_COLLATE` setting. As any other compare function, returns a negative, or a positive value, or ``0``, depending on whether *string1* collates before or after *string2* or is equal to it.
fr: Compare deux chaînes en se basant sur le paramètre :const:`LC_COLLATE` actuel. Comme toute autre fonction de comparaison, renvoie une valeur négative, positive, ou ``0``, selon si *string1* est lexicographiquement inférieure, supérieure, ou égale à *string2*.

source: Transforms a string to one that can be used in locale-aware comparisons. For example, ``strxfrm(s1) < strxfrm(s2)`` is equivalent to ``strcoll(s1, s2) < 0``. This function can be used when the same string is compared repeatedly, e.g. when collating a sequence of strings.
fr: Transforme une chaîne de caractères en une chaîne qui peut être utilisée dans les comparaisons sensibles aux paramètres régionaux. Par exemple, ``strxfrm(s1) < strxfrm(s2)`` est équivalent à ``strcoll(s1, s2) < 0``. Cette fonction peut être utilisée lorsque la même chaîne est comparée de façon répétitive, par exemple lors de l'assemblage d'une séquence de chaînes.

source: Formats a number *val* according to the current :const:`LC_NUMERIC` setting. The format follows the conventions of the ``%`` operator. For floating point values, the decimal point is modified if appropriate. If *grouping* is true, also takes the grouping into account.
fr: Structure un nombre *val* en fonction du paramètre :const:`LC_NUMERIC` actuel. Le format suit les conventions de l'opérateur ``%``. Pour les valeurs à virgule flottante, le point décimal est modifié si nécessaire. Si *grouping* est vrai, le regroupement est également pris en compte.

source: If *monetary* is true, the conversion uses monetary thousands separator and grouping strings.
fr: Si *monetary* est vrai, la conversion utilise un séparateur des milliers monétaire et des chaînes de regroupement.

source: Processes formatting specifiers as in ``format % val``, but takes the current locale settings into account.
fr: Traite les marqueurs de structure en ``format % val``, mais en prenant en compte les paramètres régionaux actuels.

source: Formats a number *val* according to the current :const:`LC_MONETARY` settings.
fr: Structure un nombre *val* en fonction du paramètre :const:`LC_MONETARY` actuel.

source: The returned string includes the currency symbol if *symbol* is true, which is the default. If *grouping* is true (which is not the default), grouping is done with the value. If *international* is true (which is not the default), the international currency symbol is used.
fr: La chaîne renvoyée inclut le symbole monétaire si *symbol* est vrai, ce qui est le cas par défaut. Si *grouping* est vrai (ce qui n'est pas le cas par défaut), un regroupement est effectué avec la valeur. Si *international* est vrai (ce qui n'est pas le cas par défaut), le symbole de la devise internationale est utilisé.

source: Note that this function will not work with the 'C' locale, so you have to set a locale via :func:`setlocale` first.
fr: Notez que cette fonction ne fonctionnera pas avec le paramètre régional 'C', vous devez donc d'abord en définir un via :func:`setlocale`.

source: Formats a floating point number using the same format as the built-in function ``str(float)``, but takes the decimal point into account.
fr: Structure un nombre flottant en utilisant le même format que la fonction native ``str(float)``, mais en prenant en compte le point décimal.

source: Converts a string into a normalized number string, following the :const:`LC_NUMERIC` settings.
fr: Convertit une chaîne de caractères en une chaîne de nombres normalisés, en suivant les réglages :const:`LC_NUMERIC`.

source: Converts a string to an integer, following the :const:`LC_NUMERIC` conventions.
fr: Convertit une chaîne de caractères en un entier, en suivant les réglages :const:`LC_NUMERIC`.
