Repository: python/python-docs-fr
Catalog: library/locale.po
Languages: fr

source: Locale category for the character type functions. Depending on the settings of this category, the functions of module :mod:`string` dealing with case change their behaviour.
fr: Catégorie de paramètre régional pour les fonctions de type caractère. Suivant les réglages de la catégorie, les fonctions du module :mod:`string` gérant la casse peuvent changer leur comportement.

source: Locale category for sorting strings. The functions :func:`strcoll` and :func:`strxfrm` of the :mod:`locale` module are affected.
fr: Catégorie de paramètre régional pour les tris de chaînes de caractères. Les fonctions :func:`strcoll` et :func:`strxfrm` du module :mod:`locale` sont concernées.

source: Locale category for the formatting of time. The function :func:`time.strftime` follows these conventions.
fr: Catégorie de paramètre régional pour la mise en forme de la date et de l'heure. La fonction :func:`time.strftime` suit ces conventions.

source: Locale category for formatting of monetary values. The available options are available from the :func:`localeconv` function.
fr: Catégorie de paramètre régional pour la mise en forme des valeurs monétaires. Les options disponibles sont accessibles à partir de la fonction :func:`localeconv`.

source: Locale category for message display. Python currently does not support application specific locale-aware messages. Messages displayed by the operating system, like those returned by :func:`os.strerror` might be affected by this category.
fr: Catégorie de paramètre régional pour l'affichage de messages. Actuellement, Python ne gère pas les messages spécifiques aux applications qui sont sensibles aux paramètres régionaux. Les messages affichés par le système d'exploitation, comme ceux renvoyés par :func:`os.strerror` peuvent être affectés par cette catégorie.

source: Locale category for formatting numbers. The functions :func:`.format`, :func:`atoi`, :func:`atof` and :func:`.str` of the :mod:`locale` module are affected by that category. All other numeric formatting operations are not affected.
fr: Catégorie de paramètre régional pour la mise en forme des nombres. Les fonctions :func:`.format`, :func:`atoi`, :func:`atof` et :func:`.str` du module :mod:`locale` sont affectées par cette catégorie. Toutes les autres opérations de mise en forme des nombres ne sont pas affectées.

source: Combination of all locale settings. If this flag is used when the locale is changed, setting the locale for all categories is attempted. If that fails for any category, no category is changed at all. When the locale is retrieved using this flag, a string indicating the setting for all categories is returned. This string can be later used to restore the settings.
fr: Combinaison de tous les paramètres régionaux. Si cette option est utilisée lors du changement de paramètres régionaux, la définition de ces paramètres pour toutes les catégories est tentée. Si cela échoue pour n'importe quelle catégorie, aucune d'entre elles n'est modifiée. Lorsque les paramètres régionaux sont récupérés à l'aide de cette option, une chaîne de caractères indiquant le réglage pour toutes les catégories est renvoyée. Cette chaîne peut alors être utilisée plus tard pour restaurer les paramètres d'origine.

source: This is a symbolic constant used for different values returned by :func:`localeconv`.
fr: Ceci est une constante symbolique utilisée pour différentes valeurs renvoyées par :func:`localeconv`.

source: Example::
fr: Exemple ::

source: Background, details, hints, tips and caveats
fr: Contexte, détails, conseils, astuces et mises en garde

source: Initially, when a program is started, the locale is the ``C`` locale, no matter what the user's preferred locale is. There is one exception: the :data:`LC_CTYPE` category is changed at startup to set the current locale encoding to the user's preferred locale encoding. The program must explicitly say that it wants the user's preferred locale settings for other categories by calling ``setlocale(LC_ALL, '')``.
fr: Initialement, lorsqu'un programme est démarré, les paramètres régionaux ``C`` sont utilisés, peu importe les réglages de l'utilisateur. Il y a toutefois une exception : la catégorie :data:`LC_CTYPE` est modifiée au démarrage pour définir l'encodage des paramètres régionaux actuels comme celui défini par l'utilisateur. Le programme doit explicitement dire qu'il veut utiliser les réglages de l'utilisateur pour les autres catégories, en appelant ``setlocale(LC_ALL, '')``.

source: It is generally a bad idea to call :func:`setlocale` in some library routine, since as a side effect it affects the entire program. Saving and restoring it is almost as bad: it is expensive and affects other threads that happen to run before the settings have been restored.
fr: C'est généralement une mauvaise idée d'appeler :func:`setlocale` dans une routine de bibliothèque car cela a pour effet secondaire d'affecter le programme entier. Sauvegarder et restaurer les paramètres est presque aussi mauvais : c'est coûteux et cela affecte d'autres fils d'exécutions qui s'exécutent avant que les paramètres n'aient été restaurés.

source: If, when coding a module for general use, you need a locale independent version of an operation that is affected by the locale (such as certain formats used with :func:`time.strftime`), you will have to find a way to do it without using the standard library routine. Even better is convincing yourself that using locale settings is okay. Only as a last resort should you document that your module is not compatible with non-\ ``C`` locale settings.
fr: Si, lors du développement d'un module à usage général, vous avez besoin d'une version indépendante des paramètres régionaux pour une opération y étant sensible (comme c'est le cas pour certains formats utilisés avec :func:`time.strftime`), vous devez trouver un moyen de le faire sans utiliser la routine de la bibliothèque standard. Le mieux est encore de se convaincre que l'usage des paramètres régionaux est une bonne chose. Ce n'est qu'en dernier recours que vous devez documenter que votre module n'est pas compatible avec les réglages du paramètre régional ``C``.

source: The only way to perform numeric operations according to the locale is to use the special functions defined by this module: :func:`atof`, :func:`atoi`, :func:`.format`, :func:`.str`.
fr: La seule façon d'effectuer des opérations numériques conformément aux paramètres régionaux est d'utiliser les fonctions spéciales définies par ce module : :func:`atof`, :func:`atoi`, :func:`.format`, :func:`.str`.

source: There is no way to perform case conversions and character classifications according to the locale. For (Unicode) text strings these are done according to the character value only, while for byte strings, the conversions and classifications are done according to the ASCII value of the byte, and bytes whose high bit is set (i.e., non-ASCII bytes) are never converted or considered part of a character class such as letter or whitespace.
fr: Il n'y a aucun moyen d'effectuer des conversions de casse et des classifications de caractères en fonction des paramètres régionaux. Pour les chaînes de caractères (Unicode), celles-ci se font uniquement en fonction de la valeur du caractère, tandis que pour les chaînes d'octets, les conversions et les classifications se font en fonction de la valeur ASCII de l'octet, et les octets dont le bit de poids fort est à 1 (c'est-à-dire les octets non ASCII) ne sont jamais convertis ou considérés comme faisant partie d'une classe de caractères comme une lettre ou une espace.

source: For extension writers and programs that embed Python
fr: Pour les auteurs d'extensions et les programmes qui intègrent Python

source: Extension modules should never call :func:`setlocale`, except to find out what the current locale is. But since the return value can only be used portably to restore it, that is not very useful (except perhaps to find out whether or not the locale is ``C``).
fr: Les modules d'extensions ne devraient jamais appeler :func:`setlocale`, sauf pour connaître le paramètre régional actuel. Mais comme la valeur renvoyée ne peut être utilisée que pour le restaurer, ce n'est pas très utile (sauf peut-être pour savoir si le paramètre régional est défini à ``C`` ou non).

source: When Python code uses the :mod:`locale` module to change the locale, this also affects the embedding application. If the embedding application doesn't want this to happen, it should remove the :mod:`_locale` extension module (which does all the work) from the table of built-in modules in the :file:`config.c` file, and make sure that the :mod:`_locale` module is not accessible as a shared library.
fr: Lorsque le code Python utilise le module :mod:`locale` pour changer le paramètre régional, cela affecte également l'application intégrée. Si l'application intégrée ne souhaite pas que cela se produise, elle doit supprimer le module d'extension :mod:`_locale` (qui fait tout le travail) de la table des modules natifs se trouvant dans le fichier :file:`config.c`, et s'assurer que le module :mod:`_locale` n'est pas accessible en tant que bibliothèque partagée.

source: Access to message catalogs
fr: Accéder aux catalogues de messages

source: The locale module exposes the C library's gettext interface on systems that provide this interface. It consists of the functions :func:`!gettext`, :func:`!dgettext`, :func:`!dcgettext`, :func:`!textdomain`, :func:`!bindtextdomain`, and :func:`!bind_textdomain_codeset`. These are similar to the same functions in the :mod:`gettext` module, but use the C library's binary format for message catalogs, and the C library's search algorithms for locating message catalogs.
fr: Le module *locale* expose l'interface *gettext* de la bibliothèque C sur les systèmes qui fournissent cette interface. Il se compose des fonctions :func:`!gettext`, :func:`!dgettext`, :func:`!dcgettext`, :func:`!textdomain`, :func:`!bindtextdomain` et :func:`!bind_textdomain_codeset`. Elles sont similaires aux fonctions du module :mod:`gettext`, mais utilisent le format binaire de la bibliothèque C pour les catalogues de messages.

source: Python applications should normally find no need to invoke these functions, and should use :mod:`gettext` instead. A known exception to this rule are applications that link with additional C libraries which internally invoke :c:func:`gettext` or :c:func:`dcgettext`. For these applications, it may be necessary to bind the text domain, so that the libraries can properly locate their message catalogs.
fr: Les applications Python ne devraient normalement pas avoir besoin de faire appel à ces fonctions, mais devraient plutôt utiliser :mod:`gettext`. Une exception connue pour cette règle concerne les applications qui sont liées avec des bibliothèques C supplémentaires faisant appel à :c:func:`gettext` ou :c:func:`dcgettext`. Pour ces applications, il peut être nécessaire de lier le domaine du texte, afin que les bibliothèques puissent régionaliser correctement leurs catalogues de messages.
