Repository: python/python-docs-fr
Catalog: library/lzma.po
Languages: fr

source: The BCJ filters are intended to be applied to machine code. They convert relative branches, calls and jumps in the code to use absolute addressing, with the aim of increasing the redundancy that can be exploited by the compressor. These filters support one option, ``start_offset``. This specifies the address that should be mapped to the beginning of the input data. The default is 0.
fr: Les filtres BCJ sont conçus pour être appliqués sur du langage machine. Ils convertissent les branches relatives, les appels et les sauts dans le code à des fins d'adressage strict, dans le but d'augmenter la redondance mise en jeu par le compresseur. Ils ne supportent qu'une seule option : ``start_offset``, pour définir l'adresse où sera déclenché le début de la donnée d'entrée. Par défaut : 0.

source: Examples
fr: Exemples

source: Reading in a compressed file::
fr: Lire un fichier compressé ::

source: Creating a compressed file::
fr: Créer un fichier compressé ::

source: Compressing data in memory::
fr: Compresser des données en mémoire ::

source: Incremental compression::
fr: Compression incrémentale ::

source: Writing compressed data to an already-open file::
fr: Écrire des données compressées dans un fichier préalablement ouvert ::

source: Creating a compressed file using a custom filter chain::
fr: Créer un fichier compressé en utilisant une chaîne de filtre personnalisée ::
