Repository: python/python-docs-fr
Catalog: library/lzma.po
Languages: fr

source: **Source code:** :source:`Lib/lzma.py`
fr: **Code source :** :source:`Lib/lzma.py`

source: This module provides classes and convenience functions for compressing and decompressing data using the LZMA compression algorithm. Also included is a file interface supporting the ``.xz`` and legacy ``.lzma`` file formats used by the :program:`xz` utility, as well as raw compressed streams.
fr: Ce module fournit des classes et des fonctions utiles pour compresser et décompresser des données en utilisant l'algorithme de compression LZMA. Ce module inclut aussi aussi une interface prenant en charge les fichiers ``.xz`` et son format originel ``.lzma`` utilisés par l'utilitaire :program:`xz`, ainsi que les flux bruts compressés.

source: This exception is raised when an error occurs during compression or decompression, or while initializing the compressor/decompressor state.
fr: Cette exception est levée dès lors qu'une erreur survient pendant la compression ou la décompression, ou pendant l'initialisation de l'état de la compression/décompression.

source: Reading and writing compressed files
fr: Lire et écrire des fichiers compressés

source: The *filename* argument can be either an actual file name (given as a :class:`str`, :class:`bytes` or :term:`path-like <path-like object>` object), in which case the named file is opened, or it can be an existing file object to read from or write to.
fr: L'argument *nom de fichier* peut être soit le nom d'un fichier à créer (donné pour :class:`str`, :class:`bytes` ou un objet :term:`path-like <path-like object>`), dont le fichier nommé reste ouvert, ou soit un objet fichier existant à lire ou à écrire.

source: The *mode* argument can be any of ``"r"``, ``"rb"``, ``"w"``, ``"wb"``, ``"x"``, ``"xb"``, ``"a"`` or ``"ab"`` for binary mode, or ``"rt"``, ``"wt"``, ``"xt"``, or ``"at"`` for text mode. The default is ``"rb"``.
fr: L'argument *mode* peut être n'importe quel argument suivant : ``"r"``, ``"rb"``, ``"w"``, ``"wb"``, ``"x"``, ``"xb"``, ``"a"`` ou ``"ab"`` pour le mode binaire, ou ``"rt"``, ``"wt"``, ``"xt"``, ou ``"at"`` pour le mode texte. La valeur par défaut est ``"rb"``.

source: When opening a file for reading, the *format* and *filters* arguments have the same meanings as for :class:`LZMADecompressor`. In this case, the *check* and *preset* arguments should not be used.
fr: Quand un fichier est ouvert pour le lire, les arguments *format* et *filters* ont les mêmes significations que pour la :class:`LZMADecompressor`. Par conséquent, les arguments *check* et *preset* ne devront pas être sollicités.

source: When opening a file for writing, the *format*, *check*, *preset* and *filters* arguments have the same meanings as for :class:`LZMACompressor`.
fr: Dès ouverture d'un fichier pour l'écriture, les arguments *format*, *check*, *preset* et *filters* ont le même sens que dans la :class:`LZMACompressor`.

source: For binary mode, this function is equivalent to the :class:`LZMAFile` constructor: ``LZMAFile(filename, mode, ...)``. In this case, the *encoding*, *errors* and *newline* arguments must not be provided.
fr: Pour le mode binaire, cette fonction équivaut au constructeur de la :class:`LZMAFile` : ``LZMAFile(filename, mode, ...)``. Dans ce cas précis, les arguments *encoding*, *errors* et *newline* ne sont pas accessibles.

source: Added support for the ``"x"``, ``"xb"`` and ``"xt"`` modes.
fr: Support ajouté pour les modes ``"x"``, ``"xb"`` et ``"xt"``.

source: Accepts a :term:`path-like object`.
fr: Accepte un :term:`path-like object`.

source: Open an LZMA-compressed file in binary mode.
fr: Ouvre un fichier LZMA compressé en mode binaire.

source: The *mode* argument can be either ``"r"`` for reading (default), ``"w"`` for overwriting, ``"x"`` for exclusive creation, or ``"a"`` for appending. These can equivalently be given as ``"rb"``, ``"wb"``, ``"xb"`` and ``"ab"`` respectively.
fr: L'argument *mode* peut être soit ``"r"`` pour la lecture (défaut), ``"w"`` pour la ré-écriture, ``"x"`` pour la création exclusive, ou ``"a"`` pour l'insertion. Elles peuvent aussi être écrites de la façon suivante : ``"rb"``, ``"wb"``, ``"xb"`` et ``"ab"`` respectivement.

source: When opening a file for reading, the input file may be the concatenation of multiple separate compressed streams. These are transparently decoded as a single logical stream.
fr: Dès l'ouverture d'un fichier pour être lu, le fichier d'entrée peut être le résultat d'une concaténation de plusieurs flux distincts et compressés. Ceux-ci sont décodés de manière transparente en un seul flux logique.

source: Return buffered data without advancing the file position. At least one byte of data will be returned, unless EOF has been reached. The exact number of bytes returned is unspecified (the *size* argument is ignored).
fr: Renvoie la donnée en mémoire-tampon sans progression de la position du fichier. Au moins un octet de donnée sera renvoyé, jusqu'à ce que l'EOF soit atteinte. Le nombre exact d'octets renvoyés demeure indéterminé (l'argument *taille* est ignoré).

source: The :meth:`~io.BufferedIOBase.read` method now accepts an argument of ``None``.
fr: La méthode :meth:`~io.BufferedIOBase.read` accepte maintenant un argument ``None``.

source: Compressing and decompressing data in memory
fr: Compresser et décompresser une donnée en mémoire

source: Create a compressor object, which can be used to compress data incrementally.
fr: Créé un objet compresseur, qui peut être utilisé pour compresser incrémentalement une donnée.

source: For a more convenient way of compressing a single chunk of data, see :func:`compress`.
fr: Pour une façon plus adaptée de compresser un seul extrait de donnée, voir :func:`compress`.

source: The *format* argument specifies what container format should be used. Possible values are:
fr: L'argument *format* définit quel format de conteneur sera mis en œuvre. Les valeurs possibles sont :

source: :const:`FORMAT_XZ`: The ``.xz`` container format.
fr: :const:`FORMAT_XZ`: Le format du conteneur ``.xz``.

source: This is the default format.
fr: C'est le format par défaut.

source: :const:`FORMAT_ALONE`: The legacy ``.lzma`` container format.
fr: :const:`FORMAT_ALONE`: L'ancien format du conteneur ``.lzma``.

source: This format is more limited than ``.xz`` -- it does not support integrity checks or multiple filters.
fr: Ce format est davantage limité que ``.xz`` --il ne supporte pas les vérifications d'intégrité ou les filtres multiples.

source: :const:`FORMAT_RAW`: A raw data stream, not using any container format.
fr: :const:`FORMAT_RAW`: Un flux de données brut, n'utilisant aucun format de conteneur.

source: This format specifier does not support integrity checks, and requires that you always specify a custom filter chain (for both compression and decompression). Additionally, data compressed in this manner cannot be decompressed using :const:`FORMAT_AUTO` (see :class:`LZMADecompressor`).
fr: Ce format spécifique ne prend pas en charge les vérifications d'intégrité et exige systématiquement la définition d'une chaîne de filtrage personnalisée (à la fois pour la compression et la décompression). Par ailleurs, les données compressées par ce biais ne peuvent pas être décompressées par l'usage de :const:`FORMAT_AUTO` (voir : :class:`LZMADecompressor`).

source: The *check* argument specifies the type of integrity check to include in the compressed data. This check is used when decompressing, to ensure that the data has not been corrupted. Possible values are:
fr: L'argument *check* détermine le type de vérification d'intégrité à exploiter avec la donnée compressée. Cette vérification est déclenchée lors de la décompression, pour garantir que la donnée n'a pas été corrompue. Les valeurs possibles sont :

source: :const:`CHECK_NONE`: No integrity check. This is the default (and the only acceptable value) for :const:`FORMAT_ALONE` and :const:`FORMAT_RAW`.
fr: :const:`CHECK_NONE`: Pas de vérification d'intégrité. C'est la valeur par défaut (et la seule valeur acceptable) pour :const:`FORMAT_ALONE` et :const:`FORMAT_RAW`.

source: :const:`CHECK_CRC32`: 32-bit Cyclic Redundancy Check.
fr: :const:`CHECK_CRC32`: Vérification par Redondance Cyclique 32-bit (*Cyclic Redundancy Check*).

source: :const:`CHECK_CRC64`: 64-bit Cyclic Redundancy Check. This is the default for :const:`FORMAT_XZ`.
fr: :const:`CHECK_CRC64`: Vérification par Redondance Cyclique 64-bit (*Cyclic Redundancy Check*). Valeur par défaut pour :const:`FORMAT_XZ`.

source: :const:`CHECK_SHA256`: 256-bit Secure Hash Algorithm.
fr: :const:`CHECK_SHA256`: Algorithme de Hachage Sécurisé 256-bit (*Secure Hash Algorithm*).

source: If the specified check is not supported, an :class:`LZMAError` is raised.
fr: Si le type de vérification n'est pas supporté par le système, une erreur de type :class:`LZMAError` est levée.

source: The compression settings can be specified either as a preset compression level (with the *preset* argument), or in detail as a custom filter chain (with the *filters* argument).
fr: Les réglages de compression peuvent être définis soit comme un pré-réglage de niveau de compression (avec l'argument *preset*) ; soit de façon détaillée comme une chaîne particulière de filtres (avec l'argument *filters*).

source: The *preset* argument (if provided) should be an integer between ``0`` and ``9`` (inclusive), optionally OR-ed with the constant :const:`PRESET_EXTREME`. If neither *preset* nor *filters* are given, the default behavior is to use :const:`PRESET_DEFAULT` (preset level ``6``). Higher presets produce smaller output, but make the compression process slower.
fr: L'argument *preset* (s'il est fourni) doit être un entier compris entre ``0`` et ``9`` (inclus), éventuellement relié à OR avec la constante :const:`PRESET_EXTREME`. Si aucun *preset* ni *filters* ne ont définis, le comportement par défaut consiste à utiliser la :const:`PRESET_DEFAULT` (niveau par défaut : ``6``). Des pré-réglages plus élevés entraîne une sortie plus petite, mais rend le processus de compression plus lent.

source: In addition to being more CPU-intensive, compression with higher presets also requires much more memory (and produces output that needs more memory to decompress). With preset ``9`` for example, the overhead for an :class:`LZMACompressor` object can be as high as 800 MiB. For this reason, it is generally best to stick with the default preset.
fr: En plus d'être plus gourmande en CPU, la compression avec des préréglages plus élevés nécessite beaucoup plus de mémoire (et produit des résultats qui nécessitent plus de mémoire pour décompresser). Par exemple, avec le préréglage ``9``, l'objet d'une :class:`LZMACompressor` peut dépasser largement les 800 Mo. Pour cette raison, il est généralement préférable de respecter le préréglage par défaut.

source: The *filters* argument (if provided) should be a filter chain specifier. See :ref:`filter-chain-specs` for details.
fr: L'argument *filters* (s'il est défini) doit être un critère de la chaîne de filtrage. Voir :ref:`filter-chain-specs` pour plus de précisions.

source: Compress *data* (a :class:`bytes` object), returning a :class:`bytes` object containing compressed data for at least part of the input. Some of *data* may be buffered internally, for use in later calls to :meth:`compress` and :meth:`flush`. The returned data should be concatenated with the output of any previous calls to :meth:`compress`.
fr: Une *data* compressée (un objet :class:`bytes`), renvoie un objet :class:`bytes` contenant une donnée compressée pour au moins une partie de l'entrée. Certaine *data* peuvent être mise en tampon, pour être utiliser lors de prochains appels par :meth:`compress` et :meth:`flush`. La donnée renvoyée pourra être concaténée avec la sortie d'appels précédents vers la méthode :meth:`compress`.

source: Finish the compression process, returning a :class:`bytes` object containing any data stored in the compressor's internal buffers.
fr: Conclut l'opération de compression, en renvoyant l'objet :class:`bytes` constitué de toutes les données stockées dans les tampons interne du compresseur.

source: Create a decompressor object, which can be used to decompress data incrementally.
fr: Créé un objet de décompression, pour décompresser de façon incrémentale une donnée.

source: For a more convenient way of decompressing an entire compressed stream at once, see :func:`decompress`.
fr: Pour un moyen plus pratique de décompresser un flux compressé complet en une seule fois, voir :func:`decompress`.

source: The *format* argument specifies the container format that should be used. The default is :const:`FORMAT_AUTO`, which can decompress both ``.xz`` and ``.lzma`` files. Other possible values are :const:`FORMAT_XZ`, :const:`FORMAT_ALONE`, and :const:`FORMAT_RAW`.
fr: L'argument *format* spécifie le format du conteneur à utiliser. La valeur par défaut est :const:`FORMAT_AUTO` pouvant à la fois décompresser les fichiers ``.xz`` et ``.lzma``. D'autres valeurs sont possibles comme :const:`FORMAT_XZ`, :const:`FORMAT_ALONE`, et :const:`FORMAT_RAW`.

source: The *memlimit* argument specifies a limit (in bytes) on the amount of memory that the decompressor can use. When this argument is used, decompression will fail with an :class:`LZMAError` if it is not possible to decompress the input within the given memory limit.
fr: L'argument *memlimit* spécifie une limite (en octets) sur la quantité de mémoire que le décompresseur peut utiliser. Lorsque cet argument est utilisé, la décompression échouera avec une :class:`LZMAError` s'il n'est pas possible de décompresser l'entrée dans la limite mémoire disponible.

source: The *filters* argument specifies the filter chain that was used to create the stream being decompressed. This argument is required if *format* is :const:`FORMAT_RAW`, but should not be used for other formats. See :ref:`filter-chain-specs` for more information about filter chains.
fr: L'argument *filters* spécifie la chaîne de filtrage utilisée pour créer le flux décompressé. Cet argument est requis si *format* est :const:`FORMAT_RAW`, mais ne doit pas être utilisé pour d'autres formats. Voir :ref:`filter-chain-specs` pour plus d'informations sur les chaînes de filtrage.

source: This class does not transparently handle inputs containing multiple compressed streams, unlike :func:`decompress` and :class:`LZMAFile`. To decompress a multi-stream input with :class:`LZMADecompressor`, you must create a new decompressor for each stream.
fr: Cette classe ne gère pas de manière transparente les entrées contenant plusieurs flux compressés, contrairement à :func:`decompress` et :class:`LZMAFile`. Pour décompresser une entrée multi-flux avec :class:`LZMADecompressor`, vous devez créer un nouveau décompresseur à chaque flux.

source: Decompress *data* (a :term:`bytes-like object`), returning uncompressed data as bytes. Some of *data* may be buffered internally, for use in later calls to :meth:`decompress`. The returned data should be concatenated with the output of any previous calls to :meth:`decompress`.
fr: Décompresse *data* (un :term:`bytes-like object`), renvoyant une donnée non compressée en tant que chaîne d'octets. Certaines de ces *data* peuvent être mises en interne en tampon, pour un usage lors d'appels ultérieurs par la méthode :meth:`decompress`. La donnée renvoyée doit être concaténée avec la sortie des appels précédents à la méthode :meth:`decompress`.

source: If *max_length* is nonnegative, returns at most *max_length* bytes of decompressed data. If this limit is reached and further output can be produced, the :attr:`~.needs_input` attribute will be set to ``False``. In this case, the next call to :meth:`~.decompress` may provide *data* as ``b''`` to obtain more of the output.
fr: Si *max_length* est positif, renvoie au plus *max_length* octets de données compressées. Si la limite est atteinte et que d'autres sorties peuvent être produites, l'attribut :attr:`~.needs_input` est positionné sur ``False``. Dans ce cas, lors de l'appel suivant à la méthode :meth:`~.decompress`, vous pouvez fournir ``b''`` dans *data* afin d'obtenir la suite de la sortie.

source: If all of the input data was decompressed and returned (either because this was less than *max_length* bytes, or because *max_length* was negative), the :attr:`~.needs_input` attribute will be set to ``True``.
fr: Si toutes les données entrées ont été décompressées et renvoyées (soit parce qu'il y avait moins de *max_length* octets, ou parce que *max_length* était négatif), l'attribut :attr:`~.needs_input` sera configuré sur ``True``.

source: Added the *max_length* parameter.
fr: Ajout du paramètre *max_length*.

source: The ID of the integrity check used by the input stream. This may be :const:`CHECK_UNKNOWN` until enough of the input has been decoded to determine what integrity check it uses.
fr: L'ID de la vérification d'intégrité exploité par le flux entrant. Il s'agit de :const:`CHECK_UNKNOWN` tant que ce flux a été décodé pour déterminer quel type de vérification d'intégrité à été utilisé.

source: ``True`` if the end-of-stream marker has been reached.
fr: ``True`` si le marqueur de fin de flux a été atteint.

source: Data found after the end of the compressed stream.
fr: Donnée trouvée après la fin du flux compressé.

source: Before the end of the stream is reached, this will be ``b""``.
fr: Avant d'atteindre la fin du flux, ce sera ``b""``.

source: ``False`` if the :meth:`.decompress` method can provide more decompressed data before requiring new uncompressed input.
fr: ``False`` si la méthode :meth:`.decompress` peut fournir plus de données décompressées avant l'acquisition d'une nouvelle entrée non compressée.

source: Compress *data* (a :class:`bytes` object), returning the compressed data as a :class:`bytes` object.
fr: *data* compressée (un objet :class:`bytes`), renvoyant une donnée compressée comme un objet :class:`bytes`.

source: See :class:`LZMACompressor` above for a description of the *format*, *check*, *preset* and *filters* arguments.
fr: Voir :class:`LZMACompressor` ci-dessus pour une description des arguments *format*, *check*, *preset* et *filters*.

source: Decompress *data* (a :class:`bytes` object), returning the uncompressed data as a :class:`bytes` object.
fr: Décompresse *data* (un objet :class:`bytes` ), et retourne la donnée décompressée sous la forme d'un objet :class:`bytes`.

source: If *data* is the concatenation of multiple distinct compressed streams, decompress all of these streams, and return the concatenation of the results.
fr: Si *data* est le résultat de la concaténation de plusieurs flux compressés et distincts , il les décompresse tous, et retourne les résultats concaténés.

source: See :class:`LZMADecompressor` above for a description of the *format*, *memlimit* and *filters* arguments.
fr: Voir :class:`LZMADecompressor` ci-dessus pour une description des arguments *format*, *memlimit* et *filters*.

source: Miscellaneous
fr: Divers

source: :const:`CHECK_NONE` and :const:`CHECK_CRC32` are always supported. :const:`CHECK_CRC64` and :const:`CHECK_SHA256` may be unavailable if you are using a version of :program:`liblzma` that was compiled with a limited feature set.
fr: :const:`CHECK_NONE` et :const:`CHECK_CRC32` sont toujours pris en charge. :const:`CHECK_CRC64` et :const:`CHECK_SHA256` peuvent être indisponibles si vous utilisez une version de :program:`liblzma` compilée avec des possibilités restreintes.

source: Specifying custom filter chains
fr: Préciser des chaînes de filtre personnalisées

source: A filter chain specifier is a sequence of dictionaries, where each dictionary contains the ID and options for a single filter. Each dictionary must contain the key ``"id"``, and may contain additional keys to specify filter-dependent options. Valid filter IDs are as follows:
fr: Une chaîne de filtres est une séquence de dictionnaires, où chaque dictionnaire contient l'ID et les options pour chaque filtre. Le moindre dictionnaire contient la clé ``"id"`` et peut aussi contenir d'autres clés pour préciser chaque options relative au filtre déclaré. Les ID valides des filtres sont définies comme suit :

source: Compression filters:
fr: Filtres de compression :

source: :const:`FILTER_LZMA1` (for use with :const:`FORMAT_ALONE`)
fr: :const:`FILTER_LZMA1` (à utiliser avec :const:`FORMAT_ALONE`)

source: :const:`FILTER_LZMA2` (for use with :const:`FORMAT_XZ` and :const:`FORMAT_RAW`)
fr: :const:`FILTER_LZMA2` (à utiliser avec :const:`FORMAT_XZ` et :const:`FORMAT_RAW`)

source: Delta filter:
fr: Filtre Delta :

source: Branch-Call-Jump (BCJ) filters:
fr: Filtres Branch-Call-Jump (BCJ) :

source: A filter chain can consist of up to 4 filters, and cannot be empty. The last filter in the chain must be a compression filter, and any other filters must be delta or BCJ filters.
fr: Une chaîne de filtres peut contenir jusqu'à 4 filtres, et ne peut pas être vide. Le dernier filtre de cette chaîne devra être un filtre de compression, et tous les autres doivent être des filtres delta ou BCJ.

source: Compression filters support the following options (specified as additional entries in the dictionary representing the filter):
fr: Les filtres de compression contiennent les options suivantes (définies comme entrées additionnelles dans le dictionnaire qui représente le filtre) :

source: ``preset``: A compression preset to use as a source of default values for options that are not specified explicitly.
fr: ``preset``: Un pré-réglage à exploiter comme une source de valeurs par défaut pour les options qui ne sont pas explicitement définies.

source: ``dict_size``: Dictionary size in bytes. This should be between 4 KiB and 1.5 GiB (inclusive).
fr: ``dict_size``: La taille du dictionnaire en octets. Comprise entre 4 Ko et 1.5 Go (inclus).

source: ``lc``: Number of literal context bits.
fr: ``lc``: Nombre de bits dans le contexte littéral.

source: ``lp``: Number of literal position bits. The sum ``lc + lp`` must be at most 4.
fr: ``lp``: Nombre de bits dans la position littérale. La somme ``lc + lp`` devra être au moins 4.

source: ``pb``: Number of position bits; must be at most 4.
fr: ``pb``: Nombre de bits à cette position ; au moins 4.

source: ``mode``: :const:`MODE_FAST` or :const:`MODE_NORMAL`.
fr: ``mode``: :const:`MODE_FAST` ou :const:`MODE_NORMAL`.

source: ``nice_len``: What should be considered a "nice length" for a match. This should be 273 or less.
fr: ``nice_len``: Ce qui devra être pris en compte comme "longueur appréciable" pour une recherche. Il devra être 273 ou moins.

source: ``mf``: What match finder to use -- :const:`MF_HC3`, :const:`MF_HC4`, :const:`MF_BT2`, :const:`MF_BT3`, or :const:`MF_BT4`.
fr: ``mf``: Quel type d'index de recherche à utiliser -- :const:`MF_HC3`, :const:`MF_HC4`, :const:`MF_BT2`, :const:`MF_BT3`, ou :const:`MF_BT4`.

source: ``depth``: Maximum search depth used by match finder. 0 (default) means to select automatically based on other filter options.
fr: ``depth``: Profondeur maximum de la recherche, utilisée par l'index de recherche. 0 (défaut) signifie une sélection automatique basée sur des options de filtres différents.

source: The delta filter stores the differences between bytes, producing more repetitive input for the compressor in certain circumstances. It supports one option, ``dist``. This indicates the distance between bytes to be subtracted. The default is 1, i.e. take the differences between adjacent bytes.
fr: Le filtre delta stocke les différences entre octets, induisant davantage d'entrées répétitives pour le compresseur, selon les circonstances. Il support une option, ``dist``. Ce paramètre définit la distance entre les octets à soustraire. Par défaut : 1, soit la différence entre des octets adjacents.
