Repository: python/python-docs-fr
Catalog: library/math.po
Languages: fr

source: Added support for n-dimensional points. Formerly, only the two dimensional case was supported.
fr: Ajout de la gestion des points à n-dimensions. Auparavant seuls les points bi-dimensionnels étaient gérés.

source: Return the sine of *x* radians.
fr: Renvoie le sinus de *x* radians.

source: Return the tangent of *x* radians.
fr: Renvoie la tangente de *x* radians.

source: Angular conversion
fr: Conversion angulaire

source: Convert angle *x* from radians to degrees.
fr: Convertit l'angle *x* de radians en degrés.

source: Convert angle *x* from degrees to radians.
fr: Convertit l'ange *x* de degrés en radians.

source: Hyperbolic functions
fr: Fonctions hyperboliques

source: `Hyperbolic functions <https://en.wikipedia.org/wiki/Hyperbolic_function>`_ are analogs of trigonometric functions that are based on hyperbolas instead of circles.
fr: `Les fonctions hyperboliques <https://fr.wikipedia.org/wiki/Fonction_hyperbolique>`_ sont analogues à des fonctions trigonométriques qui sont basées sur des hyperboles au lieu de cercles.

source: Return the inverse hyperbolic cosine of *x*.
fr: Renvoie l'arc cosinus hyperbolique de *x*.

source: Return the inverse hyperbolic sine of *x*.
fr: Renvoie l'arc sinus hyperbolique de *x*.

source: Return the inverse hyperbolic tangent of *x*.
fr: Renvoie l'arc tangente hyperbolique de *x*.

source: Return the hyperbolic cosine of *x*.
fr: Renvoie le cosinus hyperbolique de *x*.

source: Return the hyperbolic sine of *x*.
fr: Renvoie le sinus hyperbolique de *x*.

source: Return the hyperbolic tangent of *x*.
fr: Renvoie la tangente hyperbolique de *x*.

source: Special functions
fr: Fonctions spéciales

source: Return the `error function <https://en.wikipedia.org/wiki/Error_function>`_ at *x*.
fr: Renvoie la `fonction d'erreur <https://en.wikipedia.org/wiki/Error_function>`_ en *x*.

source: The :func:`erf` function can be used to compute traditional statistical functions such as the `cumulative standard normal distribution <https://en.wikipedia.org/wiki/Normal_distribution#Cumulative_distribution_function>`_::
fr: La fonction :func:`erf` peut être utilisée pour calculer des fonctions statistiques usuelles telles que la `répartition de la loi normale <https://fr.wikipedia.org/wiki/Loi_normale#D.C3.A9finition_par_la_fonction_de_r.C3.A9partition>`_ ::

source: Return the complementary error function at *x*. The `complementary error function <https://en.wikipedia.org/wiki/Error_function>`_ is defined as ``1.0 - erf(x)``. It is used for large values of *x* where a subtraction from one would cause a `loss of significance <https://en.wikipedia.org/wiki/Loss_of_significance>`_\.
fr: Renvoie la fonction d'erreur complémentaire en *x*. La `fonction d'erreur complémentaire <https://fr.wikipedia.org/wiki/Fonction_d'erreur>`_ est définie par ``1.0 - erf(x)``. Elle est utilisée pour les grandes valeurs de *x*, où la soustraction en partant de 1,0 entraînerait une `perte de précision <https://en.wikipedia.org/wiki/Loss_of_significance>`_\.

source: Return the `Gamma function <https://en.wikipedia.org/wiki/Gamma_function>`_ at *x*.
fr: Renvoie la `fonction Gamma <https://fr.wikipedia.org/wiki/Fonction_gamma>`_ en *x*.

source: Return the natural logarithm of the absolute value of the Gamma function at *x*.
fr: Renvoie le logarithme naturel de la valeur absolue de la fonction gamma en *x*.

source: Constants
fr: Constantes

source: The mathematical constant *π* = 3.141592..., to available precision.
fr: La constante mathématique *π* = 3.141592…, à la précision disponible.

source: The mathematical constant *e* = 2.718281..., to available precision.
fr: La constante mathématique *e* = 2.718281…, à la précision disponible.

source: The mathematical constant *τ* = 6.283185..., to available precision. Tau is a circle constant equal to 2\ *π*, the ratio of a circle's circumference to its radius. To learn more about Tau, check out Vi Hart's video `Pi is (still) Wrong <https://www.youtube.com/watch?v=jG7vhMMXagQ>`_, and start celebrating `Tau day <https://tauday.com/>`_ by eating twice as much pie!
fr: La constante mathématique *τ* = 6.283185…, à la précision disponible. Tau est une constante du cercle égale à 2 \*π*, le rapport de la circonférence d'un cercle à son rayon. Pour en apprendre plus sur Tau, regardez la vidéo de Vi Hart, `Pi is (still) Wrong <https://www.youtube.com/watch?v=jG7vhMMXagQ>`_, et profitez-en pour célébrer le `Jour de Tau <https://tauday.com/>`_ en bavardant comme deux pies !

source: A floating-point positive infinity. (For negative infinity, use ``-math.inf``.) Equivalent to the output of ``float('inf')``.
fr: Un flottant positif infini. (Pour un infini négatif, utilisez ``-math.inf``.) Équivalent au résultat de ``float('inf')``.

source: A floating-point "not a number" (NaN) value. Equivalent to the output of ``float('nan')``.
fr: Un flottant valant NaN. Équivalent au résultat de ``float('nan')``.

source: The :mod:`math` module consists mostly of thin wrappers around the platform C math library functions. Behavior in exceptional cases follows Annex F of the C99 standard where appropriate. The current implementation will raise :exc:`ValueError` for invalid operations like ``sqrt(-1.0)`` or ``log(0.0)`` (where C99 Annex F recommends signaling invalid operation or divide-by-zero), and :exc:`OverflowError` for results that overflow (for example, ``exp(1000.0)``). A NaN will not be returned from any of the functions above unless one or more of the input arguments was a NaN; in that case, most functions will return a NaN, but (again following C99 Annex F) there are some exceptions to this rule, for example ``pow(float('nan'), 0.0)`` or ``hypot(float('nan'), float('inf'))``.
fr: Le module :mod:`math` consiste majoritairement en un conteneur pour les fonctions mathématiques de la bibliothèque C de la plate-forme. Le comportement dans les cas spéciaux suit l'annexe 'F' du standard C99 quand c'est approprié. L'implémentation actuelle lève une :exc:`ValueError` pour les opérations invalides telles que ``sqrt(-1.0)`` ou ``log(0.0)`` (où le standard C99 recommande de signaler que l'opération est invalide ou qu'il y a division par zéro), et une :exc:`OverflowError` pour les résultats qui débordent (par exemple ``exp(1000.0)``). *NaN* ne sera renvoyé pour aucune des fonctions ci-dessus, sauf si au moins un des arguments de la fonction vaut *NaN*. Dans ce cas, la plupart des fonctions renvoient *NaN*, mais (à nouveau, selon l'annexe 'F' du standard C99) il y a quelques exceptions à cette règle, par exemple ``pow(float('nan'), 0.0)`` ou ``hypot(float('nan'), float('inf'))``.

source: Note that Python makes no effort to distinguish signaling NaNs from quiet NaNs, and behavior for signaling NaNs remains unspecified. Typical behavior is to treat all NaNs as though they were quiet.
fr: Notez que Python ne fait aucun effort pour distinguer les NaNs signalétiques des NaNs silencieux, et le comportement de signalement des NaNs reste non-spécifié. Le comportement standard est de traiter tous les NaNs comme s'ils étaient silencieux.

source: Complex number versions of many of these functions.
fr: Version complexe de beaucoup de ces fonctions.
