Repository: python/python-docs-fr
Catalog: library/modulefinder.po
Languages: fr

source: :mod:`modulefinder` --- Find modules used by a script
fr: :mod:`modulefinder` --- Identifie les modules utilisés par un script

source: **Source code:** :source:`Lib/modulefinder.py`
fr: **Code source :** :source:`Lib/modulefinder.py`

source: This module provides a :class:`ModuleFinder` class that can be used to determine the set of modules imported by a script. ``modulefinder.py`` can also be run as a script, giving the filename of a Python script as its argument, after which a report of the imported modules will be printed.
fr: Ce module fournit une classe :class:`ModuleFinder` qui peut être utilisée pour déterminer la liste des modules importés par un script. ``modulefinder.py`` peut aussi être utilisé en tant que script, en passant le nom du fichier Python en argument, ce qui affichera un rapport sur les modules importés.

source: Record that the package named *pkg_name* can be found in the specified *path*.
fr: Enregistre que le paquet *pkg_name* peut être trouvé au chemin *path* spécifié.

source: Allows specifying that the module named *oldname* is in fact the package named *newname*.
fr: Permet de spécifier que le module nommé *oldname* est en réalité le paquet nommé *newname*.

source: This class provides :meth:`run_script` and :meth:`report` methods to determine the set of modules imported by a script. *path* can be a list of directories to search for modules; if not specified, ``sys.path`` is used. *debug* sets the debugging level; higher values make the class print debugging messages about what it's doing. *excludes* is a list of module names to exclude from the analysis. *replace_paths* is a list of ``(oldpath, newpath)`` tuples that will be replaced in module paths.
fr: Cette classe fournit les méthodes :meth:`run_script` et :meth:`report` pour déterminer l'ensemble des modules importés par un script. *path* peut être une liste de dossiers dans lesquels chercher les modules ; si non spécifié, ``sys.path`` est utilisé. *debug* définit le niveau de débogage ; des valeurs plus élevées produisent plus de détails sur ce que fait la classe. *excludes* est une liste de noms de modules à exclure de l'analyse. *replace_paths* est une liste de tuples ``(oldpath, newpath)`` qui seront remplacés dans les chemins des modules.

source: Print a report to standard output that lists the modules imported by the script and their paths, as well as modules that are missing or seem to be missing.
fr: Affiche un rapport sur la sortie standard qui liste les modules importés par le script et leurs chemins, ainsi que les modules manquants - ou qui n'ont pas été trouvés.

source: Analyze the contents of the *pathname* file, which must contain Python code.
fr: Analyse le contenu du fichier *pathname*, qui doit contenir du code Python.

source: A dictionary mapping module names to modules. See :ref:`modulefinder-example`.
fr: Un dictionnaire de correspondance entre nom de modules et modules. Voir :ref:`modulefinder-example`.

source: Example usage of :class:`ModuleFinder`
fr: Exemples d'utilisation de la classe :class:`ModuleFinder`

source: The script that is going to get analyzed later on (bacon.py)::
fr: Le script qui sera analysé (bacon.py) : ::

source: The script that will output the report of bacon.py::
fr: Le script qui va afficher le rapport de bacon.py : ::

source: Sample output (may vary depending on the architecture)::
fr: Exemple de sortie (peut varier en fonction de l'architecture) : ::
