Repository: python/python-docs-fr
Catalog: library/multiprocessing.po
Languages: fr

source: With the *block* argument set to ``True`` (the default), the method call will block until the lock is in an unlocked state, then set it to locked and return ``True``. Note that the name of this first argument differs from that in :meth:`threading.Lock.acquire`.
fr: Avec l'argument *block* à ``True`` (par défaut), l'appel de méthode bloquera jusqu'à ce que le verrou soit dans déverrouillé, puis le verrouillera avant de renvoyer ``True``. Notez que le nom de ce premier argument diffère de celui de :meth:`threading.Lock.acquire`.

source: With the *block* argument set to ``False``, the method call does not block. If the lock is currently in a locked state, return ``False``; otherwise set the lock to a locked state and return ``True``.
fr: Avec l'argument *block* à ``False``, l'appel de méthode ne bloque pas. Si le verrou est actuellement verrouillé, renvoie ``False`` ; autrement verrouille le verrou et renvoie ``True``.

source: When invoked with a positive, floating-point value for *timeout*, block for at most the number of seconds specified by *timeout* as long as the lock can not be acquired. Invocations with a negative value for *timeout* are equivalent to a *timeout* of zero. Invocations with a *timeout* value of ``None`` (the default) set the timeout period to infinite. Note that the treatment of negative or ``None`` values for *timeout* differs from the implemented behavior in :meth:`threading.Lock.acquire`. The *timeout* argument has no practical implications if the *block* argument is set to ``False`` and is thus ignored. Returns ``True`` if the lock has been acquired or ``False`` if the timeout period has elapsed.
fr: Quand invoqué avec un nombre flottant positif comme *timeout*, bloque au maximum pendant ce nombre spécifié de secondes, tant que le verrou ne peut être acquis. Les invocations avec une valeur de *timeout* négatives sont équivalents à zéro. Les invocations avec un *timeout* à ``None`` (par défaut) correspondent à un délai d'attente infini. Notez que le traitement des valeurs de *timeout* négatives et ``None`` diffère du comportement implémenté dans :meth:`threading.Lock.acquire`. L'argument *timeout* n'a pas d'implication pratique si l'argument *block* est mis ) ``False`` et est alors ignoré. Renvoie ``True`` si le verrou a été acquis et ``False`` si le temps de *timeout* a expiré.

source: Release a lock. This can be called from any process or thread, not only the process or thread which originally acquired the lock.
fr: Libère un verrou. Elle peut être appelée depuis n'importe quel processus ou fil d'exécution, pas uniquement le processus ou le fil qui a acquis le verrou à l'origine.

source: Behavior is the same as in :meth:`threading.Lock.release` except that when invoked on an unlocked lock, a :exc:`ValueError` is raised.
fr: Le comportement est le même que :meth:`threading.Lock.release` excepté que lorsque la méthode est appelée sur un verrou déverrouillé, une :exc:`ValueError` est levée.

source: A recursive lock object: a close analog of :class:`threading.RLock`. A recursive lock must be released by the process or thread that acquired it. Once a process or thread has acquired a recursive lock, the same process or thread may acquire it again without blocking; that process or thread must release it once for each time it has been acquired.
fr: Un objet verrou récursif : un analogue proche de :class:`threading.RLock`. Un verrou récursif doit être libéré par le processus ou le fil d'exécution qui l'a acquis. Quand un processus ou un fil acquiert un verrou récursif, le même processus/fil peut l'acquérir à nouveau sans bloquer ; le processus/fil doit le libérer autant de fois qu'il l'acquiert.

source: Note that :class:`RLock` is actually a factory function which returns an instance of ``multiprocessing.synchronize.RLock`` initialized with a default context.
fr: Notez que :class:`RLock` est en fait une fonction *factory* qui renvoie une instance de ``multiprocessing.synchronize.RLock`` initialisée avec un contexte par défaut.

source: :class:`RLock` supports the :term:`context manager` protocol and thus may be used in :keyword:`with` statements.
fr: :class:`RLock` supporte le protocole :term:`context manager` et peut ainsi être utilisée avec une instruction :keyword:`with`.

source: When invoked with the *block* argument set to ``True``, block until the lock is in an unlocked state (not owned by any process or thread) unless the lock is already owned by the current process or thread. The current process or thread then takes ownership of the lock (if it does not already have ownership) and the recursion level inside the lock increments by one, resulting in a return value of ``True``. Note that there are several differences in this first argument's behavior compared to the implementation of :meth:`threading.RLock.acquire`, starting with the name of the argument itself.
fr: Quand invoqué avec l'argument *block* à ``True``, bloque jusqu'à ce que le verrou soit déverrouillé (n'appartenant à aucun processus ou fil d'exécution) sauf s'il appartient déjà au processus ou fil d'exécution courant. Le processus ou fil d'exécution courant prend la possession du verrou (s'il ne l'a pas déjà) et incrémente d'un le niveau de récursion du verrou, renvoyant ainsi ``True``. Notez qu'il y a plusieurs différences dans le comportement de ce premier argument comparé à l'implémentation de :meth:`threading.RLock.acquire`, à commencer par le nom de l'argument lui-même.

source: When invoked with the *block* argument set to ``False``, do not block. If the lock has already been acquired (and thus is owned) by another process or thread, the current process or thread does not take ownership and the recursion level within the lock is not changed, resulting in a return value of ``False``. If the lock is in an unlocked state, the current process or thread takes ownership and the recursion level is incremented, resulting in a return value of ``True``.
fr: Quand invoqué avec l'argument *block* à ``False``, ne bloque pas. Si le verrou est déjà acquis (et possédé) par un autre processus ou fil d'exécution, le processus/fil courant n'en prend pas la possession et le niveau de récursion n'est pas incrémenté, résultant en une valeur de retour à ``False``. Si le verrou est déverrouillé, le processus/fil courant en prend possession et incrémente son niveau de récursion, renvoyant ``True``.

source: Use and behaviors of the *timeout* argument are the same as in :meth:`Lock.acquire`. Note that some of these behaviors of *timeout* differ from the implemented behaviors in :meth:`threading.RLock.acquire`.
fr: L'usage et les comportements de l'argument *timeout* sont les mêmes que pour :meth:`Lock.acquire`. Notez que certains de ces comportements diffèrent par rapport à ceux implémentés par :meth:`threading.RLock.acquire`.

source: Release a lock, decrementing the recursion level. If after the decrement the recursion level is zero, reset the lock to unlocked (not owned by any process or thread) and if any other processes or threads are blocked waiting for the lock to become unlocked, allow exactly one of them to proceed. If after the decrement the recursion level is still nonzero, the lock remains locked and owned by the calling process or thread.
fr: Libère un verrou, décrémentant son niveau de récursion. Si après la décrémentation le niveau de récursion est zéro, réinitialise le verrou à un état déverrouillé (n'appartenant à aucun processus ou fil d'exécution) et si des processus/fils attendent que le verrou se déverrouillé, autorise un seul d'entre-eux à continuer. Si après cette décrémentation le niveau de récursion est toujours strictement positif, le verrou reste verrouillé et propriété du processus/fil appelant.

source: Only call this method when the calling process or thread owns the lock. An :exc:`AssertionError` is raised if this method is called by a process or thread other than the owner or if the lock is in an unlocked (unowned) state. Note that the type of exception raised in this situation differs from the implemented behavior in :meth:`threading.RLock.release`.
fr: N'appelez cette méthode que si le processus ou fil d'exécution appelant est propriétaire du verrou. Une :exc:`AssertionError` est levée si cette méthode est appelée par un processus/fil autre que le propriétaire ou si le verrou n'est pas verrouillé (possédé). Notez que le type d'exception levé dans cette situation diffère du comportement de :meth:`threading.RLock.release`.

source: A semaphore object: a close analog of :class:`threading.Semaphore`.
fr: Un objet sémaphore, proche analogue de :class:`threading.Semaphore`.

source: On Mac OS X, ``sem_timedwait`` is unsupported, so calling ``acquire()`` with a timeout will emulate that function's behavior using a sleeping loop.
fr: Sous Mac OS X, ``sem_timedwait`` n'est pas supporté, donc appeler ``acquire()`` avec un temps d'exécution limité émulera le comportement de cette fonction en utilisant une boucle d'attente.

source: If the SIGINT signal generated by :kbd:`Ctrl-C` arrives while the main thread is blocked by a call to :meth:`BoundedSemaphore.acquire`, :meth:`Lock.acquire`, :meth:`RLock.acquire`, :meth:`Semaphore.acquire`, :meth:`Condition.acquire` or :meth:`Condition.wait` then the call will be immediately interrupted and :exc:`KeyboardInterrupt` will be raised.
fr: Si le signal *SIGINT* généré par un :kbd:`Ctrl-C` survient pendant que le fil d'exécution principal est bloqué par un appel à :meth:`BoundedSemaphore.acquire`, :meth:`Lock.acquire`, :meth:`RLock.acquire`, :meth:`Semaphore.acquire`, :meth:`Condition.acquire` ou :meth:`Condition.wait`, l'appel sera immédiatement interrompu et une :exc:`KeyboardInterrupt` sera levée.

source: This differs from the behaviour of :mod:`threading` where SIGINT will be ignored while the equivalent blocking calls are in progress.
fr: Cela diffère du comportement de :mod:`threading` où le *SIGINT* est ignoré tant que les appels bloquants sont en cours.

source: Some of this package's functionality requires a functioning shared semaphore implementation on the host operating system. Without one, the :mod:`multiprocessing.synchronize` module will be disabled, and attempts to import it will result in an :exc:`ImportError`. See :issue:`3770` for additional information.
fr: Certaines des fonctionnalités de ce paquet requièrent une implémentation fonctionnelle de sémaphores partagés sur le système hôte. Sans cela, le module :mod:`multiprocessing.synchronize` sera désactivé, et les tentatives de l'importer lèveront une :exc:`ImportError`. Voir :issue:`3770` pour plus d'informations.

source: Shared :mod:`ctypes` Objects
fr: Objets :mod:`ctypes` partagés

source: It is possible to create shared objects using shared memory which can be inherited by child processes.
fr: Il est possible de créer des objets partagés utilisant une mémoire partagée pouvant être héritée par les processus enfants.

source: Return a :mod:`ctypes` object allocated from shared memory. By default the return value is actually a synchronized wrapper for the object. The object itself can be accessed via the *value* attribute of a :class:`Value`.
fr: Renvoie un objet :mod:`ctypes` alloué depuis la mémoire partagée. Par défaut la valeur de retour est en fait un *wrapper* synchronisé autour de l'objet. L'objet en lui-même est accessible par l'attribut *value* de l'une :class:`Value`.

source: *typecode_or_type* determines the type of the returned object: it is either a ctypes type or a one character typecode of the kind used by the :mod:`array` module. *\*args* is passed on to the constructor for the type.
fr: *typecode_or_type* détermine le type de l'objet renvoyé : il s'agit soit d'un type *ctype* soit d'un caractère *typecode* tel qu'utilisé par le module :mod:`array`. *\*args* est passé au constructeur de ce type.

source: If *lock* is ``True`` (the default) then a new recursive lock object is created to synchronize access to the value. If *lock* is a :class:`Lock` or :class:`RLock` object then that will be used to synchronize access to the value. If *lock* is ``False`` then access to the returned object will not be automatically protected by a lock, so it will not necessarily be "process-safe".
fr: Si *lock* vaut ``True`` (par défaut), alors un nouveau verrou récursif est créé pour synchroniser l'accès à la valeur. Si *lock* est un objet :class:`Lock` ou :class:`RLock` alors il sera utilisé pour synchroniser l'accès à la valeur. Si *lock* vaut ``False``, l'accès à l'objet renvoyé ne sera pas automatiquement protégé par un verrou, donc il ne sera pas forcément « *process-safe* ».

source: Operations like ``+=`` which involve a read and write are not atomic. So if, for instance, you want to atomically increment a shared value it is insufficient to just do ::
fr: Les opérations telles que ``+=`` qui impliquent une lecture et une écriture ne sont pas atomique. Ainsi si vous souhaitez par exemple réaliser une incrémentation atomique sur une valeur partagée, vous ne pouvez pas simplement faire ::

source: Assuming the associated lock is recursive (which it is by default) you can instead do ::
fr: En supposant que le verrou associé est récursif (ce qui est le cas par défaut), vous pouvez à la place faire ::

source: Note that *lock* is a keyword-only argument.
fr: Notez que *lock* est un argument *keyword-only*.

source: Return a ctypes array allocated from shared memory. By default the return value is actually a synchronized wrapper for the array.
fr: Renvoie un tableau *ctypes* alloué depuis la mémoire partagée. Par défaut la valeur de retour est en fait un *wrapper* synchronisé autour du tableau.

source: *typecode_or_type* determines the type of the elements of the returned array: it is either a ctypes type or a one character typecode of the kind used by the :mod:`array` module. If *size_or_initializer* is an integer, then it determines the length of the array, and the array will be initially zeroed. Otherwise, *size_or_initializer* is a sequence which is used to initialize the array and whose length determines the length of the array.
fr: *typecode_or_type* détermine le type des éléments du tableau renvoyé : il s'agit soit d'un type *ctype* soit d'un caractère *typecode* tel qu'utilisé par le module :mod:`array`. Si *size_or_initialize* est un entier, alors il détermine la taille du tableau, et le tableau sera initialisé avec des zéros. Autrement, *size*or_initializer* est une séquence qui sera utilisée pour initialiser le tableau et dont la taille détermine celle du tableau.

source: If *lock* is ``True`` (the default) then a new lock object is created to synchronize access to the value. If *lock* is a :class:`Lock` or :class:`RLock` object then that will be used to synchronize access to the value. If *lock* is ``False`` then access to the returned object will not be automatically protected by a lock, so it will not necessarily be "process-safe".
fr: Si *lock* vaut ``True`` (par défaut), alors un nouveau verrou est créé pour synchroniser l'accès à la valeur. Si *lock* est un objet :class:`Lock` ou :class:`RLock` alors il sera utilisé pour synchroniser l'accès à la valeur. Si *lock* vaut ``False``, l'accès à l'objet renvoyé ne sera pas automatiquement protégé par un verrou, donc il ne sera pas forcément « *process-safe* ».

source: Note that *lock* is a keyword only argument.
fr: Notez que *lock* est un argument *keyword-only*.

source: Note that an array of :data:`ctypes.c_char` has *value* and *raw* attributes which allow one to use it to store and retrieve strings.
fr: Notez qu'un tableau de :data:`ctypes.c_char` a ses attributs *value* et *raw* qui permettent de l'utiliser pour stocker et récupérer des chaînes de caractères.

source: The :mod:`multiprocessing.sharedctypes` module
fr: Le module :mod:`multiprocessing.sharedctypes`

source: The :mod:`multiprocessing.sharedctypes` module provides functions for allocating :mod:`ctypes` objects from shared memory which can be inherited by child processes.
fr: Le module :mod:`multiprocessing.sharedctypes` fournit des fonctions pour allouer des objets :mod:`ctypes` depuis la mémoire partagée, qui peuvent être hérités par les processus fils.

source: Although it is possible to store a pointer in shared memory remember that this will refer to a location in the address space of a specific process. However, the pointer is quite likely to be invalid in the context of a second process and trying to dereference the pointer from the second process may cause a crash.
fr: Bien qu'il soit possible de stocker un pointeur en mémoire partagée, rappelez-vous qu'un pointer référence un emplacement dans l'espace d'adressage d'un processus particulier. Ainsi, ce pointeur a de fortes chances d'être invalide dans le contexte d'un autre processus et déréférencer le pointeur depuis ce second processus peut causer un plantage.

source: Return a ctypes array allocated from shared memory.
fr: Renvoie un tableau *ctypes* alloué depuis la mémoire partagée.

source: *typecode_or_type* determines the type of the elements of the returned array: it is either a ctypes type or a one character typecode of the kind used by the :mod:`array` module. If *size_or_initializer* is an integer then it determines the length of the array, and the array will be initially zeroed. Otherwise *size_or_initializer* is a sequence which is used to initialize the array and whose length determines the length of the array.
fr: *typecode_or_type* détermine le type des éléments du tableau renvoyé : il s'agit soit d'un type *ctype* soit d'un caractère codant le type des éléments du tableau (*typecode*) tel qu'utilisé par le module :mod:`array`. Si *size_or_initialize* est un entier, alors il détermine la taille du tableau, et le tableau sera initialisé avec des zéros. Autrement, *size_or_initializer* est une séquence qui sera utilisée pour initialiser le tableau et dont la taille détermine celle du tableau.

source: Note that setting and getting an element is potentially non-atomic -- use :func:`Array` instead to make sure that access is automatically synchronized using a lock.
fr: Notez que définir ou récupérer un élément est potentiellement non atomique -- utilisez plutôt :func:`Array` pour vous assurer de synchroniser automatiquement avec un verrou.

source: Return a ctypes object allocated from shared memory.
fr: Renvoie un objet *ctypes* alloué depuis la mémoire partagée.

source: Note that setting and getting the value is potentially non-atomic -- use :func:`Value` instead to make sure that access is automatically synchronized using a lock.
fr: Notez que définir ou récupérer un élément est potentiellement non atomique -- utilisez plutôt :func:`Value` pour vous assurer de synchroniser automatiquement avec un verrou.

source: Note that an array of :data:`ctypes.c_char` has ``value`` and ``raw`` attributes which allow one to use it to store and retrieve strings -- see documentation for :mod:`ctypes`.
fr: Notez qu'un tableau de :data:`ctypes.c_char` a ses attributs *value* et *raw* qui permettent de l'utiliser pour stocker et récupérer des chaînes de caractères -- voir la documentation de :mod:`ctypes`.

source: The same as :func:`RawArray` except that depending on the value of *lock* a process-safe synchronization wrapper may be returned instead of a raw ctypes array.
fr: Identique à :func:`RawArray` à l'exception que suivant la valeur de *lock* un *wrapper* de synchronisation *process-safe* pourra être renvoyé à la place d'un tableau *ctypes* brut.

source: If *lock* is ``True`` (the default) then a new lock object is created to synchronize access to the value. If *lock* is a :class:`~multiprocessing.Lock` or :class:`~multiprocessing.RLock` object then that will be used to synchronize access to the value. If *lock* is ``False`` then access to the returned object will not be automatically protected by a lock, so it will not necessarily be "process-safe".
fr: Si *lock* vaut ``True`` (par défaut), alors un nouveau verrou est créé pour synchroniser l'accès à la valeur. Si *lock* est un objet :class:`~multiprocessing.Lock` ou :class:`~multiprocessing.RLock` alors il sera utilisé pour synchroniser l'accès à la valeur. Si *lock* vaut ``False``, l'accès à l'objet renvoyé ne sera pas automatiquement protégé par un verrou, donc il ne sera pas forcément « *process-safe* ».

source: The same as :func:`RawValue` except that depending on the value of *lock* a process-safe synchronization wrapper may be returned instead of a raw ctypes object.
fr: Identique à :func:`RawValue` à l'exception que suivant la valeur de *lock* un *wrapper* de synchronisation *process-safe* pourra être renvoyé à la place d'un objet *ctypes* brut.

source: Return a ctypes object allocated from shared memory which is a copy of the ctypes object *obj*.
fr: Renvoie un objet *ctypes* alloué depuis la mémoire partagée, qui est une copie de l'objet *ctypes* *obj*.

source: Return a process-safe wrapper object for a ctypes object which uses *lock* to synchronize access. If *lock* is ``None`` (the default) then a :class:`multiprocessing.RLock` object is created automatically.
fr: Renvoie un *wrapper* *process-safe* autour de l'objet *ctypes* qui utilise *lock* pour synchroniser l'accès. Si *lock* est ``None`` (par défaut), un objet :class:`multiprocessing.RLock` est créé automatiquement.

source: A synchronized wrapper will have two methods in addition to those of the object it wraps: :meth:`get_obj` returns the wrapped object and :meth:`get_lock` returns the lock object used for synchronization.
fr: Un *wrapper* synchronisé aura deux méthodes en plus de celles de l'objet qu'il enveloppe : :meth:`get_obj` renvoie l'objet *wrappé* et :meth:`get_lock` renvoie le verrou utilisé pour la synchronisation.

source: Note that accessing the ctypes object through the wrapper can be a lot slower than accessing the raw ctypes object.
fr: Notez qu'accéder à l'objet *ctypes* à travers le *wrapper* peut s'avérer beaucoup plus lent qu'accéder directement à l'objet *ctypes* brut.

source: Synchronized objects support the :term:`context manager` protocol.
fr: Les objets synchronisés supportent le protocole :term:`context manager`.

source: The table below compares the syntax for creating shared ctypes objects from shared memory with the normal ctypes syntax. (In the table ``MyStruct`` is some subclass of :class:`ctypes.Structure`.)
fr: Le tableau ci-dessous compare la syntaxe de création des objets *ctypes* partagés depuis une mémoire partagée avec la syntaxe normale *ctypes*. (Dans le tableau, ``MyStruct`` est une sous-classe quelconque de :class:`ctypes.Structure`.)

source: sharedctypes using type
fr: *sharedctypes* utilisant un type

source: sharedctypes using typecode
fr: *sharedctypes* utilisant un *typecode*

source: Below is an example where a number of ctypes objects are modified by a child process::
fr: Ci-dessous un exemple où des objets *ctypes* sont modifiés par un processus fils ::

source: The results printed are ::
fr: Les résultats affichés sont ::

source: Managers
fr: Gestionnaires

source: Managers provide a way to create data which can be shared between different processes, including sharing over a network between processes running on different machines. A manager object controls a server process which manages *shared objects*. Other processes can access the shared objects by using proxies.
fr: Les gestionnaires fournissent un moyen de créer des données qui peuvent être partagées entre les différents processus, incluant le partage à travers le réseau entre des processus tournant sur des machines différentes. Un objet gestionnaire contrôle un processus serveur qui gère les *shared objects*. Les autres processus peuvent accéder aux objets partagés à l'aide de mandataires.
