Repository: python/python-docs-fr
Catalog: library/multiprocessing.po
Languages: fr

source: :mod:`multiprocessing` --- Process-based parallelism
fr: :mod:`multiprocessing` — Parallélisme par processus

source: **Source code:** :source:`Lib/multiprocessing/`
fr: **Code source :** :source:`Lib/multiprocessing/`

source: :mod:`multiprocessing` is a package that supports spawning processes using an API similar to the :mod:`threading` module. The :mod:`multiprocessing` package offers both local and remote concurrency, effectively side-stepping the :term:`Global Interpreter Lock` by using subprocesses instead of threads. Due to this, the :mod:`multiprocessing` module allows the programmer to fully leverage multiple processors on a given machine. It runs on both Unix and Windows.
fr: :mod:`multiprocessing` est un paquet qui permet l'instanciation de processus via la même API que le module :mod:`threading`. Le paquet :mod:`multiprocessing` offre à la fois des possibilités de programmation concurrente locale ou à distance, contournant les problèmes du :term:`Global Interpreter Lock` en utilisant des processus plutôt que des fils d'exécution. Ainsi, le module :mod:`multiprocessing` permet au développeur de bénéficier entièrement des multiples processeurs sur une machine. Il tourne à la fois sur les systèmes Unix et Windows.

source: The :mod:`multiprocessing` module also introduces APIs which do not have analogs in the :mod:`threading` module. A prime example of this is the :class:`~multiprocessing.pool.Pool` object which offers a convenient means of parallelizing the execution of a function across multiple input values, distributing the input data across processes (data parallelism). The following example demonstrates the common practice of defining such functions in a module so that child processes can successfully import that module. This basic example of data parallelism using :class:`~multiprocessing.pool.Pool`, ::
fr: Le module :mod:`multiprocessing` introduit aussi des API sans analogues dans le module :mod:`threading`. Un exemple est l'objet :class:`~multiprocessing.pool.Pool` qui offre une manière pratique de paralléliser l'exécution d'une fonction sur de multiples valeurs d'entrée, distribuant ces valeurs entre les processus (parallélisme de données). L'exemple suivant présente la manière classique de définir une telle fonction dans un module afin que les processus fils puissent importer ce module avec succès. L'exemple basique de parallélisme de données utilise :class:`~multiprocessing.pool.Pool`, ::

source: will print to standard output ::
fr: affiche sur la sortie standard ::

source: The :class:`Process` class
fr: La classe :class:`Process`

source: In :mod:`multiprocessing`, processes are spawned by creating a :class:`Process` object and then calling its :meth:`~Process.start` method. :class:`Process` follows the API of :class:`threading.Thread`. A trivial example of a multiprocess program is ::
fr: Dans le module :mod:`multiprocessing`, les processus sont instanciés en créant un objet :class:`Process` et en appelant sa méthode :meth:`~Process.start`. La classe :class:`Process` suit la même API que :class:`threading.Thread`. Un exemple trivial d'un programme multi-processus est ::

source: To show the individual process IDs involved, here is an expanded example::
fr: Pour afficher les IDs des processus impliqués, voici un exemple plus étoffé ::

source: For an explanation of why the ``if __name__ == '__main__'`` part is necessary, see :ref:`multiprocessing-programming`.
fr: La nécessité de la ligne ``if __name__ == '__main__'`` est expliquée par :ref:`multiprocessing-programming`.

source: Contexts and start methods
fr: Contextes et méthodes de démarrage

source: Depending on the platform, :mod:`multiprocessing` supports three ways to start a process. These *start methods* are
fr: Suivant la plateforme, :mod:`multiprocessing` gère trois manières de démarrer un processus. Ces *méthodes de démarrage* sont

source: The parent process starts a fresh python interpreter process. The child process will only inherit those resources necessary to run the process objects :meth:`~Process.run` method. In particular, unnecessary file descriptors and handles from the parent process will not be inherited. Starting a process using this method is rather slow compared to using *fork* or *forkserver*.
fr: Le processus parent démarre un processus neuf avec un interpréteur Python. Le processus fils hérite uniquement des ressources nécessaires pour exécuter la méthode :meth:`~Process.run` de l'objet associé au processus. En particulier, les descripteurs de fichiers superflus et gérés par le processus parent ne sont pas hérités. Démarrer un processus en utilisant cette méthode est plutôt lent par rapport à *fork* ou *forkserver*.

source: Available on Unix and Windows. The default on Windows and macOS.
fr: Disponible sur Unix et Windows. Par défaut sur Windows et macOS.

source: The parent process uses :func:`os.fork` to fork the Python interpreter. The child process, when it begins, is effectively identical to the parent process. All resources of the parent are inherited by the child process. Note that safely forking a multithreaded process is problematic.
fr: Le processus parent utilise :func:`os.fork` pour *forker* l'interpréteur Python. Le processus fils, quand il démarre, est effectivement identique au processus parent. Toutes les ressources du parent sont héritées par le fils. Notez qu'il est problématique de *forker* sans danger un processus *multi-threadé*.

source: Available on Unix only. The default on Unix.
fr: Disponible uniquement sous Unix. Par défaut sous Unix.

source: When the program starts and selects the *forkserver* start method, a server process is started. From then on, whenever a new process is needed, the parent process connects to the server and requests that it fork a new process. The fork server process is single threaded so it is safe for it to use :func:`os.fork`. No unnecessary resources are inherited.
fr: Quand le programme démarre et choisit la méthode de démarrage *forkserver*, un processus serveur est lancé. Dès lors, chaque fois qu'un nouveau processus est nécessaire, le processus parent se connecte au serveur et lui demande de *forker* un nouveau processus. Le processus serveur de *fork* n'utilisant qu'un seul fil d'exécution, il peut utiliser :func:`os.fork` sans danger. Les ressources superflues ne sont pas héritées.

source: Available on Unix platforms which support passing file descriptors over Unix pipes.
fr: Disponible sur les plateformes Unix qui acceptent le passage de descripteurs de fichiers à travers des tubes (*pipes*) Unix.

source: *spawn* added on all unix platforms, and *forkserver* added for some unix platforms. Child processes no longer inherit all of the parents inheritable handles on Windows.
fr: *spawn* ajouté à toutes les plateformes Unix, et *forkserver* ajouté à certaines plateformes Unix. Les processus fils n'héritent plus de tous les descripteurs héritables du parent sous Windows.

source: On Unix using the *spawn* or *forkserver* start methods will also start a *resource tracker* process which tracks the unlinked named system resources (such as named semaphores or :class:`~multiprocessing.shared_memory.SharedMemory` objects) created by processes of the program. When all processes have exited the resource tracker unlinks any remaining tracked object. Usually there should be none, but if a process was killed by a signal there may be some "leaked" resources. (Neither leaked semaphores nor shared memory segments will be automatically unlinked until the next reboot. This is problematic for both objects because the system allows only a limited number of named semaphores, and shared memory segments occupy some space in the main memory.)
fr: Sous Unix, utiliser les méthodes de démarrage *spawn* ou *forkserver* démarre aussi un processus de *suivi de ressources* qui détecte les ressources systèmes non-libérées (comme des sémaphores nommés ou des objets :class:`~multiprocessing.shared_memory.SharedMemory`) créés par les processus du programme. Quand tous les processus sont terminés, le traqueur de ressources libère tous les objets restants. Normalement, il ne devrait pas y en avoir, mais si un processus a été tué par un signal, certaines ressources peuvent avoir été « perdues ». Ni les sémaphores ni les blocs de mémoire partagée ne sont libérés avant le prochain redémarrage. C'est problématique dans les deux cas car le système n'autorise qu'un nombre limité de sémaphores et parce que les blocs de mémoire partagée prennent de la place dans la mémoire principale.

source: To select a start method you use the :func:`set_start_method` in the ``if __name__ == '__main__'`` clause of the main module. For example::
fr: Pour sélectionner une méthode de démarrage, utilisez la fonction :func:`set_start_method` dans la clause ``if __name__ == '__main__'`` du module principal. Par exemple ::

source: :func:`set_start_method` should not be used more than once in the program.
fr: :func:`set_start_method` ne doit pas être utilisée plus d'une fois dans le programme.

source: Alternatively, you can use :func:`get_context` to obtain a context object. Context objects have the same API as the multiprocessing module, and allow one to use multiple start methods in the same program. ::
fr: Alternativement, vous pouvez utiliser :func:`get_context` pour obtenir un contexte. Les contextes ont la même API que le module *multiprocessing*, et permettent l'utilisation de plusieurs méthodes de démarrage dans un même programme. ::

source: Note that objects related to one context may not be compatible with processes for a different context. In particular, locks created using the *fork* context cannot be passed to processes started using the *spawn* or *forkserver* start methods.
fr: Notez que les objets relatifs à un contexte ne sont pas forcément compatibles avec les processus d'un contexte différent. En particulier, les verrous créés avec le contexte *fork* ne peuvent pas être passés aux processus lancés avec les méthodes *spawn* ou *forkserver*.

source: A library which wants to use a particular start method should probably use :func:`get_context` to avoid interfering with the choice of the library user.
fr: Une bibliothèque qui veut utiliser une méthode de démarrage particulière devrait probablement faire appel à :func:`get_context` pour éviter d'interférer avec le choix de l'utilisateur de la bibliothèque.

source: The ``'spawn'`` and ``'forkserver'`` start methods cannot currently be used with "frozen" executables (i.e., binaries produced by packages like **PyInstaller** and **cx_Freeze**) on Unix. The ``'fork'`` start method does work.
fr: Les méthodes de démarrage ``’spawn’`` et ``’forkserver’`` ne peuvent pas être utilisées avec des exécutables "congelés" (c'est-à-dire des binaires produits par des paquets comme **PyInstaller** et **cx_Freeze**) sur Unix. La méthode de démarrage ``’fork’`` fonctionne.

source: Exchanging objects between processes
fr: Échange d'objets entre les processus

source: :mod:`multiprocessing` supports two types of communication channel between processes:
fr: :mod:`multiprocessing` gère deux types de canaux de communication entre les processus :

source: The :class:`Queue` class is a near clone of :class:`queue.Queue`. For example::
fr: La classe :class:`Queue` est un clone assez proche de :class:`queue.Queue`. Par exemple ::

source: Queues are thread and process safe.
fr: Les queues peuvent être utilisées par plusieurs fils d'exécution ou processus.

source: **Pipes**
fr: **Tubes** (*pipes*)

source: The :func:`Pipe` function returns a pair of connection objects connected by a pipe which by default is duplex (two-way). For example::
fr: La fonction :func:`Pipe` renvoie une paire d'objets de connexion connectés à un tube qui est par défaut à double-sens. Par exemple ::

source: The two connection objects returned by :func:`Pipe` represent the two ends of the pipe. Each connection object has :meth:`~Connection.send` and :meth:`~Connection.recv` methods (among others). Note that data in a pipe may become corrupted if two processes (or threads) try to read from or write to the *same* end of the pipe at the same time. Of course there is no risk of corruption from processes using different ends of the pipe at the same time.
fr: Les deux objets de connexion renvoyés par :func:`Pipe` représentent les deux bouts d'un tube. Chaque objet de connexion possède (entre autres) des méthodes :meth:`~Connection.send` et :meth:`~Connection.recv`. Notez que les données d'un tube peuvent être corrompues si deux processus (ou fils d'exécution) essaient de lire ou d'écrire sur le même bout du tube en même temps. Évidemment il n'y a pas de risque de corruption si les processus utilisent deux bouts différents en même temps.

source: Synchronization between processes
fr: Synchronisation entre processus

source: :mod:`multiprocessing` contains equivalents of all the synchronization primitives from :mod:`threading`. For instance one can use a lock to ensure that only one process prints to standard output at a time::
fr: :mod:`multiprocessing` contient des équivalents à toutes les primitives de synchronisation de :mod:`threading`. Par exemple il est possible d'utiliser un verrou pour s'assurer qu'un seul processus à la fois écrit sur la sortie standard ::

source: Without using the lock output from the different processes is liable to get all mixed up.
fr: Sans le verrou, les sorties des différents processus risquent d'être mélangées.

source: Sharing state between processes
fr: Partager un état entre les processus

source: As mentioned above, when doing concurrent programming it is usually best to avoid using shared state as far as possible. This is particularly true when using multiple processes.
fr: Comme mentionné plus haut, il est généralement préférable d'éviter autant que possible d'utiliser des états partagés en programmation concurrente. C'est particulièrement vrai quand plusieurs processus sont utilisés.

source: However, if you really do need to use some shared data then :mod:`multiprocessing` provides a couple of ways of doing so.
fr: Cependant, si vous devez réellement partager des données, :mod:`multiprocessing` permet de le faire de deux manières.

source: **Shared memory**
fr: **Mémoire partagée**

source: Data can be stored in a shared memory map using :class:`Value` or :class:`Array`. For example, the following code ::
fr: Les données peuvent être stockées dans une mémoire partagée en utilisant des :class:`Value` ou des :class:`Array`. Par exemple, le code suivant ::

source: will print ::
fr: affiche ::

source: The ``'d'`` and ``'i'`` arguments used when creating ``num`` and ``arr`` are typecodes of the kind used by the :mod:`array` module: ``'d'`` indicates a double precision float and ``'i'`` indicates a signed integer. These shared objects will be process and thread-safe.
fr: Les arguments ``'d'`` et ``'i'`` utilisés à la création des ``num`` et `arr`` sont des codes de types tels qu'utilisés par le module :mod:`array` : ``'d'`` indique un flottant double-précision et ``'i'`` indique un entier signé. Ces objets partagés seront sûr d'utilisation entre processus et fils d'exécution.

source: For more flexibility in using shared memory one can use the :mod:`multiprocessing.sharedctypes` module which supports the creation of arbitrary ctypes objects allocated from shared memory.
fr: Pour plus de flexibilité dans l'utilisation de mémoire partagée, vous pouvez utiliser le module :mod:`multiprocessing.sharedctypes` qui permet la création d'objets arbitraires *ctypes* alloués depuis la mémoire partagée.

source: **Server process**
fr: **Processus serveur**

source: A manager object returned by :func:`Manager` controls a server process which holds Python objects and allows other processes to manipulate them using proxies.
fr: Un objet gestionnaire renvoyé par :func:`Manager` contrôle un processus serveur qui détient les objets Python et autorise les autres processus à les manipuler à l'aide de mandataires.

source: A manager returned by :func:`Manager` will support types :class:`list`, :class:`dict`, :class:`~managers.Namespace`, :class:`Lock`, :class:`RLock`, :class:`Semaphore`, :class:`BoundedSemaphore`, :class:`Condition`, :class:`Event`, :class:`Barrier`, :class:`Queue`, :class:`Value` and :class:`Array`. For example, ::
fr: Un gestionnaire renvoyé par :func:`Manager` supportera les types :class:`list`, :class:`dict`, :class:`~managers.Namespace`, :class:`Lock`, :class:`RLock`, :class:`Semaphore`, :class:`BoundedSemaphore`, :class:`Condition`, :class:`Event`, :class:`Barrier`, :class:`Queue`, :class:`Value` et :class:`Array`. Par exemple, ::

source: Server process managers are more flexible than using shared memory objects because they can be made to support arbitrary object types. Also, a single manager can be shared by processes on different computers over a network. They are, however, slower than using shared memory.
fr: Les processus serveurs de gestionnaires sont plus flexibles que les mémoires partagées parce qu'ils peuvent gérer des types d'objets arbitraires. Aussi, un gestionnaire unique peut être partagé par les processus sur différentes machines à travers le réseau. Cependant, ils sont plus lents que les mémoires partagées.

source: Using a pool of workers
fr: Utiliser un réservoir de *workers*

source: The :class:`~multiprocessing.pool.Pool` class represents a pool of worker processes. It has methods which allows tasks to be offloaded to the worker processes in a few different ways.
fr: La classe :class:`~multiprocessing.pool.Pool` représente une *pool* de processus de travail. Elle possède des méthodes qui permettent aux tâches d'être déchargées vers les processus de travail de différentes manières.

source: For example::
fr: Par exemple ::

source: Note that the methods of a pool should only ever be used by the process which created it.
fr: Notez que les méthodes d'une *pool* ne devraient être utilisées que par le processus qui l'a créée.

source: Functionality within this package requires that the ``__main__`` module be importable by the children. This is covered in :ref:`multiprocessing-programming` however it is worth pointing out here. This means that some examples, such as the :class:`multiprocessing.pool.Pool` examples will not work in the interactive interpreter. For example::
fr: Fonctionnellement ce paquet exige que que le module ``__main__`` soit importable par les fils. Cela est expliqué sur la page :ref:`multiprocessing-programming`, il est cependant utile de le rappeler ici. Cela signifie que certains exemples, comme les exemples utilisant :class:`multiprocessing.pool.Pool`, ne fonctionnent pas dans l'interpréteur interactif. Par exemple ::

source: (If you try this it will actually output three full tracebacks interleaved in a semi-random fashion, and then you may have to stop the parent process somehow.)
fr: Si vous essayez ce code, il affichera trois traces d'appels complètes entrelacées de manière semi-aléatoire, et vous devrez vous débrouiller pour arrêter le processus maître.

source: Reference
fr: Référence

source: The :mod:`multiprocessing` package mostly replicates the API of the :mod:`threading` module.
fr: Le paquet :mod:`multiprocessing` reproduit en grande partie l'API du module :mod:`threading`.

source: :class:`Process` and exceptions
fr: :class:`Process` et exceptions

source: Process objects represent activity that is run in a separate process. The :class:`Process` class has equivalents of all the methods of :class:`threading.Thread`.
fr: Les objets *process* représentent une activité exécutée dans un processus séparé. La classe :class:`Process` a des équivalents à toutes les méthodes de :class:`threading.Thread`.

source: The constructor should always be called with keyword arguments. *group* should always be ``None``; it exists solely for compatibility with :class:`threading.Thread`. *target* is the callable object to be invoked by the :meth:`run()` method. It defaults to ``None``, meaning nothing is called. *name* is the process name (see :attr:`name` for more details). *args* is the argument tuple for the target invocation. *kwargs* is a dictionary of keyword arguments for the target invocation. If provided, the keyword-only *daemon* argument sets the process :attr:`daemon` flag to ``True`` or ``False``. If ``None`` (the default), this flag will be inherited from the creating process.
fr: Le constructeur doit toujours être appelé avec des arguments nommés. *group* devrait toujours être ``None`` ; il existe uniquement pour la compatibilité avec :class:`threading.Thread`. *target* est l'objet appelable qui est invoqué par la méthode :meth:`run(). Il vaut ``None`` par défaut, signifiant que rien n'est appelé. *name* est le nom du processus (voir :attr:`name` pour plus de détails). *args* est le *tuple* d'arguments pour l'invocation de la cible. *kwargs* est le dictionnaire des arguments nommés pour l'invocation de la cible. S'il est fourni, l'argument nommé *daemon* met l'option :attr:`daemon` du processus à ``True`` ou ``False``. S'il est ``None`` (par défaut), l'option est héritée par le processus créateur.

source: By default, no arguments are passed to *target*.
fr: Par défaut, aucun argument n'est passé à *target*.

source: If a subclass overrides the constructor, it must make sure it invokes the base class constructor (:meth:`Process.__init__`) before doing anything else to the process.
fr: Si une sous-classe redéfinit le constructeur, elle doit s'assurer d'invoquer le constructeur de la classe de base (:meth:`Process.__init__`) avant de faire autre chose du processus.

source: Added the *daemon* argument.
fr: Ajout de l'argument *daemon*.

source: Method representing the process's activity.
fr: Méthode représentant l'activité du processus.

source: You may override this method in a subclass. The standard :meth:`run` method invokes the callable object passed to the object's constructor as the target argument, if any, with sequential and keyword arguments taken from the *args* and *kwargs* arguments, respectively.
fr: Vous pouvez redéfinir cette méthode dans une sous-classe. La méthode standard :meth:`run` invoque l'objet appelable passé au constructeur comme argument *target*, si fourni, avec les arguments séquentiels et nommés respectivement pris depuis les paramètres *args* et *kwargs*.

source: Start the process's activity.
fr: Démarre l'activité du processus.

source: This must be called at most once per process object. It arranges for the object's :meth:`run` method to be invoked in a separate process.
fr: Elle doit être appelée au plus une fois par objet processus. Elle s'arrange pour que la méthode :meth:`run` de l'objet soit invoquée dans un processus séparé.

source: If the optional argument *timeout* is ``None`` (the default), the method blocks until the process whose :meth:`join` method is called terminates. If *timeout* is a positive number, it blocks at most *timeout* seconds. Note that the method returns ``None`` if its process terminates or if the method times out. Check the process's :attr:`exitcode` to determine if it terminated.
fr: Si l'argument optionnel *timeout* est ``None`` (par défaut), la méthode bloque jusqu'à ce que le processus dont la méthode :meth:`join` a été appelée se termine. Si *timeout* est un nombre positif, elle bloque au maximum pendant *timeout* secondes. Notez que la méthode renvoie ``None`` si le processus se termine ou si le temps d'exécution expire. Vérifiez l'attribut :attr:`exitcode` du processus pour déterminer s'il s'est terminé.

source: A process can be joined many times.
fr: *join* peut être appelée plusieurs fois sur un même processus.
