Repository: python/python-docs-fr
Catalog: library/multiprocessing.po
Languages: fr

source: Returns a started :class:`~multiprocessing.managers.SyncManager` object which can be used for sharing objects between processes. The returned manager object corresponds to a spawned child process and has methods which will create shared objects and return corresponding proxies.
fr: Renvoie un objet :class:`~multiprocessing.managers.SyncManager` démarré qui peut être utilisé pour partager des objets entre les processus. L'objet gestionnaire renvoyé correspond à un processus enfant instancié et possède des méthodes pour créer des objets partagés et renvoyer les mandataires correspondants.

source: Manager processes will be shutdown as soon as they are garbage collected or their parent process exits. The manager classes are defined in the :mod:`multiprocessing.managers` module:
fr: Les processus gestionnaires seront arrêtés dès qu'ils seront collectés par le ramasse-miettes ou que leur processus parent se terminera. Les classes gestionnaires sont définies dans le module :mod:`multiprocessing.managers` :

source: Create a BaseManager object.
fr: Crée un objet *BaseManager*.

source: Once created one should call :meth:`start` or ``get_server().serve_forever()`` to ensure that the manager object refers to a started manager process.
fr: Une fois créé il faut appeler :meth:`start` ou ``get_server().serve_forever()`` pour assurer que l'objet gestionnaire référence un processus gestionnaire démarré.

source: *address* is the address on which the manager process listens for new connections. If *address* is ``None`` then an arbitrary one is chosen.
fr: *address* est l'adresse sur laquelle le processus gestionnaire écoute pour de nouvelles connexions. Si *address* est ``None``, une adresse arbitraire est choisie.

source: *authkey* is the authentication key which will be used to check the validity of incoming connections to the server process. If *authkey* is ``None`` then ``current_process().authkey`` is used. Otherwise *authkey* is used and it must be a byte string.
fr: *authkey* est la clé d'authentification qui sera utilisée pour vérifier la validité des connexions entrantes sur le processus serveur. Si *authkey* est ``None`` alors ``current_process().authkey`` est utilisée. Autrement *authkey* est utilisée et doit être une chaîne d'octets.

source: Start a subprocess to start the manager. If *initializer* is not ``None`` then the subprocess will call ``initializer(*initargs)`` when it starts.
fr: Démarre un sous-processus pour démarrer le gestionnaire. Si *initializer* n'est pas ``None`` alors le sous-processus appellera ``initializer(*initargs)`` quand il démarrera.

source: Returns a :class:`Server` object which represents the actual server under the control of the Manager. The :class:`Server` object supports the :meth:`serve_forever` method::
fr: Renvoie un objet :class:`Server` qui représente le serveur sous le contrôle du gestionnaire. L'objet :class:`Server` supporte la méthode :meth:`serve_forever` ::

source: :class:`Server` additionally has an :attr:`address` attribute.
fr: :class:`Server` possède en plus un attribut :attr:`address`.

source: Connect a local manager object to a remote manager process::
fr: Connecte un objet gestionnaire local au processus gestionnaire distant ::

source: Stop the process used by the manager. This is only available if :meth:`start` has been used to start the server process.
fr: Stoppe le processus utilisé par le gestionnaire. Cela est disponible uniquement si :meth:`start` a été utilisée pour démarrer le processus serveur.

source: This can be called multiple times.
fr: Cette méthode peut être appelée plusieurs fois.

source: A classmethod which can be used for registering a type or callable with the manager class.
fr: Une méthode de classe qui peut être utilisée pour enregistrer un type ou un appelable avec la classe gestionnaire.

source: *typeid* is a "type identifier" which is used to identify a particular type of shared object. This must be a string.
fr: *typeif* est un « *type identifier* » qui est utilisé pour identifier un type particulier d'objet partagé. Cela doit être une chaîne de caractères.

source: *callable* is a callable used for creating objects for this type identifier. If a manager instance will be connected to the server using the :meth:`connect` method, or if the *create_method* argument is ``False`` then this can be left as ``None``.
fr: *callable* est un objet appelable utilisé pour créer les objets avec cet identifiant de type. Si une instance de gestionnaire prévoit de se connecter au serveur en utilisant sa méthode :meth:`connect` ou si l'argument *create_method* vaut ``False`` alors cet argument peut être laissé à ``None``.

source: *proxytype* is a subclass of :class:`BaseProxy` which is used to create proxies for shared objects with this *typeid*. If ``None`` then a proxy class is created automatically.
fr: *proxytype* est une sous-classe de :class:`BaseProxy` utilisée pour créer des mandataires autour des objets partagés avec ce *typeid*. S'il est ``None``, une classe mandataire sera créée automatiquement.

source: *exposed* is used to specify a sequence of method names which proxies for this typeid should be allowed to access using :meth:`BaseProxy._callmethod`. (If *exposed* is ``None`` then :attr:`proxytype._exposed_` is used instead if it exists.) In the case where no exposed list is specified, all "public methods" of the shared object will be accessible. (Here a "public method" means any attribute which has a :meth:`~object.__call__` method and whose name does not begin with ``'_'``.)
fr: *exposed* est utilisé pour préciser une séquence de noms de méthodes dont les mandataires pour ce *typeid* doivent être autorisés à accéder via :meth:`BaseProxy._callmethod`. (Si *exposed* est ``None`` alors :attr:`proxytype._exposed_` est utilisé à la place s'il existe.) Dans le cas où aucune liste *exposed* n'est précisée, toutes les « méthodes publiques » de l'objet partagé seront accessibles. (Ici une « méthode publique » signifie n'importe quel attribut qui possède une méthode :meth:`~object.__call__` et dont le nom ne commence pas par un ``'_'``.)

source: *method_to_typeid* is a mapping used to specify the return type of those exposed methods which should return a proxy. It maps method names to typeid strings. (If *method_to_typeid* is ``None`` then :attr:`proxytype._method_to_typeid_` is used instead if it exists.) If a method's name is not a key of this mapping or if the mapping is ``None`` then the object returned by the method will be copied by value.
fr: *method_to_typeid* est un tableau associatif utilisé pour préciser le type de retour de ces méthodes exposées qui doivent renvoyer un mandataire. Il associé un nom de méthode à une chaîne de caractères *typeid*. (Si *method_to_typeid* est ``None``, :attr:`proxytype._method_to_typeid_` est utilisé à la place s'il existe). Si le nom d'une méthode n'est pas une clé de ce tableau associatif ou si la valeur associée est ``None``, l'objet renvoyé par la méthode sera une copie de la valeur.

source: *create_method* determines whether a method should be created with name *typeid* which can be used to tell the server process to create a new shared object and return a proxy for it. By default it is ``True``.
fr: *create_method* détermine si une méthode devrait être créée avec le nom *typeid*, qui peut être utilisée pour indiquer au processus serveur de créer un nouvel objet partagé et d'en renvoyer un mandataire. a valeur par défaut est ``True``.

source: :class:`BaseManager` instances also have one read-only property:
fr: Les instances de :class:`BaseManager` ont aussi une propriété en lecture seule :

source: The address used by the manager.
fr: L'adresse utilisée par le gestionnaire.

source: Manager objects support the context management protocol -- see :ref:`typecontextmanager`. :meth:`~contextmanager.__enter__` starts the server process (if it has not already started) and then returns the manager object. :meth:`~contextmanager.__exit__` calls :meth:`shutdown`.
fr: Les objets gestionnaires supportent le protocole des gestionnaires de contexte -- voir :ref:`typecontextmanager`. :meth:`~contextmanager.__enter__` démarre le processus serveur (s'il n'a pas déjà été démarré) et renvoie l'objet gestionnaire. :meth:`~contextmanager.__exit__` appelle :meth:`shutdown`.

source: In previous versions :meth:`~contextmanager.__enter__` did not start the manager's server process if it was not already started.
fr: Dans les versions précédentes :meth:`~contextmanager.__enter__` ne démarrait pas le processus serveur du gestionnaire s'il n'était pas déjà démarré.

source: A subclass of :class:`BaseManager` which can be used for the synchronization of processes. Objects of this type are returned by :func:`multiprocessing.Manager`.
fr: Une sous-classe de :class:`BaseManager` qui peut être utilisée pour la synchronisation entre processus. Des objets de ce type sont renvoyés par :func:`multiprocessing.Manager`.

source: Its methods create and return :ref:`multiprocessing-proxy_objects` for a number of commonly used data types to be synchronized across processes. This notably includes shared lists and dictionaries.
fr: Ces méthodes créent et renvoient des :ref:`multiprocessing-proxy_objects` pour un certain nombre de types de données communément utilisés pour être synchronisés entre les processus. Elles incluent notamment des listes et dictionnaires partagés.

source: Create a shared :class:`threading.Barrier` object and return a proxy for it.
fr: Crée un objet :class:`threading.Barrier` partagé et renvoie un mandataire pour cet objet.

source: Create a shared :class:`threading.BoundedSemaphore` object and return a proxy for it.
fr: Crée un objet :class:`threading.BoundedSemaphore` partagé et renvoie un mandataire pour cet objet.

source: Create a shared :class:`threading.Condition` object and return a proxy for it.
fr: Crée un objet :class:`threading.Condition` partagé et renvoie un mandataire pour cet objet.

source: If *lock* is supplied then it should be a proxy for a :class:`threading.Lock` or :class:`threading.RLock` object.
fr: Si *lock* est fourni alors il doit être un mandataire pour un objet :class:`threading.Lock` ou :class:`threading.RLock`.

source: Create a shared :class:`threading.Event` object and return a proxy for it.
fr: Crée un objet :class:`threading.Event` partagé et renvoie un mandataire pour cet objet.

source: Create a shared :class:`threading.Lock` object and return a proxy for it.
fr: Crée un objet :class:`threading.Lock` partagé et renvoie un mandataire pour cet objet.

source: Create a shared :class:`Namespace` object and return a proxy for it.
fr: Crée un objet :class:`Namespace` partagé et renvoie un mandataire pour cet objet.

source: Create a shared :class:`queue.Queue` object and return a proxy for it.
fr: Crée un objet :class:`queue.Queue` partagé et renvoie un mandataire pour cet objet.

source: Create a shared :class:`threading.RLock` object and return a proxy for it.
fr: Crée un objet :class:`threading.RLock` partagé et renvoie un mandataire pour cet objet.

source: Create a shared :class:`threading.Semaphore` object and return a proxy for it.
fr: Crée un objet :class:`threading.Semaphore` partagé et renvoie un mandataire pour cet objet.

source: Create an array and return a proxy for it.
fr: Crée un tableau et renvoie un mandataire pour cet objet.

source: Create an object with a writable ``value`` attribute and return a proxy for it.
fr: Crée un objet avec un attribut ``value`` accessible en écriture et renvoie un mandataire pour cet objet.

source: Create a shared :class:`dict` object and return a proxy for it.
fr: Crée un objet :class:`dict` partagé et renvoie un mandataire pour cet objet.

source: Create a shared :class:`list` object and return a proxy for it.
fr: Crée un objet :class:`list` partagé et renvoie un mandataire pour cet objet.

source: Shared objects are capable of being nested. For example, a shared container object such as a shared list can contain other shared objects which will all be managed and synchronized by the :class:`SyncManager`.
fr: Les objets partagés peuvent être imbriqués. Par exemple, un conteneur partagé tel qu'une liste partagée peu contenir d'autres objets partagés qui seront aussi gérés et synchronisés par le :class:`SyncManager`.

source: A type that can register with :class:`SyncManager`.
fr: Un type qui peut être enregistré avec :class:`SyncManager`.

source: A namespace object has no public methods, but does have writable attributes. Its representation shows the values of its attributes.
fr: Un espace de nommage n'a pas de méthodes publiques, mais possède des attributs accessibles en écriture. Sa représentation montre les valeurs de ses attributs.

source: However, when using a proxy for a namespace object, an attribute beginning with ``'_'`` will be an attribute of the proxy and not an attribute of the referent:
fr: Cependant, en utilisant un mandataire pour un espace de nommage, un attribut débutant par ``'_'`` est un attribut du mandataire et non de l'objet cible :

source: Customized managers
fr: Gestionnaires personnalisés

source: To create one's own manager, one creates a subclass of :class:`BaseManager` and uses the :meth:`~BaseManager.register` classmethod to register new types or callables with the manager class. For example::
fr: Pour créer son propre gestionnaire, il faut créer une sous-classe de :class:`BaseManager` et utiliser la méthode de classe :meth:`~BaseManager.register` pour enregistrer de nouveaux types ou *callables* au gestionnaire. Par exemple ::

source: Using a remote manager
fr: Utiliser un gestionnaire distant

source: It is possible to run a manager server on one machine and have clients use it from other machines (assuming that the firewalls involved allow it).
fr: Il est possible de lancer un serveur gestionnaire sur une machine et d'avoir des clients l'utilisant sur d'autres machines (en supposant que les pare-feus impliqués l'autorisent).

source: Running the following commands creates a server for a single shared queue which remote clients can access::
fr: Exécuter les commandes suivantes crée un serveur pour une simple queue partagée à laquelle des clients distants peuvent accéder ::

source: One client can access the server as follows::
fr: Un client peut accéder au serveur comme suit ::

source: Another client can also use it::
fr: Un autre client peut aussi l'utiliser ::

source: Local processes can also access that queue, using the code from above on the client to access it remotely::
fr: Les processus locaux peuvent aussi accéder à cette queue, utilisant le code précédent sur le client pour y accéder à distance ::

source: Proxy Objects
fr: Objets mandataires

source: A proxy is an object which *refers* to a shared object which lives (presumably) in a different process. The shared object is said to be the *referent* of the proxy. Multiple proxy objects may have the same referent.
fr: Un mandataire est un objet qui *référence* un objet partagé appartenant (supposément) à un processus différent. L'objet partagé est appelé le *référent* du mandataire. Plusieurs mandataires peuvent avoir un même référent.

source: A proxy object has methods which invoke corresponding methods of its referent (although not every method of the referent will necessarily be available through the proxy). In this way, a proxy can be used just like its referent can:
fr: Un mandataire possède des méthodes qui appellent les méthodes correspondantes du référent (bien que toutes les méthodes du référent ne soient pas nécessairement accessibles à travers le mandataire). De cette manière, un mandataire peut être utilisé comme le serait sont référent :

source: Notice that applying :func:`str` to a proxy will return the representation of the referent, whereas applying :func:`repr` will return the representation of the proxy.
fr: Notez qu'appliquer :func:`str` à un mandataire renvoie la représentation du référent, alors que :func:`repr` renvoie celle du mandataire.

source: An important feature of proxy objects is that they are picklable so they can be passed between processes. As such, a referent can contain :ref:`multiprocessing-proxy_objects`. This permits nesting of these managed lists, dicts, and other :ref:`multiprocessing-proxy_objects`:
fr: Une fonctionnalité importantes des objets mandataires est qu'ils sont sérialisables et peuvent donc être échangés entre les processus. Ainsi, un référent peut contenir des :ref:`multiprocessing-proxy_objects`. Cela permet d'imbriquer des listes et dictionnaires gérés ainsi que d'autres :ref:`multiprocessing-proxy_objects` :

source: Similarly, dict and list proxies may be nested inside one another::
fr: De même, les mandataires de listes et dictionnaires peuvent être imbriqués dans d'autres ::

source: If standard (non-proxy) :class:`list` or :class:`dict` objects are contained in a referent, modifications to those mutable values will not be propagated through the manager because the proxy has no way of knowing when the values contained within are modified. However, storing a value in a container proxy (which triggers a ``__setitem__`` on the proxy object) does propagate through the manager and so to effectively modify such an item, one could re-assign the modified value to the container proxy::
fr: Si des objets standards (non *proxyfiés*) :class:`list` ou :class:`dict` sont contenus dans un référent, les modifications sur ces valeurs mutables ne seront pas propagées à travers le gestionnaire parce que le mandataire n'a aucun moyen de savoir quand les valeurs contenues sont modifiées. Cependant, stocker une valeur dans un conteneur mandataire (qui déclenche un appel à ``__setitem__`` sur le mandataire) propage bien la modification à travers le gestionnaire et modifie effectivement l'élément, il est ainsi possible de réassigner la valeur modifiée au conteneur mandataire ::

source: This approach is perhaps less convenient than employing nested :ref:`multiprocessing-proxy_objects` for most use cases but also demonstrates a level of control over the synchronization.
fr: Cette approche est peut-être moins pratique que d'utiliser des :ref:`multiprocessing-proxy_objects` imbriqués pour la majorité des cas d'utilisation, mais démontre aussi un certain niveau de contrôle sur la synchronisation.

source: The proxy types in :mod:`multiprocessing` do nothing to support comparisons by value. So, for instance, we have:
fr: Les types de mandataires de :mod:`multiprocessing` n'implémentent rien pour la comparaison par valeurs. Par exemple, on a :

source: One should just use a copy of the referent instead when making comparisons.
fr: Il faut à la place simplement utiliser une copie du référent pour faire les comparaisons.

source: Proxy objects are instances of subclasses of :class:`BaseProxy`.
fr: Les objets mandataires sont des instances de sous-classes de :class:`BaseProxy`.

source: Call and return the result of a method of the proxy's referent.
fr: Appelle et renvoie le résultat d'une méthode du référent du mandataire.

source: If ``proxy`` is a proxy whose referent is ``obj`` then the expression ::
fr: Si ``proxy`` est un mandataire sont le référent est ``obj``, alors l'expression ::

source: will evaluate the expression ::
fr: s'évalue comme ::

source: in the manager's process.
fr: dans le processus du gestionnaire.

source: The returned value will be a copy of the result of the call or a proxy to a new shared object -- see documentation for the *method_to_typeid* argument of :meth:`BaseManager.register`.
fr: La valeur renvoyée sera une copie du résultat de l'appel ou un mandataire sur un nouvel objet partagé -- voir l'a documentation de l'argument *method_to_typeid* de :meth:`BaseManager.register`.

source: If an exception is raised by the call, then is re-raised by :meth:`_callmethod`. If some other exception is raised in the manager's process then this is converted into a :exc:`RemoteError` exception and is raised by :meth:`_callmethod`.
fr: Si une exception est levée par l'appel, elle est relayée par :meth:`_callmethod`. Si une autre exception est levée par le processus du gestionnaire, elle est convertie en une :exc:`RemoteError` et est levée par :meth:`_callmethod`.

source: Note in particular that an exception will be raised if *methodname* has not been *exposed*.
fr: Notez en particulier qu'une exception est levée si *methodname* n'est pas *exposée*.

source: An example of the usage of :meth:`_callmethod`:
fr: Un exemple d'utilisation de :meth:`_callmethod` :

source: Return a copy of the referent.
fr: Renvoie une copie du référent.

source: If the referent is unpicklable then this will raise an exception.
fr: Si le référent n'est pas sérialisable, une exception est levée.

source: Return a representation of the proxy object.
fr: Renvoie la représentation de l'objet mandataire.

source: Return the representation of the referent.
fr: Renvoie la représentation du référent.

source: Cleanup
fr: Nettoyage

source: A proxy object uses a weakref callback so that when it gets garbage collected it deregisters itself from the manager which owns its referent.
fr: Un mandataire utilise un *callback* sous une référence faible de façon à ce que quand il est collecté par le ramasse-miettes, il se désenregistre auprès du gestionnaire qui possède le référent.

source: A shared object gets deleted from the manager process when there are no longer any proxies referring to it.
fr: Un objet partagé est supprimé par le processus gestionnaire quand plus aucun mandataire ne le référence.

source: Process Pools
fr: Bassins de processus

source: One can create a pool of processes which will carry out tasks submitted to it with the :class:`Pool` class.
fr: On peut créer un bassin de processus qui exécuteront les tâches qui lui seront soumises avec la classe :class:`Pool`.

source: A process pool object which controls a pool of worker processes to which jobs can be submitted. It supports asynchronous results with timeouts and callbacks and has a parallel map implementation.
fr: Un objet *process pool* qui contrôle un bassin de processus *workers* auquel sont soumises des tâches. Il supporte les résultats asynchrones avec des *timeouts* et des *callabacks* et possède une implémentation parallèle de *map*.

source: *processes* is the number of worker processes to use. If *processes* is ``None`` then the number returned by :func:`os.cpu_count` is used.
fr: *processes* est le nombre de processus *workers* à utiliser. Si *processes* est ``None``, le nombre renvoyé par :func:`os.cpu_count` est utilisé.

source: If *initializer* is not ``None`` then each worker process will call ``initializer(*initargs)`` when it starts.
fr: Si *initializer* n'est pas ``None``, chaque processus *worker* appellera ``initializer(*initargs)`` en démarrant.

source: *maxtasksperchild* is the number of tasks a worker process can complete before it will exit and be replaced with a fresh worker process, to enable unused resources to be freed. The default *maxtasksperchild* is ``None``, which means worker processes will live as long as the pool.
fr: *maxtasksperchild* est le nombre de tâches qu'un processus *worker* peut accomplir avant de se fermer et d'être remplacé par un *worker* frais, pour permettre aux ressources inutilisées d'être libérées. Par défaut *maxtasksperchild* est ``None``, ce qui signifie que le *worker* vit aussi longtemps que le bassin.
