Repository: python/python-docs-fr
Catalog: library/multiprocessing.po
Languages: fr

source: *context* can be used to specify the context used for starting the worker processes. Usually a pool is created using the function :func:`multiprocessing.Pool` or the :meth:`Pool` method of a context object. In both cases *context* is set appropriately.
fr: *context* peut être utilisé pour préciser le contexte utilisé pour démarrer les processus *workers*. Habituellement un bassin est créé à l'aide de la fonction :func:`multiprocessing.Pool` ou de la méthode :meth:`Pool` d'un objet de contexte. Dans les deux cas *context* est réglé de façon appropriée.

source: Note that the methods of the pool object should only be called by the process which created the pool.
fr: Notez que les méthodes de l'objet *pool* ne doivent être appelées que par le processus qui l'a créé.

source: Worker processes within a :class:`Pool` typically live for the complete duration of the Pool's work queue. A frequent pattern found in other systems (such as Apache, mod_wsgi, etc) to free resources held by workers is to allow a worker within a pool to complete only a set amount of work before being exiting, being cleaned up and a new process spawned to replace the old one. The *maxtasksperchild* argument to the :class:`Pool` exposes this ability to the end user.
fr: Les processus *workers* à l'intérieur d'une :class:`Pool` vivent par défaut aussi longtemps que la queue de travail du bassin. Un modèle fréquent chez d'autres systèmes (tels qu'Apache, *mod_wsgi*, etc.) pour libérer les ressources détenues par les *workers* est d'autoriser un *worker* dans le bassin à accomplir seulement une certaine charge de travail avant de se fermer, se retrouvant nettoyé et remplacé par un nouvelle processus fraîchement lancé. L'argument *maxtasksperchild* de :class:`Pool` expose cette fonctionnalité à l'utilisateur final.

source: Call *func* with arguments *args* and keyword arguments *kwds*. It blocks until the result is ready. Given this blocks, :meth:`apply_async` is better suited for performing work in parallel. Additionally, *func* is only executed in one of the workers of the pool.
fr: Appelle *func* avec les arguments *args* et les arguments nommés *kwds*. Bloque jusqu'à ce que que le résultat soit prêt. En raison de ce blocage, :meth:`apply_async` est préférable pour exécuter du travail en parallèle. De plus, *func* est exécutée sur un seul des *workers* du bassin.

source: A variant of the :meth:`apply` method which returns a result object.
fr: Une variante de la méthode :meth:`apply` qui renvoie un objet résultat.

source: If *callback* is specified then it should be a callable which accepts a single argument. When the result becomes ready *callback* is applied to it, that is unless the call failed, in which case the *error_callback* is applied instead.
fr: Si *callback* est précisé alors ce doit être un objet appelable qui accepte un seul argument. Quand le résultat est prêt, *callback* est appelé avec ce résultat, si l'appel n'échoue pas auquel cas *error_callback* est appelé à la place.

source: If *error_callback* is specified then it should be a callable which accepts a single argument. If the target function fails, then the *error_callback* is called with the exception instance.
fr: Si *error_callback* est précisé alors ce doit être un objet appelable qui accepte un seul argument. Si la fonction cible échoue, alors *error_callback* est appelé avec l'instance de l'exception.

source: Callbacks should complete immediately since otherwise the thread which handles the results will get blocked.
fr: Les *callbacks* doivent se terminer immédiatement, autrement le fil d'exécution qui gère les résultats se retrouverait bloqué.

source: A parallel equivalent of the :func:`map` built-in function (it supports only one *iterable* argument though, for multiple iterables see :meth:`starmap`). It blocks until the result is ready.
fr: Un équivalent parallèle de la fonction native :func:`map` (qui ne prend qu'un seul argument *itérable* ; pour en passer plusieurs, référez-vous à :meth:`starmap`). Elle bloque jusqu'à ce que le résultat soit prêt.

source: This method chops the iterable into a number of chunks which it submits to the process pool as separate tasks. The (approximate) size of these chunks can be specified by setting *chunksize* to a positive integer.
fr: La méthode découpe l'itérable en un nombre de morceaux qu'elle envoie au bassin de processus comme des tâches séparées. La taille (approximative) de ces morceaux peut être précisée en passant à *chunksize* un entier positif.

source: Note that it may cause high memory usage for very long iterables. Consider using :meth:`imap` or :meth:`imap_unordered` with explicit *chunksize* option for better efficiency.
fr: Notez que cela peut entraîner une grosse consommation de mémoire pour les itérables très longs. Envisagez d'utiliser :meth:`imap` ou :meth:`imap_unordered` avec l'option *chunksize* explicite pour une meilleure efficacité.

source: A variant of the :meth:`.map` method which returns a result object.
fr: Une variante de la méthode :meth:`.map` qui renvoie un objet résultat.

source: A lazier version of :meth:`.map`.
fr: Une version paresseuse de :meth:`map`.

source: The *chunksize* argument is the same as the one used by the :meth:`.map` method. For very long iterables using a large value for *chunksize* can make the job complete **much** faster than using the default value of ``1``.
fr: L'argument *chunksize* est le même que celui utilisé par la méthode :meth:`.map`. Pour de très longs itérables, utiliser une grande valeur pour *chunksize* peut faire s'exécuter la tâche **beaucoup** plus rapidement qu'en utilisant la valeur par défaut de ``1``.

source: Also if *chunksize* is ``1`` then the :meth:`!next` method of the iterator returned by the :meth:`imap` method has an optional *timeout* parameter: ``next(timeout)`` will raise :exc:`multiprocessing.TimeoutError` if the result cannot be returned within *timeout* seconds.
fr: Aussi, si *chucksize* vaut ``1`` alors la méthode :meth:`!next` de l'itérateur renvoyé par :meth:`imap` prend un paramètre optionnel *timeout* : ``next(timeout)`` lève une :exc:`multiprocessing.TimeoutError` si le résultat ne peut pas être renvoyé avant *timeout* secondes.

source: The same as :meth:`imap` except that the ordering of the results from the returned iterator should be considered arbitrary. (Only when there is only one worker process is the order guaranteed to be "correct".)
fr: Identique à :meth:`imap` si ce n'est que l'ordre des résultats de l'itérateur renvoyé doit être considéré comme arbitraire. (L'ordre n'est garanti que quand il n'y a qu'un *worker*.)

source: Like :meth:`map` except that the elements of the *iterable* are expected to be iterables that are unpacked as arguments.
fr: Semblable à :meth:`map` à l'exception que les éléments d'*iterable* doivent être des itérables qui seront dépaquetés comme arguments pour la fonction.

source: Hence an *iterable* of ``[(1,2), (3, 4)]`` results in ``[func(1,2), func(3,4)]``.
fr: Par conséquent un *iterable* ``[(1,2), (3, 4)]`` donnera pour résultat ``[func(1,2), func(3,4)]``.

source: A combination of :meth:`starmap` and :meth:`map_async` that iterates over *iterable* of iterables and calls *func* with the iterables unpacked. Returns a result object.
fr: Une combinaison de :meth:`starmap` et :meth:`map_async` qui itère sur *iterable* (composé d'itérables) et appelle *func* pour chaque itérable dépaqueté. Renvoie l'objet résultat.

source: Prevents any more tasks from being submitted to the pool. Once all the tasks have been completed the worker processes will exit.
fr: Empêche de nouvelles tâches d'être envoyées à la *pool*. Les processus *workers* se terminent une fois que toutes les tâches ont été complétées.

source: Stops the worker processes immediately without completing outstanding work. When the pool object is garbage collected :meth:`terminate` will be called immediately.
fr: Stoppe immédiatement les processus *workers* sans finaliser les travaux courants. Quand l'objet *pool* est collecté par le ramasse-miettes, sa méthode :meth:`terminate` est appelée immédiatement.

source: Wait for the worker processes to exit. One must call :meth:`close` or :meth:`terminate` before using :meth:`join`.
fr: Attend que les processus *workers* se terminent. Il est nécessaire d'appeler :meth:`close` ou :meth:`terminate` avant d'utiliser :meth:`join`.

source: Pool objects now support the context management protocol -- see :ref:`typecontextmanager`. :meth:`~contextmanager.__enter__` returns the pool object, and :meth:`~contextmanager.__exit__` calls :meth:`terminate`.
fr: Les bassins de *workers* supportent maintenant le protocole des gestionnaires de contexte -- voir :ref:`typecontextmanager`. :meth:`~contextmanager.__enter__` renvoie l'objet *pool* et :meth:`~contextmanager.__exit__` appelle :meth:`terminate`.

source: The class of the result returned by :meth:`Pool.apply_async` and :meth:`Pool.map_async`.
fr: La classe des résultats renvoyés par :meth:`Pool.apply_async` et :meth:`Pool.map_async`.

source: Return the result when it arrives. If *timeout* is not ``None`` and the result does not arrive within *timeout* seconds then :exc:`multiprocessing.TimeoutError` is raised. If the remote call raised an exception then that exception will be reraised by :meth:`get`.
fr: Renvoie le résultat quand il arrive. Si *timeout* n'est pas ``None`` et que le résultat n'arrive pas avant *timeout* secondes, une :exc:`multiprocessing.TimeoutError` est levée. Si l'appel distance lève une exception, alors elle est relayée par :meth:`get`.

source: Wait until the result is available or until *timeout* seconds pass.
fr: Attend que le résultat soit disponible ou que *timeout* secondes s'écoulent.

source: Return whether the call has completed.
fr: Renvoie ``True`` ou ``False`` suivant si la tâche est accomplie.

source: Return whether the call completed without raising an exception. Will raise :exc:`ValueError` if the result is not ready.
fr: Renvoie ``True`` ou ``False`` suivant si la tâche est accomplie sans lever d'exception. Lève une :exc:`ValueError` si le résultat n'est pas prêt.

source: If the result is not ready, :exc:`ValueError` is raised instead of :exc:`AssertionError`.
fr: Si le résultat n'est pas prêt, une :exc:`ValueError` est levée au lieu d'une :exc:`AssertionError` auparavant.

source: The following example demonstrates the use of a pool::
fr: Les exemples suivants présentent l'utilisation d'un bassin de *workers* ::

source: Listeners and Clients
fr: Auditeurs et Clients

source: Usually message passing between processes is done using queues or by using :class:`~Connection` objects returned by :func:`~multiprocessing.Pipe`.
fr: Habituellement l'échange de messages entre processus est réalisé en utilisant des queues ou des objets :class:`~Connection` renvoyés par :func:`~multiprocessing.Pipe`.

source: However, the :mod:`multiprocessing.connection` module allows some extra flexibility. It basically gives a high level message oriented API for dealing with sockets or Windows named pipes. It also has support for *digest authentication* using the :mod:`hmac` module, and for polling multiple connections at the same time.
fr: Cependant, le module :mod:`multiprocessing.connection` permet un peu plus de flexibilité. Il fournit un message de plus haut-niveau orienté API pour gérer des connecteurs ou des tubes nommés sous Windows. Il gère aussi l'authentification par condensat (*digest authentication* en anglais) en utilisant le module :mod:`hmac`, et pour interroger de multiples connexions en même temps.

source: Send a randomly generated message to the other end of the connection and wait for a reply.
fr: Envoie un message généré aléatoirement à l'autre bout de la connexion et attend une réponse.

source: If the reply matches the digest of the message using *authkey* as the key then a welcome message is sent to the other end of the connection. Otherwise :exc:`~multiprocessing.AuthenticationError` is raised.
fr: Si la réponse correspond au condensat du message avec la clé *authkey*, alors un message de bienvenue est envoyé à l'autre bout de la connexion. Autrement, une :exc:`~multiprocessing.AuthenticationError` est levée.

source: Receive a message, calculate the digest of the message using *authkey* as the key, and then send the digest back.
fr: Reçoit un message, calcule le condensat du message en utilisant la clé *authkey*, et envoie le condensat en réponse.

source: If a welcome message is not received, then :exc:`~multiprocessing.AuthenticationError` is raised.
fr: Si un message de bienvenue n'est pas reçu, une :exc:`~multiprocessing.AuthenticationError` est levée.

source: Attempt to set up a connection to the listener which is using address *address*, returning a :class:`~Connection`.
fr: Essaie d'établir une connexion avec l'auditeur qui utilise l'adresse *address*, renvoie une :class:`~Connection`.

source: The type of the connection is determined by *family* argument, but this can generally be omitted since it can usually be inferred from the format of *address*. (See :ref:`multiprocessing-address-formats`)
fr: Le type de la connexion est déterminé par l'argument *family*, mais il peut généralement être omis puisqu'il peut être inféré depuis le format d'*address*. (Voir :ref:`multiprocessing-address-formats`)

source: If *authkey* is given and not None, it should be a byte string and will be used as the secret key for an HMAC-based authentication challenge. No authentication is done if *authkey* is None. :exc:`~multiprocessing.AuthenticationError` is raised if authentication fails. See :ref:`multiprocessing-auth-keys`.
fr: Si *authkey* est passée et n'est pas ``None``, elle doit être une chaîne d'octets et sera utilisée comme clé secrète pour le défi d'authentification basé sur HMAC. Aucune authentification n'est réalisée si *authkey* est ``None``. Une :exc:`~multiprocessing.AuthenticationError` est levée si l'authentification échoue. Voir :ref:`multiprocessing-auth-keys`.

source: A wrapper for a bound socket or Windows named pipe which is 'listening' for connections.
fr: Une enveloppe autour d'un connecteur lié ou un tube nommé sous Windows qui écoute pour des connexions.

source: *address* is the address to be used by the bound socket or named pipe of the listener object.
fr: *address* est l'adresse à utiliser par le connecteur lié ou le tube nommé de l'objet auditeur.

source: If an address of '0.0.0.0' is used, the address will not be a connectable end point on Windows. If you require a connectable end-point, you should use '127.0.0.1'.
fr: Si une adresse '0.0.0.0' est utilisée, l'adresse ne sera pas un point d'accès connectable sous Windows. Si vous avez besoin d'un point d'accès connectable, utilisez '127.0.0.1'.

source: *family* is the type of socket (or named pipe) to use. This can be one of the strings ``'AF_INET'`` (for a TCP socket), ``'AF_UNIX'`` (for a Unix domain socket) or ``'AF_PIPE'`` (for a Windows named pipe). Of these only the first is guaranteed to be available. If *family* is ``None`` then the family is inferred from the format of *address*. If *address* is also ``None`` then a default is chosen. This default is the family which is assumed to be the fastest available. See :ref:`multiprocessing-address-formats`. Note that if *family* is ``'AF_UNIX'`` and address is ``None`` then the socket will be created in a private temporary directory created using :func:`tempfile.mkstemp`.
fr: *family* est le type de connecteur (ou tube nommé) à utiliser. Cela peut être l'une des chaînes ``'AF_INET'`` (pour un connecteur TCP), ``'AF_UNIX'`` (pour un connecteur Unix) ou ``'AF_PIPE'`` (pour un tube nommé sous Windows). Seulement le premier d'entre eux est garanti d'être disponible. Si *family* est ``None``, la famille est inférée depuis le format d'*address*. Si *address* est aussi ``None``, la famille par défaut est utilisée. La famille par défaut est supposée être la plus rapide disponible. Voir :ref:`multiprocessing-address-formats`. Notez que si la *family* est ``'AF_UNIX'`` et qu'*address* est ``None``, le connecteur est créé dans un répertoire temporaire privé créé avec :func:`tempfile.mkstemp`.

source: If the listener object uses a socket then *backlog* (1 by default) is passed to the :meth:`~socket.socket.listen` method of the socket once it has been bound.
fr: Si l'objet auditeur utilise un connecteur alors *backlog* (1 par défaut) est passé à la méthode :meth:`~socket.socket.listen` du connecteur une fois qu'il a été lié.

source: Accept a connection on the bound socket or named pipe of the listener object and return a :class:`~Connection` object. If authentication is attempted and fails, then :exc:`~multiprocessing.AuthenticationError` is raised.
fr: Accepte une connexion sur le connecteur lié ou le tube nommé de l'objet auditeur et renvoie un objet :class:`~Connection`. Si la tentative d'authentification échoue, une :exc:`~multiprocessing.AuthenticationError` est levée.

source: Close the bound socket or named pipe of the listener object. This is called automatically when the listener is garbage collected. However it is advisable to call it explicitly.
fr: Ferme le connecteur lié ou le tube nommé de l'objet auditeur. La méthode est appelée automatiquement quand l'auditeur est collecté par le ramasse-miettes. Il est cependant conseillé de l'appeler explicitement.

source: Listener objects have the following read-only properties:
fr: Les objets auditeurs ont aussi les propriétés en lecture seule suivantes :

source: The address which is being used by the Listener object.
fr: L'adresse utilisée par l'objet auditeur.

source: The address from which the last accepted connection came. If this is unavailable then it is ``None``.
fr: L'adresse depuis laquelle a été établie la dernière connexion. ``None`` si aucune n'est disponible.

source: Listener objects now support the context management protocol -- see :ref:`typecontextmanager`. :meth:`~contextmanager.__enter__` returns the listener object, and :meth:`~contextmanager.__exit__` calls :meth:`close`.
fr: Les objets auditeurs supportent maintenant le protocole des gestionnaires de contexte -- voir :ref:`typecontextmanager`. :meth:`~contextmanager.__enter__` renvoie l'objet auditeur, et :meth:`~contextmanager.__exit__` appelle :meth:`close`.

source: Wait till an object in *object_list* is ready. Returns the list of those objects in *object_list* which are ready. If *timeout* is a float then the call blocks for at most that many seconds. If *timeout* is ``None`` then it will block for an unlimited period. A negative timeout is equivalent to a zero timeout.
fr: Attend qu'un objet d'*object_list* soit prêt. Renvoie la liste de ces objets d'*object_list* qui sont prêts. Si *timeout* est un nombre flottant, l'appel bloquera au maximum ce nombre de secondes. Si *timeout* est ``None``, l'appelle bloquera pour une durée non limitée. Un *timeout* négatif est équivalent à un *timeout* nul.

source: For both Unix and Windows, an object can appear in *object_list* if it is
fr: Pour Unix et Windows, un objet peut apparaître dans *object_list* s'il est

source: a readable :class:`~multiprocessing.connection.Connection` object;
fr: un objet :class:`~multiprocessing.connection.Connection` accessible en lecture ;

source: a connected and readable :class:`socket.socket` object; or
fr: un objet :class:`socket.socket` connecté et accessible en lecture ; ou

source: the :attr:`~multiprocessing.Process.sentinel` attribute of a :class:`~multiprocessing.Process` object.
fr: l'attribut :attr:`~multiprocessing.Process.sentinel` d'un objet :class:`~multiprocessing.Process`.

source: A connection or socket object is ready when there is data available to be read from it, or the other end has been closed.
fr: Une connexion (*socket* en anglais) est prête quand il y a des données disponibles en lecture dessus, ou que l'autre bout a été fermé.

source: **Unix**: ``wait(object_list, timeout)`` almost equivalent ``select.select(object_list, [], [], timeout)``. The difference is that, if :func:`select.select` is interrupted by a signal, it can raise :exc:`OSError` with an error number of ``EINTR``, whereas :func:`wait` will not.
fr: **Unix**: ``wait(object_list, timeout)`` est en grande partie équivalente à ``select.select(object_list, [], [], timeout)``. La différence est que, si :func:`select.select` est interrompue par un signal, elle peut lever une :exc:`OSError` avec un numéro d'erreur ``EINTR``, alors que :func:`wait` ne le fera pas.

source: **Windows**: An item in *object_list* must either be an integer handle which is waitable (according to the definition used by the documentation of the Win32 function ``WaitForMultipleObjects()``) or it can be an object with a :meth:`fileno` method which returns a socket handle or pipe handle. (Note that pipe handles and socket handles are **not** waitable handles.)
fr: **Windows** : un élément d'*object_list* doit être soit un identifiant *waitable* (en accord avec la définition utilisée par la documentation de la fonction Win32 ``WaitForMultipleObjects()``), soit un objet avec une méthode :meth:`fileno` qui renvoie un identifiant de connecteur ou de tube (notez que les identifiants de tubes et de connecteurs **ne sont pas** des identifiants *waitables*).

source: **Examples**
fr: **Exemples**

source: The following server code creates a listener which uses ``'secret password'`` as an authentication key. It then waits for a connection and sends some data to the client::
fr: Le code serveur suivant crée un auditeur qui utilise ``'secret password'`` comme clé d'authentification. Il attend ensuite une connexion et envoie les données au client ::

source: The following code connects to the server and receives some data from the server::
fr: Le code suivant se connecte au serveur et en reçoit des données ::

source: The following code uses :func:`~multiprocessing.connection.wait` to wait for messages from multiple processes at once::
fr: Le code suivant utilise :func:`~multiprocessing.connection.wait` pour attendre des messages depuis plusieurs processus à la fois ::

source: Address Formats
fr: Formats d'adresses

source: An ``'AF_INET'`` address is a tuple of the form ``(hostname, port)`` where *hostname* is a string and *port* is an integer.
fr: Une adresse ``'AF_INET'`` est un *tuple* de la forme ``(hostname, port)`` où *hostname* est une chaîne et *port* un entier.

source: An ``'AF_UNIX'`` address is a string representing a filename on the filesystem.
fr: Une adresse ``'AF_UNIX'`` est une chaîne représentant un nom de fichier sur le système de fichiers.

source: An ``'AF_PIPE'`` address is a string of the form
fr: Une adresse ``'AF_PIPE'`` est une chaîne de la forme

source: :samp:`r'\\\\.\\pipe\\{PipeName}'`. To use :func:`Client` to connect to a named pipe on a remote computer called *ServerName* one should use an address of the form :samp:`r'\\\\{ServerName}\\pipe\\{PipeName}'` instead.
fr: :samp:`r'\\\\.\\pipe\\{PipeName}'`. Pour utiliser un :func:`Client` pour se connecter à un tube nommé sur une machine distante appelée *ServerName*, il faut plutôt utiliser une adresse de la forme :samp:`r'\\\\{ServerName}\\pipe\\{PipeName}'`.

source: Note that any string beginning with two backslashes is assumed by default to be an ``'AF_PIPE'`` address rather than an ``'AF_UNIX'`` address.
fr: Notez que toute chaîne commençant par deux antislashs est considérée par défaut comme l'adresse d'un ``'AF_PIPE'`` plutôt qu'une adresse ``'AF_UNIX'``.

source: Authentication keys
fr: Clés d'authentification
