Repository: python/python-docs-fr
Catalog: library/multiprocessing.po
Languages: fr

source: Prevent :meth:`join_thread` from blocking. In particular, this prevents the background thread from being joined automatically when the process exits -- see :meth:`join_thread`.
fr: Empêche :meth:`join_thread` de bloquer. En particulier, cela empêche le fil d'arrière-plan d'être attendu automatiquement quand le processus se ferme -- voir :meth:`join_thread`.

source: A better name for this method might be ``allow_exit_without_flush()``. It is likely to cause enqueued data to lost, and you almost certainly will not need to use it. It is really only there if you need the current process to exit immediately without waiting to flush enqueued data to the underlying pipe, and you don't care about lost data.
fr: Un meilleur nom pour cette méthode pourrait être ``allow_exit_without_flush()``. Cela peut provoquer des pertes de données placées dans la queue, et vous ne devriez certainement pas avoir besoin de l'utiliser. Elle n'est là que si vous souhaitez terminer immédiatement le processus sans transférer les données du tampon, et que vous ne vous inquiétez pas de perdre des données.

source: This class's functionality requires a functioning shared semaphore implementation on the host operating system. Without one, the functionality in this class will be disabled, and attempts to instantiate a :class:`Queue` will result in an :exc:`ImportError`. See :issue:`3770` for additional information. The same holds true for any of the specialized queue types listed below.
fr: Le fonctionnement de cette classe requiert une implémentation de sémaphore partagé sur le système d'exploitation hôte. Sans cela, la fonctionnalité sera désactivée et la tentative d'instancier une :class:`Queue` lèvera une :exc:`ImportError`. Voir :issue:`3770` pour plus d'informations. Cette remarque reste valable pour les autres types de queues spécialisées définies par la suite.

source: It is a simplified :class:`Queue` type, very close to a locked :class:`Pipe`.
fr: Un type de :class:`Queue` simplifié, très proche d'un :class:`Pipe` avec verrou.

source: Return ``True`` if the queue is empty, ``False`` otherwise.
fr: Renvoie ``True`` si la queue est vide, ``False`` sinon.

source: Remove and return an item from the queue.
fr: Supprime et renvoie un élément de la queue.

source: Put *item* into the queue.
fr: Place *item* dans la queue.

source: :class:`JoinableQueue`, a :class:`Queue` subclass, is a queue which additionally has :meth:`task_done` and :meth:`join` methods.
fr: :class:`JoinableQueue`, une sous-classe de :class:`Queue`, est une queue qui ajoute des méthodes :meth:`task_done` et :meth:`join`.

source: Indicate that a formerly enqueued task is complete. Used by queue consumers. For each :meth:`~Queue.get` used to fetch a task, a subsequent call to :meth:`task_done` tells the queue that the processing on the task is complete.
fr: Indique qu'une tâche précédemment placée dans la queue est complétée. Utilisé par les consommateurs de la queue. Pour chaque :meth:`~Queue.get` utilisé pour récupérer une tâche, un appel ultérieur à :meth:`task_done` indique à la queue que le traitement de la tâche est terminé.

source: If a :meth:`~queue.Queue.join` is currently blocking, it will resume when all items have been processed (meaning that a :meth:`task_done` call was received for every item that had been :meth:`~Queue.put` into the queue).
fr: Si un :meth:`~queue.Queue.join` est actuellement bloquant, il se débloquera quand tous les éléments auront été traités (signifiant qu'un appel à :meth:`task_done` a été reçu pour chaque élément ayant été placé via :meth:`~Queue.put` dans la queue).

source: Raises a :exc:`ValueError` if called more times than there were items placed in the queue.
fr: Lève une exception :exc:`ValueError` si appelée plus de fois qu'il y avait d'éléments dans la file.

source: Block until all items in the queue have been gotten and processed.
fr: Bloque jusqu'à ce que tous les éléments de la queue aient été récupérés et traités.

source: The count of unfinished tasks goes up whenever an item is added to the queue. The count goes down whenever a consumer calls :meth:`task_done` to indicate that the item was retrieved and all work on it is complete. When the count of unfinished tasks drops to zero, :meth:`~queue.Queue.join` unblocks.
fr: Le compteur des tâches non accomplies augmente chaque fois qu'un élément est ajouté à la queue. Le compteur redescend chaque fois qu'un consommateur appelle :meth:`task_done` pour indiquer qu'un élément a été récupéré et que tout le travail qui le concerne est complété. Quand le compteur des tâches non accomplies atteint zéro, :meth:`~queue.Queue.join` est débloquée.

source: Miscellaneous
fr: Divers

source: Return list of all live children of the current process.
fr: Renvoie la liste de tous les enfants vivants du processus courant.

source: Calling this has the side effect of "joining" any processes which have already finished.
fr: Appeler cette méthode provoque l'effet de bord d'attendre tout processus qui n'a pas encore terminé.

source: Return the number of CPUs in the system.
fr: Renvoie le nombre de CPU sur le système.

source: This number is not equivalent to the number of CPUs the current process can use. The number of usable CPUs can be obtained with ``len(os.sched_getaffinity(0))``
fr: Ce nombre n'est pas équivalent au nombre de CPUs que le processus courant peut utiliser. Le nombre de CPUs utilisables peut être obtenu avec ``len(os.sched_getaffinity(0))``

source: May raise :exc:`NotImplementedError`.
fr: Peut lever une :exc:`NotImplementedError`.

source: Return the :class:`Process` object corresponding to the current process.
fr: Renvoie l'objet :class:`Process` correspondant au processus courant.

source: An analogue of :func:`threading.current_thread`.
fr: Un analogue à :func:`threading.current_thread`.

source: Return the :class:`Process` object corresponding to the parent process of the :func:`current_process`. For the main process, ``parent_process`` will be ``None``.
fr: Renvoie l'objet :class:`Process` correspondant au processus père de :func:`current_process`. Pour le processus maître, ``parent_process`` vaut ``None``.

source: Add support for when a program which uses :mod:`multiprocessing` has been frozen to produce a Windows executable. (Has been tested with **py2exe**, **PyInstaller** and **cx_Freeze**.)
fr: Ajoute le support des programmes utilisant :mod:`multiprocessing` qui ont été gelés pour produire un exécutable Windows. (Testé avec **py2exe**, **PyInstaller** et **cx_Freeze**.)

source: One needs to call this function straight after the ``if __name__ == '__main__'`` line of the main module. For example::
fr: Cette fonction doit être appelée juste après la ligne ``if __name__ == '__main__'`` du module principal. Par exemple ::

source: If the ``freeze_support()`` line is omitted then trying to run the frozen executable will raise :exc:`RuntimeError`.
fr: Si la ligne ``freeze_support()`` est omise, alors tenter de lancer l'exécutable gelé lèvera une :exc:`RuntimeError`.

source: Calling ``freeze_support()`` has no effect when invoked on any operating system other than Windows. In addition, if the module is being run normally by the Python interpreter on Windows (the program has not been frozen), then ``freeze_support()`` has no effect.
fr: Appeler ``freeze_support()`` n'a pas d'effet quand elle est invoquée sur un système d'exploitation autre que Windows. De plus, si le module est lancé normalement par l'interpréteur Python sous Windows (le programme n'a pas été gelé), alors ``freeze_support()`` n'a pas d'effet.

source: Returns a list of the supported start methods, the first of which is the default. The possible start methods are ``'fork'``, ``'spawn'`` and ``'forkserver'``. On Windows only ``'spawn'`` is available. On Unix ``'fork'`` and ``'spawn'`` are always supported, with ``'fork'`` being the default.
fr: Renvoie la liste des méthodes de démarrage supportées, la première étant celle par défaut. Les méthodes de démarrage possibles sont ``'fork'``, ``'spawn'`` et ``'forkserver'``. Sous Windows seule ``'spawn'`` est disponible. Sous Unix ``'fork'`` et ``'spawn'`` sont disponibles, ``'fork'`` étant celle par défaut.

source: Return a context object which has the same attributes as the :mod:`multiprocessing` module.
fr: Renvoie un contexte ayant les mêmes attributs que le module :mod:`multiprocessing`.

source: If *method* is ``None`` then the default context is returned. Otherwise *method* should be ``'fork'``, ``'spawn'``, ``'forkserver'``. :exc:`ValueError` is raised if the specified start method is not available.
fr: Si *method* est ``None`` le contexte par défaut est renvoyé. Sinon *method* doit valoir ``'fork'``, ``'spawn'`` ou ``'forkserver'``. Une :exc:`ValueError` est levée si la méthode de démarrage spécifiée n'est pas disponible.

source: Return the name of start method used for starting processes.
fr: Renvoie le nom de la méthode de démarrage utilisée pour démarrer le processus.

source: If the start method has not been fixed and *allow_none* is false, then the start method is fixed to the default and the name is returned. If the start method has not been fixed and *allow_none* is true then ``None`` is returned.
fr: Si le nom de la méthode n'a pas été fixé et que *allow_none* est faux, alors la méthode de démarrage est réglée à celle par défaut et son nom est renvoyé. Si la méthode n'a pas été fixée et que *allow_none* est vrai, ``None`` est renvoyé.

source: The return value can be ``'fork'``, ``'spawn'``, ``'forkserver'`` or ``None``. ``'fork'`` is the default on Unix, while ``'spawn'`` is the default on Windows.
fr: La valeur de retour peut être ``'fork'``, ``'spawn'``, ``'forkserver'`` ou ``None``. ``'fork'`` est la valeur par défaut sous Unix, ``'spawn'`` est celle sous Windows.

source: Sets the path of the Python interpreter to use when starting a child process. (By default :data:`sys.executable` is used). Embedders will probably need to do some thing like ::
fr: Définit le chemin de l'interpréteur Python à utiliser pour démarrer un processus fils. (Par défaut :data:`sys.executable` est utilisé). Les intégrateurs devront probablement faire quelque chose comme ::

source: before they can create child processes.
fr: avant de pouvoir créer des processus fils.

source: Now supported on Unix when the ``'spawn'`` start method is used.
fr: Maintenant supporté sous Unix quand la méthode de démarrage ``'spawn'`` est utilisée.

source: Set the method which should be used to start child processes. *method* can be ``'fork'``, ``'spawn'`` or ``'forkserver'``.
fr: Règle la méthode qui doit être utilisée pour démarrer un processus fils. *method* peut être ``'fork'``, ``'spawn'`` ou ``'forkserver'``.

source: Note that this should be called at most once, and it should be protected inside the ``if __name__ == '__main__'`` clause of the main module.
fr: Notez que cette fonction ne devrait être appelée qu'une fois au plus, et l'appel devrait être protégé à l'intérieur d'une clause ``if __name__ == '__main__'`` dans le module principal.

source: :mod:`multiprocessing` contains no analogues of :func:`threading.active_count`, :func:`threading.enumerate`, :func:`threading.settrace`, :func:`threading.setprofile`, :class:`threading.Timer`, or :class:`threading.local`.
fr: :mod:`multiprocessing` ne contient pas d'analogues à :func:`threading.active_count`, :func:`threading.enumerate`, :func:`threading.settrace`, :func:`threading.setprofile`, :class:`threading.Timer`, ou :class:`threading.local`.

source: Connection Objects
fr: Objets de connexions

source: Connection objects allow the sending and receiving of picklable objects or strings. They can be thought of as message oriented connected sockets.
fr: Les objets de connexion autorisent l'envoi et la réception d'objets sérialisables ou de chaînes de caractères. Ils peuvent être vus comme des interfaces de connexion (*sockets*) connectées orientées messages.

source: Connection objects are usually created using :func:`Pipe <multiprocessing.Pipe>` -- see also :ref:`multiprocessing-listeners-clients`.
fr: Les objets de connexion sont habituellement créés via :func:`Pipe <multiprocessing.Pipe>` -- voir aussi :ref:`multiprocessing-listeners-clients`.

source: Send an object to the other end of the connection which should be read using :meth:`recv`.
fr: Envoie un objet sur l'autre bout de la connexion, qui devra être lu avec :meth:`recv`.

source: The object must be picklable. Very large pickles (approximately 32 MiB+, though it depends on the OS) may raise a :exc:`ValueError` exception.
fr: L'objet doit être sérialisable. Les *pickles* très larges (approximativement 32 Mo+, bien que cela dépende de l'OS) pourront lever une exception :exc:`ValueError`.

source: Return an object sent from the other end of the connection using :meth:`send`. Blocks until there is something to receive. Raises :exc:`EOFError` if there is nothing left to receive and the other end was closed.
fr: Renvoie un objet envoyé depuis l'autre bout de la connexion en utilisant :meth:`send`. Bloque jusqu'à ce que quelque chose soit reçu. Lève une :exc:`EOFError` s'il n'y a plus rien à recevoir et que l'autre bout a été fermé.

source: Return the file descriptor or handle used by the connection.
fr: Renvoie le descripteur de fichier ou identifiant utilisé par la connexion.

source: Close the connection.
fr: Ferme la connexion.

source: This is called automatically when the connection is garbage collected.
fr: Elle est appelée automatiquement quand la connexion est collectée par le ramasse-miettes.

source: Return whether there is any data available to be read.
fr: Renvoie vrai ou faux selon si des données sont disponibles à la lecture.

source: If *timeout* is not specified then it will return immediately. If *timeout* is a number then this specifies the maximum time in seconds to block. If *timeout* is ``None`` then an infinite timeout is used.
fr: Si *timeout* n'est pas spécifié la méthode renverra immédiatement. Si *timeout* est un nombre alors il spécifie le temps maximum de blocage en secondes. Si *timeout* est ``None``, un temps d'attente infini est utilisé.

source: Note that multiple connection objects may be polled at once by using :func:`multiprocessing.connection.wait`.
fr: Notez que plusieurs objets de connexions peuvent être attendus en même temps à l'aide de :func:`multiprocessing.connection.wait`.

source: Send byte data from a :term:`bytes-like object` as a complete message.
fr: Envoie des données binaires depuis un :term:`bytes-like object` comme un message complet.

source: If *offset* is given then data is read from that position in *buffer*. If *size* is given then that many bytes will be read from buffer. Very large buffers (approximately 32 MiB+, though it depends on the OS) may raise a :exc:`ValueError` exception
fr: Si *offset* est fourni, les données sont lues depuis cette position dans le tampon *buffer*. Si *size* est fourni, il indique le nombre d'octets qui seront lus depuis *buffer*. Les tampons très larges (approximativement 32 MiB+, bien que cela dépende de l'OS) pourront lever une exception :exc:`ValueError`.

source: Return a complete message of byte data sent from the other end of the connection as a string. Blocks until there is something to receive. Raises :exc:`EOFError` if there is nothing left to receive and the other end has closed.
fr: Renvoie un message complet de données binaires envoyées depuis l'autre bout de la connexion comme une chaîne de caractères. Bloque jusqu'à ce qu'il y ait quelque chose à recevoir. Lève une :exc:`EOFError` s'il ne reste rien à recevoir et que l'autre côté de la connexion a été fermé.

source: If *maxlength* is specified and the message is longer than *maxlength* then :exc:`OSError` is raised and the connection will no longer be readable.
fr: Si *maxlength* est précisé que que le message est plus long que *maxlength* alors une :exc:`OSError` est levée et la connexion n'est plus lisible.

source: This function used to raise :exc:`IOError`, which is now an alias of :exc:`OSError`.
fr: Cette fonction levait auparavant une :exc:`IOError`, qui est maintenant un alias pour :exc:`OSError`.

source: Read into *buffer* a complete message of byte data sent from the other end of the connection and return the number of bytes in the message. Blocks until there is something to receive. Raises :exc:`EOFError` if there is nothing left to receive and the other end was closed.
fr: Lit et stocke dans *buffer* un message complet de données binaires envoyées depuis l'autre bout de la connexion et renvoie le nombre d'octets du message. Bloque jusqu'à ce qu'il y ait quelque chose à recevoir. Lève une :exc:`EOFError` s'il ne reste rien à recevoir et que l'autre côté de la connexion a été fermé.

source: *buffer* must be a writable :term:`bytes-like object`. If *offset* is given then the message will be written into the buffer from that position. Offset must be a non-negative integer less than the length of *buffer* (in bytes).
fr: *buffer* doit être un :term:`bytes-like object` accessible en écriture. Si *offset* est donné, le message sera écrit dans le tampon à partir de cette position. *offset* doit être un entier positif, inférieur à la taille de *buffer* (en octets).

source: If the buffer is too short then a :exc:`BufferTooShort` exception is raised and the complete message is available as ``e.args[0]`` where ``e`` is the exception instance.
fr: Si le tampon est trop petit une exception :exc:`BufferTooShort` est levée et le message complet est accessible via ``e.args[0]`` où ``e`` est l'instance de l'exception.

source: Connection objects themselves can now be transferred between processes using :meth:`Connection.send` and :meth:`Connection.recv`.
fr: Les objets de connexions eux-mêmes peuvent maintenant être transférés entre les processus en utilisant :meth:`Connection.send` et :meth:`Connection.recv`.

source: Connection objects now support the context management protocol -- see :ref:`typecontextmanager`. :meth:`~contextmanager.__enter__` returns the connection object, and :meth:`~contextmanager.__exit__` calls :meth:`close`.
fr: Les objets de connexions supportent maintenant le protocole des gestionnaires de contexte -- voir :ref:`typecontextmanager`. :meth:`~contextmanager.__enter__` renvoie l'objet de connexion, et :meth:`~contextmanager.__exit__` appelle :meth:`close`.

source: For example:
fr: Par exemple :

source: The :meth:`Connection.recv` method automatically unpickles the data it receives, which can be a security risk unless you can trust the process which sent the message.
fr: La méthode :meth:`Connection.recv` désérialise automatiquement les données qu'elle reçoit, ce qui peut être un risque de sécurité à moins que vous ne fassiez réellement confiance au processus émetteur du message.

source: Therefore, unless the connection object was produced using :func:`Pipe` you should only use the :meth:`~Connection.recv` and :meth:`~Connection.send` methods after performing some sort of authentication. See :ref:`multiprocessing-auth-keys`.
fr: Par conséquent, à moins que l'objet de connexion soit instancié par :func:`Pipe`, vous ne devriez uniquement utiliser les méthodes :meth:`~Connection.recv` et :meth:`~Connection.send` après avoir effectué une quelconque forme d'authentification. Voir :ref:`multiprocessing-auth-keys`.

source: If a process is killed while it is trying to read or write to a pipe then the data in the pipe is likely to become corrupted, because it may become impossible to be sure where the message boundaries lie.
fr: Si un processus est tué pendant qu'il essaye de lire ou écrire sur le tube, alors les données du tube ont des chances d'être corrompues, parce qu'il devient impossible d'être sûr d'où se trouvent les bornes du message.

source: Synchronization primitives
fr: Primitives de synchronisation

source: Generally synchronization primitives are not as necessary in a multiprocess program as they are in a multithreaded program. See the documentation for :mod:`threading` module.
fr: Généralement les primitives de synchronisation ne sont pas nécessaire dans un programme multi-processus comme elles le sont dans un programme multi-fils d'exécution. Voir la documentation du module :mod:`threading`.

source: Note that one can also create synchronization primitives by using a manager object -- see :ref:`multiprocessing-managers`.
fr: Notez que vous pouvez aussi créer des primitives de synchronisation en utilisant un objet gestionnaire -- voir :ref:`multiprocessing-managers`.

source: A barrier object: a clone of :class:`threading.Barrier`.
fr: Un objet barrière : un clone de :class:`threading.Barrier`.

source: A bounded semaphore object: a close analog of :class:`threading.BoundedSemaphore`.
fr: Un objet sémaphore lié : un analogue proche de :class:`threading.BoundedSemaphore`.

source: A solitary difference from its close analog exists: its ``acquire`` method's first argument is named *block*, as is consistent with :meth:`Lock.acquire`.
fr: Une seule différence existe avec son proche analogue : le premier argument de sa méthode ``acquire`` est appelé *block*, pour la cohérence avec :meth:`Lock.acquire`.

source: On Mac OS X, this is indistinguishable from :class:`Semaphore` because ``sem_getvalue()`` is not implemented on that platform.
fr: Sur Mac OS X, elle n'est pas distinguable de la classe :class:`Semaphore` parce que ``sem_getvalue()`` n'est pas implémentée sur cette plateforme.

source: A condition variable: an alias for :class:`threading.Condition`.
fr: Une variable conditionnelle : un alias pour :class:`threading.Condition`.

source: If *lock* is specified then it should be a :class:`Lock` or :class:`RLock` object from :mod:`multiprocessing`.
fr: Si *lock* est spécifié il doit être un objet :class:`Lock` ou :class:`RLock` du module :mod:`multiprocessing`.

source: The :meth:`~threading.Condition.wait_for` method was added.
fr: La méthode :meth:`~threading.Condition.wait_for` a été ajoutée.

source: A clone of :class:`threading.Event`.
fr: Un clone de :class:`threading.Event`.

source: A non-recursive lock object: a close analog of :class:`threading.Lock`. Once a process or thread has acquired a lock, subsequent attempts to acquire it from any process or thread will block until it is released; any process or thread may release it. The concepts and behaviors of :class:`threading.Lock` as it applies to threads are replicated here in :class:`multiprocessing.Lock` as it applies to either processes or threads, except as noted.
fr: Un verrou non récursif : un analogue proche de :class:`threading.Lock`. Une fois que le processus ou le fil d'exécution a acquis un verrou, les tentatives suivantes d'acquisition depuis n'importe quel processus ou fil d'exécution bloqueront jusqu'à ce qu'il soit libéré ; n'importe quel processus ou fil peut le libérer. Les concepts et comportements de :class:`threading.Lock` qui s'appliquent aux fils d'exécution sont répliqués ici dans :class:`multiprocessing.Lock` et s'appliquent aux processus et aux fils d'exécution, à l'exception de ce qui est indiqué.

source: Note that :class:`Lock` is actually a factory function which returns an instance of ``multiprocessing.synchronize.Lock`` initialized with a default context.
fr: Notez que :class:`Lock` est en fait une fonction *factory* qui renvoie une instance de ``multiprocessing.synchronize.Lock`` initialisée avec un contexte par défaut.

source: :class:`Lock` supports the :term:`context manager` protocol and thus may be used in :keyword:`with` statements.
fr: :class:`Lock` supporte le protocole :term:`context manager` et peut ainsi être utilisé avec une instruction :keyword:`with`.

source: Acquire a lock, blocking or non-blocking.
fr: Acquiert un verrou, bloquant ou non bloquant.
