Repository: python/python-docs-fr
Catalog: library/multiprocessing.po
Languages: fr

source: When one uses :meth:`Connection.recv <Connection.recv>`, the data received is automatically unpickled. Unfortunately unpickling data from an untrusted source is a security risk. Therefore :class:`Listener` and :func:`Client` use the :mod:`hmac` module to provide digest authentication.
fr: Quand :meth:`Connection.recv <Connection.recv>` est utilisée, les données reçues sont automatiquement désérialisées par *pickle*. Malheureusement désérialiser des données depuis une source non sûre constitue un risque de sécurité. Par conséquent :class:`Listener` et :func:`Client` utilisent le module :mod:`hmac` pour fournir une authentification par condensat.

source: An authentication key is a byte string which can be thought of as a password: once a connection is established both ends will demand proof that the other knows the authentication key. (Demonstrating that both ends are using the same key does **not** involve sending the key over the connection.)
fr: Une clé d'authentification est une chaîne d'octets qui peut être vue comme un mot de passe : quand une connexion est établie, les deux interlocuteurs vont demander à l'autre une preuve qu'il connaît la clé d'authentification. (Démontrer que les deux utilisent la même clé n'implique **pas** d'échanger la clé sur la connexion.)

source: If authentication is requested but no authentication key is specified then the return value of ``current_process().authkey`` is used (see :class:`~multiprocessing.Process`). This value will be automatically inherited by any :class:`~multiprocessing.Process` object that the current process creates. This means that (by default) all processes of a multi-process program will share a single authentication key which can be used when setting up connections between themselves.
fr: Si l'authentification est requise et qu'aucune clé n'est spécifiée alors la valeur de retour de ``current_process().authkey`` est utilisée (voir :class:`~multiprocessing.Process`). Celle valeur est automatiquement héritée par tout objet :class:`~multiprocessing.Process` créé par le processus courant. Cela signifie que (par défaut) tous les processus d'un programme multi-processus partageront une clé d'authentification unique qui peut être utilisée pour mettre en place des connexions entre-eux.

source: Suitable authentication keys can also be generated by using :func:`os.urandom`.
fr: Des clés d'authentification adaptées peuvent aussi être générées par :func:`os.urandom`.

source: Logging
fr: Journalisation

source: Some support for logging is available. Note, however, that the :mod:`logging` package does not use process shared locks so it is possible (depending on the handler type) for messages from different processes to get mixed up.
fr: Un certain support de la journalisation est disponible. Notez cependant que le le paquet :mod:`logging` n'utilise pas de verrous partagés entre les processus et il est donc possible (dépendant du type de gestionnaire) que les messages de différents processus soient mélangés.

source: Returns the logger used by :mod:`multiprocessing`. If necessary, a new one will be created.
fr: Renvoie le journaliseur utilisé par :mod:`multiprocessing`. Si nécessaire, un nouveau sera créé.

source: When first created the logger has level :data:`logging.NOTSET` and no default handler. Messages sent to this logger will not by default propagate to the root logger.
fr: À sa première création le journaliseur a pour niveau :data:`logging.NOTSET` et pas de gestionnaire par défaut. Les messages envoyés à ce journaliseur ne seront pas propagés par défaut au journaliseur principal.

source: Note that on Windows child processes will only inherit the level of the parent process's logger -- any other customization of the logger will not be inherited.
fr: Notez que sous Windows les processus fils n'hériteront que du niveau du journaliseur du processus parent -- toute autre personnalisation du journaliseur ne sera pas héritée.

source: This function performs a call to :func:`get_logger` but in addition to returning the logger created by get_logger, it adds a handler which sends output to :data:`sys.stderr` using format ``'[%(levelname)s/%(processName)s] %(message)s'``.
fr: Cette fonction effectue un appel à :func:`get_logger` mais en plus de renvoyer le journaliseur créé par *get_logger*, elle ajoute un gestionnaire qui envoie la sortie sur :data:`sys.stderr` en utilisant le format ``'[%(levelname)s/%(processName)s] %(message)s'``.

source: Below is an example session with logging turned on::
fr: L'exemple ci-dessous présente une session avec la journalisation activée ::

source: For a full table of logging levels, see the :mod:`logging` module.
fr: Pour un tableau complet des niveaux de journalisation, voir le module :mod:`logging`.

source: The :mod:`multiprocessing.dummy` module
fr: Le module :mod:`multiprocessing.dummy`

source: :mod:`multiprocessing.dummy` replicates the API of :mod:`multiprocessing` but is no more than a wrapper around the :mod:`threading` module.
fr: :mod:`multiprocessing.dummy` réplique toute l'API de :mod:`multiprocessing` mais n'est rien de plus qu'un *wrapper* autour du module :mod:`threading`.

source: Programming guidelines
fr: Lignes directrices de programmation

source: There are certain guidelines and idioms which should be adhered to when using :mod:`multiprocessing`.
fr: Il y a certaines lignes directrices et idiomes auxquels il faut adhérer en utilisant :mod:`multiprocessing`.

source: All start methods
fr: Toutes les méthodes de démarrage

source: The following applies to all start methods.
fr: Les règles suivantes s'appliquent aux méthodes de démarrage.

source: Avoid shared state
fr: Éviter les états partagés

source: As far as possible one should try to avoid shifting large amounts of data between processes.
fr: Autant que possible, vous devriez éviter de déplacer de larges données entre les processus.

source: It is probably best to stick to using queues or pipes for communication between processes rather than using the lower level synchronization primitives.
fr: Il est probablement meilleur de s'en tenir à l'utilisation de queues et tubes pour la communication entre processus plutôt que d'utiliser des primitives de synchronisation plus bas-niveau.

source: Picklability
fr: Sérialisation

source: Ensure that the arguments to the methods of proxies are picklable.
fr: Assurez-vous que les arguments passés aux méthodes des mandataires soient sérialisables (*pickables*).

source: Thread safety of proxies
fr: Sûreté des mandataires à travers les fils d'exécution

source: Do not use a proxy object from more than one thread unless you protect it with a lock.
fr: N'utilisez pas d'objet mandataire depuis plus d'un fil d'exécution à moins que vous ne le protégiez avec un verrou.

source: (There is never a problem with different processes using the *same* proxy.)
fr: (Il n'y a jamais de problème avec plusieurs processus utilisant un *même* mandataire.)

source: Joining zombie processes
fr: Attendre les processus zombies

source: On Unix when a process finishes but has not been joined it becomes a zombie. There should never be very many because each time a new process starts (or :func:`~multiprocessing.active_children` is called) all completed processes which have not yet been joined will be joined. Also calling a finished process's :meth:`Process.is_alive <multiprocessing.Process.is_alive>` will join the process. Even so it is probably good practice to explicitly join all the processes that you start.
fr: Sous Unix quand un processus se termine mais n'est pas attendu, il devient un zombie. Il ne devrait jamais y en avoir beaucoup parce que chaque fois qu'un nouveau processus démarre (ou que :func:`~multiprocessing.active_children` est appelée) tous les processus complétés qui n'ont pas été attendus le seront. Aussi appeler la méthode :meth:`Process.is_alive <multiprocessing.Process.is_alive>` d'un processus terminé attendra le processus. Toutefois il est probablement une bonne pratique d'attendre explicitement tous les processus que vous démarrez.

source: Better to inherit than pickle/unpickle
fr: Préférez hériter que sérialiser/désérialiser

source: When using the *spawn* or *forkserver* start methods many types from :mod:`multiprocessing` need to be picklable so that child processes can use them. However, one should generally avoid sending shared objects to other processes using pipes or queues. Instead you should arrange the program so that a process which needs access to a shared resource created elsewhere can inherit it from an ancestor process.
fr: Quand vous utilisez les méthodes de démarrage *spawn* ou *forkserver*, de nombreux types de :mod:`multiprocessing` nécessitent d'être sérialisées pour que les processus enfants puissent les utiliser. Cependant, il faut généralement éviter d'envoyer des objets partagés aux autres processus en utilisant des tubes ou des queues. Vous devriez plutôt vous arranger pour qu'un processus qui nécessite l'accès à une ressource partagée créée autre part qu'il en hérite depuis un de ses processus ancêtres.

source: Avoid terminating processes
fr: Éviter de terminer les processus

source: Using the :meth:`Process.terminate <multiprocessing.Process.terminate>` method to stop a process is liable to cause any shared resources (such as locks, semaphores, pipes and queues) currently being used by the process to become broken or unavailable to other processes.
fr: Utiliser la méthode :meth:`Process.terminate <multiprocessing.Process.terminate>` pour stopper un processus risque de casser ou de rendre indisponible aux autres processus des ressources partagées (comme des verrous, sémaphores, tubes et queues) actuellement utilisée par le processus.

source: Therefore it is probably best to only consider using :meth:`Process.terminate <multiprocessing.Process.terminate>` on processes which never use any shared resources.
fr: Il est donc probablement préférable de n'utiliser :meth:`Process.terminate <multiprocessing.Process.terminate>` que sur les processus qui n'utilisent jamais de ressources partagées.

source: Joining processes that use queues
fr: Attendre les processus qui utilisent des queues

source: Bear in mind that a process that has put items in a queue will wait before terminating until all the buffered items are fed by the "feeder" thread to the underlying pipe. (The child process can call the :meth:`Queue.cancel_join_thread <multiprocessing.Queue.cancel_join_thread>` method of the queue to avoid this behaviour.)
fr: Gardez à l'esprit qu'un processus qui a placé des éléments dans une queue attendra que tous les éléments mis en tampon soient consommés par le fil d'exécution « consommateur » du tube sous-jacent avant de se terminer. (Le processus enfant peut appeler la méthode :meth:`Queue.cancel_join_thread <multiprocessing.Queue.cancel_join_thread>` de la queue pour éviter ce comportement.)

source: This means that whenever you use a queue you need to make sure that all items which have been put on the queue will eventually be removed before the process is joined. Otherwise you cannot be sure that processes which have put items on the queue will terminate. Remember also that non-daemonic processes will be joined automatically.
fr: Cela signifie que chaque fois que vous utilisez une queue vous devez vous assurer que tous les éléments qui y ont été placés seront effectivement supprimés avant que le processus ne soit attendu. Autrement vous ne pouvez pas être sûr que les processus qui ont placé des éléments dans la queue se termineront. Souvenez-vous aussi que tous les processus non *daemons* seront attendus automatiquement.

source: An example which will deadlock is the following::
fr: L'exemple suivant provoquera un interblocage ::

source: A fix here would be to swap the last two lines (or simply remove the ``p.join()`` line).
fr: Une solution ici serait d'intervertir les deux dernières lignes (ou simplement supprimer la ligne ``p.join()``).

source: Explicitly pass resources to child processes
fr: Passer explicitement les ressources aux processus fils

source: On Unix using the *fork* start method, a child process can make use of a shared resource created in a parent process using a global resource. However, it is better to pass the object as an argument to the constructor for the child process.
fr: Sous Unix en utilisant la méthode de démarrage *fork*, un processus fils peut utiliser une ressource partagée créée par un processus parent en utilisant une ressource globale. Cependant, il est préférable de passer l'objet en argument au constructeur du processus fils.

source: Apart from making the code (potentially) compatible with Windows and the other start methods this also ensures that as long as the child process is still alive the object will not be garbage collected in the parent process. This might be important if some resource is freed when the object is garbage collected in the parent process.
fr: En plus de rendre le code (potentiellement) compatible avec Windows et les autres méthodes de démarrage, cela assure aussi que tant que le processus fils est en vie, l'objet ne sera pas collecté par le ramasse-miettes du processus parent. Cela peut être important si certaines ressources sont libérées quand l'objet est collecté par le ramasse-miettes du processus parent.

source: So for instance ::
fr: Donc par exemple ::

source: should be rewritten as ::
fr: devrait être réécrit comme ::

source: Beware of replacing :data:`sys.stdin` with a "file like object"
fr: Faire attention à remplacer :data:`sys.stdin` par un objet « *file-like* »

source: :mod:`multiprocessing` originally unconditionally called::
fr: À l'origine, :mod:`multiprocessing` appelait inconditionnellement ::

source: in the :meth:`multiprocessing.Process._bootstrap` method --- this resulted in issues with processes-in-processes. This has been changed to::
fr: dans la méthode :meth:`multiprocessing.Process._bootstrap` --- cela provoquait des problèmes avec les processus imbriqués. Cela peut être changé en ::

source: Which solves the fundamental issue of processes colliding with each other resulting in a bad file descriptor error, but introduces a potential danger to applications which replace :func:`sys.stdin` with a "file-like object" with output buffering. This danger is that if multiple processes call :meth:`~io.IOBase.close()` on this file-like object, it could result in the same data being flushed to the object multiple times, resulting in corruption.
fr: Qui résout le problème fondamental des collisions entre processus provoquant des erreurs de mauvais descripteurs de fichiers, mais introduit un potentiel danger pour les applications qui remplacent :func:`sys.stdin` avec un « *file-like object* » ayant une sortie *bufferisée*. Ce danger est que si plusieurs processus appellent :meth:`~io.IOBase.close()` sur cet objet *file-like*, cela peut amener les données à être transmises à l'objet à plusieurs reprises, résultant en une corruption.

source: If you write a file-like object and implement your own caching, you can make it fork-safe by storing the pid whenever you append to the cache, and discarding the cache when the pid changes. For example::
fr: Si vous écrivez un objet *file-like* et implémentez votre propre cache, vous pouvez le rendre sûr pour les *forks* en stockant le *pid* chaque fois que vous ajoutez des données au cache, et annulez le cache quand le *pip* change. Par exemple ::

source: For more information, see :issue:`5155`, :issue:`5313` and :issue:`5331`
fr: Pour plus d'informations, voir :issue:`5155`, :issue:`5313` et :issue:`5331`

source: The *spawn* and *forkserver* start methods
fr: Les méthodes de démarrage *spawn* et *forkserver*

source: There are a few extra restriction which don't apply to the *fork* start method.
fr: Certaines restrictions ne s'appliquent pas à la méthode de démarrage *fork*.

source: More picklability
fr: Plus de sérialisation

source: Ensure that all arguments to :meth:`Process.__init__` are picklable. Also, if you subclass :class:`~multiprocessing.Process` then make sure that instances will be picklable when the :meth:`Process.start <multiprocessing.Process.start>` method is called.
fr: Assurez-vous que tous les argument de :meth:`Process.__init__` sont sérialisables avec *pickle*. Aussi, si vous héritez de :class:`~multiprocessing.Process`, assurez-vous que toutes les instances sont sérialisables quand la méthode :meth:`Process.start <multiprocessing.Process.start>` est appelée.

source: Global variables
fr: Variables globales

source: Bear in mind that if code run in a child process tries to access a global variable, then the value it sees (if any) may not be the same as the value in the parent process at the time that :meth:`Process.start <multiprocessing.Process.start>` was called.
fr: Gardez en tête que si le code exécuté dans un processus fils essaie d'accéder à une variable globale, alors la valeur qu'il voit (s'il y en a une) pourrait ne pas être la même que la valeur du processus parent au moment même où :meth:`Process.start <multiprocessing.Process.start>` est appelée.

source: However, global variables which are just module level constants cause no problems.
fr: Cependant, les variables globales qui sont juste des constantes de modules ne posent pas de problèmes.

source: Safe importing of main module
fr: Importation sûre du module principal

source: Make sure that the main module can be safely imported by a new Python interpreter without causing unintended side effects (such a starting a new process).
fr: Assurez-vous que le module principal peut être importé en toute sécurité par un nouvel interpréteur Python sans causer d'effets de bord inattendus (comme le démarrage d'un nouveau processus).

source: For example, using the *spawn* or *forkserver* start method running the following module would fail with a :exc:`RuntimeError`::
fr: Par exemple, utiliser la méthode de démarrage *spawn* ou *forkserver* pour lancer le module suivant échouerait avec une :exc:`RuntimeError` ::

source: Instead one should protect the "entry point" of the program by using ``if __name__ == '__main__':`` as follows::
fr: Vous devriez plutôt protéger le « point d'entrée » du programme en utilisant ``if __name__ == '__main__':`` comme suit ::

source: (The ``freeze_support()`` line can be omitted if the program will be run normally instead of frozen.)
fr: (La ligne ``freeze_support()`` peut être omise si le programme est uniquement lancé normalement et pas gelé.)

source: This allows the newly spawned Python interpreter to safely import the module and then run the module's ``foo()`` function.
fr: Cela permet aux interpréteurs Python fraîchement instanciés d'importer en toute sécurité le module et d'exécution ensuite la fonction ``foo()``.

source: Similar restrictions apply if a pool or manager is created in the main module.
fr: Des restrictions similaires s'appliquent si une *pool* ou un gestionnaire est créé dans le module principal.

source: Examples
fr: Exemples

source: Demonstration of how to create and use customized managers and proxies:
fr: Démonstration de comment créer et utiliser des gestionnaires et mandataires personnalisés :

source: Using :class:`~multiprocessing.pool.Pool`:
fr: En utilisant :class:`~multiprocessing.pool.Pool` :

source: An example showing how to use queues to feed tasks to a collection of worker processes and collect the results:
fr: Un exemple montrant comment utiliser des queues pour alimenter en tâches une collection de processus *workers* et collecter les résultats :
