Repository: python/python-docs-fr
Catalog: library/multiprocessing.po
Languages: fr

source: A process cannot join itself because this would cause a deadlock. It is an error to attempt to join a process before it has been started.
fr: Un processus ne peut pas s'attendre lui-même car cela causerait un interblocage. C'est une erreur d'essayer d'attendre un processus avant qu'il ne soit démarré.

source: The process's name. The name is a string used for identification purposes only. It has no semantics. Multiple processes may be given the same name.
fr: Le nom du processus. Le nom est une chaîne de caractères utilisée uniquement pour l'identification du processus. Il n'a pas de sémantique. Plusieurs processus peuvent avoir le même nom.

source: The initial name is set by the constructor. If no explicit name is provided to the constructor, a name of the form 'Process-N\ :sub:`1`:N\ :sub:`2`:...:N\ :sub:`k`' is constructed, where each N\ :sub:`k` is the N-th child of its parent.
fr: Le nom initial est déterminé par le constructeur. Si aucun nom explicite n'est fourni au constructeur, un nom de la forme « Process-N\ :sub:`1`:N\ :sub:`2`:...:N\ :sub:`k` » est construit, où chaque N\ :sub:`k` est le N\ :sup:`e` enfant de son parent.

source: Return whether the process is alive.
fr: Renvoie vrai si le processus est en vie, faux sinon.

source: Roughly, a process object is alive from the moment the :meth:`start` method returns until the child process terminates.
fr: Grossièrement, un objet processus est en vie depuis le moment où la méthode :meth:`start` finit de s'exécuter jusqu'à ce que le processus fils se termine.

source: The process's daemon flag, a Boolean value. This must be set before :meth:`start` is called.
fr: L'option *daemon* du processus, une valeur booléenne. L'option doit être réglée avant que la méthode :meth:`start` ne soit appelée.

source: The initial value is inherited from the creating process.
fr: La valeur initiale est héritée par le processus créateur.

source: When a process exits, it attempts to terminate all of its daemonic child processes.
fr: Quand un processus se ferme, il tente de terminer tous ses processus enfants *daemon*.

source: Note that a daemonic process is not allowed to create child processes. Otherwise a daemonic process would leave its children orphaned if it gets terminated when its parent process exits. Additionally, these are **not** Unix daemons or services, they are normal processes that will be terminated (and not joined) if non-daemonic processes have exited.
fr: Notez qu'un processus *daemon* n'est pas autorisé à créer des processus fils. Sinon un processus *daemon* laisserait ses enfants orphelins lorsqu'il se termine par la fermeture de son parent. De plus, ce **ne sont pas** des *daemons* ou services Unix, ce sont des processus normaux qui seront terminés (et non attendus) si un processus non *daemon* se ferme.

source: In addition to the :class:`threading.Thread` API, :class:`Process` objects also support the following attributes and methods:
fr: En plus de l'API :class:`threading.Thread`, les objets :class:`Process` supportent aussi les attributs et méthodes suivants :

source: Return the process ID. Before the process is spawned, this will be ``None``.
fr: Renvoie l'ID du processus. Avant que le processus ne soit lancé, la valeur est ``None``.

source: The child's exit code. This will be ``None`` if the process has not yet terminated. A negative value *-N* indicates that the child was terminated by signal *N*.
fr: Le code de fermeture de l'enfant. La valeur est ``None`` si le processus ne s'est pas encore terminé. Une valeur négative *-N* indique que le fils a été terminé par un signal *N*.

source: The process's authentication key (a byte string).
fr: La clé d'authentification du processus (une chaîne d'octets).

source: When :mod:`multiprocessing` is initialized the main process is assigned a random string using :func:`os.urandom`.
fr: Quand :mod:`multiprocessing` est initialisé, une chaîne aléatoire est assignée au processus principal, en utilisant :func:`os.urandom`.

source: When a :class:`Process` object is created, it will inherit the authentication key of its parent process, although this may be changed by setting :attr:`authkey` to another byte string.
fr: Quand un objet :class:`Process` est créé, il hérité de la clé d'authentification de son parent, bien que cela puisse être changé à l'aide du paramètre :attr:`authkey` pour une autre chaîne d'octets.

source: See :ref:`multiprocessing-auth-keys`.
fr: Voir :ref:`multiprocessing-auth-keys`.

source: A numeric handle of a system object which will become "ready" when the process ends.
fr: Un identifiant numérique de l'objet système qui devient « prêt » quand le processus se termine.

source: You can use this value if you want to wait on several events at once using :func:`multiprocessing.connection.wait`. Otherwise calling :meth:`join()` is simpler.
fr: Vous pouvez utiliser cette valeur si vous voulez attendre plusieurs événements à la fois en utilisant :func:`multiprocessing.connection.wait`. Autrement appeler :meth:`join()` est plus simple.

source: On Windows, this is an OS handle usable with the ``WaitForSingleObject`` and ``WaitForMultipleObjects`` family of API calls. On Unix, this is a file descriptor usable with primitives from the :mod:`select` module.
fr: Sous Windows, c'est un mécanisme de l'OS utilisable avec les familles d'appels API ``WaitForSingleObject`` et ``WaitForMultipleObjects``. Sous Unix, c'est un descripteur de fichier utilisable avec les primitives sur module :mod:`select`.

source: Terminate the process. On Unix this is done using the ``SIGTERM`` signal; on Windows :c:func:`TerminateProcess` is used. Note that exit handlers and finally clauses, etc., will not be executed.
fr: Termine le processus. Sous Unix cela est réalisé à l'aide d'un signal ``SIGTERM``, sous Windows :c:func:`TerminateProcess` est utilisé. Notez que les gestionnaires de sortie, les clauses `finally` etc. ne sont pas exécutées.

source: Note that descendant processes of the process will *not* be terminated -- they will simply become orphaned.
fr: Notez que les descendants du processus ne *seront pas* terminés -- ils deviendront simplement orphelins.

source: If this method is used when the associated process is using a pipe or queue then the pipe or queue is liable to become corrupted and may become unusable by other process. Similarly, if the process has acquired a lock or semaphore etc. then terminating it is liable to cause other processes to deadlock.
fr: Si cette méthode est utilisée quand le processus associé utilise un tube ou une queue, alors le tube ou la queue sont susceptibles d'être corrompus et peuvent devenir inutilisables par les autres processus. De façon similaire, si le processus a acquis un verrou, un sémaphore ou autre, alors le terminer est susceptible de provoquer des blocages dans les autres processus.

source: Same as :meth:`terminate()` but using the ``SIGKILL`` signal on Unix.
fr: Identique à :meth:`terminate()` mais utilisant le signal ``SIGKILL`` sous Unix.

source: Close the :class:`Process` object, releasing all resources associated with it. :exc:`ValueError` is raised if the underlying process is still running. Once :meth:`close` returns successfully, most other methods and attributes of the :class:`Process` object will raise :exc:`ValueError`.
fr: Ferme l'objet :class:`Process`, libérant toutes les ressources qui lui sont associées. Une :exc:`ValueError` est levée si le processus sous-jacent tourne toujours. Une fois que :meth:`close` se termine avec succès, la plupart des autres méthodes et attributs des objets :class:`Process` lèveront une :exc:`ValueError`.

source: Note that the :meth:`start`, :meth:`join`, :meth:`is_alive`, :meth:`terminate` and :attr:`exitcode` methods should only be called by the process that created the process object.
fr: Notez que les méthodes :meth:`start`, :meth:`join`, :meth:`is_alive`, :meth:`terminate` et :attr:`exitcode` ne devraient être appelées que par le processus ayant créé l'objet *process*.

source: Example usage of some of the methods of :class:`Process`:
fr: Exemple d'utilisation de quelques méthodes de :class:`Process` :

source: The base class of all :mod:`multiprocessing` exceptions.
fr: La classe de base de toutes les exceptions de :mod:`multiprocessing`.

source: Exception raised by :meth:`Connection.recv_bytes_into()` when the supplied buffer object is too small for the message read.
fr: Exception levée par :meth:`Connection.recv_bytes_into()` quand l'objet tampon fourni est trop petit pour le message à lire.

source: If ``e`` is an instance of :exc:`BufferTooShort` then ``e.args[0]`` will give the message as a byte string.
fr: Si ``e`` est une instance de :exc:`BufferTooShort` alors ``e.args[0]`` donnera un message sous forme d'une chaîne d'octets.

source: Raised when there is an authentication error.
fr: Levée quand il y a une erreur d'authentification.

source: Raised by methods with a timeout when the timeout expires.
fr: Levée par les méthodes avec temps d'exécution limité, quand ce temps expire.

source: Pipes and Queues
fr: Tubes (*pipes*) et Queues

source: When using multiple processes, one generally uses message passing for communication between processes and avoids having to use any synchronization primitives like locks.
fr: Quand de multiples processus sont utilisés, de l'échange de messages est souvent mis en place pour la communication entre processus et éviter d'avoir à utiliser des primitives de synchronisation telles que des verrous.

source: For passing messages one can use :func:`Pipe` (for a connection between two processes) or a queue (which allows multiple producers and consumers).
fr: Pour échanger des messages vous pouvez utiliser un :func:`Pipe` (pour une connexion entre deux processus) ou une queue (qui autorise de multiples producteurs et consommateurs).

source: The :class:`Queue`, :class:`SimpleQueue` and :class:`JoinableQueue` types are multi-producer, multi-consumer :abbr:`FIFO (first-in, first-out)` queues modelled on the :class:`queue.Queue` class in the standard library. They differ in that :class:`Queue` lacks the :meth:`~queue.Queue.task_done` and :meth:`~queue.Queue.join` methods introduced into Python 2.5's :class:`queue.Queue` class.
fr: Les types :class:`Queue`, :class:`SimpleQueue` et :class:`JoinableQueue` sont des queues :abbr:`FIFO (first-in, first-out)` multi-producteurs et multi-consommateurs modelées sur la classe :class:`queue.Queue` de la bibliothèque standard. Elles diffèrent par l'absence dans :class:`Queue` des méthodes :meth:`~queue.Queue.task_done` et :meth:`~queue.Queue.join` introduites dans la classe :class:`queue.Queue` par Python 2.5.

source: If you use :class:`JoinableQueue` then you **must** call :meth:`JoinableQueue.task_done` for each task removed from the queue or else the semaphore used to count the number of unfinished tasks may eventually overflow, raising an exception.
fr: Si vous utilisez :class:`JoinableQueue` alors vous **devez** appeler :meth:`JoinableQueue.task_done` pour chaque tâche retirée de la queue, sans quoi le sémaphore utilisé pour compter le nombre de tâches non accomplies pourra éventuellement déborder, levant une exception.

source: Note that one can also create a shared queue by using a manager object -- see :ref:`multiprocessing-managers`.
fr: Notez que vous pouvez aussi créer une queue partagée en utilisant un objet gestionnaire -- voir :ref:`multiprocessing-managers`.

source: :mod:`multiprocessing` uses the usual :exc:`queue.Empty` and :exc:`queue.Full` exceptions to signal a timeout. They are not available in the :mod:`multiprocessing` namespace so you need to import them from :mod:`queue`.
fr: :mod:`multiprocessing` utilise les exceptions habituelles :exc:`queue.Empty` et :exc:`queue.Full` pour signaler un dépassement du temps maximal autorisé. Elles ne sont pas disponibles dans l'espace de nommage :mod:`multiprocessing` donc vous devez les importer depuis le module :mod:`queue`.

source: When an object is put on a queue, the object is pickled and a background thread later flushes the pickled data to an underlying pipe. This has some consequences which are a little surprising, but should not cause any practical difficulties -- if they really bother you then you can instead use a queue created with a :ref:`manager <multiprocessing-managers>`.
fr: Quand un objet est placé dans une queue, l'objet est sérialisé par *pickle* et un fil d'exécution en arrière-plan transmettra ensuite les données sérialisées sur un tube sous-jacent. Cela a certaines conséquences qui peuvent être un peu surprenantes, mais ne devrait causer aucune difficultés pratiques -- si elles vous embêtent vraiment, alors vous pouvez à la place utiliser une queue créée avec un :ref:`manager <multiprocessing-managers>`.

source: After putting an object on an empty queue there may be an infinitesimal delay before the queue's :meth:`~Queue.empty` method returns :const:`False` and :meth:`~Queue.get_nowait` can return without raising :exc:`queue.Empty`.
fr: Après avoir placé un objet dans une queue vide il peut y avoir un délai infinitésimal avant que la méthode :meth:`~Queue.empty` de la queue renvoie :const:`False` et que :meth:`~Queue.get_nowait` renvoie une valeur sans lever de :exc:`queue.Empty`.

source: If multiple processes are enqueuing objects, it is possible for the objects to be received at the other end out-of-order. However, objects enqueued by the same process will always be in the expected order with respect to each other.
fr: Si plusieurs processus placent des objets dans la queue, il est possible pour les objets d'être reçus de l'autre côté dans le désordre. Cependant, les objets placés par un même processus seront toujours récupérés dans l'ordre attendu.

source: If a process is killed using :meth:`Process.terminate` or :func:`os.kill` while it is trying to use a :class:`Queue`, then the data in the queue is likely to become corrupted. This may cause any other process to get an exception when it tries to use the queue later on.
fr: Si un processus est tué à l'aide de :meth:`Process.terminate` ou :func:`os.kill` pendant qu'il tente d'utiliser une :class:`Queue`, alors les données de la queue peuvent être corrompues. Cela peut par la suite causer des levées d'exceptions dans les autres processus quand ils tenteront d'utiliser la queue.

source: As mentioned above, if a child process has put items on a queue (and it has not used :meth:`JoinableQueue.cancel_join_thread <multiprocessing.Queue.cancel_join_thread>`), then that process will not terminate until all buffered items have been flushed to the pipe.
fr: Comme mentionné plus haut, si un processus fils a placé des éléments dans la queue (et qu'il n'a pas utilisé :meth:`JoinableQueue.cancel_join_thread <multiprocessing.Queue.cancel_join_thread>`), alors le processus ne se terminera pas tant que les éléments placés dans le tampon n'auront pas été transmis au tube.

source: This means that if you try joining that process you may get a deadlock unless you are sure that all items which have been put on the queue have been consumed. Similarly, if the child process is non-daemonic then the parent process may hang on exit when it tries to join all its non-daemonic children.
fr: Cela signifie que si vous essayez d'attendre ce processus vous pouvez obtenir un interblocage, à moins que vous ne soyez sûr que tous les éléments placés dans la queue ont été consommés. De même, si le processus fils n'est pas un *daemon* alors le processus parent pourrait bloquer à la fermeture quand il tentera d'attendre tous ses enfants non *daemons*.

source: Note that a queue created using a manager does not have this issue. See :ref:`multiprocessing-programming`.
fr: Notez que la queue créée à l'aide d'un gestionnaire n'a pas ce problème. Voir :ref:`multiprocessing-programming`.

source: For an example of the usage of queues for interprocess communication see :ref:`multiprocessing-examples`.
fr: Pour un exemple d'utilisation de queues pour de la communication entre les processus, voir :ref:`multiprocessing-examples`.

source: Returns a pair ``(conn1, conn2)`` of :class:`~multiprocessing.connection.Connection` objects representing the ends of a pipe.
fr: Renvoie une paire ``(conn1, conn2)`` d'objets :class:`~multiprocessing.connection.Connection` représentant les bouts d'un tube.

source: If *duplex* is ``True`` (the default) then the pipe is bidirectional. If *duplex* is ``False`` then the pipe is unidirectional: ``conn1`` can only be used for receiving messages and ``conn2`` can only be used for sending messages.
fr: Si *duplex* vaut ``True`` (par défaut), alors le tube est bidirectionnel. Si *duplex* vaut ``False`` il est unidirectionnel : ``conn1`` ne peut être utilisé que pour recevoir des messages et ``conn2`` que pour en envoyer.

source: Returns a process shared queue implemented using a pipe and a few locks/semaphores. When a process first puts an item on the queue a feeder thread is started which transfers objects from a buffer into the pipe.
fr: Renvoie une queue partagée entre les processus utilisant un tube et quelques verrous/sémaphores. Quand un processus place initialement un élément sur la queue, un fil d'exécution *feeder* est démarré pour transférer les objets du tampon vers le tube.

source: The usual :exc:`queue.Empty` and :exc:`queue.Full` exceptions from the standard library's :mod:`queue` module are raised to signal timeouts.
fr: Les exceptions habituelles :exc:`queue.Empty` et :exc:`queue.Full` du module :mod:`queue` de la bibliothèque standard sont levées pour signaler les *timeouts*.

source: :class:`Queue` implements all the methods of :class:`queue.Queue` except for :meth:`~queue.Queue.task_done` and :meth:`~queue.Queue.join`.
fr: :class:`Queue` implémente toutes les méthodes de :class:`queue.Queue` à l'exception de :meth:`~queue.Queue.task_done` et :meth:`~queue.Queue.join`.

source: Return the approximate size of the queue. Because of multithreading/multiprocessing semantics, this number is not reliable.
fr: Renvoie la taille approximative de la queue. Ce nombre n'est pas fiable en raison des problématiques de *multithreading* et *multiprocessing*.

source: Note that this may raise :exc:`NotImplementedError` on Unix platforms like Mac OS X where ``sem_getvalue()`` is not implemented.
fr: Notez que cela peut lever une :exc:`NotImplementedError` sous les plateformes Unix telles que Mac OS X où ``sem_getvalue()`` n'est pas implémentée.

source: Return ``True`` if the queue is empty, ``False`` otherwise. Because of multithreading/multiprocessing semantics, this is not reliable.
fr: Renvoie ``True`` si la queue est vide, ``False`` sinon. Cette valeur n'est pas fiable en raison des problématiques de *multithreading* et *multiprocessing*.

source: Return ``True`` if the queue is full, ``False`` otherwise. Because of multithreading/multiprocessing semantics, this is not reliable.
fr: Renvoie ``True`` si la queue est pleine, ``False`` sinon. Cette valeur n'est pas fiable en raison des problématiques de *multithreading* et *multiprocessing*.

source: Put obj into the queue. If the optional argument *block* is ``True`` (the default) and *timeout* is ``None`` (the default), block if necessary until a free slot is available. If *timeout* is a positive number, it blocks at most *timeout* seconds and raises the :exc:`queue.Full` exception if no free slot was available within that time. Otherwise (*block* is ``False``), put an item on the queue if a free slot is immediately available, else raise the :exc:`queue.Full` exception (*timeout* is ignored in that case).
fr: Place *obj* dans la queue. Si l'argument optionnel *block* vaut ``True`` (par défaut) est que *timeout* est ``None`` (par défaut), bloque jusqu'à ce qu'un slot libre soit disponible. Si *timeout* est un nombre positif, la méthode bloquera au maximum *timeout* secondes et lèvera une exception :exc:`queue.Full` si aucun slot libre n'a été trouvé dans le temps imparti. Autrement (*block* vaut ``False``), place un élément dans la queue si un slot libre est immédiatement disponible, ou lève une exception :exc:`queue.Full` dans le cas contraire (*timeout* est ignoré dans ce cas).

source: If the queue is closed, :exc:`ValueError` is raised instead of :exc:`AssertionError`.
fr: Si la queue a été marquée comme fermée, une :exc:`ValueError` est levée. Auparavant, une :exc:`AssertionError` était levée.

source: Equivalent to ``put(obj, False)``.
fr: Équivalent à ``put(obj, False)``.

source: Remove and return an item from the queue. If optional args *block* is ``True`` (the default) and *timeout* is ``None`` (the default), block if necessary until an item is available. If *timeout* is a positive number, it blocks at most *timeout* seconds and raises the :exc:`queue.Empty` exception if no item was available within that time. Otherwise (block is ``False``), return an item if one is immediately available, else raise the :exc:`queue.Empty` exception (*timeout* is ignored in that case).
fr: Retire et renvoie un élément de la queue. Si l'argument optionnel *block* vaut ``True`` (par défaut) et que *timeout* est ``None`` (par défaut), bloque jusqu'à ce qu'un élément soit disponible. Si *timeout* (le délai maximal autorisé) est un nombre positif, la méthode bloquera au maximum *timeout* secondes et lèvera une exception :exc:`queue.Empty` si aucun élément n'est disponible dans le temps imparti. Autrement (*block* vaut ``False``), renvoie un élément s'il est immédiatement disponible, ou lève une exception :exc:`queue.Empty` dans le cas contraire (*timeout* est ignoré dans ce cas).

source: If the queue is closed, :exc:`ValueError` is raised instead of :exc:`OSError`.
fr: Si la queue a été marquée comme terminée, une :exc:`ValueError` est levée. Auparavant, une :exc:`OSError`. était levée.

source: Equivalent to ``get(False)``.
fr: Équivalent à ``get(False)``.

source: :class:`multiprocessing.Queue` has a few additional methods not found in :class:`queue.Queue`. These methods are usually unnecessary for most code:
fr: :class:`multiprocessing.Queue` possède quelques méthodes additionnelles non présentes dans :class:`queue.Queue`. Ces méthodes ne sont habituellement pas nécessaires pour la plupart des codes :

source: Indicate that no more data will be put on this queue by the current process. The background thread will quit once it has flushed all buffered data to the pipe. This is called automatically when the queue is garbage collected.
fr: Indique que plus aucune donnée ne peut être placée sur la queue par le processus courant. Le fil d'exécution en arrière-plan se terminera quand il aura transféré toutes les données du tampon vers le tube. Elle est appelée automatiquement quand la queue est collectée par le ramasse-miettes.

source: Join the background thread. This can only be used after :meth:`close` has been called. It blocks until the background thread exits, ensuring that all data in the buffer has been flushed to the pipe.
fr: Attend le fil d'exécution d'arrière-plan. Elle peut seulement être utilisée une fois que :meth:`close` a été appelée. Elle bloque jusqu'à ce que le fil d'arrière-plan se termine, assurant que toutes les données du tampon ont été transmises au tube.

source: By default if a process is not the creator of the queue then on exit it will attempt to join the queue's background thread. The process can call :meth:`cancel_join_thread` to make :meth:`join_thread` do nothing.
fr: Par défaut si un processus n'est pas le créateur de la queue alors à la fermeture elle essaiera d'attendre le fil d'exécution d'arrière-plan de la queue. Le processus peut appeler :meth:`cancel_join_thread` pour que :meth:`join_thread` ne fasse rien.
