Repository: python/python-docs-fr
Catalog: library/netrc.po
Languages: fr

source: :mod:`netrc` --- netrc file processing
fr: :mod:`netrc` — traitement de fichier *netrc*

source: **Source code:** :source:`Lib/netrc.py`
fr: **Code source :** :source:`Lib/netrc.py`

source: The :class:`~netrc.netrc` class parses and encapsulates the netrc file format used by the Unix :program:`ftp` program and other FTP clients.
fr: La classe :class:`netrc` analyse et encapsule le format de fichier *netrc* utilisé par le programme Unix :program:`ftp` et d'autres clients FTP.

source: A :class:`~netrc.netrc` instance or subclass instance encapsulates data from a netrc file. The initialization argument, if present, specifies the file to parse. If no argument is given, the file :file:`.netrc` in the user's home directory -- as determined by :func:`os.path.expanduser` -- will be read. Otherwise, a :exc:`FileNotFoundError` exception will be raised. Parse errors will raise :exc:`NetrcParseError` with diagnostic information including the file name, line number, and terminating token. If no argument is specified on a POSIX system, the presence of passwords in the :file:`.netrc` file will raise a :exc:`NetrcParseError` if the file ownership or permissions are insecure (owned by a user other than the user running the process, or accessible for read or write by any other user). This implements security behavior equivalent to that of ftp and other programs that use :file:`.netrc`.
fr: Une instance de :class:`~netrc.netrc` ou une instance de sous-classe encapsule les données à partir d'un fichier *netrc*. L'argument d'initialisation, s'il est présent, précise le fichier à analyser. Si aucun argument n'est donné, le fichier :file:`.netrc` dans le répertoire d’accueil de l'utilisateur -- déterminé par :func:`os.path.expanduser` -- est lu. Sinon, l'exception :exc:`FileNotFoundError` sera levée. Les erreurs d'analyse lèveront :exc:`NetrcParseError` avec les informations de diagnostic, y compris le nom de fichier, le numéro de ligne, et le lexème. Si aucun argument n'est spécifié dans un système POSIX, la présence de mots de passe dans le fichier :file:`.netrc` lèvera :exc:`NetrcParseError` si la propriété du fichier ou les permissions ne sont pas sécurisées (propriété d'un utilisateur autre que l'utilisateur exécutant le processus ou accessible en lecture ou en écriture par n'importe quel autre utilisateur). Le niveau de sécurité offert est ainsi équivalent à celui de ftp et d'autres programmes utilisant :file:`netrc`.

source: Added the POSIX permission check.
fr: Ajout de la vérification d'autorisations POSIX.

source: :func:`os.path.expanduser` is used to find the location of the :file:`.netrc` file when *file* is not passed as argument.
fr: :func:`os.path.expanduser` est utilisée pour trouver l'emplacement du fichier :file:`netrc` lorsque *file* n'est pas passé en tant qu'argument.

source: Exception raised by the :class:`~netrc.netrc` class when syntactical errors are encountered in source text. Instances of this exception provide three interesting attributes: :attr:`msg` is a textual explanation of the error, :attr:`filename` is the name of the source file, and :attr:`lineno` gives the line number on which the error was found.
fr: Exception levée par la classe :class:`~netrc.netrc` lorsque des erreurs syntaxiques sont rencontrées dans le texte source. Les instances de cette exception fournissent trois attributs intéressants : :attr:`msg` est une explication textuelle de l'erreur, :attr:`filename` est le nom du fichier source et :attr:`lineno` donne le numéro de la ligne sur laquelle l'erreur a été trouvée.

source: netrc Objects
fr: Objets *netrc*

source: A :class:`~netrc.netrc` instance has the following methods:
fr: Une instance :class:`~netrc.netrc` a les méthodes suivantes :

source: Return a 3-tuple ``(login, account, password)`` of authenticators for *host*. If the netrc file did not contain an entry for the given host, return the tuple associated with the 'default' entry. If neither matching host nor default entry is available, return ``None``.
fr: Renvoie un triplet ``(login, account, password)`` pour s'authentifier auprès de l'hôte *host*. Si le fichier *netrc* ne contient pas d'entrée pour l'hôte donné, renvoie le tuple associé à l'entrée par défaut. Si aucun hôte correspondant ni aucune entrée par défaut n'est disponible, renvoie ``None``.

source: Dump the class data as a string in the format of a netrc file. (This discards comments and may reorder the entries.)
fr: Déverse les données de la classe sous forme de chaîne dans le format d'un fichier *netrc*. (Ceci ignore les commentaires et peut réorganiser les entrées).

source: Instances of :class:`~netrc.netrc` have public instance variables:
fr: Les instances de :class:`~netrc.netrc` ont des variables d'instance publiques :

source: Dictionary mapping host names to ``(login, account, password)`` tuples. The 'default' entry, if any, is represented as a pseudo-host by that name.
fr: Dictionnaire faisant correspondre les noms d'hôtes dans des tuples ``(login, account, password)``. L'entrée par défaut, le cas échéant, est représentée en tant que pseudo-hôte par ce nom.

source: Dictionary mapping macro names to string lists.
fr: Dictionnaire faisant correspondre les noms de macro en listes de chaînes.

source: Passwords are limited to a subset of the ASCII character set. All ASCII punctuation is allowed in passwords, however, note that whitespace and non-printable characters are not allowed in passwords. This is a limitation of the way the .netrc file is parsed and may be removed in the future.
fr: Les mots de passe sont limités à un sous-ensemble du jeu de caractères ASCII. Toute ponctuation ASCII est autorisée dans les mots de passe, cependant notez que les espaces et les caractères non imprimables ne sont pas autorisés dans les mots de passe. C'est une limitation de la façon dont le fichier *.netrc* est analysé et pourra être supprimée à l'avenir.
