Repository: python/python-docs-fr
Catalog: library/numbers.po
Languages: fr

source: :mod:`numbers` --- Numeric abstract base classes
fr: :mod:`numbers` — Classes de base abstraites numériques

source: **Source code:** :source:`Lib/numbers.py`
fr: **Code source :** :source:`Lib/numbers.py`

source: The root of the numeric hierarchy. If you just want to check if an argument *x* is a number, without caring what kind, use ``isinstance(x, Number)``.
fr: La base de la hiérarchie numérique. Si vous voulez juste vérifier qu'un argument *x* est un nombre, peu importe le type, utilisez ``isinstance(x, Number)``.

source: The numeric tower
fr: La tour numérique

source: Abstract. Retrieves the real component of this number.
fr: Abstrait. Récupère la partie réelle de ce nombre.

source: Abstract. Retrieves the imaginary component of this number.
fr: Abstrait. Retrouve la partie imaginaire de ce nombre.

source: Abstract. Returns the complex conjugate. For example, ``(1+3j).conjugate() == (1-3j)``.
fr: Abstrait. Renvoie le complexe conjugué. Par exemple, ``(1+3j).conjugate() == (1-3j)``.

source: To :class:`Complex`, :class:`Real` adds the operations that work on real numbers.
fr: :class:`Real` ajoute les opérations qui fonctionnent sur les nombres réels à :class:`Complex`.

source: In short, those are: a conversion to :class:`float`, :func:`math.trunc`, :func:`round`, :func:`math.floor`, :func:`math.ceil`, :func:`divmod`, ``//``, ``%``, ``<``, ``<=``, ``>``, and ``>=``.
fr: En bref, celles-ci sont : une conversion vers :class:`float`, :func:`math.trunc`, :func:`round`, :func:`math.floor`, :func:`math.ceil`, :func:`divmod`, ``//``, ``%``, ``<``, ``<=``, ``>`` et ``>=``.

source: Real also provides defaults for :func:`complex`, :attr:`~Complex.real`, :attr:`~Complex.imag`, and :meth:`~Complex.conjugate`.
fr: *Real* fournit également des valeurs par défaut pour :func:`complex`, :attr:`~Complex.real`, :attr:`~Complex.imag` et :meth:`~Complex.conjugate`.

source: Abstract.
fr: Abstrait.

source: Notes for type implementors
fr: Notes pour implémenter des types

source: Implementors should be careful to make equal numbers equal and hash them to the same values. This may be subtle if there are two different extensions of the real numbers. For example, :class:`fractions.Fraction` implements :func:`hash` as follows::
fr: Les développeurs doivent veiller à ce que des nombres égaux soient bien égaux lors de comparaisons et à ce qu'ils soient hachés aux mêmes valeurs. Cela peut être subtil s'il y a deux dérivations différentes des nombres réels. Par exemple, :class:`fractions.Fraction` implémente :func:`hash` comme suit ::

source: Adding More Numeric ABCs
fr: Ajouter plus d'ABC numériques

source: There are, of course, more possible ABCs for numbers, and this would be a poor hierarchy if it precluded the possibility of adding those. You can add ``MyFoo`` between :class:`Complex` and :class:`Real` with::
fr: Il est bien entendu possible de créer davantage d’ABC pour les nombres et cette hiérarchie serait médiocre si elle excluait la possibilité d'en ajouter. Vous pouvez ajouter ``MyFoo`` entre :class:`Complex` et :class:`Real` ainsi ::

source: Implementing the arithmetic operations
fr: Implémentation des opérations arithmétiques

source: We want to implement the arithmetic operations so that mixed-mode operations either call an implementation whose author knew about the types of both arguments, or convert both to the nearest built in type and do the operation there. For subtypes of :class:`Integral`, this means that :meth:`__add__` and :meth:`__radd__` should be defined as::
fr: Nous voulons implémenter les opérations arithmétiques de sorte que les opérations en mode mixte appellent une implémentation dont l'auteur connaît les types des deux arguments, ou convertissent chacun dans le type natif le plus proche et effectuent l'opération sur ces types. Pour les sous-types de :class:`Integral`, cela signifie que :meth:`__add__` et :meth:`__radd__` devraient être définis comme suit ::

source: There are 5 different cases for a mixed-type operation on subclasses of :class:`Complex`. I'll refer to all of the above code that doesn't refer to ``MyIntegral`` and ``OtherTypeIKnowAbout`` as "boilerplate". ``a`` will be an instance of ``A``, which is a subtype of :class:`Complex` (``a : A <: Complex``), and ``b : B <: Complex``. I'll consider ``a + b``:
fr: Il existe 5 cas différents pour une opération de type mixte sur des sous-classes de :class:`Complex`. Nous nous référerons à tout le code ci-dessus qui ne se réfère pas à ``MyIntegral`` et ``OtherTypeIKnowAbout`` comme "expression générique". ``a`` est une instance de ``A``, qui est un sous-type de :class:`Complex` (``a : A <: Complex``) et ``b : B <: Complex``. Considérons ``a + b``:

source: If ``A`` defines an :meth:`__add__` which accepts ``b``, all is well.
fr: Si ``A`` définit une :meth:`__add__` qui accepte ``b``, tout va bien.

source: If ``A`` falls back to the boilerplate code, and it were to return a value from :meth:`__add__`, we'd miss the possibility that ``B`` defines a more intelligent :meth:`__radd__`, so the boilerplate should return :const:`NotImplemented` from :meth:`__add__`. (Or ``A`` may not implement :meth:`__add__` at all.)
fr: Si ``A`` fait appel au code générique et que celui-ci renvoie une valeur de :meth:`__add__`, nous manquons la possibilité que ``B`` définisse une :meth:`__radd__` plus intelligent, donc le code générique devrait retourner :const:`NotImplemented` dans :meth:`__add__` (ou alors ``A`` ne doit pas implémenter :meth:`__add__` du tout.)

source: Then ``B``'s :meth:`__radd__` gets a chance. If it accepts ``a``, all is well.
fr: Alors :meth:`__radd__` de ``B`` a une chance. si elle accepte ``a``, tout va bien.

source: If it falls back to the boilerplate, there are no more possible methods to try, so this is where the default implementation should live.
fr: Si elle fait appel au code générique, il n'y a plus de méthode possible à essayer, c'est donc ici que l'implémentation par défaut intervient.

source: If ``B <: A``, Python tries ``B.__radd__`` before ``A.__add__``. This is ok, because it was implemented with knowledge of ``A``, so it can handle those instances before delegating to :class:`Complex`.
fr: Si ``B < : A``, Python essaie ``B.__radd__`` avant ``A.__add__``. C'est valable parce qu'elle est implémentée avec la connaissance de ``A``, donc elle peut gérer ces instances avant de déléguer à :class:`Complex`.

source: If ``A <: Complex`` and ``B <: Real`` without sharing any other knowledge, then the appropriate shared operation is the one involving the built in :class:`complex`, and both :meth:`__radd__` s land there, so ``a+b == b+a``.
fr: Si ``A <: Complex`` et ``B <: Real`` sans autre information, alors l'opération commune appropriée est celle impliquant :class:`complex` et les deux :meth:`__radd__` atterrissent à cet endroit, donc ``a+b == b+a``.

source: Because most of the operations on any given type will be very similar, it can be useful to define a helper function which generates the forward and reverse instances of any given operator. For example, :class:`fractions.Fraction` uses::
fr: Comme la plupart des opérations sur un type donné seront très similaires, il peut être utile de définir une fonction accessoire qui génère les instances résultantes et inverses d'un opérateur donné. Par exemple, :class:`fractions.Fraction` utilise ::
