Repository: python/python-docs-fr
Catalog: library/os.po
Languages: fr

source: :mod:`os` --- Miscellaneous operating system interfaces
fr: :mod:`os` — Diverses interfaces pour le système d'exploitation

source: **Source code:** :source:`Lib/os.py`
fr: **Code source:** :source:`Lib/os.py`

source: This module provides a portable way of using operating system dependent functionality. If you just want to read or write a file see :func:`open`, if you want to manipulate paths, see the :mod:`os.path` module, and if you want to read all the lines in all the files on the command line see the :mod:`fileinput` module. For creating temporary files and directories see the :mod:`tempfile` module, and for high-level file and directory handling see the :mod:`shutil` module.
fr: Ce module fournit une manière portable d'utiliser les fonctionnalités dépendantes du système d'exploitation. Si vous voulez uniquement lire ou écrire dans un fichier, voir :func:`open`, si vous voulez manipuler des chemins, voir le module :mod:`os.path`, et si vous voulez lire toutes les lignes de tous les fichiers listés par l'invite de commande, voir le module :mod:`fileinput`. Pour créer des fichiers temporaires, voir le module :mod:`tempfile`, et pour une manipulation haut niveau des fichiers et dossiers, voir le module :mod:`shutil`.

source: Notes on the availability of these functions:
fr: Notes sur la disponibilité de ces fonctions :

source: The design of all built-in operating system dependent modules of Python is such that as long as the same functionality is available, it uses the same interface; for example, the function ``os.stat(path)`` returns stat information about *path* in the same format (which happens to have originated with the POSIX interface).
fr: La conception des modules natifs Python dépendants du système d'exploitation est qu'une même fonctionnalité utilise une même interface. Par exemple, la fonction ``os.stat(path)`` renvoie des informations sur les statistiques de *path* dans le même format (qui est originaire de l'interface POSIX).

source: Extensions peculiar to a particular operating system are also available through the :mod:`os` module, but using them is of course a threat to portability.
fr: Les extensions propres à un certain système d'exploitation sont également disponible par le module :mod:`os`, mais les utiliser est bien entendu une menace pour la portabilité.

source: All functions accepting path or file names accept both bytes and string objects, and result in an object of the same type, if a path or file name is returned.
fr: Toutes les fonctions acceptant les chemins ou noms de fichiers acceptent aussi bien des *bytes* que des *string*, et si un chemin ou un nom de fichier est renvoyé, il sera du même type.

source: An alias for the built-in :exc:`OSError` exception.
fr: Un alias pour les exceptions natives :exc:`OSError`.

source: The name of the operating system dependent module imported. The following names have currently been registered: ``'posix'``, ``'nt'``, ``'java'``.
fr: Le nom du module importé dépendant du système d'exploitation. Les noms suivants ont actuellement été enregistrés : ``'posix'``, ``'nt'``, ``'java'``.

source: :attr:`sys.platform` has a finer granularity. :func:`os.uname` gives system-dependent version information.
fr: :attr:`sys.platform` a une granularité plus fine. :func:`os.uname` donne des informations de version dépendantes de système.

source: The :mod:`platform` module provides detailed checks for the system's identity.
fr: Le module :mod:`platform` fournit des vérifications détaillées pour l'identité du système.

source: File Names, Command Line Arguments, and Environment Variables
fr: Noms de fichiers, arguments en ligne de commande, et variables d'environnement

source: In Python, file names, command line arguments, and environment variables are represented using the string type. On some systems, decoding these strings to and from bytes is necessary before passing them to the operating system. Python uses the file system encoding to perform this conversion (see :func:`sys.getfilesystemencoding`).
fr: En Python, les noms de fichiers, les arguments en ligne de commandes, et les variables d'environnement sont représentées en utilisant le type *string*. Sur certains systèmes, décoder ces chaînes de caractères depuis et vers des *bytes* est nécessaire avant de les passer au système d'exploitation. Python utilise l'encodage du système de fichiers pour réaliser ces conversions (voir :func:`sys.getfilesystemencoding`).

source: On some systems, conversion using the file system encoding may fail. In this case, Python uses the :ref:`surrogateescape encoding error handler <surrogateescape>`, which means that undecodable bytes are replaced by a Unicode character U+DCxx on decoding, and these are again translated to the original byte on encoding.
fr: Sur certains systèmes, les conversions utilisant l'encodage du système de fichiers peut échouer. Dans ce cas, Python utilise le :ref:`surrogateescape encoding error handler <surrogateescape>` (le gestionnaire d'erreurs d'encodage *surrogateescape*), ce qui veut dire que les bytes indécodables sont replacés par un caractère Unicode U+DCxx au décodage, et ceux-ci sont retraduits en le bon octet à l'encodage.

source: The file system encoding must guarantee to successfully decode all bytes below 128. If the file system encoding fails to provide this guarantee, API functions may raise UnicodeErrors.
fr: L'encodage du système de fichiers doit garantir de pouvoir décoder correctement tous les octets en dessous de 128. Si l'encodage du système de fichiers ne peut garantir cela, les fonctions de l'API peuvent lever une UnicodeError.

source: Process Parameters
fr: Paramètres de processus

source: These functions and data items provide information and operate on the current process and user.
fr: Ces fonctions et valeurs fournissent des informations et agissent sur le processus actuel et sur l'utilisateur.

source: Return the filename corresponding to the controlling terminal of the process.
fr: Renvoie l'identifiant de fichier correspondant au terminal contrôlant le processus.

source: :ref:`Availability <availability>`: Unix.
fr: :ref:`Disponibilité <availability>` : Unix.

source: A :term:`mapping` object representing the string environment. For example, ``environ['HOME']`` is the pathname of your home directory (on some platforms), and is equivalent to ``getenv("HOME")`` in C.
fr: Un objet :term:`mapping` représentant la variable d'environnement. Par exemple ``environ['HOME']`` est le chemin vers votre répertoire d’accueil (sur certaines plate-formes), et est équivalent à ``getenv("HOME")`` en C.

source: This mapping is captured the first time the :mod:`os` module is imported, typically during Python startup as part of processing :file:`site.py`. Changes to the environment made after this time are not reflected in ``os.environ``, except for changes made by modifying ``os.environ`` directly.
fr: Ce *mapping* est capturé la première fois que le module :mod:`os` est importé, typiquement pendant le démarrage de Python, lors de l'exécution de :file:`site.py`. Les changements de l'environnement opérés après cette capture ne sont pas répercutés dans ``os.environ``, à part les modifications directes de ``os.environ``.

source: If the platform supports the :func:`putenv` function, this mapping may be used to modify the environment as well as query the environment. :func:`putenv` will be called automatically when the mapping is modified.
fr: Si la plate-forme prend en charge la fonction :func:`putenv`, ce *mapping* peut être utilisé pour modifier l'environnement autant que pour l'interroger. :func:`putenv` sera appelée automatiquement quand le *mapping* sera modifié.

source: On Unix, keys and values use :func:`sys.getfilesystemencoding` and ``'surrogateescape'`` error handler. Use :data:`environb` if you would like to use a different encoding.
fr: Sur Unix, les clefs et les valeurs utilisent :func:`sys.getfilesystemencoding` et le gestionnaire d'erreurs ``surrogateescape``. Utilisez :data:`environb` si vous désirez utiliser un encodage différent.

source: Calling :func:`putenv` directly does not change ``os.environ``, so it's better to modify ``os.environ``.
fr: Appeler :func:`putenv` ne change pas directement ``os.environ``, donc il est préférable de modifier ``os.environ``.

source: On some platforms, including FreeBSD and Mac OS X, setting ``environ`` may cause memory leaks. Refer to the system documentation for :c:func:`putenv`.
fr: Sur certaines plate-formes, dont FreeBSD et Mac OS X, procéder à des assignations sur ``environ`` peut causer des fuites de mémoire. Referez-vous à la documentation système de :func:`putenv`.

source: If :func:`putenv` is not provided, a modified copy of this mapping may be passed to the appropriate process-creation functions to cause child processes to use a modified environment.
fr: Si :func:`putenv` n'est pas fourni, une copie modifiée de ce dictionnaire peut être passé aux fonctions appropriées de création de processus pour forcer l'utilisation d'un environnement modifié pour le processus fils.

source: If the platform supports the :func:`unsetenv` function, you can delete items in this mapping to unset environment variables. :func:`unsetenv` will be called automatically when an item is deleted from ``os.environ``, and when one of the :meth:`pop` or :meth:`clear` methods is called.
fr: Si la plate-forme prend en charge la fonction :func:`unsetenv`, vous pouvez supprimer des éléments de ce dictionnaire pour supprimer des variables d'environnement. La fonction :func:`unsetenv` sera appelée automatiquement quand un élément est supprimé de ``os.environ``, ou quand l'une des méthodes :meth:`pop` ou :meth:`clear` est appelée.

source: Bytes version of :data:`environ`: a :term:`mapping` object representing the environment as byte strings. :data:`environ` and :data:`environb` are synchronized (modify :data:`environb` updates :data:`environ`, and vice versa).
fr: Une version en *bytes* de :data:`environ` : un :term:`mapping` d'objets représentant l'environnement par des chaîne de *bytes*. :data:`environ` et :data:`environb` sont synchronisés (modifier :data:`environ` modifie :data:`environb`, et vice-versa).

source: These functions are described in :ref:`os-file-dir`.
fr: Ces fonctions sont décrites dans :ref:`os-file-dir`.

source: Encode :term:`path-like <path-like object>` *filename* to the filesystem encoding with ``'surrogateescape'`` error handler, or ``'strict'`` on Windows; return :class:`bytes` unchanged.
fr: Encode le :term:`chemin-compatible <path-like object>` *filename* vers l'encodage du système de fichiers avec une gestion d'erreurs ``'surrogateescape'``, ou ``'strict'`` sous Windows ; renvoie un objet :class:`bytes` inchangé.

source: :func:`fsdecode` is the reverse function.
fr: :func:`fsdecode` est la fonction inverse.

source: Support added to accept objects implementing the :class:`os.PathLike` interface.
fr: Ajout de la prise en charge des objets implémentant l'interface :class:`os.PathLike`.

source: Decode the :term:`path-like <path-like object>` *filename* from the filesystem encoding with ``'surrogateescape'`` error handler, or ``'strict'`` on Windows; return :class:`str` unchanged.
fr: Encode le :term:`chemin-compatible <path-like object>` *filename* depuis l'encodage du système de fichiers avec une gestion d'erreurs ``'surrogateescape'``, ou ``'strict'`` sous Windows ; renvoie un objet :class:`str` inchangé.

source: :func:`fsencode` is the reverse function.
fr: :func:`fsencode` est la fonction inverse.

source: Return the file system representation of the path.
fr: Renvoie la représentation par le système de fichiers du chemin.

source: If :class:`str` or :class:`bytes` is passed in, it is returned unchanged. Otherwise :meth:`~os.PathLike.__fspath__` is called and its value is returned as long as it is a :class:`str` or :class:`bytes` object. In all other cases, :exc:`TypeError` is raised.
fr: Si un objet :class:`str` ou :class:`bytes` est passé, il est renvoyé inchangé. Autrement, :meth:`~os.PathLike.__fspath__` est appelée et sa valeur renvoyée tant qu'elle est un objet :class:`str` ou :class:`bytes`. Dans tous les autres cas, une :exc:`TypeError` est levée.

source: An :term:`abstract base class` for objects representing a file system path, e.g. :class:`pathlib.PurePath`.
fr: Une :term:`abstract base class` pour les objets représentant un chemin du système de fichiers, comme :class:`pathlib.PurePath`.

source: Return the file system path representation of the object.
fr: Renvoie la représentation du chemin du système de fichiers de l'objet.

source: The method should only return a :class:`str` or :class:`bytes` object, with the preference being for :class:`str`.
fr: La méthode ne devrait renvoyer que des objets :class:`str` ou :class:`bytes`, avec une préférence pour les :class:`str`.

source: Return the value of the environment variable *key* if it exists, or *default* if it doesn't. *key*, *default* and the result are str.
fr: Renvoie la valeur de la variable d'environnement *key* si elle existe, ou *default* si elle n'existe pas. *key*, *default*, et la valeur de retour sont des *str*.

source: On Unix, keys and values are decoded with :func:`sys.getfilesystemencoding` and ``'surrogateescape'`` error handler. Use :func:`os.getenvb` if you would like to use a different encoding.
fr: Sur Unix, les clefs et les valeurs sont décodées avec :func:`sys.getfilesystemencoding` et le gestionnaire d'erreurs ``surrogateescape``. Utilisez :func:`os.getenvb` si vous voulez utiliser un encodage différent.

source: :ref:`Availability <availability>`: most flavors of Unix, Windows.
fr: :ref:`Disponibilité <availability>` : la plupart des dérivés Unix, Windows.

source: Return the value of the environment variable *key* if it exists, or *default* if it doesn't. *key*, *default* and the result are bytes.
fr: Renvoie la valeur de la variable d'environnement *key* si elle existe, ou *default* si elle n'existe pas. *key*, *default*, et la valeur de retour sont des *bytes*.

source: :ref:`Availability <availability>`: most flavors of Unix.
fr: :ref:`Disponibilité <availability>` : la plupart des dérivés Unix.

source: Returns the list of directories that will be searched for a named executable, similar to a shell, when launching a process. *env*, when specified, should be an environment variable dictionary to lookup the PATH in. By default, when *env* is ``None``, :data:`environ` is used.
fr: Renvoie la liste des dossier qui seront parcouru pour trouver un exécutable, similaire à un shell lorsque il lance un processus. *env*, quand spécifié, doit être un dictionnaire de variable d'environnement afin d'y rechercher le PATH. Par défaut quand *env* est ``None``, :data:`environ` est utilisé.

source: Return the effective group id of the current process. This corresponds to the "set id" bit on the file being executed in the current process.
fr: Renvoie l'identifiant du groupe effectif du processus actuel. Ça correspond au bit "*set id*" du fichier qui s'exécute dans le processus actuel.

source: Return the current process's effective user id.
fr: Renvoie l'identifiant de l'utilisateur effectif du processus actuel.

source: Return the real group id of the current process.
fr: Renvoie l'identifiant de groupe réel du processus actuel.

source: Return list of group ids that *user* belongs to. If *group* is not in the list, it is included; typically, *group* is specified as the group ID field from the password record for *user*.
fr: Renvoie la liste d'identifiants de groupes auxquels *user* appartient. Si *group* n'est pas dans la liste, il y est inclus. Typiquement, *group* vaut le *group ID* de l'enregistrement *passwd* de *user*.

source: Return list of supplemental group ids associated with the current process.
fr: Renvoie une liste d'identifiants de groupes additionnels associés au processus actuel.

source: On Mac OS X, :func:`getgroups` behavior differs somewhat from other Unix platforms. If the Python interpreter was built with a deployment target of :const:`10.5` or earlier, :func:`getgroups` returns the list of effective group ids associated with the current user process; this list is limited to a system-defined number of entries, typically 16, and may be modified by calls to :func:`setgroups` if suitably privileged. If built with a deployment target greater than :const:`10.5`, :func:`getgroups` returns the current group access list for the user associated with the effective user id of the process; the group access list may change over the lifetime of the process, it is not affected by calls to :func:`setgroups`, and its length is not limited to 16. The deployment target value, :const:`MACOSX_DEPLOYMENT_TARGET`, can be obtained with :func:`sysconfig.get_config_var`.
fr: Sur Mac OS X, le comportement de :func:`getgroups` diffère légèrement des autres plate-formes Unix. Si l'interpréteur Python était compilé avec une cible de déploiement de :const:`10.5` ou moins, :func:`getgroups` renverrait la liste des identifiants de groupes effectifs associés au processus courant de l'utilisateur ; le nombre d'éléments de cette liste est limité par le système, typiquement 16, et peut être modifié par des appels à :func:`setgroups` si les privilèges ont été convenablement assignés. Si compilé avec une cible de déploiement supérieure à :const:`10.5`, la fonction :func:`getgroups` renvoie la liste des accès du groupe actuel pour l'utilisateur associé à l'identifiant utilisateur du processus ; la liste d'accès du groupe peut changer durant la vie du processus, elle n'est pas affectée par les appels à :func:`setgroups` et sa longueur n'est pas limitée à 16. La valeur de la cible de déploiement, :const:`MACOSX_DEPLOYMENT_TARGET`, peut être obtenue par la fonction :func:`sysconfig.get_config_var`.

source: Return the name of the user logged in on the controlling terminal of the process. For most purposes, it is more useful to use :func:`getpass.getuser` since the latter checks the environment variables :envvar:`LOGNAME` or :envvar:`USERNAME` to find out who the user is, and falls back to ``pwd.getpwuid(os.getuid())[0]`` to get the login name of the current real user id.
fr: Renvoie le nom de l'utilisateur connecté sur le terminal contrôlant le processus. Dans la plupart des cas, il est plus utile d'utiliser :func:`getpass.getuser` puisque cette fonction consulte les variables d'environnement :envvar:`LOGNAME` et :envvar:`USERNAME` pour savoir qui est l'utilisateur, et se replie finalement sur ``pwd.getpwduid(os.getuid())[0]`` pour avoir le nom de connexion lié à l'identifiant de l'utilisateur courant.

source: :ref:`Availability <availability>`: Unix, Windows.
fr: :ref:`Disponibilité <availability>` : Unix, Windows.

source: Return the process group id of the process with process id *pid*. If *pid* is 0, the process group id of the current process is returned.
fr: Renvoie l'identifiant de groupe de processus du processus de PID *pid*. Si *pid* vaut 0, l'identifiant de groupe de processus du processus actuel est renvoyé.

source: Return the id of the current process group.
fr: Renvoie l'identifiant du groupe de processus actuel.

source: Return the current process id.
fr: Renvoie l'identifiant du processus actuel.

source: Return the parent's process id. When the parent process has exited, on Unix the id returned is the one of the init process (1), on Windows it is still the same id, which may be already reused by another process.
fr: Renvoie l'identifiant du processus parent. Quand le processus parent est terminé, sur Unix, l'identifiant renvoyé est 1 pour le processus *init*, sur Windows, c'est toujours le même id, qui peut déjà avoir été réutilisé par un autre processus.

source: Added support for Windows.
fr: Prise en charge sur Windows.

source: Get program scheduling priority. The value *which* is one of :const:`PRIO_PROCESS`, :const:`PRIO_PGRP`, or :const:`PRIO_USER`, and *who* is interpreted relative to *which* (a process identifier for :const:`PRIO_PROCESS`, process group identifier for :const:`PRIO_PGRP`, and a user ID for :const:`PRIO_USER`). A zero value for *who* denotes (respectively) the calling process, the process group of the calling process, or the real user ID of the calling process.
fr: Récupère la priorité d'ordonnancement des programmes. La valeur *which* est une des constantes suivantes : :const:`PRIO_PROCESS`, :const:`PRIO_PGRP`, ou :const:`PRIO_USER`, et la valeur *who* est interprétée par rapport à *which* (un id de processus pour :const:`PRIO_PROCESS`, un id de groupe de processus pour :const:`PRIO_PGRP`, et un id d'utilisateur pour :const:`PRIO_USER`). Une valeur nulle pour *who* dénote (respectivement) le processus appelant, le groupe de processus du processus appelant, ou l'identifiant d'utilisateur réel du processus appelant.

source: Parameters for the :func:`getpriority` and :func:`setpriority` functions.
fr: Paramètres pour les fonctions :func:`getpriority` et :func:`setpriority`.

source: Return a tuple (ruid, euid, suid) denoting the current process's real, effective, and saved user ids.
fr: Renvoie un *tuple* (*ruid*, *euid*, *suid*) dénotant les identifiants de l'utilisateur réel, effectif et sauvé du processus actuel.

source: Return a tuple (rgid, egid, sgid) denoting the current process's real, effective, and saved group ids.
fr: Renvoie un *tuple* (*rgid*, *egid*, *sgid*) dénotant les identifiants des groupes de processus réel effectif, et sauvé du processus actuel.

source: Return the current process's real user id.
fr: Renvoie l'identifiant réel du processus actuel.

source: Call the system initgroups() to initialize the group access list with all of the groups of which the specified username is a member, plus the specified group id.
fr: Appelle la fonction système *initgroups* pour initialiser la liste des groupes d'accès des groupes dont *username* est membre, plus le groupe spécifié par *gid*.

source: Set the environment variable named *key* to the string *value*. Such changes to the environment affect subprocesses started with :func:`os.system`, :func:`popen` or :func:`fork` and :func:`execv`.
fr: Assigne la chaîne de caractères *value* à la variable d'environnement *key*. De tels changements à l'environnement affectent les sous-processus lancés par :func:`os.system`, :func:`popen` ou :func:`fork` et :func:`execv`.

source: On some platforms, including FreeBSD and Mac OS X, setting ``environ`` may cause memory leaks. Refer to the system documentation for putenv.
fr: Sur certaines plate-formes, incluant FreeBSD et Mac OS X, assigner ``environ`` peut causer des fuites de mémoire. Referez-vous à la documentation système de *putenv*.

source: When :func:`putenv` is supported, assignments to items in ``os.environ`` are automatically translated into corresponding calls to :func:`putenv`; however, calls to :func:`putenv` don't update ``os.environ``, so it is actually preferable to assign to items of ``os.environ``.
fr: Quand :func:`putenv` est géré, les assignations d'éléments dans ``os.environ`` sont automatiquement traduites en appels correspondants à :func:`putenv`. Cependant, des appels à :func:`putenv` ne mettent pas ``os.environ`` à jour. Il est donc préférable d'assigner les éléments de ``os.environ``.

source: Set the current process's effective group id.
fr: Définit l'identifiant du groupe de processus effectif du processus actuel.

source: Set the current process's effective user id.
fr: Définit l'identifiant de l'utilisateur effectif du processus actuel.

source: Set the current process' group id.
fr: Définit l'identifiant du groupe de processus actuel.
