Repository: python/python-docs-fr
Catalog: library/os.po
Languages: fr

source: On Linux 3.17 and newer, the ``getrandom()`` syscall is now used when available. On OpenBSD 5.6 and newer, the C ``getentropy()`` function is now used. These functions avoid the usage of an internal file descriptor.
fr: Sur Linux 3.17 et plus récent, l'appel système ``getrandom()`` est maintenant utilisé quand il est disponible. Sur OpenBSD 5.6 et plus récent, la fonction C ``getentropy()`` est utilisée. Ces fonctions évitent l'utilisation interne d'un descripteur de fichier.

source: By default, when reading from ``/dev/random``, :func:`getrandom` blocks if no random bytes are available, and when reading from ``/dev/urandom``, it blocks if the entropy pool has not yet been initialized.
fr: Par défaut, quand elle lit depuis ``/dev/random``, :func:`getrandom` bloque si aucun octet aléatoire n'est disponible, et quand elle lit depuis ``/dev/urandom``, elle bloque si la réserve d'entropie n'a pas encore été initialisée.

source: If the :py:data:`GRND_NONBLOCK` flag is set, then :func:`getrandom` does not block in these cases, but instead immediately raises :exc:`BlockingIOError`.
fr: Si l'option :py:data:`GRND_NONBLOCK` est activée, :func:`getrandom` ne bloque pas dans ces cas, mais lève immédiatement une :exc:`BlockingIOError`.

source: If this bit is set, then random bytes are drawn from the ``/dev/random`` pool instead of the ``/dev/urandom`` pool.
fr: Si ce bit est activé, les octets aléatoires sont puisés depuis ``/dev/random`` plutôt que ``/dev/urandom``.
