Repository: python/python-docs-fr
Catalog: library/os.po
Languages: fr

source: Size of the file in bytes, if it is a regular file or a symbolic link. The size of a symbolic link is the length of the pathname it contains, without a terminating null byte.
fr: Taille du fichier en *bytes* si c'est un fichier normal ou un lien symbolique. La taille d'un lien symbolique est la longueur du nom de chemin qu'il contient sans le byte nul final.

source: Timestamps:
fr: Horodatages :

source: Time of most recent access expressed in seconds.
fr: Moment de l'accès le plus récent, exprimé en secondes.

source: Time of most recent content modification expressed in seconds.
fr: Moment de la modification de contenu la plus récente, exprimé en secondes.

source: Platform dependent:
fr: Dépendant de la plate-forme :

source: the time of most recent metadata change on Unix,
fr: le moment du changement de méta-données le plus récent sur Unix,

source: the time of creation on Windows, expressed in seconds.
fr: le moment de création sur Windows, exprimé en secondes.

source: Time of most recent access expressed in nanoseconds as an integer.
fr: Moment de l'accès le plus récent, exprimé en nanosecondes, par un entier.

source: Time of most recent content modification expressed in nanoseconds as an integer.
fr: Moment de la modification de contenu la plus récente, exprimé en nanosecondes, par un entier.

source: the time of creation on Windows, expressed in nanoseconds as an integer.
fr: le moment de création sur Windows, exprimé en nanosecondes, par un entier.

source: The exact meaning and resolution of the :attr:`st_atime`, :attr:`st_mtime`, and :attr:`st_ctime` attributes depend on the operating system and the file system. For example, on Windows systems using the FAT or FAT32 file systems, :attr:`st_mtime` has 2-second resolution, and :attr:`st_atime` has only 1-day resolution. See your operating system documentation for details.
fr: La signification et la précision exacte des attributs :attr:`st_atime`, :attr:`st_mtime`, et :attr:`st_ctime` dépendent du système d'exploitation et du système de fichier. Par exemple sur les systèmes Windows qui utilisent un système de fichier FAT ou FAT32, :attr:`st_mtime` a une précision de 2 secondes, et :attr:`st_atime` a une précision de 1 jour. Regardez la documentation de votre système d'exploitation pour plus de détails.

source: Similarly, although :attr:`st_atime_ns`, :attr:`st_mtime_ns`, and :attr:`st_ctime_ns` are always expressed in nanoseconds, many systems do not provide nanosecond precision. On systems that do provide nanosecond precision, the floating-point object used to store :attr:`st_atime`, :attr:`st_mtime`, and :attr:`st_ctime` cannot preserve all of it, and as such will be slightly inexact. If you need the exact timestamps you should always use :attr:`st_atime_ns`, :attr:`st_mtime_ns`, and :attr:`st_ctime_ns`.
fr: De manière similaire, bien que :attr:`st_atime_ns`, :attr:`st_mtime_ns`, et :attr:`st_ctime_ns` soient toujours exprimés en nanosecondes, beaucoup de systèmes ne fournissent pas une précision à la nanoseconde près.Sur les systèmes qui fournissent une telle précision, l'objet à virgule flottante utilisé pour stocker :attr:`st_atime`, :attr:`st_mtime`, et :attr:`st_ctime` ne peut pas le contenir en entier, et donc sera légèrement inexact. Si vous avez besoin d'horodatages exacts, vous devriez toujours utiliser :attr:`st_atime_ns`, :attr:`st_mtime_ns`, et :attr:`st_ctime_ns`.

source: On some Unix systems (such as Linux), the following attributes may also be available:
fr: Sur certains systèmes Unix (tels que Linux), les attributs suivants peuvent également être disponibles :

source: Number of 512-byte blocks allocated for file. This may be smaller than :attr:`st_size`/512 when the file has holes.
fr: Nombre de blocs de 512 *bytes* alloués pour le fichier. Cette valeur peut être inférieure à :attr:`st_size`/512 quand le fichier a des trous.

source: "Preferred" blocksize for efficient file system I/O. Writing to a file in smaller chunks may cause an inefficient read-modify-rewrite.
fr: Taille de bloc "préférée" pour des E/S efficaces avec le système de fichiers. Écrire dans un fichier avec des blocs plus petits peut causer des modifications (lecture-écriture-réécriture) inefficaces.

source: Type of device if an inode device.
fr: Type de périphérique si l'*inode* représente un périphérique.

source: User defined flags for file.
fr: Marqueurs définis par l'utilisateur pour le fichier.

source: On other Unix systems (such as FreeBSD), the following attributes may be available (but may be only filled out if root tries to use them):
fr: Sur d'autres systèmes Unix (tels que FreeBSD), les attributs suivants peuvent être disponibles (mais peuvent être complétés uniquement lorsque le super-utilisateur *root* tente de les utiliser) :

source: File generation number.
fr: Nombre de génération de fichier.

source: Time of file creation.
fr: Moment de la création du fichier.

source: On Solaris and derivatives, the following attributes may also be available:
fr: Sur les systèmes Solaris et dérivés, les attributs suivants peuvent également être disponibles :

source: String that uniquely identifies the type of the filesystem that contains the file.
fr: Chaîne qui identifie de manière unique le type du système de fichiers qui contient le fichier.

source: On Mac OS systems, the following attributes may also be available:
fr: Sur les systèmes Mac OS, les attributs suivants peuvent également être disponibles :

source: Real size of the file.
fr: Taillé réelle du fichier.

source: Creator of the file.
fr: Créateur du fichier.

source: File type.
fr: Type du fichier.

source: Windows file attributes: ``dwFileAttributes`` member of the ``BY_HANDLE_FILE_INFORMATION`` structure returned by :c:func:`GetFileInformationByHandle`. See the ``FILE_ATTRIBUTE_*`` constants in the :mod:`stat` module.
fr: Attributs de fichiers Windows : membre ``dwFileAttributes`` de la structure ``BY_HANDLE_FILE_INFORMATION`` renvoyée par :c:func:`GetileInformationByHandle`. Soir les constantes ``FILE_ATTRIBUTE_*`` du module :mod:`stat`.

source: The standard module :mod:`stat` defines functions and constants that are useful for extracting information from a :c:type:`stat` structure. (On Windows, some items are filled with dummy values.)
fr: Le module standard :mod:`stat` définit des fonctions et des constantes qui sont utiles pour l'extraction d'informations d'une structure :c:type:`stat`. (Sur Windows, certains éléments sont remplis avec des valeurs factices.)

source: For backward compatibility, a :class:`stat_result` instance is also accessible as a tuple of at least 10 integers giving the most important (and portable) members of the :c:type:`stat` structure, in the order :attr:`st_mode`, :attr:`st_ino`, :attr:`st_dev`, :attr:`st_nlink`, :attr:`st_uid`, :attr:`st_gid`, :attr:`st_size`, :attr:`st_atime`, :attr:`st_mtime`, :attr:`st_ctime`. More items may be added at the end by some implementations. For compatibility with older Python versions, accessing :class:`stat_result` as a tuple always returns integers.
fr: Pour des raisons de rétro-compatibilité, une instance du :class:`stat_result` est également accessible comme un tuple d'au moins 10 valeurs entières donnant les membres les plus importants (et portables) de la structure :c:type:`stat`, dans l'ordre : :attr:`st_mode`, :attr:`st_ino`, :attr:`st_dev`, :attr:`st_nlink`, :attr:`st_uid`, :attr:`st_gid`, :attr:`st_size`, :attr:`st_atime`, :attr:`st_mtime`, :attr:`st_ctime`. Plus d'éléments peuvent être ajoutés à la fin par certaines implémentations. Pour une compatibilité avec les anciennes versions de Python, accéder à un élément de type :class:`stat_result` comme un tuple donne toujours des entiers.

source: Added the :attr:`st_atime_ns`, :attr:`st_mtime_ns`, and :attr:`st_ctime_ns` members.
fr: Les attributs :attr:`st_atime_ns`, :attr:`st_mtime_ns`, et :attr:`st_ctime_ns` ont été ajoutés.

source: Added the :attr:`st_file_attributes` member on Windows.
fr: L'attribut :attr:`st_file_attributes` a été ajouté sur Windows.

source: Windows now returns the file index as :attr:`st_ino` when available.
fr: Windows renvoie maintenant l'index du fichier dans l'attribut :attr:`st_ino`, lorsqu'il est disponible.

source: Added the :attr:`st_fstype` member to Solaris/derivatives.
fr: Ajout de l'attribut :attr:`st_fstype` sur Solaris et dérivés.

source: Perform a :c:func:`statvfs` system call on the given path. The return value is an object whose attributes describe the filesystem on the given path, and correspond to the members of the :c:type:`statvfs` structure, namely: :attr:`f_bsize`, :attr:`f_frsize`, :attr:`f_blocks`, :attr:`f_bfree`, :attr:`f_bavail`, :attr:`f_files`, :attr:`f_ffree`, :attr:`f_favail`, :attr:`f_flag`, :attr:`f_namemax`, :attr:`f_fsid`.
fr: Exécute un appel système :c:func:`statvfs` sur le chemin donné par *path*. La valeur de retour est un objet dont les attributs décrivent le système de fichiers pour le chemin donné, et correspondent aux membres de la structure :c:type:`statvfs`, c'est-à-dire : :attr:`f_bsize`, :attr:`f_frsize`, :attr:`f_blocks`, :attr:`f_bfree`, :attr:`f_bavail`, :attr:`f_files`, :attr:`f_ffree`, :attr:`f_favail`, :attr:`f_flag`, :attr:`f_namemax`, :attr:`f_fsid`.

source: Two module-level constants are defined for the :attr:`f_flag` attribute's bit-flags: if :const:`ST_RDONLY` is set, the filesystem is mounted read-only, and if :const:`ST_NOSUID` is set, the semantics of setuid/setgid bits are disabled or not supported.
fr: Deux constantes de module sont définies pour le champ-de-bits de l'attribut :attr:`f_flag` : si :const:`SR_RDONLY` est activé, le système de fichiers est monté en lecture-seule, et si :const:`ST_NOSUID` est activé, la sémantique des bits de *setuid* / *getuid* est désactivée ou non gérée.

source: Additional module-level constants are defined for GNU/glibc based systems. These are :const:`ST_NODEV` (disallow access to device special files), :const:`ST_NOEXEC` (disallow program execution), :const:`ST_SYNCHRONOUS` (writes are synced at once), :const:`ST_MANDLOCK` (allow mandatory locks on an FS), :const:`ST_WRITE` (write on file/directory/symlink), :const:`ST_APPEND` (append-only file), :const:`ST_IMMUTABLE` (immutable file), :const:`ST_NOATIME` (do not update access times), :const:`ST_NODIRATIME` (do not update directory access times), :const:`ST_RELATIME` (update atime relative to mtime/ctime).
fr: Des constantes de module supplémentaires sont définies pour les systèmes basés sur GNU/glibc. Ces constantes sont :const:`ST_NODEV` (interdit l'accès aux fichiers spéciaux du périphérique), :const:`ST_NOEXEC` (interdit l'exécution de programmes), :const:`ST_SYNCHRONOUS` (les écritures sont synchronisées en une fois), :const:`ST_MANDLOCK` (permet les verrous impératifs sur un système de fichiers), :const:`ST_WRITE` (écrit sur les fichiers/répertoires/liens symboliques), :const:`ST_APPEND` (fichiers en ajout-seul), :const:`ST_IMMUTABLE` (fichiers immuables), :const:`ST_NOATIME` (ne met pas à jour les moments d'accès), :const:`ST_NODIRATIME` (ne met pas à jour les moments d'accès aux répertoires), :const:`ST_REALTIME` (Met *atime* à jour relativement à *mtime* / *ctime*).

source: The :const:`ST_RDONLY` and :const:`ST_NOSUID` constants were added.
fr: Ajout des constantes :const:`ST_RDONLY` et :const:`ST_NOSUID`.

source: The :const:`ST_NODEV`, :const:`ST_NOEXEC`, :const:`ST_SYNCHRONOUS`, :const:`ST_MANDLOCK`, :const:`ST_WRITE`, :const:`ST_APPEND`, :const:`ST_IMMUTABLE`, :const:`ST_NOATIME`, :const:`ST_NODIRATIME`, and :const:`ST_RELATIME` constants were added.
fr: Ajout des constantes :const:`ST_NODEV`, :const:`ST_NOEXEC`, :const:`ST_SYNCHRONOUS`, :const:`ST_MANDLOCK`, :const:`ST_WRITE`, :const:`ST_APPEND`, :const:`ST_IMMUTABLE`, :const:`ST_NOATIME`, :const:`ST_NODIRATIME`, et :const:`ST_RELATIME`.

source: Added :attr:`f_fsid`.
fr: Ajout de :attr:`f_fsid`.

source: Currently *dir_fd* parameters only work on Unix platforms; none of them work on Windows.
fr: Actuellement, le paramètre *dir_fd* ne fonctionne que sur les plate-formes Unix. Il ne fonctionne jamais sur Windows.

source: Create a symbolic link pointing to *src* named *dst*.
fr: Crée un lien symbolique pointant vers *src* et appelé *dst*.

source: On Windows, a symlink represents either a file or a directory, and does not morph to the target dynamically. If the target is present, the type of the symlink will be created to match. Otherwise, the symlink will be created as a directory if *target_is_directory* is ``True`` or a file symlink (the default) otherwise. On non-Windows platforms, *target_is_directory* is ignored.
fr: Sur Windows, un lien symbolique représente soit lien vers un fichier, soit lien vers un répertoire mais ne s'adapte pas dynamiquement au type de la cible. Si la cible existe le lien sera crée du même type que sa cible. Dans le cas où cible n'existe pas, si *target_is_directory* vaut ``True`` le lien symbolique sera créé comme un répertoire, sinon comme un fichier (par défaut). Sur les autres plateformes, *target_id_directory* est ignoré.

source: :exc:`OSError` is raised when the function is called by an unprivileged user.
fr: :exc:`OSError` est levée quand la fonction est appelée par un utilisateur sans privilèges.

source: Added the *dir_fd* argument, and now allow *target_is_directory* on non-Windows platforms.
fr: Ajout de l'argument *dir_fd* et maintenant, permission de *target_is_directory* sur les plate-formes non Windows.

source: Force write of everything to disk.
fr: Force l'écriture de tout sur le disque.

source: Truncate the file corresponding to *path*, so that it is at most *length* bytes in size.
fr: Tronque le fichier correspondant à *path*, afin qu'il soit au maximum long de *length* bytes.

source: Remove (delete) the file *path*. This function is semantically identical to :func:`remove`; the ``unlink`` name is its traditional Unix name. Please see the documentation for :func:`remove` for further information.
fr: Supprime (retire) le fichier *path*. Cette fonction est sémantiquement identique à :func:`remove`. Le nom ``unlink`` est un nom Unix traditionnel. Veuillez voir la documentation de :func:`remove` pour plus d'informations.

source: Set the access and modified times of the file specified by *path*.
fr: Voir les derniers moments d'accès et de modification du fichier spécifiés par *path*.

source: :func:`utime` takes two optional parameters, *times* and *ns*. These specify the times set on *path* and are used as follows:
fr: La fonction :func:`utime` prend deux paramètres optionnels, *times* et *ns*. Ils spécifient le temps mis pour *path* et est utilisé comme suit :

source: If *ns* is specified, it must be a 2-tuple of the form ``(atime_ns, mtime_ns)`` where each member is an int expressing nanoseconds.
fr: Si *ns* est spécifié, ce doit être un couple de la forme ``(atime_ns, mtime_ns)`` où chaque membre est un entier qui exprime des nanosecondes.

source: If *times* is not ``None``, it must be a 2-tuple of the form ``(atime, mtime)`` where each member is an int or float expressing seconds.
fr: Si *times* ne vaut pas ``None``, ce doit être un couple de la forme ``(atime, mtime)`` où chaque membre est un entier ou une expression à virgule flottante.

source: If *times* is ``None`` and *ns* is unspecified, this is equivalent to specifying ``ns=(atime_ns, mtime_ns)`` where both times are the current time.
fr: Si *times* vaut ``None``, et *ns* est non-spécifié. C'est équivalent à spécifier ``ns = (atime_ns, mtime_ns)`` où les deux moments sont le moment actuel.

source: It is an error to specify tuples for both *times* and *ns*.
fr: Il est erroné de spécifier des tuples pour *times* et *ns* à la fois.

source: Generate the file names in a directory tree by walking the tree either top-down or bottom-up. For each directory in the tree rooted at directory *top* (including *top* itself), it yields a 3-tuple ``(dirpath, dirnames, filenames)``.
fr: Génère les noms de fichier dans un arbre de répertoire en parcourant l'arbre soit de bas-en-haut, soit de haut-en-bas. Pour chaque répertoire dans l'arbre enraciné en le répertoire *rop* (incluant ledit répertoire *top*), fournit un triplet ``(dirpath, dirnames, filenames)``.

source: *dirpath* is a string, the path to the directory. *dirnames* is a list of the names of the subdirectories in *dirpath* (excluding ``'.'`` and ``'..'``). *filenames* is a list of the names of the non-directory files in *dirpath*. Note that the names in the lists contain no path components. To get a full path (which begins with *top*) to a file or directory in *dirpath*, do ``os.path.join(dirpath, name)``.
fr: *dirpath* est une chaîne de caractères contenant le chemin vers le répertoire. *dirnames* est une liste de noms de sous-répertoires dans *dirpath* (en excluant ``'.'`` et ``'..'``). *filenames* est une liste de fichiers (non-répertoires) dans *dirpath*. Notez que les noms dans la liste ne contiennent aucune composante de chemin. Pour récupérer le chemin complet (qui commence à *top*) vers un répertoire dans *dirpath*, faites ``os.path.join(dirpath, name)``.

source: If optional argument *topdown* is ``True`` or not specified, the triple for a directory is generated before the triples for any of its subdirectories (directories are generated top-down). If *topdown* is ``False``, the triple for a directory is generated after the triples for all of its subdirectories (directories are generated bottom-up). No matter the value of *topdown*, the list of subdirectories is retrieved before the tuples for the directory and its subdirectories are generated.
fr: Si l'argument optionnel *topdown* vaut ``True`` ou n'est pas spécifié, le triplet pour un répertoire est généré avant les triplets de tous ses sous-répertoires (les répertoires sont générés de haut-en-bas). Si *topdown* vaut ``False``, le triplet pour un répertoire est généré après les triplets de tous ses sous-répertoires (les répertoires sont générés de bas-en-haut). Peu importe la valeur de *topdown*, la liste des sous-répertoires est récupérée avant que les tuples pour le répertoires et ses sous-répertoires ne soient générés.

source: When *topdown* is ``True``, the caller can modify the *dirnames* list in-place (perhaps using :keyword:`del` or slice assignment), and :func:`walk` will only recurse into the subdirectories whose names remain in *dirnames*; this can be used to prune the search, impose a specific order of visiting, or even to inform :func:`walk` about directories the caller creates or renames before it resumes :func:`walk` again. Modifying *dirnames* when *topdown* is ``False`` has no effect on the behavior of the walk, because in bottom-up mode the directories in *dirnames* are generated before *dirpath* itself is generated.
fr: Quand *topdown* vaut ``True``, l'appelant peut modifier la liste *dirnames* en place (par exemple en utilisant :keyword:`del` ou l'assignation par *slicing* (par tranches)) et :func:`walk` ne fera sa récursion que dans les sous-répertoires dont le nom reste dans *dirnames* ; cela peut être utilisé pour élaguer la recherche, imposer un ordre particulier de visite, ou encore pour informer :func:`walk` des répertoires créés par l'appelant ou renommés avant qu'il quitte :func:`walk` à nouveau. Modifier *dirnames* quand *topdown* vaut ``False`` n'a aucun effet dur le comportement du parcours parce qu'en mode bas-en-haut, les répertoires dans *dirnames* sont générés avant que *dirpath* ne soit lui-même généré.

source: By default, errors from the :func:`scandir` call are ignored. If optional argument *onerror* is specified, it should be a function; it will be called with one argument, an :exc:`OSError` instance. It can report the error to continue with the walk, or raise the exception to abort the walk. Note that the filename is available as the ``filename`` attribute of the exception object.
fr: Par défaut, les erreurs d'un appel à :func:`scandir` sont ignorées. Si l'argument optionnel *onerror* est spécifié, il doit être une fonction qui sera appelée avec un seul argument, une instance de :exc:`OSError`. Elle peut rapporter l'erreur et continuer le parcours, ou lever l'exception pour avorter le parcours. Notez que le nom de fichier est disponible dans l'attribut ``filename`` de l'objet exception.

source: By default, :func:`walk` will not walk down into symbolic links that resolve to directories. Set *followlinks* to ``True`` to visit directories pointed to by symlinks, on systems that support them.
fr: Par défaut, :func:`walk` ne parcourra pas les liens symboliques qui mènent à un répertoire. Définissez *followlinks* avec ``True`` pour visiter les répertoires pointés par des liens symboliques sur les systèmes qui le gère.

source: Be aware that setting *followlinks* to ``True`` can lead to infinite recursion if a link points to a parent directory of itself. :func:`walk` does not keep track of the directories it visited already.
fr: Soyez au courant que définir *followlinks* avec ``True`` peut mener à une récursion infinie si un lien pointe vers un répertoire parent de lui-même. :func:`walk` ne garde pas de trace des répertoires qu'il a déjà visité.

source: If you pass a relative pathname, don't change the current working directory between resumptions of :func:`walk`. :func:`walk` never changes the current directory, and assumes that its caller doesn't either.
fr: Si vous passez un chemin relatif, ne changer pas le répertoire de travail actuel entre deux exécutions de :func:`walk`. :func:`walk` ne change jamais le répertoire actuel, et suppose que l'appelant ne le fait pas non plus.

source: This example displays the number of bytes taken by non-directory files in each directory under the starting directory, except that it doesn't look under any CVS subdirectory::
fr: Cet exemple affiche le nombre de bytes pris par des fichiers non-répertoires dans chaque répertoire à partir du répertoire de départ, si ce n'est qu'il ne cherche pas après un sous-répertoire CSV ::

source: In the next example (simple implementation of :func:`shutil.rmtree`), walking the tree bottom-up is essential, :func:`rmdir` doesn't allow deleting a directory before the directory is empty::
fr: Dans l'exemple suivant (simple implémentation d'un :func:`shutil.rmtree`), parcourir l'arbre de bas-en-haut est essentiel : :func:`rmdir` ne permet pas de supprimer un répertoire avant qu'un ne soit vide ::

source: This function now calls :func:`os.scandir` instead of :func:`os.listdir`, making it faster by reducing the number of calls to :func:`os.stat`.
fr: Cette fonction appelle maintenant :func:`os.scandir` au lieu de :func:`os.listdir`, ce qui la rend plus rapide en réduisant le nombre d'appels à :func:`os.stat`.

source: This behaves exactly like :func:`walk`, except that it yields a 4-tuple ``(dirpath, dirnames, filenames, dirfd)``, and it supports ``dir_fd``.
fr: Se comporte exactement comme :func:`walk`, si ce n'est qu'il fournit un quadruplet ``(dirpath, dirnames, filenames, dirfd)``, et gère ``dir_fd``.

source: *dirpath*, *dirnames* and *filenames* are identical to :func:`walk` output, and *dirfd* is a file descriptor referring to the directory *dirpath*.
fr: *dirpath*, *dirnames* et *filenames* sont identiques à la sortie de :func:`walk` et *dirfd* est un descripteur de fichier faisant référence au répertoire *dirpath*.
