Repository: python/python-docs-fr
Catalog: library/os.po
Languages: fr

source: This function can support specifying :ref:`paths relative to directory descriptors <dir_fd>` and :ref:`not following symlinks <follow_symlinks>`.
fr: Cette fonction peut gérer la spécification de :ref:`chemins relatifs vers des descripteurs de fichiers <dir_fd>` et :ref:`le suivi des liens symboliques <follow_symlinks>`.

source: If *effective_ids* is ``True``, :func:`access` will perform its access checks using the effective uid/gid instead of the real uid/gid. *effective_ids* may not be supported on your platform; you can check whether or not it is available using :data:`os.supports_effective_ids`. If it is unavailable, using it will raise a :exc:`NotImplementedError`.
fr: Si *effective_id* vaut ``True``, :func:`access` effectuera ses vérifications d'accès en utilisant l'*uid*/*gid* effectif à la place de l'*uid*/*gid* réel. *effective_ids* peut ne pas être géré sur votre plate-forme, vous pouvez vérifier s'il est disponible en utilisant :data:`os.supports_effective_ids`. S'il est indisponible, l'utiliser lèvera une :exc:`NotImplementedError`.

source: Using :func:`access` to check if a user is authorized to e.g. open a file before actually doing so using :func:`open` creates a security hole, because the user might exploit the short time interval between checking and opening the file to manipulate it. It's preferable to use :term:`EAFP` techniques. For example::
fr: Utiliser :func:`access` pour vérifier si un utilisateur est autorisé (par exemple) à ouvrir un fichier avant d'effectivement le faire en utilisant :func:`open` crée une faille de sécurité : l'utilisateur peut exploiter le court intervalle de temps entre la vérification et l'ouverture du fichier pour le manipuler. Il est préférable d'utiliser les techniques :term:`EAFP`. Par exemple ::

source: is better written as::
fr: est mieux écrit comme suit ::

source: I/O operations may fail even when :func:`access` indicates that they would succeed, particularly for operations on network filesystems which may have permissions semantics beyond the usual POSIX permission-bit model.
fr: Les opérations d'entrées/sorties peuvent échouer même quand :func:`access` indique qu'elles devraient réussir, particulièrement pour les opérations sur les systèmes de fichiers réseaux qui peuvent avoir une sémantique de permissions au-delà du modèle de bits de permission usuel POSIX.

source: Added the *dir_fd*, *effective_ids*, and *follow_symlinks* parameters.
fr: Paramètres *dir_fd*, *effective_ids*, et *follow_symlinks* ajoutés.

source: Values to pass as the *mode* parameter of :func:`access` to test the existence, readability, writability and executability of *path*, respectively.
fr: Valeurs à passer au paramètre *mode* de :func:`access` pour tester respectivement l'existence, les droits de lecture, d'écriture et d'exécution.

source: Change the current working directory to *path*.
fr: Change le répertoire de travail actuel par *path*.

source: This function can support :ref:`specifying a file descriptor <path_fd>`. The descriptor must refer to an opened directory, not an open file.
fr: Cette fonction prend en charge :ref:`la spécification d'un descripteur de fichier <path_fd>`. Le descripteur doit référencer un répertoire ouvert, pas un fichier ouvert.

source: Added support for specifying *path* as a file descriptor on some platforms.
fr: Prise en charge de la spécification de *path* par un descripteur de fichier sur certaines plate-formes.

source: Set the flags of *path* to the numeric *flags*. *flags* may take a combination (bitwise OR) of the following values (as defined in the :mod:`stat` module):
fr: Définit les marqueurs de *path* par la valeur numérique *flags*. *flags* peut prendre une combinaison (OU bit-à-bit) des valeurs suivantes (comme défini dans le module :mod:`stat`) :

source: This function can support :ref:`not following symlinks <follow_symlinks>`.
fr: Cette fonction prend en charge :ref:`le suivi des liens symboliques <follow_symlinks>`.

source: The *follow_symlinks* argument.
fr: L'argument *follow_symlinks*.

source: Change the mode of *path* to the numeric *mode*. *mode* may take one of the following values (as defined in the :mod:`stat` module) or bitwise ORed combinations of them:
fr: Change le mode de *path* par la valeur numérique *mode*. *mode* peut prendre une des valeurs suivantes (comme défini dans le module :mod:`stat`) ou une combinaison (OU bit-à-bit) de ces valeurs :

source: This function can support :ref:`specifying a file descriptor <path_fd>`, :ref:`paths relative to directory descriptors <dir_fd>` and :ref:`not following symlinks <follow_symlinks>`.
fr: Cette fonction prend en charge :ref:`la spécification d'un descripteur de fichier <path_fd>`, :ref:`les chemins relatifs à des descripteurs de répertoires <dir_fd>`, et :ref:`le non-suivi des liens symboliques <follow_symlinks>`.

source: Although Windows supports :func:`chmod`, you can only set the file's read-only flag with it (via the ``stat.S_IWRITE`` and ``stat.S_IREAD`` constants or a corresponding integer value). All other bits are ignored.
fr: Bien que Windows gère :func:`chmod`, vous ne pouvez y définir que le marqueur de lecture-seule du fichier (via les constantes ``stat.S_IWRITE`` et ``stat.S_IREAD`` ou une constante entière correspondante). Tous les autres bits sont ignorés.

source: Added support for specifying *path* as an open file descriptor, and the *dir_fd* and *follow_symlinks* arguments.
fr: Prise en charge de la spécification de *path* par un répertoire ouvert et des arguments *dir_fd* et *follow_symlinks* ajoutés.

source: Change the owner and group id of *path* to the numeric *uid* and *gid*. To leave one of the ids unchanged, set it to -1.
fr: Change l'identifiant du propriétaire et du groupe de *path* par les valeurs numériques *uid* et *gid*. Pour laisser l'un de ces identifiants inchangé, le définir à ``-1``.

source: See :func:`shutil.chown` for a higher-level function that accepts names in addition to numeric ids.
fr: Voir :func:`shutil.chown` pour une fonction de plus haut-niveau qui accepte des noms en plus des identifiants numériques.

source: Supports a :term:`path-like object`.
fr: Accepte un :term:`path-like object`.

source: Change the root directory of the current process to *path*.
fr: Change le répertoire racine du processus actuel par *path*.

source: Change the current working directory to the directory represented by the file descriptor *fd*. The descriptor must refer to an opened directory, not an open file. As of Python 3.3, this is equivalent to ``os.chdir(fd)``.
fr: Change le répertoire de travail actuel par le répertoire représenté par le descripteur de fichier *fd*. Le descripteur doit référencer un répertoire ouvert, pas un fichier ouvert. Depuis Python 3.3, c'est équivalent à ``os.chdir(fd)``.

source: Return a string representing the current working directory.
fr: Renvoie une chaîne de caractères représentant le répertoire de travail actuel.

source: Return a bytestring representing the current working directory.
fr: Renvoie une chaîne de *bytes* représentant le répertoire de travail actuel.

source: Set the flags of *path* to the numeric *flags*, like :func:`chflags`, but do not follow symbolic links. As of Python 3.3, this is equivalent to ``os.chflags(path, flags, follow_symlinks=False)``.
fr: Définit les marqueurs de *path* par la valeur numérique *flags*, comme :func:`chflags`, mais ne suit pas les liens symboliques. Depuis Python 3.3, c'est équivalent à ``os.chflags(path, flags, follow_symlinks=False)``.

source: Change the mode of *path* to the numeric *mode*. If path is a symlink, this affects the symlink rather than the target. See the docs for :func:`chmod` for possible values of *mode*. As of Python 3.3, this is equivalent to ``os.chmod(path, mode, follow_symlinks=False)``.
fr: Change le mode de *path* par la valeur numérique *mode*. Si *path* est un lien symbolique, ça affecte le lien symbolique à la place de la cible. Voir la documentation pour les valeurs possibles de *mode* pour :func:`chmod`. Depuis Python 3.3, c'est équivalent à ``os.chmod(path, mode, follow_symlinks=False)``.

source: Change the owner and group id of *path* to the numeric *uid* and *gid*. This function will not follow symbolic links. As of Python 3.3, this is equivalent to ``os.chown(path, uid, gid, follow_symlinks=False)``.
fr: Change les identifiants du propriétaire et du groupe de *path* par *uid* et *gid*. Cette fonction ne suivra pas les liens symboliques. Depuis Python 3.3, c'est équivalent à ``os.chown(path, uid, gid, follow_symlinks=False)``.

source: Create a hard link pointing to *src* named *dst*.
fr: Crée un lien matériel appelé *dst* pointant sur *src*.

source: This function can support specifying *src_dir_fd* and/or *dst_dir_fd* to supply :ref:`paths relative to directory descriptors <dir_fd>`, and :ref:`not following symlinks <follow_symlinks>`.
fr: Cette fonction prend en charge la spécification *src_dir_fd* et/ou *dst_dir_fd* pour préciser :ref:`des chemins relatifs à des descripteurs de répertoires <dir_fd>`, et :ref:`le non-suivi des liens symboliques <follow_symlinks>`.

source: Added Windows support.
fr: Prise en charge de Windows.

source: Added the *src_dir_fd*, *dst_dir_fd*, and *follow_symlinks* arguments.
fr: Arguments *src_dir_fd*, *dst_dir_fd*, et *follow_symlinks* ajoutés.

source: Accepts a :term:`path-like object` for *src* and *dst*.
fr: Accepte un :term:`path-like object` pour *src* et *dst*.

source: Return a list containing the names of the entries in the directory given by *path*. The list is in arbitrary order, and does not include the special entries ``'.'`` and ``'..'`` even if they are present in the directory.
fr: Renvoie une liste contenant le nom des entrées dans le répertoire donné par *path*. La liste est dans un ordre arbitraire et n'inclut pas les entrées spéciales ``'.'`` et ``'..'`` même si elles sont présentes dans le répertoire.

source: *path* may be a :term:`path-like object`. If *path* is of type ``bytes`` (directly or indirectly through the :class:`PathLike` interface), the filenames returned will also be of type ``bytes``; in all other circumstances, they will be of type ``str``.
fr: *path* peut être un :term:`path-like object`. Si *path* est de type ``bytes`` (directement ou indirectement à travers une interface :class:`PathLike`), les noms de fichiers renvoyés seront aussi de type ``bytes`` ; dans toutes les autres circonstances, ils seront de type ``str``.

source: This function can also support :ref:`specifying a file descriptor <path_fd>`; the file descriptor must refer to a directory.
fr: Cette fonction peut également gérer :ref:`la spécification de descripteurs de fichiers<path_fd>`. Le descripteur doit référencer un répertoire.

source: To encode ``str`` filenames to ``bytes``, use :func:`~os.fsencode`.
fr: Pour encoder des noms de fichiers de type ``str`` en ``bytes``, utilisez la fonction :func:`~os.encode`.

source: The :func:`scandir` function returns directory entries along with file attribute information, giving better performance for many common use cases.
fr: La fonction :func:`scandir` renvoie les entrées du répertoire ainsi que leurs attributs , offrant une meilleure performance pour beaucoup de cas utilisés fréquemment.

source: The *path* parameter became optional.
fr: Le paramètre *path* est devenu optionnel.

source: Perform the equivalent of an :c:func:`lstat` system call on the given path. Similar to :func:`~os.stat`, but does not follow symbolic links. Return a :class:`stat_result` object.
fr: Effectue l'équivalent d'un appel système :c:func:`lstat` sur le chemin donné. Similaire à :func:`~os.stat` mais ne suit pas les liens symboliques. Renvoie un objet de type :class:`stat_result`.

source: On platforms that do not support symbolic links, this is an alias for :func:`~os.stat`.
fr: Sur les plate-formes qui ne gérant pas les liens symboliques, c'est un alias pour :func:`~os.stat`.

source: As of Python 3.3, this is equivalent to ``os.stat(path, dir_fd=dir_fd, follow_symlinks=False)``.
fr: Depuis Python 3.3, c'est équivalent à ``os.stat(path, dir_fd=dir_fd, follow_symlinks=False)``.

source: This function can also support :ref:`paths relative to directory descriptors <dir_fd>`.
fr: Cette fonction peut également gérer :ref:`des chemins relatifs à des descripteurs de répertoires <dir_fd>`.

source: Added support for Windows 6.0 (Vista) symbolic links.
fr: Prise en charge des les liens symboliques sur Windows 6.0 (Vista).

source: Added the *dir_fd* parameter.
fr: Paramètre *dir_fd* ajouté.

source: Create a directory named *path* with numeric mode *mode*.
fr: Crée un répertoire appelé *path* avec pour mode, la valeur numérique *mode*.

source: If the directory already exists, :exc:`FileExistsError` is raised.
fr: Si le répertoire existe déjà, :exc:`FileExistsError` est levée.

source: On some systems, *mode* is ignored. Where it is used, the current umask value is first masked out. If bits other than the last 9 (i.e. the last 3 digits of the octal representation of the *mode*) are set, their meaning is platform-dependent. On some platforms, they are ignored and you should call :func:`chmod` explicitly to set them.
fr: Sous certains systèmes, *mode* est ignoré. Quand il est utilisé, il lui est premièrement appliqué le masque courant *umask*. Si des bits autres que les 9 derniers sont activés (i.e. les 3 derniers chiffres de la représentation octale de *mode*), leur signification sera dépendante de la plate-forme. Sous certaines plate-formes, ils seront ignorés et vous devrez appeler explicitement :func:`chmod` pour les modifier.

source: It is also possible to create temporary directories; see the :mod:`tempfile` module's :func:`tempfile.mkdtemp` function.
fr: Il est également possible de créer des répertoires temporaires, voir la fonction :func:`tempfile.mkdtemp` du module :mod:`tempfile`.

source: Recursive directory creation function. Like :func:`mkdir`, but makes all intermediate-level directories needed to contain the leaf directory.
fr: Fonction de création récursive de répertoires. Comme :func:`mkdir` mais crée tous les répertoires de niveau intermédiaire nécessaires pour contenir le répertoire "feuille".

source: The *mode* parameter is passed to :func:`mkdir` for creating the leaf directory; see :ref:`the mkdir() description <mkdir_modebits>` for how it is interpreted. To set the file permission bits of any newly-created parent directories you can set the umask before invoking :func:`makedirs`. The file permission bits of existing parent directories are not changed.
fr: Le paramètre *mode* est passé à :func:`mkdir` pour créer le répertoire feuille ; reportez-vous à :ref:`la description de mkdir() <mkdir_modebits>` pour la manière dont il est interprété. Pour définir les bits de permissions des répertoires intermédiaires nouvellement créés, vous pouvez définir la valeur de *umask* avant d'invoquer :func:`makedirs`. Les bits de permissions des répertoires intermédiaires déjà existants ne sont pas modifiés.

source: :func:`makedirs` will become confused if the path elements to create include :data:`pardir` (eg. ".." on UNIX systems).
fr: Un appel à :func:`makedirs` est confus si les éléments du chemin à créer contiennent :data:`pardir` (par exemple, ".." sur les systèmes UNIX).

source: This function handles UNC paths correctly.
fr: Cette fonction gère les chemins UNC correctement.

source: The *exist_ok* parameter.
fr: Le paramètre *exist_ok*.

source: Before Python 3.4.1, if *exist_ok* was ``True`` and the directory existed, :func:`makedirs` would still raise an error if *mode* did not match the mode of the existing directory. Since this behavior was impossible to implement safely, it was removed in Python 3.4.1. See :issue:`21082`.
fr: Avant Python 3.4.1, si *exist_ok* valait ``True`` et le répertoire à créer existait, :func:`makedirs` aurait levé une erreur si *mode* n'était pas équivalent au mode du répertoire existant. Puisque ce comportement n'était pas possible ) implémenter de manière sécurisée, il a été retiré pour Python 3.4.1. Voir :issue:`21082`.

source: The *mode* argument no longer affects the file permission bits of newly-created intermediate-level directories.
fr: L'argument *mode* n'affecte plus les bits d'autorisation de fichier des répertoires intermédiaires créés.

source: Create a FIFO (a named pipe) named *path* with numeric mode *mode*. The current umask value is first masked out from the mode.
fr: Crée un FIFO (*First In, First Out*, ou un tube (*pipe* en anglais) nommé) appelé *path* avec le mode numérique *mode*. La valeur actuelle de *umask* est d'abord masquée du mode.

source: FIFOs are pipes that can be accessed like regular files. FIFOs exist until they are deleted (for example with :func:`os.unlink`). Generally, FIFOs are used as rendezvous between "client" and "server" type processes: the server opens the FIFO for reading, and the client opens it for writing. Note that :func:`mkfifo` doesn't open the FIFO --- it just creates the rendezvous point.
fr: Les FIFOs sont des tubes qui peuvent être accédés comme des fichiers normaux. Les FIFOs existent jusqu'à ce qu'ils soient retirés (par exemple, à l'aide de :func:`os.unlink`). Généralement, les FIFOs sont utilisé comme communication entre des processus de type "client" et "serveur" : le serveur ouvre le FIFO pour le lire, et le client l'ouvre pour écrire dedans. Notez que :func:`mkfifo` n'ouvre pas le FIFO — il crée juste un point de rendez-vous.

source: Create a filesystem node (file, device special file or named pipe) named *path*. *mode* specifies both the permissions to use and the type of node to be created, being combined (bitwise OR) with one of ``stat.S_IFREG``, ``stat.S_IFCHR``, ``stat.S_IFBLK``, and ``stat.S_IFIFO`` (those constants are available in :mod:`stat`). For ``stat.S_IFCHR`` and ``stat.S_IFBLK``, *device* defines the newly created device special file (probably using :func:`os.makedev`), otherwise it is ignored.
fr: Crée un nœud du système de fichiers (fichier, périphérique, fichier spécial, ou tuyau nommé) appelée *path*. *mode* spécifie à la fois les permissions à utiliser et le type de nœud à créer, en étant combiné (OR bit-à-bit) avec l'une des valeurs suivantes : ``stat.S_IFREG``, ``stat.S_IFCHR``, ``stat.S_IFBLK``, et ``stat.S_IFIFO`` (ces constantes sont disponibles dans le module :mod:`stat`). Pour ``stat.S_IFCHR`` et ``stat.S_IFBLK``, *device* définit le fichier spécial de périphérique tout juste créé (probablement en utilisant :func:`os.makedev`), sinon, cet argument est ignoré.

source: Extract the device major number from a raw device number (usually the :attr:`st_dev` or :attr:`st_rdev` field from :c:type:`stat`).
fr: Extrait le nombre majeur de périphérique d'un nombre de périphérique brut (habituellement le champ :attr:`st_dev` ou :attr:`st_rdev` de :c:type:`stat`).

source: Extract the device minor number from a raw device number (usually the :attr:`st_dev` or :attr:`st_rdev` field from :c:type:`stat`).
fr: Extrait le nombre mineur de périphérique d'un nombre de périphérique brut (habituellement le champ :attr:`st_dev` ou :attr:`st_rdev` de :c:type:`stat`).

source: Compose a raw device number from the major and minor device numbers.
fr: Compose un nombre de périphérique brut à partir des nombres de périphérique mineur et majeur.

source: Return system configuration information relevant to a named file. *name* specifies the configuration value to retrieve; it may be a string which is the name of a defined system value; these names are specified in a number of standards (POSIX.1, Unix 95, Unix 98, and others). Some platforms define additional names as well. The names known to the host operating system are given in the ``pathconf_names`` dictionary. For configuration variables not included in that mapping, passing an integer for *name* is also accepted.
fr: Renvoie des informations sur la configurations relatives à un fichier déterminé. *name* spécifie la valeur de configuration à récupérer ; ce peut être une chaîne de caractères qui est le nom d'une valeur système particulière. Ces noms sont spécifiés dans certains standards (POSIX.1, Unix 95, Unix 98, etc). Certaines plate-formes définissent des noms supplémentaires également. Les noms connus du système d'exploitation hôte sont donnés dans le dictionnaire ``pathconf_names``. Pour les variables de configuration non incluses dans ce *mapping*, passer un entier pour *name* est également accepté.

source: This function can support :ref:`specifying a file descriptor <path_fd>`.
fr: Cette fonction prend en charge :ref:`la spécification d'un descripteur de fichier <path_fd>`.

source: Dictionary mapping names accepted by :func:`pathconf` and :func:`fpathconf` to the integer values defined for those names by the host operating system. This can be used to determine the set of names known to the system.
fr: Dictionnaire liant les noms acceptés par les fonctions :func:`pathconf` et :func:`fpathconf` aux valeurs entières définies pour ces noms par le système d'exploitation hôte. Cette variable peut être utilisée pour déterminer l'ensemble des noms connus du système d'exploitation.

source: Return a string representing the path to which the symbolic link points. The result may be either an absolute or relative pathname; if it is relative, it may be converted to an absolute pathname using ``os.path.join(os.path.dirname(path), result)``.
fr: Renvoie une chaîne de caractères représentant le chemin vers lequel le lien symbolique pointe. Le résultat peut être soit un chemin relatif, soit un chemin absolu. S'il est relatif, il peut être converti en chemin absolu en utilisant ``os.path.join(os.path.dirname(path), result)``.

source: If the *path* is a string object (directly or indirectly through a :class:`PathLike` interface), the result will also be a string object, and the call may raise a UnicodeDecodeError. If the *path* is a bytes object (direct or indirectly), the result will be a bytes object.
fr: Si *path* est une chaîne de caractères (directement ou indirectement à travers une interface :class:`PathLike`), le résultat sera aussi une chaîne de caractères, et l'appel pourra lever une UnicodeDecodeError. Si *path* est une chaîne d'octets (directement ou indirectement), le résultat sera une chaîne d'octets.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>`.
fr: Cette fonction prend en charge :ref:`des chemins relatifs à des descripteurs de répertories <dir_fd>`.

source: On Windows, attempting to remove a file that is in use causes an exception to be raised; on Unix, the directory entry is removed but the storage allocated to the file is not made available until the original file is no longer in use.
fr: Sur Windows, tenter de retirer un fichier en cours d'utilisation cause la levée d'une exception, sur Unix, l'entrée du répertoire est supprimé mais l'espace de stockage alloué au fichier ne sera pas disponible avant que le fichier original ne soit plus utilisé.

source: This function is semantically identical to :func:`unlink`.
fr: La fonction est sémantiquement identique à :func:`unlink`.
