Repository: python/python-docs-fr
Catalog: library/os.po
Languages: fr

source: Remove directories recursively. Works like :func:`rmdir` except that, if the leaf directory is successfully removed, :func:`removedirs` tries to successively remove every parent directory mentioned in *path* until an error is raised (which is ignored, because it generally means that a parent directory is not empty). For example, ``os.removedirs('foo/bar/baz')`` will first remove the directory ``'foo/bar/baz'``, and then remove ``'foo/bar'`` and ``'foo'`` if they are empty. Raises :exc:`OSError` if the leaf directory could not be successfully removed.
fr: Supprime des répertoires récursivement. Fonctionne comme :func:`rmdir` si ce n'est que si le répertoire feuille est retiré avec succès, :func:`removedirs` essaye de supprimer successivement chaque répertoire parent mentionné dans *path* jusqu'à ce qu'un erreur ne soit levée (ce qui est ignoré car la signification générale en est qu'un répertoire parent n'est pas vide). Par exemple, ``os.removedirs('foo/bar/baz')`` supprimera d'abord le répertoire ``'foo/bar/baz'``, et ensuite supprimera ``'foo/bar'`` et puis ``'foo'`` s'ils sont vides. Lève une :exc:`OSError` si le répertoire feuille n'a pas pu être supprimé avec succès.

source: This function can support specifying *src_dir_fd* and/or *dst_dir_fd* to supply :ref:`paths relative to directory descriptors <dir_fd>`.
fr: Cette fonction prend en charge les spécifications *src_dir_fd* et/ou *dst_dir_fd* pour fournir :ref:`des chemins relatifs à des descripteurs de fichiers <dir_fd>`.

source: If you want cross-platform overwriting of the destination, use :func:`replace`.
fr: Si cous désirez un écrasement multiplate-forme de la destination, utilisez la fonction :func:`replace`.

source: The *src_dir_fd* and *dst_dir_fd* arguments.
fr: Les arguments *src_dir_fd* et *dst_dir_fd*.

source: Recursive directory or file renaming function. Works like :func:`rename`, except creation of any intermediate directories needed to make the new pathname good is attempted first. After the rename, directories corresponding to rightmost path segments of the old name will be pruned away using :func:`removedirs`.
fr: Fonction récursive de renommage de fichiers ou répertoires. Fonctionne comme :func:`rename`, si ce n'est que la création d'un répertoire intermédiaire nécessaire pour rendre le nouveau chemin correct est essayé en premier. Après le renommage, les répertoires correspondant aux segments de chemin les plus à droite de l'ancien nom seront élagués en utilisant :func:`removedirs`.

source: This function can fail with the new directory structure made if you lack permissions needed to remove the leaf directory or file.
fr: Cette fonction peut échouer avec la nouvelle structure de dictionnaire définie si vous n'avez pas les permissions nécessaires pour supprimer le répertoire ou fichier feuille.

source: Accepts a :term:`path-like object` for *old* and *new*.
fr: Accepte un :term:`path-like object` pour *old* et *new*.

source: Rename the file or directory *src* to *dst*. If *dst* is a directory, :exc:`OSError` will be raised. If *dst* exists and is a file, it will be replaced silently if the user has permission. The operation may fail if *src* and *dst* are on different filesystems. If successful, the renaming will be an atomic operation (this is a POSIX requirement).
fr: Renomme le fichier ou le répertoire *src* en *dst*. Si *dst* est un répertoire, une :exc:`OSError` est levée. Si *dst* existe et est un fichier, il sera remplacé silencieusement si l'utilisateur en a les permissions. L'opération peut échouer si *src* et *dst* sont sur un système de fichiers différent. Si le renommage est effectué avec succès, il est une opération atomique (nécessité POSIX).

source: The *dir_fd* parameter.
fr: Le paramètre *dir_fd*.

source: Return an iterator of :class:`os.DirEntry` objects corresponding to the entries in the directory given by *path*. The entries are yielded in arbitrary order, and the special entries ``'.'`` and ``'..'`` are not included.
fr: Renvoie un itérateur d'objets :class:`os.DirEntry` correspondant aux entrées dans le répertoire indiqué par *path*. Les entrées sont produites dans un ordre arbitraire, et les entrées spéciales ``'.'`` et ``'..'`` ne sont pas incluses.

source: Using :func:`scandir` instead of :func:`listdir` can significantly increase the performance of code that also needs file type or file attribute information, because :class:`os.DirEntry` objects expose this information if the operating system provides it when scanning a directory. All :class:`os.DirEntry` methods may perform a system call, but :func:`~os.DirEntry.is_dir` and :func:`~os.DirEntry.is_file` usually only require a system call for symbolic links; :func:`os.DirEntry.stat` always requires a system call on Unix but only requires one for symbolic links on Windows.
fr: Utiliser :func:`scandir` plutôt que :func:`listdir` peut significativement améliorer les performances des codes qui nécessitent aussi l'accès aux types des fichiers ou à leurs attributs, puisque les objets :class:`os.DirEntry` exposent ces informations si le système d'exploitation les fournit en scannant le répertoire. Toutes les méthodes de :class:`os.DirEntry` peuvent réaliser un appel système, mais :func:`~os.DirEntry.is_dir` et :func:`~os.DirEntry.is_file` n'en requièrent normalement un que pour les liens symboliques ; :func:`os.DirEntry.stat` nécessite toujours un appel système sous Unix, mais seulement pour les liens symboliques sous Windows.

source: *path* may be a :term:`path-like object`. If *path* is of type ``bytes`` (directly or indirectly through the :class:`PathLike` interface), the type of the :attr:`~os.DirEntry.name` and :attr:`~os.DirEntry.path` attributes of each :class:`os.DirEntry` will be ``bytes``; in all other circumstances, they will be of type ``str``.
fr: *path* peut être un :term:`path-like object`. Si *path* est de type ``bytes`` (directement ou indirectement à travers une interface :class:`PathLike`), le type des attributs :attr:`~os.DirEntry.name` et :attr:`~os.DirEntry.path` de chaque :class:`os.DirEntry` sera ``bytes`` ; dans toutes les autres circonstances, ils seront de type ``str``.

source: The :func:`scandir` iterator supports the :term:`context manager` protocol and has the following method:
fr: L'itérateur :func:`scandir` gère le protocole :term:`context manager` et possède la méthode suivante :

source: Close the iterator and free acquired resources.
fr: Ferme l'itérateur et libère les ressources acquises.

source: This is called automatically when the iterator is exhausted or garbage collected, or when an error happens during iterating. However it is advisable to call it explicitly or use the :keyword:`with` statement.
fr: Elle est appelée automatiquement quand l'itérateur est entièrement consommé ou collecté par le ramasse-miettes, ou quand une erreur survient durant l'itération. Il est cependant conseillé de l'appeler explicitement ou d'utiliser l'instruction :keyword:`with`.

source: The following example shows a simple use of :func:`scandir` to display all the files (excluding directories) in the given *path* that don't start with ``'.'``. The ``entry.is_file()`` call will generally not make an additional system call::
fr: L'exemple suivant montre une utilisation simple de :func:`scandir` pour afficher tous les fichiers (à part les répertoires) dans le chemin donné par *path* et ne débutant pas par ``'.'``. L'appel ``entry.is_file()`` ne va généralement pas faire d'appel système supplémentaire ::

source: On Unix-based systems, :func:`scandir` uses the system's `opendir() <http://pubs.opengroup.org/onlinepubs/009695399/functions/opendir.html>`_ and `readdir() <http://pubs.opengroup.org/onlinepubs/009695399/functions/readdir_r.html>`_ functions. On Windows, it uses the Win32 `FindFirstFileW <https://msdn.microsoft.com/en-us/library/windows/desktop/aa364418(v=vs.85).aspx>`_ and `FindNextFileW <https://msdn.microsoft.com/en-us/library/windows/desktop/aa364428(v=vs.85).aspx>`_ functions.
fr: Sur les systèmes inspirés de Unix, :func:`scandir` utilise les fonctions système `opendir() <http://pubs.opengroup.org/onlinepubs/009695399/functions/opendir.html>`_ et `readdir() <http://pubs.opengroup.org/onlinepubs/009695399/functions/readdir_r.html>`_ Sur Windows, la fonction utilise les fonctions Win32 `FindFirstFileW <https://msdn.microsoft.com/en-us/library/windows/desktop/aa364418(v=vs.85).aspx>`_ et `FindNextFileW <https://msdn.microsoft.com/en-us/library/windows/desktop/aa364428(v=vs.85).aspx>`_.

source: Added support for the :term:`context manager` protocol and the :func:`~scandir.close()` method. If a :func:`scandir` iterator is neither exhausted nor explicitly closed a :exc:`ResourceWarning` will be emitted in its destructor.
fr: Prise en charge du protocole :term:`context manager` et de la méthode :func:`~scandir.close()`. Si un itérateur sur :func:`scandir` n'est ni entièrement consommé ni explicitement fermé, un :exc:`ResourceWarning` sera émis dans son destructeur.

source: The function accepts a :term:`path-like object`.
fr: La fonction accepte un :term:`path-like object`.

source: Added support for :ref:`file descriptors <path_fd>` on Unix.
fr: Ajout de la gestion des :ref:`descripteurs de fichiers <path_fd>` sur Unix.

source: Object yielded by :func:`scandir` to expose the file path and other file attributes of a directory entry.
fr: Objet donné par :func:`scandir` pour exposer le chemin du fichier et d'autres attributs de fichier d'une entrée du répertoire.

source: :func:`scandir` will provide as much of this information as possible without making additional system calls. When a ``stat()`` or ``lstat()`` system call is made, the ``os.DirEntry`` object will cache the result.
fr: :func:`scandir` fournira autant d'informations que possible sans faire d'appels système additionnels. Quand un appel système ``stat()`` ou ``lstat()`` est réalisé, l'objet ``os.DirEntry`` mettra le résultat en cache.

source: ``os.DirEntry`` instances are not intended to be stored in long-lived data structures; if you know the file metadata has changed or if a long time has elapsed since calling :func:`scandir`, call ``os.stat(entry.path)`` to fetch up-to-date information.
fr: Les instances ``os.DirEntry`` ne sont pas censées être stockées dans des structures de données à longue durée de vie ; si vous savez que les métadonnées du fichier ont changé ou si un certain temps s'est écoulé depuis l'appel à :func:`scandir`, appelez ``os.stat(entry.path)`` pour mettre à jour ces informations.

source: Because the ``os.DirEntry`` methods can make operating system calls, they may also raise :exc:`OSError`. If you need very fine-grained control over errors, you can catch :exc:`OSError` when calling one of the ``os.DirEntry`` methods and handle as appropriate.
fr: Puisque les méthodes de ``os.DirEntry`` peuvent réaliser des appels système, elles peuvent aussi lever des :exc:`OSError`. Si vous avez besoin d'un contrôle fin des erreurs, vous pouvez attraper les :exc:`OSError` en appelant les méthodes de ``os.DirEntry`` et les traiter comme il vous semble.

source: To be directly usable as a :term:`path-like object`, ``os.DirEntry`` implements the :class:`PathLike` interface.
fr: Pour être directement utilisable comme un :term:`path-like object`, ``os.DirEntry`` implémente l'interface :class:`PathLike`.

source: Attributes and methods on a ``os.DirEntry`` instance are as follows:
fr: Les attributs et méthodes des instances de ``os.DirEntry`` sont les suivants :

source: The entry's base filename, relative to the :func:`scandir` *path* argument.
fr: Le nom de fichier de base de l'entrée, relatif à l'argument *path* de :func:`scandir`.

source: The :attr:`name` attribute will be ``bytes`` if the :func:`scandir` *path* argument is of type ``bytes`` and ``str`` otherwise. Use :func:`~os.fsdecode` to decode byte filenames.
fr: L'attribut :attr:`name` sera de type ``bytes`` si l'argument *path* de :func:`scandir` est de type ``bytes``, sinon il sera de type ``str``. Utilisez :func:`~os.fsdecode` pour décoder des noms de fichiers de types *byte*.

source: The entry's full path name: equivalent to ``os.path.join(scandir_path, entry.name)`` where *scandir_path* is the :func:`scandir` *path* argument. The path is only absolute if the :func:`scandir` *path* argument was absolute. If the :func:`scandir` *path* argument was a :ref:`file descriptor <path_fd>`, the :attr:`path` attribute is the same as the :attr:`name` attribute.
fr: Le nom entier de l'entrée : équivalent à ``os.path.join(scandir_path, entry.name)`` où *scandir_path* est l'argument *path* de :func:`scandir`. Le chemin est absolu uniquement si l'argument *path* de :func:`scandir` était absolu. Si l'argument *path* à la fonction :func:`scandir` est un :ref:`descripteur de fichier <path_fd>` l'attribut :attr:`path` sera égal à l'attribut :attr:`name`.

source: The :attr:`path` attribute will be ``bytes`` if the :func:`scandir` *path* argument is of type ``bytes`` and ``str`` otherwise. Use :func:`~os.fsdecode` to decode byte filenames.
fr: L'attribut :attr:`path` sera de type ``bytes`` si l'argument *path* de la fonction :func:`scandir` est de type ``bytes``, sinon il sera de type ``str``. Utilisez :func:`~os.fsdecode` pour décoder des noms de fichiers de type *bytes*.

source: Return the inode number of the entry.
fr: Renvoie le numéro d'*inode* de l'entrée.

source: The result is cached on the ``os.DirEntry`` object. Use ``os.stat(entry.path, follow_symlinks=False).st_ino`` to fetch up-to-date information.
fr: Le résultat est mis en cache dans l'objet ``os.DirEntry``. Utilisez ``os.stat(entry.path, follow_symlinks=False).st_ino`` pour obtenir l'information à jour.

source: On the first, uncached call, a system call is required on Windows but not on Unix.
fr: Au premier appel non mis en cache, un appel système est requis sur Windows, mais pas sur Unix.

source: Return ``True`` if this entry is a directory or a symbolic link pointing to a directory; return ``False`` if the entry is or points to any other kind of file, or if it doesn't exist anymore.
fr: Renvoie ``True`` si cette entrée est un répertoire ou un lien symbolique pointant vers un répertoire ; renvoie ``False`` si l'entrée est (ou pointe vers) un autre type de fichier, ou s'il n'existe plus.

source: If *follow_symlinks* is ``False``, return ``True`` only if this entry is a directory (without following symlinks); return ``False`` if the entry is any other kind of file or if it doesn't exist anymore.
fr: Si *follow_symlinks* vaut ``False``, renvoie ``True`` uniquement si l'entrée est un répertoire (sans suivre les liens symboliques) ; renvoie ``False`` si l'entrée est n'importe quel autre type de fichier ou s'il n'existe plus.

source: The result is cached on the ``os.DirEntry`` object, with a separate cache for *follow_symlinks* ``True`` and ``False``. Call :func:`os.stat` along with :func:`stat.S_ISDIR` to fetch up-to-date information.
fr: Le résultat est mis en cache dans l'objet ``os.DirEntry``, avec un cache séparé pour les valeurs ``True`` ou ``False`` de *follow_symlinks*. Appelez :func:`os.stat` avec :func:`stat.S_ISDIR` pour obtenir l'information à jour.

source: On the first, uncached call, no system call is required in most cases. Specifically, for non-symlinks, neither Windows or Unix require a system call, except on certain Unix file systems, such as network file systems, that return ``dirent.d_type == DT_UNKNOWN``. If the entry is a symlink, a system call will be required to follow the symlink unless *follow_symlinks* is ``False``.
fr: Au premier appel non mis en cache, aucun appel système n'est requis dans la plupart du temps. Spécifiquement, sans les liens symboliques, ni Windows, ni Unix ne requiert l'appel système, sauf sur certains systèmes de fichiers sur Unix, comme les système de fichiers de réseau qui renvoient ``dirent.d_type == DT_UNKNOWN``. Si l'entrée est un lien symbolique, un appel système sera requis pour suivre le lien symbolique, à moins que *follow_symlinks* vaille ``False``.

source: This method can raise :exc:`OSError`, such as :exc:`PermissionError`, but :exc:`FileNotFoundError` is caught and not raised.
fr: Cette méthode peut lever une :exc:`OSError` tout comme une :exc:`PermissionError`, mais :exc:`FileNotFoundError` est attrapé et pas levé.

source: Return ``True`` if this entry is a file or a symbolic link pointing to a file; return ``False`` if the entry is or points to a directory or other non-file entry, or if it doesn't exist anymore.
fr: Renvoie ``True`` si l'entrée est un fichier ou un lien symbolique pointant vers un fichier, renvoie ``False`` si l'entrée pointe est (ou pointe sur) sur un dossier ou sur un répertoire ou autre entrée non-fichier, ou s'il n'existe plus.

source: If *follow_symlinks* is ``False``, return ``True`` only if this entry is a file (without following symlinks); return ``False`` if the entry is a directory or other non-file entry, or if it doesn't exist anymore.
fr: Si *follow_symlinks* vaut ``False``, renvoie ``True`` uniquement si cette entrée est un fichier (sans suivre les liens symboliques). Renvoie ``False`` si l'entrée est un répertoire ou une autre entrée non-fichier, ou s'il n'existe plus.

source: The result is cached on the ``os.DirEntry`` object. Caching, system calls made, and exceptions raised are as per :func:`~os.DirEntry.is_dir`.
fr: Le résultat est mis en cache dans l'objet ``os.DirEntry``. La mise en cache, les appels système réalisés, et les exceptions levées sont les mêmes que pour :func:`~os.DirEntry.is_dir`.

source: Return ``True`` if this entry is a symbolic link (even if broken); return ``False`` if the entry points to a directory or any kind of file, or if it doesn't exist anymore.
fr: Renvoie ``True`` si l'entrée est un lien symbolique (même cassé). Renvoie ``False`` si l'entrée pinte vers un répertoire ou tout autre type de fichier, ou s'il n'existe plus.

source: The result is cached on the ``os.DirEntry`` object. Call :func:`os.path.islink` to fetch up-to-date information.
fr: Le résultat est mis en cache dans l'objet ``os.DirEntry``. Appelez :func:`os.path.islink` pour obtenir l'information à jour.

source: On the first, uncached call, no system call is required in most cases. Specifically, neither Windows or Unix require a system call, except on certain Unix file systems, such as network file systems, that return ``dirent.d_type == DT_UNKNOWN``.
fr: Au premier appel non mis en cache, aucun appel système n'est requis. Spécifiquement, ni Windows ni Unix ne requiert d'appel système, excepté sur certains systèmes de fichiers Unix qui renvoient ``dirent.d_type == DT_UNKNOWN``.

source: Return a :class:`stat_result` object for this entry. This method follows symbolic links by default; to stat a symbolic link add the ``follow_symlinks=False`` argument.
fr: Renvoie un objet de type :class:`stat.result` pour cette entrée. Cette méthode suit les liens symboliques par défaut. Pour avoir les statistiques sur un lien symbolique, ajouter l'argument ``follow_symlinks=False``.

source: On Windows, the ``st_ino``, ``st_dev`` and ``st_nlink`` attributes of the :class:`stat_result` are always set to zero. Call :func:`os.stat` to get these attributes.
fr: Sur Windows, les attributs ``st_ino``, ``st_dev`` et ``st_nlink`` de la classe :class:`stat_result` sont toujours définis à 0. Appelez la fonction :func:`os.stat` pour avoir ces attributs.

source: The result is cached on the ``os.DirEntry`` object, with a separate cache for *follow_symlinks* ``True`` and ``False``. Call :func:`os.stat` to fetch up-to-date information.
fr: Le résultat est mis en cache dans l'objet ``os.DirEntry``, avec un cache séparé pour les valeurs ``True`` ou ``False`` de *follow_symlinks*. Appelez :func:`os.stat` pour obtenir l'information à jour.

source: Note that there is a nice correspondence between several attributes and methods of ``os.DirEntry`` and of :class:`pathlib.Path`. In particular, the ``name`` attribute has the same meaning, as do the ``is_dir()``, ``is_file()``, ``is_symlink()`` and ``stat()`` methods.
fr: Notez qu'il y a une correspondance entre différents attributs et méthodes de ``os.DirEntry`` et :class:`pathlib.Path`. En particulier, l'attribut ``name`` a la même signification, ainsi que les méthodes ``is_dir()``, ``is_file()``, ``is_symlink()`` et ``stat()``.

source: Added support for the :class:`~os.PathLike` interface. Added support for :class:`bytes` paths on Windows.
fr: Prise en charge de l'interface :class:`~os.PathLike`. Ajout du support des chemins :class:`bytes` sous Windows.

source: Get the status of a file or a file descriptor. Perform the equivalent of a :c:func:`stat` system call on the given path. *path* may be specified as either a string or bytes -- directly or indirectly through the :class:`PathLike` interface -- or as an open file descriptor. Return a :class:`stat_result` object.
fr: Récupère le statut d'un fichier ou d'un descripteur de fichier. Réalise l'équivalent d'un appel système :c:func:`stat` sur le chemin donné. *path* peut être exprimé comme une chaîne de caractères ou d'octets -- directement ou indirectement à travers une interface :class:`PathLike` -- ou comme un descripteur de fichier ouvert. Renvoie un objet :class:`stat_result`.

source: This function normally follows symlinks; to stat a symlink add the argument ``follow_symlinks=False``, or use :func:`lstat`.
fr: Cette fonction suit normalement les liens symboliques. Pour récupérer les informations d'un lien symbolique, ajoutez l'argument ``follow_symlinks=False`` ou utilisez la fonction :func:`lstat`.

source: This function can support :ref:`specifying a file descriptor <path_fd>` and :ref:`not following symlinks <follow_symlinks>`.
fr: Cette fonction peut supporter la :ref:`spécification d'un descripteur de fichier <path_fd>` et :ref:`le non-suivi des liens symboliques <follow_symlinks>`.

source: Example::
fr: Exemple ::

source: :func:`fstat` and :func:`lstat` functions.
fr: les fonctions :func:`fstat` et :func:`lstat`.

source: Added the *dir_fd* and *follow_symlinks* arguments, specifying a file descriptor instead of a path.
fr: Les arguments *dir_fd* et *follow_symlinks* ont été ajoutés, spécification d'un descripteur de fichier à la place d'un chemin ajoutée également.

source: Object whose attributes correspond roughly to the members of the :c:type:`stat` structure. It is used for the result of :func:`os.stat`, :func:`os.fstat` and :func:`os.lstat`.
fr: Objet dont les attributs correspondent globalement aux membres de la structure :c:func:`stat`. Utilisé pour le résultat des fonctions :func:`os.stat`, :func:`os.fstat`, et :func:`os.lstat`.

source: Attributes:
fr: Attributs :

source: File mode: file type and file mode bits (permissions).
fr: Mode du fichier : type du fichier et bits de mode du fichier (permissions).

source: Platform dependent, but if non-zero, uniquely identifies the file for a given value of ``st_dev``. Typically:
fr: Dépendant de la plateforme, mais lorsqu'il ne vaut pas zéro il identifie de manière unique le fichier pour une certaine valeur de ``st_dev``. Typiquement :

source: the inode number on Unix,
fr: le numéro d'*inode* sur Unix,

source: the `file index <https://msdn.microsoft.com/en-us/library/aa363788>`_ on Windows
fr: l’`index de fichier <https://msdn.microsoft.com/fr-fr/library/aa363788>`_ sur Windows

source: Identifier of the device on which this file resides.
fr: Identifiant du périphérique sur lequel ce fichier se trouve.

source: Number of hard links.
fr: Nombre de liens matériels.

source: User identifier of the file owner.
fr: Identifiant d'utilisateur du propriétaire du fichier.

source: Group identifier of the file owner.
fr: Identifiant de groupe du propriétaire du fichier.
