Repository: python/python-docs-fr
Catalog: library/os.po
Languages: fr

source: *after_in_parent* is a function called from the parent process after forking a child process.
fr: *after_in_parent* est une fonction appelée depuis le processus parent après avoir *forké* un processus enfant.

source: *after_in_child* is a function called from the child process.
fr: *after_in_child* est une fonction appelée depuis le processus enfant.

source: These calls are only made if control is expected to return to the Python interpreter. A typical :mod:`subprocess` launch will not trigger them as the child is not going to re-enter the interpreter.
fr: Ces appels ne sont effectués que si le contrôle est censé retourner à l'interpréteur Python. Un lancement de :mod:`subprocess` typique ne les déclenchera pas, car l'enfant ne ré-entre pas dans l'interpréteur.

source: Functions registered for execution before forking are called in reverse registration order. Functions registered for execution after forking (either in the parent or in the child) are called in registration order.
fr: Les fonctions enregistrées pour l'exécution avant le *fork* sont appelées dans l'ordre inverse à leur enregistrement. Les fonctions enregistrées pour l'exécution après le *fork* (soit dans le parent ou dans l'enfant) sont appelées dans l'ordre de leur enregistrement.

source: Note that :c:func:`fork` calls made by third-party C code may not call those functions, unless it explicitly calls :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` and :c:func:`PyOS_AfterFork_Child`.
fr: Notez que les appels à :c:func:`fork` faits par du code C de modules tiers peuvent ne pas appeler ces fonctions, à moins que ce code appelle explicitement :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` et :c:func:`PyOS_AfterFork_Child`.

source: There is no way to unregister a function.
fr: Il n'y a aucun moyen d'annuler l'enregistrement d'une fonction.

source: Execute the program *path* in a new process.
fr: Exécute le programme *path* dans un nouveau processus.

source: (Note that the :mod:`subprocess` module provides more powerful facilities for spawning new processes and retrieving their results; using that module is preferable to using these functions. Check especially the :ref:`subprocess-replacements` section.)
fr: (Notez que le module :mod:`subprocess` fournit des outils plus puissants pour générer de nouveaux processus et récupérer leur valeur de retour. Il est préférable d'utiliser ce module que ces fonctions. Voyez surtout la section :ref:`subprocess-replacements`.)

source: If *mode* is :const:`P_NOWAIT`, this function returns the process id of the new process; if *mode* is :const:`P_WAIT`, returns the process's exit code if it exits normally, or ``-signal``, where *signal* is the signal that killed the process. On Windows, the process id will actually be the process handle, so can be used with the :func:`waitpid` function.
fr: Si *mode* vaut :const:`P_NOWAIT`, cette fonction renvoie le PID du nouveau processus, et si *mode* vaut :const:`P_WAIT`, la fonction renvoie le code de sortie du processus s'il se termine normalement, ou ``-signal`` où *signal* est le signal qui a tué le processus. Sur Windows, le PID du processus sera en fait l'identificateur du processus (*process handle*) et peut donc être utilisé avec la fonction :func:`waitpid`.

source: The "l" and "v" variants of the :func:`spawn\* <spawnl>` functions differ in how command-line arguments are passed. The "l" variants are perhaps the easiest to work with if the number of parameters is fixed when the code is written; the individual parameters simply become additional parameters to the :func:`spawnl\*` functions. The "v" variants are good when the number of parameters is variable, with the arguments being passed in a list or tuple as the *args* parameter. In either case, the arguments to the child process must start with the name of the command being run.
fr: Les variantes "l" et "v" des fonctions :func:`spawn\* <spawnl>` diffèrent sur la manière de passer les arguments de ligne de commande. Les variantes "l" sont probablement les plus simples à utiliser si le nombre de paramètres est fixé lors de l'écriture du code. Les paramètres individuels deviennent alors des paramètres additionnels aux fonctions :func:`spawn\*`. Les variantes "v" sont préférables quand le nombre de paramètres est variable et qu'ils sont passés dans une liste ou un *tuple* dans le paramètre *args*. Dans tous les cas, les arguments aux processus fils devraient commencer avec le nom de la commande à lancer, mais ce n'est pas obligatoire.

source: The variants which include a second "p" near the end (:func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp`, and :func:`spawnvpe`) will use the :envvar:`PATH` environment variable to locate the program *file*. When the environment is being replaced (using one of the :func:`spawn\*e <spawnl>` variants, discussed in the next paragraph), the new environment is used as the source of the :envvar:`PATH` variable. The other variants, :func:`spawnl`, :func:`spawnle`, :func:`spawnv`, and :func:`spawnve`, will not use the :envvar:`PATH` variable to locate the executable; *path* must contain an appropriate absolute or relative path.
fr: Les variantes qui incluent un "p"vers la fin (:func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp`, et :func:`spawnvpe`) utiliseront la variable d'environnement :envvar:`PATH` pour localiser le programme *file*. Quand l'environnement est remplacé (en utilisant une des variantes :func:`spawn\*e <spawnl>`, discutées dans le paragraphe suivant), le nouvel environnement est utilisé comme source de la variable d'environnement :envvar:`PATH`. Les autres variantes :func:`spawnl`, :func:`spawnle`, :func:`spawnv`, et :func:`spawnve` n'utiliseront pas la variable d'environnement :envvar:`PATH` pour localiser l'exécutable. *path* doit contenir un chemin absolue ou relatif approprié.

source: For :func:`spawnle`, :func:`spawnlpe`, :func:`spawnve`, and :func:`spawnvpe` (note that these all end in "e"), the *env* parameter must be a mapping which is used to define the environment variables for the new process (they are used instead of the current process' environment); the functions :func:`spawnl`, :func:`spawnlp`, :func:`spawnv`, and :func:`spawnvp` all cause the new process to inherit the environment of the current process. Note that keys and values in the *env* dictionary must be strings; invalid keys or values will cause the function to fail, with a return value of ``127``.
fr: Pour les fonctions :func:`spawnle`, :func:`spawnlpe`, :func:`spawnve`, et :func:`spawnvpe` (notez qu'elles finissent toutes par "e"), le paramètre *env* doit être un *mapping* qui est utilisé pour définir les variables d'environnement du nouveau processus (celles-ci sont utilisées à la place de l'environnement du nouveau processus). Les fonctions :func:`spawnl`, :func:`spawnlp`, :func:`spawnv`, et :func:`spawnvp` causent toutes un héritage de l'environnement du processus actuel par le processus fils. Notez que les clefs et les valeurs du dictionnaire *env* doivent être des chaînes de caractères. Des valeurs invalides pour les clefs ou les valeurs met la fonction en échec et renvoie ``127``.

source: As an example, the following calls to :func:`spawnlp` and :func:`spawnvpe` are equivalent::
fr: Par exemple, les appels suivants à :func:`spawnlp` et :func:`spawnvpe` sont équivalents ::

source: :ref:`Availability <availability>`: Unix, Windows. :func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp` and :func:`spawnvpe` are not available on Windows. :func:`spawnle` and :func:`spawnve` are not thread-safe on Windows; we advise you to use the :mod:`subprocess` module instead.
fr: :ref:`Disponibilité <availability>` : Unix, Windows. :func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp`, et :func:`spawnvpe` ne sont pas disponibles sur Windows. :func:`spawnle` et :func:`spawnve` ne sont pas sécurisés pour les appels concurrents (*thread-safe*) sur Windows, il est conseillé d'utiliser le module :mod:`subprocess` à la place.

source: Possible values for the *mode* parameter to the :func:`spawn\* <spawnl>` family of functions. If either of these values is given, the :func:`spawn\*` functions will return as soon as the new process has been created, with the process id as the return value.
fr: Valeurs possibles pour le paramètre *mode* de la famille de fonctions :func:`spawn\* <spawnl>`. Si l'une de ces valeurs est donnée, les fonctions :func:`spawn\*` sortiront dès que le nouveau processus est créé, avec le PID du processus comme valeur de retour.

source: Possible value for the *mode* parameter to the :func:`spawn\* <spawnl>` family of functions. If this is given as *mode*, the :func:`spawn\*` functions will not return until the new process has run to completion and will return the exit code of the process the run is successful, or ``-signal`` if a signal kills the process.
fr: Valeur possible pour le paramètre *mode* de la famille de fonctions :func:`spawn\* <spawnl>`. Si *mode* est défini par cette valeur, les fonctions :func:`spawn\* <spawnl>` ne se terminent pas tant que le nouveau processus n'a pas été complété et renvoient le code de sortie du processus si l'exécution est effectuée avec succès, ou ``-signal`` si un signal tue le processus.

source: Possible values for the *mode* parameter to the :func:`spawn\* <spawnl>` family of functions. These are less portable than those listed above. :const:`P_DETACH` is similar to :const:`P_NOWAIT`, but the new process is detached from the console of the calling process. If :const:`P_OVERLAY` is used, the current process will be replaced; the :func:`spawn\* <spawnl>` function will not return.
fr: Valeurs possibles pour le paramètre *mode* de la famille de fonctions :func:`spawn\* <spawnl>`. Ces valeurs sont moins portables que celles listées plus haut. :const:`P_DETACH` est similaire à :const:`P_NOWAIT`, mais le nouveau processus est détaché de la console du processus appelant. Si :const:`P_OVERLAY` est utilisé, le processus actuel sera remplacé. La fonction :func:`spawn\* <spawnl>` ne sort jamais.

source: Start a file with its associated application.
fr: Lance un fichier avec son application associée.

source: When *operation* is not specified or ``'open'``, this acts like double-clicking the file in Windows Explorer, or giving the file name as an argument to the :program:`start` command from the interactive command shell: the file is opened with whatever application (if any) its extension is associated.
fr: Quand *operation* n'est pas spécifié ou vaut ``'open'``, l'effet est le même qu'un double clic sur le fichier dans Windows Explorer, ou que de passer le nom du fichier en argument du programme :program:`start` depuis l'invite de commande interactif : le fichier est ouvert avec l'application associée à l'extension (s'il y en a une).

source: When another *operation* is given, it must be a "command verb" that specifies what should be done with the file. Common verbs documented by Microsoft are ``'print'`` and ``'edit'`` (to be used on files) as well as ``'explore'`` and ``'find'`` (to be used on directories).
fr: Quand une autre *operation* est donnée, ce doit être une "commande-verbe" qui spécifie ce qui devrait être fait avec le fichier. Les verbes habituels documentés par Microsoft sont ``'print'`` et ``'edit'`` (qui doivent être utilisés sur des fichiers) ainsi que ``'explore'`` et ``'find'`` (qui doivent être utilisés sur des répertoires).

source: :func:`startfile` returns as soon as the associated application is launched. There is no option to wait for the application to close, and no way to retrieve the application's exit status. The *path* parameter is relative to the current directory. If you want to use an absolute path, make sure the first character is not a slash (``'/'``); the underlying Win32 :c:func:`ShellExecute` function doesn't work if it is. Use the :func:`os.path.normpath` function to ensure that the path is properly encoded for Win32.
fr: :func:`startfile` termine dès que l'application associée est lancée.Il n'y a aucune option permettant d'attendre que l'application ne se ferme et aucun moyen de récupérer le statu de sortie de l'application. Le paramètre *path* est relatif au répertoire actuel. Si vous voulez utiliser un chemin absolu, assurez-vous que le premier caractère ne soit pas un slash (``'/'``). La fonction Win32 :c:func:`ShellExecute` sous-jacente ne fonctionne pas sinon. Utilisez la fonction :func:`os.path.normpath` pour vous assurer que le chemin est encodé correctement pour Win32.

source: To reduce interpreter startup overhead, the Win32 :c:func:`ShellExecute` function is not resolved until this function is first called. If the function cannot be resolved, :exc:`NotImplementedError` will be raised.
fr: Pour réduire Pour réduire le temps système de démarrage de l'interpréteur, la fonction Win32 :c:func:`ShellExecute` ne se finit pas tant que cette fonction na pas été appelée. Si la fonction ne peut être interprétée, une :exc:`NotImplementedError` est levée.

source: Execute the command (a string) in a subshell. This is implemented by calling the Standard C function :c:func:`system`, and has the same limitations. Changes to :data:`sys.stdin`, etc. are not reflected in the environment of the executed command. If *command* generates any output, it will be sent to the interpreter standard output stream.
fr: Exécute la commande (une chaîne de caractères) dans un sous-invite de commandes. C'est implémenté en appelant la fonction standard C :c:func:`system` et a les mêmes limitations. les changements sur :data:`sys.stdin`, etc. ne sont pas reflétés dans l'environnement de la commande exécutée. Si *command* génère une sortie, elle sera envoyée à l'interpréteur standard de flux.

source: On Unix, the return value is the exit status of the process encoded in the format specified for :func:`wait`. Note that POSIX does not specify the meaning of the return value of the C :c:func:`system` function, so the return value of the Python function is system-dependent.
fr: Sur Unix, la valeur de retour est le statut de sortie du processus encodé dans le format spécifié pour :func:`wait`. Notez que POSIX ne spécifie pas le sens de la valeur de retour de la fonction C :c:func:`system`, donc la valeur de retour de la fonction Python est dépendante du système.

source: On Windows, the return value is that returned by the system shell after running *command*. The shell is given by the Windows environment variable :envvar:`COMSPEC`: it is usually :program:`cmd.exe`, which returns the exit status of the command run; on systems using a non-native shell, consult your shell documentation.
fr: Sur Windows, la valeur de retour est celle renvoyée par l'invite de commande système après avoir lancé *command*. L'invite de commande est donné par la variable d'environnement Windows :envvar:`COMSPEC`. Elle vaut habituellement :program:`cmd.exe`, qui renvoie l'état de sortie de la commande lancée. Sur les systèmes qui utilisent un invite de commande non-natif, consultez la documentation propre à l'invite.

source: The :mod:`subprocess` module provides more powerful facilities for spawning new processes and retrieving their results; using that module is preferable to using this function. See the :ref:`subprocess-replacements` section in the :mod:`subprocess` documentation for some helpful recipes.
fr: Le module :mod:`subprocess` fournit des outils plus puissants pour générer de nouveaux processus et pour récupérer leur résultat. Il est préférable d'utiliser ce module plutôt que d'utiliser cette fonction. Voir la section :ref:`subprocess-replacements` de la documentation du module :mod:`subprocess` pour des informations plus précises et utiles.

source: Returns the current global process times. The return value is an object with five attributes:
fr: Renvoie les temps globaux actuels d'exécution du processus. La valeur de retour est un objet avec cinq attributs :

source: :attr:`user` - user time
fr: :attr:`user` — le temps utilisateur

source: :attr:`system` - system time
fr: :attr:`system` — le temps système

source: :attr:`children_user` - user time of all child processes
fr: :attr:`children_user` — temps utilisateur de tous les processus fils

source: :attr:`children_system` - system time of all child processes
fr: :attr:`children_system` — le temps système de tous les processus fils

source: :attr:`elapsed` - elapsed real time since a fixed point in the past
fr: :attr:`elapsed` — temps écoulé réel depuis un point fixé dans le passé

source: For backwards compatibility, this object also behaves like a five-tuple containing :attr:`user`, :attr:`system`, :attr:`children_user`, :attr:`children_system`, and :attr:`elapsed` in that order.
fr: Pour des raisons de rétro-compatibilité, cet objet se comporte également comme un *tuple* contenant :attr:`user`, :attr:`system`, :attr:`children_user`, :attr:`children_system`, et :attr:`elapsed` dans cet ordre.

source: Wait for completion of a child process, and return a tuple containing its pid and exit status indication: a 16-bit number, whose low byte is the signal number that killed the process, and whose high byte is the exit status (if the signal number is zero); the high bit of the low byte is set if a core file was produced.
fr: Attend qu'un processus fils soit complété, et renvoie un *tuple* contenant son PID et son état de sortie : un nombre de 16 bits dont le *byte* de poids faible est le nombre correspondant au signal qui a tué le processus, et dont le *byte* de poids fort est le statut de sortie (si la signal vaut ``0``). Le bit de poids fort du *byte* de poids faible est mis à 1 si un (fichier système) *core file* a été produit.

source: Wait for the completion of one or more child processes. *idtype* can be :data:`P_PID`, :data:`P_PGID` or :data:`P_ALL`. *id* specifies the pid to wait on. *options* is constructed from the ORing of one or more of :data:`WEXITED`, :data:`WSTOPPED` or :data:`WCONTINUED` and additionally may be ORed with :data:`WNOHANG` or :data:`WNOWAIT`. The return value is an object representing the data contained in the :c:type:`siginfo_t` structure, namely: :attr:`si_pid`, :attr:`si_uid`, :attr:`si_signo`, :attr:`si_status`, :attr:`si_code` or ``None`` if :data:`WNOHANG` is specified and there are no children in a waitable state.
fr: Attend qu'un ou plusieurs processus fils soient complétés. *idtypes* peut être :data:`P_PID`, :data:`P_PGID`, ou :data:`P_ALL`. *id* spécifie le PID à attendre. *options* est construit en combinant (avec le OR bit-à-bit) une ou plusieurs des valeurs suivantes : :data:`WEXITED`, :data:`WSTOPPED`, ou :data:`WCONTINUED` et peut additionnellement être combiné avec :data:`WNOHANG` ou :data:`WNOWAIT`. La valeur de retour est un objet représentant les données contenue dans la structure :c:type:`siginfo_t`, nommées :attr:`si_pid`, :attr:`si_uid`, :attr:`si_signo`, :attr:`si_status`, :attr:`si_code` ou ``None`` si :data:`WNOHANG` est spécifié et qu'il n'y a pas d'enfant dans un état que l'on peut attendre.

source: These are the possible values for *idtype* in :func:`waitid`. They affect how *id* is interpreted.
fr: Les valeurs possibles pour *idtypes* pour la fonction :func:`waitid`. Elles affectent l'interprétation de *id*.

source: Flags that can be used in *options* in :func:`waitid` that specify what child signal to wait for.
fr: Marqueurs qui peuvent être utilisés pour la fonction :func:`waitid` qui spécifient quel signal attendre du fils.

source: These are the possible values for :attr:`si_code` in the result returned by :func:`waitid`.
fr: Les valeurs possibles pour :attr:`si_code` dans le résultat renvoyé par :func:`waitid`.

source: The details of this function differ on Unix and Windows.
fr: Les détails de cette fonction diffèrent sur Unix et Windows.

source: On Unix: Wait for completion of a child process given by process id *pid*, and return a tuple containing its process id and exit status indication (encoded as for :func:`wait`). The semantics of the call are affected by the value of the integer *options*, which should be ``0`` for normal operation.
fr: Sur Unix : attend qu'un processus fils donné par son id de processus *pid* soit terminé, et renvoie un *tuple* contenant son PID et son statut de sortie (encodé comme pour :func:`wait`). La sémantique de cet appel est affecté par la valeur de l'argument entier *options*, qui devrait valoir ``0`` pour les opérations normales.

source: If *pid* is greater than ``0``, :func:`waitpid` requests status information for that specific process. If *pid* is ``0``, the request is for the status of any child in the process group of the current process. If *pid* is ``-1``, the request pertains to any child of the current process. If *pid* is less than ``-1``, status is requested for any process in the process group ``-pid`` (the absolute value of *pid*).
fr: Si *pid* est plus grand que ``0``, :func:`waitpid` introduit une requête pour des informations sur le statut du processus spécifié. Si *pid* vaut ``0``, la requête est pour le statut de tous les fils dans le groupe de processus du processus actuel. Si *pid* vaut ``-1``, la requête concerne tous les processus fils du processus actuel. Si *pid* est inférieur à ``-1``, une requête est faite pour le statut de chaque processus du groupe de processus donné par ``-pid`` (la valeur absolue de *pid*).

source: An :exc:`OSError` is raised with the value of errno when the syscall returns -1.
fr: Une :exc:`OSError` est levée avec la valeur de *errno* quand l'appel système renvoie ``-1``.

source: On Windows: Wait for completion of a process given by process handle *pid*, and return a tuple containing *pid*, and its exit status shifted left by 8 bits (shifting makes cross-platform use of the function easier). A *pid* less than or equal to ``0`` has no special meaning on Windows, and raises an exception. The value of integer *options* has no effect. *pid* can refer to any process whose id is known, not necessarily a child process. The :func:`spawn\* <spawnl>` functions called with :const:`P_NOWAIT` return suitable process handles.
fr: Sur Windows : attend que qu'un processus donné par l'identificateur de processus (*process handle*) *pid* soi complété, et renvoie un *tuple* contenant *pid* et son statut de sortir décalé de 8 bits bers la gauche (le décalage rend l'utilisation multiplate-forme plus facile). Un *pid* inférieur ou égal à ``0`` n'a aucune signification particulière sur Windows, et lève une exception. L'argument entier *options* n'a aucun effet. *pid* peut faire référence à tout processus dont l'identifiant est connue pas nécessairement un processus fils. Les fonctions :func:`spawn\* <spawnl>` appelées avec :const:`P_NOWAIT` renvoient des identificateurs de processus appropriés.

source: Similar to :func:`waitpid`, except no process id argument is given and a 3-element tuple containing the child's process id, exit status indication, and resource usage information is returned. Refer to :mod:`resource`.\ :func:`~resource.getrusage` for details on resource usage information. The option argument is the same as that provided to :func:`waitpid` and :func:`wait4`.
fr: Similaire à la fonction :func:`waitpid`, si ce n'est que qu'aucun argument *id* n'est donné, et qu'un triplet contenant l'identifiant du processus fils, son statut de sortie, et une information sur l'utilisation des ressources est renvoyé. Référez-vous à :mod:`resource`.\ :func:`~resource.getrusage` pour des détails sur les informations d'utilisation des ressources. L'argument *options* est le même que celui fourni à :func:`waitpid` et :func:`wait4`.
