Repository: python/python-docs-fr
Catalog: library/os.po
Languages: fr

source: Set the list of supplemental group ids associated with the current process to *groups*. *groups* must be a sequence, and each element must be an integer identifying a group. This operation is typically available only to the superuser.
fr: Place *groups* dans la liste d'identifiants de groupes additionnels associée. *groups* doit être une séquence, et chaque élément doit être un nombre entier identifiant un groupe. Cette opération est typiquement disponible uniquement pour le super utilisateur.

source: On Mac OS X, the length of *groups* may not exceed the system-defined maximum number of effective group ids, typically 16. See the documentation for :func:`getgroups` for cases where it may not return the same group list set by calling setgroups().
fr: Sur Mac OS X, la longueur de *groups* ne peut pas dépasser le nombre maximum d'identifiants effectifs de groupes défini par le système, typiquement 16. Voir la documentation de :func:`getgroups` pour les cas où *getgroups* ne renvoie pas la même liste de groupes que celle définie par l'appel à *setgroups*.

source: Call the system call :c:func:`setpgrp` or ``setpgrp(0, 0)`` depending on which version is implemented (if any). See the Unix manual for the semantics.
fr: Produit l'appel système :c:func:`setpgrp` ou ``setpgrp(0, 0)`` selon la version implémentée (s'il y en a une). Voir le manuel Unix pour la sémantique de l'opération.

source: Call the system call :c:func:`setpgid` to set the process group id of the process with id *pid* to the process group with id *pgrp*. See the Unix manual for the semantics.
fr: Produit l'appel système :c:func:`setpgid` pour placer l'identifiant du groupe de processus contenant le processus d'identifiant *pid* dans le groupe de processus d'identifiant *pgrp*. Voir le manuel Unix pour la sémantique.

source: Set program scheduling priority. The value *which* is one of :const:`PRIO_PROCESS`, :const:`PRIO_PGRP`, or :const:`PRIO_USER`, and *who* is interpreted relative to *which* (a process identifier for :const:`PRIO_PROCESS`, process group identifier for :const:`PRIO_PGRP`, and a user ID for :const:`PRIO_USER`). A zero value for *who* denotes (respectively) the calling process, the process group of the calling process, or the real user ID of the calling process. *priority* is a value in the range -20 to 19. The default priority is 0; lower priorities cause more favorable scheduling.
fr: Définit la priorité d'ordonnancement des programmes. La valeur *which* est une des constantes suivantes : :const:`PRIO_PROCESS`, :const:`PRIO_PGRP`, ou :const:`PRIO_USER`, et *who* est interprété en fonction de *which* (un PID pour :const:`PRIO_PROCESS`, un identifiant de groupe de processus pour :const:`PRIO_PGRP`, et un identifiant d'utilisateur pour :const:`PRIO_USER`). Une valeur nulle pour *who* dénote (respectivement) le processus appelant, le groupe de processus du processus appelant, ou l'identifiant de l'utilisateur réel du processus appelant. *priority* est une valeur comprise entre ``-20`` et ``19``. La priorité par défaut est 0 ; les priorités plus faibles amènent à un ordonnancement plus favorable.

source: Set the current process's real and effective group ids.
fr: Définit l'identifiant des groupes réel et effectif du processus actuel.

source: Set the current process's real, effective, and saved group ids.
fr: Définit l'identifiant des groupes réel, effectif et sauvé du processus actuel.

source: Set the current process's real, effective, and saved user ids.
fr: Définit l'identifiant des utilisateurs réel, effectif et sauvé du processus actuel.

source: Set the current process's real and effective user ids.
fr: Définit l'identifiant des utilisateurs réel et effectif du processus actuel.

source: Call the system call :c:func:`getsid`. See the Unix manual for the semantics.
fr: Produit l'appel système :c:func:`getsid`. Voir le manuel Unix pour la sémantique.

source: Call the system call :c:func:`setsid`. See the Unix manual for the semantics.
fr: Produit l'appel système :c:func:`setsid`. Voir le manuel Unix pour la sémantique.

source: Set the current process's user id.
fr: Définit l'identifiant de l'utilisateur du processus actuel.

source: Return the error message corresponding to the error code in *code*. On platforms where :c:func:`strerror` returns ``NULL`` when given an unknown error number, :exc:`ValueError` is raised.
fr: Renvoie le message d'erreur correspondant au code d'erreur *code*. Sur les plate-formes où :c:func:`strerror` renvoie ``NULL`` quand un numéro d'erreur inconnu est donné, une :exc:`ValueError` est levée.

source: ``True`` if the native OS type of the environment is bytes (eg. ``False`` on Windows).
fr: ``True`` si le type natif de l'environnement du système d'exploitation est *bytes* (par exemple : ``False`` sur Windows).

source: Set the current numeric umask and return the previous umask.
fr: Définit le *umask* actuel et renvoie la valeur précédente.

source: Returns information identifying the current operating system. The return value is an object with five attributes:
fr: Renvoie des informations identifiant le système d'exploitation actuel. La valeur de retour est un objet à cinq attributs :

source: :attr:`sysname` - operating system name
fr: :attr:`sysname` — nom du système d'exploitation

source: :attr:`nodename` - name of machine on network (implementation-defined)
fr: :attr:`noedname` — nom de la machine sur le réseau (dépendant de l'implémentation)

source: :attr:`release` - operating system release
fr: :attr:`release` — *release* du système d'exploitation

source: :attr:`version` - operating system version
fr: :attr:`version` — version du système d'exploitation

source: :attr:`machine` - hardware identifier
fr: :attr:`machine` — identifiant du matériel

source: For backwards compatibility, this object is also iterable, behaving like a five-tuple containing :attr:`sysname`, :attr:`nodename`, :attr:`release`, :attr:`version`, and :attr:`machine` in that order.
fr: Pour la rétrocompatibilité, cet objet est également itérable, se comportant comme un quintuplet contenant :attr:`sysname`, :attr:`nodename`, :attr:`release`, :attr:`version`, et :attr:`machine` dans cet ordre.

source: Some systems truncate :attr:`nodename` to 8 characters or to the leading component; a better way to get the hostname is :func:`socket.gethostname` or even ``socket.gethostbyaddr(socket.gethostname())``.
fr: Certains systèmes tronquent :attr:`nodename` à 8 caractères ou à la composante dominante. Un meilleur moyen de récupérer le nom de l'hôte est :func:`socket.gethostname` ou encore ``socket.gethostbyaddre(socket.gethostname())``.

source: :ref:`Availability <availability>`: recent flavors of Unix.
fr: :ref:`Disponibilité <availability>` : dérivés récents de Unix.

source: Return type changed from a tuple to a tuple-like object with named attributes.
fr: Type de retour changé d'un *tuple* en un objet compatible avec le type *tuple*, avec des attributs nommés.

source: Unset (delete) the environment variable named *key*. Such changes to the environment affect subprocesses started with :func:`os.system`, :func:`popen` or :func:`fork` and :func:`execv`.
fr: Supprime la variable d'environnement appelée *key*. De tels changements à l'environnement affectent les sous-processus lancés avec :func:`os.system`, :func:`popen` ou :func:`fork` et :func:`execv`.

source: When :func:`unsetenv` is supported, deletion of items in ``os.environ`` is automatically translated into a corresponding call to :func:`unsetenv`; however, calls to :func:`unsetenv` don't update ``os.environ``, so it is actually preferable to delete items of ``os.environ``.
fr: Quand :func:`unsetenv` est gérée, la suppression d'éléments dans ``os.environ`` est automatiquement interprétée en un appel correspondant à :func:`unsetenv`, mais les appels à :func:`unsetenv` ne mettent pas ``os.environ`` à jour. Donc il est préférable de supprimer les éléments de ``os.environ``.

source: File Object Creation
fr: Création de fichiers objets

source: Return an open file object connected to the file descriptor *fd*. This is an alias of the :func:`open` built-in function and accepts the same arguments. The only difference is that the first argument of :func:`fdopen` must always be an integer.
fr: Renvoie un fichier objet ouvert connecté au descripteur de fichier *fd*. C'est un alias de la primitive :func:`open` et accepte les mêmes arguments. La seule différence est que le premier argument de :func:`fdopen` doit toujours être un entier.

source: File Descriptor Operations
fr: Opérations sur les descripteurs de fichiers

source: These functions operate on I/O streams referenced using file descriptors.
fr: Ces fonctions opèrent sur des flux d'entrées/sorties référencés par des descripteurs de fichiers.

source: File descriptors are small integers corresponding to a file that has been opened by the current process. For example, standard input is usually file descriptor 0, standard output is 1, and standard error is 2. Further files opened by a process will then be assigned 3, 4, 5, and so forth. The name "file descriptor" is slightly deceptive; on Unix platforms, sockets and pipes are also referenced by file descriptors.
fr: Les descripteurs de fichiers sont de petits entiers correspondant à un fichier qui a été ouvert par le processus courant. Par exemple, l'entrée standard est habituellement le descripteur de fichier 0, la sortie standard est 1, et le flux standard d'erreur est 2. Les autres fichiers ouverts par un processus vont se voir assigner 3, 4, 5, etc. Le nom "descripteur de fichier" est légèrement trompeur : sur les plate-formes Unix, les connecteurs (*socket* en anglais) et les tubes (*pipe* en anglais) sont également référencés par des descripteurs.

source: The :meth:`~io.IOBase.fileno` method can be used to obtain the file descriptor associated with a :term:`file object` when required. Note that using the file descriptor directly will bypass the file object methods, ignoring aspects such as internal buffering of data.
fr: La méthode :meth:`~io.IOBase.fileno` peut être utilisée pour obtenir le descripteur de fichier associé à un :term:`file object` quand nécessaire. Notez qu'utiliser le descripteur directement outrepasse les méthodes du fichier objet, ignorant donc des aspects tels que la mise en tampon interne des données.

source: Close file descriptor *fd*.
fr: Ferme le descripteur de fichier *fd*.

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`pipe`. To close a "file object" returned by the built-in function :func:`open` or by :func:`popen` or :func:`fdopen`, use its :meth:`~io.IOBase.close` method.
fr: Cette fonction est destinée aux opérations d'entrées/sorties de bas niveau et doit être appliquée à un descripteur de fichier comme ceux donnés par :func:`os.open` ou :func:`pipe`. Pour fermer un "fichier objet" renvoyé par la primitive :func:`open`, :func:`popen` ou :func:`fdopen`, il faut utiliser sa méthode :meth:`~io.IOBase.close`.

source: Close all file descriptors from *fd_low* (inclusive) to *fd_high* (exclusive), ignoring errors. Equivalent to (but much faster than)::
fr: Ferme tous les descripteurs de fichiers entre *fd_low* (inclus) jusque *fd_high* (exclus), en ignorant les erreurs. Équivalent (mais beaucoup plus rapide) à ::

source: Return a string describing the encoding of the device associated with *fd* if it is connected to a terminal; else return :const:`None`.
fr: Renvoie une chaîne de caractères décrivant l'encodage du périphérique associé à *fd* s'il est connecté à un terminal, sinon renvoie :const:`None`.

source: Return a duplicate of file descriptor *fd*. The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
fr: Renvoie une copie du descripteur de fichier *fd*. Le nouveau descripteur de fichier est :ref:`non-héritable <fd_inheritance>`.

source: On Windows, when duplicating a standard stream (0: stdin, 1: stdout, 2: stderr), the new file descriptor is :ref:`inheritable <fd_inheritance>`.
fr: Sur Windows, quand un flux standard est dupliqué (0 : *stdin*, 1 : *stdout*, 2 : *stderr*), le nouveau descripteur de fichier est :ref:`héritable <fd_inheritance>`.

source: The new file descriptor is now non-inheritable.
fr: Le nouveau descripteur de fichier est maintenant non-héritable.

source: Duplicate file descriptor *fd* to *fd2*, closing the latter first if necessary. Return *fd2*. The new file descriptor is :ref:`inheritable <fd_inheritance>` by default or non-inheritable if *inheritable* is ``False``.
fr: Copie le descripteur de fichier *fd* dans *fd2*, en fermant le second d'abord si nécessaire. Renvoie *fd2*. Le nouveau descripteur de fichier est :ref:`héritable <fd_inheritance>` par défaut, ou non-héritable si *inheritable* vaut ``False``.

source: Add the optional *inheritable* parameter.
fr: Ajout du paramètre optionnel *inheritable*.

source: Return *fd2* on success. Previously, ``None`` was always returned.
fr: Renvoie *fd2* en cas de succès. Auparavant, ``None`` était toujours renvoyé.

source: Change the mode of the file given by *fd* to the numeric *mode*. See the docs for :func:`chmod` for possible values of *mode*. As of Python 3.3, this is equivalent to ``os.chmod(fd, mode)``.
fr: Change le mode du fichier donné par *fd* en la valeur numérique *mode*. Voir la documentation de :func:`chmod` pour les valeurs possibles de *mode*. Depuis Python 3.3, c'est équivalent à ``os.chmod(fd, mode)``.

source: Change the owner and group id of the file given by *fd* to the numeric *uid* and *gid*. To leave one of the ids unchanged, set it to -1. See :func:`chown`. As of Python 3.3, this is equivalent to ``os.chown(fd, uid, gid)``.
fr: Change le propriétaire et l'identifiant de groupe du fichier donné par *fd* en les valeurs numériques *uid* et *gid*. Pour laisser l'un des identifiants inchangés, mettez-le à ``-1``. Voir :func:`chown`. Depuis Python 3.3, c'est équivalent à ``os.chown(fd, uid, gid)``.

source: Force write of file with filedescriptor *fd* to disk. Does not force update of metadata.
fr: Force l'écriture du fichier ayant le descripteur *fd* sur le disque. Ne force pas la mise à jour des méta-données.

source: This function is not available on MacOS.
fr: Cette fonction n'est pas disponible sur MacOS.

source: Return system configuration information relevant to an open file. *name* specifies the configuration value to retrieve; it may be a string which is the name of a defined system value; these names are specified in a number of standards (POSIX.1, Unix 95, Unix 98, and others). Some platforms define additional names as well. The names known to the host operating system are given in the ``pathconf_names`` dictionary. For configuration variables not included in that mapping, passing an integer for *name* is also accepted.
fr: Renvoie les informations de la configuration du système pour un fichier ouvert. *name* spécifie la valeur de la configuration à récupérer, ça peut être une chaîne de caractères avec le nom d'une valeur système définie ; ces valeurs sont spécifiées dans certains standards (POSIX.1, Unix 95, Unix 98, et d'autres). Certaines plate-formes définissent des noms additionnels également. Les noms connus par le système d'exploitation sont donnés dans le dictionnaire ``pathconf_names``. Pour les variables de configuration qui ne sont pas inclues dans ce *mapping*, passer un entier pour *name* est également accepté.

source: If *name* is a string and is not known, :exc:`ValueError` is raised. If a specific value for *name* is not supported by the host system, even if it is included in ``pathconf_names``, an :exc:`OSError` is raised with :const:`errno.EINVAL` for the error number.
fr: Si *name* est une chaîne de caractères et n'est pas connu, une :exc:`ValueError` est levée. Si une valeur spécifique de *name* n'est pas gérée par le système hôte, même si elle est incluse dans ``pathconf_names``, une :exc:`OSError` est levée avec :const:`errno.EINVAL` pour code d'erreur.

source: As of Python 3.3, this is equivalent to ``os.pathconf(fd, name)``.
fr: Depuis Python 3.3, c'est équivalent à ``os.pathconf(fd, name)``.

source: Get the status of the file descriptor *fd*. Return a :class:`stat_result` object.
fr: Récupère le statut du descripteur de fichier *fd*. Renvoie un objet :class:`stat_result`.

source: As of Python 3.3, this is equivalent to ``os.stat(fd)``.
fr: Depuis Python 3.3, c'est équivalent à ``os.stat(fd)``.

source: The :func:`.stat` function.
fr: La fonction :func:`.stat`.

source: Return information about the filesystem containing the file associated with file descriptor *fd*, like :func:`statvfs`. As of Python 3.3, this is equivalent to ``os.statvfs(fd)``.
fr: Renvoie des informations sur le système de fichier contenant le fichier associé au descripteur *fd*, comme :func:`statvfs`. Depuis Python 3.3, c'est équivalent à ``os.statvfs(fd)``.

source: Force write of file with filedescriptor *fd* to disk. On Unix, this calls the native :c:func:`fsync` function; on Windows, the MS :c:func:`_commit` function.
fr: Force l'écriture du fichier ayant le descripteur *fd* sur le disque. Sur Unix, cet appel appel la fonction native :c:func:`fsync`, sur Windows, la fonction MS :c:func:`_commit`.

source: If you're starting with a buffered Python :term:`file object` *f*, first do ``f.flush()``, and then do ``os.fsync(f.fileno())``, to ensure that all internal buffers associated with *f* are written to disk.
fr: Si vous débutez avec un :term:`file object` Python mis en tampon *f*, commencez par faire ``f.flush()`` et seulement ensuite ``os.fsync(f.fileno())`` pour être sûr que tous les tampons internes associés à *f* soient écrits sur le disque.

source: Truncate the file corresponding to file descriptor *fd*, so that it is at most *length* bytes in size. As of Python 3.3, this is equivalent to ``os.truncate(fd, length)``.
fr: Tronque le fichier correspondant au descripteur *fd* pour qu'il soit maximum long de *length* *bytes*. Depuis Python 3.3, c'est équivalent à ``os.truncate(fd, length)``.

source: Added support for Windows
fr: Prise en charge de Windows

source: Get the blocking mode of the file descriptor: ``False`` if the :data:`O_NONBLOCK` flag is set, ``True`` if the flag is cleared.
fr: Récupère le mode bloquant du descripteur de fichier : ``False`` si l'indicateur :data:`O_NONBLOCK` est mis, et ``True`` si l'indicateur est effacé.

source: See also :func:`set_blocking` and :meth:`socket.socket.setblocking`.
fr: Voir également :func:`set_blocking` et :meth:`socket.socket.setblocking`.

source: Return ``True`` if the file descriptor *fd* is open and connected to a tty(-like) device, else ``False``.
fr: Renvoie ``True`` si le descripteur de fichier *fd* est ouvert et connecté à un périphérique TTY (ou compatible), sinon ``False``.

source: Apply, test or remove a POSIX lock on an open file descriptor. *fd* is an open file descriptor. *cmd* specifies the command to use - one of :data:`F_LOCK`, :data:`F_TLOCK`, :data:`F_ULOCK` or :data:`F_TEST`. *len* specifies the section of the file to lock.
fr: Applique, teste, ou retire un verrou POSIX sur un descripteur de fichier ouvert. *fd* est un descripteur de fichier ouvert. *cmd* spécifie la commande à utiliser (une des valeurs suivantes : :data:`F_LOCK`, :data:`F_TLOCK`, :data:`F_ULOCK`, ou :data:`F_TEST`). *len* spécifie la section du fichier à verrouiller.

source: Flags that specify what action :func:`lockf` will take.
fr: Indicateurs spécifiant quelle action :func:`lockf` va prendre.

source: Set the current position of file descriptor *fd* to position *pos*, modified by *how*: :const:`SEEK_SET` or ``0`` to set the position relative to the beginning of the file; :const:`SEEK_CUR` or ``1`` to set it relative to the current position; :const:`SEEK_END` or ``2`` to set it relative to the end of the file. Return the new cursor position in bytes, starting from the beginning.
fr: Place la position actuelle du descripteur de fichier *fd* à la position *pos*, modifié par *how* : :const:`SEEK_SET` ou ``0`` pour placer la position à partir du début du fichier, :const:`SEEK_CUR` ou ``1`` pour la placer à partir de la position actuelle, et :const:`SEEK_END` ou ``2`` pour la placer par rapport à la fin du fichier. Renvoie la nouvelle position du curseur en bytes, à partir du début.

source: Parameters to the :func:`lseek` function. Their values are 0, 1, and 2, respectively.
fr: Paramètres de la fonction :func:`lseek`. Leur valeur est respectivement 0, 1, et 2.

source: Some operating systems could support additional values, like :data:`os.SEEK_HOLE` or :data:`os.SEEK_DATA`.
fr: Certains systèmes d'exploitation pourraient gérer des valeurs additionnelles telles que :data:`os.SEEK_HOLE` ou :data:`os.SEEK_DATA`.

source: Open the file *path* and set various flags according to *flags* and possibly its mode according to *mode*. When computing *mode*, the current umask value is first masked out. Return the file descriptor for the newly opened file. The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
fr: Ouvre le fichier *path* et met certains indicateurs selon *flags* et éventuellement son mode selon *mode*. Lors de l'évaluation de *code*, ce *umask* actuel est d'abord masquée. Renvoie le descripteur de fichier du fichier nouvellement ouvert. Le nouveau descripteur de fichier est :ref:`non-héritable <fd_inheritance>`.

source: For a description of the flag and mode values, see the C run-time documentation; flag constants (like :const:`O_RDONLY` and :const:`O_WRONLY`) are defined in the :mod:`os` module. In particular, on Windows adding :const:`O_BINARY` is needed to open files in binary mode.
fr: Pour une description des indicateurs et des valeurs des modes, voir la documentation de la bibliothèque standard du C. Les constantes d'indicateurs (telles que :const:`O_RDONLY` et :const:`O_WRONLY`) sont définies dans le module :mod:`os`. En particulier, sur Windows, ajouter :const:`O_BINARY` est nécessaire pour ouvrir des fichiers en binaire.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>` with the *dir_fd* parameter.
fr: Cette fonction prend en charge des :ref:`chemins relatifs à des descripteurs de répertoires <dir_fd>` avec le paramètre *dir_fd*.

source: This function is intended for low-level I/O. For normal usage, use the built-in function :func:`open`, which returns a :term:`file object` with :meth:`~file.read` and :meth:`~file.write` methods (and many more). To wrap a file descriptor in a file object, use :func:`fdopen`.
fr: Cette fonction est destinée aux E/S de bas-niveau. Pour un usage normal, utilisez la primitive :func:`open` qui renvoie un :term:`file object` avec les méthodes :meth:`~file.read` et :meth:`~file.write` (et plein d'autres). Pour envelopper un descripteur de fichier dans un fichier objet, utilisez :func:`fdopen`.

source: The *dir_fd* argument.
fr: L'argument *dir_fd*.

source: If the system call is interrupted and the signal handler does not raise an exception, the function now retries the system call instead of raising an :exc:`InterruptedError` exception (see :pep:`475` for the rationale).
fr: Si l'appel système est interrompu et que le gestionnaire de signal ne lève aucune exception, la fonction réessaye l'appel système au lieu de lever une :exc:`InterruptedError` (voir la :pep:`475` à propos du raisonnement).

source: Accepts a :term:`path-like object`.
fr: Accepte un :term:`path-like object`.
