Repository: python/python-docs-fr
Catalog: library/os.po
Languages: fr

source: The following constants are options for the *flags* parameter to the :func:`~os.open` function. They can be combined using the bitwise OR operator ``|``. Some of them are not available on all platforms. For descriptions of their availability and use, consult the :manpage:`open(2)` manual page on Unix or `the MSDN <https://msdn.microsoft.com/en-us/library/z0kc8e3z.aspx>`_ on Windows.
fr: Les constantes suivantes sont optionnelles pour le paramètre *flag* à la fonction :func:`~os.open`. Elles peuvent être combinées en utilisant l'opérateur bit-à-bit OR ``|``. certains ne sont pas disponibles sur toutes les plate-formes. Pour une description sur leur disponibilité et leur usage, consultez la page de manuel Unix :manpage:`open(2)` ou la `MSDN <https://msdn.microsoft.com/en-us/library/z0kc8e3z.aspx>`_ sur Windows.

source: The above constants are available on Unix and Windows.
fr: Les constantes ci-dessus sont disponibles sur Unix et Windows.

source: The above constants are only available on Unix.
fr: Les constantes ci-dessus sont uniquement disponibles sur Unix.

source: Add :data:`O_CLOEXEC` constant.
fr: Ajout de la constante :data:`O_CLOCEXEC`.

source: The above constants are only available on Windows.
fr: Les constantes ci-dessus sont uniquement disponibles sur Windows.

source: The above constants are extensions and not present if they are not defined by the C library.
fr: Les constantes ci-dessus sont des extensions et ne sont pas présentes si elles ne sont pas définies par la bibliothèque C.

source: Add :data:`O_PATH` on systems that support it. Add :data:`O_TMPFILE`, only available on Linux Kernel 3.11 or newer.
fr: Ajout de :data:`O_PATH` sur les systèmes qui le gèrent. Ajout de :data:`O_TMPFILE`, uniquement disponible sur Linux Kernel 3.11 ou plus récent.

source: Open a new pseudo-terminal pair. Return a pair of file descriptors ``(master, slave)`` for the pty and the tty, respectively. The new file descriptors are :ref:`non-inheritable <fd_inheritance>`. For a (slightly) more portable approach, use the :mod:`pty` module.
fr: Ouvre une nouvelle paire pseudo-terminal. Renvoie une paire de descripteurs de fichiers ``(master, slave)`` pour le PTY et le TTY respectivement. Les nouveaux descripteurs de fichiers sont :ref:`non-héritables <fd_inheritance>`. Pour une approche (légèrement) plus portable, utilisez le module :mod:`pty`.

source: :ref:`Availability <availability>`: some flavors of Unix.
fr: :ref:`Disponibilité <availability>` : certains dérivés Unix.

source: The new file descriptors are now non-inheritable.
fr: Les nouveaux descripteurs de fichiers sont maintenant non-héritables.

source: Create a pipe. Return a pair of file descriptors ``(r, w)`` usable for reading and writing, respectively. The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
fr: Crée un *pipe* (un tube). Renvoie une paire de descripteurs de fichiers ``(r, w)`` utilisables respectivement pour lire et pour écrire. Les nouveaux descripteurs de fichiers sont :ref:`non-héritables <fd_inheritance>`.

source: Create a pipe with *flags* set atomically. *flags* can be constructed by ORing together one or more of these values: :data:`O_NONBLOCK`, :data:`O_CLOEXEC`. Return a pair of file descriptors ``(r, w)`` usable for reading and writing, respectively.
fr: Crée un *pipe* avec *flags* mis atomiquement. *flags* peut être construit en appliquant l'opérateur ``|`` (OU) sur une ou plus de ces valeurs : :data:`O_NONBLOCK`, :data:`O_CLOEXEC`. Renvoie une paire de descripteurs de fichiers ``(r, w)`` utilisables respectivement pour lire et pour écrire.

source: Ensures that enough disk space is allocated for the file specified by *fd* starting from *offset* and continuing for *len* bytes.
fr: Assure que suffisamment d'espace sur le disque est alloué pour le fichier spécifié par *fd* partant de *offset* et continuant sur *len* bytes.

source: Announces an intention to access data in a specific pattern thus allowing the kernel to make optimizations. The advice applies to the region of the file specified by *fd* starting at *offset* and continuing for *len* bytes. *advice* is one of :data:`POSIX_FADV_NORMAL`, :data:`POSIX_FADV_SEQUENTIAL`, :data:`POSIX_FADV_RANDOM`, :data:`POSIX_FADV_NOREUSE`, :data:`POSIX_FADV_WILLNEED` or :data:`POSIX_FADV_DONTNEED`.
fr: Annonce une intention d'accéder à des données selon un motif spécifique, et donc permettant au noyau de faire des optimisations. Le conseil *advice* s'applique à la région spécifiée par *fd*, démarrant à *offset* et continuant sur *len* bytes. *advice* est une des valeurs suivantes : :data:`POSIX_FADV_NORMAL`, :data:`POSIX_FADV_SEQUENTIAL`, :data:`POSIX_FADV_RANDOM`, :data:`POSIX_FADV_NOREUSE`, :data:`POSIX_FADV_WILLNEED`, ou :data:`POSIX_FADV_DONTNEED`.

source: Flags that can be used in *advice* in :func:`posix_fadvise` that specify the access pattern that is likely to be used.
fr: Indicateurs qui peuvent être utilisés dans *advice* dans la fonction :func:`posix_fadvise` et qui spécifient le motif d'accès qui est censé être utilisé.

source: Read at most *n* bytes from file descriptor *fd* at a position of *offset*, leaving the file offset unchanged.
fr: Lit au maximum *n* octets depuis le descripteur de fichier *fd* à la position *offset* sans modifier cette position.

source: Return a bytestring containing the bytes read. If the end of the file referred to by *fd* has been reached, an empty bytes object is returned.
fr: Renvoie une chaîne d'octets contenant les octets lus, ou une chaîne d'octets vide si la fin du fichier pointé par *fd* est atteinte.

source: Read from a file descriptor *fd* at a position of *offset* into mutable :term:`bytes-like objects <bytes-like object>` *buffers*, leaving the file offset unchanged. Transfer data into each buffer until it is full and then move on to the next buffer in the sequence to hold the rest of the data.
fr: Lit depuis un descripteur de fichier *fd*, à la position *offset* dans des :term:`objets bytes-compatibles <bytes-like object>` muables *buffers*, sans modifier la position dans le fichier. Les données sont transférées dans chaque tampon, jusqu'à ce qu'il soit plein, tour à tour.

source: The flags argument contains a bitwise OR of zero or more of the following flags:
fr: L'argument *flags* contient un OU logique bit-à-bit de zéro ou plusieurs des indicateurs suivants :

source: Return the total number of bytes actually read which can be less than the total capacity of all the objects.
fr: Renvoie le nombre total d'octets réellement lus, qui peut être inférieur à la capacité totale de tous les objets.

source: The operating system may set a limit (:func:`sysconf` value ``'SC_IOV_MAX'``) on the number of buffers that can be used.
fr: Le système d'exploitation peut définir une limite (valeur :func:`sysconf` ``'SC_IOV_MAX'``) sur le nombre de mémoires tampons pouvant être utilisées.

source: Combine the functionality of :func:`os.readv` and :func:`os.pread`.
fr: Combine les fonctionnalités de :func:`os.readv` et :func:`os.pread`.

source: :ref:`Availability <availability>`: Linux 2.6.30 and newer, FreeBSD 6.0 and newer, OpenBSD 2.7 and newer. Using flags requires Linux 4.6 or newer.
fr: :ref:`Disponibilité <availability>` : Linux 2.6.30 et plus récent, FreeBSD 6.0 et plus récent, OpenBSD 2.7 et plus récent. L'utilisation de *flags* requiert Linux 4.6 ou plus récent.

source: Do not wait for data which is not immediately available. If this flag is specified, the system call will return instantly if it would have to read data from the backing storage or wait for a lock.
fr: Ne pas attendre pour des données qui ne sont pas immédiatement disponibles. Si cette option est spécifiée, l'appel système retourne instantanément s'il doit lire les données du stockage sous-jacent ou attendre un verrou.

source: If some data was successfully read, it will return the number of bytes read. If no bytes were read, it will return ``-1`` and set errno to :data:`errno.EAGAIN`.
fr: Si certaines données ont été lues avec succès, le nombre d'octets lus est renvoyé. Si aucun octet n'a été lu, renvoie ``-1`` et affecte à *errno* la valeur :data:`errno.EAGAIN`.

source: :ref:`Availability <availability>`: Linux 4.14 and newer.
fr: :ref:`Disponibilité <availability>` : Linux 4.14 et ultérieures.

source: High priority read/write. Allows block-based filesystems to use polling of the device, which provides lower latency, but may use additional resources.
fr: Lecture/écriture haute priorité. Permet aux systèmes de fichiers de type bloc d'utiliser le *polling* du périphérique, qui fournit une latence inférieure, mais peut utiliser des ressources supplémentaires.

source: Currently, on Linux, this feature is usable only on a file descriptor opened using the :data:`O_DIRECT` flag.
fr: Actuellement, sous Linux, cette fonctionnalité est utilisable uniquement sur un descripteur de fichier ouvert à l'aide de l'option :data:`O_DIRECT`.

source: :ref:`Availability <availability>`: Linux 4.6 and newer.
fr: :ref:`Disponibilité <availability>` : Linux 4.6 et ultérieures.

source: Write the bytestring in *str* to file descriptor *fd* at position of *offset*, leaving the file offset unchanged.
fr: Écrit la chaîne d'octets de *str* dans le descripteur de fichier *fd* à la position *offset* en laissant la position dans le fichier inchangée.

source: Return the number of bytes actually written.
fr: Renvoie le nombre d'octets effectivement écrits.

source: Write the *buffers* contents to file descriptor *fd* at a offset *offset*, leaving the file offset unchanged. *buffers* must be a sequence of :term:`bytes-like objects <bytes-like object>`. Buffers are processed in array order. Entire contents of the first buffer is written before proceeding to the second, and so on.
fr: Écrit le contenu de *buffers* vers le descripteur de fichier *fd* à la position *offset*, en laissant la position du fichier inchangée. *buffers* doit être une séquence de :term:`objets bytes-compatibles <bytes-like object>`. Les tampons sont traités dans l'ordre du tableau. Le contenu entier du premier tampon est écrit avant le traitement du second, etc.

source: Return the total number of bytes actually written.
fr: Renvoie le nombre total d'octets effectivement écrits.

source: Combine the functionality of :func:`os.writev` and :func:`os.pwrite`.
fr: Combine les fonctionnalités de :func:`os. writev` et :func:`os. pwrite`.

source: :ref:`Availability <availability>`: Linux 2.6.30 and newer, FreeBSD 6.0 and newer, OpenBSD 2.7 and newer. Using flags requires Linux 4.7 or newer.
fr: :ref:`Disponibilité <availability>` : Linux 2.6.30 et plus récent, FreeBSD 6.0 et plus récent, OpenBSD 2.7 et plus récent. L'utilisation de *flags* requiert Linux 4.6 ou plus récent.

source: Provide a per-write equivalent of the :data:`O_DSYNC` ``open(2)`` flag. This flag effect applies only to the data range written by the system call.
fr: Fournit un équivalent par écriture de l'option :data:`O_DSYNC` de ``open(2)``. L' effet de cette option s'applique uniquement à la plage de données écrite par l'appel système.

source: :ref:`Availability <availability>`: Linux 4.7 and newer.
fr: :ref:`Disponibilité <availability>` : Linux 4.7 et ultérieures.

source: Provide a per-write equivalent of the :data:`O_SYNC` ``open(2)`` flag. This flag effect applies only to the data range written by the system call.
fr: Fournit un équivalent par écriture de l'option :data:`O_SYNC` de ``open(2)``. L'effet de cette option s'applique uniquement à la plage de données écrite par l'appel système.

source: Read at most *n* bytes from file descriptor *fd*.
fr: Lit au maximum *n* octets du descripteur de fichier *fd*.

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`pipe`. To read a "file object" returned by the built-in function :func:`open` or by :func:`popen` or :func:`fdopen`, or :data:`sys.stdin`, use its :meth:`~file.read` or :meth:`~file.readline` methods.
fr: Cette fonction est destinée aux E/S bas niveau et doit être appliquée à un descripteur de fichier comme renvoyé par :func:`os.open` ou :func:`pipe`. Pour lire dans un "fichier objet" renvoyé par la primitive :func:`open`, :func:`popen` ou :func:`fdopen`, ou par :data:`stdin`, utilisez sa méthode :meth:`~file.read` ou :meth:`~file.readline`.

source: Copy *count* bytes from file descriptor *in* to file descriptor *out* starting at *offset*. Return the number of bytes sent. When EOF is reached return 0.
fr: Copie *count* bytes depuis un descripteur de fichier *in* dans un descripteur de fichier *out* en démarrant à *offset*. Renvoie le nombre de bytes envoyés. Quand EOF est atteint, renvoie 0.

source: The first function notation is supported by all platforms that define :func:`sendfile`.
fr: La première notation de fonction est prise en charge par toutes les plate-formes qui définissent :func:`sendfile`.

source: On Linux, if *offset* is given as ``None``, the bytes are read from the current position of *in* and the position of *in* is updated.
fr: Sur Linux, si *offset* est donné par ``None``, les bytes sont lus depuis la position actuelle de *in* et la position de *in* est mise à jour.

source: The second case may be used on Mac OS X and FreeBSD where *headers* and *trailers* are arbitrary sequences of buffers that are written before and after the data from *in* is written. It returns the same as the first case.
fr: Le second cas peut être utilisé sur Mac OS X et FreeBSD où *headers* et *trailers* sont des séquences arbitraires de tampons qui sont écrites avant et après que les données de *in* ne soient écrites. Renvoie la même chose que le premier cas.

source: On Mac OS X and FreeBSD, a value of 0 for *count* specifies to send until the end of *in* is reached.
fr: Sur Mac OS X et FreeBSD, une valeur de 0 pour *count* spécifié d'envoyer jusqu'à ce que la fin de *in* ne soit atteinte.

source: All platforms support sockets as *out* file descriptor, and some platforms allow other types (e.g. regular file, pipe) as well.
fr: Toutes les plate-formes gèrent les connecteurs comme des descripteurs de fichier *out*, et certaines plate-formes autorisent d'autres types (par exemple, un fichier normal ou un tube) également.

source: Cross-platform applications should not use *headers*, *trailers* and *flags* arguments.
fr: Les applications multiplate-formes ne devraient pas utiliser les arguments *headers*, *trailers*, et *flags*.

source: For a higher-level wrapper of :func:`sendfile`, see :meth:`socket.socket.sendfile`.
fr: Pour une interface de plus haut niveau de :func:`sendfile`, voir :meth:`socket.socket.setfile`.

source: Set the blocking mode of the specified file descriptor. Set the :data:`O_NONBLOCK` flag if blocking is ``False``, clear the flag otherwise.
fr: Définit le mode bloquant d'un descripteur de fichier spécifié. Assigne l'indicateur :data:`O_NONBLOCK` si *blocking* vaut ``False``, efface l'indicateur sinon.

source: See also :func:`get_blocking` and :meth:`socket.socket.setblocking`.
fr: Voir aussi :func:`get_blocking` et :meth:`socket;socket.setblocking`.

source: Parameters to the :func:`sendfile` function, if the implementation supports them.
fr: Paramètres de la fonction :func:`sendfile`, si l'implémentation les gère.

source: Read from a file descriptor *fd* into a number of mutable :term:`bytes-like objects <bytes-like object>` *buffers*. Transfer data into each buffer until it is full and then move on to the next buffer in the sequence to hold the rest of the data.
fr: Lit depuis un descripteur de fichier *fd* dans une séquence d':term:`objets bytes-compatibles <bytes-like object>` muables : *buffers*. Les données sont transférées dans chaque tampon, jusqu'à ce qu'il soit plein, tour à tour.

source: Return the process group associated with the terminal given by *fd* (an open file descriptor as returned by :func:`os.open`).
fr: Renvoie le groupe de processus associé au terminal donné par *fd* (un descripteur de fichier ouvert comme renvoyé par :func:`os.open`).

source: Set the process group associated with the terminal given by *fd* (an open file descriptor as returned by :func:`os.open`) to *pg*.
fr: Place *pg* dans le groupe de processus associé au terminal donné par *fd* (un descripteur de fichier ouvert comme renvoyé par :func:`os.open`).

source: Return a string which specifies the terminal device associated with file descriptor *fd*. If *fd* is not associated with a terminal device, an exception is raised.
fr: Renvoie une chaîne de caractères spécifiant le périphérique terminal associé au descripteur de fichier *fd*. Si *fd* n'est pas associé à un périphérique terminal, une exception est levée.

source: Write the bytestring in *str* to file descriptor *fd*.
fr: Écrit la chaîne d'octets de *str* vers le descripteur de fichier *fd*.

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`pipe`. To write a "file object" returned by the built-in function :func:`open` or by :func:`popen` or :func:`fdopen`, or :data:`sys.stdout` or :data:`sys.stderr`, use its :meth:`~file.write` method.
fr: Cette fonction est destinée aux entrées-sorties bas niveau et doit être appliquée à un descripteur de fichier comme renvoyé par :func:`os.open` ou :func:`pipe`. Pour écrire dans un "fichier objet" renvoyé par la primitive :func:`open`, :func:`popen`, ou par :func:`fdopen`, ou par :data:`sys.stdout` ou :data:`sys.stderr`, utilisez sa méthode :meth:`~file.write`.

source: Write the contents of *buffers* to file descriptor *fd*. *buffers* must be a sequence of :term:`bytes-like objects <bytes-like object>`. Buffers are processed in array order. Entire contents of the first buffer is written before proceeding to the second, and so on.
fr: Écrit le contenu de *buffers* vers le descripteur de fichier *fd*. *buffers* doit être une séquence d':term:`objets bytes-compatibles <bytes-like object>`. Les tampons sont traités dans l'ordre du tableau. Le contenu entier du premier tampon est écrit avant le traitement du second, etc.

source: Returns the total number of bytes actually written.
fr: Renvoie le nombre total d'octets effectivement écrits.

source: Querying the size of a terminal
fr: Demander la taille d'un terminal

source: Return the size of the terminal window as ``(columns, lines)``, tuple of type :class:`terminal_size`.
fr: Renvoie la taille du terminal comme un couple ``(columns, lines)`` de type :class:`terminal_size`.

source: The optional argument ``fd`` (default ``STDOUT_FILENO``, or standard output) specifies which file descriptor should be queried.
fr: L'argument optionnel ``fd`` (par défaut : ``STDOUT_FILENO``, ou la sortie standard) spécifie le descripteur de fichier auquel la requête doit être envoyée.

source: If the file descriptor is not connected to a terminal, an :exc:`OSError` is raised.
fr: Si le descripteur de fichier n'est pas connecté à un terminal, une :exc:`OSError` est levée.

source: :func:`shutil.get_terminal_size` is the high-level function which should normally be used, ``os.get_terminal_size`` is the low-level implementation.
fr: :func:`shutil.get_terminal_size` est la fonction haut-niveau qui devrait normalement être utilisée, ``os.get_terminal_size`` en est l'implémentation bas-niveau.

source: A subclass of tuple, holding ``(columns, lines)`` of the terminal window size.
fr: Une sous-classe de *tuple*, contenant ``(columns, lines)``, la taille du terminal.

source: Width of the terminal window in characters.
fr: Longueur du terminal en caractères.

source: Height of the terminal window in characters.
fr: Hauteur du terminal en caractères.

source: Inheritance of File Descriptors
fr: Héritage de descripteurs de fichiers

source: A file descriptor has an "inheritable" flag which indicates if the file descriptor can be inherited by child processes. Since Python 3.4, file descriptors created by Python are non-inheritable by default.
fr: Un descripteur de fichier a un indicateur indiquant s'il peut être hérité par les processus-fils. Depuis Python 3.4, les descripteurs de fichiers créés par Python ne sont pas héritable par défaut.

source: On UNIX, non-inheritable file descriptors are closed in child processes at the execution of a new program, other file descriptors are inherited.
fr: Sur UNIX, les descripteurs de fichiers non-héritables sont fermés dans les processus-fils à l'exécution, les autres descripteurs sont hérités.

source: On Windows, non-inheritable handles and file descriptors are closed in child processes, except for standard streams (file descriptors 0, 1 and 2: stdin, stdout and stderr), which are always inherited. Using :func:`spawn\* <spawnl>` functions, all inheritable handles and all inheritable file descriptors are inherited. Using the :mod:`subprocess` module, all file descriptors except standard streams are closed, and inheritable handles are only inherited if the *close_fds* parameter is ``False``.
fr: Sur Windows, les fichiers et identificateurs non-héritables sont fermés dans les processus-fils, à part les flux standards (descripteurs 0, 1, et 2 : *stdin*, *stdout* et *stderr*) qui sont toujours hérités. En utilisant les fonctions :func:`spawn\* <spawnl>`, tous les identificateurs héritables et les descripteurs de fichiers héritables sont hérités. En utilisant le module :mod:`subprocess`, tous les descripteurs de fichiers (à part les flux standards) sont fermés, et les identificateurs héritables sont hérités seulement si le paramètre *close_fds* vaut ``False``.

source: Get the "inheritable" flag of the specified file descriptor (a boolean).
fr: Récupère le marqueur "héritable" (booléen) du descripteur de fichier spécifié.

source: Set the "inheritable" flag of the specified file descriptor.
fr: Définit le marqueur "héritable" du descripteur de fichier spécifié.

source: Get the "inheritable" flag of the specified handle (a boolean).
fr: Récupère le marqueur "héritable" (booléen) de l'identificateur spécifié.

source: :ref:`Availability <availability>`: Windows.
fr: :ref:`Disponibilité <availability>` : Windows.

source: Set the "inheritable" flag of the specified handle.
fr: Définit le marqueur "héritable" de l'identificateur spécifié.

source: Files and Directories
fr: Fichiers et répertoires

source: On some Unix platforms, many of these functions support one or more of these features:
fr: Sur certaines plate-formes Unix, beaucoup de ces fonctions gèrent une ou plusieurs des fonctionnalités suivantes :

source: Use the real uid/gid to test for access to *path*. Note that most operations will use the effective uid/gid, therefore this routine can be used in a suid/sgid environment to test if the invoking user has the specified access to *path*. *mode* should be :const:`F_OK` to test the existence of *path*, or it can be the inclusive OR of one or more of :const:`R_OK`, :const:`W_OK`, and :const:`X_OK` to test permissions. Return :const:`True` if access is allowed, :const:`False` if not. See the Unix man page :manpage:`access(2)` for more information.
fr: Utilise l'*uid*/*gid* réel pour tester l'accès à *path*. Notez que la plupart des opérations utiliseront l'*uid*/*gid* effectif, dès lors cette méthode peut être utilisée dans un environnement *suid*/*sgid* pour tester si l'utilisateur invoquant a les droits d'accès pour accéder à *path*. *mode* devrait être :const:`F_OK` pour tester l'existence de *path*, ou il peut être le OR (OU inclusif) d'une ou plusieurs des constantes suivantes : :const:`R_OK`, :const:`W_OK`, et :const:`X_OK` pour tester les permissions. Renvoie :const:`True` si l'accès est permis, et :const:`False` s'il ne l'est pas. Voir la page de manuel Unix :manpage:`access(2)` pour plus d'informations.
