Repository: python/python-docs-fr
Catalog: library/os.po
Languages: fr

source: Similar to :func:`waitpid`, except a 3-element tuple, containing the child's process id, exit status indication, and resource usage information is returned. Refer to :mod:`resource`.\ :func:`~resource.getrusage` for details on resource usage information. The arguments to :func:`wait4` are the same as those provided to :func:`waitpid`.
fr: Similaire à :func:`waitpid`, si ce n'est qu'un triplet contenant l'identifiant du processus fils, son statut de sortie, et des informations d'utilisation des ressources est renvoyé. Référez-vous à :mod:`resource`.\ :func:`~resource.getrusage` pour des détails sur les informations d'utilisation des ressources. Les arguments de :func:`wait4` sont les mêmes que ceux fournis à :func:`waitpid`.

source: The option for :func:`waitpid` to return immediately if no child process status is available immediately. The function returns ``(0, 0)`` in this case.
fr: L'option de :func:`waitpid` pour terminer immédiatement si aucun statut de processus fils n'est disponible dans l'immédiat. La fonction renvoie ``(0, 0)`` dans ce cas.

source: This option causes child processes to be reported if they have been continued from a job control stop since their status was last reported.
fr: Cette option cause les processus fils à être reportés s'ils ont été continués après un arrêt du *job control* depuis leurs derniers reports de statuts.

source: :ref:`Availability <availability>`: some Unix systems.
fr: :ref:`Disponibilité <availability>` : certains systèmes Unix.

source: This option causes child processes to be reported if they have been stopped but their current state has not been reported since they were stopped.
fr: Cette option cause les processus fils à être reportés s'ils ont été stoppés mais que leur état actuel n'a pas été reporté depuis qu'ils ont été stoppés.

source: The following functions take a process status code as returned by :func:`system`, :func:`wait`, or :func:`waitpid` as a parameter. They may be used to determine the disposition of a process.
fr: Les fonctions suivantes prennent un code de statu tel que renvoyé par :func:`system`, :func:`wait`, ou :func:`waitpid` en paramètre. Ils peuvent être utilisés pour déterminer la disposition d'un processus.

source: Return ``True`` if a core dump was generated for the process, otherwise return ``False``.
fr: Renvoie ``True`` si un vidage système (*core dump*) a été généré pour le processus, sinon, renvoie ``False``.

source: Return ``True`` if the process has been continued from a job control stop, otherwise return ``False``.
fr: Renvoie ``True`` si le processus a été continué après un arrêt du *job control*, renvoie ``False`` autrement.

source: Return ``True`` if the process has been stopped, otherwise return ``False``.
fr: Renvoie ``True`` si le processus a été arrête, sinon renvoie ``False``.

source: Return ``True`` if the process exited due to a signal, otherwise return ``False``.
fr: Renvoie ``True`` si le processus s'est terminé à cause d'un signal, sinon, renvoie ``False``.

source: Return ``True`` if the process exited using the :manpage:`exit(2)` system call, otherwise return ``False``.
fr: Renvoie ``True`` si le processus s'est terminé en faisant un appel système :manpage:`exit(2)`, sinon, renvoie ``False``.

source: If ``WIFEXITED(status)`` is true, return the integer parameter to the :manpage:`exit(2)` system call. Otherwise, the return value is meaningless.
fr: Si ``WIFEXITED(status)`` vaut ``True``, renvoie le paramètre entier de l'appel système :manpage:`exit(2)`. Sinon, la valeur de retour n'a pas de signification.

source: Return the signal which caused the process to stop.
fr: Renvoie le signal qui a causé l'arrêt du processus.

source: Return the signal which caused the process to exit.
fr: Renvoie le signal qui a amené le processus à quitter.

source: Interface to the scheduler
fr: Interface pour l'ordonnanceur

source: These functions control how a process is allocated CPU time by the operating system. They are only available on some Unix platforms. For more detailed information, consult your Unix manpages.
fr: Ces fonctions contrôlent un processus se voit allouer du temps de processus par le système d'exploitation. Elles ne sont disponibles que sur certaines plate-formes Unix. Pour des informations plus détaillées, consultez les pages de manuels Unix.

source: The following scheduling policies are exposed if they are supported by the operating system.
fr: Les polices d'ordonnancement suivantes sont exposées si elles sont gérées par le système d'exploitation.

source: The default scheduling policy.
fr: La police d'ordonnancement par défaut.

source: Scheduling policy for CPU-intensive processes that tries to preserve interactivity on the rest of the computer.
fr: Police d'ordonnancement pour les processus intensifs en utilisation du processeur. Cette police essaye de préserver l'interactivité pour le reste de l'ordinateur.

source: Scheduling policy for extremely low priority background tasks.
fr: Police d'ordonnancement pour les tâches de fond avec une priorité extrêmement faible.

source: Scheduling policy for sporadic server programs.
fr: Police d'ordonnancement pour des programmes serveurs sporadiques.

source: A First In First Out scheduling policy.
fr: Une police d'ordonnancement *FIFO* (dernier arrivé, premier servi).

source: A round-robin scheduling policy.
fr: Une police d'ordonnancement *round-robin* (tourniquet).

source: This flag can be OR'ed with any other scheduling policy. When a process with this flag set forks, its child's scheduling policy and priority are reset to the default.
fr: Cette option peut combiner différentes politiques d'ordonnancement avec un OU bit-à-bit. Quand un processus avec cette option se dédouble, la politique d'ordonnancement et la priorité du processus fils sont remises aux valeurs par défaut.

source: This class represents tunable scheduling parameters used in :func:`sched_setparam`, :func:`sched_setscheduler`, and :func:`sched_getparam`. It is immutable.
fr: Cette classe représente des paramètres d'ordonnancement réglables utilisés pour :func:`sched_setparam`, :func:`sched_setscheduler`, et :func:`sched_getparam`. Un objet de ce type est immuable.

source: At the moment, there is only one possible parameter:
fr: Pour le moment, il n'y a qu'un seul paramètre possible :

source: The scheduling priority for a scheduling policy.
fr: La priorité d'ordonnancement pour une police d'ordonnancement.

source: Get the minimum priority value for *policy*. *policy* is one of the scheduling policy constants above.
fr: Récupère la valeur minimum pour une priorité pour la police *policy*. *policy* est une des constantes de police définies ci-dessus.

source: Get the maximum priority value for *policy*. *policy* is one of the scheduling policy constants above.
fr: Récupère la valeur maximum pour une priorité pour la police *policy*. *policy* est une des constantes de police définies ci-dessus.

source: Set the scheduling policy for the process with PID *pid*. A *pid* of 0 means the calling process. *policy* is one of the scheduling policy constants above. *param* is a :class:`sched_param` instance.
fr: Définit la police d'ordonnancement pour le processus de PID *pid*. Un *pid* de ``0`` signifie le processus appelant. *policy* est une des constantes de police définies ci-dessus. *param* est une instance de la classe :class:`sched_param`.

source: Return the scheduling policy for the process with PID *pid*. A *pid* of 0 means the calling process. The result is one of the scheduling policy constants above.
fr: Renvoie la police d'ordonnancement pour le processus de PID *pid*. Un *pid* de 0 signifie le processus appelant. Le résultat est une des constantes de police définies ci-dessus.

source: Set a scheduling parameters for the process with PID *pid*. A *pid* of 0 means the calling process. *param* is a :class:`sched_param` instance.
fr: Définit un paramètre d'ordonnancement pour le processus de PID *pid*. Un *pid* de ``0`` signifie le processus appelant. *param* est une instance de :class:`sched_param`.

source: Return the scheduling parameters as a :class:`sched_param` instance for the process with PID *pid*. A *pid* of 0 means the calling process.
fr: Renvoie les paramètres d'ordonnancement dans une de :class:`sched_param` pour le processus de PID *pid*. Un *pid* de ``0`` signifie le processus appelant.

source: Return the round-robin quantum in seconds for the process with PID *pid*. A *pid* of 0 means the calling process.
fr: Renvoie le quantum de temps du *round-robin* (en secondes) pour le processus de PID *pid*. Un *pid* de ``0`` signifie le processus appelant.

source: Voluntarily relinquish the CPU.
fr: Abandonne volontairement le processeur.

source: Restrict the process with PID *pid* (or the current process if zero) to a set of CPUs. *mask* is an iterable of integers representing the set of CPUs to which the process should be restricted.
fr: Restreint le processus de PID *pid* (ou le processus actuel si *pid* vaut ``0``) à un ensemble de CPUs. *mask* est un itérable d'entiers représentant l'ensemble de CPUs auquel le processus doit être restreint.

source: Return the set of CPUs the process with PID *pid* (or the current process if zero) is restricted to.
fr: Renvoie l'ensemble de CPUs auquel le processus de PID *pid* (ou le processus actuel si *pid* vaut ``0``) est restreint.

source: Miscellaneous System Information
fr: Diverses informations sur le système

source: Return string-valued system configuration values. *name* specifies the configuration value to retrieve; it may be a string which is the name of a defined system value; these names are specified in a number of standards (POSIX, Unix 95, Unix 98, and others). Some platforms define additional names as well. The names known to the host operating system are given as the keys of the ``confstr_names`` dictionary. For configuration variables not included in that mapping, passing an integer for *name* is also accepted.
fr: Renvoie les valeurs de configuration en chaînes de caractères. *name* spécifie la valeur de configuration à récupérer. Ce peut être une chaîne de caractères représentant le nom d'une valeur système définie dans un nombre de standards (POSIX, Unix 95, Unix 98, et d'autres). Certaines plate-formes définissent des noms supplémentaires également. Les noms connus par le système d'exploitation hôte sont données dans les clefs du dictionnaire ``confstr_names``. Pour les variables de configuration qui ne sont pas incluses dans ce *mapping*, passer un entier pour *name* est également accepté.

source: If the configuration value specified by *name* isn't defined, ``None`` is returned.
fr: Si la valeur de configuration spécifiée par *name* n'est pas définie, ``None`` est renvoyé.

source: If *name* is a string and is not known, :exc:`ValueError` is raised. If a specific value for *name* is not supported by the host system, even if it is included in ``confstr_names``, an :exc:`OSError` is raised with :const:`errno.EINVAL` for the error number.
fr: Si *name* est une chaîne de caractères et n'est pas connue, une :exc:`ValueError` est levée. Si une valeur spécifique pour *name* n'est pas gérée par le système hôte, même si elle est incluse dans ``confstr_names``, une :exc:`OSError` est levée avec :const:`errno.EINVAL` pour numéro d'erreur.

source: Dictionary mapping names accepted by :func:`confstr` to the integer values defined for those names by the host operating system. This can be used to determine the set of names known to the system.
fr: Dictionnaire liant les noms acceptés par :func:`confstr` aux valeurs entières définies pour ces noms par le système d'exploitation hôte. Cela peut être utilisé pour déterminer l'ensemble des noms connus du système.

source: Return the number of CPUs in the system. Returns ``None`` if undetermined.
fr: Renvoie le nombre de CPUs dans le système. Renvoie ``None`` si indéterminé.

source: This number is not equivalent to the number of CPUs the current process can use. The number of usable CPUs can be obtained with ``len(os.sched_getaffinity(0))``
fr: Ce nombre n'est pas équivalent au nombre de CPUs que le processus courant peut utiliser. Le nombre de CPUs utilisables peut être obtenu avec ``len(os.sched_getaffinity(0))``

source: Return the number of processes in the system run queue averaged over the last 1, 5, and 15 minutes or raises :exc:`OSError` if the load average was unobtainable.
fr: Renvoie le nombre de processus dans la file d'exécution du système en moyenne dans les dernières 1, 5, et 15 minutes, ou lève une :exc:`OSError` si la charge moyenne est impossible à récupérer.

source: Return integer-valued system configuration values. If the configuration value specified by *name* isn't defined, ``-1`` is returned. The comments regarding the *name* parameter for :func:`confstr` apply here as well; the dictionary that provides information on the known names is given by ``sysconf_names``.
fr: Renvoie les valeurs de configuration en nombres entiers. Si la valeur de configuration définie par *name* n'est pas spécifiée, ``-1`` est renvoyé. Les commentaires concernant le paramètre *name* de :func:`confstr` s'appliquent également ici, le dictionnaire qui fournit les informations sur les noms connus est donné par ``sysconf_names``.

source: Dictionary mapping names accepted by :func:`sysconf` to the integer values defined for those names by the host operating system. This can be used to determine the set of names known to the system.
fr: Dictionnaire liant les noms acceptés par :func:`sysconf` aux valeurs entières définies pour ces noms par le système d'exploitation hôte. Cela peut être utilisé pour déterminer l'ensemble des noms connus du système.

source: The following data values are used to support path manipulation operations. These are defined for all platforms.
fr: Les valeurs suivantes sont utilisées pour gérer les opérations de manipulations de chemins. Elles sont définies pour toutes les plate-formes.

source: Higher-level operations on pathnames are defined in the :mod:`os.path` module.
fr: Des opérations de plus haut niveau sur les chemins sont définies dans le module :mod:`os.path`.

source: The constant string used by the operating system to refer to the current directory. This is ``'.'`` for Windows and POSIX. Also available via :mod:`os.path`.
fr: La chaîne de caractère constante utilisée par le système d'exploitation pour référencer le répertoire actuel. Ça vaut ``'.'`` pour Windows et POSIX. Également disponible par :mod:`os.path`.

source: The constant string used by the operating system to refer to the parent directory. This is ``'..'`` for Windows and POSIX. Also available via :mod:`os.path`.
fr: La chaîne de caractère constante utilisée par le système d'exploitation pour référencer le répertoire parent. Ça vaut ``'..'`` pour Windows et POSIX. Également disponible par :mod:`os.path`.

source: The character used by the operating system to separate pathname components. This is ``'/'`` for POSIX and ``'\\'`` for Windows. Note that knowing this is not sufficient to be able to parse or concatenate pathnames --- use :func:`os.path.split` and :func:`os.path.join` --- but it is occasionally useful. Also available via :mod:`os.path`.
fr: Le caractère utilisé par le système d'exploitation pour séparer les composantes des chemins. C'est ``'/'`` pour POSIX, et ``'\\'`` pour Windows. Notez que ce n'est pas suffisant pour pouvoir analyser ou concaténer correctement des chemins (utilisez alors :func:`os.path.split` et :func:`os.path.join`), mais ça peut s'avérer utile occasionnellement. Également disponible par :mod:`os.path`.

source: An alternative character used by the operating system to separate pathname components, or ``None`` if only one separator character exists. This is set to ``'/'`` on Windows systems where ``sep`` is a backslash. Also available via :mod:`os.path`.
fr: Un caractère alternatif utilisé par le système d'exploitation pour séparer les composantes des chemins, ou ``None`` si un seul séparateur existe. Ça vaut ``'/'`` sur Windows où ``sep`` est un antislash ``'\'``. Également disponible par :mod:`os.path`.

source: The character which separates the base filename from the extension; for example, the ``'.'`` in :file:`os.py`. Also available via :mod:`os.path`.
fr: Le caractère qui sépare la base du nom d'un fichier et son extension. Par exemple, le ``'.'`` de :file:`os.py`. Également disponible par :mod:`os.path`.

source: The character conventionally used by the operating system to separate search path components (as in :envvar:`PATH`), such as ``':'`` for POSIX or ``';'`` for Windows. Also available via :mod:`os.path`.
fr: Le caractère conventionnellement utilisé par le système d'exploitation pour séparer la recherche des composantes de chemin (comme dans la variable d'environnement :envvar:`PATH`). Cela vaut ``':'`` pour POSIX, ou ``';'`` pour Windows. Également disponible par :mod:`os.path`.

source: The default search path used by :func:`exec\*p\* <execl>` and :func:`spawn\*p\* <spawnl>` if the environment doesn't have a ``'PATH'`` key. Also available via :mod:`os.path`.
fr: Le chemin de recherche par défaut utilisé par :func:`exec\* <execl>` et :func:`spawn\* <spawnl>` si l'environnement n'a pas une clef ``'PATH'``. Également disponible par :mod:`os.path`.

source: The string used to separate (or, rather, terminate) lines on the current platform. This may be a single character, such as ``'\n'`` for POSIX, or multiple characters, for example, ``'\r\n'`` for Windows. Do not use *os.linesep* as a line terminator when writing files opened in text mode (the default); use a single ``'\n'`` instead, on all platforms.
fr: La chaîne de caractères utilisée pour séparer (ou plutôt pour terminer) les lignes sur la plate-forme actuelle. Ce peut être un caractère unique (comme ``'\n'`` pour POSIX,) ou plusieurs caractères (comme ``'\r\n'`` pour Windows). N'utilisez pas *os.linesep* comme terminateur de ligne quand vous écrivez dans un fichier ouvert en mode *texte* (par défaut). Utilisez un unique ``'\n'`` à la place, sur toutes les plate-formes.

source: The file path of the null device. For example: ``'/dev/null'`` for POSIX, ``'nul'`` for Windows. Also available via :mod:`os.path`.
fr: Le chemin de fichier du périphérique *null*. Par exemple : ``'/dev/null'`` pour POSIX, ``'nul'`` pour Windows. Également disponible par :mod:`os.path`.

source: Flags for use with the :func:`~sys.setdlopenflags` and :func:`~sys.getdlopenflags` functions. See the Unix manual page :manpage:`dlopen(3)` for what the different flags mean.
fr: Marqueurs à utiliser avec les fonctions :func:`~sys.setdlopenflags` et :func:`~sys.getdlopenflags`. Voir les pages de manuel Unix :manpage:`dlopen(3)` pour les différences de significations entre les marqueurs.

source: Random numbers
fr: Nombres aléatoires

source: Get up to *size* random bytes. The function can return less bytes than requested.
fr: Obtient *size* octets aléatoires. La fonction renvoie éventuellement moins d'octets que demandé.

source: These bytes can be used to seed user-space random number generators or for cryptographic purposes.
fr: Ces octets peuvent être utilisés pour initialiser un générateur de nombres aléatoires dans l'espace utilisateur ou pour des raisons cryptographiques.

source: ``getrandom()`` relies on entropy gathered from device drivers and other sources of environmental noise. Unnecessarily reading large quantities of data will have a negative impact on other users of the ``/dev/random`` and ``/dev/urandom`` devices.
fr: ``getrandom()`` se base sur l'entropie rassemblée depuis les pilotes des périphériques et autres sources de bruits de l'environnement. La lecture de grosses quantités de données aura un impact négatif sur les autres utilisateurs des périphériques ``/dev/random`` et ``/dev/urandom``.

source: The flags argument is a bit mask that can contain zero or more of the following values ORed together: :py:data:`os.GRND_RANDOM` and :py:data:`GRND_NONBLOCK`.
fr: L'argument *flags* est un champ de bits qui peut contenir zéro ou plus des valeurs suivantes combinées avec un OU bit-à-bit : :py:data:`os.GRND_RANDOM` et :py:data:`GRND_NONBLOCK`.

source: See also the `Linux getrandom() manual page <http://man7.org/linux/man-pages/man2/getrandom.2.html>`_.
fr: Voir aussi la `page de manuel Linux pour getrandom() <http://man7.org/linux/man-pages/man2/getrandom.2.html>`_.

source: :ref:`Availability <availability>`: Linux 3.17 and newer.
fr: :ref:`Disponibilité <availability>` : Linux 3.17 et ultérieures.

source: Return a string of *size* random bytes suitable for cryptographic use.
fr: Renvoie une chaîne de *size* octets aléatoires utilisable dans un cadre cryptographique.

source: This function returns random bytes from an OS-specific randomness source. The returned data should be unpredictable enough for cryptographic applications, though its exact quality depends on the OS implementation.
fr: Cette fonction renvoie des octets aléatoires depuis un source spécifique à l'OS. Les données renvoyées sont censées être suffisamment imprévisibles pour les applications cryptographiques, bien que la qualité dépende de l'implémentation du système.

source: On Linux, if the ``getrandom()`` syscall is available, it is used in blocking mode: block until the system urandom entropy pool is initialized (128 bits of entropy are collected by the kernel). See the :pep:`524` for the rationale. On Linux, the :func:`getrandom` function can be used to get random bytes in non-blocking mode (using the :data:`GRND_NONBLOCK` flag) or to poll until the system urandom entropy pool is initialized.
fr: Sous Linux, si l'appel système ``getrandom()`` est disponible, il est utilisé en mode bloquant : il bloque jusqu'à ce que la réserve d'entropie d'*urandom* soit initialisée (128 bits d'entropie sont collectés par le noyau). Voir la :pep:`524` pour plus d'explications. Sous Linux, la fonction :func:`getrandom` peut être utilisée pour obtenir des octets aléatoires en mode non-bloquant (avec l'option :data:`GRND_NONBLOCK`) ou attendre jusqu'à ce que la réserve d'entropie d'*urandom* soit initialisée.

source: On a Unix-like system, random bytes are read from the ``/dev/urandom`` device. If the ``/dev/urandom`` device is not available or not readable, the :exc:`NotImplementedError` exception is raised.
fr: Sur un système de type UNIX, les octets aléatoires sont lus depuis le périphérique ``/dev/urandom``. Si le périphérique ``/dev/urandom`` n'est pas disponible ou n'est pas lisible, l'exception :exc:`NotImplementedError` est levée.

source: On Windows, it will use ``CryptGenRandom()``.
fr: Sous Windows, ``CryptGenRandom()`` est utilisée.

source: The :mod:`secrets` module provides higher level functions. For an easy-to-use interface to the random number generator provided by your platform, please see :class:`random.SystemRandom`.
fr: Le module :mod:`secrets` fournit des fonctions de plus haut niveau. Pour une interface facile à utiliser du générateur de nombres aléatoires fourni par votre plate-forme, veuillez regarder :class:`random.SystemRandom`.

source: On Linux, ``getrandom()`` is now used in blocking mode to increase the security.
fr: Sous Linux, ``getrandom()`` est maintenant utilisé en mode bloquant pour renforcer la sécurité.

source: On Linux, if the ``getrandom()`` syscall blocks (the urandom entropy pool is not initialized yet), fall back on reading ``/dev/urandom``.
fr: Sous Linux, si l'appel système ``getrandom()`` bloque (la réserve d'entropie d'*urandom* n'est pas encore initialisée), réalise à la place une lecture de ``/dev/urandom``.
