Repository: python/python-docs-fr
Catalog: library/os.po
Languages: fr

source: This function always supports :ref:`paths relative to directory descriptors <dir_fd>` and :ref:`not following symlinks <follow_symlinks>`. Note however that, unlike other functions, the :func:`fwalk` default value for *follow_symlinks* is ``False``.
fr: Cette fonction prend toujours en charge :ref:`les chemins relatifs à des descripteurs de fichiers <dir_fd>` et :ref:`le non-suivi des liens symboliques <follow_symlinks>`. Notez cependant qu'à l'inverse des autres fonctions, la valeur par défaut de *follow_symlinks* pour :func:`walk` est ``False``.

source: Since :func:`fwalk` yields file descriptors, those are only valid until the next iteration step, so you should duplicate them (e.g. with :func:`dup`) if you want to keep them longer.
fr: Puisque :func:`fwalk` fournit des descripteurs de fichiers, ils ne sont valides que jusque la prochaine itération. Donc vous devriez les dupliquer (par exemple avec :func:`dup`) si vous désirez les garder plus longtemps.

source: In the next example, walking the tree bottom-up is essential: :func:`rmdir` doesn't allow deleting a directory before the directory is empty::
fr: Dans le prochain exemple, parcourir l'arbre de bas-en-haut est essentiel : :func:`rmdir` ne permet pas de supprimer un répertoire avant qu'il ne soit vide ::

source: Added support for :class:`bytes` paths.
fr: Ajout de la gestion des chemins de type :class:`bytes`.

source: Linux extended attributes
fr: Attributs étendus pour Linux

source: These functions are all available on Linux only.
fr: Toutes ces fonctions ne sont disponibles que sur Linux.

source: Return the value of the extended filesystem attribute *attribute* for *path*. *attribute* can be bytes or str (directly or indirectly through the :class:`PathLike` interface). If it is str, it is encoded with the filesystem encoding.
fr: Renvoie la valeur de l'attribut étendu *attribute* du système de fichiers pour le chemin *path*. *attribute* peut être une chaîne de caractères ou d'octets (directement ou indirectement à travers une interface :class:`PathLike`). Si c'est une chaîne de caractères, elle est encodée avec l'encodage du système de fichiers.

source: Accepts a :term:`path-like object` for *path* and *attribute*.
fr: Accepte un :term:`path-like object` pour *path* et *attribute*.

source: Return a list of the extended filesystem attributes on *path*. The attributes in the list are represented as strings decoded with the filesystem encoding. If *path* is ``None``, :func:`listxattr` will examine the current directory.
fr: Renvoie une liste d'attributs du système de fichiers étendu pour *path*. Les attributs dans le liste sont représentés par des chaînes de caractères et sont décodés avec l'encodage du système de fichier. Si *path* vaut ``None``, :func:`listxattr` examinera le répertoire actuel.

source: Removes the extended filesystem attribute *attribute* from *path*. *attribute* should be bytes or str (directly or indirectly through the :class:`PathLike` interface). If it is a string, it is encoded with the filesystem encoding.
fr: Supprime l'attribut étendu *attribute* du système de fichier pour le chemin *path*. *attribute* devrait être une chaîne de caractères ou d'octets (directement ou indirectement à travers une interface :class:`PathLike`). Si c'est une chaîne de caractères, elle est encodée avec l'encodage du système de fichiers.

source: Set the extended filesystem attribute *attribute* on *path* to *value*. *attribute* must be a bytes or str with no embedded NULs (directly or indirectly through the :class:`PathLike` interface). If it is a str, it is encoded with the filesystem encoding. *flags* may be :data:`XATTR_REPLACE` or :data:`XATTR_CREATE`. If :data:`XATTR_REPLACE` is given and the attribute does not exist, ``EEXISTS`` will be raised. If :data:`XATTR_CREATE` is given and the attribute already exists, the attribute will not be created and ``ENODATA`` will be raised.
fr: Règle l'attribut étendu *attribute* du système de fichier pour le chemin *path* à *value*. *attribute* doit être une chaîne de caractères ou d'octets sans caractères nuls (directement ou indirectement à travers une interface :class:`PathLike`). Si c'est une chaîne de caractères, elle est encodée avec l'encodage du système de fichiers. *flags* peut être :data:`XATTR_REPLACE` ou :data:`XATTR_CREATE`. Si :data:`XATTR_REPLACE` est donné et que l'attribut n'existe pas, ``EEXISTS`` sera levée. Si :data:`XATTR_CREATE` est donné et que l'attribut existe déjà, l'attribut ne sera pas créé et ``ENODATA`` sera levée.

source: A bug in Linux kernel versions less than 2.6.39 caused the flags argument to be ignored on some filesystems.
fr: Un bug des versions inférieures à 2.6.39 du noyau Linux faisait que les marqueurs de *flags* étaient ignorés sur certains systèmes.

source: The maximum size the value of an extended attribute can be. Currently, this is 64 KiB on Linux.
fr: La taille maximum que peut faire la valeur d'un attribut étendu. Actuellement, c'est 64 KiB sur Lniux.

source: This is a possible value for the flags argument in :func:`setxattr`. It indicates the operation must create an attribute.
fr: C'est une valeur possible pour l'argument *flags* de :func:`setxattr`. Elle indique que l'opération doit créer un attribut.

source: This is a possible value for the flags argument in :func:`setxattr`. It indicates the operation must replace an existing attribute.
fr: C'est une valeur possible pour l'argument *flags* de :func:`setxattr`.Elle indique que l'opération doit remplacer un attribut existant.

source: Process Management
fr: Gestion des processus

source: These functions may be used to create and manage processes.
fr: Ces fonctions peuvent être utilisées pour créer et gérer des processus.

source: The various :func:`exec\* <execl>` functions take a list of arguments for the new program loaded into the process. In each case, the first of these arguments is passed to the new program as its own name rather than as an argument a user may have typed on a command line. For the C programmer, this is the ``argv[0]`` passed to a program's :c:func:`main`. For example, ``os.execv('/bin/echo', ['foo', 'bar'])`` will only print ``bar`` on standard output; ``foo`` will seem to be ignored.
fr: Les variantes des fonctions :func:`exec\* <execl>` prennent une liste d'arguments pour le nouveau programme chargé dans le processus. Dans tous les cas, le premier de ces arguments est passé au nouveau programme comme son propre nom plutôt que comme un argument qu'un utilisateur peut avoir tapé en ligne de commande. Pour les programmeurs C, c'est l'argument ``argv[0]`` qui est passé à la fonction :c:func:`main` du programme. Par exemple, ``os.execv('/bin/echo/', ['foo', 'bar'])`` affichera uniquement ``bar`` sur la sortie standard ; ``foo`` semblera être ignoré.

source: Generate a :const:`SIGABRT` signal to the current process. On Unix, the default behavior is to produce a core dump; on Windows, the process immediately returns an exit code of ``3``. Be aware that calling this function will not call the Python signal handler registered for :const:`SIGABRT` with :func:`signal.signal`.
fr: Génère un signal :const:`SIGABRT` au processus actuel. Sur Linux, le comportement par défaut est de produire un vidage système (*Core Dump*) ; sur Windows, le processus renvoie immédiatement un code d'erreur ``3``. Attention : appeler cette fonction n'appellera pas le gestionnaire de signal Python enregistré par :const:`SIGABRT` à l'aide de :func:`signal.signal`.

source: These functions all execute a new program, replacing the current process; they do not return. On Unix, the new executable is loaded into the current process, and will have the same process id as the caller. Errors will be reported as :exc:`OSError` exceptions.
fr: Ces fonctions exécutent toutes un nouveau programme, remplaçant le processus actuel, elles ne renvoient pas. Sur Unix, le nouvel exécutable est chargé dans le processus actuel, et aura le même identifiant de processus (PID) que l'appelant. Les erreurs seront reportées par des exceptions :exc:`OSError`.

source: The current process is replaced immediately. Open file objects and descriptors are not flushed, so if there may be data buffered on these open files, you should flush them using :func:`sys.stdout.flush` or :func:`os.fsync` before calling an :func:`exec\* <execl>` function.
fr: Le processus actuel est remplacé immédiatement. Les fichiers objets et descripteurs de fichiers ne sont pas purgés, donc s'il est possible que des données aient été mises en tampon pour ces fichiers, vous devriez les purger manuellement en utilisant :func:`sys.stdout.flush` ou :func:`os.fsync` avant d'appeler une fonction :func:`exec\* <execl>`.

source: The "l" and "v" variants of the :func:`exec\* <execl>` functions differ in how command-line arguments are passed. The "l" variants are perhaps the easiest to work with if the number of parameters is fixed when the code is written; the individual parameters simply become additional parameters to the :func:`execl\*` functions. The "v" variants are good when the number of parameters is variable, with the arguments being passed in a list or tuple as the *args* parameter. In either case, the arguments to the child process should start with the name of the command being run, but this is not enforced.
fr: Les variantes "l" et "v" des fonctions :func:`exec\* <execl>` différent sur la manière de passer les arguments de ligne de commande. Les variantes "l" sont probablement les plus simples à utiliser si le nombre de paramètres est fixé lors de l'écriture du code. Les paramètres individuels deviennent alors des paramètres additionnels aux fonctions :func:`exec\*`. Les variantes "v" sont préférables quand le nombre de paramètres est variable et qu'ils sont passés dans une liste ou un *tuple* dans le paramètre *args*. Dans tous les cas, les arguments aux processus fils devraient commencer avec le nom de la commande à lancer, mais ce n'est pas obligatoire.

source: The variants which include a "p" near the end (:func:`execlp`, :func:`execlpe`, :func:`execvp`, and :func:`execvpe`) will use the :envvar:`PATH` environment variable to locate the program *file*. When the environment is being replaced (using one of the :func:`exec\*e <execl>` variants, discussed in the next paragraph), the new environment is used as the source of the :envvar:`PATH` variable. The other variants, :func:`execl`, :func:`execle`, :func:`execv`, and :func:`execve`, will not use the :envvar:`PATH` variable to locate the executable; *path* must contain an appropriate absolute or relative path.
fr: Les variantes qui incluent un "p"vers la fin (:func:`execlp`, :func:`execlpe`, :func:`execvp`, et :func:`execvpe`) utiliseront la variable d'environnement :envvar:`PATH` pour localiser le programme *file*. Quand l'environnement est remplacé (en utilisant une des variantes :func:`exec\*e <execl>`, discutées dans le paragraphe suivant), le nouvel environnement est utilisé comme source de la variable d'environnement :envvar:`PATH`. Les autres variantes :func:`execl`, :func:`execle`, :func:`execv`, et :func:`execve` n'utiliseront pas la variable d'environnement :envvar:`PATH` pour localiser l'exécutable. *path* doit contenir un chemin absolue ou relatif approprié.

source: For :func:`execle`, :func:`execlpe`, :func:`execve`, and :func:`execvpe` (note that these all end in "e"), the *env* parameter must be a mapping which is used to define the environment variables for the new process (these are used instead of the current process' environment); the functions :func:`execl`, :func:`execlp`, :func:`execv`, and :func:`execvp` all cause the new process to inherit the environment of the current process.
fr: Pour les fonctions :func:`execle`, :func:`execlpe`, :func:`execve`, et :func:`execvpe` (notez qu'elle finissent toutes par "e"), le paramètre *env* doit être un *mapping* qui est utilisé pour définir les variables d'environnement du nouveau processus (celles-ci sont utilisées à la place de l'environnement du nouveau processus). Les fonctions :func:`execl`, :func:`execlp`, :func:`execv`, et :func:`execvp` causent toutes un héritage de l'environnement du processus actuel par le processus fils.

source: For :func:`execve` on some platforms, *path* may also be specified as an open file descriptor. This functionality may not be supported on your platform; you can check whether or not it is available using :data:`os.supports_fd`. If it is unavailable, using it will raise a :exc:`NotImplementedError`.
fr: Pour :func:`execve`, sur certaines plate-formes, *path* peut également être spécifié par un descripteur de fichier ouvert. Cette fonctionnalité peut ne pas être gérée sur votre plate-forme. Vous pouvez vérifier si c'est disponible en utilisant :data:`os._supports_fd`. Si c'est indisponible, l'utiliser lèvera une :exc:`NotImplementedError`.

source: Exit the process with status *n*, without calling cleanup handlers, flushing stdio buffers, etc.
fr: Quitte le processus avec le statut *n*, sans appeler les gestionnaires de nettoyage, sans purger les tampons des fichiers, etc.

source: The standard way to exit is ``sys.exit(n)``. :func:`_exit` should normally only be used in the child process after a :func:`fork`.
fr: La méthode standard pour quitter est ``sys.exit(n)``. :func:`_exit` devrait normalement être utilisé uniquement par le processus fils après un :func:`fork`.

source: The following exit codes are defined and can be used with :func:`_exit`, although they are not required. These are typically used for system programs written in Python, such as a mail server's external command delivery program.
fr: Les codes de sortie suivants sont définis et peuvent être utilisés avec :func:`_exit`, mais ils ne sont pas nécessaires. Ils sont typiquement utilisés pour les programmes systèmes écrits en Python, comme un programme de gestion de l'exécution des commandes d'un serveur de mails.

source: Some of these may not be available on all Unix platforms, since there is some variation. These constants are defined where they are defined by the underlying platform.
fr: Certaines de ces valeurs peuvent ne pas être disponibles sur toutes les plate-formes Unix étant donné qu'il en existe des variations. Ces constantes sont définies là où elles sont définies par la plate-forme sous-jacente.

source: Exit code that means no error occurred.
fr: Code de sortie signifiant qu'aucune erreur n'est arrivée.

source: Exit code that means the command was used incorrectly, such as when the wrong number of arguments are given.
fr: Code de sortie signifiant que les commandes n'ont pas été utilisées correctement, comme quand le mauvais nombre d'arguments a été donné.

source: Exit code that means the input data was incorrect.
fr: Code de sortie signifiant que les données en entrées étaient incorrectes.

source: Exit code that means an input file did not exist or was not readable.
fr: Code de sortie signifiant qu'un des fichiers d'entrée n'existe pas ou n'est pas lisible.

source: Exit code that means a specified user did not exist.
fr: Code de sortie signifiant qu'un utilisateur spécifié n'existe pas.

source: Exit code that means a specified host did not exist.
fr: Code de sortie signifiant qu'un hôte spécifié n'existe pas.

source: Exit code that means that a required service is unavailable.
fr: Code de sortie signifiant qu'un service requis n'est pas disponible.

source: Exit code that means an internal software error was detected.
fr: Code de sortie signifiant qu'une erreur interne d'un programme a été détectée.

source: Exit code that means an operating system error was detected, such as the inability to fork or create a pipe.
fr: Code de sortie signifiant qu'une erreur du système d'exploitation a été détectée, comme l'incapacité à réaliser un *fork* ou à créer un tuyau (*pipe*).

source: Exit code that means some system file did not exist, could not be opened, or had some other kind of error.
fr: Code de sortie signifiant qu'un fichier n'existe pas, n'a pas pu être ouvert, ou avait une autre erreur.

source: Exit code that means a user specified output file could not be created.
fr: Code de sortie signifiant qu'un fichier spécifié par l'utilisateur n'a pas pu être créé.

source: Exit code that means that an error occurred while doing I/O on some file.
fr: Code de sortie signifiant qu'une erreur est apparue pendant une E/S sur un fichier.

source: Exit code that means a temporary failure occurred. This indicates something that may not really be an error, such as a network connection that couldn't be made during a retryable operation.
fr: Code de sortie signifiant qu'un échec temporaire est apparu. Cela indique quelque chose qui pourrait ne pas être une erreur, comme une connexion au réseau qui n'a pas pu être établie pendant une opération réessayable.

source: Exit code that means that a protocol exchange was illegal, invalid, or not understood.
fr: Code de sortie signifiant qu'un protocole d'échange est illégal, invalide, ou non-compris.

source: Exit code that means that there were insufficient permissions to perform the operation (but not intended for file system problems).
fr: Code de sortie signifiant qu'il manque certaines permissions pour réaliser une opération (mais n'est pas destiné au problèmes de système de fichiers).

source: Exit code that means that some kind of configuration error occurred.
fr: Code de sortie signifiant qu'une erreur de configuration est apparue.

source: Exit code that means something like "an entry was not found".
fr: Code de sortie signifiant quelque chose comme "une entrée n'a pas été trouvée".

source: Fork a child process. Return ``0`` in the child and the child's process id in the parent. If an error occurs :exc:`OSError` is raised.
fr: *Fork* un processus fils. Renvoie ``0`` dans le processus fils et le PID du processus fils dans le processus père. Si une erreur apparaît, une :exc:`OSError` est levée.

source: See :mod:`ssl` for applications that use the SSL module with fork().
fr: Voit :mod:`ssl` pour les application qui utilisent le module SSL avec *fork()*.

source: Fork a child process, using a new pseudo-terminal as the child's controlling terminal. Return a pair of ``(pid, fd)``, where *pid* is ``0`` in the child, the new child's process id in the parent, and *fd* is the file descriptor of the master end of the pseudo-terminal. For a more portable approach, use the :mod:`pty` module. If an error occurs :exc:`OSError` is raised.
fr: *Fork* un processus fils, en utilisant un nouveau pseudo-terminal comme terminal contrôlant le fils. Renvoie une paire ``(pid, fd)`` où *pid* vaut ``0`` dans le fils et le PID du processus fils dans le parent, et *fd* est le descripteur de fichier de la partie maître du pseudo-terminal. Pour une approche plus portable, utilisez le module :mod:`pty`. Si une erreur apparaît, une :exc:`OSError` est levée.

source: Send signal *sig* to the process *pid*. Constants for the specific signals available on the host platform are defined in the :mod:`signal` module.
fr: Envoie le signal *sig* au processus *pid*. Les constantes pour les signaux spécifiques à la plate-forme hôte sont définies dans le module :mod:`signal`.

source: Windows: The :data:`signal.CTRL_C_EVENT` and :data:`signal.CTRL_BREAK_EVENT` signals are special signals which can only be sent to console processes which share a common console window, e.g., some subprocesses. Any other value for *sig* will cause the process to be unconditionally killed by the TerminateProcess API, and the exit code will be set to *sig*. The Windows version of :func:`kill` additionally takes process handles to be killed.
fr: Windows : les signaux :data:`signal.CTRL_C_EVENT` et :data:`signal.CTRL_BREAK_EVENT` sont des signaux spéciaux qui ne peuvent être envoyés qu'aux processus consoles qui partagent une console commune (par exemple, certains sous-processus). Toute autre valeur pour *sig* amènera le processus a être tué sans condition par l'API TerminateProcess, et le code de retour sera mis à *sig*. La version Windows de :func:`kill` prend en plus les identificateurs de processus à tuer.

source: See also :func:`signal.pthread_kill`.
fr: Voir également :func:`signal.pthread_kill`.

source: Windows support.
fr: Prise en charge de Windows.

source: Send the signal *sig* to the process group *pgid*.
fr: Envoie le signal *sig* au groupe de processus *pgid*.

source: Add *increment* to the process's "niceness". Return the new niceness.
fr: Ajoute *increment* à la priorité du processus. Renvoie la nouvelle priorité.

source: Lock program segments into memory. The value of *op* (defined in ``<sys/lock.h>``) determines which segments are locked.
fr: Verrouille les segments du programme en mémoire. La valeur de *op* (définie dans ``<sys/lock.h>``) détermine quels segments sont verrouillés.

source: Open a pipe to or from command *cmd*. The return value is an open file object connected to the pipe, which can be read or written depending on whether *mode* is ``'r'`` (default) or ``'w'``. The *buffering* argument has the same meaning as the corresponding argument to the built-in :func:`open` function. The returned file object reads or writes text strings rather than bytes.
fr: Ouvre un tuyau vers ou depuis la commande *cmd*. La valeur de retour est un fichier objet ouvert relié au tuyau qui peut être lu ou écrit selon la valeur de *mode* qui est ``'r'`` (par défaut) ou ``'w'``. L'argument *buffering* a le même sens que l'argument correspondant de la fonction :func:`open`. L'objet fichier renvoyé écrit (ou lit) des chaînes de caractères et non de bytes.

source: The ``close`` method returns :const:`None` if the subprocess exited successfully, or the subprocess's return code if there was an error. On POSIX systems, if the return code is positive it represents the return value of the process left-shifted by one byte. If the return code is negative, the process was terminated by the signal given by the negated value of the return code. (For example, the return value might be ``- signal.SIGKILL`` if the subprocess was killed.) On Windows systems, the return value contains the signed integer return code from the child process.
fr: La méthode ``close`` renvoie :const:`None` si le sous-processus s'est terminé avec succès, ou le code de retour du sous-processus s'il y a eu une erreur. Sur les systèmes POSIX, si le code de retour est positif, il représente la valeur de retour du processus décalée d'un byte sur la gauche. Si le code de retour est négatif, le processus le processus s'est terminé avec le signal donné par la négation de la valeur de retour. (Par exemple, la valeur de retour pourrait être ``-signal.SIGKILL`` si le sous-processus a été tué). Sur les systèmes Windows, la valeur de retour contient le code de retour du processus fils dans un entier signé .

source: This is implemented using :class:`subprocess.Popen`; see that class's documentation for more powerful ways to manage and communicate with subprocesses.
fr: Ceci est implémenté en utilisant :class:`subprocess.Popen`. Lisez la documentation de cette classe pour des méthodes plus puissantes pour gérer et communiquer avec des sous-processus.

source: Register callables to be executed when a new child process is forked using :func:`os.fork` or similar process cloning APIs. The parameters are optional and keyword-only. Each specifies a different call point.
fr: Enregistre des appelables (*callables*) à exécuter quand un nouveau processus enfant est crée avec :func:`os.fork` ou des APIs similaires de clonage de processus. Les paramètres sont optionnels et par mots-clé uniquement. Chacun spécifie un point d'appel différent.

source: *before* is a function called before forking a child process.
fr: *before* est une fonction appelée avant de *forker* un processus enfant.
