Repository: python/python-docs-fr
Catalog: library/pathlib.po
Languages: fr

source: :mod:`pathlib` --- Object-oriented filesystem paths
fr: :mod:`pathlib` — Chemins de système de fichiers orientés objet

source: **Source code:** :source:`Lib/pathlib.py`
fr: **Code source :** :source:`Lib/pathlib.py`

source: This module offers classes representing filesystem paths with semantics appropriate for different operating systems. Path classes are divided between :ref:`pure paths <pure-paths>`, which provide purely computational operations without I/O, and :ref:`concrete paths <concrete-paths>`, which inherit from pure paths but also provide I/O operations.
fr: Ce module offre des classes représentant le système de fichiers avec la sémantique appropriée pour différents systèmes d'exploitation. Les classes de chemins sont divisées en :ref:`chemins purs <pure-paths>`, qui fournissent uniquement des opérations de manipulation sans entrées-sorties, et :ref:`chemins concrets <concrete-paths>`, qui héritent des chemins purs et fournissent également les opérations d'entrées-sorties.

source: If you've never used this module before or just aren't sure which class is right for your task, :class:`Path` is most likely what you need. It instantiates a :ref:`concrete path <concrete-paths>` for the platform the code is running on.
fr: Si vous n'avez jamais utilisé ce module précédemment, ou si vous n'êtes pas sûr de quelle classe est faite pour votre tâche, :class:`Path` est très certainement ce dont vous avez besoin. Elle instancie un :ref:`chemin concret <concrete-paths>` pour la plateforme sur laquelle s'exécute le code.

source: Pure paths are useful in some special cases; for example:
fr: Les chemins purs sont utiles dans certains cas particuliers ; par exemple :

source: If you want to manipulate Windows paths on a Unix machine (or vice versa). You cannot instantiate a :class:`WindowsPath` when running on Unix, but you can instantiate :class:`PureWindowsPath`.
fr: Si vous voulez manipuler des chemins Windows sur une machine Unix (ou vice versa). Vous ne pouvez pas instancier un :class:`WindowsPath` quand vous êtes sous Unix, mais vous pouvez instancier :class:`PureWindowsPath`.

source: You want to make sure that your code only manipulates paths without actually accessing the OS. In this case, instantiating one of the pure classes may be useful since those simply don't have any OS-accessing operations.
fr: Vous voulez être sûr que votre code manipule des chemins sans réellement accéder au système d'exploitation. Dans ce cas, instancier une de ces classes pures peut être utile puisqu'elle ne possède tout simplement aucune opération permettant d'accéder au système d'exploitation.

source: :pep:`428`: The pathlib module -- object-oriented filesystem paths.
fr: :pep:`428` : le module *pathlib* – implémentation orientée-objet des chemins de systèmes de fichiers.

source: For low-level path manipulation on strings, you can also use the :mod:`os.path` module.
fr: Pour de la manipulation de chemins bas-niveau avec des chaînes de caractères, vous pouvez aussi utiliser le module :mod:`os.path`.

source: Basic use
fr: Utilisation basique

source: Importing the main class::
fr: Importer la classe principale ::

source: Listing subdirectories::
fr: Lister les sous-dossiers ::

source: Listing Python source files in this directory tree::
fr: Lister les fichiers source Python dans cette arborescence de dossiers ::

source: Navigating inside a directory tree::
fr: Naviguer à l'intérieur d'une arborescence de dossiers ::

source: Querying path properties::
fr: Récupérer les propriétés de chemin ::

source: Opening a file::
fr: Ouvrir un fichier ::

source: Pure paths
fr: Chemins purs

source: Pure path objects provide path-handling operations which don't actually access a filesystem. There are three ways to access these classes, which we also call *flavours*:
fr: Les objets chemins purs fournissent les opérations de gestion de chemin qui n'accèdent pas réellement au système de fichiers. Il y a trois façons d'accéder à ces classes que nous appelons aussi *familles* :

source: A generic class that represents the system's path flavour (instantiating it creates either a :class:`PurePosixPath` or a :class:`PureWindowsPath`)::
fr: Une classe générique qui représente la famille de chemin du système (l'instancier crée soit un :class:`PurePosixPath` soit un :class:`PureWindowsPath`) ::

source: Each element of *pathsegments* can be either a string representing a path segment, an object implementing the :class:`os.PathLike` interface which returns a string, or another path object::
fr: Chaque élément de *pathsegments* peut soit être une chaîne de caractères représentant un segment de chemin, un objet implémentant l'interface :class:`os.PathLike` qui renvoie une chaîne de caractères, soit un autre objet chemin ::

source: When *pathsegments* is empty, the current directory is assumed::
fr: Quand *pathsegments* est vide, le dossier courant est utilisé ::

source: If a segment is an absolute path, all previous segments are ignored (like :func:`os.path.join`)::
fr: Si un segment est un chemin absolu, tous les segments précédents sont ignorés (comme :func:`os.path.join`) ::

source: On Windows, the drive is not reset when a rooted relative path segment (e.g., ``r'\foo'``) is encountered::
fr: Sous Windows, le nom de lecteur est conservé quand un chemin relatif à la racine (par exemple ``r'\foo'``) est rencontré ::

source: Spurious slashes and single dots are collapsed, but double dots (``'..'``) and leading double slashes (``'//'``) are not, since this would change the meaning of a path for various reasons (e.g. symbolic links, UNC paths)::
fr: Les points et slashs superflus sont supprimés, mais les doubles points (``'..'``) et les double slashes (``'//'``) en début de segment ne le sont pas, puisque cela changerait la signification du chemin pour différentes raisons (par exemple pour des liens symboliques ou des chemins UNC) ::

source: (a naïve approach would make ``PurePosixPath('foo/../bar')`` equivalent to ``PurePosixPath('bar')``, which is wrong if ``foo`` is a symbolic link to another directory)
fr: (une analyse naïve considérerait ``PurePosixPath('foo/../bar')`` équivalent à ``PurePosixPath('bar')``, ce qui est faux si ``foo`` est un lien symbolique vers un autre dossier)

source: Pure path objects implement the :class:`os.PathLike` interface, allowing them to be used anywhere the interface is accepted.
fr: Les objets chemins purs implémentent l'interface :class:`os.PathLike`, leur permettant d'être utilisés n'importe où l'interface est acceptée.

source: Added support for the :class:`os.PathLike` interface.
fr: Ajout de la gestion de l'interface :class:`os.PathLike`.

source: A subclass of :class:`PurePath`, this path flavour represents non-Windows filesystem paths::
fr: Une sous-classe de :class:`PurePath`, cette famille de chemin représente les chemins de systèmes de fichiers en dehors des chemins Windows ::

source: *pathsegments* is specified similarly to :class:`PurePath`.
fr: *pathsegments* est spécifié de manière similaire à :class:`PurePath`.

source: A subclass of :class:`PurePath`, this path flavour represents Windows filesystem paths, including `UNC paths`_::
fr: Sous-classe de :class:`PurePath`, cette famille de chemin représente les chemins de systèmes de fichiers Windows, y compris les chemins UNC (voir `UNC paths`_) ::

source: Regardless of the system you're running on, you can instantiate all of these classes, since they don't provide any operation that does system calls.
fr: Sans tenir compte du système sur lequel vous êtes, vous pouvez instancier toutes ces classes, puisqu'elles ne fournissent aucune opération qui appelle le système d'exploitation.

source: General properties
fr: Propriétés générales

source: Paths of a different flavour compare unequal and cannot be ordered::
fr: Les chemins de différentes familles ne sont pas égaux et ne peuvent être ordonnés ::

source: Operators
fr: Opérateurs

source: The slash operator helps create child paths, like :func:`os.path.join`. If the argument is an absolute path, the previous path is ignored. On Windows, the drive is not reset when the argument is a rooted relative path (e.g., ``r'\foo'``)::
fr: L'opérateur slash aide à créer les chemins enfants, de manière similaire à :func:`os.path.join`. Si l'argument est un chemin absolu, le chemin précédent est ignoré. Sous Windows, le lecteur n'est pas effacé quand l'argument est un chemin relatif enraciné (par exemple ``r'\foo'``)::

source: A path object can be used anywhere an object implementing :class:`os.PathLike` is accepted::
fr: Un objet chemin peut être utilisé n'importe où un objet implémentant :class:`os.PathLike` est accepté ::

source: The string representation of a path is the raw filesystem path itself (in native form, e.g. with backslashes under Windows), which you can pass to any function taking a file path as a string::
fr: La représentation d'un chemin en chaîne de caractères est celle du chemin brut du système de fichiers lui-même (dans sa forme native, c.-à-d. avec des antislashs sous Windows), telle que vous pouvez la passer à n'importe quelle fonction prenant un chemin en tant que chaîne de caractères ::

source: Similarly, calling :class:`bytes` on a path gives the raw filesystem path as a bytes object, as encoded by :func:`os.fsencode`::
fr: De manière similaire, appeler :class:`bytes` sur un chemin donne le chemin brut du système de fichiers en tant que bytes, tel qu'encodé par :func:`os.fsencode` ::

source: Calling :class:`bytes` is only recommended under Unix. Under Windows, the unicode form is the canonical representation of filesystem paths.
fr: Appeler :class:`bytes` est seulement recommandé sous Unix. Sous Windows, la forme Unicode est la représentation canonique des chemins du système de fichiers.

source: Accessing individual parts
fr: Accéder aux parties individuelles

source: To access the individual "parts" (components) of a path, use the following property:
fr: Pour accéder aux parties individuelles (composantes) d'un chemin, utilisez les propriétés suivantes :

source: A tuple giving access to the path's various components::
fr: Un tuple donnant accès aux différentes composantes du chemin ::

source: (note how the drive and local root are regrouped in a single part)
fr: (notez comme le lecteur et la racine locale sont regroupés en une seule partie)

source: Methods and properties
fr: Méthodes et propriétés

source: Pure paths provide the following methods and properties:
fr: Les chemins purs fournissent les méthodes et propriétés suivantes :

source: A string representing the drive letter or name, if any::
fr: Une chaîne représentant la lettre du lecteur ou le nom, s'il y en a un ::

source: UNC shares are also considered drives::
fr: Les partages UNC sont aussi considérés comme des lecteurs ::

source: A string representing the (local or global) root, if any::
fr: Une chaîne de caractères représentant la racine (locale ou globale), s'il y en a une ::

source: UNC shares always have a root::
fr: Les partages UNC ont toujours une racine ::

source: If the path starts with more than two successive slashes, :class:`~pathlib.PurePosixPath` collapses them::
fr: Si le chemin commence par plus de deux slashes successifs, :class:`~pathlib.PurePosixPath` n'en conserve qu'un ::

source: This behavior conforms to *The Open Group Base Specifications Issue 6*, paragraph `4.11 Pathname Resolution <https://pubs.opengroup.org/onlinepubs/009695399/basedefs/xbd_chap04.html#tag_04_11>`_:
fr: Ce comportement se conforme au paragraphe 4.11 `Pathname Resolution <https://pubs.opengroup.org/onlinepubs/009695399/basedefs/xbd_chap04.html#tag_04_11>`_ des *Open Group Base Specifications* version 6 :

source: The concatenation of the drive and root::
fr: La concaténation du lecteur et de la racine ::

source: An immutable sequence providing access to the logical ancestors of the path::
fr: Une séquence immuable fournissant accès aux ancêtres logiques du chemin ::

source: The parents sequence now supports :term:`slices <slice>` and negative index values.
fr: La séquence de *parents* prend désormais en charge les :term:`tranches <slice>` et les valeurs d’index négatives.

source: The logical parent of the path::
fr: Le parent logique du chemin ::

source: You cannot go past an anchor, or empty path::
fr: Vous ne pouvez pas aller au-delà d'une ancre, ou d'un chemin vide ::

source: This is a purely lexical operation, hence the following behaviour::
fr: C'est une opération purement lexicale, d'où le comportement suivant ::

source: If you want to walk an arbitrary filesystem path upwards, it is recommended to first call :meth:`Path.resolve` so as to resolve symlinks and eliminate `".."` components.
fr: Si vous voulez parcourir un chemin arbitraire du système de fichiers, il est recommandé de d'abord appeler :meth:`Path.resolve` de manière à résoudre les liens symboliques et éliminer les composantes ``".."``.

source: A string representing the final path component, excluding the drive and root, if any::
fr: Une chaîne représentant la composante finale du chemin, en excluant le lecteur et la racine, si présent ::

source: UNC drive names are not considered::
fr: Les noms de lecteur UNC ne sont pas pris en compte ::

source: The file extension of the final component, if any::
fr: L'extension du fichier de la composante finale, si présente ::

source: A list of the path's file extensions::
fr: Une liste des extensions du chemin de fichier ::

source: The final path component, without its suffix::
fr: La composante finale du chemin, sans son suffixe ::

source: Return a string representation of the path with forward slashes (``/``)::
fr: Renvoie une représentation en chaîne de caractères du chemin avec des slashs (``/``) ::

source: Represent the path as a ``file`` URI. :exc:`ValueError` is raised if the path isn't absolute.
fr: Représente le chemin en tant qu'URI de fichier. :exc:`ValueError` est levée si le chemin n'est pas absolu.

source: Return whether the path is absolute or not. A path is considered absolute if it has both a root and (if the flavour allows) a drive::
fr: Renvoie si le chemin est absolu ou non. Un chemin est considéré absolu s'il a une racine et un lecteur (si la famille le permet) ::

source: Return whether or not this path is relative to the *other* path.
fr: Renvoie si ce chemin est relatif ou non au chemin *other*.

source: With :class:`PureWindowsPath`, return ``True`` if the path is considered reserved under Windows, ``False`` otherwise. With :class:`PurePosixPath`, ``False`` is always returned.
fr: Avec :class:`PureWindowsPath`, renvoie ``True`` si le chemin est considéré réservé sous Windows, ``False`` sinon. Avec :class:`PurePosixPath`, ``False`` est systématiquement renvoyé.

source: File system calls on reserved paths can fail mysteriously or have unintended effects.
fr: Les appels au système de fichier sur des chemins réservés peuvent échouer mystérieusement ou avoir des effets inattendus.

source: Calling this method is equivalent to combining the path with each of the *other* arguments in turn::
fr: Appeler cette méthode équivaut à combiner le chemin avec chacun des arguments *other* ::

source: Match this path against the provided glob-style pattern. Return ``True`` if matching is successful, ``False`` otherwise.
fr: Fait correspondre ce chemin avec le motif (*glob pattern*) fourni. Renvoie ``True`` si la correspondance a réussi, ``False`` sinon.

source: If *pattern* is relative, the path can be either relative or absolute, and matching is done from the right::
fr: Si *pattern* est relatif, le chemin peut être soit relatif, soit absolu, et la correspondance est faite à partir de la droite ::

source: If *pattern* is absolute, the path must be absolute, and the whole path must match::
fr: Si *pattern* est absolu, le chemin doit être absolu, et la correspondance doit être totale avec le chemin ::

source: As with other methods, case-sensitivity follows platform defaults::
fr: Comme pour les autres méthodes, la sensibilité à la casse est la sensibilité par défaut de la plate-forme ::

source: Compute a version of this path relative to the path represented by *other*. If it's impossible, ValueError is raised::
fr: Calcule une version du chemin en relatif au chemin représenté par *other*. Si c'est impossible, ValueError est levée ::

source: NOTE: This function is part of :class:`PurePath` and works with strings. It does not check or access the underlying file structure.
fr: NOTE : cette fonction fait partie de :class:`PurePath` et fonctionne avec des chaînes de caractères. Elle n'accède donc pas au système de fichiers sous-jacente, et ne vérifie donc pas son résultat.

source: Return a new path with the :attr:`name` changed. If the original path doesn't have a name, ValueError is raised::
fr: Renvoie un nouveau chemin avec :attr:`name` changé. Si le chemin original n'a pas de nom, ValueError est levée ::

source: Return a new path with the :attr:`stem` changed. If the original path doesn't have a name, ValueError is raised::
fr: Renvoie un nouveau chemin avec :attr:`stem` changé. Si le chemin original n'a pas de nom, *ValueError* est levée ::

source: Return a new path with the :attr:`suffix` changed. If the original path doesn't have a suffix, the new *suffix* is appended instead. If the *suffix* is an empty string, the original suffix is removed::
fr: Renvoie un nouveau chemin avec :attr:`suffix` changé. Si le chemin original n'a pas de suffixe, le nouveau *suffix* est alors ajouté. Si *suffix* est une chaîne vide, le suffixe d'origine est retiré ::

source: Concrete paths
fr: Chemins concrets

source: Concrete paths are subclasses of the pure path classes. In addition to operations provided by the latter, they also provide methods to do system calls on path objects. There are three ways to instantiate concrete paths:
fr: Les chemins concrets sont des sous-classes des chemins purs. En plus des opérations fournies par ces derniers, ils fournissent aussi des méthodes pour faire appel au système sur des objets chemin. Il y a trois façons d'instancier des chemins concrets :

source: A subclass of :class:`PurePath`, this class represents concrete paths of the system's path flavour (instantiating it creates either a :class:`PosixPath` or a :class:`WindowsPath`)::
fr: Une sous-classe de :class:`PurePath`, cette classe représente les chemins concrets d'une famille de chemins de système de fichiers (l'instancier créé soit un :class:`PosixPath`, soit un :class:`WindowsPath`) ::

source: A subclass of :class:`Path` and :class:`PurePosixPath`, this class represents concrete non-Windows filesystem paths::
fr: Une sous-classe de :class:`Path` et :class:`PurePosixPath`, cette classe représente les chemins concrets de systèmes de fichiers non Windows ::

source: A subclass of :class:`Path` and :class:`PureWindowsPath`, this class represents concrete Windows filesystem paths::
fr: Une sous-classe de :class:`Path` et :class:`PureWindowsPath`, cette classe représente les chemins concrets de systèmes de fichiers Windows ::

source: You can only instantiate the class flavour that corresponds to your system (allowing system calls on non-compatible path flavours could lead to bugs or failures in your application)::
fr: Vous pouvez seulement instancier la classe de la famille qui correspond à votre système (permettre des appels au système pour des familles de chemins non compatibles pourrait mener à des bogues ou à des pannes de votre application) ::

source: Methods
fr: Méthodes

source: Concrete paths provide the following methods in addition to pure paths methods. Many of these methods can raise an :exc:`OSError` if a system call fails (for example because the path doesn't exist).
fr: Les chemins concrets fournissent les méthodes suivantes en plus des méthodes des chemins purs. Beaucoup de ces méthodes peuvent lever :exc:`OSError` si un appel au système échoue (par exemple car le chemin n'existe pas).

source: :meth:`~Path.exists()`, :meth:`~Path.is_dir()`, :meth:`~Path.is_file()`, :meth:`~Path.is_mount()`, :meth:`~Path.is_symlink()`, :meth:`~Path.is_block_device()`, :meth:`~Path.is_char_device()`, :meth:`~Path.is_fifo()`, :meth:`~Path.is_socket()` now return ``False`` instead of raising an exception for paths that contain characters unrepresentable at the OS level.
fr: :meth:`~Path.exists()`, :meth:`~Path.is_dir()`, :meth:`~Path.is_file()`, :meth:`~Path.is_mount()`, :meth:`~Path.is_symlink()`, :meth:`~Path.is_block_device()`, :meth:`~Path.is_char_device()`, :meth:`~Path.is_fifo()` et :meth:`~Path.is_socket()` renvoient maintenant ``False`` au lieu de lever une exception pour les chemins qui contiennent des caractères non représentables au niveau du système d'exploitation.

source: Return a new path object representing the current directory (as returned by :func:`os.getcwd`)::
fr: Renvoie un nouveau chemin représentant le dossier courant (comme renvoyé par :func:`os.getcwd`) ::

source: Return a new path object representing the user's home directory (as returned by :func:`os.path.expanduser` with ``~`` construct). If the home directory can't be resolved, :exc:`RuntimeError` is raised.
fr: Renvoie un nouveau chemin représentant le dossier d’accueil de l'utilisateur (comme renvoyé par :func:`os.path.expanduser` avec la construction ``~`` ). Si le dossier d’accueil de l'utilisateur ne peut être résolu, :exc:`RuntimeError` est levée.

source: Return a :class:`os.stat_result` object containing information about this path, like :func:`os.stat`. The result is looked up at each call to this method.
fr: Renvoie un objet :class:`os.stat_result` contenant des informations sur ce chemin, comme :func:`os.stat`. Le résultat est récupéré à chaque appel à cette méthode.

source: This method normally follows symlinks; to stat a symlink add the argument ``follow_symlinks=False``, or use :meth:`~Path.lstat`.
fr: Cette méthode suit normalement les liens symboliques ; pour appeler ``stat`` sur un lien symbolique lui-même, ajoutez l’argument ``follow_symlinks=False``, ou utilisez :meth:`~Path.lstat`.

source: The *follow_symlinks* parameter was added.
fr: ajout du paramètre *follow_symlinks*.

source: Change the file mode and permissions, like :func:`os.chmod`.
fr: Change le mode et les permissions du fichier, comme :func:`os.chmod`.

source: This method normally follows symlinks. Some Unix flavours support changing permissions on the symlink itself; on these platforms you may add the argument ``follow_symlinks=False``, or use :meth:`~Path.lchmod`.
fr: Cette méthode suit normalement les liens symboliques. Certaines versions d’Unix prennent en charge la modification des permissions sur le lien symbolique lui-même ; sur ces plateformes, vous pouvez ajouter l’argument ``follow_symlinks=False``, ou utiliser :meth:`~Path.lchmod`.

source: Whether the path points to an existing file or directory::
fr: Si le chemin pointe sur un fichier ou dossier existant ::

source: If the path points to a symlink, :meth:`exists` returns whether the symlink *points to* an existing file or directory.
fr: Si le chemin pointe sur un lien symbolique, :meth:`exists` renvoie si le lien symbolique *pointe vers* un fichier ou un dossier existant.

source: Return a new path with expanded ``~`` and ``~user`` constructs, as returned by :meth:`os.path.expanduser`. If a home directory can't be resolved, :exc:`RuntimeError` is raised.
fr: Renvoie un nouveau chemin avec les résolutions des constructions ``~`` et ``~user``, comme renvoyé par :meth:`os.path.expanduser`. Si le dossier d’accueil de l'utilisateur ne peut être résolu, :exc:`RuntimeError` est levée.
