Repository: python/python-docs-fr
Catalog: library/pathlib.po
Languages: fr

source: Glob the given relative *pattern* in the directory represented by this path, yielding all matching files (of any kind)::
fr: *Glob* de manière relative suivant le motif *pattern* fourni dans le dossier représenté par ce chemin, donnant tous les fichiers correspondants (de n'importe quelle sorte) ::

source: Patterns are the same as for :mod:`fnmatch`, with the addition of "``**``" which means "this directory and all subdirectories, recursively". In other words, it enables recursive globbing::
fr: Le motif est pareil que pour :mod:`fnmatch`, avec l'ajout de ``"**"``, qui signifie « ce dossier et ses sous-dossiers, récursivement ». En d'autres termes, il permet d’effectuer un *globbing* récursif ::

source: Using the "``**``" pattern in large directory trees may consume an inordinate amount of time.
fr: Utiliser le motif "``**``" dans de grandes arborescences de dossier peut consommer une quantité de temps démesurée.

source: Raises an :ref:`auditing event <auditing>` ``pathlib.Path.glob`` with arguments ``self``, ``pattern``.
fr: Lève un :ref:`évènement d’audit <auditing>` ``pathlib.Path.glob`` avec comme arguments ``self`` et ``pattern``.

source: Return the name of the group owning the file. :exc:`KeyError` is raised if the file's gid isn't found in the system database.
fr: Renvoie le nom du groupe propriétaire du fichier. :exc:`KeyError` est levée si le *gid* du fichier n'est pas trouvé dans la base de données du système.

source: Return ``True`` if the path points to a directory (or a symbolic link pointing to a directory), ``False`` if it points to another kind of file.
fr: Renvoie ``True`` si le chemin pointe vers un dossier (ou un lien symbolique pointant vers un dossier), ``False`` s'il pointe vers une autre sorte de fichier.

source: ``False`` is also returned if the path doesn't exist or is a broken symlink; other errors (such as permission errors) are propagated.
fr: ``False`` est aussi renvoyé si le chemin n'existe pas ou est un lien symbolique cassé. D’autres erreurs (telles que les erreurs de permission) sont propagées.

source: Return ``True`` if the path points to a regular file (or a symbolic link pointing to a regular file), ``False`` if it points to another kind of file.
fr: Renvoie ``True`` si le chemin pointe vers un fichier normal (ou un lien symbolique pointe vers un fichier normal), ``False`` s'il pointe vers une autre sorte de fichier.

source: Return ``True`` if the path is a :dfn:`mount point`: a point in a file system where a different file system has been mounted. On POSIX, the function checks whether *path*'s parent, :file:`path/..`, is on a different device than *path*, or whether :file:`path/..` and *path* point to the same i-node on the same device --- this should detect mount points for all Unix and POSIX variants. Not implemented on Windows.
fr: Renvoie ``True`` si le chemin pointe vers un :dfn:`point de montage` : un point dans le système de fichiers où un système de fichiers différent a été monté. Sous POSIX, la fonction vérifie si le parent de *path*, :file:`path/..`, se trouve sur un autre périphérique que *path*, ou si :file:`path/..` et *path* pointe sur le même *i-node* sur le même périphérique — ceci devrait détecter tous les points de montage pour toutes les variantes Unix et POSIX. Non implémenté sous Windows.

source: Return ``True`` if the path points to a symbolic link, ``False`` otherwise.
fr: Renvoie ``True`` si le chemin pointe sur un lien symbolique, ``False`` sinon.

source: ``False`` is also returned if the path doesn't exist; other errors (such as permission errors) are propagated.
fr: ``False`` est aussi renvoyé si le chemin n'existe pas ; d'autres erreurs (telles que les erreurs de permission) sont propagées.

source: Return ``True`` if the path points to a Unix socket (or a symbolic link pointing to a Unix socket), ``False`` if it points to another kind of file.
fr: Renvoie ``True`` si le chemin pointe vers un connecteur Unix (ou un lien symbolique pointant vers un connecteur Unix), ``False`` s'il pointe vers une autre sorte de fichier.

source: Return ``True`` if the path points to a FIFO (or a symbolic link pointing to a FIFO), ``False`` if it points to another kind of file.
fr: Renvoie ``True`` si le chemin pointe vers une FIFO (ou un lien symbolique pointant vers une FIFO), ``False`` s'il pointe vers une autre sorte de fichier.

source: Return ``True`` if the path points to a block device (or a symbolic link pointing to a block device), ``False`` if it points to another kind of file.
fr: Renvoie ``True`` si le chemin pointe vers un périphérique (ou un lien symbolique pointant vers un périphérique), ``False`` s'il pointe vers une autre sorte de fichier.

source: Return ``True`` if the path points to a character device (or a symbolic link pointing to a character device), ``False`` if it points to another kind of file.
fr: Renvoie ``True`` si le chemin pointe vers un périphérique à caractères (ou un lien symbolique pointant vers un périphérique à caractères), ``False`` s'il pointe vers une autre sorte de fichier.

source: When the path points to a directory, yield path objects of the directory contents::
fr: Quand le chemin pointe vers un dossier, donne par séquences les objets chemin du contenu du dossier ::

source: The children are yielded in arbitrary order, and the special entries ``'.'`` and ``'..'`` are not included. If a file is removed from or added to the directory after creating the iterator, whether a path object for that file be included is unspecified.
fr: Les éléments enfants sont renvoyés dans un ordre arbitraire, et les éléments spéciaux ``'.'`` et ``'..'`` ne sont pas inclus. Si un fichier est supprimé ou ajouté au répertoire après la création de l’itérateur, il se peut qu'un élément soit renvoyé pour ce fichier, ou non ; ce comportement n'est pas déterminé.

source: Like :meth:`Path.chmod` but, if the path points to a symbolic link, the symbolic link's mode is changed rather than its target's.
fr: Comme :meth:`Path.chmod`, mais, si le chemin pointe vers un lien symbolique, le mode du lien symbolique est changé plutôt que celui de sa cible.

source: Like :meth:`Path.stat` but, if the path points to a symbolic link, return the symbolic link's information rather than its target's.
fr: Comme :meth:`Path.stat`, mais, si le chemin pointe vers un lien symbolique, renvoie les informations du lien symbolique plutôt que celui de sa cible.

source: Create a new directory at this given path. If *mode* is given, it is combined with the process' ``umask`` value to determine the file mode and access flags. If the path already exists, :exc:`FileExistsError` is raised.
fr: Créer un nouveau dossier au chemin fourni. Si *mode* est fourni, il est combiné avec la valeur de l'``umask`` du processus pour déterminer le mode de fichier et les droits d'accès. Si le chemin existe déjà, :exc:`FileExistsError` est levée.

source: If *parents* is true, any missing parents of this path are created as needed; they are created with the default permissions without taking *mode* into account (mimicking the POSIX ``mkdir -p`` command).
fr: Si *parents* est vrai, chaque parent de ce chemin est créé si besoin ; ils sont créés avec les permissions par défaut sans prendre en compte *mode* (reproduisant la commande POSIX ``mkdir -p``).

source: If *parents* is false (the default), a missing parent raises :exc:`FileNotFoundError`.
fr: Si *parents* est faux (valeur par défaut), un parent manquant lève :exc:`FileNotFoundError`.

source: If *exist_ok* is false (the default), :exc:`FileExistsError` is raised if the target directory already exists.
fr: Si *exist_ok* est faux (valeur par défaut), :exc:`FileExistsError` est levé si le dossier cible existe déjà.

source: If *exist_ok* is true, :exc:`FileExistsError` exceptions will be ignored (same behavior as the POSIX ``mkdir -p`` command), but only if the last path component is not an existing non-directory file.
fr: If *exist_ok* est vrai, les exceptions :exc:`FileExistsError` seront ignorées (même comportement que la commande POSIX ``mkdir -p``), mais seulement si le dernier segment de chemin existe et n'est pas un dossier.

source: The *exist_ok* parameter was added.
fr: ajout du paramètre *exist_ok*.

source: Open the file pointed to by the path, like the built-in :func:`open` function does::
fr: Ouvre le fichier pointé par le chemin, comme la fonction native :func:`open` le fait ::

source: Return the name of the user owning the file. :exc:`KeyError` is raised if the file's uid isn't found in the system database.
fr: Renvoie le nom de l'utilisateur auquel appartient le fichier. :exc:`KeyError` est levée si l’*uid* de l’utilisateur du fichier n'est pas trouvé dans la base de données du système.

source: Return the binary contents of the pointed-to file as a bytes object::
fr: Renvoie le contenu binaire du fichier pointé en tant que chaîne d’octets ::

source: Return the decoded contents of the pointed-to file as a string::
fr: Renvoie le contenu décodé du fichier pointé en tant que chaîne de caractères ::

source: The file is opened and then closed. The optional parameters have the same meaning as in :func:`open`.
fr: Le fichier est ouvert, puis fermé. Les paramètres optionnels ont la même signification que dans :func:`open`.

source: Return the path to which the symbolic link points (as returned by :func:`os.readlink`)::
fr: Renvoie le chemin vers lequel le lien symbolique pointe (tel que renvoyé par :func:`os.readlink`) ::

source: Rename this file or directory to the given *target*, and return a new Path instance pointing to *target*. On Unix, if *target* exists and is a file, it will be replaced silently if the user has permission. On Windows, if *target* exists, :exc:`FileExistsError` will be raised. *target* can be either a string or another path object::
fr: Renomme ce fichier ou dossier vers la cible *target* fournie et renvoie une nouvelle instance de *Path* pointant sur *target*. Si *target* existe déjà, le comportement dépend du système. Sous Unix, si *target* est un fichier, il est remplacé sans avertissement (à condition que l'utilisateur en ait la permission). En revanche, sous Windows, une erreur :exc:`FileExistsError` est systématiquement levée. *target* peut être soit une chaîne de caractères, soit un autre chemin ::

source: The target path may be absolute or relative. Relative paths are interpreted relative to the current working directory, *not* the directory of the Path object.
fr: La cible peut être un chemin absolu ou relatif. Attention, une cible relative est interprétée par rapport au dossier courant, et pas par rapport au dossier du ``Path`` sur lequel cette méthode est appelée.

source: It is implemented in terms of :func:`os.rename` and gives the same guarantees.
fr: Cette méthode est implémentée d'après :func:`os.rename` et fournit les mêmes garanties.

source: Added return value, return the new Path instance.
fr: ajout de la valeur de retour, renvoie une nouvelle instance *Path*.

source: Rename this file or directory to the given *target*, and return a new Path instance pointing to *target*. If *target* points to an existing file or empty directory, it will be unconditionally replaced.
fr: Renomme ce fichier ou dossier vers la cible *target* fournie et renvoie une nouvelle instance de *Path* pointant vers *target*. Si *target* pointe vers un fichier ou un dossier vide existant, il sera systématiquement remplacé.

source: Make the path absolute, resolving any symlinks. A new path object is returned::
fr: Rend le chemin absolu, résolvant les liens symboliques. Un nouveau chemin est renvoyé ::

source: "``..``" components are also eliminated (this is the only method to do so)::
fr: Les composantes "``..``" sont aussi éliminées (c'est la seule méthode pour le faire) ::

source: If the path doesn't exist and *strict* is ``True``, :exc:`FileNotFoundError` is raised. If *strict* is ``False``, the path is resolved as far as possible and any remainder is appended without checking whether it exists. If an infinite loop is encountered along the resolution path, :exc:`RuntimeError` is raised.
fr: Si le chemin n'existe pas et que *strict* est ``True``, :exc:`FileNotFoundError` est levée. Si *strict* est ``False``, le chemin est résolu aussi loin que possible et le reste potentiel est ajouté à la fin sans vérifier s'il existe. Si une boucle infinie est rencontrée lors de la résolution du chemin, :exc:`RuntimeError` est levée.

source: The *strict* argument (pre-3.6 behavior is strict).
fr: l'argument *strict* (le comportement *pré-3.6* est strict par défaut).

source: This is like calling :func:`Path.glob` with "``**/``" added in front of the given relative *pattern*::
fr: C'est similaire à appeler :func:`Path.glob` avec "``**/``" ajouté au début du motif *pattern* relatif ::

source: Raises an :ref:`auditing event <auditing>` ``pathlib.Path.rglob`` with arguments ``self``, ``pattern``.
fr: Lève un :ref:`évènement d’audit <auditing>` ``pathlib.Path.glob`` avec comme arguments ``self`` et ``pattern``.

source: Remove this directory. The directory must be empty.
fr: Supprime ce dossier. Le dossier doit être vide.

source: Return whether this path points to the same file as *other_path*, which can be either a Path object, or a string. The semantics are similar to :func:`os.path.samefile` and :func:`os.path.samestat`.
fr: Renvoie si ce chemin pointe vers le même fichier que *other_path*, qui peut être soit un chemin, soit une chaîne de caractères. La sémantique est similaire à :func:`os.path.samefile` et :func:`os.path.samestat`.

source: An :exc:`OSError` can be raised if either file cannot be accessed for some reason.
fr: :exc:`OSError` peut être levée si l'un des fichiers ne peut être accédé pour quelque raison.

source: Make this path a symbolic link to *target*. Under Windows, *target_is_directory* must be true (default ``False``) if the link's target is a directory. Under POSIX, *target_is_directory*'s value is ignored.
fr: Fait de ce chemin un lien symbolique vers *target*. Sous Windows, *target_is_directory* doit être vrai (la valeur par défaut étant ``False``) si la cible du lien est un dossier. Sous POSIX, la valeur de *target_is_directory* est ignorée.

source: The order of arguments (link, target) is the reverse of :func:`os.symlink`'s.
fr: L'ordre des arguments (lien, cible) est l'opposé de ceux de :func:`os.symlink`.

source: Make this path a hard link to the same file as *target*.
fr: Crée un lien physique pointant sur le même fichier que *target*.

source: The order of arguments (link, target) is the reverse of :func:`os.link`'s.
fr: L'ordre des arguments (lien, cible) est l'opposé de celui de :func:`os.link`.

source: Make *target* a hard link to this path.
fr: Crée un lien physique pointant sur le même fichier que *target*.

source: This function does not make this path a hard link to *target*, despite the implication of the function and argument names. The argument order (target, link) is the reverse of :func:`Path.symlink_to` and :func:`Path.hardlink_to`, but matches that of :func:`os.link`.
fr: Cette fonction ne fait pas de ce chemin un lien physique vers *target*, malgré ce que le nom de la fonction et des arguments laisse penser. L’ordre des arguments (cible, lien) est l’inverse de :func:`Path.symlink_to` et :func:`Path.hardlink_to`, mais correspond en fait à celui de :func:`os.link`.

source: This method is deprecated in favor of :meth:`Path.hardlink_to`, as the argument order of :meth:`Path.link_to` does not match that of :meth:`Path.symlink_to`.
fr: Cette méthode est rendue obsolète au profit de :meth:`Path.hardlink_to`, car l’ordre des arguments de :meth:`Path.link_to` ne correspond pas à celui de :meth:`Path.symlink_to`.

source: Create a file at this given path. If *mode* is given, it is combined with the process' ``umask`` value to determine the file mode and access flags. If the file already exists, the function succeeds if *exist_ok* is true (and its modification time is updated to the current time), otherwise :exc:`FileExistsError` is raised.
fr: Créer un fichier au chemin donné. Si *mode* est fourni, il est combiné avec la valeur de l'``umask`` du processus pour déterminer le mode du fichier et les drapeaux d'accès. Si le fichier existe déjà, la fonction réussit si *exist_ok* est vrai (et si l'heure de modification est mise à jour avec l'heure courante), sinon :exc:`FileExistsError` est levée.

source: Remove this file or symbolic link. If the path points to a directory, use :func:`Path.rmdir` instead.
fr: Supprime ce fichier ou lien symbolique. Si le chemin pointe vers un dossier, utilisez :func:`Path.rmdir` à la place.

source: If *missing_ok* is false (the default), :exc:`FileNotFoundError` is raised if the path does not exist.
fr: Si *missing_ok* est faux (valeur par défaut), une :exc:`FileNotFoundError` est levée si le chemin n'existe pas.

source: If *missing_ok* is true, :exc:`FileNotFoundError` exceptions will be ignored (same behavior as the POSIX ``rm -f`` command).
fr: Si *missing_ok* est vrai, les exceptions :exc:`FileNotFoundError` sont ignorées (même comportement que la commande POSIX ``rm -f``).

source: The *missing_ok* parameter was added.
fr: Ajout du paramètre *missing_ok*.

source: Open the file pointed to in bytes mode, write *data* to it, and close the file::
fr: Ouvre le fichier pointé en mode binaire, écrit *data* dedans, et ferme le fichier ::

source: An existing file of the same name is overwritten.
fr: Le fichier du même nom, s'il existe, est écrasé.

source: Open the file pointed to in text mode, write *data* to it, and close the file::
fr: Ouvre le fichier pointé en mode texte, écrit *data* dedans, et ferme le fichier ::

source: An existing file of the same name is overwritten. The optional parameters have the same meaning as in :func:`open`.
fr: Le fichier du même nom, s'il existe, est écrasé. Les paramètres optionnels ont la même signification que dans :func:`open`.

source: The *newline* parameter was added.
fr: ajout du paramètre *newline*.

source: Correspondence to tools in the :mod:`os` module
fr: Correspondance des outils du module :mod:`os`

source: Below is a table mapping various :mod:`os` functions to their corresponding :class:`PurePath`/:class:`Path` equivalent.
fr: Ci-dessous se trouve un tableau associant diverses fonctions :mod:`os` à leur équivalent :class:`PurePath` / :class:`Path` correspondant.

source: Not all pairs of functions/methods below are equivalent. Some of them, despite having some overlapping use-cases, have different semantics. They include :func:`os.path.abspath` and :meth:`Path.resolve`, :func:`os.path.relpath` and :meth:`PurePath.relative_to`.
fr: Il n'y a pas toujours équivalence complète entre les deux fonctions dans les lignes du tableau ci-dessous. Il arrive que des différences de comportement existent malgré les fonctionnalités similaires. C'est notamment le cas de :func:`os.path.abspath` et :meth:`Path.resolve`, ainsi que :func:`os.path.relpath` et :meth:`PurePath.relative_to`.

source: :mod:`os` and :mod:`os.path`
fr: :mod:`os` et :mod:`os.path`

source: :meth:`Path.expanduser` and :meth:`Path.home`
fr: :meth:`Path.expanduser` et :meth:`Path.home`

source: :attr:`PurePath.stem` and :attr:`PurePath.suffix`
fr: :attr:`PurePath.stem` et :attr:`PurePath.suffix`

source: Footnotes
fr: Notes

source: :func:`os.path.abspath` does not resolve symbolic links while :meth:`Path.resolve` does.
fr: :func:`os.path.abspath` ne résout pas les liens symboliques alors que :meth:`Path.resolve` le fait.
