Repository: python/python-docs-fr
Catalog: library/pdb.po
Languages: fr

source: :mod:`pdb` --- The Python Debugger
fr: :mod:`pdb` — Le débogueur Python

source: **Source code:** :source:`Lib/pdb.py`
fr: **Code source :** :source:`Lib/pdb.py`

source: The module :mod:`pdb` defines an interactive source code debugger for Python programs. It supports setting (conditional) breakpoints and single stepping at the source line level, inspection of stack frames, source code listing, and evaluation of arbitrary Python code in the context of any stack frame. It also supports post-mortem debugging and can be called under program control.
fr: Le module :mod:`pdb` définit un débogueur de code source interactif pour les programmes Python. Il supporte le paramétrage (conditionnel) de points d'arrêt et l'exécution du code source ligne par ligne, l'inspection des *frames* de la pile, la liste du code source, et l'évaluation arbitraire de code Python dans le contexte de n'importe quelle *frame* de la pile. Il supporte aussi le débogage post-mortem et peut être contrôlé depuis un programme.

source: The debugger is extensible -- it is actually defined as the class :class:`Pdb`. This is currently undocumented but easily understood by reading the source. The extension interface uses the modules :mod:`bdb` and :mod:`cmd`.
fr: Le débogueur est extensible -- Il est en réalité défini comme la classe :class:`Pdb`. C'est actuellement non-documenté mais facilement compréhensible en lisant le code source. L'interface d'extension utilise les modules :mod:`bdb` et :mod:`cmd`.

source: The debugger's prompt is ``(Pdb)``. Typical usage to run a program under control of the debugger is::
fr: L'invite du débogueur est ``(Pdb)``. L'usage typique pour exécuter un programme sous le contrôle du débogueur est ::

source: Tab-completion via the :mod:`readline` module is available for commands and command arguments, e.g. the current global and local names are offered as arguments of the ``p`` command.
fr: La complétion via le module :mod:`readline' est disponible pour les commandes et les arguments de commande, par exemple les noms *global* et *local* sont proposés comme arguments de la commande ``p``.

source: :file:`pdb.py` can also be invoked as a script to debug other scripts. For example::
fr: Le fichier :file:`pdb.py` peut aussi être invoqué comme un script pour déboguer d'autres scripts. Par exemple ::

source: When invoked as a script, pdb will automatically enter post-mortem debugging if the program being debugged exits abnormally. After post-mortem debugging (or after normal exit of the program), pdb will restart the program. Automatic restarting preserves pdb's state (such as breakpoints) and in most cases is more useful than quitting the debugger upon program's exit.
fr: Si le programme débogué se termine anormalement, *pdb* entrera en débogage post-mortem. Après le débogage post-mortem (ou après une sortie normale du programme), *pdb* redémarrera le programme. Le redémarrage automatique préserve l'état de *pdb* (tels que les points d'arrêt) et dans la plupart des cas est plus utile que de quitter le débogueur à la sortie du programme.

source: :file:`pdb.py` now accepts a ``-c`` option that executes commands as if given in a :file:`.pdbrc` file, see :ref:`debugger-commands`.
fr: Le fichier :file:`pdb.py` accepte maintenant une option ``-c`` qui exécute les commandes comme si elles provenaient d'un fichier :file:`.pdbrc`, voir :ref:`debugger-commands`.

source: :file:`pdb.py` now accepts a ``-m`` option that execute modules similar to the way ``python3 -m`` does. As with a script, the debugger will pause execution just before the first line of the module.
fr: :file:`pdb.py` accepte maintenant une option ``-m`` qui déclenche l’exécution de modules de la même façon que ``python3 -m``. De la même manière que dans un script, le débogueur va mettre en pause l’exécution juste avant la première ligne du module.

source: The typical usage to break into the debugger from a running program is to insert ::
fr: L'usage typique pour forcer le débogueur depuis un programme s'exécutant est d'insérer ::

source: at the location you want to break into the debugger. You can then step through the code following this statement, and continue running without the debugger using the :pdbcmd:`continue` command.
fr: à l'endroit où vous voulez pénétrer dans le débogueur. Vous pouvez alors parcourir le code suivant cette instruction, et continuer à exécuter sans le débogueur en utilisant la commande :pdbcmd:`continue`.

source: The built-in :func:`breakpoint()`, when called with defaults, can be used instead of ``import pdb; pdb.set_trace()``.
fr: La fonction standard :func:`breakpoint()`, quand elle est appelée avec les valeurs par défaut, peut être utilisée en lieu et place de ``import pdb; pdb.set_trace()``.

source: The typical usage to inspect a crashed program is::
fr: L'usage typique pour inspecter un programme planté ::

source: The module defines the following functions; each enters the debugger in a slightly different way:
fr: Le module définit les fonctions suivantes; chacune entre dans le débogueur d'une manière légèrement différente:

source: Execute the *statement* (given as a string or a code object) under debugger control. The debugger prompt appears before any code is executed; you can set breakpoints and type :pdbcmd:`continue`, or you can step through the statement using :pdbcmd:`step` or :pdbcmd:`next` (all these commands are explained below). The optional *globals* and *locals* arguments specify the environment in which the code is executed; by default the dictionary of the module :mod:`__main__` is used. (See the explanation of the built-in :func:`exec` or :func:`eval` functions.)
fr: Exécute la *déclaration* (donnée sous forme de chaîne de caractères ou d'objet code) sous le contrôle du débogueur. L'invite de débogage apparaît avant l'exécution de tout code; vous pouvez définir des points d'arrêt et taper :pdbcmd:`continue`, ou vous pouvez passer à travers l'instruction en utilisant :pdbcmd:`step` ou :pdbcmd:`next` (toutes ces commandes sont expliquées ci-dessous). Les arguments *globals* et *locals* optionnels spécifient l'environnement dans lequel le code est exécuté; par défaut le dictionnaire du module :mod:`__main__` est utilisé. (Voir l'explication des fonctions natives :func:`exec` ou :func:`eval`.)

source: Evaluate the *expression* (given as a string or a code object) under debugger control. When :func:`runeval` returns, it returns the value of the expression. Otherwise this function is similar to :func:`run`.
fr: Évalue l'*expression* (donné comme une chaine de caractères ou un code objet) sous le contrôle du débogueur. Quand la fonction :func:`runeval` retourne, elle renvoie la valeur de l'expression. Autrement cette fonction est similaire à la fonction :func:`run`.

source: Call the *function* (a function or method object, not a string) with the given arguments. When :func:`runcall` returns, it returns whatever the function call returned. The debugger prompt appears as soon as the function is entered.
fr: Appelle la *function* (une fonction ou une méthode, pas une chaine de caractères) avec les arguments donnés. Quand :func:`runcall` revient, il retourne ce que l'appel de fonctionne a renvoyé. L'invite de débogage apparaît dès que la fonction est entrée.

source: Enter the debugger at the calling stack frame. This is useful to hard-code a breakpoint at a given point in a program, even if the code is not otherwise being debugged (e.g. when an assertion fails). If given, *header* is printed to the console just before debugging begins.
fr: Invoque le débogueur dans la cadre d'exécution appelant. C'est utile pour coder en dur un point d'arrêt dans un programme, même si le code n'est pas autrement débogué (par exemple, quand une assertion échoue). S'il est donné, *header* est affiché sur la console juste avant que le débogage commence.

source: The keyword-only argument *header*.
fr: L’argument *keyword-only* *header*.

source: Enter post-mortem debugging of the given *traceback* object. If no *traceback* is given, it uses the one of the exception that is currently being handled (an exception must be being handled if the default is to be used).
fr: Entre le débogage post-mortem de l'objet *traceback* donné. Si aucun *traceback* n'est donné, il utilise celui de l'exception en cours de traitement (une exception doit être gérée si la valeur par défaut doit être utilisée).

source: Enter post-mortem debugging of the traceback found in :data:`sys.last_traceback`.
fr: Entre le débogage post-mortem de la trace trouvé dans :data:`sys. last_traceback`.

source: The ``run*`` functions and :func:`set_trace` are aliases for instantiating the :class:`Pdb` class and calling the method of the same name. If you want to access further features, you have to do this yourself:
fr: Les fonctions ``run*`` et :func:`set_trace` sont des alias pour instancier la classe :class:`Pdb` et appeler la méthode du même nom. Si vous souhaitez accéder à d'autres fonctionnalités, vous devez le faire vous-même ::

source: :class:`Pdb` is the debugger class.
fr: Le classe du débogueur est la classe :class:`Pdb`.

source: The *completekey*, *stdin* and *stdout* arguments are passed to the underlying :class:`cmd.Cmd` class; see the description there.
fr: Les arguments *completekey*, *stdin* et *stdout* sont transmis à la classe sous-jacente :class:`cmd.Cmd`; voir la description ici.

source: The *skip* argument, if given, must be an iterable of glob-style module name patterns. The debugger will not step into frames that originate in a module that matches one of these patterns. [1]_
fr: L'argument *skip*, s'il est donné, doit être un itérable des noms de modules de style *glob*. Le débogueur n'entrera pas dans les *frames* qui proviennent d'un module qui correspond à l'un de ces motifs. [1]_

source: By default, Pdb sets a handler for the SIGINT signal (which is sent when the user presses :kbd:`Ctrl-C` on the console) when you give a ``continue`` command. This allows you to break into the debugger again by pressing :kbd:`Ctrl-C`. If you want Pdb not to touch the SIGINT handler, set *nosigint* to true.
fr: Par défaut, Pdb définit un gestionnaire pour le signal SIGINT (qui est envoyé lorsque l'utilisateur appuie sur :kbd:`Ctrl-C` sur la console) lorsque vous donnez une commande ``continue``. Ceci vous permet de pénétrer à nouveau dans le débogueur en appuyant sur :kbd:`Ctrl-C`. Si vous voulez que Pdb ne touche pas le gestionnaire SIGINT, assignez *nosigint* à *True*.

source: The *readrc* argument defaults to true and controls whether Pdb will load .pdbrc files from the filesystem.
fr: L'argument *readrc* vaut *True* par défaut et contrôle si Pdb chargera les fichiers *.pdbrc* depuis le système de fichiers.

source: Example call to enable tracing with *skip*::
fr: Exemple d'appel pour activer le traçage avec *skip* ::

source: Raises an :ref:`auditing event <auditing>` ``pdb.Pdb`` with no arguments.
fr: Lève un :ref:`évènement d'audit <auditing>` ``pdb.Pdb`` sans argument.

source: The *skip* argument.
fr: L'argument *skip*.

source: The *nosigint* argument. Previously, a SIGINT handler was never set by Pdb.
fr: L'argument *nosigint*. Auparavant, un gestionnaire SIGINT n'était jamais configuré par Pdb.

source: The *readrc* argument.
fr: L'argument *readrc*.

source: See the documentation for the functions explained above.
fr: Voir la documentation pour les fonctions expliquées ci-dessus.

source: Debugger Commands
fr: Commande du débogueur

source: The commands recognized by the debugger are listed below. Most commands can be abbreviated to one or two letters as indicated; e.g. ``h(elp)`` means that either ``h`` or ``help`` can be used to enter the help command (but not ``he`` or ``hel``, nor ``H`` or ``Help`` or ``HELP``). Arguments to commands must be separated by whitespace (spaces or tabs). Optional arguments are enclosed in square brackets (``[]``) in the command syntax; the square brackets must not be typed. Alternatives in the command syntax are separated by a vertical bar (``|``).
fr: Les commandes reconnues par le débogueur sont listées. La plupart des commandes peuvent être abrégées à une ou deux lettres comme indiquées; par exemple. ``h(elp)`` signifie que soit ``h`` ou ``help`` peut être utilisée pour entrer la commande *help* (mais pas ``he`` or ``hel``, ni ``H`` ou ``HELP``). Les arguments des commandes doivent être séparées par des espaces (espaces ou tabulations). Les arguments optionnels sont entourés dans des crochets (``[]``) dans la syntaxe de la commande; les crochets ne doivent pas être insérés. Les alternatives dans la syntaxe de la commande sont séparés par une barre verticale (``|``).

source: Entering a blank line repeats the last command entered. Exception: if the last command was a :pdbcmd:`list` command, the next 11 lines are listed.
fr: Entrer une ligne vide répète la dernière commande entrée. Exception: si la dernière commande était la commande :pdbcmd:`list`, les 11 prochaines lignes sont affichées.

source: Commands that the debugger doesn't recognize are assumed to be Python statements and are executed in the context of the program being debugged. Python statements can also be prefixed with an exclamation point (``!``). This is a powerful way to inspect the program being debugged; it is even possible to change a variable or call a function. When an exception occurs in such a statement, the exception name is printed but the debugger's state is not changed.
fr: Les commandes que le débogueur ne reconnaît pas sont supposées être des instructions Python et sont exécutées dans le contexte du programme en cours de débogage. Les instructions Python peuvent également être préfixées avec un point d'exclamation (``!``). C'est une façon puissante d'inspecter le programme en cours de débogage; il est même possible de changer une variable ou d'appeler une fonction. Lorsqu'une exception se produit dans une telle instruction, le nom de l'exception est affiché mais l'état du débogueur n'est pas modifié.

source: The debugger supports :ref:`aliases <debugger-aliases>`. Aliases can have parameters which allows one a certain level of adaptability to the context under examination.
fr: Le débogueur supporte :ref:`aliases <debugger-aliases>`. Les alias peuvent avoir des paramètres qui permettent un certain niveau d'adaptabilité au contexte étudié.

source: Multiple commands may be entered on a single line, separated by ``;;``. (A single ``;`` is not used as it is the separator for multiple commands in a line that is passed to the Python parser.) No intelligence is applied to separating the commands; the input is split at the first ``;;`` pair, even if it is in the middle of a quoted string.
fr: Plusieurs commandes peuvent être saisies sur une seule ligne, séparées par ``;;``. (Un seul ``;`` n'est pas utilisé car il est le séparateur de plusieurs commandes dans une ligne qui est passée à l'analyseur Python. Aucune intelligence n'est appliquée pour séparer les commandes; l'entrée est divisée à la première paire de ``;;`` paire, même si il est au milieu d'une chaîne de caractères.

source: If a file :file:`.pdbrc` exists in the user's home directory or in the current directory, it is read in and executed as if it had been typed at the debugger prompt. This is particularly useful for aliases. If both files exist, the one in the home directory is read first and aliases defined there can be overridden by the local file.
fr: Si un fichier :file:`.pdbrc` existe dans le répertoire d'accueil de l'utilisateur ou dans le répertoire courant, il est lu et exécuté comme si il avait été écrit dans l'invite du débogueur. C'est particulièrement utile pour les alias. Si les deux fichiers existent, celui dans le répertoire d’accueil de l’utilisateur est lu en premier et les alias définis dedans peuvent être surchargés par le fichier local.

source: :file:`.pdbrc` can now contain commands that continue debugging, such as :pdbcmd:`continue` or :pdbcmd:`next`. Previously, these commands had no effect.
fr: Le fichier :file:`.pdbrc` peut maintenant contenir des commandes qui continue le débogage, comme :pdbcmd:`continue` ou :pdbcmd:`next`. Précédemment, ces commandes n'avaient aucun effet.

source: Without argument, print the list of available commands. With a *command* as argument, print help about that command. ``help pdb`` displays the full documentation (the docstring of the :mod:`pdb` module). Since the *command* argument must be an identifier, ``help exec`` must be entered to get help on the ``!`` command.
fr: Sans argument, affiche la liste des commandes disponibles. Avec une *commande* comme argument, affiche l'aide de cette commande. ``help pdb`` affiche la documentation complète (la *docstring* du module :mod:`pdb`). Puisque l'argument *command* doit être un identificateur, ``help exec`` doit être entré pour obtenir de l'aide sur la commande ``!``.

source: Print a stack trace, with the most recent frame at the bottom. An arrow indicates the current frame, which determines the context of most commands.
fr: Affiche une trace de pile, avec la *frame* le plus récent en bas. Une flèche indique le *frame* courant, qui détermine le contexte de la plupart des commandes.

source: Move the current frame *count* (default one) levels down in the stack trace (to a newer frame).
fr: Déplace le niveau de la *frame* courante *count* (par défaut un) vers le bas dans la trace de pile (vers une *frame* plus récente).

source: Move the current frame *count* (default one) levels up in the stack trace (to an older frame).
fr: Déplace le niveau de la *frame* courante *count* (par défaut un) vers le haut dans la trace de pile (vers une *frame* plus ancienne).

source: With a *lineno* argument, set a break there in the current file. With a *function* argument, set a break at the first executable statement within that function. The line number may be prefixed with a filename and a colon, to specify a breakpoint in another file (probably one that hasn't been loaded yet). The file is searched on :data:`sys.path`. Note that each breakpoint is assigned a number to which all the other breakpoint commands refer.
fr: Avec un argument *lineno*, définit une pause dans le fichier courant. Avec un argument *function*, définit une pause à la première instruction exécutable dans cette fonction. Le numéro de ligne peut être préfixé d'un nom de fichier et d'un deux-points, pour spécifier un point d'arrêt dans un autre fichier (probablement celui qui n'a pas encore été chargé). Le fichier est recherché sur :data:`sys.path`. Notez que chaque point d'arrêt reçoit un numéro auquel se réfèrent toutes les autres commandes de point d'arrêt.

source: If a second argument is present, it is an expression which must evaluate to true before the breakpoint is honored.
fr: Si un second argument est présent, c'est une expression qui doit évaluer à *True* avant que le point d'arrêt ne soit honoré.

source: Without argument, list all breaks, including for each breakpoint, the number of times that breakpoint has been hit, the current ignore count, and the associated condition if any.
fr: Sans argument, liste tous les arrêts, incluant pour chaque point d'arrêt, le nombre de fois qu'un point d'arrêt a été atteint, le nombre de ignore, et la condition associée le cas échéant.

source: Temporary breakpoint, which is removed automatically when it is first hit. The arguments are the same as for :pdbcmd:`break`.
fr: Point d'arrêt temporaire, qui est enlevé automatiquement au premier passage. Les arguments sont les mêmes que pour :pdbcmd:`break`.

source: With a *filename:lineno* argument, clear all the breakpoints at this line. With a space separated list of breakpoint numbers, clear those breakpoints. Without argument, clear all breaks (but first ask confirmation).
fr: Avec un argument *filename:lineno*, efface tous les points d'arrêt sur cette ligne. Avec une liste de numéros de points d'arrêt séparés par un espace, efface ces points d'arrêt. Sans argument, efface tous les points d'arrêt (mais demande d'abord confirmation).

source: Disable the breakpoints given as a space separated list of breakpoint numbers. Disabling a breakpoint means it cannot cause the program to stop execution, but unlike clearing a breakpoint, it remains in the list of breakpoints and can be (re-)enabled.
fr: Désactive les points d'arrêt indiqués sous la forme d'une liste de numéros de points d'arrêt séparés par un espace. Désactiver un point d'arrêt signifie qu'il ne peut pas interrompre l'exécution du programme, mais à la différence d'effacer un point d'arrêt, il reste dans la liste des points d'arrêt et peut être (ré)activé.

source: Enable the breakpoints specified.
fr: Active les points d'arrêt spécifiés.

source: Set the ignore count for the given breakpoint number. If count is omitted, the ignore count is set to 0. A breakpoint becomes active when the ignore count is zero. When non-zero, the count is decremented each time the breakpoint is reached and the breakpoint is not disabled and any associated condition evaluates to true.
fr: Définit le nombre de fois où le point d'arrêt donné sera passé. Si le compte est omis, le compte est mis à 0. Un point d'arrêt devient actif lorsque le compte est nul. Lorsqu'il n'est pas nul, le comptage est diminué à chaque fois que le point d'arrêt est atteint et que le point d'arrêt n'est pas désactivé et que toute condition associée est évaluée comme vraie.

source: Set a new *condition* for the breakpoint, an expression which must evaluate to true before the breakpoint is honored. If *condition* is absent, any existing condition is removed; i.e., the breakpoint is made unconditional.
fr: Définit une nouvelle *condition* pour le point d'arrêt, une expression qui doit évaluer à *True* avant que le point d'arrêt ne soit honoré. Si *condition* est absente, toute condition existante est supprimée, c'est-à-dire que le point d'arrêt est rendu inconditionnel.

source: Specify a list of commands for breakpoint number *bpnumber*. The commands themselves appear on the following lines. Type a line containing just ``end`` to terminate the commands. An example::
fr: Spécifie une liste de commandes pour le numéro du point d'arrêt *bpnumber*. Les commandes elles-mêmes apparaissent sur les lignes suivantes. Tapez une ligne contenant juste ``end`` pour terminer les commandes. Un exemple ::

source: To remove all commands from a breakpoint, type ``commands`` and follow it immediately with ``end``; that is, give no commands.
fr: Pour supprimer toutes les commandes depuis un point d'arrêt, écrivez ``commands`` suivi immédiatement de ``end`` ; ceci supprime les commandes.

source: With no *bpnumber* argument, ``commands`` refers to the last breakpoint set.
fr: Sans argument *bpnumber*, ``commands`` se réfère au dernier point d'arrêt défini.

source: You can use breakpoint commands to start your program up again. Simply use the :pdbcmd:`continue` command, or :pdbcmd:`step`, or any other command that resumes execution.
fr: Vous pouvez utiliser les commandes de point d'arrêt pour redémarrer votre programme. Utilisez simplement la commande :pdbcmd:`continue`, ou :pdbcmd:`step`, ou toute autre commande qui reprend l'exécution.
