Repository: python/python-docs-fr
Catalog: library/pdb.po
Languages: fr

source: Specifying any command resuming execution (currently :pdbcmd:`continue`, :pdbcmd:`step`, :pdbcmd:`next`, :pdbcmd:`return`, :pdbcmd:`jump`, :pdbcmd:`quit` and their abbreviations) terminates the command list (as if that command was immediately followed by end). This is because any time you resume execution (even with a simple next or step), you may encounter another breakpoint—which could have its own command list, leading to ambiguities about which list to execute.
fr: Entrer toute commande reprenant l'exécution (actuellement :pdbcmd:`continue`, :pdbcmd:`step`, :pdbcmd:`next`, :pdbcmd:`return`, :pdbcmd:`jump`, :pdbcmd:`quit` et leurs abréviations) termine la liste des commandes (comme si cette commande était immédiatement suivie de la fin). C'est parce que chaque fois que vous reprenez l'exécution (même avec un simple *next* ou *step*), vous pouvez rencontrer un autre point d'arrêt -- qui pourrait avoir sa propre liste de commandes, conduisant à des ambiguïtés sur la liste à exécuter.

source: If you use the 'silent' command in the command list, the usual message about stopping at a breakpoint is not printed. This may be desirable for breakpoints that are to print a specific message and then continue. If none of the other commands print anything, you see no sign that the breakpoint was reached.
fr: Si vous utilisez la commande 'silence' dans la liste des commandes, le message habituel concernant l'arrêt à un point d'arrêt n'est pas affiché. Ceci peut être souhaitable pour les points d'arrêt qui doivent afficher un message spécifique et ensuite continuer. Si aucune des autres commandes n'affiche quoi que ce soit, vous ne voyez aucun signe indiquant que le point de rupture a été atteint.

source: Execute the current line, stop at the first possible occasion (either in a function that is called or on the next line in the current function).
fr: Exécute la ligne en cours, s'arrête à la première occasion possible (soit dans une fonction qui est appelée, soit sur la ligne suivante de la fonction courante).

source: Continue execution until the next line in the current function is reached or it returns. (The difference between :pdbcmd:`next` and :pdbcmd:`step` is that :pdbcmd:`step` stops inside a called function, while :pdbcmd:`next` executes called functions at (nearly) full speed, only stopping at the next line in the current function.)
fr: Continue l'exécution jusqu'à ce que la ligne suivante de la fonction en cours soit atteinte ou qu'elle revienne. (La différence entre :pdbcmd:`next` et :pdbcmd:`step` est que :pdbcmd:`step` s'arrête dans une fonction appelée, tandis que :pdbcmd:`next` exécute les fonctions appelées à (presque) pleine vitesse, ne s'arrêtant qu'à la ligne suivante dans la fonction courante.)

source: Without argument, continue execution until the line with a number greater than the current one is reached.
fr: Sans argument, continue l'exécution jusqu'à ce que la ligne avec un nombre supérieur au nombre actuel soit atteinte.

source: With a line number, continue execution until a line with a number greater or equal to that is reached. In both cases, also stop when the current frame returns.
fr: Avec un numéro de ligne, continue l'exécution jusqu'à ce qu'une ligne avec un numéro supérieur ou égal à celui-ci soit atteinte. Dans les deux cas, arrête également lorsque la *frame* courante revient.

source: Allow giving an explicit line number.
fr: Permet de donner un numéro de ligne explicite.

source: Continue execution until the current function returns.
fr: Continue l'exécution jusqu'au retour de la fonction courante.

source: Continue execution, only stop when a breakpoint is encountered.
fr: Continue l'exécution, seulement s'arrête quand un point d'arrêt est rencontré.

source: Set the next line that will be executed. Only available in the bottom-most frame. This lets you jump back and execute code again, or jump forward to skip code that you don't want to run.
fr: Définit la prochaine ligne qui sera exécutée. Uniquement disponible dans la *frame* inférieur. Cela vous permet de revenir en arrière et d'exécuter à nouveau le code, ou de passer en avant pour sauter le code que vous ne voulez pas exécuter.

source: It should be noted that not all jumps are allowed -- for instance it is not possible to jump into the middle of a :keyword:`for` loop or out of a :keyword:`finally` clause.
fr: Il est à noter que tous les sauts ne sont pas autorisés -- par exemple, il n'est pas possible de sauter au milieu d'une boucle :keyword:`for` ou en dehors d'une clause :keyword:`finally`.

source: List source code for the current file. Without arguments, list 11 lines around the current line or continue the previous listing. With ``.`` as argument, list 11 lines around the current line. With one argument, list 11 lines around at that line. With two arguments, list the given range; if the second argument is less than the first, it is interpreted as a count.
fr: Liste le code source du fichier courant. Sans arguments, liste 11 lignes autour de la ligne courante ou continue le listing précédant. Avec l'argument ``.``, liste 11 lignes autour de la ligne courante. Avec un argument, liste les 11 lignes autour de cette ligne. Avec deux arguments, liste la plage donnée; si le second argument est inférieur au premier, il est interprété comme un compte.

source: The current line in the current frame is indicated by ``->``. If an exception is being debugged, the line where the exception was originally raised or propagated is indicated by ``>>``, if it differs from the current line.
fr: La ligne en cours dans l'image courante est indiquée par ``->``. Si une exception est en cours de débogage, la ligne où l'exception a été initialement levée ou propagée est indiquée par ``>>``, si elle diffère de la ligne courante.

source: The ``>>`` marker.
fr: Le marqueur ``>>``.

source: List all source code for the current function or frame. Interesting lines are marked as for :pdbcmd:`list`.
fr: Liste le code source de la fonction ou du bloc courant. Les lignes intéressantes sont marquées comme pour :pdbcmd:`list`.

source: Print the argument list of the current function.
fr: Affiche la liste d'arguments de la fonction courante.

source: Evaluate the *expression* in the current context and print its value.
fr: Évalue l'*expression* dans le contexte courant et affiche sa valeur.

source: ``print()`` can also be used, but is not a debugger command --- this executes the Python :func:`print` function.
fr: ``print()`` peut aussi être utilisée, mais n'est pas une commande du débogueur --- il exécute la fonction Python :func:`print`.

source: Like the :pdbcmd:`p` command, except the value of the expression is pretty-printed using the :mod:`pprint` module.
fr: Comme la commande :pdbcmd:`p`, sauf que la valeur de l'expression est joliment affiché en utilisant le module :mod:`pprint`.

source: Print the type of the *expression*.
fr: Affiche le type de l'*expression*.

source: Try to get source code for the given object and display it.
fr: Essaie d'obtenir le code source pour l'objet donné et l'affiche.

source: Display the value of the expression if it changed, each time execution stops in the current frame.
fr: Affiche la valeur de l'expression si elle a changée, chaque fois que l'exécution s'arrête dans la *frame* courante.

source: Without expression, list all display expressions for the current frame.
fr: Sans expression, liste toutes les expressions pour la *frame* courante.

source: Do not display the expression any more in the current frame. Without expression, clear all display expressions for the current frame.
fr: N'affiche plus l'expression dans la *frame* courante. Sans expression, efface toutes les expressions d'affichage de la *frame* courante.

source: Start an interactive interpreter (using the :mod:`code` module) whose global namespace contains all the (global and local) names found in the current scope.
fr: Démarre un interpréteur interactif (en utilisant le module :mod:`code`) dont l'espace de nommage global contient tous les noms (*global* et *local*) trouvés dans la portée courante.

source: Create an alias called *name* that executes *command*. The command must *not* be enclosed in quotes. Replaceable parameters can be indicated by ``%1``, ``%2``, and so on, while ``%*`` is replaced by all the parameters. If no command is given, the current alias for *name* is shown. If no arguments are given, all aliases are listed.
fr: Créez un alias appelé *name* qui exécute *command*. La commande ne doit *pas* être entourée de guillemets. Les paramètres remplaçables peuvent être indiqués par ``%1``, ``%2`` et ainsi de suite, tandis que ``%*`` est remplacé par tous les paramètres. Si aucune commande n'est donnée, l'alias courant pour *name* est affiché. Si aucun argument n'est donné, tous les alias sont listés.

source: Aliases may be nested and can contain anything that can be legally typed at the pdb prompt. Note that internal pdb commands *can* be overridden by aliases. Such a command is then hidden until the alias is removed. Aliasing is recursively applied to the first word of the command line; all other words in the line are left alone.
fr: Les alias peuvent être imbriqués et peuvent contenir tout ce qui peut être légalement tapé à l'invite *pdb*. Notez que les commandes *pdb* internes *peuvent* être remplacées par des alias. Une telle commande est alors masquée jusqu'à ce que l'alias soit supprimé. L'*aliasing* est appliqué récursivement au premier mot de la ligne de commande; tous les autres mots de la ligne sont laissés seuls.

source: As an example, here are two useful aliases (especially when placed in the :file:`.pdbrc` file)::
fr: Comme un exemple, voici deux alias utiles (spécialement quand il est placé dans le fichier :file:`.pdbrc`) ::

source: Delete the specified alias.
fr: Supprime l'alias spécifié.

source: Execute the (one-line) *statement* in the context of the current stack frame. The exclamation point can be omitted unless the first word of the statement resembles a debugger command. To set a global variable, you can prefix the assignment command with a :keyword:`global` statement on the same line, e.g.::
fr: Exécute l'instruction *statement* (une ligne) dans le contexte de la *frame* de la pile courante. Le point d'exclamation peut être omis à moins que le premier mot de l'instruction ne ressemble à une commande de débogueur. Pour définir une variable globale, vous pouvez préfixer la commande d'assignation avec une instruction :keyword:`global` sur la même ligne, par exemple ::

source: Restart the debugged Python program. If an argument is supplied, it is split with :mod:`shlex` and the result is used as the new :data:`sys.argv`. History, breakpoints, actions and debugger options are preserved. :pdbcmd:`restart` is an alias for :pdbcmd:`run`.
fr: Redémarre le programme Python débogué. Si un argument est fourni, il est splitté avec :mod:`shlex` et le résultat es utilisé comme le nouveau :data:`sys.argv`. L'historique, les points d'arrêt, les actions et les options du débogueur sont préservés. :pdbcmd:`restart` est un alias pour :pdbcmd:`run`.

source: Quit from the debugger. The program being executed is aborted.
fr: Quitte le débogueur. Le programme exécuté est arrêté.

source: Enter a recursive debugger that steps through the code argument (which is an arbitrary expression or statement to be executed in the current environment).
fr: Entre dans un débogueur récursif qui parcours l'argument ``code`` (qui est une expression arbitraire ou une instruction à exécuter dans l'environnement courant).

source: Footnotes
fr: Notes

source: Whether a frame is considered to originate in a certain module is determined by the ``__name__`` in the frame globals.
fr: La question de savoir si une *frame* est considérée comme provenant d'un certain module est déterminée par le ``__name__`` dans les globales de la *frame*.
