Repository: python/python-docs-fr
Catalog: library/pickle.po
Languages: fr

source: :mod:`pickle` --- Python object serialization
fr: :mod:`pickle` — Sérialisation d'objets Python

source: **Source code:** :source:`Lib/pickle.py`
fr: **Code source :** :source:`Lib/pickle.py`

source: The :mod:`pickle` module implements binary protocols for serializing and de-serializing a Python object structure. *"Pickling"* is the process whereby a Python object hierarchy is converted into a byte stream, and *"unpickling"* is the inverse operation, whereby a byte stream (from a :term:`binary file` or :term:`bytes-like object`) is converted back into an object hierarchy. Pickling (and unpickling) is alternatively known as "serialization", "marshalling," [#]_ or "flattening"; however, to avoid confusion, the terms used here are "pickling" and "unpickling".
fr: Le module :mod:`pickle` implémente des protocoles binaires de sérialisation et dé-sérialisation d'objets Python. La sérialisation est le procédé par lequel une hiérarchie d'objets Python est convertie en flux d'octets. La désérialisation est l'opération inverse, par laquelle un flux d'octets (à partir d'un :term:`binary file` ou :term:`bytes-like object`) est converti en hiérarchie d'objets. Sérialisation (et *désérialisation*) sont aussi connus sous les termes de *pickling*, de "*marshalling*" [#]_ ou encore de "*flattening*".

source: The ``pickle`` module **is not secure**. Only unpickle data you trust.
fr: Le module ``pickle`` **n'est pas sécurisé**. Ne désérialisez des objets qu'à partir de sources fiables.

source: It is possible to construct malicious pickle data which will **execute arbitrary code during unpickling**. Never unpickle data that could have come from an untrusted source, or that could have been tampered with.
fr: Il est possible de produire des données binaires qui **exécutent du code arbitraire lors de leur désérialisation**. Ne désérialisez jamais des données provenant d'une source non fiable, ou qui pourraient avoir été modifiées.

source: Consider signing data with :mod:`hmac` if you need to ensure that it has not been tampered with.
fr: Pensez au module :mod:`hmac` pour signer des données afin de s'assurer qu'elles n'ont pas été modifiées.

source: Safer serialization formats such as :mod:`json` may be more appropriate if you are processing untrusted data. See :ref:`comparison-with-json`.
fr: Des formats de sérialisation plus sûrs, comme :mod:`json`, peuvent se révéler plus adaptés si vous travaillez sur des données qui ne sont pas fiables. Voir :ref:`comparison-with-json`.

source: Relationship to other Python modules
fr: Relations aux autres modules Python

source: Comparison with ``marshal``
fr: Comparaison avec ``marshal``

source: Python has a more primitive serialization module called :mod:`marshal`, but in general :mod:`pickle` should always be the preferred way to serialize Python objects. :mod:`marshal` exists primarily to support Python's :file:`.pyc` files.
fr: Python possède un module de bas niveau en sérialisation appelé :mod:`marshal`, mais en général il est préférable d'utiliser :mod:`pickle` pour sérialiser des objets Python. :mod:`marshal` existe principalement pour gérer les fichiers Python en :file:`.pyc`.

source: The :mod:`pickle` module differs from :mod:`marshal` in several significant ways:
fr: Le module :mod:`pickle` diffère du module :mod:`marshal` sur plusieurs aspects :

source: The :mod:`pickle` module keeps track of the objects it has already serialized, so that later references to the same object won't be serialized again. :mod:`marshal` doesn't do this.
fr: Le module :mod:`pickle` garde la trace des objets qu'il a déjà sérialisés, pour faire en sorte que les prochaines références à cet objet ne soient pas sérialisées à nouveau. :mod:`marshal` ne le fait pas.

source: This has implications both for recursive objects and object sharing. Recursive objects are objects that contain references to themselves. These are not handled by marshal, and in fact, attempting to marshal recursive objects will crash your Python interpreter. Object sharing happens when there are multiple references to the same object in different places in the object hierarchy being serialized. :mod:`pickle` stores such objects only once, and ensures that all other references point to the master copy. Shared objects remain shared, which can be very important for mutable objects.
fr: Ça a des implications sur les objets partagés et les objets récursifs. Les objets récursifs sont des objets qui contiennent des références à eux-mêmes. Ceux-ci ne sont pas gérées par marshal : lui donner un objet récursif va le faire planter. Un objet est partagé lorsque que plusieurs références pointent dessus, depuis différents endroits dans la hiérarchie sérialisée. Le module :mod:`pickle` repère ces partages et ne stocke ces objets qu'une seule fois. Les objets partagés restent ainsi partagés, ce qui peut être très important pour les objets muables.

source: :mod:`marshal` cannot be used to serialize user-defined classes and their instances. :mod:`pickle` can save and restore class instances transparently, however the class definition must be importable and live in the same module as when the object was stored.
fr: :mod:`marshal` ne peut être utilisé pour la sérialisation et l'instanciation de classes définies par les utilisateurs. :mod:`pickle` peut sauvegarder et restaurer les instances de classes de manière transparente. Cependant la définition de classe doit être importable et lancée dans le même module et de la même manière que lors de son importation.

source: The :mod:`marshal` serialization format is not guaranteed to be portable across Python versions. Because its primary job in life is to support :file:`.pyc` files, the Python implementers reserve the right to change the serialization format in non-backwards compatible ways should the need arise. The :mod:`pickle` serialization format is guaranteed to be backwards compatible across Python releases provided a compatible pickle protocol is chosen and pickling and unpickling code deals with Python 2 to Python 3 type differences if your data is crossing that unique breaking change language boundary.
fr: Aucune garantie n'est offerte sur la portabilité du format :mod:`marshal` entre différentes versions de Python. Sa fonction première étant la gestion des fichiers :file:`.pyc`, les développeurs se réservent le droit de changer le format de sérialisation de manière non-rétrocompatible si besoin était. Il est garanti que le format :mod:`pickle` restera compatible avec les versions futures de Python, pourvu que vous choisissiez un protocole de sérialisation adapté. De plus, il masque les différences entre les types Python 2 et Python 3, pour le cas où il s'agit de désérialiser en Python 3 des données sérialisées en Python 2.

source: Comparison with ``json``
fr: Comparaison avec ``json``

source: JSON is a text serialization format (it outputs unicode text, although most of the time it is then encoded to ``utf-8``), while pickle is a binary serialization format;
fr: *pickle* est un format binaire, tandis que JSON est un format textuel (constitué de caractères Unicode et généralement encodé en UTF-8) ;

source: JSON is human-readable, while pickle is not;
fr: JSON peut être lu par une personne, contrairement à *pickle* ;

source: JSON is interoperable and widely used outside of the Python ecosystem, while pickle is Python-specific;
fr: JSON offre l'interopérabilité avec de nombreux outils en dehors de l'écosystème Python, alors que *pickle* est propre à Python ;

source: JSON, by default, can only represent a subset of the Python built-in types, and no custom classes; pickle can represent an extremely large number of Python types (many of them automatically, by clever usage of Python's introspection facilities; complex cases can be tackled by implementing :ref:`specific object APIs <pickle-inst>`);
fr: Par défaut, JSON n'est capable de sérialiser qu'un nombre limité de types natifs Python, et ne prend pas en charge les classes définies par l'utilisateur. Le format *pickle* peut représenter une multitude de types d'objets, dont beaucoup automatiquement, grâce à une utilisation fine des possibilités d'introspection de Python ; on peut traiter les cas les plus complexes en implémentant des :ref:`méthodes de sérialisation propres à une classe <pickle-inst>` ;

source: Unlike pickle, deserializing untrusted JSON does not in itself create an arbitrary code execution vulnerability.
fr: Contrairement à *pickle*, la désérialisation de données JSON n'ouvre pas en soi une vulnérabilité à l'exécution de code arbitraire.

source: The :mod:`json` module: a standard library module allowing JSON serialization and deserialization.
fr: Le module :mod:`json` de la bibliothèque standard permet la sérialisation et désérialisation au format JSON.

source: Data stream format
fr: Format du flux de données

source: The data format used by :mod:`pickle` is Python-specific. This has the advantage that there are no restrictions imposed by external standards such as JSON or XDR (which can't represent pointer sharing); however it means that non-Python programs may not be able to reconstruct pickled Python objects.
fr: Le format de données employé par :mod:`pickle` est propre à Python, avec l'avantage qu'aucune restriction n'est imposée par des standards externes comme JSON ou XDR (qui ne peuvent pas représenter le partage de références). Cependant, cela signifie que des programmes écrits en d'autres langages que Python peuvent échouer à reconstituer les objets sérialisés.

source: By default, the :mod:`pickle` data format uses a relatively compact binary representation. If you need optimal size characteristics, you can efficiently :doc:`compress <archiving>` pickled data.
fr: Le format binaire :mod:`pickle` est, par défaut, une représentation assez compacte des objets. Il est possible de :doc:`compresser <archiving>` efficacement les données sérialisées.

source: The module :mod:`pickletools` contains tools for analyzing data streams generated by :mod:`pickle`. :mod:`pickletools` source code has extensive comments about opcodes used by pickle protocols.
fr: Le module :mod:`pickletools` contient des outils servant à analyser les flux de données générés par :mod:`pickle`. Le code source de :mod:`pickletools` contient des commentaires détaillés sur les *opcodes* employés par les protocoles *pickle*.

source: There are currently 6 different protocols which can be used for pickling. The higher the protocol used, the more recent the version of Python needed to read the pickle produced.
fr: Il existe actuellement 6 protocoles différents pour la sérialisation. Les protocoles portant les numéros les plus grands sont les derniers ajoutés, et nécessitent en conséquence des versions de Python plus récentes.

source: Protocol version 0 is the original "human-readable" protocol and is backwards compatible with earlier versions of Python.
fr: Le protocole 0 est le format originel, humainement lisible. Il est rétrocompatible avec les versions les plus anciennes de Python.

source: Protocol version 1 is an old binary format which is also compatible with earlier versions of Python.
fr: Le protocole 1 est un ancien format binaire, aussi compatible avec les versions anciennes.

source: Protocol version 3 was added in Python 3.0. It has explicit support for :class:`bytes` objects and cannot be unpickled by Python 2.x. This was the default protocol in Python 3.0--3.7.
fr: Le protocole 3 a été introduit en Python 3.0. Il gère les objets :class:`bytes`, et ne permet pas la désérialisation par Python 2.x. Il fut le protocole par défaut de Python 3.0 à Python 3.7.

source: Protocol version 4 was added in Python 3.4. It adds support for very large objects, pickling more kinds of objects, and some data format optimizations. It is the default protocol starting with Python 3.8. Refer to :pep:`3154` for information about improvements brought by protocol 4.
fr: Le protocole 4 est apparu en Python 3.4. Il prend en charge les objets de très grande taille ainsi que la sérialisation d'une plus grande variété d'objets, et optimise le format. Il est le protocole par défaut depuis Python 3.8. Voir la :pep:`3154` pour plus d'informations sur les améliorations apportées par le protocole 4.

source: Protocol version 5 was added in Python 3.8. It adds support for out-of-band data and speedup for in-band data. Refer to :pep:`574` for information about improvements brought by protocol 5.
fr: Le protocole 5 a été ajouté en Python 3.8 afin de permettre le transfert des données en marge de la sérialisation elle-même. Il a également accéléré les opérations sur les données à sérialiser. Reportez-vous à la :pep:`574` pour les détails relatifs aux améliorations apportées par le protocole 5.

source: Serialization is a more primitive notion than persistence; although :mod:`pickle` reads and writes file objects, it does not handle the issue of naming persistent objects, nor the (even more complicated) issue of concurrent access to persistent objects. The :mod:`pickle` module can transform a complex object into a byte stream and it can transform the byte stream into an object with the same internal structure. Perhaps the most obvious thing to do with these byte streams is to write them onto a file, but it is also conceivable to send them across a network or store them in a database. The :mod:`shelve` module provides a simple interface to pickle and unpickle objects on DBM-style database files.
fr: La sérialisation est un problème plus simple que la persistance des données en général. Le module :mod:`pickle` lit et écrit des objets fichiers-compatibles, mais ne s'occupe pas du problème de donner un nom à des objets persistants, ni de gérer l'accès par différents processus en parallèle à ces objets. :mod:`pickle` se contente de transformer des objets complexes en flux d'octets, et lire ces flux d'octets par la suite pour reconstruire des objets avec la même structure. Si l'on peut bien sûr écrire les flux d'octets dans un fichier, rien n'empêche de les transférer à travers un réseau, ou bien de les stocker dans une base de données. Voir le module :mod:`shelve` pour une interface simple qui sérialise et désérialise les objets dans des bases de données de style DBM.

source: Module Interface
fr: Interface du module

source: To serialize an object hierarchy, you simply call the :func:`dumps` function. Similarly, to de-serialize a data stream, you call the :func:`loads` function. However, if you want more control over serialization and de-serialization, you can create a :class:`Pickler` or an :class:`Unpickler` object, respectively.
fr: Pour sérialiser un objet, contenant éventuellement d'autres objets, appelez tout simplement la fonction :func:`dumps`. La fonction :func:`loads`, quant à elle, désérialise un flux de données. Pour un contrôle plus fin des opérations de sérialisation ou désérialisation, créez un objet :class:`Pickler` ou :class:`Unpickler`.

source: The :mod:`pickle` module provides the following constants:
fr: Le module :mod:`pickle` définit les constantes suivantes :

source: An integer, the highest :ref:`protocol version <pickle-protocols>` available. This value can be passed as a *protocol* value to functions :func:`dump` and :func:`dumps` as well as the :class:`Pickler` constructor.
fr: Entier qui donne la version du :ref:`protocole <pickle-protocols>` le plus récent qui soit disponible. Ce nombre peut être passé comme paramètre *protocol* aux fonctions :func:`dump` et :func:`dumps` ainsi qu'au constructeur de la classe :class:`Pickler`.

source: An integer, the default :ref:`protocol version <pickle-protocols>` used for pickling. May be less than :data:`HIGHEST_PROTOCOL`. Currently the default protocol is 4, first introduced in Python 3.4 and incompatible with previous versions.
fr: Entier qui donne la version du :ref:`protocole <pickle-protocols>` employé par défaut pour la sérialisation. Il peut être moindre que :data:`HIGHEST_PROTOCOL`. La valeur actuelle est 4, sachant que le protocole correspondant a été introduit en Python 3.4 et n'est pas compatible avec les versions antérieures.

source: The default protocol is 3.
fr: Le protocole par défaut est devenu le protocole 3.

source: The default protocol is 4.
fr: Le protocole par défaut est devenu le protocole 4.

source: The :mod:`pickle` module provides the following functions to make the pickling process more convenient:
fr: Le module :mod:`pickle` contient quelques fonctions pour faciliter la sérialisation.

source: Write the pickled representation of the object *obj* to the open :term:`file object` *file*. This is equivalent to ``Pickler(file, protocol).dump(obj)``.
fr: Écrit la représentation sérialisée de l'objet *obj* dans l'\ :term:`objet fichier-compatible <file object>` *file*, qui doit être ouvert. Ceci est l'équivalent de ``Pickle(file, protocol).dump(obj)``.

source: Arguments *file*, *protocol*, *fix_imports* and *buffer_callback* have the same meaning as in the :class:`Pickler` constructor.
fr: Les arguments *file*, *protocol*, *fix_imports* et *buffer_callback* sont identiques à ceux du constructeur de la classe :class:`Pickler`.

source: The *buffer_callback* argument was added.
fr: ajout de l'argument *buffer_callback*.

source: Return the pickled representation of the object *obj* as a :class:`bytes` object, instead of writing it to a file.
fr: Renvoie la représentation sérialisée de *obj* sous forme de :class:`bytes`, au lieu de l'écrire dans un fichier.

source: Arguments *protocol*, *fix_imports* and *buffer_callback* have the same meaning as in the :class:`Pickler` constructor.
fr: Les arguments *protocol*, *fix_imports* et *buffer_callback* sont identiques à ceux du constructeur de la classe :class:`Pickler`.

source: Read the pickled representation of an object from the open :term:`file object` *file* and return the reconstituted object hierarchy specified therein. This is equivalent to ``Unpickler(file).load()``.
fr: Charge la représentation sérialisée d'un objet depuis l'\ :term:`objet fichier-compatible <file object>` ouvert *file*, et renvoie l'objet reconstitué obtenu. Ceci est l'équivalent de ``Unpickler(file).load()``.

source: The protocol version of the pickle is detected automatically, so no protocol argument is needed. Bytes past the pickled representation of the object are ignored.
fr: La version du protocole utilisée pour la sérialisation est détectée automatiquement, d'où l'absence d'un argument. Les octets situés après la représentation sérialisée de l'objet sont ignorés.

source: Arguments *file*, *fix_imports*, *encoding*, *errors*, *strict* and *buffers* have the same meaning as in the :class:`Unpickler` constructor.
fr: Les arguments *file*, *fix_imports*, *encoding*, *errors*, *strict* et *buffers* sont identiques à ceux du constructeur de la classe :class:`Unpickler`.

source: The *buffers* argument was added.
fr: Ajout de l'argument *buffers*.

source: Return the reconstituted object hierarchy of the pickled representation *data* of an object. *data* must be a :term:`bytes-like object`.
fr: Renvoie l'objet reconstitué à partir de la représentation sérialisée *data*, qui doit être fournie sous la forme d'un :term:`bytes-like object`.

source: The :mod:`pickle` module defines three exceptions:
fr: Le module :mod:`pickle` définit trois types d'exceptions :

source: Common base class for the other pickling exceptions. It inherits :exc:`Exception`.
fr: Classe mère commune aux autres exceptions de sérialisation. Elle hérite de :exc:`Exception`.

source: Error raised when an unpicklable object is encountered by :class:`Pickler`. It inherits :exc:`PickleError`.
fr: Exception levée lorsqu'un objet impossible à sérialiser est rencontré par un :class:`Pickler`. Elle hérite de :exc:`PickleError`.

source: Refer to :ref:`pickle-picklable` to learn what kinds of objects can be pickled.
fr: Lisez :ref:`pickle-picklable` pour en savoir plus sur les types d'objets qui peuvent être sérialisés.

source: Error raised when there is a problem unpickling an object, such as a data corruption or a security violation. It inherits :exc:`PickleError`.
fr: Exception levée lorsqu'un flux binaire ne peut pas être désérialisé, par exemple s'il est corrompu ou en cas de violation de la sécurité. Elle hérite de :exc:`PickleError`.

source: Note that other exceptions may also be raised during unpickling, including (but not necessarily limited to) AttributeError, EOFError, ImportError, and IndexError.
fr: Veuillez noter que d'autres exceptions peuvent être levées durant la désérialisation, comme ``AttributeError``, ``EOFError``, ``ImportError`` et ``IndexError`` (liste non-exhaustive).

source: The :mod:`pickle` module exports three classes, :class:`Pickler`, :class:`Unpickler` and :class:`PickleBuffer`:
fr: Le module :mod:`pickle` exporte trois classes : :class:`Pickler`, :class:`Unpickler` et :class:`PickleBuffer`.

source: This takes a binary file for writing a pickle data stream.
fr: Classe d'objets qui implémentent la sérialisation vers un flux binaire.

source: The optional *protocol* argument, an integer, tells the pickler to use the given protocol; supported protocols are 0 to :data:`HIGHEST_PROTOCOL`. If not specified, the default is :data:`DEFAULT_PROTOCOL`. If a negative number is specified, :data:`HIGHEST_PROTOCOL` is selected.
fr: L'argument optionnel *protocol* détermine la version du protocole de sérialisation à employer, entre 0 et :data:`HIGHEST_PROTOCOL`. La valeur par défaut est celle de :data:`DEFAULT_PROTOCOL`. Avec un nombre strictement négatif, c'est :data:`HIGHEST_PROTOCOL` qui est utilisé.

source: The *file* argument must have a write() method that accepts a single bytes argument. It can thus be an on-disk file opened for binary writing, an :class:`io.BytesIO` instance, or any other custom object that meets this interface.
fr: L'argument *file* peut être un fichier sur disque ouvert en mode binaire pour l'écriture, une instance de la classe :class:`io.BytesIO`, ou plus généralement un objet quelconque qui possède une méthode ``write()`` acceptant d'être appelée sur un argument unique de type ``bytes``.

source: If *fix_imports* is true and *protocol* is less than 3, pickle will try to map the new Python 3 names to the old module names used in Python 2, so that the pickle data stream is readable with Python 2.
fr: Si *fix_imports* est vrai et *protocol* est inférieur ou égal à 2, les noms des modules sont reliés par *pickle* aux anciens noms qui avaient cours en Python 2, afin que le flux sérialisé soit lisible aussi bien par Python 2 que Python 3.

source: If *buffer_callback* is None (the default), buffer views are serialized into *file* as part of the pickle stream.
fr: Si *buffer_callback* vaut ``None`` (comme par défaut), les vues de tampon sont sérialisées dans *file* avec le reste du flux.

source: If *buffer_callback* is not None, then it can be called any number of times with a buffer view. If the callback returns a false value (such as None), the given buffer is :ref:`out-of-band <pickle-oob>`; otherwise the buffer is serialized in-band, i.e. inside the pickle stream.
fr: Dans le cas où le *buffer_callback* n'est pas ``None``, il doit pouvoir être appelé un nombre quelconque de fois avec une vue d'un tampon. S'il renvoie une valeur évaluée comme fausse (telle que ``None``), le tampon est considéré en marge de la sérialisation (ou « :ref:`hors-bande <pickle-oob>` »), sinon il est sérialisé dans le flux binaire.

source: It is an error if *buffer_callback* is not None and *protocol* is None or smaller than 5.
fr: Une erreur se produit si *buffer_callback* vaut autre chose que ``None`` et *protocol* est 4 ou inférieur, ou ``None``.
