Repository: python/python-docs-fr
Catalog: library/pickle.po
Languages: fr

source: A tuple of arguments for the callable object. An empty tuple must be given if the callable does not accept any argument.
fr: Un *n*-uplet d'arguments passés à cet objet appelable. Donnez un *n*-uplet vide si l'objet appelable n'accepte pas d'arguments.

source: Optionally, the object's state, which will be passed to the object's :meth:`__setstate__` method as previously described. If the object has no such method then, the value must be a dictionary and it will be added to the object's :attr:`~object.__dict__` attribute.
fr: L'état de l'objet, qui sera passé à la méthode :meth:`__setstate__` comme vu précédemment. Si la méthode n'existe pas, cet élément doit être un dictionnaire, et ses éléments compléteront l'attribut :attr:`~object.__dict__`.

source: Optionally, an iterator (and not a sequence) yielding successive items. These items will be appended to the object either using ``obj.append(item)`` or, in batch, using ``obj.extend(list_of_items)``. This is primarily used for list subclasses, but may be used by other classes as long as they have :meth:`append` and :meth:`extend` methods with the appropriate signature. (Whether :meth:`append` or :meth:`extend` is used depends on which pickle protocol version is used as well as the number of items to append, so both must be supported.)
fr: Un itérateur (non pas une séquence). Les éléments qu'il fournit sont ajoutés à l'objet un par un avec la méthode :meth:`append`, ou bien plusieurs à la fois avec la méthode :meth:`extend`. Ceci est principalement utile aux les classes héritant de ``list``, mais peut aussi servir sur d'autres classes, la seule contrainte étant qu'elles implémentent :meth:`append` et :meth:`extend` avec les bonnes signatures (l'une ou l'autre de ces méthodes est utilisée selon la version du protocole *pickle* et le nombre d'éléments à ajouter, c'est pourquoi elles doivent être définies toutes les deux).

source: Optionally, an iterator (not a sequence) yielding successive key-value pairs. These items will be stored to the object using ``obj[key] = value``. This is primarily used for dictionary subclasses, but may be used by other classes as long as they implement :meth:`__setitem__`.
fr: Un itérateur (non pas une séquence). Les éléments qu'il fournit doivent être des couples ``(clé, valeur)``. Ils sont ajoutés dans l'objet par affectation aux clés : ``objet[clé] = valeur``. Ceci est principalement utile aux classes héritant de ``dict``, mais peut servir à d'autres classes à la seule condition qu'elles implémentent la méthode :meth:`__setitem__`.

source: Optionally, a callable with a ``(obj, state)`` signature. This callable allows the user to programmatically control the state-updating behavior of a specific object, instead of using ``obj``'s static :meth:`__setstate__` method. If not ``None``, this callable will have priority over ``obj``'s :meth:`__setstate__`.
fr: Un objet appelable qui puisse recevoir en arguments l'objet et son état. Ceci permet de redéfinir le processus de reconstruction des attributs pour un objet en particulier, outrepassant la méthode :meth:`__setstate__`. Si cet objet appelable est fourni, :meth:`__setstate__` n'est pas appelée.

source: The optional sixth tuple item, ``(obj, state)``, was added.
fr: ajout du sixième élément.

source: Alternatively, a :meth:`__reduce_ex__` method may be defined. The only difference is this method should take a single integer argument, the protocol version. When defined, pickle will prefer it over the :meth:`__reduce__` method. In addition, :meth:`__reduce__` automatically becomes a synonym for the extended version. The main use for this method is to provide backwards-compatible reduce values for older Python releases.
fr: Il est également possible de définir une méthode :meth:`__reduce_ex__`. La seule différence est qu'elle prend la version du protocole en argument. Si elle est définie, elle prend le pas sur :meth:`__reduce__`. De plus, :meth:`__reduce__` devient automatiquement un alias pour sa version étendue. Cette méthode est principalement destinée à renvoyer des valeurs de réduction compatibles avec les versions anciennes de Python.

source: Persistence of External Objects
fr: Persistance d'objets externes

source: For the benefit of object persistence, the :mod:`pickle` module supports the notion of a reference to an object outside the pickled data stream. Such objects are referenced by a persistent ID, which should be either a string of alphanumeric characters (for protocol 0) [#]_ or just an arbitrary object (for any newer protocol).
fr: Pour les besoins de la persistance, :mod:`pickle` permet des références à des objets en dehors du flux sérialisé. Ils sont identifiés par un ID persistant. Le protocole 0 requiert que cet ID soit une chaîne de caractères alphanumériques [#]_. Les suivants autorisent un objet quelconque.

source: The resolution of such persistent IDs is not defined by the :mod:`pickle` module; it will delegate this resolution to the user-defined methods on the pickler and unpickler, :meth:`~Pickler.persistent_id` and :meth:`~Unpickler.persistent_load` respectively.
fr: :mod:`pickle` délègue la résolution des ID à des méthodes définies par l'utilisateur sur les objets sérialiseurs et désérialiseurs, à savoir :meth:`~Pickler.persistent_id` et :meth:`~Unpickler.persistent_load`.

source: To pickle objects that have an external persistent ID, the pickler must have a custom :meth:`~Pickler.persistent_id` method that takes an object as an argument and returns either ``None`` or the persistent ID for that object. When ``None`` is returned, the pickler simply pickles the object as normal. When a persistent ID string is returned, the pickler will pickle that object, along with a marker so that the unpickler will recognize it as a persistent ID.
fr: Pour affecter à des objets leurs ID persistants provenant d'une source externe, le sérialiseur doit posséder une méthode :meth:`~Pickler.persistent_id` qui prend un objet et renvoie soit ``None``, soit son ID. Si cette méthode renvoie ``None``, l'objet est sérialisé de la manière habituelle. Si un ID est renvoyé, sous forme de chaîne de caractères, c'est cette chaîne qui est sérialisée et elle est marquée de manière spéciale pour être reconnue comme un ID persistant.

source: To unpickle external objects, the unpickler must have a custom :meth:`~Unpickler.persistent_load` method that takes a persistent ID object and returns the referenced object.
fr: Pour désérialiser des objets identifiés par un ID externe, un désérialiseur doit posséder une méthode :meth:`~Unpickler.persistent_load` qui prend un ID et renvoie l'objet qu'il désigne.

source: Here is a comprehensive example presenting how persistent ID can be used to pickle external objects by reference.
fr: Voici un exemple complet qui montre comment sérialiser des objets externes en leur affectant des ID persistants.

source: Dispatch Tables
fr: Tables de distribution

source: If one wants to customize pickling of some classes without disturbing any other code which depends on pickling, then one can create a pickler with a private dispatch table.
fr: Pour personnaliser la sérialisation d'une classe à un endroit particulier sans affecter le reste du code, on peut créer un sérialiseur avec une table de distribution spécifique.

source: The global dispatch table managed by the :mod:`copyreg` module is available as :data:`copyreg.dispatch_table`. Therefore, one may choose to use a modified copy of :data:`copyreg.dispatch_table` as a private dispatch table.
fr: La table de distribution gérée par le module :mod:`copyreg` est disponible sous le nom :data:`copyreg.dispatch_table`. On peut donc utiliser une copie modifiée de :data:`copyreg.dispatch_table` comme table spécifique à un sérialiseur.

source: For example ::
fr: Par exemple, le code :

source: creates an instance of :class:`pickle.Pickler` with a private dispatch table which handles the ``SomeClass`` class specially. Alternatively, the code ::
fr: crée une instance de la classe :class:`pickle.Pickler` avec une table de distribution propre qui traite la classe ``SomeClass`` de manière spécifique. Le code :

source: Handling Stateful Objects
fr: Traitement des objets à état

source: Here's an example that shows how to modify pickling behavior for a class. The :class:`TextReader` class opens a text file, and returns the line number and line contents each time its :meth:`!readline` method is called. If a :class:`TextReader` instance is pickled, all attributes *except* the file object member are saved. When the instance is unpickled, the file is reopened, and reading resumes from the last location. The :meth:`__setstate__` and :meth:`__getstate__` methods are used to implement this behavior. ::
fr: L'exemple suivant illustre comment modifier la sérialisation pour une classe. La classe :class:`TextReader` ouvre un fichier de texte, et sa méthode :meth:`!readline` renvoie le numéro de la ligne suivante et son contenu chaque fois qu'elle est appelée. Si une instance de :class:`TextReader` est sérialisée, tous les attributs *sauf* le fichier ouvert sont enregistrés. Lorsque l'instance est désérialisée, le fichier est rouvert et la lecture reprend là où elle s'était arrêtée. Ceci est implémenté à travers les méthodes :meth:`__setstate__` et :meth:`__getstate__`.

source: A sample usage might be something like this::
fr: Voici un exemple d'utilisation :

source: Custom Reduction for Types, Functions, and Other Objects
fr: Réduction personnalisée pour les types, fonctions et autres objets

source: Sometimes, :attr:`~Pickler.dispatch_table` may not be flexible enough. In particular we may want to customize pickling based on another criterion than the object's type, or we may want to customize the pickling of functions and classes.
fr: Parfois, la simple utilisation de :attr:`~Pickler.dispatch_table` n'offre pas assez de flexibilité. On peut vouloir changer la méthode de sérialisation selon d'autres critères que le type de l'objet, ou bien personnaliser la sérialisation des fonctions et des classes.

source: For those cases, it is possible to subclass from the :class:`Pickler` class and implement a :meth:`~Pickler.reducer_override` method. This method can return an arbitrary reduction tuple (see :meth:`__reduce__`). It can alternatively return ``NotImplemented`` to fallback to the traditional behavior.
fr: Dans ces cas, il est possible d'écrire une méthode :meth:`~Pickler.reducer_override` dans une classe fille de :class:`Pickler`. Cette méthode renvoie un *n*-uplet de réduction arbitraire (voir :meth:`__reduce__`). Elle peut aussi renvoyer ``NotImplemented``, auquel cas la méthode habituelle de réduction par table s'applique.

source: If both the :attr:`~Pickler.dispatch_table` and :meth:`~Pickler.reducer_override` are defined, then :meth:`~Pickler.reducer_override` method takes priority.
fr: Si :attr:`~Pickler.dispatch_table` et :meth:`~Pickler.reducer_override` sont tous les deux définis, :meth:`~Pickler.reducer_override` a la priorité.

source: For performance reasons, :meth:`~Pickler.reducer_override` may not be called for the following objects: ``None``, ``True``, ``False``, and exact instances of :class:`int`, :class:`float`, :class:`bytes`, :class:`str`, :class:`dict`, :class:`set`, :class:`frozenset`, :class:`list` and :class:`tuple`.
fr: Pour des raisons de performance, la méthode :meth:`~Pickler.reducer_override` n'est jamais appelée sur ``None``, ``True``, ``False``, ainsi que les instances exactes (pas dérivées) de :class:`int`, :class:`float`, :class:`bytes`, :class:`str`, :class:`dict`, :class:`set`, :class:`frozenset`, :class:`list` et :class:`tuple`.

source: Here is a simple example where we allow pickling and reconstructing a given class::
fr: Voici un exemple simple qui implémente la sérialisation d'une classe :

source: Out-of-band Buffers
fr: Tampons hors-bande

source: In some contexts, the :mod:`pickle` module is used to transfer massive amounts of data. Therefore, it can be important to minimize the number of memory copies, to preserve performance and resource consumption. However, normal operation of the :mod:`pickle` module, as it transforms a graph-like structure of objects into a sequential stream of bytes, intrinsically involves copying data to and from the pickle stream.
fr: Le module :mod:`pickle` est parfois utilisé pour transférer des quantités énormes de données. Il peut devenir important de réduire les copies de mémoire au minimum pour préserver la performance et diminuer l'usage des ressources matérielles. Cependant, dans son contexte courant d'utilisation, le module :mod:`pickle` effectue des copies depuis et vers le flux de données pour les besoins de la conversion de structures d'objets semblables à des graphes en flux séquentiels d'octets.

source: This constraint can be eschewed if both the *provider* (the implementation of the object types to be transferred) and the *consumer* (the implementation of the communications system) support the out-of-band transfer facilities provided by pickle protocol 5 and higher.
fr: Cette contrainte peut être levée si le *producteur* (qui implémente les types d'objets à transférer) et le *consommateur* (qui implémente le système de communication) emploient les possibilités de transfert hors-bande offertes par les protocoles 5 et suivants.

source: Provider API
fr: API des producteurs

source: The large data objects to be pickled must implement a :meth:`__reduce_ex__` method specialized for protocol 5 and higher, which returns a :class:`PickleBuffer` instance (instead of e.g. a :class:`bytes` object) for any large data.
fr: Les objets de grande taille à sérialiser doivent posséder une méthode :meth:`__reduce_ex__` qui, lorsqu'elle est appelée pour le protocole 5 ou plus, renvoie un objet :class:`PickleBuffer` au lieu d'un objet :class:`bytes` dès que la taille le justifie.

source: A :class:`PickleBuffer` object *signals* that the underlying buffer is eligible for out-of-band data transfer. Those objects remain compatible with normal usage of the :mod:`pickle` module. However, consumers can also opt-in to tell :mod:`pickle` that they will handle those buffers by themselves.
fr: Les objets :class:`PickleBuffer` ne font que signaler que leur tampon permet le transfert hors-bande. Ils demeurent compatibles avec l'utilisation classique du module :mod:`pickle`. Cependant, les consommateurs peuvent aussi choisir d'indiquer à :mod:`pickle` qu'ils gèrent eux-mêmes ces tampons.

source: Consumer API
fr: API des consommateurs

source: A communications system can enable custom handling of the :class:`PickleBuffer` objects generated when serializing an object graph.
fr: Un système de communication peut gérer de manière spécifique les objets :class:`PickleBuffer` générés lors de la sérialisation d'un réseau d'objets.

source: On the sending side, it needs to pass a *buffer_callback* argument to :class:`Pickler` (or to the :func:`dump` or :func:`dumps` function), which will be called with each :class:`PickleBuffer` generated while pickling the object graph. Buffers accumulated by the *buffer_callback* will not see their data copied into the pickle stream, only a cheap marker will be inserted.
fr: Du côté de l'expéditeur, il faut passer le paramètre *buffer_callback* à :class:`Pickler` (ou à :func:`dump` ou :func:`dumps`). Le *buffer_callback* sera appelé avec chaque :class:`PickleBuffer` généré lors de la sérialisation du réseau d'objets. Les tampons accumulés par le *buffer_callback* ne verront pas leurs données copiées dans le flux sérialisé. Il leur sera substitué un marqueur léger.

source: On the receiving side, it needs to pass a *buffers* argument to :class:`Unpickler` (or to the :func:`load` or :func:`loads` function), which is an iterable of the buffers which were passed to *buffer_callback*. That iterable should produce buffers in the same order as they were passed to *buffer_callback*. Those buffers will provide the data expected by the reconstructors of the objects whose pickling produced the original :class:`PickleBuffer` objects.
fr: Du côté du receveur, il faut passer l'argument *buffers* à :class:`Unpickler` (ou :func:`load` ou bien :func:`loads`). *buffers* est un itérable des tampons passés à *buffer_callback*. Il doit fournir les tampons dans le même ordre que celui dans lequel ils ont été passés à *buffer_callback*. Les tampons fournis constituent la source des données qu'attendent les reconstructeurs des objets dont la sérialisation a abouti aux objets :class:`PickleBuffer`.

source: Between the sending side and the receiving side, the communications system is free to implement its own transfer mechanism for out-of-band buffers. Potential optimizations include the use of shared memory or datatype-dependent compression.
fr: Entre expéditeur et receveur, le système de communication peut implémenter son propre mécanisme de transfert pour les tampons hors-bande. Parmi les optimisations possibles se trouvent l'utilisation de mémoire partagée et la compression spécifique au type de données.

source: Example
fr: Exemple

source: Here is a trivial example where we implement a :class:`bytearray` subclass able to participate in out-of-band buffer pickling::
fr: Voici un exemple trivial où est implémentée une classe fille de :class:`bytearray` capable de sérialisation hors-bande.

source: The reconstructor (the ``_reconstruct`` class method) returns the buffer's providing object if it has the right type. This is an easy way to simulate zero-copy behaviour on this toy example.
fr: Lorsqu'il rencontre le bon type, le reconstructeur (la méthode de classe ``_reconstruct``) renvoie directement le tampon original. Il s'agit d'une manière simple de simuler l'absence de copie dans cet exemple simpliste.

source: On the consumer side, we can pickle those objects the usual way, which when unserialized will give us a copy of the original object::
fr: En tant que consommateur des objets, on peut les sérialiser de la manière classique. La désérialisation conduit alors à une copie.

source: But if we pass a *buffer_callback* and then give back the accumulated buffers when unserializing, we are able to get back the original object::
fr: Mais en passant un *buffer_callback* et en donnant les tampons accumulés au désérialiseur, il n'y a plus de copie.

source: This example is limited by the fact that :class:`bytearray` allocates its own memory: you cannot create a :class:`bytearray` instance that is backed by another object's memory. However, third-party datatypes such as NumPy arrays do not have this limitation, and allow use of zero-copy pickling (or making as few copies as possible) when transferring between distinct processes or systems.
fr: Cet exemple est limité par le fait que :class:`bytearray` effectue sa propre allocation de mémoire. Il n'est pas possible de créer un :class:`bytearray` sur la mémoire d'un autre objet. Cependant, certains types de données que l'on trouve dans des bibliothèques externes, comme les tableaux NumPy, n'ont pas cette limitation. Le passage hors-bande permet alors de n'effectuer aucune copie (ou bien de minimiser le nombre de copies) lors du transfert de données d'un système à l'autre ou d'un processus à l'autre.

source: :pep:`574` -- Pickle protocol 5 with out-of-band data
fr: :pep:`574` — Protocole *pickle* 5 avec données hors-bande

source: Restricting Globals
fr: Restriction des noms dans l'espace de nommage global

source: By default, unpickling will import any class or function that it finds in the pickle data. For many applications, this behaviour is unacceptable as it permits the unpickler to import and invoke arbitrary code. Just consider what this hand-crafted pickle data stream does when loaded::
fr: Par défaut, la désérialisation importe toutes les classes ou fonctions que demande le flux de données. Dans bien des cas, ce comportement est inacceptable, puisqu'il permet de faire exécuter du code arbitraire dans l'environnement de désérialisation. Observez le résultat de ce flux de données fait-main lorsqu'il est lu :

source: In this example, the unpickler imports the :func:`os.system` function and then apply the string argument "echo hello world". Although this example is inoffensive, it is not difficult to imagine one that could damage your system.
fr: Dans cet exemple, le désérialiseur importe la fonction :func:`os.system` et l'applique à la chaîne de caractères ``"echo hello world"``. C'est inoffensif, mais il n'est pas difficile d'imaginer des variantes qui endommageraient le système.

source: For this reason, you may want to control what gets unpickled by customizing :meth:`Unpickler.find_class`. Unlike its name suggests, :meth:`Unpickler.find_class` is called whenever a global (i.e., a class or a function) is requested. Thus it is possible to either completely forbid globals or restrict them to a safe subset.
fr: C'est pour cette raison qu'il s'avère parfois nécessaire de contrôler ce qui peut être désérialisé. Cela est possible en redéfinissant la méthode :meth:`Unpickler.find_class`. Contrairement à ce que son nom laisse penser, :meth:`Unpickler.find_class` est appelée pour tous les noms à chercher dans l'espace de nommage global, ce qui inclut les classes mais aussi les fonctions. Par ce biais, il est possible d'interdire complètement la résolution des noms globaux ou de la restreindre à un sous-ensemble que l'on considère sûr.

source: Here is an example of an unpickler allowing only few safe classes from the :mod:`builtins` module to be loaded::
fr: Voici un exemple de désérialiseur qui permet seulement la désérialisation d'un petit nombre de classes sûres du module :mod:`builtins`.

source: As our examples shows, you have to be careful with what you allow to be unpickled. Therefore if security is a concern, you may want to consider alternatives such as the marshalling API in :mod:`xmlrpc.client` or third-party solutions.
fr: Comme le montre l'exemple, il faut faire attention aux objets que l'on autorise à être désérialisés. Si la sécurité est une priorité, il peut être sage de se tourner vers des alternatives comme l'API du module :mod:`xmlrpc.client`, ou des bibliothèques tierces.

source: Performance
fr: Performances

source: Examples
fr: Exemples

source: For the simplest code, use the :func:`dump` and :func:`load` functions. ::
fr: Dans les cas les plus simples, utilisez les fonctions :func:`dump` et :func:`load`.

source: The following example reads the resulting pickled data. ::
fr: Le code suivant lit les données qui viennent d'être sérialisées :

source: Pickle interface constructor registration for extension types.
fr: Enregistre les fonctions de sérialisation pour les types définis par l'utilisateur.

source: Tools for working with and analyzing pickled data.
fr: Outils pour travailler sur les données sérialisées et les analyser.

source: Indexed databases of objects; uses :mod:`pickle`.
fr: Bases de données indexées (module fondé sur :mod:`pickle`).

source: Shallow and deep object copying.
fr: Copie superficielle ou récursive d'objets.

source: High-performance serialization of built-in types.
fr: Sérialisation haute-performance des types natifs.

source: Footnotes
fr: Notes

source: Don't confuse this with the :mod:`marshal` module
fr: À ne pas confondre avec ce que fait le module :mod:`marshal`.

source: This is why :keyword:`lambda` functions cannot be pickled: all :keyword:`!lambda` functions share the same name: ``<lambda>``.
fr: C'est la raison pour laquelle les fonctions :keyword:`lambda` ne peuvent pas être sérialisées : elles partagent toutes le même nom, à savoir ``<lambda>``.

source: The exception raised will likely be an :exc:`ImportError` or an :exc:`AttributeError` but it could be something else.
fr: L'exception levée est généralement de type :exc:`ImportError` ou :exc:`AttributeError`, mais ce n'est pas systématique.
