Repository: python/python-docs-fr
Catalog: library/pickle.po
Languages: fr

source: The :mod:`copy` module uses this protocol for shallow and deep copying operations.
fr: Le module :mod:`copy` fait appel à ce protocole pour les opérations de copie superficielle comme récursive.
