Repository: python/python-docs-fr
Catalog: library/pickle.po
Languages: fr

source: Write the pickled representation of *obj* to the open file object given in the constructor.
fr: Écrit la représentation sérialisée de l'objet *obj* dans le fichier ouvert passé au constructeur.

source: Do nothing by default. This exists so a subclass can override it.
fr: Ne fait rien par défaut. Cette méthode est destinée à être implémentée par une classe fille.

source: If :meth:`persistent_id` returns ``None``, *obj* is pickled as usual. Any other value causes :class:`Pickler` to emit the returned value as a persistent ID for *obj*. The meaning of this persistent ID should be defined by :meth:`Unpickler.persistent_load`. Note that the value returned by :meth:`persistent_id` cannot itself have a persistent ID.
fr: Si :meth:`persistent_id` renvoie ``None``, *obj* est sérialisé normalement. Toute autre valeur est reprise par le :class:`Pickler` comme ID persistant pour *obj*. Le sens de cet ID persistant doit être défini par :meth:`Unpickler.persistent_load`. Veuillez noter que la valeur renvoyée par :meth:`persistent_id` ne peut pas porter elle-même d'ID persistant.

source: See :ref:`pickle-persistent` for details and examples of uses.
fr: La section :ref:`pickle-persistent` donne des détails et exemples.

source: A pickler object's dispatch table is a registry of *reduction functions* of the kind which can be declared using :func:`copyreg.pickle`. It is a mapping whose keys are classes and whose values are reduction functions. A reduction function takes a single argument of the associated class and should conform to the same interface as a :meth:`__reduce__` method.
fr: La table de distribution d'un sérialiseur est un tableau associatif dont les clés sont des classes et les valeurs, des fonctions de réduction. La manière la plus directe de déclarer une fonction de réduction est la fonction :func:`copyreg.pickle`. Une fonction de réduction prend un unique argument, qui doit être de la classe en question, et obéit à la même interface qu'une méthode :meth:`__reduce__`.

source: By default, a pickler object will not have a :attr:`dispatch_table` attribute, and it will instead use the global dispatch table managed by the :mod:`copyreg` module. However, to customize the pickling for a specific pickler object one can set the :attr:`dispatch_table` attribute to a dict-like object. Alternatively, if a subclass of :class:`Pickler` has a :attr:`dispatch_table` attribute then this will be used as the default dispatch table for instances of that class.
fr: Lorsqu'un sérialiseur ne possède pas l'attribut :attr:`dispatch_table`, comme c'est le cas par défaut, il utilise le tableau global du module :mod:`copyreg`. Afin de personnaliser l'opération de sérialisation pour un sérialiseur particulier, on peut affecter à son attribut :attr:`dispatch_table` un objet compatible avec les dictionnaires. Une autre possibilité est de définir l'attribut :attr:`dispatch_table` dans une classe fille de :class:`Pickler`. Sa valeur sera alors utilisée pour toutes les instances de cette classe fille.

source: See :ref:`pickle-dispatch` for usage examples.
fr: Voir :ref:`pickle-dispatch` pour des exemples d'utilisation.

source: Special reducer that can be defined in :class:`Pickler` subclasses. This method has priority over any reducer in the :attr:`dispatch_table`. It should conform to the same interface as a :meth:`__reduce__` method, and can optionally return ``NotImplemented`` to fallback on :attr:`dispatch_table`-registered reducers to pickle ``obj``.
fr: Réducteur spécial, qui peut se définir dans une classe fille de :class:`Pickler`. Cette méthode doit se conformer à l'interface des méthodes :meth:`__reduce__`. Elle prend en général le pas sur les réducteurs contenus dans l'attribut :attr:`dispatch_table`. Cependant, elle peut choisir de renvoyer ``NotImplemented`` pour que :attr:`dispatch_table` soit utilisé à la place.

source: For a detailed example, see :ref:`reducer_override`.
fr: Voir :ref:`reducer_override` pour un exemple détaillé.

source: Deprecated. Enable fast mode if set to a true value. The fast mode disables the usage of memo, therefore speeding the pickling process by not generating superfluous PUT opcodes. It should not be used with self-referential objects, doing otherwise will cause :class:`Pickler` to recurse infinitely.
fr: Cet attribut est obsolète. Une valeur vraie (« mode rapide ») désactive la mémorisation des objets au fur et à mesure de leur sérialisation, qui permet habituellement de représenter les doublons par une unique référence. Cette option accélère la sérialisation en évitant des *opcodes* PUT superflus. Elle ne doit pas être utilisée sur un objet contenant une référence à lui-même, car le :class:`Pickler` entre alors dans une récursion infinie.

source: Use :func:`pickletools.optimize` if you need more compact pickles.
fr: Utilisez plutôt :func:`pickletools.optimize` pour obtenir des données sérialisées plus compactes.

source: This takes a binary file for reading a pickle data stream.
fr: Les objets de cette classe sont des désérialiseurs, qui lisent un flux de données pour le convertir en objet.

source: The protocol version of the pickle is detected automatically, so no protocol argument is needed.
fr: Il n'y a nul besoin d'argument *protocol*. La version du protocole avec lequel sont encodées les données est déterminée automatiquement.

source: The argument *file* must have three methods, a read() method that takes an integer argument, a readinto() method that takes a buffer argument and a readline() method that requires no arguments, as in the :class:`io.BufferedIOBase` interface. Thus *file* can be an on-disk file opened for binary reading, an :class:`io.BytesIO` object, or any other custom object that meets this interface.
fr: L'argument *file* doit posséder trois méthodes qui proviennent de l'interface de :class:`io.BufferedIOBase`. Ce sont : ``read()``, prenant un entier, ``readinto()``, prenant un tampon, et ``readline()``, sans arguments. *file* peut donc être aussi bien un fichier sur disque ouvert en mode lecture binaire qu'un objet :class:`io.BytesIO`, ou un objet quelconque vérifiant ces critères.

source: The optional arguments *fix_imports*, *encoding* and *errors* are used to control compatibility support for pickle stream generated by Python 2. If *fix_imports* is true, pickle will try to map the old Python 2 names to the new names used in Python 3. The *encoding* and *errors* tell pickle how to decode 8-bit string instances pickled by Python 2; these default to 'ASCII' and 'strict', respectively. The *encoding* can be 'bytes' to read these 8-bit string instances as bytes objects. Using ``encoding='latin1'`` is required for unpickling NumPy arrays and instances of :class:`~datetime.datetime`, :class:`~datetime.date` and :class:`~datetime.time` pickled by Python 2.
fr: Les paramètres facultatifs *fix_imports*, *encoding* et *errors* sont dédiés à la compatibilité de la désérialisation avec les flux binaires générés par Python 2. Si *fix_imports* est vrai, *pickle* tente de modifier les anciens noms des modules que l'on trouve en Python 2, pour les remplacer par ceux en usage en Python 3. Les paramètres *encoding* et *errors* contrôlent la façon de décoder les chaînes de caractères 8 bits. Leurs valeurs par défaut respectives sont ``'ASCII'`` et ``'strict'``. *encoding* peut être mis à ``'bytes'`` pour lire des chaînes d'octets en tant que *bytes*. Il doit être mis à ``'latin1'`` pour désérialiser des tableaux NumPy ou des instances de :class:`~datetime.datetime`, :class:`~datetime.date` et :class:`~datetime.time` sérialisées par Python 2.

source: If *buffers* is None (the default), then all data necessary for deserialization must be contained in the pickle stream. This means that the *buffer_callback* argument was None when a :class:`Pickler` was instantiated (or when :func:`dump` or :func:`dumps` was called).
fr: Si *buffers* vaut None (comme par défaut), toutes les données nécessaires à la désérialisation doivent être contenues dans le flux binaire. Ceci signifie que l'argument *buffer_callback* valait None lors de la construction du :class:`Pickler` (ou dans l'appel à :func:`dump` ou :func:`dumps`).

source: Read the pickled representation of an object from the open file object given in the constructor, and return the reconstituted object hierarchy specified therein. Bytes past the pickled representation of the object are ignored.
fr: Lit la représentation sérialisée d'un objet depuis le fichier ouvert passé au constructeur, et reconstitue l'objet qui y est stocké, avec tous les objets qu'il contient. Les octets situés au-delà de la fin de la représentation binaire sont ignorés.

source: Raise an :exc:`UnpicklingError` by default.
fr: Par défaut, cette méthode lève une exception :exc:`UnpicklingError`.

source: If defined, :meth:`persistent_load` should return the object specified by the persistent ID *pid*. If an invalid persistent ID is encountered, an :exc:`UnpicklingError` should be raised.
fr: Si elle est définie autrement dans une sous-classe, :meth:`persistent_load` doit renvoyer l'objet correspondant à l'ID persistant *pid*. Si celui-ci est invalide, elle doit lever une exception :exc:`UnpicklingError`.

source: Import *module* if necessary and return the object called *name* from it, where the *module* and *name* arguments are :class:`str` objects. Note, unlike its name suggests, :meth:`find_class` is also used for finding functions.
fr: Importe *module* si besoin, et renvoie l'objet du nom *name* qu'il contient. *module* et *name* sont des chaînes de caractères (classe :class:`str`). Contrairement à ce que son nom laisse penser, :meth:`find_class` est également appelée pour trouver les fonctions.

source: Subclasses may override this to gain control over what type of objects and how they can be loaded, potentially reducing security risks. Refer to :ref:`pickle-restrict` for details.
fr: Les classes filles peuvent redéfinir cette méthode pour restreindre la désérialisation à certains types d'objets ou à d'autres conditions, notamment en vue de réduire les risques de sécurité. Voir :ref:`pickle-restrict` pour plus de détails.

source: Raises an :ref:`auditing event <auditing>` ``pickle.find_class`` with arguments ``module``, ``name``.
fr: Lève un :ref:`événement d'audit <auditing>` ``pickle.find_class`` avec les arguments ``module`` et ``name``.

source: A wrapper for a buffer representing picklable data. *buffer* must be a :ref:`buffer-providing <bufferobjects>` object, such as a :term:`bytes-like object` or a N-dimensional array.
fr: Encapsule un objet tampon contenant des données sérialisables. *buffer* doit être un objet prenant en charge le :ref:`protocole tampon <bufferobjects>`, comme un :term:`objet octet-compatible <bytes-like object>` ou un tableau n-dimensionnel.

source: :class:`PickleBuffer` is itself a buffer provider, therefore it is possible to pass it to other APIs expecting a buffer-providing object, such as :class:`memoryview`.
fr: Les objets :class:`PickleBuffer` savent gérer le protocole tampon. Il est donc possible de les passer à d'autres API qui attendent un tampon, comme :class:`memoryview`.

source: :class:`PickleBuffer` objects can only be serialized using pickle protocol 5 or higher. They are eligible for :ref:`out-of-band serialization <pickle-oob>`.
fr: Les objets :class:`PickleBuffer` ne peuvent être sérialisés qu'avec le protocole 5 ou supérieur. Ils sont susceptibles d'être sérialisés :ref:`hors-bande <pickle-oob>`.

source: Return a :class:`memoryview` of the memory area underlying this buffer. The returned object is a one-dimensional, C-contiguous memoryview with format ``B`` (unsigned bytes). :exc:`BufferError` is raised if the buffer is neither C- nor Fortran-contiguous.
fr: Renvoie une :class:`memoryview` de l'espace mémoire sous-jacent à ce tampon. La *memoryview* renvoyée est unidimensionnelle et C-contiguë. Elle a le format ``B`` (octets sans signe). :exc:`BufferError` est levée si le tampon n'est ni C-contigu, ni Fortran-contigu.

source: What can be pickled and unpickled?
fr: Quels objets sont sérialisables ?

source: The following types can be pickled:
fr: Les objets des types suivants peuvent être sérialisés :

source: instances of such classes whose :attr:`~object.__dict__` or the result of calling :meth:`__getstate__` is picklable (see section :ref:`pickle-inst` for details).
fr: les instances de telles classes, à condition que leur :attr:`~object.__dict__`, ou la valeur de retour de :meth:`__getstate__`, soit sérialisable (voir :ref:`pickle-inst` pour plus d'informations).

source: Attempts to pickle unpicklable objects will raise the :exc:`PicklingError` exception; when this happens, an unspecified number of bytes may have already been written to the underlying file. Trying to pickle a highly recursive data structure may exceed the maximum recursion depth, a :exc:`RecursionError` will be raised in this case. You can carefully raise this limit with :func:`sys.setrecursionlimit`.
fr: Si vous essayez de sérialiser un objet qui ne peut pas l'être, une exception de type :exc:`PicklingError` est levée. Lorsque cela se produit, il est possible qu'un certain nombre d'octets aient déjà été écrits dans le fichier ou flux. La sérialisation d'une structure de donnée avec de nombreux niveaux d'imbrication peut lever une exception :exc:`RecursionError`. Pour augmenter la limite (avec précaution), voir :func:`sys.setrecursionlimit`.

source: Similarly, when class instances are pickled, their class's code and data are not pickled along with them. Only the instance data are pickled. This is done on purpose, so you can fix bugs in a class or add methods to the class and still load objects that were created with an earlier version of the class. If you plan to have long-lived objects that will see many versions of a class, it may be worthwhile to put a version number in the objects so that suitable conversions can be made by the class's :meth:`__setstate__` method.
fr: De même, lorsque les instances d'une certaine classe sont sérialisées, seuls les attributs de l'instance sont inclus, mais pas le code de leur classe ni les données qu'elle pourrait contenir. Ceci est intentionnel : vous pouvez corriger des bogues dans une classe ou ajouter des méthodes, et désérialiser malgré tout des objets instanciés avec une version plus ancienne de la classe. Si vous stockez des objets destinés être conservés pendant longtemps, et que leur classe est susceptible de connaître de nombreuses évolutions, il peut s'avérer utile d'associer aux objets un numéro de version afin que des conversions puissent être implémentées dans la méthode :meth:`__setstate__` de la classe.

source: Pickling Class Instances
fr: Sérialisation des instances d'une classe

source: In this section, we describe the general mechanisms available to you to define, customize, and control how class instances are pickled and unpickled.
fr: Dans cette section sont décrits les mécanismes généraux qui s'offrent à vous pour définir, personnaliser et contrôler la manière dont les instances d'une classe sont sérialisées et désérialisées.

source: In most cases, no additional code is needed to make instances picklable. By default, pickle will retrieve the class and the attributes of an instance via introspection. When a class instance is unpickled, its :meth:`__init__` method is usually *not* invoked. The default behaviour first creates an uninitialized instance and then restores the saved attributes. The following code shows an implementation of this behaviour::
fr: Dans la plupart des cas, il n'y a besoin de rien pour que les instances d'une classe puissent être sérialisées. Par défaut, *pickle* accède à la classe et aux attributs de l'instance par introspection. Lorsqu'une instance est désérialisée, sa méthode :meth:`__init__` n'est normalement *pas* appelée. Une nouvelle instance est créée sans être initialisée, et ses attributs sont simplement restaurés à partir des valeurs conservées. En d'autres termes, les opérations sont celles qu'effectue le code suivant ::

source: Classes can alter the default behaviour by providing one or several special methods:
fr: Les classes peuvent personnaliser le comportement par défaut en définissant des méthodes spéciales :

source: In protocols 2 and newer, classes that implements the :meth:`__getnewargs_ex__` method can dictate the values passed to the :meth:`__new__` method upon unpickling. The method must return a pair ``(args, kwargs)`` where *args* is a tuple of positional arguments and *kwargs* a dictionary of named arguments for constructing the object. Those will be passed to the :meth:`__new__` method upon unpickling.
fr: Dans les protocoles 2 et suivants, les classes peuvent personnaliser les valeurs passées à la méthode :meth:`__new__` lors de la désérialisation. Elles le font en définissant une méthode :meth:`__getnewargs_ex__` qui renvoie un couple ``(args, kwargs)``, où *args* est un *n*-uplet des arguments positionnels et *kwargs* un dictionnaire des arguments nommés qui seront passés à :meth:`__new__` — autrement dit, l'appel sera ``classe.__new__(*args, **kwargs)``.

source: You should implement this method if the :meth:`__new__` method of your class requires keyword-only arguments. Otherwise, it is recommended for compatibility to implement :meth:`__getnewargs__`.
fr: Définissez cette méthode seulement si la méthode :meth:`__new__` de votre classe demande des arguments nommés. Dans le cas contraire, mieux vaut définir :meth:`__getnewargs__` pour préserver la compatibilité avec les protocoles anciens.

source: :meth:`__getnewargs_ex__` is now used in protocols 2 and 3.
fr: :meth:`__getnewargs_ex__` est désormais appelée dans les protocoles 2 et 3.

source: This method serves a similar purpose as :meth:`__getnewargs_ex__`, but supports only positional arguments. It must return a tuple of arguments ``args`` which will be passed to the :meth:`__new__` method upon unpickling.
fr: Comme :meth:`__getnewargs_ex__`, mais ne permet que les arguments positionnels. Cette méthode doit renvoyer le *n*-uplet ``args`` des arguments passés à :meth:`__new__` lors de la désérialisation : l'appel sera ``classe.__new__(*args)``.

source: :meth:`__getnewargs__` will not be called if :meth:`__getnewargs_ex__` is defined.
fr: Si :meth:`__getnewargs_ex__` est définie, elle prend la priorité et :meth:`__getnewargs__` n'est jamais appelée.

source: Before Python 3.6, :meth:`__getnewargs__` was called instead of :meth:`__getnewargs_ex__` in protocols 2 and 3.
fr: Auparavant, :meth:`__getnewargs__` était appelée au lieu de :meth:`__getnewargs_ex__` dans les protocoles 2 et 3.

source: Classes can further influence how their instances are pickled; if the class defines the method :meth:`__getstate__`, it is called and the returned object is pickled as the contents for the instance, instead of the contents of the instance's dictionary. If the :meth:`__getstate__` method is absent, the instance's :attr:`~object.__dict__` is pickled as usual.
fr: Des personnalisations plus poussées de la sérialisation sont possibles à l'aide de la méthode :meth:`__getstate__`. Lorsque :meth:`__getstate__` est définie, l'objet qu'elle renvoie (état de l'instance) est sérialisé en lieu et place du :attr:`~object.__dict__`, le dictionnaire des attributs de l'instance.

source: Upon unpickling, if the class defines :meth:`__setstate__`, it is called with the unpickled state. In that case, there is no requirement for the state object to be a dictionary. Otherwise, the pickled state must be a dictionary and its items are assigned to the new instance's dictionary.
fr: Lors de la désérialisation, l'état de l'instance est passé à la méthode :meth:`__setstate__`, si elle est définie (l'objet *state* n'a pas besoin d'être un dictionnaire). Si elle ne l'est pas, les attributs de l'objet sont tirés de l'état, qui dans ce cas doit être obligatoirement un dictionnaire.

source: If :meth:`__getstate__` returns a false value, the :meth:`__setstate__` method will not be called upon unpickling.
fr: Si :meth:`__getstate__` renvoie une valeur fausse, :meth:`__setstate__` ne sera pas appelée à la désérialisation.

source: Refer to the section :ref:`pickle-state` for more information about how to use the methods :meth:`__getstate__` and :meth:`__setstate__`.
fr: Voir :ref:`pickle-state` pour plus d'informations sur :meth:`__getstate__` et :meth:`__setstate__`.

source: At unpickling time, some methods like :meth:`__getattr__`, :meth:`__getattribute__`, or :meth:`__setattr__` may be called upon the instance. In case those methods rely on some internal invariant being true, the type should implement :meth:`__new__` to establish such an invariant, as :meth:`__init__` is not called when unpickling an instance.
fr: Lors de la désérialisation, des méthodes comme :meth:`__getattr__`, :meth:`__getattribute__` et :meth:`__setattr__` sont susceptibles d'être appelées sur l'instance. Si ces méthodes reposent sur des invariants internes à l'objet, leur classe doit les initialiser dans la méthode :meth:`__new__`, puisque la méthode :meth:`__init__` n'est pas appelée.

source: As we shall see, pickle does not use directly the methods described above. In fact, these methods are part of the copy protocol which implements the :meth:`__reduce__` special method. The copy protocol provides a unified interface for retrieving the data necessary for pickling and copying objects. [#]_
fr: Comme nous le verrons, *pickle* ne fait pas directement appel aux méthodes ci-dessus. En réalité, elles font partie du protocole de copie, qui implémente la méthode spéciale :meth:`__reduce__`. Ce protocole constitue une interface unifiée pour l'accès aux données nécessaires à la sérialisation comme à la copie [#]_.

source: Although powerful, implementing :meth:`__reduce__` directly in your classes is error prone. For this reason, class designers should use the high-level interface (i.e., :meth:`__getnewargs_ex__`, :meth:`__getstate__` and :meth:`__setstate__`) whenever possible. We will show, however, cases where using :meth:`__reduce__` is the only option or leads to more efficient pickling or both.
fr: Bien que la méthode :meth:`__reduce__` ouvre davantage de possibilités, elle conduit plus facilement à des erreurs. C'est pourquoi les auteurs de classes sont encouragés à utiliser lorsque c'est possible l'interface de plus haut niveau avec :meth:`__getnewargs_ex__`, :meth:`__getstate__` et :meth:`__state__`. Cependant, il existe des cas où l'on ne peut pas se passer de :meth:`__reduce__`, ou bien elle permet une sérialisation plus efficace.

source: The interface is currently defined as follows. The :meth:`__reduce__` method takes no argument and shall return either a string or preferably a tuple (the returned object is often referred to as the "reduce value").
fr: Voici l'interface de la méthode :meth:`__reduce__`. Elle ne prend aucun argument et renvoie soit une chaîne de caractères, soit (c'est conseillé) un *n*-uplet. On appelle souvent l'objet renvoyé « valeur de réduction ».

source: When a tuple is returned, it must be between two and six items long. Optional items can either be omitted, or ``None`` can be provided as their value. The semantics of each item are in order:
fr: Si c'est un *n*-uplet qui est renvoyé, ses éléments sont interprétés dans l'ordre comme suit. Les deux premiers éléments sont obligatoires, les quatre suivants sont facultatifs et peuvent être simplement omis, ou bien mis à ``None``. Les éléments sont, dans l'ordre :

source: A callable object that will be called to create the initial version of the object.
fr: Un objet appelable qui sera appelé pour créer l'objet initial.
