Repository: python/python-docs-fr
Catalog: library/pipes.po
Languages: fr

source: :mod:`pipes` --- Interface to shell pipelines
fr: :mod:`pipes` — Interface au *pipelines* shell

source: **Source code:** :source:`Lib/pipes.py`
fr: **Code source :** :source:`Lib/pipes.py`

source: The :mod:`pipes` module defines a class to abstract the concept of a *pipeline* --- a sequence of converters from one file to another.
fr: Le module :mod:`pipes` définit une classe permettant d'abstraire le concept de *pipeline* --- une séquence de convertisseurs d'un fichier vers un autre.

source: Because the module uses :program:`/bin/sh` command lines, a POSIX or compatible shell for :func:`os.system` and :func:`os.popen` is required.
fr: Du fait que le module utilise les lignes de commandes :program:`/bin/sh`, un shell POSIX ou compatible est requis pour :func:`os.system` et :func:`os.popen`.

source: The :mod:`pipes` module defines the following class:
fr: Le module :mod:`pipes` définit la classe suivante :

source: An abstraction of a pipeline.
fr: Une abstraction d'un *pipeline*.

source: Example::
fr: Exemple ::

source: Template Objects
fr: L'Objet *Template*

source: Template objects following methods:
fr: Les méthodes de l'objet *Template* :

source: Restore a pipeline template to its initial state.
fr: Réinitialise un modèle de *pipeline* à son état initial.

source: Return a new, equivalent, pipeline template.
fr: Renvoie un nouveau modèle de *pipeline*, équivalent.

source: If *flag* is true, turn debugging on. Otherwise, turn debugging off. When debugging is on, commands to be executed are printed, and the shell is given ``set -x`` command to be more verbose.
fr: Si *flag* est vrai, active le débogage. Sinon, le désactive. Quand le débogage est actif, les commandes à exécuter seront affichée et le shell est pourvu de la commande ``set -x`` afin d'être plus verbeux.

source: Append a new action at the end. The *cmd* variable must be a valid bourne shell command. The *kind* variable consists of two letters.
fr: Ajoute une nouvelle action à la fin. La variable *cmd* doit être une commande *bourne shell* valide. La variable *kind* est composée de deux lettres.

source: The first letter can be either of ``'-'`` (which means the command reads its standard input), ``'f'`` (which means the commands reads a given file on the command line) or ``'.'`` (which means the commands reads no input, and hence must be first.)
fr: La première lettre peut soit être ``'-'`` (qui signifie que la commande lit sa sortie standard), soit ``'f'`` (qui signifie que la commande lit un fichier donné par la ligne de commande), soit ``'.'`` (qui signifie que la commande ne lit pas d'entrée, et donc doit être la première.)

source: Similarly, the second letter can be either of ``'-'`` (which means the command writes to standard output), ``'f'`` (which means the command writes a file on the command line) or ``'.'`` (which means the command does not write anything, and hence must be last.)
fr: De même, la seconde lettre peut soit être ``'-'`` (qui signifie que la commande écrit sur la sortie standard), soit ``'f'`` (qui signifie que la commande écrit sur un fichier donné par la ligne de commande), soit ``'.'`` (qui signifie que la commande n'écrit rien, et donc doit être la dernière.)

source: Add a new action at the beginning. See :meth:`append` for explanations of the arguments.
fr: Ajoute une nouvelle action au début. Voir :meth:`append` pour plus d'explications sur les arguments.

source: Return a file-like object, open to *file*, but read from or written to by the pipeline. Note that only one of ``'r'``, ``'w'`` may be given.
fr: Renvoie un objet fichier-compatible, ouvert à *file*, mais permettant d'écrire vers le *pipeline* ou de lire depuis celui-ci. À noter que seulement un des deux ('r' ou 'w') peut être donné.

source: Copy *infile* to *outfile* through the pipe.
fr: Copie *infile* vers *outfile* au travers du *pipe*.
