Repository: python/python-docs-fr
Catalog: library/pkgutil.po
Languages: fr

source: **Source code:** :source:`Lib/pkgutil.py`
fr: **Code source :** :source:`Lib/pkgutil.py`

source: This module provides utilities for the import system, in particular package support.
fr: Ce module fournit des utilitaires pour le système d'importation, en particulier pour la prise en charge des paquets.

source: A namedtuple that holds a brief summary of a module's info.
fr: Un *n*-uplet nommé qui contient un bref résumé des informations d'un module.

source: Extend the search path for the modules which comprise a package. Intended use is to place the following code in a package's :file:`__init__.py`::
fr: Étend le chemin de recherche pour les modules qui composent un paquet. L'usage prévu est de placer le code suivant dans le :file:`__init__.py` d'un paquet ::

source: If the input path is not a list (as is the case for frozen packages) it is returned unchanged. The input path is not modified; an extended copy is returned. Items are only appended to the copy at the end.
fr: Si le chemin d'entrée n'est pas une liste (comme c'est le cas pour les paquets figés), il est retourné tel quel. Le chemin d'entrée n'est pas modifié ; une copie étendue en est retournée. Les éléments ne sont ajoutés à la copie qu'à la fin.

source: It is assumed that :data:`sys.path` is a sequence. Items of :data:`sys.path` that are not strings referring to existing directories are ignored. Unicode items on :data:`sys.path` that cause errors when used as filenames may cause this function to raise an exception (in line with :func:`os.path.isdir` behavior).
fr: L'interpréteur estime que :data:`sys.path` est une séquence. Les éléments de :data:`sys.path` qui ne sont pas des chaînes se référant à des répertoires existants sont ignorés. Les éléments Unicode sur :data:`sys.path` qui provoquent des erreurs lorsqu'ils sont utilisés comme noms de fichiers peuvent amener cette fonction à lever une exception (conformément au comportement de :func:`os.path.isdir`).

source: Retrieve a module :term:`loader` for the given *fullname*.
fr: Récupère un :term:`loader` de module pour le *fullname* donné.

source: This is a backwards compatibility wrapper around :func:`importlib.util.find_spec` that converts most failures to :exc:`ImportError` and only returns the loader rather than the full :class:`importlib.machinery.ModuleSpec`.
fr: Il s'agit d'une surcouche de compatibilité ascendante autour de :func:`importlib.util.find_spec` qui convertit la plupart des échecs en :exc:`ImportError` et ne renvoie que le chargeur, plutôt que le :class:`importlib.machinery.ModuleSpec` complet.

source: Updated to be based directly on :mod:`importlib` rather than relying on the package internal :pep:`302` import emulation.
fr: Mise à jour pour être basée directement sur :mod:`importlib` au lieu de dépendre de l'émulation interne de la :pep:`302` du paquet.

source: Updated to be based on :pep:`451`
fr: Mise à jour pour être basée sur la :pep:`451`

source: Retrieve a :term:`finder` for the given *path_item*.
fr: Récupère un :term:`finder` pour l'élément *path_item* donné.

source: The returned finder is cached in :data:`sys.path_importer_cache` if it was newly created by a path hook.
fr: Le chercheur retourné est mis en cache dans :data:`sys.path_importer_cache` s'il a été récemment créé par le chemin d'un point d'entrée.

source: The cache (or part of it) can be cleared manually if a rescan of :data:`sys.path_hooks` is necessary.
fr: Le cache (ou une partie de celui-ci) peut être effacé manuellement si une nouvelle analyse de :data:`sys.path_hooks` est nécessaire.

source: Get a :term:`loader` object for *module_or_name*.
fr: Récupère un objet :term:`loader` pour *module_or_name*.

source: If the module or package is accessible via the normal import mechanism, a wrapper around the relevant part of that machinery is returned. Returns ``None`` if the module cannot be found or imported. If the named module is not already imported, its containing package (if any) is imported, in order to establish the package ``__path__``.
fr: Si le module ou le paquet est accessible via le mécanisme d'importation normal, une encapsulation autour de la partie pertinente de cette mécanique est renvoyé. Renvoie ``None`` si le module ne peut pas être trouvé ou importé. Si le module nommé n'est pas déjà importé, son paquet contenant (le cas échéant) est importé afin d'établir le paquet ``__path__``.

source: Yield :term:`finder` objects for the given module name.
fr: Génère des objets :term:`finder` pour le nom du module donné.

source: If fullname contains a ``'.'``, the finders will be for the package containing fullname, otherwise they will be all registered top level finders (i.e. those on both :data:`sys.meta_path` and :data:`sys.path_hooks`).
fr: Si le nom complet contient un ``'.'``, les chercheurs sont pour le paquet contenant le nom complet, sinon ils sont enregistrés pour tous les chercheurs de niveau supérieur (c'est-à-dire ceux de :data:`sys.meta_path` et de :data:`sys.path_hooks`).

source: If the named module is in a package, that package is imported as a side effect of invoking this function.
fr: Si le module nommé se trouve dans un paquet, ce paquet est importé en tant qu'effet secondaire de l'invocation de cette fonction.

source: If no module name is specified, all top level finders are produced.
fr: Si aucun nom de module n'est spécifié, tous les chercheurs de niveau supérieur sont générés.

source: Yields :class:`ModuleInfo` for all submodules on *path*, or, if *path* is ``None``, all top-level modules on :data:`sys.path`.
fr: Fournit des :class:`ModuleInfo` pour tous les sous-modules sur *path* ou, si *path* est ``None``, pour tous les modules de niveau supérieur sur :data:`sys.path`.

source: *path* should be either ``None`` or a list of paths to look for modules in.
fr: *path* doit être soit ``None``, soit une liste de chemins pour rechercher des modules.

source: *prefix* is a string to output on the front of every module name on output.
fr: *prefix* est une chaîne de caractères à afficher au début de chaque nom de module en sortie.

source: Only works for a :term:`finder` which defines an ``iter_modules()`` method. This interface is non-standard, so the module also provides implementations for :class:`importlib.machinery.FileFinder` and :class:`zipimport.zipimporter`.
fr: Cela fonctionne uniquement pour un :term:`finder` qui définit une méthode ``iter_modules()``. Cette interface n'est pas standard, donc le module fournit également des implémentations pour :class:`importlib.machinery.FileFinder` et :class:`zipimport.zipimporter`.

source: Yields :class:`ModuleInfo` for all modules recursively on *path*, or, if *path* is ``None``, all accessible modules.
fr: Fournit des :class:`ModuleInfo` pour tous les modules de manière récursive sur *path* ou, si *path* est ``None``, tous les modules accessibles.

source: Note that this function must import all *packages* (*not* all modules!) on the given *path*, in order to access the ``__path__`` attribute to find submodules.
fr: Notez que cette fonction doit importer tous les *packages* (*pas* tous les modules !) sur le *path* donné, afin d'accéder à l'attribut ``__path__`` pour trouver les sous-modules.

source: *onerror* is a function which gets called with one argument (the name of the package which was being imported) if any exception occurs while trying to import a package. If no *onerror* function is supplied, :exc:`ImportError`\s are caught and ignored, while all other exceptions are propagated, terminating the search.
fr: *onerror* est une fonction qui est appelée avec un argument (le nom du paquet qui était en cours d'importation) si une exception se produit lors de la tentative d'importation d'un paquet. Si aucune fonction *onerror* n'est fournie, les :exc:`ImportError`\s sont attrapées et ignorées, tandis que toutes les autres exceptions sont propagées, mettant fin à la recherche.

source: Examples::
fr: Exemples ::

source: Get a resource from a package.
fr: Obtient une ressource à partir d'un paquet.

source: This is a wrapper for the :term:`loader` :meth:`get_data <importlib.abc.ResourceLoader.get_data>` API. The *package* argument should be the name of a package, in standard module format (``foo.bar``). The *resource* argument should be in the form of a relative filename, using ``/`` as the path separator. The parent directory name ``..`` is not allowed, and nor is a rooted name (starting with a ``/``).
fr: Ceci est une surcouche pour l'API :term:`loader` :meth:`get_data <importlib.abc.ResourceLoader.get_data>`. L'argument *package* doit être le nom d'un paquet, au format module standard (``foo.bar``). L'argument *resource* doit être sous forme d'un nom de fichier relatif, en utilisant ``/`` comme séparateur de chemin. Le nom du répertoire parent ``..`` n'est pas autorisé, pas plus qu'un nom racine (commençant par ``/``).

source: The function returns a binary string that is the contents of the specified resource.
fr: La fonction renvoie une chaîne binaire qui est le contenu de la ressource spécifiée.

source: For packages located in the filesystem, which have already been imported, this is the rough equivalent of::
fr: Pour les paquets situés dans le système de fichiers, qui ont déjà été importés, c'est l'équivalent approximatif de ::

source: If the package cannot be located or loaded, or it uses a :term:`loader` which does not support :meth:`get_data <importlib.abc.ResourceLoader.get_data>`, then ``None`` is returned. In particular, the :term:`loader` for :term:`namespace packages <namespace package>` does not support :meth:`get_data <importlib.abc.ResourceLoader.get_data>`.
fr: Si le paquet ne peut pas être localisé ou chargé, ou s'il utilise un :term:`loader` qui ne prend pas en charge :meth:`get_data <importlib.abc.ResourceLoader.get_data>`, alors ``None`` est retourné. En particulier, le :term:`loader` pour les :term:`paquets espaces de noms <namespace package>` ne prend pas en charge :meth:`get_data <importlib.abc.ResourceLoader.get_data>`.

source: Resolve a name to an object.
fr: Solutionne un nom en un objet.

source: This functionality is used in numerous places in the standard library (see :issue:`12915`) - and equivalent functionality is also in widely used third-party packages such as setuptools, Django and Pyramid.
fr: Cette fonctionnalité est utilisée dans de nombreux endroits de la bibliothèque standard (voir :issue:`12915`) - et une fonctionnalité équivalente est également présente dans des paquets largement utilisés tels que Setuptools, Django et Pyramid.

source: It is expected that *name* will be a string in one of the following formats, where W is shorthand for a valid Python identifier and dot stands for a literal period in these pseudo-regexes:
fr: Python s'attend à ce que *name* soit une chaîne de caractères dans l'un des formats suivants, où W est une abréviation pour un identifiant Python valide et le point représente un point littéral dans ces pseudo-regexes :

source: The first form is intended for backward compatibility only. It assumes that some part of the dotted name is a package, and the rest is an object somewhere within that package, possibly nested inside other objects. Because the place where the package stops and the object hierarchy starts can't be inferred by inspection, repeated attempts to import must be done with this form.
fr: La première forme est destinée uniquement à assurer la compatibilité ascendante. Elle suppose qu'une partie du nom pointé est un paquet, et que le reste est un objet quelque part à l'intérieur de ce paquet, éventuellement niché à l'intérieur d'autres objets. Puisque l'endroit où le paquet s'arrête et où la hiérarchie des objets commence ne peut pas être déduit par inspection, des tentatives répétées d'importation doivent être effectuées avec cette forme.

source: In the second form, the caller makes the division point clear through the provision of a single colon: the dotted name to the left of the colon is a package to be imported, and the dotted name to the right is the object hierarchy within that package. Only one import is needed in this form. If it ends with the colon, then a module object is returned.
fr: Dans la deuxième forme, l'appelant clarifie le point de division en fournissant un seul deux-points : le nom pointé à gauche des deux-points est un package à importer, et le nom pointé à droite est la hiérarchie d'objets à l'intérieur de ce paquet. Seule une importation est nécessaire dans cette forme. Si elle se termine par un deux-points, alors un objet module est retourné.

source: The function will return an object (which might be a module), or raise one of the following exceptions:
fr: La fonction renvoie un objet (qui pourrait être un module), ou génère l'une des exceptions suivantes :

source: :exc:`ValueError` -- if *name* isn't in a recognised format.
fr: :exc:`ValueError` – si *name* n'est pas un format reconnu.

source: :exc:`ImportError` -- if an import failed when it shouldn't have.
fr: :exc:`ImportError` – si une importation échoue lorsqu'elle n'aurait pas dû.

source: :exc:`AttributeError` -- If a failure occurred when traversing the object hierarchy within the imported package to get to the desired object.
fr: :exc:`AttributeError` – Si un échec s'est produit lors du parcours de la hiérarchie d'objets dans le paquet importé pour accéder à l'objet souhaité.
