Repository: python/python-docs-fr
Catalog: library/platform.po
Languages: fr

source: :mod:`platform` --- Access to underlying platform's identifying data
fr: :mod:`platform` — Accès aux données sous-jacentes de la plateforme

source: **Source code:** :source:`Lib/platform.py`
fr: **Code source :** :source:`Lib/platform.py`

source: Specific platforms listed alphabetically, with Linux included in the Unix section.
fr: Les spécificités des plateformes sont regroupées dans des sections triées par ordre alphabétique. Linux est inclus dans la section Unix.

source: Cross Platform
fr: Multiplateformes

source: Queries the given executable (defaults to the Python interpreter binary) for various architecture information.
fr: Interroge l'exécutable fourni (par défaut l'interpréteur Python) sur les informations de l'architecture.

source: Returns a tuple ``(bits, linkage)`` which contain information about the bit architecture and the linkage format used for the executable. Both values are returned as strings.
fr: Renvoie un *n*-uplet de ``(bits, linkage)`` qui contient de l'information sur l'architecture binaire et le format de lien. Les deux valeurs sont des chaînes de caractères.

source: Values that cannot be determined are returned as given by the parameter presets. If bits is given as ``''``, the ``sizeof(pointer)`` (or ``sizeof(long)`` on Python version < 1.5.2) is used as indicator for the supported pointer size.
fr: Lorsqu'une valeur ne peut être déterminée, la valeur passée en paramètre est utilisée. Si la valeur passée à *bits* est ``''``, la valeur de ``sizeof(pointer)`` (ou ``sizeof(long)`` sur les versions Python antérieures à 1.5.2) est utilisée comme indicateur de la taille de pointeur prise en charge.

source: The function relies on the system's :file:`file` command to do the actual work. This is available on most if not all Unix platforms and some non-Unix platforms and then only if the executable points to the Python interpreter. Reasonable defaults are used when the above needs are not met.
fr: La fonction dépend de la commande :file:`file` du système pour accomplir la tâche. `file` est disponible sur quasiment toutes les plateformes Unix ainsi que sur certaines plateformes hors de la famille Unix et l'exécutable doit pointer vers l'interpréteur Python. Des valeurs par défaut raisonnables sont utilisées lorsque les conditions précédentes ne sont pas atteintes.

source: To get at the "64-bitness" of the current interpreter, it is more reliable to query the :attr:`sys.maxsize` attribute::
fr: Afin de déterminer si l'interpréteur courant est 64-bit, une méthode plus fiable est d'interroger l'attribut :attr:`sys.maxsize` ::

source: Returns the machine type, e.g. ``'i386'``. An empty string is returned if the value cannot be determined.
fr: Renvoie le type de machine. Par exemple, ``'i386'``. Une chaîne de caractères vide est renvoyée si la valeur ne peut être déterminée.

source: Returns the computer's network name (may not be fully qualified!). An empty string is returned if the value cannot be determined.
fr: Renvoie le nom de l'ordinateur sur le réseau (pas forcément pleinement qualifié). Une chaîne de caractères vide est renvoyée s'il ne peut pas être déterminé.

source: Returns a single string identifying the underlying platform with as much useful information as possible.
fr: Renvoie une chaîne de caractère identifiant la plateforme avec le plus d'informations possible.

source: The output is intended to be *human readable* rather than machine parseable. It may look different on different platforms and this is intended.
fr: La valeur renvoyée est destinée à la *lecture humaine* plutôt que l'interprétation machine. Il est possible qu'elle soit différente selon la plateforme et c'est voulu.

source: If *aliased* is true, the function will use aliases for various platforms that report system names which differ from their common names, for example SunOS will be reported as Solaris. The :func:`system_alias` function is used to implement this.
fr: Si *aliased* est vrai, la fonction utilisera des alias pour certaines plateformes qui utilisent des noms de système qui diffèrent de leurs noms communs. Par exemple, SunOS sera reconnu comme Solaris. La fonction :func:`system_alias` est utilisée pour l'implémentation.

source: Setting *terse* to true causes the function to return only the absolute minimum information needed to identify the platform.
fr: Si *terse* est vrai, la fonction ne renverra que l'information nécessaire à l'identification de la plateforme.

source: On macOS, the function now uses :func:`mac_ver`, if it returns a non-empty release string, to get the macOS version rather than the darwin version.
fr: Sur MacOS, la fonction essaie maintenant d'utiliser la fonction :func:`mac_ver` pour obtenir la version de MacOS plutôt que la version de Darwin : le résultat de `mac_ver` est utilisé si ce n'est pas une chaîne vide.

source: Returns the (real) processor name, e.g. ``'amdk6'``.
fr: Renvoie le (vrai) nom du processeur. Par exemple : ``'amdk6'``.

source: An empty string is returned if the value cannot be determined. Note that many platforms do not provide this information or simply return the same value as for :func:`machine`. NetBSD does this.
fr: Une chaîne de caractères vide est renvoyée si la valeur ne peut être déterminée. Prenez note que plusieurs plateformes ne fournissent pas cette information ou renvoient la même valeur que la fonction :func:`machine`. NetBSD agit ainsi.

source: Returns a tuple ``(buildno, builddate)`` stating the Python build number and date as strings.
fr: Renvoie une paire ``(buildno, builddate)`` de chaîne de caractères identifiant la version et la date de compilation de Python.

source: Returns a string identifying the compiler used for compiling Python.
fr: Renvoie une chaîne de caractères identifiant le compilateur utilisé pour compiler Python.

source: Returns a string identifying the Python implementation SCM branch.
fr: Renvoie la chaîne de caractères identifiant la branche du gestionnaire de versions de l'implémentation Python.

source: Returns a string identifying the Python implementation. Possible return values are: 'CPython', 'IronPython', 'Jython', 'PyPy'.
fr: Renvoie une chaîne de caractères identifiant l'implémentation de Python. Des valeurs possibles sont : ``CPython``, ``IronPython``, ``Jython``, ``Pypy``.

source: Returns a string identifying the Python implementation SCM revision.
fr: Renvoie la chaîne de caractères identifiant la révision du gestionnaire de versions de l'implémentation Python.

source: Returns the Python version as string ``'major.minor.patchlevel'``.
fr: Renvoie la version de Python comme une chaîne de caractères ``'major.minor.patchlevel'``.

source: Note that unlike the Python ``sys.version``, the returned value will always include the patchlevel (it defaults to 0).
fr: Prenez note que la valeur renvoyée inclut toujours le *patchlevel* (valeur par défaut de 0) à la différence de ``sys.version``.

source: Returns the Python version as tuple ``(major, minor, patchlevel)`` of strings.
fr: Renvoie la version de Python comme un triplet de chaînes de caractères ``(major, minor, patchlevel)``.

source: Note that unlike the Python ``sys.version``, the returned value will always include the patchlevel (it defaults to ``'0'``).
fr: Prenez note que la valeur renvoyée inclut toujours le *patchlevel* (valeur par défaut de ``'0'``) à la différence de ``sys.version``.

source: Returns the system's release, e.g. ``'2.2.0'`` or ``'NT'`` An empty string is returned if the value cannot be determined.
fr: Renvoie la version de déploiement du système, par exemple, ``'2.2.0'`` ou ``'NT'``. Une chaîne de caractères vide signifie qu'aucune valeur ne peut être déterminée.

source: Returns the system/OS name, such as ``'Linux'``, ``'Darwin'``, ``'Java'``, ``'Windows'``. An empty string is returned if the value cannot be determined.
fr: Renvoie le nom du système d'exploitation, tel que ``'Linux'``, ``'Darwin'``, ``'Java'``, ``'Windows'``. Une chaîne de caractères vide est renvoyée si le nom ne peut être déterminé.

source: Returns ``(system, release, version)`` aliased to common marketing names used for some systems. It also does some reordering of the information in some cases where it would otherwise cause confusion.
fr: Renvoie ``(system, release, version)`` avec des alias pour les noms communs de certains systèmes. Modifie aussi l'ordre de l'information pour éviter la confusion.

source: Returns the system's release version, e.g. ``'#3 on degas'``. An empty string is returned if the value cannot be determined.
fr: Renvoie la version de déploiement du système. Par exemple, ``'#3 on degas'``. Une chaîne de caractères vide est renvoyée si aucune valeur ne peut être déterminée.

source: Fairly portable uname interface. Returns a :func:`~collections.namedtuple` containing six attributes: :attr:`system`, :attr:`node`, :attr:`release`, :attr:`version`, :attr:`machine`, and :attr:`processor`.
fr: Interface de *uname* relativement portable. Renvoie un :func:`~collections.namedtuple` contenant six attributs : :attr:`system`, :attr:`node`, :attr:`release`, :attr:`version`, :attr:`machine` et :attr:`processor`.

source: Note that this adds a sixth attribute (:attr:`processor`) not present in the :func:`os.uname` result. Also, the attribute names are different for the first two attributes; :func:`os.uname` names them :attr:`sysname` and :attr:`nodename`.
fr: Prenez note qu'il y a un attribut supplémentaire (:attr:`processor`) par rapport à la valeur de retour de :func:`os.uname`. De plus, les deux premiers attributs changent de nom ; ils s'appellent :attr:`sysname` et :attr:`nodename` pour la fonction :func:`os.uname`.

source: Entries which cannot be determined are set to ``''``.
fr: Les entrées qui ne peuvent pas être identifiées ont la valeur ``''``.

source: Result changed from a tuple to a namedtuple.
fr: Le type renvoyé passe d'un sextuplet à un *namedtuple*.

source: Java Platform
fr: Plateforme Java

source: Version interface for Jython.
fr: Version de l'interface pour Jython.

source: Returns a tuple ``(release, vendor, vminfo, osinfo)`` with *vminfo* being a tuple ``(vm_name, vm_release, vm_vendor)`` and *osinfo* being a tuple ``(os_name, os_version, os_arch)``. Values which cannot be determined are set to the defaults given as parameters (which all default to ``''``).
fr: Renvoie un *n*-uplet ``(release, vendor, vminfo, osinfo)``. *vminfo* est un triplet de valeur ``(vm_name, vm_release, vm_vendor)`` et *osinfo* est un triplet de valeur ``(os_name, os_version, os_arch)``. Les valeurs indéterminables ont la valeur des paramètres par défaut (valeur de ``''`` par défaut).

source: Windows Platform
fr: Plateforme Windows

source: Get additional version information from the Windows Registry and return a tuple ``(release, version, csd, ptype)`` referring to OS release, version number, CSD level (service pack) and OS type (multi/single processor).
fr: Interroge le registre Windows pour de l'information supplémentaire et renvoie un triplet de ``(release, version, csd, ptype)`` faisant référence au numéro de version du SE, le numéro de version, le niveau de CSD (Service Pack) et le type de SE (monoprocesseur ou multiprocesseur).

source: As a hint: *ptype* is ``'Uniprocessor Free'`` on single processor NT machines and ``'Multiprocessor Free'`` on multi processor machines. The *'Free'* refers to the OS version being free of debugging code. It could also state *'Checked'* which means the OS version uses debugging code, i.e. code that checks arguments, ranges, etc.
fr: Astuce : *ptype* est ``'Uniprocessor Free'`` sur des machines NT ayant qu'un seul processeur et ``'Multiprocessor Free'`` sur des machines ayant plusieurs processeurs. La composante *'Free'* fait référence à l'absence de code de débogage dans le SE. Au contraire, *'Checked'* indique que le SE utilise du code de débogage pour valider les paramètres, etc.

source: Returns a string representing the current Windows edition. Possible values include but are not limited to ``'Enterprise'``, ``'IoTUAP'``, ``'ServerStandard'``, and ``'nanoserver'``.
fr: Renvoie une chaîne de caractères représentant l'édition courante de Windows. Des exemples de valeurs possibles sont : ``'Enterprise'``, ``'IoTUAP'``, ``'ServerStandard'`` et ``'nanoserver'``.

source: Return ``True`` if the Windows edition returned by :func:`win32_edition` is recognized as an IoT edition.
fr: Renvoie ``True`` si l'édition de Windows renvoyée par la fonction :func:`win32_edition` est reconnue comme une édition IoT.

source: Entries which cannot be determined are set to ``''``. All tuple entries are strings.
fr: Les entrées qui ne peuvent pas être identifiées auront la valeur ``''``. Les membres du *n*-uplet sont tous des chaînes de caractères.

source: Unix Platforms
fr: Plateformes Unix

source: Tries to determine the libc version against which the file executable (defaults to the Python interpreter) is linked. Returns a tuple of strings ``(lib, version)`` which default to the given parameters in case the lookup fails.
fr: Tente d'identifier la version de la bibliothèque standard C à laquelle le fichier exécutable (par défaut l'interpréteur Python) est lié. Renvoie une paire de chaînes de caractères ``(lib, version)``. Les valeurs passées en paramètre seront retournées si la recherche échoue.

source: Note that this function has intimate knowledge of how different libc versions add symbols to the executable is probably only usable for executables compiled using :program:`gcc`.
fr: Prenez note que cette fonction a une connaissance profonde des méthodes utilisées par les versions de la bibliothèque standard C pour ajouter des symboles au fichier exécutable. Elle n'est probablement utilisable qu'avec des exécutables compilés avec :program:`gcc`.

source: The file is read and scanned in chunks of *chunksize* bytes.
fr: Le fichier est lu en blocs de *chunksize* octets.
