Repository: python/python-docs-fr
Catalog: library/posix.po
Languages: fr

source: :mod:`posix` --- The most common POSIX system calls
fr: :mod:`posix` — Les appels système POSIX les plus courants

source: This module provides access to operating system functionality that is standardized by the C Standard and the POSIX standard (a thinly disguised Unix interface).
fr: Ce module permet d'accéder aux fonctionnalités du système d'exploitation normalisés par le Standard C et le Standard POSIX (une interface Unix habilement déguisée).

source: **Do not import this module directly.** Instead, import the module :mod:`os`, which provides a *portable* version of this interface. On Unix, the :mod:`os` module provides a superset of the :mod:`posix` interface. On non-Unix operating systems the :mod:`posix` module is not available, but a subset is always available through the :mod:`os` interface. Once :mod:`os` is imported, there is *no* performance penalty in using it instead of :mod:`posix`. In addition, :mod:`os` provides some additional functionality, such as automatically calling :func:`~os.putenv` when an entry in ``os.environ`` is changed.
fr: **Ne pas importer ce module directement.** À la place, importer le module :mod:`os`, qui fournit une version *portable* de cette interface. Sous Unix, le module :mod:`os` fournit un sur-ensemble de l'interface :mod:`posix`. Sous les systèmes d'exploitation non Unix le module :mod:`posix` n'est pas disponible, mais un sous ensemble est toujours disponible via l'interface :mod:`os`. Une fois que :mod:`os` est importé, il n'y a aucune perte de performance à l'utiliser à la place de :mod:`posix`. De plus, :mod:`os` fournit des fonctionnalités supplémentaires, telles que l'appel automatique de :func:`~os.putenv` lorsqu'une entrée dans ``os.environ`` est modifiée.

source: Errors are reported as exceptions; the usual exceptions are given for type errors, while errors reported by the system calls raise :exc:`OSError`.
fr: Les erreurs sont signalées comme des exceptions; les exceptions habituelles sont données pour les erreurs de type, tandis que les erreurs signalées par les appels système lèvent une erreur :exc:`OSError`.

source: Large File Support
fr: Prise en charge de gros fichiers

source: Several operating systems (including AIX, HP-UX, Irix and Solaris) provide support for files that are larger than 2 GiB from a C programming model where :c:type:`int` and :c:type:`long` are 32-bit values. This is typically accomplished by defining the relevant size and offset types as 64-bit values. Such files are sometimes referred to as :dfn:`large files`.
fr: De nombreux systèmes d'exploitation (y compris AIX, HP-UX, Irix et Solaris) prennent en charge les fichiers d'une taille supérieure à 2 Go malgré que le compilateur C utilise des types :c:type:`int` et :c:type:`long` d'une longueur de 32 bit. Ceci est généralement accompli en définissant un nouveau type de 64 bit. Ces fichiers sont parfois appelés fichiers volumineux.

source: Large file support is enabled in Python when the size of an :c:type:`off_t` is larger than a :c:type:`long` and the :c:type:`long long` is at least as large as an :c:type:`off_t`. It may be necessary to configure and compile Python with certain compiler flags to enable this mode. For example, it is enabled by default with recent versions of Irix, but with Solaris 2.6 and 2.7 you need to do something like::
fr: La prise en charge des fichiers volumineux dans Python est activée lorsque la taille de :c:type:`off_t` est supérieure à :c:type:`long` et que le type :c:type:`long long` est au moins aussi grand que :c:type:`off_t`. Il peut être nécessaire de configurer et compiler Python avec certaines options pour activer ce mode. Par exemple, il est activé par défaut avec les versions récentes d'Irix, mais avec Solaris 2.6 et 2.7 vous avez besoin de faire quelque chose comme ::

source: On large-file-capable Linux systems, this might work::
fr: Sur les systèmes Linux capable de supporter les fichiers volumineux, cela pourrait fonctionner ::

source: Notable Module Contents
fr: Contenu du Module

source: In addition to many functions described in the :mod:`os` module documentation, :mod:`posix` defines the following data item:
fr: En plus des nombreuses fonctions décrites dans la documentation du module :mod:`os`, :mod:`posix` possède les éléments suivants:

source: A dictionary representing the string environment at the time the interpreter was started. Keys and values are bytes on Unix and str on Windows. For example, ``environ[b'HOME']`` (``environ['HOME']`` on Windows) is the pathname of your home directory, equivalent to ``getenv("HOME")`` in C.
fr: Un dictionnaire représentant les variables d'environnement au moment où l'interpréteur à été lancé. Les clés et les valeurs sont des `bytes` sous Unix et des `str` sous Windows. Par exemple, ``environ[b'HOME']`` (``environ['HOME']`` dans Windows) est le chemin de votre dossier d’accueil, équivalent à ``getenv("HOME")`` en C.

source: Modifying this dictionary does not affect the string environment passed on by :func:`~os.execv`, :func:`~os.popen` or :func:`~os.system`; if you need to change the environment, pass ``environ`` to :func:`~os.execve` or add variable assignments and export statements to the command string for :func:`~os.system` or :func:`~os.popen`.
fr: Modifier ce dictionnaire n'affecte pas les variables d'environnements fournis par :func:`~os.execv`, :func:`~os.popen` ou :func:`~os.system`; Si vous avez besoin de changer l'environnement, passer le paramètre ``environ`` à :func:`~os.execve` ou ajouter les assignations de variables et les *export* à la commande à exécuter via :func:`~os.system` ou :func:`~os.popen`.

source: On Unix, keys and values are bytes.
fr: Sous Unix, les clés et les valeurs sont des octets.

source: The :mod:`os` module provides an alternate implementation of ``environ`` which updates the environment on modification. Note also that updating :data:`os.environ` will render this dictionary obsolete. Use of the :mod:`os` module version of this is recommended over direct access to the :mod:`posix` module.
fr: Le module :mod:`os` fournit une implémentation alternative à ``environ`` qui met à jour l'environnement en cas de modification. Notez également que la mise à jour de :data:`os.environ` rendra ce dictionnaire obsolète. Il est recommandé d'utiliser le module :mod:`os` au lieu du module :mod:`posix` dans ce cas-ci.
