Repository: python/python-docs-fr
Catalog: library/pprint.po
Languages: fr

source: :mod:`pprint` --- Data pretty printer
fr: :mod:`pprint` — L’affichage élégant de données

source: **Source code:** :source:`Lib/pprint.py`
fr: **Code source :** :source:`Lib/pprint.py`

source: The :mod:`pprint` module provides a capability to "pretty-print" arbitrary Python data structures in a form which can be used as input to the interpreter. If the formatted structures include objects which are not fundamental Python types, the representation may not be loadable. This may be the case if objects such as files, sockets or classes are included, as well as many other objects which are not representable as Python literals.
fr: Le module :mod:`pprint` permet « d’afficher élégamment » des structures de données Python arbitraires sous une forme qui peut être utilisée ensuite comme une entrée dans l’interpréteur. Si les structures formatées incluent des objets qui ne sont pas de types Python fondamentaux, leurs représentations peuvent ne pas être acceptables en tant que telles par l’interpréteur. Cela peut être le cas si des objets tels que des fichiers, des interfaces de connexion (*sockets* en anglais) ou des classes sont inclus, c’est aussi valable pour beaucoup d’autres types d’objets qui ne peuvent être représentés sous forme littérale en Python.

source: The formatted representation keeps objects on a single line if it can, and breaks them onto multiple lines if they don't fit within the allowed width. Construct :class:`PrettyPrinter` objects explicitly if you need to adjust the width constraint.
fr: L’affichage formaté affiche tant que possible les objets sur une seule ligne, et les sépare sur plusieurs lignes s’ils dépassent la largeur autorisée par l’interpréteur. Créez explicitement des objets :class:`PrettyPrinter` si vous avez besoin de modifier les limites de largeur.

source: Dictionaries are sorted by key before the display is computed.
fr: Les dictionnaires sont classés par clés avant que l’affichage ne soit calculé.

source: The :mod:`pprint` module defines one class:
fr: Le module :mod:`pprint` définit une seule classe : ::

source: Construct a :class:`PrettyPrinter` instance. This constructor understands several keyword parameters. An output stream may be set using the *stream* keyword; the only method used on the stream object is the file protocol's :meth:`write` method. If not specified, the :class:`PrettyPrinter` adopts ``sys.stdout``. The amount of indentation added for each recursive level is specified by *indent*; the default is one. Other values can cause output to look a little odd, but can make nesting easier to spot. The number of levels which may be printed is controlled by *depth*; if the data structure being printed is too deep, the next contained level is replaced by ``...``. By default, there is no constraint on the depth of the objects being formatted. The desired output width is constrained using the *width* parameter; the default is 80 characters. If a structure cannot be formatted within the constrained width, a best effort will be made. If *compact* is false (the default) each item of a long sequence will be formatted on a separate line. If *compact* is true, as many items as will fit within the *width* will be formatted on each output line.
fr: Crée une instance de :class:`PrettyPrinter`. Ce constructeur accepte plusieurs paramètres nommés. Un flux de sortie peut être défini par le mot clé *stream*; la seule méthode utilisée sur l’objet *stream* est la méthode :meth:`write` du protocole de fichiers. Si rien n’est spécifié, la classe :class:`PrettyPrinter` utilise ``sys.stdout``. La taille de l’indentation ajoutée à chaque niveau récursif est spécifiée par *indent*; la valeur par défaut vaut ``1`. D’autres valeurs pourraient donner des résultats surprenants, mais peuvent aider à mieux visualiser les imbrications. Le nombre de niveaux qui peuvent être affichés est contrôlé par *depth*; si la structure de données est trop profonde, le niveau suivant est remplacé par ``…``. Par défaut il n’y a pas de contraintes sur la profondeur des objets formatés. Vous pouvez limiter la largeur de la sortie à l’aide du paramètre *width*; la valeur par défaut est de 80 caractères. Si une structure ne peut pas être formatée dans les limites de la largeur contrainte, le module fait au mieux. SI *compact* est initialisé à *False* (la valeur par défaut), chaque élément d’une longue séquence est formaté sur une ligne séparée. Si *compact* est initialisé à *True*, tous les éléments qui peuvent tenir dans la largeur définie sont formatés sur chaque ligne de sortie.

source: Added the *compact* parameter.
fr: Ajout du paramètre *compact*.

source: The :mod:`pprint` module also provides several shortcut functions:
fr: Le module :mod:`pprint` fournit aussi quelques fonctions de raccourcis : ::

source: Return the formatted representation of *object* as a string. *indent*, *width*, *depth* and *compact* will be passed to the :class:`PrettyPrinter` constructor as formatting parameters.
fr: Renvoie une représentation formatée de *object* sous forme de chaine de caractères. *indent*, *width*, *depth* et *compact* sont passés au constructeur de :class:`PrettyPrinter` comme paramètres de formatage.

source: Prints the formatted representation of *object* on *stream*, followed by a newline. If *stream* is ``None``, ``sys.stdout`` is used. This may be used in the interactive interpreter instead of the :func:`print` function for inspecting values (you can even reassign ``print = pprint.pprint`` for use within a scope). *indent*, *width*, *depth* and *compact* will be passed to the :class:`PrettyPrinter` constructor as formatting parameters.
fr: Affiche la représentation formatée de *object* sur *stream*, suivie d’un retour à la ligne. Si *stream* vaut ``None``, ``sys.stdout`` est alors utilisé. Vous pouvez l’utiliser dans l’interpréteur interactif de Python au lieu de la fonction :func:`print` pour inspecter les valeurs (vous pouvez même réassigner ``print = pprint.pprint`` pour une utilisation au sein de sa portée). *indent*, *width*, *depth* et *compact* sont passés au constructeur de classe :class:`PrettyPrinter` comme paramètres de formatage.

source: Determine if the formatted representation of *object* is "readable," or can be used to reconstruct the value using :func:`eval`. This always returns ``False`` for recursive objects.
fr: Détermine si la représentation formatée de *object* est « lisible », ou s’il peut être utilisé pour recomposer sa valeur en utilisant la fonction :func:`eval`. Cela renvoie toujours ``False`` pour les objets récursifs.

source: Determine if *object* requires a recursive representation.
fr: Détermine si *object* requiert une représentation récursive.

source: One more support function is also defined:
fr: Une dernière fonction de support est définie ainsi : ::

source: Return a string representation of *object*, protected against recursive data structures. If the representation of *object* exposes a recursive entry, the recursive reference will be represented as ``<Recursion on typename with id=number>``. The representation is not otherwise formatted.
fr: Renvoie une représentation de *object* sous forme de chaîne de caractère, celle-ci est protégée contre les structures de données récursives. Si la représentation de *object* présente une entrée récursive, celle-ci sera représentée telle que ``<Recursion on typename with id=number>``. Par ailleurs, la représentation de l’objet n’est pas formatée.

source: PrettyPrinter Objects
fr: Les Objets PrettyPrinter

source: :class:`PrettyPrinter` instances have the following methods:
fr: Les instances de la classe :class:`PrettyPrinter` ont les méthodes suivantes : ::

source: Return the formatted representation of *object*. This takes into account the options passed to the :class:`PrettyPrinter` constructor.
fr: Renvoie la représentation formatée de *object*. Cela prend en compte les options passées au constructeur de la classe :class:`PrettyPrinter`.

source: Print the formatted representation of *object* on the configured stream, followed by a newline.
fr: Affiche sur le flux configuré la représentation formatée de *object*, suivie d’une fin de ligne.

source: The following methods provide the implementations for the corresponding functions of the same names. Using these methods on an instance is slightly more efficient since new :class:`PrettyPrinter` objects don't need to be created.
fr: Les méthodes suivantes fournissent les implémentations pour les fonctions correspondantes de mêmes noms. L’utilisation de ces méthodes sur une instance est légèrement plus efficace, car les nouveaux objets :class:`PrettyPrinter` n’ont pas besoin d’être créés.

source: Determine if the formatted representation of the object is "readable," or can be used to reconstruct the value using :func:`eval`. Note that this returns ``False`` for recursive objects. If the *depth* parameter of the :class:`PrettyPrinter` is set and the object is deeper than allowed, this returns ``False``.
fr: Détermine si la représentation formatée de *object* est « lisible », ou si elle peut être utilisée pour recomposer sa valeur en utilisant la fonction :func:`eval`. Cela renvoie toujours ``False`` pour les objets récursifs. Si le paramètre *depth* de la classe :class:`PrettyPrinter` est initialisé et que l’objet est plus « profond » que permis, cela renvoie ``False``.

source: Determine if the object requires a recursive representation.
fr: Détermine si l’objet nécessite une représentation récursive.

source: This method is provided as a hook to allow subclasses to modify the way objects are converted to strings. The default implementation uses the internals of the :func:`saferepr` implementation.
fr: Cette méthode est fournie sous forme de point d’entrée ou méthode (à déclenchement) automatique (*hook* en anglais) pour permettre aux sous-classes de modifier la façon dont les objets sont convertis en chaînes. L’implémentation par défaut est celle de la fonction :func:`saferepr`.

source: Returns three values: the formatted version of *object* as a string, a flag indicating whether the result is readable, and a flag indicating whether recursion was detected. The first argument is the object to be presented. The second is a dictionary which contains the :func:`id` of objects that are part of the current presentation context (direct and indirect containers for *object* that are affecting the presentation) as the keys; if an object needs to be presented which is already represented in *context*, the third return value should be ``True``. Recursive calls to the :meth:`.format` method should add additional entries for containers to this dictionary. The third argument, *maxlevels*, gives the requested limit to recursion; this will be ``0`` if there is no requested limit. This argument should be passed unmodified to recursive calls. The fourth argument, *level*, gives the current level; recursive calls should be passed a value less than that of the current call.
fr: Renvoie trois valeurs : la version formatée de *object* sous forme de chaîne de caractères, une option indiquant si le résultat est « lisible », et une option indiquant si une récursion a été détectée. Le premier argument est l’objet à représenter. Le deuxième est un dictionnaire qui contient l'\ :func:`id` des objets (conteneurs directs ou indirects de *objet* qui affectent sa représentation) qui font partie du contexte de représentation courant tel que les clés; si un objet doit être représenté, mais l’a déjà été dans ce contexte, le troisième argument renvoie ``True``. Des appels récursifs à la méthode :meth:`.format` doivent ajouter des entrés additionnelles aux conteneurs de ce dictionnaire. Le troisième argument *maxlevels*, donne la limite maximale de récursivité; la valeur par défaut est ``0``. Cet argument doit être passé non modifié pour des appels non récursifs. Le quatrième argument, *level*, donne le niveau de récursivité courant; les appels récursifs doivent être passés à une valeur inférieure à celle de l’appel courant.

source: Example
fr: Exemple

source: To demonstrate several uses of the :func:`pprint` function and its parameters, let's fetch information about a project from `PyPI <https://pypi.org>`_::
fr: Pour illustrer quelques cas pratiques de l’utilisation de la fonction :func:`pprint` et de ses paramètres, allons chercher des informations sur un projet `PyPI <https://pypi.org>`_ : ::

source: In its basic form, :func:`pprint` shows the whole object::
fr: Dans sa forme basique, la fonction :func:`pprint` affiche l’intégralité de l’objet : ::

source: The result can be limited to a certain *depth* (ellipsis is used for deeper contents)::
fr: Le résultat peut être limité à une certaine profondeur en initialisant *depth*. ( ``…`` est utilisé pour des contenus plus « profonds ») : ::

source: Additionally, maximum character *width* can be suggested. If a long object cannot be split, the specified width will be exceeded::
fr: De plus, une valeur maximale de caractères sur une ligne peut être définie en initialisant le paramètre *width*. Si un long objet ne peut être scindé, la valeur donnée à *width* sera outrepassée : ::
