Repository: python/python-docs-fr
Catalog: library/pty.po
Languages: fr

source: :mod:`pty` --- Pseudo-terminal utilities
fr: :mod:`pty` — Outils de manipulation de pseudo-terminaux

source: **Source code:** :source:`Lib/pty.py`
fr: **Code source :** :source:`Lib/pty.py`

source: The :mod:`pty` module defines operations for handling the pseudo-terminal concept: starting another process and being able to write to and read from its controlling terminal programmatically.
fr: Le module :mod:`pty` expose des fonctions de manipulation de pseudo-terminaux, il permet d'écrire un programme capable de démarrer un autre processus, d'écrire et de lire depuis son terminal.

source: The :mod:`pty` module defines the following functions:
fr: Le module :mod:`pty` expose les fonctions suivantes :

source: Fork. Connect the child's controlling terminal to a pseudo-terminal. Return value is ``(pid, fd)``. Note that the child gets *pid* 0, and the *fd* is *invalid*. The parent's return value is the *pid* of the child, and *fd* is a file descriptor connected to the child's controlling terminal (and also to the child's standard input and output).
fr: *Fork*. Connecte le terminal contrôlé par le fils à un pseudo-terminal. La valeur renvoyée est ``(pid, fd)``. Notez que le fils obtient ``0`` comme *pid* et un *fd* non valide. Le parent obtient le *pid* du fils, et *fd* un descripteur de fichier connecté à un terminal contrôlé par le fils (et donc à l'entrée et la sortie standard du fils).

source: Open a new pseudo-terminal pair, using :func:`os.openpty` if possible, or emulation code for generic Unix systems. Return a pair of file descriptors ``(master, slave)``, for the master and the slave end, respectively.
fr: Ouvre une nouvelle paire de pseudo-terminaux, en utilisant si possible :func:`os.openpty`, ou du code émulant la fonctionnalité pour des systèmes *Unix* génériques. Renvoie une paire de descripteurs de fichier ``(master, slave)``, pour le maître et pour l'esclave respectivement.

source: Spawn a process, and connect its controlling terminal with the current process's standard io. This is often used to baffle programs which insist on reading from the controlling terminal. It is expected that the process spawned behind the pty will eventually terminate, and when it does *spawn* will return.
fr: Crée un nouveau processus et connecte son terminal aux entrées/sorties standard du processus courant. Cette stratégie est typiquement utilisée pour les programmes qui veulent lire depuis leur propre terminal. Le processus créé utilisant le *pty* est supposé se terminer et, quand il le fera, l'appel de *spawn* terminera.

source: The default implementation for both functions will read and return up to 1024 bytes each time the function is called. The *master_read* callback is passed the pseudoterminal’s master file descriptor to read output from the child process, and *stdin_read* is passed file descriptor 0, to read from the parent process's standard input.
fr: L'implémentation par défaut pour les deux fonctions lit et renvoie jusqu'à 1024 octets à chaque appel de la fonction. La fonction de rappel *master_read* reçoit le descripteur de fichier du pseudo-terminal maître pour lire la sortie du processus enfant, et *stdin_read* reçoit le descripteur de fichier 0, pour lire l'entrée standard du processus parent.

source: Returning an empty byte string from either callback is interpreted as an end-of-file (EOF) condition, and that callback will not be called after that. If *stdin_read* signals EOF the controlling terminal can no longer communicate with the parent process OR the child process. Unless the child process will quit without any input, *spawn* will then loop forever. If *master_read* signals EOF the same behavior results (on linux at least).
fr: Le renvoi d'une chaîne d'octets vide à partir de l'un ou l'autre des rappels est interprété comme une condition de fin de fichier (EOF), et ce rappel ne sera pas appelé après cela. Si *stdin_read* signale EOF, le terminal de contrôle ne peut plus communiquer avec le processus parent OU le processus enfant. À moins que le processus enfant ne quitte sans aucune entrée, *spawn* sera lancé dans une boucle infinie. Si *master_read* indique la fin de fichier, on aura le même comportement (sur Linux au moins).

source: :func:`spawn` now returns the status value from :func:`os.waitpid` on the child process.
fr: :func:`spawn` renvoie maintenant la valeur renvoyée par :func:`os.waitpid` sur le processus fils.

source: Example
fr: Exemple

source: The following program acts like the Unix command :manpage:`script(1)`, using a pseudo-terminal to record all input and output of a terminal session in a "typescript". ::
fr: Le programme suivant se comporte comme la commande Unix :manpage:`script(1)`, utilisant un pseudo-terminal pour enregistrer toutes les entrées et sorties d'une session dans un fichier *typescript*. ::
