Repository: python/python-docs-fr
Catalog: library/py_compile.po
Languages: fr

source: :mod:`py_compile` --- Compile Python source files
fr: :mod:`py_compile` — Compilation de sources Python

source: **Source code:** :source:`Lib/py_compile.py`
fr: **Code source :** :source:`Lib/py_compile.py`

source: The :mod:`py_compile` module provides a function to generate a byte-code file from a source file, and another function used when the module source file is invoked as a script.
fr: Le module :mod:`py_compile` définit une fonction principale qui génère un fichier de code intermédiaire à partir d'un fichier source. Il exporte également la fonction qu'il exécute quand il est lancé en tant que script.

source: Though not often needed, this function can be useful when installing modules for shared use, especially if some of the users may not have permission to write the byte-code cache files in the directory containing the source code.
fr: Bien que ce module ne soit pas d'usage fréquent, il peut servir lors de l'installation de bibliothèques partagées, notamment dans le cas où tous les utilisateurs n'ont pas les privilèges d'écriture dans l'emplacement d'installation.

source: Exception raised when an error occurs while attempting to compile the file.
fr: Exception levée quand une erreur se produit à la compilation.

source: The *doraise* and *quiet* arguments determine how errors are handled while compiling file. If *quiet* is 0 or 1, and *doraise* is false, the default behaviour is enabled: an error string is written to ``sys.stderr``, and the function returns ``None`` instead of a path. If *doraise* is true, a :exc:`PyCompileError` is raised instead. However if *quiet* is 2, no message is written, and *doraise* has no effect.
fr: Plus précisément, ce sont les arguments *doraise* et *quiet* qui déterminent la stratégie de gestion des erreurs. En effet, si *quiet* vaut 0 ou 1, et *doraise* est faux, le comportement par défaut s'applique : un message d'erreur est affiché dans ``sys.stderr``, et la fonction renvoie ``None`` au lieu d'un chemin. Au contraire, si *doraise* est vrai, une exception :exc:`PyCompileError` est levée, sauf si *quiet* vaut 2. Dans ce dernier cas, aucun message n'est émis, et *doraise* reste sans effet.

source: If the path that *cfile* becomes (either explicitly specified or computed) is a symlink or non-regular file, :exc:`FileExistsError` will be raised. This is to act as a warning that import will turn those paths into regular files if it is allowed to write byte-compiled files to those paths. This is a side-effect of import using file renaming to place the final byte-compiled file into place to prevent concurrent file writing issues.
fr: Si le chemin de destination, explicité par *cfile* ou choisi automatiquement, est un lien symbolique, ou n'est pas un véritable fichier, une exception de type :exc:`FileExistsError` est levée. Ceci, dans le but de vous avertir que le système d'importation changera ces chemins en fichiers s'il est autorisé à y écrire des fichiers de code intermédiaire. En effet, les importations passent par un renommage final du fichier de code intermédiaire vers sa destination, afin d'éviter les problèmes liés à l'écriture simultanée d'un même fichier par plusieurs processus.

source: *optimize* controls the optimization level and is passed to the built-in :func:`compile` function. The default of ``-1`` selects the optimization level of the current interpreter.
fr: *optimize* règle le niveau d'optimisation. Ce paramètre est passé directement à la fonction native :func:`compile`. Avec la valeur par défaut de ``-1``, le code intermédiaire hérite du niveau d'optimisation de l'interpréteur courant.

source: *invalidation_mode* should be a member of the :class:`PycInvalidationMode` enum and controls how the generated bytecode cache is invalidated at runtime. The default is :attr:`PycInvalidationMode.CHECKED_HASH` if the :envvar:`SOURCE_DATE_EPOCH` environment variable is set, otherwise the default is :attr:`PycInvalidationMode.TIMESTAMP`.
fr: *invalidation_mode* précise la manière dont le code intermédiaire produit est invalidé à son exécution. Il doit être un membre de l'énumération :class:`PycInvalidationMode`. La valeur par défaut est :attr:`PycInvalidationMode.TIMESTAMP`. Elle passe toutefois à :attr:`PycInvalidationMode.CHECKED_HASH` si la variable d'environnement :envvar:`SOURCE_DATE_EPOCH` est définie.

source: Changed default value of *cfile* to be :PEP:`3147`-compliant. Previous default was *file* + ``'c'`` (``'o'`` if optimization was enabled). Also added the *optimize* parameter.
fr: la méthode de choix de destination a changé au profit de celle décrite dans la :pep:`3147`. Auparavant, le nom du fichier de code intermédiaire était *file* + ``'c'`` (ou ``'o'`` lorsque les optimisations étaient actives). Le paramètre *optimize* a été ajouté.

source: Changed code to use :mod:`importlib` for the byte-code cache file writing. This means file creation/writing semantics now match what :mod:`importlib` does, e.g. permissions, write-and-move semantics, etc. Also added the caveat that :exc:`FileExistsError` is raised if *cfile* is a symlink or non-regular file.
fr: le code a été modifié pour faire appel à :mod:`importlib` dans les opérations d'écriture du code intermédiaire. Ce module se comporte donc exactement comme :mod:`importlib` en ce qui concerne, par exemple, les permissions, ou le renommage final qui garantit une opération atomique. :exc:`FileExistsError` est désormais levée si la destination est un lien symbolique ou n'est pas un véritable fichier.

source: The *invalidation_mode* parameter was added as specified in :pep:`552`. If the :envvar:`SOURCE_DATE_EPOCH` environment variable is set, *invalidation_mode* will be forced to :attr:`PycInvalidationMode.CHECKED_HASH`.
fr: le paramètre *invalidation_mode* a été ajouté comme requis par la :pep:`552`. Si la variable d'environnement :envvar:`SOURCE_DATE_EPOCH` est définie, *invalidation_mode* est ignoré, et :attr:`PycInvalidationMode.CHECKED_HASH` s'applique dans tous les cas.

source: The :envvar:`SOURCE_DATE_EPOCH` environment variable no longer overrides the value of the *invalidation_mode* argument, and determines its default value instead.
fr: La variable d'environnement :envvar:`SOURCE_DATE_EPOCH` n'a plus préséance sur le paramètre *invalidation_mode*, mais détermine seulement le comportement par défaut lorsque ce paramètre n'est pas passé.

source: The *quiet* parameter was added.
fr: ajout du paramètre *quiet*.

source: A enumeration of possible methods the interpreter can use to determine whether a bytecode file is up to date with a source file. The ``.pyc`` file indicates the desired invalidation mode in its header. See :ref:`pyc-invalidation` for more information on how Python invalidates ``.pyc`` files at runtime.
fr: Énumération des méthodes que l'interpréteur est susceptible d'appliquer afin de déterminer si un fichier de code intermédiaire est périmé par rapport à sa source. Les fichiers ``.pyc`` portent le mode d'invalidation désiré dans leur en-tête. Veuillez-vous référer à :ref:`pyc-invalidation` pour plus d'informations sur la manière dont Python invalide les fichiers ``.pyc`` à l'exécution.

source: The ``.pyc`` file includes the timestamp and size of the source file, which Python will compare against the metadata of the source file at runtime to determine if the ``.pyc`` file needs to be regenerated.
fr: Le fichier ``.pyc`` contient l'horodatage et la taille de la source. L'interpréteur inspecte les métadonnées du fichier source au moment de l'exécution, et régénère le fichier ``.pyc`` si elles ont changé.

source: The ``.pyc`` file includes a hash of the source file content, which Python will compare against the source at runtime to determine if the ``.pyc`` file needs to be regenerated.
fr: Le fichier ``.pyc`` porte une empreinte du code source. À l'exécution, elle est recalculée à partir de la source éventuellement modifiée, et le fichier ``.pyc`` est régénéré si les deux empreintes sont différentes.

source: Like :attr:`CHECKED_HASH`, the ``.pyc`` file includes a hash of the source file content. However, Python will at runtime assume the ``.pyc`` file is up to date and not validate the ``.pyc`` against the source file at all.
fr: Le principe est le même que :attr:`CHECKED_HASH`, mais à l'exécution, l'interpréteur considère systématiquement que le fichier ``.pyc`` est à jour, sans regarder la source.

source: This option is useful when the ``.pycs`` are kept up to date by some system external to Python like a build system.
fr: Cette option est utile lorsque les fichiers ``.pyc`` sont maintenus par un outil externe, comme un système d'intégration.

source: Command-Line Interface
fr: Interface en ligne de commande

source: Utilities to compile all Python source files in a directory tree.
fr: Utilitaires pour compiler des fichiers source Python dans une arborescence
