Repository: python/python-docs-fr
Catalog: library/pydoc.po
Languages: fr

source: :mod:`pydoc` --- Documentation generator and online help system
fr: :mod:`pydoc` — Générateur de documentation et système d’aide en ligne

source: **Source code:** :source:`Lib/pydoc.py`
fr: **Code source :** :source:`Lib/pydoc.py`

source: The :mod:`pydoc` module automatically generates documentation from Python modules. The documentation can be presented as pages of text on the console, served to a Web browser, or saved to HTML files.
fr: Le module :mod:`pydoc` génère automatiquement de la documentation à partir de modules Python. La documentation peut se présenter sous forme de pages de texte dans la console, rendue dans un navigateur web, ou sauvegardée dans des fichiers HTML.

source: For modules, classes, functions and methods, the displayed documentation is derived from the docstring (i.e. the :attr:`__doc__` attribute) of the object, and recursively of its documentable members. If there is no docstring, :mod:`pydoc` tries to obtain a description from the block of comment lines just above the definition of the class, function or method in the source file, or at the top of the module (see :func:`inspect.getcomments`).
fr: Pour les modules, classes, fonctions et méthodes, la documentation affichée est tirée de la *docstring* (c.-à-d. de l’attribut :attr:`__doc__`) de l’objet et ce, de manière récursive pour les membres qui peuvent être documentés. S’il n’y a pas de *docstring*, :mod:`pydoc` essaie d’obtenir une description à partir du bloc de commentaires juste au-dessus de la définition de la classe, fonction ou méthode du fichier source, ou en haut du module (voir :func:`inspect.getcomments`).

source: The built-in function :func:`help` invokes the online help system in the interactive interpreter, which uses :mod:`pydoc` to generate its documentation as text on the console. The same text documentation can also be viewed from outside the Python interpreter by running :program:`pydoc` as a script at the operating system's command prompt. For example, running ::
fr: La fonction native :func:`help` appelle le système d’aide en ligne dans l’interpréteur Python qui utilise :mod:`pydoc` pour générer sa documentation sous forme textuelle dans la console. Cette même documentation peut aussi être consultée à l’extérieur de l’interpréteur Python en lançant :program:`pydoc` dans le terminal du système d’exploitation. Par exemple en lançant ::

source: at a shell prompt will display documentation on the :mod:`sys` module, in a style similar to the manual pages shown by the Unix :program:`man` command. The argument to :program:`pydoc` can be the name of a function, module, or package, or a dotted reference to a class, method, or function within a module or module in a package. If the argument to :program:`pydoc` looks like a path (that is, it contains the path separator for your operating system, such as a slash in Unix), and refers to an existing Python source file, then documentation is produced for that file.
fr: dans un terminal, cela affiche la documentation du module :mod:`sys` dans un style similaire à la commande Unix :program:`man`. On peut passer comme argument à :program:`pydoc` le nom d’une fonction, d’un module, d’un paquet, ou une référence pointant vers une classe, une méthode, ou une fonction dans un module ou dans un paquet. Si l’argument passé à :program:`pydoc` est un chemin (c.-à-d. qu’il contient des séparateurs de chemin tels que la barre oblique ``/`` dans Unix), et fait référence à un fichier source Python existant, alors la documentation est générée pour ce fichier.

source: In order to find objects and their documentation, :mod:`pydoc` imports the module(s) to be documented. Therefore, any code on module level will be executed on that occasion. Use an ``if __name__ == '__main__':`` guard to only execute code when a file is invoked as a script and not just imported.
fr: Afin de trouver des objets et leur documentation, :mod:`pydoc` importe le ou les modules à documenter. Par conséquent tout code au niveau du module sera exécuté à cette occasion. Utiliser ``if __name__ == ‘__main__’:`` évite d’exécuter du code lorsqu’un fichier est appelé directement et non pas importé.

source: When printing output to the console, :program:`pydoc` attempts to paginate the output for easier reading. If the :envvar:`PAGER` environment variable is set, :program:`pydoc` will use its value as a pagination program.
fr: Lorsque l’on affiche une sortie sur la console, :program:`pydoc` essaye de créer une pagination pour faciliter la lecture. Si la variable d’environnement :envvar:`PAGER` est configurée, :program:`pydoc` utilise sa valeur comme programme de pagination.

source: Specifying a ``-w`` flag before the argument will cause HTML documentation to be written out to a file in the current directory, instead of displaying text on the console.
fr: Ajouter une option ``-w`` avant l’argument entraine l’enregistrement de la documentation HTML générée dans un fichier du répertoire courant au lieu de l’afficher dans la console.

source: Specifying a ``-k`` flag before the argument will search the synopsis lines of all available modules for the keyword given as the argument, again in a manner similar to the Unix :program:`man` command. The synopsis line of a module is the first line of its documentation string.
fr: Ajouter une option ``-w`` avant l’argument cherche les lignes de résumé de tous les modules disponibles pour le mot clé donné comme argument, ceci à la manière de la commande Unix :program:`man`. Les lignes de résumé d’un module sont les premières lignes de sa *docstring*.

source: You can also use :program:`pydoc` to start an HTTP server on the local machine that will serve documentation to visiting Web browsers. :program:`pydoc -p 1234` will start a HTTP server on port 1234, allowing you to browse the documentation at ``http://localhost:1234/`` in your preferred Web browser. Specifying ``0`` as the port number will select an arbitrary unused port.
fr: Vous pouvez aussi utiliser :program:`pydoc` pour lancer un serveur HTTP sur votre machine locale qui rendra la documentation consultable sur votre navigateur Web. :program:`pydoc -p 1234` lancera un serveur HTTP sur le port 1234, permettant de consulter la documentation à l’adresse ``http://localhost:1234/`` dans votre navigateur web préféré. En précisant ``0`` comme numéro de port, un port non utilisé sera aléatoirement alloué.

source: :program:`pydoc -n <hostname>` will start the server listening at the given hostname. By default the hostname is 'localhost' but if you want the server to be reached from other machines, you may want to change the host name that the server responds to. During development this is especially useful if you want to run pydoc from within a container.
fr: :program:`pydoc -n <hostname>` démarre le serveur en écoutant sur le port donné en argument. Par défaut le nom d’hôte est *localhost* mais si vous voulez que le serveur soit joignable par d’autres machines, vous avez la possibilité de changer le nom de l’hôte auquel le serveur répond. Dans le développement, c’est particulièrement utile si vous souhaitez exécuter :program:`pydoc` depuis un conteneur.

source: :program:`pydoc -b` will start the server and additionally open a web browser to a module index page. Each served page has a navigation bar at the top where you can *Get* help on an individual item, *Search* all modules with a keyword in their synopsis line, and go to the *Module index*, *Topics* and *Keywords* pages.
fr: :program:`pydoc -b` démarre le serveur et ouvrira en plus un navigateur web vers une page d’index de module. Chaque page affichée a une barre de navigation en haut où vous pouvez *Obtenir* de l’aide sur un élément individuel, *Rechercher* tous les modules avec un mot-clé dans leur ligne de résumé, et aller dans les pages *Index des modules*, *Thèmes* et *Mots clés*.

source: When :program:`pydoc` generates documentation, it uses the current environment and path to locate modules. Thus, invoking :program:`pydoc spam` documents precisely the version of the module you would get if you started the Python interpreter and typed ``import spam``.
fr: Quand :program:`pydoc` génère de la documentation, il utilise l’environnement et le chemin courant pour localiser les modules. Ainsi, en invoquant les documents :program:`pydoc spam` en précisant la version du module, vous obtenez le même résultat qu’en lançant l’interpréteur Python et en tapant la commande ``import spam``.

source: Module docs for core modules are assumed to reside in ``https://docs.python.org/X.Y/library/`` where ``X`` and ``Y`` are the major and minor version numbers of the Python interpreter. This can be overridden by setting the :envvar:`PYTHONDOCS` environment variable to a different URL or to a local directory containing the Library Reference Manual pages.
fr: La documentation des modules principaux est supposée être hébergée sur ``https://docs.python.org/X.Y/library/`` et ``https://docs.python.org/fr/X.Y/library`` pour la version française, où ``X`` et ``Y`` sont les versions respectivement majeures et mineures de l’interpréteur Python. Ces valeurs peuvent être redéfinies en configurant la variable d’environnement :envvar:`PYTHONDOCS` sur une URL différente ou un répertoire local contenant les pages du manuel de la bibliothèque de référence.

source: Added the ``-b`` option.
fr: Ajout de l’option ``-b``.

source: The ``-g`` command line option was removed.
fr: Suppression de l’option ``-g``.

source: :mod:`pydoc` now uses :func:`inspect.signature` rather than :func:`inspect.getfullargspec` to extract signature information from callables.
fr: :mod:`pydoc` utilise à présent :func:`inspect.signature` plutôt que :func:`inspect.getfullargspec` pour extraire les informations de signatures des *callables*.

source: Added the ``-n`` option.
fr: Ajout de l’option ``-n``.
