Repository: python/python-docs-fr
Catalog: library/random.po
Languages: fr

source: :mod:`random` --- Generate pseudo-random numbers
fr: :mod:`random` --- Génère des nombres pseudo-aléatoires

source: **Source code:** :source:`Lib/random.py`
fr: **Code source :** :source:`Lib/random.py`

source: This module implements pseudo-random number generators for various distributions.
fr: Ce module implémente des générateurs de nombres pseudo-aléatoires pour différentes distributions.

source: For integers, there is uniform selection from a range. For sequences, there is uniform selection of a random element, a function to generate a random permutation of a list in-place, and a function for random sampling without replacement.
fr: Pour les entiers, il existe une sélection uniforme à partir d'une plage. Pour les séquences, il existe une sélection uniforme d'un élément aléatoire, une fonction pour générer une permutation aléatoire d'une liste sur place et une fonction pour un échantillonnage aléatoire sans remplacement.

source: On the real line, there are functions to compute uniform, normal (Gaussian), lognormal, negative exponential, gamma, and beta distributions. For generating distributions of angles, the von Mises distribution is available.
fr: Pour l'ensemble des réels, il y a des fonctions pour calculer des distributions uniformes, normales (gaussiennes), log-normales, exponentielles négatives, gamma et bêta. Pour générer des distributions d'angles, la distribution de *von Mises* est disponible.

source: Almost all module functions depend on the basic function :func:`.random`, which generates a random float uniformly in the semi-open range [0.0, 1.0). Python uses the Mersenne Twister as the core generator. It produces 53-bit precision floats and has a period of 2\*\*19937-1. The underlying implementation in C is both fast and threadsafe. The Mersenne Twister is one of the most extensively tested random number generators in existence. However, being completely deterministic, it is not suitable for all purposes, and is completely unsuitable for cryptographic purposes.
fr: Presque toutes les fonctions du module dépendent de la fonction de base :func:`.random`, qui génère un nombre à virgule flottante aléatoire de façon uniforme dans la plage semi-ouverte [0.0, 1.0). Python utilise l'algorithme *Mersenne Twister* comme générateur de base. Il produit des flottants de précision de 53 bits et a une période de 2\*\*19937-1. L'implémentation sous-jacente en C est à la fois rapide et compatible avec les programmes ayant de multiples fils d'exécution. Le *Mersenne Twister* est l'un des générateurs de nombres aléatoires les plus largement testés qui existent. Cependant, étant complètement déterministe, il n'est pas adapté à tous les usages et est totalement inadapté à des fins cryptographiques.

source: The functions supplied by this module are actually bound methods of a hidden instance of the :class:`random.Random` class. You can instantiate your own instances of :class:`Random` to get generators that don't share state.
fr: Les fonctions fournies par ce module dépendent en réalité de méthodes d’une instance cachée de la classe :class:`random.Random`. Vous pouvez créer vos propres instances de :class:`Random` pour obtenir des générateurs sans états partagés.

source: Class :class:`Random` can also be subclassed if you want to use a different basic generator of your own devising: in that case, override the :meth:`~Random.random`, :meth:`~Random.seed`, :meth:`~Random.getstate`, and :meth:`~Random.setstate` methods. Optionally, a new generator can supply a :meth:`~Random.getrandbits` method --- this allows :meth:`randrange` to produce selections over an arbitrarily large range.
fr: La classe :class:`Random` peut également être sous-classée si vous voulez utiliser un générateur de base différent, de votre propre conception. Dans ce cas, remplacez les méthodes :meth:`~Random.random`, :meth:`~Random.seed`, :meth:`~Random.gettsate` et :meth:`~Random.setstate`. En option, un nouveau générateur peut fournir une méthode :meth:`~Random.getrandbits` --- ce qui permet à :meth:`randrange` de produire des sélections sur une plage de taille arbitraire.

source: The :mod:`random` module also provides the :class:`SystemRandom` class which uses the system function :func:`os.urandom` to generate random numbers from sources provided by the operating system.
fr: Le module :mod:`random` fournit également la classe :class:`SystemRandom` qui utilise la fonction système :func:`os.urandom` pour générer des nombres aléatoires à partir de sources fournies par le système d'exploitation.

source: The pseudo-random generators of this module should not be used for security purposes. For security or cryptographic uses, see the :mod:`secrets` module.
fr: Les générateurs pseudo-aléatoires de ce module ne doivent pas être utilisés à des fins de sécurité. Pour des utilisations de sécurité ou cryptographiques, voir le module :mod:`secrets`.

source: M. Matsumoto and T. Nishimura, "Mersenne Twister: A 623-dimensionally equidistributed uniform pseudorandom number generator", ACM Transactions on Modeling and Computer Simulation Vol. 8, No. 1, January pp.3--30 1998.
fr: *M. Matsumoto and T. Nishimura, "Mersenne Twister: A 623-dimensionally equidistributed uniform pseudorandom number generator", ACM Transactions on Modeling and Computer Simulation Vol. 8, No. 1,* Janvier pp.3--30 1998.

source: `Complementary-Multiply-with-Carry recipe <https://code.activestate.com/recipes/576707/>`_ for a compatible alternative random number generator with a long period and comparatively simple update operations.
fr: `Complementary-Multiply-with-Carry recipe <https://code.activestate.com/recipes/576707/>`_ pour un autre générateur de nombres aléatoires avec une longue période et des opérations de mise à jour relativement simples.

source: Bookkeeping functions
fr: Fonctions de gestion d'état

source: Initialize the random number generator.
fr: Initialise le générateur de nombres aléatoires.

source: If *a* is omitted or ``None``, the current system time is used. If randomness sources are provided by the operating system, they are used instead of the system time (see the :func:`os.urandom` function for details on availability).
fr: Si *a* est omis ou ``None``, l'heure système actuelle est utilisée. Si des sources aléatoires sont fournies par le système d'exploitation, elles sont utilisées à la place de l'heure système (voir la fonction :func:`os.urandom` pour les détails sur la disponibilité).

source: If *a* is an int, it is used directly.
fr: Si *a* est un entier, il est utilisé directement.

source: With version 2 (the default), a :class:`str`, :class:`bytes`, or :class:`bytearray` object gets converted to an :class:`int` and all of its bits are used.
fr: Avec la version 2 (par défaut), un objet :class:`str`, :class:`bytes` ou :class:`bytearray` est converti en :class:`int` et tous ses bits sont utilisés.

source: With version 1 (provided for reproducing random sequences from older versions of Python), the algorithm for :class:`str` and :class:`bytes` generates a narrower range of seeds.
fr: Avec la version 1 (fournie pour reproduire des séquences aléatoires produites par d'anciennes versions de Python), l'algorithme pour :class:`str` et :class:`bytes` génère une gamme plus étroite de graines.

source: Moved to the version 2 scheme which uses all of the bits in a string seed.
fr: Passée à la version 2 du schéma qui utilise tous les bits d'une graine de chaîne de caractères.

source: In the future, the *seed* must be one of the following types: *NoneType*, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, or :class:`bytearray`.
fr: À l’avenir, la *graine* devra être de l’un des types suivants : *NoneType*, :class:`int`, :class:`float`, :class:`str`, :class:`bytes` ou :class:`bytearray`.

source: Return an object capturing the current internal state of the generator. This object can be passed to :func:`setstate` to restore the state.
fr: Renvoie un objet capturant l'état interne actuel du générateur. Cet objet peut être passé à :func:`setstate` pour restaurer cet état.

source: *state* should have been obtained from a previous call to :func:`getstate`, and :func:`setstate` restores the internal state of the generator to what it was at the time :func:`getstate` was called.
fr: Il convient que *state* ait été obtenu à partir d'un appel précédent à :func:`getstate`, et :func:`setstate` restaure l'état interne du générateur à ce qu'il était au moment où :func:`getstate` a été appelé.

source: Functions for bytes
fr: Fonctions pour les octets

source: Generate *n* random bytes.
fr: Génère *n* octets aléatoires.

source: This method should not be used for generating security tokens. Use :func:`secrets.token_bytes` instead.
fr: Cette méthode ne doit pas être utilisée pour générer des jetons de sécurité. Utiliser :func:`secrets.token_bytes` à la place.

source: Functions for integers
fr: Fonctions pour les entiers

source: Return a randomly selected element from ``range(start, stop, step)``. This is equivalent to ``choice(range(start, stop, step))``, but doesn't actually build a range object.
fr: Renvoie un élément sélectionné aléatoirement à partir de ``range(start, stop, step)``. C'est équivalent à ``choice(range(start, stop, step))``, mais ne construit pas réellement un objet range.

source: The positional argument pattern matches that of :func:`range`. Keyword arguments should not be used because the function may use them in unexpected ways.
fr: Le motif d'argument positionnel correspond à celui de :func:`range`. N'utilisez pas d'arguments nommés parce que la fonction peut les utiliser de manière inattendue.

source: :meth:`randrange` is more sophisticated about producing equally distributed values. Formerly it used a style like ``int(random()*n)`` which could produce slightly uneven distributions.
fr: :meth:`randrange` est plus sophistiquée dans la production de valeurs uniformément distribuées. Auparavant, elle utilisait un style comme ``int(random()*n)`` qui pouvait produire des distributions légèrement inégales.

source: The automatic conversion of non-integer types to equivalent integers is deprecated. Currently ``randrange(10.0)`` is losslessly converted to ``randrange(10)``. In the future, this will raise a :exc:`TypeError`.
fr: La conversion automatique des types non-entiers est obsolète. Actuellement, ``randrange(10.0)`` est convertie sans perte en ``randrange(10)``. À l’avenir, une exception :exc:`TypeError` sera levée.

source: The exception raised for non-integral values such as ``randrange(10.5)`` or ``randrange('10')`` will be changed from :exc:`ValueError` to :exc:`TypeError`.
fr: L’exception levée pour les valeurs non-entières telles que ``randrange(10.5)`` ou ``randrange(’10’)`` changeront de :exc:`ValueError` à :exc:`TypeError`.

source: Return a random integer *N* such that ``a <= N <= b``. Alias for ``randrange(a, b+1)``.
fr: Renvoie un entier aléatoire *N* tel que ``a <= N <= b``. Alias pour ``randrange(a, b+1)``.

source: Returns a non-negative Python integer with *k* random bits. This method is supplied with the MersenneTwister generator and some other generators may also provide it as an optional part of the API. When available, :meth:`getrandbits` enables :meth:`randrange` to handle arbitrarily large ranges.
fr: Renvoie un entier Python non négatif avec *k* bits aléatoires. Cette méthode est fournie avec le générateur MersenneTwister. Quelques autres générateurs peuvent également la fournir en option comme partie de l'API. Lorsqu'elle est disponible, :meth:`getrandbits` permet à :meth:`randrange` de gérer des gammes arbitrairement larges.

source: This method now accepts zero for *k*.
fr: Cette méthode accepte désormais zéro pour *k*.

source: Functions for sequences
fr: Fonctions pour les séquences

source: Return a random element from the non-empty sequence *seq*. If *seq* is empty, raises :exc:`IndexError`.
fr: Renvoie un élément aléatoire de la séquence non vide *seq*. Si *seq* est vide, lève :exc:`IndexError`.

source: Return a *k* sized list of elements chosen from the *population* with replacement. If the *population* is empty, raises :exc:`IndexError`.
fr: Renvoie une liste de taille *k* d'éléments choisis dans la *population* avec remise. Si la *population* est vide, lève :exc:`IndexError`.

source: If a *weights* sequence is specified, selections are made according to the relative weights. Alternatively, if a *cum_weights* sequence is given, the selections are made according to the cumulative weights (perhaps computed using :func:`itertools.accumulate`). For example, the relative weights ``[10, 5, 30, 5]`` are equivalent to the cumulative weights ``[10, 15, 45, 50]``. Internally, the relative weights are converted to cumulative weights before making selections, so supplying the cumulative weights saves work.
fr: Si une séquence de *poids* est spécifiée, les tirages sont effectués en fonction des poids relatifs. Alternativement, si une séquence *cum_weights* est donnée, les tirages sont faits en fonction des poids cumulés (peut-être calculés en utilisant :func:`itertools.accumulate`). Par exemple, les poids relatifs ``[10, 5, 30, 5]`` sont équivalents aux poids cumulatifs ``[10, 15, 45, 50]``. En interne, les poids relatifs sont convertis en poids cumulatifs avant d'effectuer les tirages, ce qui vous permet d'économiser du travail en fournissant des pondérations cumulatives.

source: If neither *weights* nor *cum_weights* are specified, selections are made with equal probability. If a weights sequence is supplied, it must be the same length as the *population* sequence. It is a :exc:`TypeError` to specify both *weights* and *cum_weights*.
fr: Si ni *weights* ni *cum_weights* ne sont spécifiés, les tirages sont effectués avec une probabilité uniforme. Si une séquence de poids est fournie, elle doit être de la même longueur que la séquence *population*. Spécifier à la fois *weights* et *cum_weights* lève une :exc:`TypeError`.

source: The *weights* or *cum_weights* can use any numeric type that interoperates with the :class:`float` values returned by :func:`random` (that includes integers, floats, and fractions but excludes decimals). Weights are assumed to be non-negative and finite. A :exc:`ValueError` is raised if all weights are zero.
fr: Les *weights* ou *cum_weights* peuvent utiliser n'importe quel type numérique interopérable avec les valeurs :class:`float` renvoyées par :func:`random` (qui inclut les entiers, les flottants et les fractions mais exclut les décimaux). Les poids sont présumés être non négatifs et finis. Une exception :exc:`ValueError` est levée si tous les poids sont à zéro.

source: For a given seed, the :func:`choices` function with equal weighting typically produces a different sequence than repeated calls to :func:`choice`. The algorithm used by :func:`choices` uses floating point arithmetic for internal consistency and speed. The algorithm used by :func:`choice` defaults to integer arithmetic with repeated selections to avoid small biases from round-off error.
fr: Pour une graine donnée, la fonction :func:`choices` avec pondération uniforme produit généralement une séquence différente des appels répétés à :func:`choice`. L'algorithme utilisé par :func:`choices` utilise l'arithmétique à virgule flottante pour la cohérence interne et la vitesse. L'algorithme utilisé par :func:`choice` utilise par défaut l'arithmétique entière avec des tirages répétés pour éviter les petits biais dus aux erreurs d'arrondi.

source: Raises a :exc:`ValueError` if all weights are zero.
fr: Lève une :exc:`ValueError` si tous les poids sont à zéro.

source: Shuffle the sequence *x* in place.
fr: Mélange la séquence *x* sans créer de nouvelle instance (« sur place »).

source: The optional argument *random* is a 0-argument function returning a random float in [0.0, 1.0); by default, this is the function :func:`.random`.
fr: L'argument optionnel *random* est une fonction sans argument renvoyant un nombre aléatoire à virgule flottante dans [0.0, 1.0[ ; par défaut, c'est la fonction :func:`.random`.

source: To shuffle an immutable sequence and return a new shuffled list, use ``sample(x, k=len(x))`` instead.
fr: Pour mélanger une séquence immuable et renvoyer une nouvelle liste mélangée, utilisez ``sample(x, k=len(x))`` à la place.

source: Note that even for small ``len(x)``, the total number of permutations of *x* can quickly grow larger than the period of most random number generators. This implies that most permutations of a long sequence can never be generated. For example, a sequence of length 2080 is the largest that can fit within the period of the Mersenne Twister random number generator.
fr: Notez que même pour les petits ``len(x)``, le nombre total de permutations de *x* peut rapidement devenir plus grand que la période de la plupart des générateurs de nombres aléatoires. Cela implique que la plupart des permutations d'une longue séquence ne peuvent jamais être générées. Par exemple, une séquence de longueur 2080 est la plus grande qui puisse tenir dans la période du générateur de nombres aléatoires Mersenne Twister.

source: The optional parameter *random*.
fr: Le paramètre optionnel *random*.

source: Return a *k* length list of unique elements chosen from the population sequence or set. Used for random sampling without replacement.
fr: Renvoie une liste de *k* éléments uniques choisis dans la séquence ou l'ensemble de la population. Utilisé pour un tirage aléatoire sans remise.

source: Returns a new list containing elements from the population while leaving the original population unchanged. The resulting list is in selection order so that all sub-slices will also be valid random samples. This allows raffle winners (the sample) to be partitioned into grand prize and second place winners (the subslices).
fr: Renvoie une nouvelle liste contenant des éléments de la population tout en laissant la population originale inchangée. La liste résultante est classée par ordre de sélection de sorte que toutes les sous-tranches soient également des échantillons aléatoires valides. Cela permet aux gagnants du tirage (l'échantillon) d'être divisés en gagnants du grand prix et en gagnants de la deuxième place (les sous-tranches).

source: Members of the population need not be :term:`hashable` or unique. If the population contains repeats, then each occurrence is a possible selection in the sample.
fr: Les membres de la population n'ont pas besoin d'être :term:`hachables<hashable>` ou uniques. Si la population contient des répétitions, alors chaque occurrence est un tirage possible dans l'échantillon.

source: Repeated elements can be specified one at a time or with the optional keyword-only *counts* parameter. For example, ``sample(['red', 'blue'], counts=[4, 2], k=5)`` is equivalent to ``sample(['red', 'red', 'red', 'red', 'blue', 'blue'], k=5)``.
fr: Les éléments répétés peuvent être spécifiés un à la fois ou avec le paramètre optionnel uniquement nommé *counts*. Par exemple, ``sample([‘red’, ‘blue’], counts=[4, 2], k=5)`` est équivalent à ``sample([‘red’, ‘red’, ‘red’, ‘red’, ‘blue’, ‘blue’], k=5)``.

source: To choose a sample from a range of integers, use a :func:`range` object as an argument. This is especially fast and space efficient for sampling from a large population: ``sample(range(10000000), k=60)``.
fr: Pour choisir un échantillon parmi un intervalle d'entiers, utilisez un objet :func:`range` comme argument. Ceci est particulièrement rapide et économe en mémoire pour un tirage dans une grande population : ``échantillon(range(10000000), k=60)``.

source: If the sample size is larger than the population size, a :exc:`ValueError` is raised.
fr: Si la taille de l'échantillon est supérieure à la taille de la population, une :exc:`ValueError` est levée.

source: Added the *counts* parameter.
fr: Ajoute le paramètre *counts*.

source: In the future, the *population* must be a sequence. Instances of :class:`set` are no longer supported. The set must first be converted to a :class:`list` or :class:`tuple`, preferably in a deterministic order so that the sample is reproducible.
fr: À l’avenir, la *population* devra être une séquence. Les instances de :class:`set` ne sont plus prises en charge. Le *set* doit d’abord être converti en une :class:`list` ou :class:`tuple`, de préférence dans un ordre déterministe de telle sorte que l’échantillon soit reproductible.

source: Real-valued distributions
fr: Distributions pour les nombres réels

source: The following functions generate specific real-valued distributions. Function parameters are named after the corresponding variables in the distribution's equation, as used in common mathematical practice; most of these equations can be found in any statistics text.
fr: Les fonctions suivantes génèrent des distributions spécifiques en nombre réels. Les paramètres de fonction sont nommés d'après les variables correspondantes de l'équation de la distribution, telles qu'elles sont utilisées dans la pratique mathématique courante ; la plupart de ces équations peuvent être trouvées dans tout document traitant de statistiques.

source: Return the next random floating point number in the range [0.0, 1.0).
fr: Renvoie le nombre aléatoire à virgule flottante suivant dans la plage [0.0, 1.0).

source: Return a random floating point number *N* such that ``a <= N <= b`` for ``a <= b`` and ``b <= N <= a`` for ``b < a``.
fr: Renvoie un nombre aléatoire à virgule flottante *N* tel que ``a <= N <= b`` pour ``a <= b`` et ``b <= N <= a`` pour ``b < a``.

source: The end-point value ``b`` may or may not be included in the range depending on floating-point rounding in the equation ``a + (b-a) * random()``.
fr: La valeur finale ``b`` peut ou non être incluse dans la plage selon l'arrondi à virgule flottante dans l'équation ``a + (b-a) * random()``.

source: Return a random floating point number *N* such that ``low <= N <= high`` and with the specified *mode* between those bounds. The *low* and *high* bounds default to zero and one. The *mode* argument defaults to the midpoint between the bounds, giving a symmetric distribution.
fr: Renvoie un nombre aléatoire en virgule flottante *N* tel que ``low <= N <= high`` et avec le *mode* spécifié entre ces bornes. Les limites *low* et *high* par défaut sont zéro et un. L'argument *mode* est par défaut le point médian entre les bornes, ce qui donne une distribution symétrique.

source: Beta distribution. Conditions on the parameters are ``alpha > 0`` and ``beta > 0``. Returned values range between 0 and 1.
fr: Distribution bêta. Les conditions sur les paramètres sont ``alpha > 0`` et ``beta > 0``. Les valeurs renvoyées varient entre 0 et 1.

source: Exponential distribution. *lambd* is 1.0 divided by the desired mean. It should be nonzero. (The parameter would be called "lambda", but that is a reserved word in Python.) Returned values range from 0 to positive infinity if *lambd* is positive, and from negative infinity to 0 if *lambd* is negative.
fr: Distribution exponentielle. *lambd* est 1,0 divisé par la moyenne désirée. Ce ne doit pas être zéro. (Le paramètre aurait dû s'appeler "lambda", mais c'est un mot réservé en Python.) Les valeurs renvoyées vont de 0 à plus l'infini positif si *lambd* est positif, et de moins l'infini à 0 si *lambd* est négatif.

source: Gamma distribution. (*Not* the gamma function!) Conditions on the parameters are ``alpha > 0`` and ``beta > 0``.
fr: Distribution gamma. (*Ce n'est pas* la fonction gamma !) Les conditions sur les paramètres sont ``alpha > 0`` et ``beta > 0``.

source: The probability distribution function is::
fr: La fonction de distribution de probabilité est ::
