Repository: python/python-docs-fr
Catalog: library/random.po
Languages: fr

source: Normal distribution, also called the Gaussian distribution. *mu* is the mean, and *sigma* is the standard deviation. This is slightly faster than the :func:`normalvariate` function defined below.
fr: Distributions normales, aussi appelées distribution gaussiennes. *mu* est la moyenne et *sigma* est l’écart type. C'est légèrement plus rapide que la fonction :func:`normalvariate` définie ci-dessous.

source: Multithreading note: When two threads call this function simultaneously, it is possible that they will receive the same return value. This can be avoided in three ways. 1) Have each thread use a different instance of the random number generator. 2) Put locks around all calls. 3) Use the slower, but thread-safe :func:`normalvariate` function instead.
fr: Note sur les fils d’exécution multiples (*Multithreading*) : quand deux fils d’exécution appellent cette fonction simultanément, il est possible qu’ils reçoivent la même valeur de retour. On peut l’éviter de 3 façons. 1) Avoir chaque fil utilisant une instance différente du générateur de nombres aléatoires. 2) Mettre des verrous autour de tous les appels. 3) Utiliser la fonction plus lente, mais compatible avec les programmes à fils d’exécution multiples, :func:`normalvariate` à la place.

source: Log normal distribution. If you take the natural logarithm of this distribution, you'll get a normal distribution with mean *mu* and standard deviation *sigma*. *mu* can have any value, and *sigma* must be greater than zero.
fr: Logarithme de la distribution normale. Si vous prenez le logarithme naturel de cette distribution, vous obtiendrez une distribution normale avec *mu* moyen et écart-type *sigma*. *mu* peut avoir n'importe quelle valeur et *sigma* doit être supérieur à zéro.

source: Normal distribution. *mu* is the mean, and *sigma* is the standard deviation.
fr: Distribution normale. *mu* est la moyenne et *sigma* est l'écart type.

source: *mu* is the mean angle, expressed in radians between 0 and 2\*\ *pi*, and *kappa* is the concentration parameter, which must be greater than or equal to zero. If *kappa* is equal to zero, this distribution reduces to a uniform random angle over the range 0 to 2\*\ *pi*.
fr: *mu* est l'angle moyen, exprimé en radians entre 0 et 2\*\ *pi*, et *kappa* est le paramètre de concentration, qui doit être supérieur ou égal à zéro. Si *kappa* est égal à zéro, cette distribution se réduit à un angle aléatoire uniforme sur la plage de 0 à 2\*\ *pi*.

source: Pareto distribution. *alpha* is the shape parameter.
fr: Distribution de Pareto. *alpha* est le paramètre de forme.

source: Weibull distribution. *alpha* is the scale parameter and *beta* is the shape parameter.
fr: Distribution de Weibull. *alpha* est le paramètre de l'échelle et *beta* est le paramètre de forme.

source: Alternative Generator
fr: Générateur alternatif

source: Class that implements the default pseudo-random number generator used by the :mod:`random` module.
fr: Classe qui implémente le générateur de nombres pseudo-aléatoires par défaut utilisé par le module :mod:`random`.

source: In the future, the *seed* must be one of the following types: :class:`NoneType`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, or :class:`bytearray`.
fr: À l’avenir, la *graine* devra être de l’un des types suivants : :class:`NoneType`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes` ou :class:`bytearray`.

source: Class that uses the :func:`os.urandom` function for generating random numbers from sources provided by the operating system. Not available on all systems. Does not rely on software state, and sequences are not reproducible. Accordingly, the :meth:`seed` method has no effect and is ignored. The :meth:`getstate` and :meth:`setstate` methods raise :exc:`NotImplementedError` if called.
fr: Classe qui utilise la fonction :func:`os.urandom` pour générer des nombres aléatoires à partir de sources fournies par le système d'exploitation. Non disponible sur tous les systèmes. Ne repose pas sur un état purement logiciel et les séquences ne sont pas reproductibles. Par conséquent, la méthode :meth:`seed` n'a aucun effet et est ignorée. Les méthodes :meth:`getstate` et :meth:`setstate` lèvent :exc:`NotImplementedError` si vous les appelez.

source: Notes on Reproducibility
fr: Remarques sur la reproductibilité

source: Sometimes it is useful to be able to reproduce the sequences given by a pseudo-random number generator. By re-using a seed value, the same sequence should be reproducible from run to run as long as multiple threads are not running.
fr: Il est parfois utile de pouvoir reproduire les séquences données par un générateur de nombres pseudo-aléatoires. En réutilisant la même graine, la même séquence devrait être reproductible d'une exécution à l'autre tant que plusieurs fils d’exécution ne sont pas en cours.

source: Most of the random module's algorithms and seeding functions are subject to change across Python versions, but two aspects are guaranteed not to change:
fr: La plupart des algorithmes et des fonctions de génération de graine du module aléatoire sont susceptibles d'être modifiés d'une version à l'autre de Python, mais deux aspects sont garantis de ne pas changer ::

source: If a new seeding method is added, then a backward compatible seeder will be offered.
fr: Si une nouvelle méthode de génération de graine est ajoutée, une fonction rétro-compatible sera offerte.

source: The generator's :meth:`~Random.random` method will continue to produce the same sequence when the compatible seeder is given the same seed.
fr: La méthode :meth:`~Random.random` du générateur continuera à produire la même séquence lorsque la fonction de génération de graine compatible recevra la même semence.

source: Examples
fr: Exemples

source: Basic examples::
fr: Exemples de base ::

source: Example of `statistical bootstrapping <https://en.wikipedia.org/wiki/Bootstrapping_(statistics)>`_ using resampling with replacement to estimate a confidence interval for the mean of a sample::
fr: Exemple de `*bootstrapping* statistique <https://fr.wikipedia.org/wiki/Bootstrap_(statistiques)>`_ utilisant le ré-échantillonnage avec remise pour estimer un intervalle de confiance pour la moyenne d'un échantillon ::

source: Example of a `resampling permutation test <https://en.wikipedia.org/wiki/Resampling_(statistics)#Permutation_tests>`_ to determine the statistical significance or `p-value <https://en.wikipedia.org/wiki/P-value>`_ of an observed difference between the effects of a drug versus a placebo::
fr: Exemple d'un `*resampling permutation test* <https://en.wikipedia.org/wiki/Resampling_(statistics)#Permutation_tests>`_ pour déterminer la signification statistique ou `valeur p <https://fr.wikipedia.org/wiki/Valeur_p>`_ d'une différence observée entre les effets d'un médicament et ceux d'un placebo ::

source: Simulation of arrival times and service deliveries for a multiserver queue::
fr: Simulation des heures d'arrivée et des livraisons de services pour une file d'attente de serveurs ::

source: `Statistics for Hackers <https://www.youtube.com/watch?v=Iq9DzN6mvYA>`_ a video tutorial by `Jake Vanderplas <https://us.pycon.org/2016/speaker/profile/295/>`_ on statistical analysis using just a few fundamental concepts including simulation, sampling, shuffling, and cross-validation.
fr: `Statistics for Hackers <https://www.youtube.com/watch?v=Iq9DzN6mvYA>`_ un tutoriel vidéo par `Jake Vanderplas <https://us.pycon.org/2016/speaker/profile/295/>`_ sur l'analyse statistique en utilisant seulement quelques concepts fondamentaux dont la simulation, l'échantillonnage, le brassage et la validation croisée.

source: Recipes
fr: Cas pratiques

source: The default :func:`.random` returns multiples of 2⁻⁵³ in the range *0.0 ≤ x < 1.0*. All such numbers are evenly spaced and are exactly representable as Python floats. However, many other representable floats in that interval are not possible selections. For example, ``0.05954861408025609`` isn't an integer multiple of 2⁻⁵³.
fr: Par défaut :func:`.random` renvoie des multiples de 2⁻⁵³ dans la plage *0.0 ≤ x < 1.0*. Tous ces nombres sont uniformément répartis et sont représentés exactement en tant que nombre à virgule flottante Python. Cependant, de nombreux autres nombres à virgule flottante dans cette plage, et représentables en Python, ne sont pas sélectionnables. Par exemple ``0.05954861408025609`` n’est pas un multiple de 2⁻⁵³.

source: The following recipe takes a different approach. All floats in the interval are possible selections. The mantissa comes from a uniform distribution of integers in the range *2⁵² ≤ mantissa < 2⁵³*. The exponent comes from a geometric distribution where exponents smaller than *-53* occur half as often as the next larger exponent.
fr: La recette suivante utilise une approche différente. Tous les nombres à virgule flottante de l’intervalle sont sélectionnables. La mantisse provient d’une distribution uniforme d’entiers dans la plage *2⁵² ≤ mantisse < 2⁵³*. L’exposant provient d’une distribution géométrique où les exposants plus petits que *-53* apparaissent moitié moins souvent que l’exposant suivant juste plus grand.

source: All :ref:`real valued distributions <real-valued-distributions>` in the class will use the new method::
fr: Toutes les :ref:`real valued distributions <real-valued-distributions>` dans la classe seront utilisées dans la nouvelle méthode ::

source: The recipe is conceptually equivalent to an algorithm that chooses from all the multiples of 2⁻¹⁰⁷⁴ in the range *0.0 ≤ x < 1.0*. All such numbers are evenly spaced, but most have to be rounded down to the nearest representable Python float. (The value 2⁻¹⁰⁷⁴ is the smallest positive unnormalized float and is equal to ``math.ulp(0.0)``.)
fr: La recette est conceptuellement équivalente à un algorithme qui choisit parmi tous les multiples de 2⁻¹⁰⁷⁴ dans la plage *0.0 ≤ x < 1.0*. Tous ces nombres sont uniformément répartis, mais la plupart doivent être arrondis au nombre à virgule Python inférieur. (La valeur 2⁻¹⁰⁷⁴ est le plus petit nombre à virgule flottante positif et est égal à ``math.ulp(0.0)``.)

source: `Generating Pseudo-random Floating-Point Values <https://allendowney.com/research/rand/downey07randfloat.pdf>`_ a paper by Allen B. Downey describing ways to generate more fine-grained floats than normally generated by :func:`.random`.
fr: `Generating Pseudo-random Floating-Point Values <https://allendowney.com/research/rand/downey07randfloat.pdf>`_ une publication par *Allen B. Downey* décrivant des manières de générer des nombres à virgule flottante plus fins que normalement générés par :func:`.random`.
