Repository: python/python-docs-fr
Catalog: library/re.po
Languages: fr

source: Exception raised when a string passed to one of the functions here is not a valid regular expression (for example, it might contain unmatched parentheses) or when some other error occurs during compilation or matching. It is never an error if a string contains no match for a pattern. The error instance has the following additional attributes:
fr: Exception levée quand une chaîne passée à l'une des fonctions ici présentes n'est pas une expression rationnelle valide (contenant par exemple une parenthèse non fermée) ou quand d'autres erreurs se produisent durant la compilation ou l'analyse. Il ne se produit jamais d'erreur si une chaîne ne contient aucune correspondance pour un motif. Les instances de l'erreur ont les attributs additionnels suivants :

source: The unformatted error message.
fr: Le message d'erreur non formaté.

source: The regular expression pattern.
fr: Le motif d'expression rationnelle.

source: The index in *pattern* where compilation failed (may be ``None``).
fr: L'index dans *pattern* où la compilation a échoué (peut valoir ``None``).

source: The line corresponding to *pos* (may be ``None``).
fr: La ligne correspondant à *pos* (peut valoir ``None``).

source: The column corresponding to *pos* (may be ``None``).
fr: La colonne correspondant à *pos* (peut valoir ``None``).

source: Added additional attributes.
fr: Ajout des attributs additionnels.

source: Regular Expression Objects
fr: Objets d'expressions rationnelles

source: Compiled regular expression objects support the following methods and attributes:
fr: Les expressions rationnelles compilées supportent les méthodes et attributs suivants :

source: Scan through *string* looking for the first location where this regular expression produces a match, and return a corresponding :ref:`match object <match-objects>`. Return ``None`` if no position in the string matches the pattern; note that this is different from finding a zero-length match at some point in the string.
fr: Analyse *string* à la recherche du premier emplacement où l'expression rationnelle trouve une correspondance, et envoie l':ref:`objet de correspondance <match-objects>` trouvé. Renvoie ``None`` si aucune position dans la chaîne ne satisfait le motif ; notez que cela est différent que de trouver une correspondance vide dans la chaîne.

source: The optional second parameter *pos* gives an index in the string where the search is to start; it defaults to ``0``. This is not completely equivalent to slicing the string; the ``'^'`` pattern character matches at the real beginning of the string and at positions just after a newline, but not necessarily at the index where the search is to start.
fr: Le second paramètre *pos* (optionnel) donne l'index dans la chaîne où la recherche doit débuter ; il vaut ``0`` par défaut. Cela n'est pas complètement équivalent à un *slicing* sur la chaîne ; le caractère de motif ``'^'`` correspond au début réel de la chaîne et aux positions juste après un saut de ligne, mais pas nécessairement à l'index où la recherche commence.

source: The optional parameter *endpos* limits how far the string will be searched; it will be as if the string is *endpos* characters long, so only the characters from *pos* to ``endpos - 1`` will be searched for a match. If *endpos* is less than *pos*, no match will be found; otherwise, if *rx* is a compiled regular expression object, ``rx.search(string, 0, 50)`` is equivalent to ``rx.search(string[:50], 0)``. ::
fr: Le paramètre optionnel *endpos* limite la longueur sur laquelle la chaîne sera analysée ; ce sera comme si la chaîne faisait *endpos* caractères de long, donc uniquement les caractères de *pos* à ``endpos - 1`` seront analysés pour trouver une correspondance. Si *endpos* est inférieur à *pos*, aucune correspondance ne sera trouvée ; dit autrement, avec *rx* une expression rationnelle compilée, ``rx.search(string, 0, 50)`` est équivalent à ``rx.search(string[:50], 0)``. ::

source: If zero or more characters at the *beginning* of *string* match this regular expression, return a corresponding :ref:`match object <match-objects>`. Return ``None`` if the string does not match the pattern; note that this is different from a zero-length match.
fr: Si zéro caractère ou plus au début de *string* correspondent à cette expression rationnelle, renvoie l':ref:`objet de correspondance <match-objects>` trouvé. Renvoie ``None`` si la chaîne ne correspond pas au motif ; notez que cela est différent d'une correspondance vide.

source: The optional *pos* and *endpos* parameters have the same meaning as for the :meth:`~Pattern.search` method. ::
fr: Les paramètres optionnels *pos* et *endpos* ont le même sens que pour la méthode :meth:`~Pattern.search`. ::

source: If you want to locate a match anywhere in *string*, use :meth:`~Pattern.search` instead (see also :ref:`search-vs-match`).
fr: Si vous voulez une recherche n'importe où dans *string*, utilisez plutôt :meth:`~Pattern.search` (voir aussi :ref:`search-vs-match`).

source: If the whole *string* matches this regular expression, return a corresponding :ref:`match object <match-objects>`. Return ``None`` if the string does not match the pattern; note that this is different from a zero-length match.
fr: Si la chaîne *string* entière valide l'expression rationnelle, renvoie l':ref:`object de correspondance <match-objects>` associé. Renvoie ``None`` si la chaîne ne correspond pas au motif ; notez que cela est différent d'une correspondance vide.

source: Identical to the :func:`split` function, using the compiled pattern.
fr: Identique à la fonction :func:`split`, en utilisant le motif compilé.

source: Similar to the :func:`findall` function, using the compiled pattern, but also accepts optional *pos* and *endpos* parameters that limit the search region like for :meth:`search`.
fr: Similaire à la fonction :func:`findall`, en utilisant le motif compilé, mais accepte aussi des paramètres *pos* et *endpos* optionnels qui limitent la région de recherche comme pour :meth:`search`.

source: Similar to the :func:`finditer` function, using the compiled pattern, but also accepts optional *pos* and *endpos* parameters that limit the search region like for :meth:`search`.
fr: Similaire à la fonction :func:`finditer`, en utilisant le motif compilé, mais accepte aussi des paramètres *pos* et *endpos* optionnels qui limitent la région de recherche comme pour :meth:`search`.

source: Identical to the :func:`sub` function, using the compiled pattern.
fr: Identique à la fonction :func:`sub`, en utilisant le motif compilé.

source: Identical to the :func:`subn` function, using the compiled pattern.
fr: Identique à la fonction :func:`subn`, en utilisant le motif compilé.

source: The regex matching flags. This is a combination of the flags given to :func:`.compile`, any ``(?...)`` inline flags in the pattern, and implicit flags such as :data:`UNICODE` if the pattern is a Unicode string.
fr: Les options de validation de l'expression rationnelle. Il s'agit d'une combinaison des options données à :func:`compile`, des potentielles options ``(?...)`` dans le motif, et des options implicites comme :data:`UNICODE` si le motif est une chaîne Unicode.

source: The number of capturing groups in the pattern.
fr: Le nombre de groupes de capture dans le motif.

source: A dictionary mapping any symbolic group names defined by ``(?P<id>)`` to group numbers. The dictionary is empty if no symbolic groups were used in the pattern.
fr: Un dictionnaire associant les noms de groupes symboliques définis par ``(?P<id>)`` aux groupes numérotés. Le dictionnaire est vide si aucun groupe symbolique n'est utilisé dans le motif.

source: The pattern string from which the pattern object was compiled.
fr: La chaîne de motif depuis laquelle l'objet motif a été compilé.

source: Added support of :func:`copy.copy` and :func:`copy.deepcopy`. Compiled regular expression objects are considered atomic.
fr: Ajout du support des fonctions :func:`copy.copy` et :func:`copy.deepcopy`. Les expressions régulières compilées sont considérées atomiques.

source: Match Objects
fr: Objets de correspondance

source: Match objects always have a boolean value of ``True``. Since :meth:`~Pattern.match` and :meth:`~Pattern.search` return ``None`` when there is no match, you can test whether there was a match with a simple ``if`` statement::
fr: Les objets de correspondance ont toujours une valeur booléenne ``True``. Puisque :meth:`~Pattern.match` et :meth:`~Pattern.search` renvoient ``None`` quand il n'y a pas de correspondance, vous pouvez tester s'il y a eu correspondance avec une simple instruction ``if`` ::

source: Match objects support the following methods and attributes:
fr: Les objets de correspondance supportent les méthodes et attributs suivants :

source: Return the string obtained by doing backslash substitution on the template string *template*, as done by the :meth:`~Pattern.sub` method. Escapes such as ``\n`` are converted to the appropriate characters, and numeric backreferences (``\1``, ``\2``) and named backreferences (``\g<1>``, ``\g<name>``) are replaced by the contents of the corresponding group.
fr: Renvoie la chaîne obtenue en substituant les séquences d'échappement du gabarit *template*, comme réalisé par la méthode :meth:`~Pattern.sub`. Les séquences comme ``\n`` sont converties vers les caractères appropriés, et les références arrières numériques (``\1``, ``\2``) et nommées (``\g<1>``, ``\g<name>``) sont remplacées par les contenus des groupes correspondant.

source: Returns one or more subgroups of the match. If there is a single argument, the result is a single string; if there are multiple arguments, the result is a tuple with one item per argument. Without arguments, *group1* defaults to zero (the whole match is returned). If a *groupN* argument is zero, the corresponding return value is the entire matching string; if it is in the inclusive range [1..99], it is the string matching the corresponding parenthesized group. If a group number is negative or larger than the number of groups defined in the pattern, an :exc:`IndexError` exception is raised. If a group is contained in a part of the pattern that did not match, the corresponding result is ``None``. If a group is contained in a part of the pattern that matched multiple times, the last match is returned. ::
fr: Renvoie un ou plus sous-groupes de la correspondance. Si un seul argument est donné, le résultat est une chaîne simple ; s'il y a plusieurs arguments, le résultat est un *n*-uplet comprenant un élément par argument. Sans arguments, *group1* vaut par défaut zéro (la correspondance entière est renvoyée). Si un argument *groupN* vaut zéro, l'élément associé sera la chaîne de correspondance entière ; s'il est dans l'intervalle fermé [1..99], c'est la correspondance avec le groupe de parenthèses associé. Si un numéro de groupe est négatif ou supérieur au nombre de groupes définis dans le motif, une exception :exc:`indexError` est levée. Si un groupe est contenu dans une partie du motif qui n'a aucune correspondance, l'élément associé sera ``None``. Si un groupe est contenu dans une partie du motif qui a plusieurs correspondances, seule la dernière correspondance est renvoyée. ::

source: If the regular expression uses the ``(?P<name>...)`` syntax, the *groupN* arguments may also be strings identifying groups by their group name. If a string argument is not used as a group name in the pattern, an :exc:`IndexError` exception is raised.
fr: Si l'expression rationnelle utilise la syntaxe ``(?P<name>...)``, les arguments *groupN* peuvent alors aussi être des chaînes identifiant les groupes par leurs noms. Si une chaîne donnée en argument n'est pas utilisée comme nom de groupe dans le motif, une exception :exc:`IndexError` est levée.

source: A moderately complicated example::
fr: Un exemple modérément compliqué ::

source: Named groups can also be referred to by their index::
fr: Les groupes nommés peuvent aussi être référencés par leur index ::

source: If a group matches multiple times, only the last match is accessible::
fr: Si un groupe a plusieurs correspondances, seule la dernière est accessible ::

source: This is identical to ``m.group(g)``. This allows easier access to an individual group from a match::
fr: Cela est identique à ``m.group(g)``. Cela permet un accès plus facile à un groupe individuel depuis une correspondance ::

source: Return a tuple containing all the subgroups of the match, from 1 up to however many groups are in the pattern. The *default* argument is used for groups that did not participate in the match; it defaults to ``None``.
fr: Renvoie un *n*-uplet contenant tous les sous-groupes de la correspondance, de 1 jusqu'au nombre de groupes dans le motif. L'argument *default* est utilisé pour les groupes sans correspondance ; il vaut ``None`` par défaut.

source: For example::
fr: Par exemple ::

source: If we make the decimal place and everything after it optional, not all groups might participate in the match. These groups will default to ``None`` unless the *default* argument is given::
fr: Si on rend la partie décimale et tout ce qui la suit optionnels, tous les groupes ne figureront pas dans la correspondance. Ces groupes sans correspondance vaudront ``None`` sauf si une autre valeur est donnée à l'argument *default* ::

source: Return a dictionary containing all the *named* subgroups of the match, keyed by the subgroup name. The *default* argument is used for groups that did not participate in the match; it defaults to ``None``. For example::
fr: Renvoie un dictionnaire contenant tous les sous-groupes *nommés* de la correspondance, accessibles par leurs noms. L'argument *default* est utilisé pour les groupes qui ne figurent pas dans la correspondance ; il vaut ``None`` par défaut. Par exemple ::

source: Return the indices of the start and end of the substring matched by *group*; *group* defaults to zero (meaning the whole matched substring). Return ``-1`` if *group* exists but did not contribute to the match. For a match object *m*, and a group *g* that did contribute to the match, the substring matched by group *g* (equivalent to ``m.group(g)``) is ::
fr: Renvoie les indices de début et de fin de la sous-chaîne correspondant au groupe *group* ; *group* vaut par défaut zéro (pour récupérer les indices de la correspondance complète). Renvoie ``-1`` si *group* existe mais ne figure pas dans la correspondance. Pour un objet de correspondance *m*, et un groupe *g* qui y figure, la sous-chaîne correspondant au groupe *g* (équivalente à ``m.group(g)``) est ::

source: Note that ``m.start(group)`` will equal ``m.end(group)`` if *group* matched a null string. For example, after ``m = re.search('b(c?)', 'cba')``, ``m.start(0)`` is 1, ``m.end(0)`` is 2, ``m.start(1)`` and ``m.end(1)`` are both 2, and ``m.start(2)`` raises an :exc:`IndexError` exception.
fr: Notez que ``m.start(group)`` sera égal à ``m.end(group)`` si *group* correspond à une chaîne vide. Par exemple, après ``m = re.search('b(c?)', 'cba')``, ``m.start(0)`` vaut 1, ``m.end(0)`` vaut 2, ``m.start(1)`` et ``m.end(1)`` valent tous deux 2, et ``m.start(2)`` lève une exception :exc:`IndexError`.

source: An example that will remove *remove_this* from email addresses::
fr: Un exemple qui supprimera *remove_this* d'une adresse mail ::

source: For a match *m*, return the 2-tuple ``(m.start(group), m.end(group))``. Note that if *group* did not contribute to the match, this is ``(-1, -1)``. *group* defaults to zero, the entire match.
fr: Pour un objet de correspondance *m*, renvoie la paire ``(m.start(group), m.end(group))``. Notez que si *group* ne figure pas dans la correspondance, ``(-1, -1)`` est renvoyé. *group* vaut par défaut zéro, pour la correspondance entière.

source: The value of *pos* which was passed to the :meth:`~Pattern.search` or :meth:`~Pattern.match` method of a :ref:`regex object <re-objects>`. This is the index into the string at which the RE engine started looking for a match.
fr: La valeur de *pos* qui a été passée à la méthode :meth:`~Pattern.search` ou :meth:`~Pattern.match` d'un :ref:`objet expression rationnelle <re-objects>`. C'est l'index dans la chaîne à partir duquel le moteur d'expressions rationnelles recherche une correspondance.

source: The value of *endpos* which was passed to the :meth:`~Pattern.search` or :meth:`~Pattern.match` method of a :ref:`regex object <re-objects>`. This is the index into the string beyond which the RE engine will not go.
fr: La valeur de *endpos* qui a été passée à la méthode :meth:`~Pattern.search` ou :meth:`~Pattern.match` d'un :ref:`objet expression rationnelle <re-objects>`. C'est l'index dans la chaîne que le moteur d'expressions rationnelles ne dépassera pas.

source: The integer index of the last matched capturing group, or ``None`` if no group was matched at all. For example, the expressions ``(a)b``, ``((a)(b))``, and ``((ab))`` will have ``lastindex == 1`` if applied to the string ``'ab'``, while the expression ``(a)(b)`` will have ``lastindex == 2``, if applied to the same string.
fr: L'index entier du dernier groupe de capture validé, ou ``None`` si aucun groupe ne correspondait. Par exemple, les expressions ``(a)b``, ``((a)(b))`` et ``((ab))`` auront un ``lastindex == 1`` si appliquées à la chaîne ``'ab'``, alors que l'expression ``(a)(b)`` aura un ``lastindex == 2`` si appliquée à la même chaîne.

source: The name of the last matched capturing group, or ``None`` if the group didn't have a name, or if no group was matched at all.
fr: Le nom du dernier groupe capturant validé, ou ``None`` si le groupe n'a pas de nom, ou si aucun groupe ne correspondait.

source: The :ref:`regular expression object <re-objects>` whose :meth:`~Pattern.match` or :meth:`~Pattern.search` method produced this match instance.
fr: :ref:`L'expression rationnelle <re-objects>` dont la méthode :meth:`~Pattern.match` ou :meth:`~Pattern.search` a produit cet objet de correspondance.

source: The string passed to :meth:`~Pattern.match` or :meth:`~Pattern.search`.
fr: La chaîne passée à :meth:`~Pattern.match` ou :meth:`~Pattern.search`.

source: Added support of :func:`copy.copy` and :func:`copy.deepcopy`. Match objects are considered atomic.
fr: Ajout du support des fonctions :func:`copy.copy` et :func:`copy.deepcopy`. Les objets correspondants sont considérés atomiques.

source: Regular Expression Examples
fr: Exemples d'expressions rationnelles

source: Checking for a Pair
fr: Rechercher une paire

source: In this example, we'll use the following helper function to display match objects a little more gracefully::
fr: Dans cet exemple, nous nous aidons de la fonction suivante pour afficher de manière plus jolie les objets qui correspondent ::

source: Suppose you are writing a poker program where a player's hand is represented as a 5-character string with each character representing a card, "a" for ace, "k" for king, "q" for queen, "j" for jack, "t" for 10, and "2" through "9" representing the card with that value.
fr: Supposez que vous écriviez un jeu de poker où la main d'un joueur est représentée par une chaîne de 5 caractères avec chaque caractère représentant une carte, « a » pour l'as, « k » pour le roi (*king*), « q » pour la reine (*queen*), « j » pour le valet (*jack*), « t » pour 10 (*ten*), et les caractères de « 2 » à « 9 » représentant les cartes avec ces valeurs.

source: To see if a given string is a valid hand, one could do the following::
fr: Pour vérifier qu'une chaîne donnée est une main valide, on pourrait faire comme suit ::

source: That last hand, ``"727ak"``, contained a pair, or two of the same valued cards. To match this with a regular expression, one could use backreferences as such::
fr: La dernière main, ``"727ak"``, contenait une paire, deux cartes de la même valeur. Pour valider cela avec une expression rationnelle, on pourrait utiliser des références arrière comme ::

source: To find out what card the pair consists of, one could use the :meth:`~Match.group` method of the match object in the following manner::
fr: Pour trouver de quelle carte est composée la paire, on pourrait utiliser la méthode :meth:`~Match.group` de l'objet de correspondance de la manière suivante ::

source: Simulating scanf()
fr: Simuler *scanf()*

source: Python does not currently have an equivalent to :c:func:`scanf`. Regular expressions are generally more powerful, though also more verbose, than :c:func:`scanf` format strings. The table below offers some more-or-less equivalent mappings between :c:func:`scanf` format tokens and regular expressions.
fr: Python n'a actuellement pas d'équivalent à la fonction C :c:func:`scanf`. Les expressions rationnelles sont généralement plus puissantes, mais aussi plus verbeuses, que les chaînes de format :c:func:`scanf`. Le tableau suivant présente des expressions rationnelles plus ou moins équivalentes aux éléments de formats de :c:func:`scanf`.

source: :c:func:`scanf` Token
fr: Élément de :c:func:`scanf`

source: Regular Expression
fr: Expression rationnelle

source: To extract the filename and numbers from a string like ::
fr: Pour extraire le nom de fichier et les nombres depuis une chaîne comme ::

source: you would use a :c:func:`scanf` format like ::
fr: vous utiliseriez un format :c:func:`scanf` comme ::

source: The equivalent regular expression would be ::
fr: L'expression rationnelle équivalente serait ::

source: Python offers different primitive operations based on regular expressions:
fr: Python offre différentes opérations primitives basées sur des expressions régulières.

source: :func:`re.match` checks for a match only at the beginning of the string
fr: :func:`re.match` cherche une correspondance uniquement au début de la chaîne de caractères

source: :func:`re.search` checks for a match anywhere in the string (this is what Perl does by default)
fr: :func:`re.search` cherche une correspondance n'importe où dans la chaîne de caractères (ce que fait Perl par défaut)

source: :func:`re.fullmatch` checks for entire string to be a match
fr: :func:`re.fullmatch` cherche une correspondance avec l'intégralité de la chaîne de caractères.

source: Regular expressions beginning with ``'^'`` can be used with :func:`search` to restrict the match at the beginning of the string::
fr: Les expressions rationnelles commençant par ``'^'`` peuvent être utilisées avec :func:`search` pour restreindre la recherche au début de la chaîne ::

source: Note however that in :const:`MULTILINE` mode :func:`match` only matches at the beginning of the string, whereas using :func:`search` with a regular expression beginning with ``'^'`` will match at the beginning of each line. ::
fr: Notez cependant qu'en mode :const:`MULTILINE`, :func:`match` ne recherche qu'au début de la chaîne, alors que :func:`search` avec une expression rationnelle commençant par ``'^'`` recherchera au début de chaque ligne. ::

source: Making a Phonebook
fr: Construire un répertoire téléphonique

source: :func:`split` splits a string into a list delimited by the passed pattern. The method is invaluable for converting textual data into data structures that can be easily read and modified by Python as demonstrated in the following example that creates a phonebook.
fr: :func:`split` découpe une chaîne en une liste délimitée par le motif donné. La méthode est inestimable pour convertir des données textuelles vers des structures de données qui peuvent être lues et modifiées par Python comme démontré dans l'exemple suivant qui crée un répertoire téléphonique.

source: First, here is the input. Normally it may come from a file, here we are using triple-quoted string syntax
fr: Tout d'abord, voici l'entrée. Elle provient normalement d'un fichier, nous utilisons ici une chaîne à guillemets triples
