Repository: python/python-docs-fr
Catalog: library/re.po
Languages: fr

source: :mod:`re` --- Regular expression operations
fr: :mod:`re` — Opérations à base d'expressions rationnelles

source: **Source code:** :source:`Lib/re.py`
fr: **Code source :** :source:`Lib/re.py`

source: This module provides regular expression matching operations similar to those found in Perl.
fr: Ce module fournit des opérations sur les expressions rationnelles similaires à celles que l'on trouve dans Perl.

source: Both patterns and strings to be searched can be Unicode strings (:class:`str`) as well as 8-bit strings (:class:`bytes`). However, Unicode strings and 8-bit strings cannot be mixed: that is, you cannot match a Unicode string with a byte pattern or vice-versa; similarly, when asking for a substitution, the replacement string must be of the same type as both the pattern and the search string.
fr: Les motifs, comme les chaînes, à analyser peuvent aussi bien être des chaînes Unicode (:class:`str`) que des chaînes 8-bits (:class:`bytes`). Cependant, les chaînes Unicode et 8-bits ne peuvent pas être mélangées : c’est à dire que vous ne pouvez pas analyser une chaîne Unicode avec un motif 8-bit, et inversement ; de même, lors d'une substitution, la chaîne de remplacement doit être du même type que le motif et la chaîne analysée.

source: Regular expressions use the backslash character (``'\'``) to indicate special forms or to allow special characters to be used without invoking their special meaning. This collides with Python's usage of the same character for the same purpose in string literals; for example, to match a literal backslash, one might have to write ``'\\\\'`` as the pattern string, because the regular expression must be ``\\``, and each backslash must be expressed as ``\\`` inside a regular Python string literal. Also, please note that any invalid escape sequences in Python's usage of the backslash in string literals now generate a :exc:`DeprecationWarning` and in the future this will become a :exc:`SyntaxError`. This behaviour will happen even if it is a valid escape sequence for a regular expression.
fr: Les expressions rationnelles utilisent le caractère *backslash* (``'\'``) pour indiquer des formes spéciales ou permettre d'utiliser des caractères spéciaux sans en invoquer le sens. Cela entre en conflit avec l'utilisation en Python du même caractère pour la même raison dans les chaînes littérales ; par exemple, pour rechercher un *backslash* littéral il faudrait écrire ``'\\\\'`` comme motif, parce que l'expression rationnelle devrait être ``\\`` et chaque *backslash* doit être représenté par ``\\`` au sein des chaînes littérales Python. Notez aussi qu'une séquence d'échappement invalide en raison de l'utilisation de *backslash* au sens de Python dans une chaîne littérale lève un :exc:`DeprecationWarning` qui, dans le futur, deviendra une :exc:`SyntaxError`. Ceci se produit même si la séquence d'échappement est valide en tant qu'expression régulière.

source: The solution is to use Python's raw string notation for regular expression patterns; backslashes are not handled in any special way in a string literal prefixed with ``'r'``. So ``r"\n"`` is a two-character string containing ``'\'`` and ``'n'``, while ``"\n"`` is a one-character string containing a newline. Usually patterns will be expressed in Python code using this raw string notation.
fr: La solution est d'utiliser la notation des chaînes brutes en Python pour les expressions rationnelles ; Les *backslashs* ne provoquent aucun traitement spécifique dans les chaînes littérales préfixées par ``'r'``. Ainsi, ``r"\n"`` est une chaîne de deux caractères contenant ``'\'`` et ``'n'``, tandis que ``"\n"`` est une chaîne contenant un unique caractère : un saut de ligne. Généralement, les motifs seront exprimés en Python à l'aide de chaînes brutes.

source: It is important to note that most regular expression operations are available as module-level functions and methods on :ref:`compiled regular expressions <re-objects>`. The functions are shortcuts that don't require you to compile a regex object first, but miss some fine-tuning parameters.
fr: Il est important de noter que la plupart des opérations sur les expressions rationnelles sont disponibles comme fonctions au niveau du module et comme méthodes des :ref:`expressions rationnelles compilées <re-objects>`. Les fonctions sont des raccourcis qui ne vous obligent pas à d'abord compiler un objet *regex*, mais auxquelles manquent certains paramètres de configuration fine.

source: The third-party `regex <https://pypi.org/project/regex/>`_ module, which has an API compatible with the standard library :mod:`re` module, but offers additional functionality and a more thorough Unicode support.
fr: Le module tiers `regex <https://pypi.org/project/regex/>`_, dont l'interface est compatible avec le module :mod:`re` de la bibliothèque standard, mais offre des fonctionnalités additionnelles et une meilleure gestion de l'Unicode.

source: Regular Expression Syntax
fr: Syntaxe des expressions rationnelles

source: A regular expression (or RE) specifies a set of strings that matches it; the functions in this module let you check if a particular string matches a given regular expression (or if a given regular expression matches a particular string, which comes down to the same thing).
fr: Une expression rationnelle (*regular expression* ou *RE*) spécifie un ensemble de chaînes de caractères qui lui correspondent ; les fonctions de ce module vous permettent de vérifier si une chaîne particulière correspond à une expression rationnelle donnée (ou si un expression rationnelle donnée correspond à une chaîne particulière, ce qui revient à la même chose).

source: Regular expressions can be concatenated to form new regular expressions; if *A* and *B* are both regular expressions, then *AB* is also a regular expression. In general, if a string *p* matches *A* and another string *q* matches *B*, the string *pq* will match AB. This holds unless *A* or *B* contain low precedence operations; boundary conditions between *A* and *B*; or have numbered group references. Thus, complex expressions can easily be constructed from simpler primitive expressions like the ones described here. For details of the theory and implementation of regular expressions, consult the Friedl book [Frie09]_, or almost any textbook about compiler construction.
fr: Les expressions rationnelles peuvent être concaténées pour former de nouvelles expressions : si *A* et *B* sont deux expressions rationnelles, alors *AB* est aussi une expression rationnelle. En général, si une chaîne *p* valide *A* et qu'une autre chaîne *q* valide *B*, la chaîne *pq* validera AB. Cela est vrai tant que *A* et *B* ne contiennent pas d'opérations de priorité ; de conditions de frontière entre *A* et *B* ; ou de références vers des groupes numérotés. Ainsi, des expressions complexes peuvent facilement être construites depuis de plus simples expressions primitives comme celles décrites ici. Pour plus de détails sur la théorie et l'implémentation des expressions rationnelles, consultez le livre de Friedl [Frie09]_, ou à peu près n'importe quel livre dédié à la construction de compilateurs.

source: A brief explanation of the format of regular expressions follows. For further information and a gentler presentation, consult the :ref:`regex-howto`.
fr: Une brève explication sur le format des expressions rationnelles suit. Pour de plus amples informations et une présentation plus simple, référez-vous au :ref:`regex-howto`.

source: Regular expressions can contain both special and ordinary characters. Most ordinary characters, like ``'A'``, ``'a'``, or ``'0'``, are the simplest regular expressions; they simply match themselves. You can concatenate ordinary characters, so ``last`` matches the string ``'last'``. (In the rest of this section, we'll write RE's in ``this special style``, usually without quotes, and strings to be matched ``'in single quotes'``.)
fr: Les expressions rationnelles peuvent contenir à la fois des caractères spéciaux et ordinaires. Les plus ordinaires, comme ``'A'``, ``'a'`` ou ``'0'`` sont les expressions rationnelles les plus simples : elles correspondent simplement à elles-mêmes. Vous pouvez concaténer des caractères ordinaires, ainsi ``last`` correspond à la chaîne ``'last'``. (Dans la suite de cette section, nous écrirons les expressions rationnelles dans ``ce style spécifique``, généralement sans guillemets, et les chaînes à tester ``'entourées de simples guillemets'``.)

source: Some characters, like ``'|'`` or ``'('``, are special. Special characters either stand for classes of ordinary characters, or affect how the regular expressions around them are interpreted.
fr: Certains caractères, comme ``'|'`` ou ``'('``, sont spéciaux. Des caractères spéciaux peuvent aussi exister pour les classes de caractères ordinaires, ou affecter comment les expressions rationnelles autour d'eux seront interprétées.

source: Repetition qualifiers (``*``, ``+``, ``?``, ``{m,n}``, etc) cannot be directly nested. This avoids ambiguity with the non-greedy modifier suffix ``?``, and with other modifiers in other implementations. To apply a second repetition to an inner repetition, parentheses may be used. For example, the expression ``(?:a{6})*`` matches any multiple of six ``'a'`` characters.
fr: Les caractères de répétition (``*``, ``+``, ``?``, ``{m,n}``, etc.) ne peuvent être directement imbriqués. Cela empêche l'ambiguïté avec le suffixe modificateur non gourmand ``?`` et avec les autres modificateurs dans d'autres implémentations. Pour appliquer une seconde répétition à une première, des parenthèses peuvent être utilisées. Par exemple, l'expression ``(?:a{6})*`` valide toutes les chaînes composées d'un nombre de caractères ``'a'`` multiple de six.

source: The special characters are:
fr: Les caractères spéciaux sont :

source: (Dot.) In the default mode, this matches any character except a newline. If the :const:`DOTALL` flag has been specified, this matches any character including a newline.
fr: (Point.) Dans le mode par défaut, il valide tout caractère à l'exception du saut de ligne. Si l'option :const:`DOTALL` a été spécifiée, il valide tout caractère, saut de ligne compris.

source: (Caret.) Matches the start of the string, and in :const:`MULTILINE` mode also matches immediately after each newline.
fr: (Accent circonflexe.) Valide le début d'une chaîne de caractères, ainsi que ce qui suit chaque saut de ligne en mode :const:`MULTILINE`.

source: Matches the end of the string or just before the newline at the end of the string, and in :const:`MULTILINE` mode also matches before a newline. ``foo`` matches both 'foo' and 'foobar', while the regular expression ``foo$`` matches only 'foo'. More interestingly, searching for ``foo.$`` in ``'foo1\nfoo2\n'`` matches 'foo2' normally, but 'foo1' in :const:`MULTILINE` mode; searching for a single ``$`` in ``'foo\n'`` will find two (empty) matches: one just before the newline, and one at the end of the string.
fr: Valide la fin d'une chaîne de caractères, ou juste avant le saut de ligne à la fin de la chaîne, ainsi qu'avant chaque saut de ligne en mode :const:`MULTILINE`. ``foo`` valide à la fois *foo* et *foobar*, tandis que l'expression rationnelle ``foo$`` ne correspond qu'à ``'foo'``. Plus intéressant, chercher ``foo.$`` dans ``'foo1\nfoo2\n'`` trouve normalement ``'foo2'``, mais ``'foo1'`` en mode :const:`MULTILINE` ; chercher un simple ``$`` dans ``'foo\n'`` trouvera deux correspondances (vides) : une juste avant le saut de ligne, et une à la fin de la chaîne.

source: Causes the resulting RE to match 0 or more repetitions of the preceding RE, as many repetitions as are possible. ``ab*`` will match 'a', 'ab', or 'a' followed by any number of 'b's.
fr: Fait valider par l'expression rationnelle résultante 0 répétition ou plus de l'expression qui précède, avec autant de répétitions que possible. ``ab*`` validera 'a', 'ab' ou 'a' suivi de n'importe quel nombre de 'b'.

source: Causes the resulting RE to match 1 or more repetitions of the preceding RE. ``ab+`` will match 'a' followed by any non-zero number of 'b's; it will not match just 'a'.
fr: Fait valider par l'expression rationnelle résultante 1 répétition ou plus de l'expression qui précède. ``ab+`` validera 'a' suivi de n'importe quel nombre non nul de 'b' ; cela ne validera pas la chaîne 'a'.

source: Causes the resulting RE to match 0 or 1 repetitions of the preceding RE. ``ab?`` will match either 'a' or 'ab'.
fr: Fait valider par l'expression rationnelle résultante 0 ou 1 répétition de l'expression qui précède. ``ab?`` correspondra à 'a' ou 'ab'.

source: The ``'*'``, ``'+'``, and ``'?'`` qualifiers are all :dfn:`greedy`; they match as much text as possible. Sometimes this behaviour isn't desired; if the RE ``<.*>`` is matched against ``'<a> b <c>'``, it will match the entire string, and not just ``'<a>'``. Adding ``?`` after the qualifier makes it perform the match in :dfn:`non-greedy` or :dfn:`minimal` fashion; as *few* characters as possible will be matched. Using the RE ``<.*?>`` will match only ``'<a>'``.
fr: Les qualificateurs ``'*'``, ``'+'`` et ``'?'`` sont tous :dfn:`greedy` (gourmands) ; ils valident autant de texte que possible. Parfois ce comportement n'est pas désiré ; si l'expression rationnelle ``<.*>`` est testée avec la chaîne ``'<a> b <c>'``, cela correspondra à la chaîne entière, et non juste à ``'<a>'``. Ajouter ``?`` derrière le qualificateur lui fait réaliser l'opération de façon :dfn:`non-greedy` (ou :dfn:`minimal`) ; le *moins* de caractères possibles seront validés. Utiliser l'expression rationnelle ``<.*?>`` validera uniquement ``'<a>'``.

source: Specifies that exactly *m* copies of the previous RE should be matched; fewer matches cause the entire RE not to match. For example, ``a{6}`` will match exactly six ``'a'`` characters, but not five.
fr: Spécifie qu'exactement *m* copies de l'expression rationnelle qui précède devront être validées ; un nombre plus faible de correspondances empêche l'expression entière de correspondre. Par exemple, ``a{6}`` correspondra exactement à six caractères ``'a'``, mais pas à cinq.

source: Causes the resulting RE to match from *m* to *n* repetitions of the preceding RE, attempting to match as many repetitions as possible. For example, ``a{3,5}`` will match from 3 to 5 ``'a'`` characters. Omitting *m* specifies a lower bound of zero, and omitting *n* specifies an infinite upper bound. As an example, ``a{4,}b`` will match ``'aaaab'`` or a thousand ``'a'`` characters followed by a ``'b'``, but not ``'aaab'``. The comma may not be omitted or the modifier would be confused with the previously described form.
fr: Fait valider par l'expression rationnelle résultante entre *m* et *n* répétitions de l'expression qui précède, cherchant à en valider le plus possible. Par exemple, ``a{3,5}`` validera entre 3 et 5 caractères ``'a'``. Omettre *m* revient à spécifier 0 comme borne inférieure, et omettre *n* à avoir une borne supérieure infinie. Par exemple, ``a{4,}b`` correspondra à ``'aaaab'`` ou à un millier de caractères ``'a'`` suivis d'un ``'b'``, mais pas à ``'aaab'``. La virgule ne doit pas être omise, auquel cas le modificateur serait confondu avec la forme décrite précédemment.

source: Causes the resulting RE to match from *m* to *n* repetitions of the preceding RE, attempting to match as *few* repetitions as possible. This is the non-greedy version of the previous qualifier. For example, on the 6-character string ``'aaaaaa'``, ``a{3,5}`` will match 5 ``'a'`` characters, while ``a{3,5}?`` will only match 3 characters.
fr: Fait valider par l'expression rationnelle résultante entre *m* et *n* répétitions de l'expression qui précède, cherchant à en valider le moins possible. Il s'agit de la version non gourmande du précédent qualificateur. Par exemple, dans la chaîne de 6 caractères ``'aaaaaa'``, ``a{3,5}`` trouvera 5 caractères ``'a'``, alors que ``a{3,5}?`` n'en trouvera que 3.

source: Either escapes special characters (permitting you to match characters like ``'*'``, ``'?'``, and so forth), or signals a special sequence; special sequences are discussed below.
fr: Échappe les caractères spéciaux (permettant d’identifier des caractères comme ``'*'``, ``'?'`` et autres) ou signale une séquence spéciale ; les séquences spéciales sont décrites ci-dessous.

source: If you're not using a raw string to express the pattern, remember that Python also uses the backslash as an escape sequence in string literals; if the escape sequence isn't recognized by Python's parser, the backslash and subsequent character are included in the resulting string. However, if Python would recognize the resulting sequence, the backslash should be repeated twice. This is complicated and hard to understand, so it's highly recommended that you use raw strings for all but the simplest expressions.
fr: Si vous n'utilisez pas de chaînes brutes pour exprimer le motif, souvenez-vous que Python utilise aussi le *backslash* comme une séquence d'échappement dans les chaînes littérales ; si la séquence d'échappement n'est pas reconnue par l'interpréteur Python, le *backslash* et les caractères qui le suivent sont inclus dans la chaîne renvoyée. Cependant, si Python reconnait la séquence, le *backslash* doit être doublé (pour ne plus être reconnu). C'est assez compliqué et difficile à comprendre, c'est pourquoi il est hautement recommandé d'utiliser des chaînes brutes pour tout sauf les expressions les plus simples.

source: Used to indicate a set of characters. In a set:
fr: Utilisé pour indiquer un ensemble de caractères. Dans un ensemble :

source: Characters can be listed individually, e.g. ``[amk]`` will match ``'a'``, ``'m'``, or ``'k'``.
fr: Les caractères peuvent être listés individuellement, e.g. ``[amk]`` correspondra à ``'a'``, ``'m'`` ou ``'k'``.

source: Ranges of characters can be indicated by giving two characters and separating them by a ``'-'``, for example ``[a-z]`` will match any lowercase ASCII letter, ``[0-5][0-9]`` will match all the two-digits numbers from ``00`` to ``59``, and ``[0-9A-Fa-f]`` will match any hexadecimal digit. If ``-`` is escaped (e.g. ``[a\-z]``) or if it's placed as the first or last character (e.g. ``[-a]`` or ``[a-]``), it will match a literal ``'-'``.
fr: Des intervalles de caractères peuvent être indiqués en donnant deux caractères et les séparant par un ``'-'``, par exemple ``[a-z]`` correspondra à toute lettre minuscule *ASCII*, ``[0-5][0-9]`` à tous nombres de deux chiffres entre ``00`` et ``59``, et ``[0-9A-Fa-f]`` correspondra à n'importe quel chiffre hexadécimal. Si ``'-'`` est échappé (``[a\-z]``) ou s'il est placé comme premier ou dernier caractère (e.g. ``[-a]`` ou ``[a-]``), il correspondra à un ``'-'`` littéral.

source: Special characters lose their special meaning inside sets. For example, ``[(+*)]`` will match any of the literal characters ``'('``, ``'+'``, ``'*'``, or ``')'``.
fr: Les caractères spéciaux perdent leur sens à l'intérieur des ensembles. Par exemple, ``[(+*)]`` validera chacun des caractères littéraux ``'('``, ``'+'``, ``'*'`` ou ``')'``.

source: Character classes such as ``\w`` or ``\S`` (defined below) are also accepted inside a set, although the characters they match depends on whether :const:`ASCII` or :const:`LOCALE` mode is in force.
fr: Les classes de caractères telles que ``\w`` ou ``\S`` (définies ci-dessous) sont aussi acceptées à l'intérieur d'un ensemble, bien que les caractères correspondant dépendent de quel mode est actif entre :const:`ASCII` et :const:`LOCALE`.

source: Characters that are not within a range can be matched by :dfn:`complementing` the set. If the first character of the set is ``'^'``, all the characters that are *not* in the set will be matched. For example, ``[^5]`` will match any character except ``'5'``, and ``[^^]`` will match any character except ``'^'``. ``^`` has no special meaning if it's not the first character in the set.
fr: Les caractères qui ne sont pas dans un intervalle peuvent être trouvés avec l'ensemble complémentaire (:dfn:`complementing`). Si le premier caractère de l'ensemble est ``'^'``, tous les caractères qui *ne sont pas* dans l'ensemble seront validés. Par exemple, ``[^5]`` correspondra à tout caractère autre que ``'5'`` et ``[^^]`` validera n'importe quel caractère excepté ``'^'``. ``^`` n'a pas de sens particulier s'il n'est pas le premier caractère de l'ensemble.

source: Support of nested sets and set operations as in `Unicode Technical Standard #18`_ might be added in the future. This would change the syntax, so to facilitate this change a :exc:`FutureWarning` will be raised in ambiguous cases for the time being. That includes sets starting with a literal ``'['`` or containing literal character sequences ``'--'``, ``'&&'``, ``'~~'``, and ``'||'``. To avoid a warning escape them with a backslash.
fr: Le support des ensembles inclus l'un dans l'autre et les opérations d'ensemble comme dans `Unicode Technical Standard #18`_ pourrait être ajouté par la suite. Ceci changerait la syntaxe, donc pour faciliter ce changement, une exception :exc:`FutureWarning` sera levée dans les cas ambigus pour le moment. Ceci inclut les ensembles commençant avec le caractère ``'['`` ou contenant les séquences de caractères ``'--'``, ``'&&'``, ``'~~'`` et ``'||'``. Pour éviter un message d'avertissement, échapper les séquences avec le caractère antislash (``"\"``).

source: :exc:`FutureWarning` is raised if a character set contains constructs that will change semantically in the future.
fr: L'exception :exc:`FutureWarning` est levée si un ensemble de caractères contient une construction dont la sémantique changera dans le futur.

source: ``A|B``, where *A* and *B* can be arbitrary REs, creates a regular expression that will match either *A* or *B*. An arbitrary number of REs can be separated by the ``'|'`` in this way. This can be used inside groups (see below) as well. As the target string is scanned, REs separated by ``'|'`` are tried from left to right. When one pattern completely matches, that branch is accepted. This means that once *A* matches, *B* will not be tested further, even if it would produce a longer overall match. In other words, the ``'|'`` operator is never greedy. To match a literal ``'|'``, use ``\|``, or enclose it inside a character class, as in ``[|]``.
fr: ``A|B``, où *A* et *B* peuvent être deux expressions rationnelles arbitraires, crée une expression rationnelle qui validera soit *A* soit *B*. Un nombre arbitraire d'expressions peuvent être séparées de cette façon par des ``'|'``. Cela peut aussi être utilisé au sein de groupes (voir ci-dessous). Quand une chaîne cible est analysée, les expressions séparées par ``'|'`` sont essayées de la gauche vers la droite. Quand un motif correspond complètement, cette branche est acceptée. Cela signifie qu'une fois que *A* correspond, *B* ne sera pas testée plus loin, même si elle pourrait provoquer une plus ample correspondance. En d'autres termes, l'opérateur ``'|'`` n'est jamais gourmand. Pour valider un ``'|'`` littéral, utilisez ``\|``, ou enveloppez-le dans une classe de caractères, comme ``[|]``.
