Repository: python/python-docs-fr
Catalog: library/re.po
Languages: fr

source: Matches whatever regular expression is inside the parentheses, and indicates the start and end of a group; the contents of a group can be retrieved after a match has been performed, and can be matched later in the string with the ``\number`` special sequence, described below. To match the literals ``'('`` or ``')'``, use ``\(`` or ``\)``, or enclose them inside a character class: ``[(]``, ``[)]``.
fr: Valide n'importe quelle expression rationnelle comprise entre les parenthèses, et indique le début et la fin d'un groupe ; le contenu d'un groupe peut être récupéré après qu'une analyse a été effectuée et peut être réutilisé plus loin dans la chaîne avec une séquence spéciale ``\number``, décrite ci-dessous. Pour écrire des ``'('`` ou ``')'`` littéraux, utilisez ``\(`` ou ``\)``, ou enveloppez-les dans une classe de caractères : ``[(]``, ``[)]``.

source: This is an extension notation (a ``'?'`` following a ``'('`` is not meaningful otherwise). The first character after the ``'?'`` determines what the meaning and further syntax of the construct is. Extensions usually do not create a new group; ``(?P<name>...)`` is the only exception to this rule. Following are the currently supported extensions.
fr: Il s'agit d'une notation pour les extensions (un ``'?'`` suivant une ``'('`` n'a pas de sens autrement). Le premier caractère après le ``'?'`` détermine quel sens donner à l'expression. Les extensions ne créent généralement pas de nouveaux groupes ; ``(?P<name>...)`` est la seule exception à la règle. Retrouvez ci-dessous la liste des extensions actuellement supportées.

source: (One or more letters from the set ``'a'``, ``'i'``, ``'L'``, ``'m'``, ``'s'``, ``'u'``, ``'x'``.) The group matches the empty string; the letters set the corresponding flags: :const:`re.A` (ASCII-only matching), :const:`re.I` (ignore case), :const:`re.L` (locale dependent), :const:`re.M` (multi-line), :const:`re.S` (dot matches all), :const:`re.U` (Unicode matching), and :const:`re.X` (verbose), for the entire regular expression. (The flags are described in :ref:`contents-of-module-re`.) This is useful if you wish to include the flags as part of the regular expression, instead of passing a *flag* argument to the :func:`re.compile` function. Flags should be used first in the expression string.
fr: (Une lettre ou plus de l'ensemble ``'a'``, ``'i'``, ``'L'``, ``'m'``, ``'s'``, ``'u'``, ``'x'``.) Le groupe valide la chaîne vide ; les lettres activent les modes correspondant : :const:`re.A` (validation ASCII seulement), :const:`re.I` (ignorer la casse), :const:`re.L` (dépendant de la locale), :const:`re.M` (multi-ligne), :const:`re.S` (les points correspondent à tous les caractères), :const:`re.U` (support d'Unicode) et :const:`re.X` (verbeux), pour l'ensemble de l'expression rationnelle. (Les options dans décrites dans la section :ref:`contents-of-module-re`.) C'est utile si vous souhaitez préciser l'option dans l'expression rationnelle, plutôt qu'en passant un argument *flag* à la fonction :func:`re.compile`. Les options devraient être spécifiées en premier dans la chaîne de l'expression.

source: A non-capturing version of regular parentheses. Matches whatever regular expression is inside the parentheses, but the substring matched by the group *cannot* be retrieved after performing a match or referenced later in the pattern.
fr: Une version sans capture des parenthèses habituelles. Valide n'importe quelle expression rationnelle à l'intérieur des parenthèses, mais la sous-chaîne correspondant au groupe *ne peut pas* être récupérée après l'analyse ou être référencée plus loin dans le motif.

source: (Zero or more letters from the set ``'a'``, ``'i'``, ``'L'``, ``'m'``, ``'s'``, ``'u'``, ``'x'``, optionally followed by ``'-'`` followed by one or more letters from the ``'i'``, ``'m'``, ``'s'``, ``'x'``.) The letters set or remove the corresponding flags: :const:`re.A` (ASCII-only matching), :const:`re.I` (ignore case), :const:`re.L` (locale dependent), :const:`re.M` (multi-line), :const:`re.S` (dot matches all), :const:`re.U` (Unicode matching), and :const:`re.X` (verbose), for the part of the expression. (The flags are described in :ref:`contents-of-module-re`.)
fr: (Zéro lettres ou plus de l'ensemble ``'a'``, ``'i'``, ``'L'``, ``'m'``, ``'s'``, ``'u'``, ``'x'``, optionnellement suivies par ``'-'`` puis ``'i'``, ``'m'``, ``'s'``, ``'x'``.) Les lettres activent ou désactivent les options correspondantes : :const:`re.A` (ASCII exclusivement), :const:`re.I` (ignorer la casse), :const:`re.L` (respecte les paramètres régionaux), :const:`re.M` (multi-ligne), :const:`re.S` (les points correspondent à tous les caractères), :const:`re.U` (Unicode) et :const:`re.X` (verbeux), pour cette partie de l'expression. (Les options sont décrites dans la section :ref:`contents-of-module-re`.)

source: The letters ``'a'``, ``'L'`` and ``'u'`` are mutually exclusive when used as inline flags, so they can't be combined or follow ``'-'``. Instead, when one of them appears in an inline group, it overrides the matching mode in the enclosing group. In Unicode patterns ``(?a:...)`` switches to ASCII-only matching, and ``(?u:...)`` switches to Unicode matching (default). In byte pattern ``(?L:...)`` switches to locale depending matching, and ``(?a:...)`` switches to ASCII-only matching (default). This override is only in effect for the narrow inline group, and the original matching mode is restored outside of the group.
fr: Les caractères ``'a'``, ``'L'`` et ``'u'`` sont mutuellement exclusifs quand ils sont utilisés comme des options dans le motif, ils ne peuvent donc ni être combinés, ni suivre le caractère ``'-'``. Quand l'un d'entre eux apparaît dans un groupe, il modifie le mode pour ce groupe. Dans les motifs Unicode l'option ``(?a:...)`` bascule en mode ASCII-uniquement, et ``(?u:...)`` bascule en mode Unicode (le comportement par défaut). Dans les motifs composés d'octets, ``(?L:...)`` fait en sorte de respecter les paramètres régionaux, et ``(?a:...)`` bascule en mode ASCII Uniquement (le comportement par défaut). Ces modifications ne concernent que les groupes dans lesquelles elles sont, le mode précédent est donc rétabli à la sortie du groupe.

source: The letters ``'a'``, ``'L'`` and ``'u'`` also can be used in a group.
fr: Les lettres ``'a'``, ``'L'`` et ``'u'`` peuvent aussi être utilisées dans un groupe.

source: Similar to regular parentheses, but the substring matched by the group is accessible via the symbolic group name *name*. Group names must be valid Python identifiers, and each group name must be defined only once within a regular expression. A symbolic group is also a numbered group, just as if the group were not named.
fr: Similaires aux parenthèses habituelles, mais la sous-chaîne validée par le groupe est accessible via le nom *name* du groupe symbolique. Les noms de groupes doivent être des identifiants Python valides, et chaque nom de groupe ne doit être défini qu'une seule fois dans une expression rationnelle. Un groupe symbolique est aussi un groupe numéroté, de la même manière que si le groupe n'était pas nommé.

source: Named groups can be referenced in three contexts. If the pattern is ``(?P<quote>['"]).*?(?P=quote)`` (i.e. matching a string quoted with either single or double quotes):
fr: Les groupes nommés peuvent être référencés dans trois contextes. Si le motif est ``(?P<quote>['"]).*?(?P=quote)`` (c.-à-d. correspondant à une chaîne entourée de guillemets simples ou doubles) :

source: Context of reference to group "quote"
fr: Contexte de référence au groupe *quote*

source: Ways to reference it
fr: Manières de le référencer

source: in the same pattern itself
fr: lui-même dans le même motif

source: ``(?P=quote)`` (as shown)
fr: ``(?P=quote)`` (comme vu)

source: when processing match object *m*
fr: en analysant l'objet résultat *m*

source: in a string passed to the *repl* argument of ``re.sub()``
fr: dans une chaîne passée à l'argument *repl* de ``re.sub()``

source: A backreference to a named group; it matches whatever text was matched by the earlier group named *name*.
fr: Une référence arrière à un groupe nommé ; elle correspond à n'importe quel texte validé plus tôt par le groupe nommé *name*.

source: A comment; the contents of the parentheses are simply ignored.
fr: Un commentaire ; le contenu des parenthèses est simplement ignoré.

source: Matches if ``...`` matches next, but doesn't consume any of the string. This is called a :dfn:`lookahead assertion`. For example, ``Isaac (?=Asimov)`` will match ``'Isaac '`` only if it's followed by ``'Asimov'``.
fr: Valide si ``...`` valide la suite, mais ne consomme rien de la chaîne. On appelle cela une assertion :dfn:`lookahead`. Par exemple, ``Isaac (?=Asimov)`` correspondra à la chaîne ``'Isaac '`` seulement si elle est suivie par ``'Asimov'``.

source: Matches if ``...`` doesn't match next. This is a :dfn:`negative lookahead assertion`. For example, ``Isaac (?!Asimov)`` will match ``'Isaac '`` only if it's *not* followed by ``'Asimov'``.
fr: Valide si ``...`` ne valide pas la suite. C'est une assertion :dfn:`negative lookahead`. Par exemple, ``Isaac (?!Asimov)`` correspondra à la chaîne ``'Isaac '`` seulement si elle *n'est pas* suivie par ``'Asimov'``.

source: Matches if the current position in the string is preceded by a match for ``...`` that ends at the current position. This is called a :dfn:`positive lookbehind assertion`. ``(?<=abc)def`` will find a match in ``'abcdef'``, since the lookbehind will back up 3 characters and check if the contained pattern matches. The contained pattern must only match strings of some fixed length, meaning that ``abc`` or ``a|b`` are allowed, but ``a*`` and ``a{3,4}`` are not. Note that patterns which start with positive lookbehind assertions will not match at the beginning of the string being searched; you will most likely want to use the :func:`search` function rather than the :func:`match` function:
fr: Valide si la position courante dans la chaîne est précédée par une correspondance sur ``...`` qui se termine à la position courante. On appelle cela une :dfn:`positive lookbehind assertion`. ``(?<=abc)def`` cherchera une correspondance dans ``'abcdef'``, puisque le *lookbehind** mettra de côté 3 caractères et vérifiera que le motif contenu correspond. Le motif ne devra correspondre qu'à des chaînes de taille fixe, cela veut dire que ``abc`` ou ``a|b`` sont autorisées, mais pas ``a*`` ou ``a{3,4}``. Notez que les motifs qui commencent par des assertions *lookbehind* positives ne peuvent pas correspondre au début de la chaîne analysée ; vous préférerez sûrement utiliser la fonction :func:`search` plutôt que la fonction :func:`match` :

source: This example looks for a word following a hyphen:
fr: Cet exemple recherche un mot suivi d'un trait d'union :

source: Added support for group references of fixed length.
fr: Ajout du support des références aux groupes de taille fixe.

source: Matches if the current position in the string is not preceded by a match for ``...``. This is called a :dfn:`negative lookbehind assertion`. Similar to positive lookbehind assertions, the contained pattern must only match strings of some fixed length. Patterns which start with negative lookbehind assertions may match at the beginning of the string being searched.
fr: Valide si la position courante dans la chaîne n'est pas précédée par une correspondance sur ``...``. On appelle cela une :dfn:`negative lookbehind assertion`. À la manière des assertions *lookbehind* positives, le motif contenu ne peut que correspondre à des chaînes de taille fixe. Les motifs débutant par une assertion *lookbehind* négative peuvent correspondre au début de la chaîne analysée.

source: Will try to match with ``yes-pattern`` if the group with given *id* or *name* exists, and with ``no-pattern`` if it doesn't. ``no-pattern`` is optional and can be omitted. For example, ``(<)?(\w+@\w+(?:\.\w+)+)(?(1)>|$)`` is a poor email matching pattern, which will match with ``'<user@host.com>'`` as well as ``'user@host.com'``, but not with ``'<user@host.com'`` nor ``'user@host.com>'``.
fr: Essaiera de faire la correspondance avec ``yes-pattern`` si le groupe indiqué par *id* ou *name* existe, et avec ``no-pattern`` s'il n'existe pas. ``no-pattern`` est optionnel et peut être omis. Par exemple, ``(<)?(\w+@\w+(?:\.\w+)+)(?(1)>|$)`` est un motif simpliste pour identifier une adresse courriel, qui validera ``'<user@host.com>'`` ainsi que ``'user@host.com'`` mais pas ``'<user@host.com'`` ni ``'user@host.com>'``.

source: The special sequences consist of ``'\'`` and a character from the list below. If the ordinary character is not an ASCII digit or an ASCII letter, then the resulting RE will match the second character. For example, ``\$`` matches the character ``'$'``.
fr: Les séquences spéciales sont composées de ``'\'`` et d'un caractère de la liste qui suit. Si le caractère ordinaire n'est pas un chiffre *ASCII* ou une lettre *ASCII*, alors l'expression rationnelle résultante validera le second caractère de la séquence. Par exemple, ``\$`` correspond au caractère ``'$'``.

source: Matches the contents of the group of the same number. Groups are numbered starting from 1. For example, ``(.+) \1`` matches ``'the the'`` or ``'55 55'``, but not ``'thethe'`` (note the space after the group). This special sequence can only be used to match one of the first 99 groups. If the first digit of *number* is 0, or *number* is 3 octal digits long, it will not be interpreted as a group match, but as the character with octal value *number*. Inside the ``'['`` and ``']'`` of a character class, all numeric escapes are treated as characters.
fr: Correspond au contenu du groupe du même nombre. Les groupes sont numérotés à partir de 1. Par exemple, ``(.+) \1`` correspond à ``'the the'`` ou ``'55 55'``, mais pas à ``'thethe'`` (notez l'espace après le groupe). Cette séquence spéciale ne peut être utilisée que pour faire référence aux 99 premiers groupes. Si le premier chiffre de *number* est 0, ou si *number* est un nombre octal de 3 chiffres, il ne sera pas interprété comme une référence à un groupe, mais comme le caractère à la valeur octale *number*. À l'intérieur des ``'['`` et ``']'`` d'une classe de caractères, tous les échappements numériques sont traités comme des caractères.

source: Matches only at the start of the string.
fr: Correspond uniquement au début d'une chaîne de caractères.

source: Matches the empty string, but only at the beginning or end of a word. A word is defined as a sequence of word characters. Note that formally, ``\b`` is defined as the boundary between a ``\w`` and a ``\W`` character (or vice versa), or between ``\w`` and the beginning/end of the string. This means that ``r'\bfoo\b'`` matches ``'foo'``, ``'foo.'``, ``'(foo)'``, ``'bar foo baz'`` but not ``'foobar'`` or ``'foo3'``.
fr: Correspond à la chaîne vide, mais uniquement au début ou à la fin d'un mot. Un mot est défini comme une séquence de « caractères de mots ». Notez que formellement, ``\b`` est défini comme la liaison entre ``\w`` et ``\W`` (et inversement), ou entre ``\w`` et le début/fin d'un mot. Cela signifie que ``r'\bfoo\b'`` validera ``'foo'``, ``'foo.'``, ``'(foo)'`` ou ``'bar foo baz'`` mais pas ``'foobar'`` ou ``'foo3'``.

source: By default Unicode alphanumerics are the ones used in Unicode patterns, but this can be changed by using the :const:`ASCII` flag. Word boundaries are determined by the current locale if the :const:`LOCALE` flag is used. Inside a character range, ``\b`` represents the backspace character, for compatibility with Python's string literals.
fr: Les caractères alphanumériques Unicode sont utilisés par défaut dans les motifs Unicode, mais cela peut être changé en utilisant l'option :const:`ASCII`. Les délimitations de mots sont déterminées par la locale si l'option :const:`LOCALE` est utilisée. À l'intérieur d'un intervalle de caractères, ``\b`` représente le caractère *retour arrière*, par compatibilité avec les chaînes littérales Python.

source: Matches the empty string, but only when it is *not* at the beginning or end of a word. This means that ``r'py\B'`` matches ``'python'``, ``'py3'``, ``'py2'``, but not ``'py'``, ``'py.'``, or ``'py!'``. ``\B`` is just the opposite of ``\b``, so word characters in Unicode patterns are Unicode alphanumerics or the underscore, although this can be changed by using the :const:`ASCII` flag. Word boundaries are determined by the current locale if the :const:`LOCALE` flag is used.
fr: Correspond à la chaîne vide, mais uniquement quand elle *n'est pas* au début ou à la fin d'un mot. Cela signifie que ``r'py\B'`` valide ``'python'``, ``'py3'`` ou ``'py2'``, mais pas ``'py'``, ``'py.'`` ou ``'py!'``. ``\B`` est simplement l'opposé de ``\b``, donc les caractères de mots dans les motifs Unicode sont les alphanumériques et tirets bas Unicode, bien que cela puisse être changé avec l'option :const:`ASCII`. Les délimitations de mots sont déterminées par la locale si l'option :const:`LOCALE` est utilisée.

source: For Unicode (str) patterns:
fr: Pour les motifs Unicode (*str*) :

source: Matches any Unicode decimal digit (that is, any character in Unicode character category [Nd]). This includes ``[0-9]``, and also many other digit characters. If the :const:`ASCII` flag is used only ``[0-9]`` is matched.
fr: Valide n'importe quel chiffre décimal Unicode (soit tout caractère Unicode de catégorie [Nd]). Cela inclut ``[0-9]``, mais aussi bien d'autres caractères de chiffres. Si l'option :const:`ASCII` est utilisée, seuls les caractères de la classe ``[0-9]`` correspondront.

source: For 8-bit (bytes) patterns:
fr: Pour les motifs 8-bit (*bytes*) :

source: Matches any decimal digit; this is equivalent to ``[0-9]``.
fr: Valide n'importe quel chiffre décimal ; équivalent à ``[0-9]``.

source: Matches any character which is not a decimal digit. This is the opposite of ``\d``. If the :const:`ASCII` flag is used this becomes the equivalent of ``[^0-9]``.
fr: Valide tout caractère qui n'est pas un chiffre décimal. C'est l'opposé de ``\d``. Si l'option :const:`ASCII` est utilisée, cela devient équivalent à ``[^0-9]``.

source: Matches Unicode whitespace characters (which includes ``[ \t\n\r\f\v]``, and also many other characters, for example the non-breaking spaces mandated by typography rules in many languages). If the :const:`ASCII` flag is used, only ``[ \t\n\r\f\v]`` is matched.
fr: Valide les caractères d'espacement Unicode (qui incluent ``[ \t\n\r\f\v]`` et bien d'autres, comme les espaces insécables requises par les règles typographiques de beaucoup de langues). Si l'option :const:`ASCII` est utilisée, seuls les caractères de la classe ``[ \t\n\r\f\v]`` sont validés.

source: Matches characters considered whitespace in the ASCII character set; this is equivalent to ``[ \t\n\r\f\v]``.
fr: Valide les caractères considérés comme des espacements dans la table ASCII ; équivalent à ``[ \t\n\r\f\v]``.

source: Matches any character which is not a whitespace character. This is the opposite of ``\s``. If the :const:`ASCII` flag is used this becomes the equivalent of ``[^ \t\n\r\f\v]``.
fr: Valide tout caractère qui n'est pas un caractère d'espacement. c'est l'opposé de ``\s``. Si l'option :const:`ASCII` est utilisée, cela devient équivalent à ``[^ \t\n\r\f\v]``.

source: Matches Unicode word characters; this includes alphanumeric characters (as defined by :meth:`str.isalnum`) as well as the underscore (``_``). If the :const:`ASCII` flag is used, only ``[a-zA-Z0-9_]`` is matched.
fr: Valide les caractères Unicode de mot ; cela inclut les caractères alphanumériques (tels que définis par :meth:`str.isalnum`), ainsi que les tirets bas(``_``). Si l'option :const:`ASCII` est utilisée, seuls les caractères de la classe ``[a-zA-Z0-9_]`` sont validés.

source: Matches characters considered alphanumeric in the ASCII character set; this is equivalent to ``[a-zA-Z0-9_]``. If the :const:`LOCALE` flag is used, matches characters considered alphanumeric in the current locale and the underscore.
fr: Valide les caractères alphanumériques de la table ASCII ; équivalent à ``[a-zA-Z0-9_]``. Si l'option :const:`LOCALE` est utilisée, les caractères considérés alphanumériques dans la locale et le tiret bas seront acceptés.

source: Matches any character which is not a word character. This is the opposite of ``\w``. If the :const:`ASCII` flag is used this becomes the equivalent of ``[^a-zA-Z0-9_]``. If the :const:`LOCALE` flag is used, matches characters which are neither alphanumeric in the current locale nor the underscore.
fr: Valide tout caractère qui n'est pas un caractère de mot. C'est l'opposé de ``\w``. Si l'option :const:`ASCII` est utilisée, cela devient équivalent à ``[^a-zA-Z0-9_]``. Si l'option :const:`LOCALE` est utilisée, les caractères considérés alphanumériques dans la locale, et le tiret bas, ne correspondent pas.

source: Matches only at the end of the string.
fr: Correspond uniquement à la fin d'une chaîne de caractères.

source: Most of the standard escapes supported by Python string literals are also accepted by the regular expression parser::
fr: La plupart des échappements standards supportés par les chaînes littérales sont aussi acceptés par l'analyseur d'expressions rationnelles ::

source: (Note that ``\b`` is used to represent word boundaries, and means "backspace" only inside character classes.)
fr: (Notez que ``\b`` est utilisé pour représenter les bornes d'un mot, et signifie « *retour arrière* » uniquement à l'intérieur d'une classe de caractères)

source: ``'\u'``, ``'\U'``, and ``'\N'`` escape sequences are only recognized in Unicode patterns. In bytes patterns they are errors. Unknown escapes of ASCII letters are reserved for future use and treated as errors.
fr: Les séquences d'échappement ``'\u'``, ``'\U'`` et ``'\N'`` sont seulement reconnues dans les motifs Unicode. Dans les motifs d'octets (type *bytes*), ce sont des erreurs. Les échappements inconnus de lettres ASCII sont réservés pour une utilisation future et sont considérés comme des erreurs.

source: Octal escapes are included in a limited form. If the first digit is a 0, or if there are three octal digits, it is considered an octal escape. Otherwise, it is a group reference. As for string literals, octal escapes are always at most three digits in length.
fr: Les séquences octales d'échappement sont incluses dans une forme limitée. Si le premier chiffre est un 0, ou s'il y a trois chiffres octaux, la séquence est considérée comme octale. Autrement, il s'agit d'une référence vers un groupe. Comme pour les chaînes littérales, les séquences octales ne font jamais plus de 3 caractères de long.

source: The ``'\u'`` and ``'\U'`` escape sequences have been added.
fr: Les séquences d'échappement ``'\u'`` et ``'\U'`` ont été ajoutées.

source: Unknown escapes consisting of ``'\'`` and an ASCII letter now are errors.
fr: Les séquences inconnues composées de ``'\'`` et d'une lettre ASCII sont maintenant des erreurs.

source: The ``'\N{name}'`` escape sequence has been added. As in string literals, it expands to the named Unicode character (e.g. ``'\N{EM DASH}'``).
fr: La séquence d'échappement ``'\N{name}'`` a été ajoutée. Comme avec des chaînes de caractères littérales, elle est transformée vers le caractère Unicode correspondant (par exemple ``'\N{EM DASH}'``).

source: Module Contents
fr: Contenu du module
