Repository: python/python-docs-fr
Catalog: library/re.po
Languages: fr

source: The module defines several functions, constants, and an exception. Some of the functions are simplified versions of the full featured methods for compiled regular expressions. Most non-trivial applications always use the compiled form.
fr: Le module définit plusieurs fonctions, constantes, et une exception. Certaines fonctions sont des versions simplifiées des méthodes plus complètes des expressions rationnelles compilées. La plupart des applications non triviales utilisent toujours la version compilée.

source: Flag constants are now instances of :class:`RegexFlag`, which is a subclass of :class:`enum.IntFlag`.
fr: Les constantes d'options sont maintenant des instances de :class:`RegexFlag`, sous-classe de :class:`enum.IntFlag`.

source: Make ``\w``, ``\W``, ``\b``, ``\B``, ``\d``, ``\D``, ``\s`` and ``\S`` perform ASCII-only matching instead of full Unicode matching. This is only meaningful for Unicode patterns, and is ignored for byte patterns. Corresponds to the inline flag ``(?a)``.
fr: Fait correspondre à ``\w``, ``\W``, ``\b``, ``\B``, ``\d``, ``\D``, ``\s`` et ``\s`` des caractères ASCII seulement, plutôt qu'Unicode. Cela n'a du sens que pour les motifs Unicode, et est ignoré pour les motifs 8-bit. Correspond à l'option de groupe ``(?a)``.

source: Note that for backward compatibility, the :const:`re.U` flag still exists (as well as its synonym :const:`re.UNICODE` and its embedded counterpart ``(?u)``), but these are redundant in Python 3 since matches are Unicode by default for strings (and Unicode matching isn't allowed for bytes).
fr: Notez que par compatibilité envers les versions précédentes, l'option :const:`re.U` existe toujours (ainsi que son synonyme :const:`re.UNICODE` et sa version embarquée ``(?u)``), mais elles sont redondantes en Python 3 depuis que l'analyse est faite en Unicode par défaut pour les chaînes de caractères (et que l'analyse Unicode n'est pas permise pour les chaînes 8-bit).

source: Display debug information about compiled expression. No corresponding inline flag.
fr: Affiche des informations de débogage à propos de l'expression compilée. N'a pas d'option de groupe équivalente.

source: Perform case-insensitive matching; expressions like ``[A-Z]`` will also match lowercase letters. Full Unicode matching (such as ``Ü`` matching ``ü``) also works unless the :const:`re.ASCII` flag is used to disable non-ASCII matches. The current locale does not change the effect of this flag unless the :const:`re.LOCALE` flag is also used. Corresponds to the inline flag ``(?i)``.
fr: Effectue une analyse indépendante de la casse. Les motifs tels que ``[A-Z]`` accepteront donc les caractères minuscules. L'analyse Unicode complète (tel que ``Ü`` correspondant à ``ü``) fonctionne aussi, tant que l'option :const:`re.ASCII` n'est pas utilisée. La locale n'affecte pas cette option, tant que l'option :const:`re.LOCALE` n'est pas utilisée. Correspond au marqueur de groupe ``(?i)``.

source: Note that when the Unicode patterns ``[a-z]`` or ``[A-Z]`` are used in combination with the :const:`IGNORECASE` flag, they will match the 52 ASCII letters and 4 additional non-ASCII letters: 'İ' (U+0130, Latin capital letter I with dot above), 'ı' (U+0131, Latin small letter dotless i), 'ſ' (U+017F, Latin small letter long s) and 'K' (U+212A, Kelvin sign). If the :const:`ASCII` flag is used, only letters 'a' to 'z' and 'A' to 'Z' are matched.
fr: À noter : quand les motifs Unicode ``[a-z]`` ou ``[A-Z]`` sont utilisés en combinaison avec la constante :const:`IGNORECASE`, ils correspondront aux 52 caractères ASCII et aux 4 caractères non ASCII : 'İ' (*U+0130*, Latin majuscule I avec un point au-dessus), 'ı' (*U+0131*, Latin minuscule sans point au-dessus), 'ſ' (*U+017F*, Latin minuscule *long s*) et 'K' (*U+212A*, *Kelvin sign*). Si la constante :const:`ASCII` est utilisée, seuls les caractères 'a' à 'z' et 'A' à 'Z' seront concernés.

source: Make ``\w``, ``\W``, ``\b``, ``\B`` and case-insensitive matching dependent on the current locale. This flag can be used only with bytes patterns. The use of this flag is discouraged as the locale mechanism is very unreliable, it only handles one "culture" at a time, and it only works with 8-bit locales. Unicode matching is already enabled by default in Python 3 for Unicode (str) patterns, and it is able to handle different locales/languages. Corresponds to the inline flag ``(?L)``.
fr: Fait dépendre de la locale courante : ``\w``, ``\W``, ``\b``, ``\B``, et l'analyse insensible à la casse. Cette option peut être utilisée avec les motifs en *bytes*. L'utilisation de cette option est déconseillée à cause du mécanisme de locale très peu fiable, et ne gérant qu'une « culture » à la fois, et ne fonctionnant que pour les locales 8-bits. L'analyse Unicode est déjà activée par défaut dans Python 3 pour les motifs Unicode (*str*), et elle est capable de gérer plusieurs locales et langages. Correspond à l'option de groupe ``(?L)``.

source: :const:`re.LOCALE` can be used only with bytes patterns and is not compatible with :const:`re.ASCII`.
fr: :const:`re.LOCALE` ne peut être utilisée qu'avec les motifs 8-bit et n'est pas compatible avec :const:`re.ASCII`.

source: Compiled regular expression objects with the :const:`re.LOCALE` flag no longer depend on the locale at compile time. Only the locale at matching time affects the result of matching.
fr: Les objets d'expressions régulières compilées avec l'indicateur :const:`re.LOCALE` ne dépendent plus de la *locale* au moment de la compilation. Seulement la *locale* au moment de la correspondance affecte le résultat.

source: When specified, the pattern character ``'^'`` matches at the beginning of the string and at the beginning of each line (immediately following each newline); and the pattern character ``'$'`` matches at the end of the string and at the end of each line (immediately preceding each newline). By default, ``'^'`` matches only at the beginning of the string, and ``'$'`` only at the end of the string and immediately before the newline (if any) at the end of the string. Corresponds to the inline flag ``(?m)``.
fr: Quand spécifiée, le caractère ``'^'`` correspond au début d'une chaîne et au début d'une ligne (caractère suivant directement le saut de ligne) ; et le caractère ``'$'`` correspond à la fin d'une chaîne et à la fin d'une ligne (juste avant le saut de ligne). Par défaut, ``'^'`` correspond uniquement au début de la chaîne, et ``'$'`` uniquement à la fin de la chaîne, ou immédiatement avant le saut de ligne (s'il y a) à la fin de la chaîne. Correspond à l'option de groupe ``(?m)``.

source: Make the ``'.'`` special character match any character at all, including a newline; without this flag, ``'.'`` will match anything *except* a newline. Corresponds to the inline flag ``(?s)``.
fr: Fait correspondre tous les caractères possibles à ``'.'``, incluant le saut de ligne ; sans cette option, ``'.'`` correspondrait à tout caractère à l'exception du saut de ligne. Correspond à l'option de groupe ``(?s)``.

source: This flag allows you to write regular expressions that look nicer and are more readable by allowing you to visually separate logical sections of the pattern and add comments. Whitespace within the pattern is ignored, except when in a character class, or when preceded by an unescaped backslash, or within tokens like ``*?``, ``(?:`` or ``(?P<...>``. For example, ``(? :`` and ``* ?`` are not allowed. When a line contains a ``#`` that is not in a character class and is not preceded by an unescaped backslash, all characters from the leftmost such ``#`` through the end of the line are ignored.
fr: Cette option vous autorise à écrire des expressions rationnelles qui présentent mieux et sont plus lisibles en vous permettant de séparer visuellement les sections logiques du motif et d'ajouter des commentaires. Les caractères d'espacement à l'intérieur du motif sont ignorés, sauf à l'intérieur des classes de caractères ou quand ils sont précédés d'un *backslash* non échappé, ou dans des séquences comme ``*?``, ``(?:`` ou ``(?P<...>``.Par exemple, ``(? :`` et ``* ?`` ne sont pas autorisés. Quand une ligne contient un ``#`` qui n'est ni dans une classe de caractères, ni précédé d'un *backslash* non échappé, tous les caractères depuis le ``#`` le plus à gauche jusqu'à la fin de la ligne sont ignorés.

source: This means that the two following regular expression objects that match a decimal number are functionally equal::
fr: Cela signifie que les deux expressions rationnelles suivantes qui valident un nombre décimal sont fonctionnellement égales ::

source: Corresponds to the inline flag ``(?x)``.
fr: Correspond à l'option de groupe ``(?x)``.

source: Functions
fr: Fonctions

source: Compile a regular expression pattern into a :ref:`regular expression object <re-objects>`, which can be used for matching using its :func:`~Pattern.match`, :func:`~Pattern.search` and other methods, described below.
fr: Compile un motif vers une :ref:`expression rationnelle <re-objects>` compilée, dont les méthodes :func:`~Pattern.match` et :func:`~Pattern.search`, décrites ci-dessous, peuvent être utilisées pour analyser des textes.

source: The expression's behaviour can be modified by specifying a *flags* value. Values can be any of the following variables, combined using bitwise OR (the ``|`` operator).
fr: Le comportement des expressions peut être modifié en spécifiant une valeur *flags*. Les valeurs sont comprises dans les variables suivantes, et peuvent être combinées avec un *ou* bit-à-bit (opérateur ``|``).

source: The sequence ::
fr: La séquence ::

source: is equivalent to ::
fr: est équivalente à ::

source: but using :func:`re.compile` and saving the resulting regular expression object for reuse is more efficient when the expression will be used several times in a single program.
fr: mais utiliser :func:`re.compile` et sauvegarder l'expression rationnelle renvoyée pour la réutiliser est plus efficace quand l'expression est amenée à être utilisée plusieurs fois dans un même programme.

source: The compiled versions of the most recent patterns passed to :func:`re.compile` and the module-level matching functions are cached, so programs that use only a few regular expressions at a time needn't worry about compiling regular expressions.
fr: Les versions compilées des motifs les plus récents passés à :func:`re.compile` et autres fonctions d'analyse du module sont mises en cache, ainsi les programmes qui n'utilisent que quelques expressions rationnelles en même temps n'ont pas à s'inquiéter de la compilation de ces expressions.

source: Scan through *string* looking for the first location where the regular expression *pattern* produces a match, and return a corresponding :ref:`match object <match-objects>`. Return ``None`` if no position in the string matches the pattern; note that this is different from finding a zero-length match at some point in the string.
fr: Analyse *string* à la recherche du premier emplacement où l'expression rationnelle *pattern* trouve une correspondance, et renvoie l':ref:`objet de correspondance <match-objects>` trouvé. Renvoie ``None`` si aucune position dans la chaîne ne valide le motif ; notez que cela est différent de trouver une correspondance avec une chaîne vide à un certain endroit de la chaîne.

source: If zero or more characters at the beginning of *string* match the regular expression *pattern*, return a corresponding :ref:`match object <match-objects>`. Return ``None`` if the string does not match the pattern; note that this is different from a zero-length match.
fr: Si zéro ou plus caractères au début de *string* correspondent à l'expression rationnelle *pattern*, renvoie l':ref:`objet de correspondance <match-objects>` trouvé. Renvoie ``None`` si la chaîne ne correspond pas au motif ; notez que cela est différent d'une correspondance avec une chaîne vide.

source: Note that even in :const:`MULTILINE` mode, :func:`re.match` will only match at the beginning of the string and not at the beginning of each line.
fr: Notez que même en mode :const:`MULTILINE`, :func:`re.match` ne validera qu'au début de la chaîne et non au début de chaque ligne.

source: If you want to locate a match anywhere in *string*, use :func:`search` instead (see also :ref:`search-vs-match`).
fr: Si vous voulez trouver une correspondance n'importe où dans *string*, utilisez plutôt :func:`search` (voir aussi :ref:`search-vs-match`).

source: If the whole *string* matches the regular expression *pattern*, return a corresponding :ref:`match object <match-objects>`. Return ``None`` if the string does not match the pattern; note that this is different from a zero-length match.
fr: Si l'entièreté de la chaîne *string* correspond à l'expression rationnelle *pattern*, renvoie l':ref:`objet de correspondance <match-objects>` trouvé. Renvoie ``None`` si la chaîne ne correspond pas au motif ; notez que cela est différent d'une correspondance avec une chaîne vide.

source: Split *string* by the occurrences of *pattern*. If capturing parentheses are used in *pattern*, then the text of all groups in the pattern are also returned as part of the resulting list. If *maxsplit* is nonzero, at most *maxsplit* splits occur, and the remainder of the string is returned as the final element of the list. ::
fr: Sépare *string* selon les occurrences de *pattern*. Si des parenthèses de capture sont utilisées dans *pattern*, alors les textes des groupes du motif sont aussi renvoyés comme éléments de la liste résultante. Si *maxsplit* est différent de zéro, il ne pourra y avoir plus de *maxsplit* séparations, et le reste de la chaîne sera renvoyé comme le dernier élément de la liste. ::

source: If there are capturing groups in the separator and it matches at the start of the string, the result will start with an empty string. The same holds for the end of the string::
fr: S'il y a des groupes de capture dans le séparateur et qu'ils trouvent une correspondance au début de la chaîne, le résultat commencera par une chaîne vide. La même chose se produit pour la fin de la chaîne ::

source: That way, separator components are always found at the same relative indices within the result list.
fr: De cette manière, les séparateurs sont toujours trouvés aux mêmes indices relatifs dans la liste résultante.

source: Empty matches for the pattern split the string only when not adjacent to a previous empty match.
fr: Les correspondances vides pour le motif scindent la chaîne de caractères seulement lorsqu'ils ne sont pas adjacents à une correspondance vide précédente.

source: Added the optional flags argument.
fr: ajout de l'argument optionnel *flags*.

source: Added support of splitting on a pattern that could match an empty string.
fr: Gestion du découpage avec un motif qui pourrait correspondre à une chaine de caractère vide.

source: Return all non-overlapping matches of *pattern* in *string*, as a list of strings or tuples. The *string* is scanned left-to-right, and matches are returned in the order found. Empty matches are included in the result.
fr: Renvoie toutes les correspondances, sans chevauchements, entre le motif *pattern* et la chaîne *string*, comme une liste de chaînes ou de *n*-uplets. La chaîne *string* est examinée de gauche à droite, et les correspondances sont données dans cet ordre. Le résultat peut contenir des correspondances vides.

source: The result depends on the number of capturing groups in the pattern. If there are no groups, return a list of strings matching the whole pattern. If there is exactly one group, return a list of strings matching that group. If multiple groups are present, return a list of tuples of strings matching the groups. Non-capturing groups do not affect the form of the result.
fr: Le type du résultat dépend du nombre de groupes capturants dans le motif. S'il n'y en a pas, le résultat est une liste de sous-chaînes de caractères qui correspondent au motif. S'il y a exactement un groupe, le résultat est une liste constituée des sous-chaînes qui correspondaient à ce groupe pour chaque correspondance entre le motif et la chaîne. S'il y a plusieurs groupes, le résultat est formé de *n*-uplets avec les sous-chaînes correspondant aux différents groupes.

source: Non-empty matches can now start just after a previous empty match.
fr: Les correspondances non vides peuvent maintenant démarrer juste après une correspondance vide précédente.

source: Return an :term:`iterator` yielding :ref:`match objects <match-objects>` over all non-overlapping matches for the RE *pattern* in *string*. The *string* is scanned left-to-right, and matches are returned in the order found. Empty matches are included in the result.
fr: Renvoie un :term:`iterator` produisant des :ref:`objets de correspondance <match-objects>` pour toutes les correspondances non chevauchantes de l'expression rationnelle *pattern* sur la chaîne *string*. *string* est analysée de la gauche vers la droite, et les correspondances sont renvoyées dans l'ordre où elles sont trouvées. Les correspondances vides sont inclues dans le résultat.

source: Return the string obtained by replacing the leftmost non-overlapping occurrences of *pattern* in *string* by the replacement *repl*. If the pattern isn't found, *string* is returned unchanged. *repl* can be a string or a function; if it is a string, any backslash escapes in it are processed. That is, ``\n`` is converted to a single newline character, ``\r`` is converted to a carriage return, and so forth. Unknown escapes of ASCII letters are reserved for future use and treated as errors. Other unknown escapes such as ``\&`` are left alone. Backreferences, such as ``\6``, are replaced with the substring matched by group 6 in the pattern. For example::
fr: Renvoie la chaîne obtenue en remplaçant les occurrences (sans chevauchement) les plus à gauche de *pattern* dans *string* par le remplacement *repl*. Si le motif n'est pas trouvé, *string* est renvoyée inchangée. *repl* peut être une chaîne de caractères ou une fonction ; si c'est une chaîne, toutes les séquences d'échappement qu'elle contient sont traduites. Ainsi, ``\n`` est convertie en un simple saut de ligne, ``\r`` en un retour chariot, et ainsi de suite. Les échappements inconnus de lettres ASCII sont réservés pour une utilisation future et sont considérés comme des erreurs. Les autres échappements tels que ``\&`` sont laissés intacts. Les références arrières, telles que ``\6``, sont remplacées par la sous-chaîne correspondant au groupe 6 dans le motif. Par exemple ::

source: If *repl* is a function, it is called for every non-overlapping occurrence of *pattern*. The function takes a single :ref:`match object <match-objects>` argument, and returns the replacement string. For example::
fr: Si *repl* est une fonction, elle est appelée pour chaque occurrence non chevauchante de *pattern*. La fonction prend comme argument un :ref:`objet de correspondance <match-objects>`, et renvoie la chaîne de remplacement. Par exemple ::

source: The pattern may be a string or a :ref:`pattern object <re-objects>`.
fr: Le motif peut être une chaîne de caractères ou un :ref:`objet expression rationnelle <re-objects>`.

source: The optional argument *count* is the maximum number of pattern occurrences to be replaced; *count* must be a non-negative integer. If omitted or zero, all occurrences will be replaced. Empty matches for the pattern are replaced only when not adjacent to a previous empty match, so ``sub('x*', '-', 'abxd')`` returns ``'-a-b--d-'``.
fr: L'argument optionnel *count* est le nombre maximum d'occurrences du motif à remplacer : *count* ne doit pas être un nombre négatif. Si omis ou nul, toutes les occurrences seront remplacées. Les correspondances vides avec le motif sont remplacées uniquement quand elles ne sont pas adjacentes à une précédente correspondance, ainsi ``sub('x*', '-', 'abxd')`` renvoie ``'-a-b--d-'``.

source: In string-type *repl* arguments, in addition to the character escapes and backreferences described above, ``\g<name>`` will use the substring matched by the group named ``name``, as defined by the ``(?P<name>...)`` syntax. ``\g<number>`` uses the corresponding group number; ``\g<2>`` is therefore equivalent to ``\2``, but isn't ambiguous in a replacement such as ``\g<2>0``. ``\20`` would be interpreted as a reference to group 20, not a reference to group 2 followed by the literal character ``'0'``. The backreference ``\g<0>`` substitutes in the entire substring matched by the RE.
fr: Dans les arguments *repl* de type *string*, en plus des séquences d'échappement et références arrières décrites au-dessus, ``\g<name>`` utilisera la sous-chaîne correspondant au groupe nommé ``name``, comme défini par la syntaxe ``(?P<name>...)``. ``\g<number>`` utilise le groupe numéroté associé ; ``\g<2>`` est ainsi équivalent à ``\2``, mais n'est pas ambigu dans un remplacement tel que ``\g<2>0``, ``\20`` serait interprété comme une référence au groupe 20, et non une référence au groupe 2 suivie par un caractère littéral ``'0'``. La référence arrière ``\g<0>`` est remplacée par la sous-chaîne entière validée par l'expression rationnelle.

source: Unmatched groups are replaced with an empty string.
fr: Les groupes sans correspondance sont remplacés par une chaîne vide.

source: Unknown escapes in *pattern* consisting of ``'\'`` and an ASCII letter now are errors.
fr: Les séquences d'échappement inconnues dans *pattern* formées par ``'\'`` et une lettre ASCII sont maintenant des erreurs.

source: Unknown escapes in *repl* consisting of ``'\'`` and an ASCII letter now are errors.
fr: Les séquences d'échappement inconnues dans *repl* formées par ``'\'`` et une lettre ASCII sont maintenant des erreurs.

source: Empty matches for the pattern are replaced when adjacent to a previous non-empty match.
fr: Les correspondances vides pour le motif sont remplacées lorsqu'elles sont adjacentes à une correspondance non vide précédente.

source: Perform the same operation as :func:`sub`, but return a tuple ``(new_string, number_of_subs_made)``.
fr: Réalise la même opération que :func:`sub`, mais renvoie une paire ``(nouvelle_chaîne, nombre_de_substitutions_réalisées)``.

source: Escape special characters in *pattern*. This is useful if you want to match an arbitrary literal string that may have regular expression metacharacters in it. For example::
fr: Échappe tous les caractères spéciaux de *pattern*. Cela est utile si vous voulez valider une quelconque chaîne littérale qui pourrait contenir des métacaractères d'expressions rationnelles. Par exemple ::

source: This function must not be used for the replacement string in :func:`sub` and :func:`subn`, only backslashes should be escaped. For example::
fr: Cette fonction ne doit pas être utilisée pour la chaîne de remplacement dans :func:`sub` et :func:`subn`, seuls les antislash devraient être échappés. Par exemple ::

source: The ``'_'`` character is no longer escaped.
fr: Le caractère ``'_'`` n'est plus échappé.

source: Only characters that can have special meaning in a regular expression are escaped. As a result, ``'!'``, ``'"'``, ``'%'``, ``"'"``, ``','``, ``'/'``, ``':'``, ``';'``, ``'<'``, ``'='``, ``'>'``, ``'@'``, and ``"`"`` are no longer escaped.
fr: Seuls les caractères qui peuvent avoir une signification spéciale dans une expression rationnelle sont échappés. De ce fait, ``'!'``, ``'"'``, ``'%'``, ``"'"``, ``','``, ``'/'``, ``':'``, ``';'``, ``'<'``, ``'='``, ``'>'``, ``'@'``, et ``"`"`` ne sont plus échappés.

source: Clear the regular expression cache.
fr: Vide le cache d'expressions rationnelles.
