Repository: python/python-docs-fr
Catalog: library/re.po
Languages: fr

source: The entries are separated by one or more newlines. Now we convert the string into a list with each nonempty line having its own entry:
fr: Les entrées sont séparées par un saut de ligne ou plus. Nous convertissons maintenant la chaîne en une liste où chaque ligne non vide aura sa propre entrée :

source: Finally, split each entry into a list with first name, last name, telephone number, and address. We use the ``maxsplit`` parameter of :func:`split` because the address has spaces, our splitting pattern, in it:
fr: Finalement, on sépare chaque entrée en une liste avec prénom, nom, numéro de téléphone et adresse. Nous utilisons le paramètre ``maxsplit`` de :func:`split` parce que l'adresse contient des espaces, qui sont notre motif de séparation :

source: The ``:?`` pattern matches the colon after the last name, so that it does not occur in the result list. With a ``maxsplit`` of ``4``, we could separate the house number from the street name:
fr: Le motif ``:?`` trouve les deux points derrière le nom de famille, pour qu'ils n'apparaissent pas dans la liste résultante. Avec un ``maxsplit`` de ``4``, nous pourrions séparer le numéro du nom de la rue :

source: Text Munging
fr: Mélanger les lettres des mots

source: :func:`sub` replaces every occurrence of a pattern with a string or the result of a function. This example demonstrates using :func:`sub` with a function to "munge" text, or randomize the order of all the characters in each word of a sentence except for the first and last characters::
fr: :func:`sub` remplace toutes les occurrences d'un motif par une chaîne ou le résultat d'une fonction. Cet exemple le montre, en utilisant :func:`sub` avec une fonction qui mélange aléatoirement les caractères de chaque mot dans une phrase (à l'exception des premiers et derniers caractères) ::

source: Finding all Adverbs
fr: Trouver tous les adverbes

source: :func:`findall` matches *all* occurrences of a pattern, not just the first one as :func:`search` does. For example, if a writer wanted to find all of the adverbs in some text, they might use :func:`findall` in the following manner::
fr: :func:`findall` trouve *toutes* les occurrences d'un motif, pas juste la première comme le fait :func:`search`. Par exemple, si un(e) écrivain(e) voulait trouver tous les adverbes dans un texte, il/elle devrait utiliser :func:`findall` de la manière suivante ::

source: Finding all Adverbs and their Positions
fr: Trouver tous les adverbes et leurs positions

source: If one wants more information about all matches of a pattern than the matched text, :func:`finditer` is useful as it provides :ref:`match objects <match-objects>` instead of strings. Continuing with the previous example, if a writer wanted to find all of the adverbs *and their positions* in some text, they would use :func:`finditer` in the following manner::
fr: Pour obtenir plus d'informations sur les correspondances que juste le texte trouvé, :func:`finditer` est utile en fournissant des :ref:`objets de correspondance <match-objects>` plutôt que des chaînes. En continuant avec le précédent exemple, si l'écrivain(e) voulait trouver tous les adverbes *et leurs positions* dans un texte, il/elle utiliserait :func:`finditer` de la manière suivante ::

source: Raw String Notation
fr: Notation brutes de chaînes

source: Raw string notation (``r"text"``) keeps regular expressions sane. Without it, every backslash (``'\'``) in a regular expression would have to be prefixed with another one to escape it. For example, the two following lines of code are functionally identical::
fr: La notation brute de chaînes (``r"text"``) garde saines les expressions rationnelles. Sans elle, chaque *backslash* (``'\'``) dans une expression rationnelle devrait être préfixé d'un autre *backslash* pour l'échapper. Par exemple, les deux lignes de code suivantes sont fonctionnellement identiques ::

source: When one wants to match a literal backslash, it must be escaped in the regular expression. With raw string notation, this means ``r"\\"``. Without raw string notation, one must use ``"\\\\"``, making the following lines of code functionally identical::
fr: Pour rechercher un *backslash* littéral, il faut l'échapper dans l'expression rationnelle. Avec la notation brute, cela signifie ``r"\\"``. Sans elle, il faudrait utiliser ``"\\\\"``, faisant que les deux lignes de code suivantes sont fonctionnellement identiques ::

source: Writing a Tokenizer
fr: Écrire un analyseur lexical

source: A `tokenizer or scanner <https://en.wikipedia.org/wiki/Lexical_analysis>`_ analyzes a string to categorize groups of characters. This is a useful first step in writing a compiler or interpreter.
fr: Un `analyseur lexical ou scanner <https://en.wikipedia.org/wiki/Lexical_analysis>`_ analyse une chaîne pour catégoriser les groupes de caractères. C'est une première étape utile dans l'écriture d'un compilateur ou d'un interpréteur.

source: The text categories are specified with regular expressions. The technique is to combine those into a single master regular expression and to loop over successive matches::
fr: Les catégories de texte sont spécifiées par des expressions rationnelles. La technique est de les combiner dans une unique expression rationnelle maîtresse, et de boucler sur les correspondances successives ::

source: The tokenizer produces the following output::
fr: L'analyseur produit la sortie suivante ::

source: Friedl, Jeffrey. Mastering Regular Expressions. 3rd ed., O'Reilly Media, 2009. The third edition of the book no longer covers Python at all, but the first edition covered writing good regular expression patterns in great detail.
fr: *Friedl, Jeffrey. Mastering Regular Expressions. 3rd ed., O'Reilly Media, 2009*. La troisième édition de ce livre ne couvre plus du tout Python, mais la première version explique en détails comment écrire de bonnes expressions rationnelles.
