Repository: python/python-docs-fr
Catalog: library/rlcompleter.po
Languages: fr

source: :mod:`rlcompleter` --- Completion function for GNU readline
fr: :mod:`rlcompleter` --- Fonction de complétion pour *GNU readline*

source: **Source code:** :source:`Lib/rlcompleter.py`
fr: **Code source :** :source:`Lib/rlcompleter.py`

source: The :mod:`rlcompleter` module defines a completion function suitable for the :mod:`readline` module by completing valid Python identifiers and keywords.
fr: Le module :mod:`rlcompleter` définit une fonction de complétion appropriée pour le module :mod:`readline` en complétant des identifiants et mots-clés Python valides.

source: When this module is imported on a Unix platform with the :mod:`readline` module available, an instance of the :class:`Completer` class is automatically created and its :meth:`complete` method is set as the :mod:`readline` completer.
fr: Quand le module est importé dans une plate-forme Unix et la méthode :meth:`complete` est configurée pour assurer la complétion de :mod:`readline`, une instance de classe :class:`Completer` est automatiquement créée et la méthode est configurée au finisseur :meth:`complete`

source: Example::
fr: Exemple ::

source: The :mod:`rlcompleter` module is designed for use with Python's :ref:`interactive mode <tut-interactive>`. Unless Python is run with the :option:`-S` option, the module is automatically imported and configured (see :ref:`rlcompleter-config`).
fr: Le module :mod:`rlcompleter` est conçu pour être utilisé par le :ref:`mode interactif <tut-interactive>` de Python. À moins que Python ne soit exécuté avec l'option :option:`-S`, le module est automatiquement importé et configuré (voir :ref:`rlcompleter-config`).

source: On platforms without :mod:`readline`, the :class:`Completer` class defined by this module can still be used for custom purposes.
fr: Sur les plate-formes sans :mod:`readline`, la classe :class:`Completer` définie par ce module peut quand même être utilisée pour des fins personnalisées.

source: Completer Objects
fr: Objets pour la complétion (*Completer Objects*)

source: Completer objects have the following method:
fr: Les objets pour la complétion (*Completer objects* en anglais) disposent de la méthode suivante :

source: Return the *state*\ th completion for *text*.
fr: Renvoie la *state-ième* complétion pour *text*.

source: If called for *text* that doesn't include a period character (``'.'``), it will complete from names currently defined in :mod:`__main__`, :mod:`builtins` and keywords (as defined by the :mod:`keyword` module).
fr: Si *text* ne contient pas un caractère point (``'.'``), il puise dans les noms actuellement définis dans :mod:`__main__`, :mod:`builtins` ainsi que les mots-clés (ainsi que définis par le module :mod:`keyword`)

source: If called for a dotted name, it will try to evaluate anything without obvious side-effects (functions will not be evaluated, but it can generate calls to :meth:`__getattr__`) up to the last part, and find matches for the rest via the :func:`dir` function. Any exception raised during the evaluation of the expression is caught, silenced and :const:`None` is returned.
fr: Quand elle est appelée pour un nom qui comporte un point, elle ne tente d'évaluer que ce qui n'a pas d'effet secondaire (les fonctions ne sont pas évaluées, mais elle peut faire des appels à :meth:`__getattr__`), jusqu'à la dernière partie, et trouve des équivalents pour le reste via la fonction :func:`dir`. Toute exception levée durant l'évaluation de l'expression est interceptée, mise sous silence, et :const:`None` est renvoyé.
