Repository: python/python-docs-fr
Catalog: library/secrets.po
Languages: fr

source: :mod:`secrets` --- Generate secure random numbers for managing secrets
fr: :mod:`secrets` — Générer des nombres aléatoires de façon sécurisée pour la gestion des secrets

source: **Source code:** :source:`Lib/secrets.py`
fr: **Code source :** :source:`Lib/secrets.py`

source: The :mod:`secrets` module is used for generating cryptographically strong random numbers suitable for managing data such as passwords, account authentication, security tokens, and related secrets.
fr: Le module :mod:`secrets` est utilisé pour la génération cryptographique forte de nombres aléatoires, adaptée à la gestion des mots de passe, à l'authentification des comptes, à la gestion des jetons de sécurité et des secrets associés.

source: In particularly, :mod:`secrets` should be used in preference to the default pseudo-random number generator in the :mod:`random` module, which is designed for modelling and simulation, not security or cryptography.
fr: En particulier, :mod:`secrets` doit être préféré au générateur pseudo-aléatoire du module :mod:`random` qui n'est conçu que pour la modélisation et la simulation, et non pour la sécurité ou la cryptographie.

source: Random numbers
fr: Nombres aléatoires

source: The :mod:`secrets` module provides access to the most secure source of randomness that your operating system provides.
fr: Le module :mod:`secrets` fournit un accès à la source d'aléatoire la plus sûre disponible sur votre système d'exploitation.

source: A class for generating random numbers using the highest-quality sources provided by the operating system. See :class:`random.SystemRandom` for additional details.
fr: Une classe permettant de générer des nombres aléatoires en utilisant les sources de meilleure qualité possible fournies par le système d'exploitation. Se référer à :class:`random.SystemRandom` pour plus de détails.

source: Return a randomly-chosen element from a non-empty sequence.
fr: Renvoie un élément choisi aléatoirement dans une séquence non-vide.

source: Return a random int in the range [0, *n*).
fr: Renvoie un entier aléatoire dans l'intervalle [0, *n*).

source: Return an int with *k* random bits.
fr: Renvoie un entier de *k* bits aléatoires.

source: Generating tokens
fr: Génération de jetons

source: The :mod:`secrets` module provides functions for generating secure tokens, suitable for applications such as password resets, hard-to-guess URLs, and similar.
fr: Le module :mod:`secrets` fournit des fonctions pour la génération sécurisée de jetons adaptés à la réinitialisation de mot de passe, la production d'URLs difficiles à deviner, etc.

source: Return a random byte string containing *nbytes* number of bytes. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
fr: Renvoie une chaîne d'octets aléatoire contenant *nbytes* octets. Si *nbytes* est ``None`` ou omis, une valeur par défaut raisonnable est utilisée.

source: Return a random text string, in hexadecimal. The string has *nbytes* random bytes, each byte converted to two hex digits. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
fr: Renvoie une chaîne de caractères aléatoire en hexadécimal. La chaîne comporte *nbytes* octets aléatoires, chaque octet étant converti en deux chiffres hexadécimaux. Si *nbytes* est ``None`` ou omis, une valeur par défaut raisonnable est utilisée.

source: Return a random URL-safe text string, containing *nbytes* random bytes. The text is Base64 encoded, so on average each byte results in approximately 1.3 characters. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
fr: Renvoie une chaîne de caractères aléatoire adaptée au format URL, contenant *nbytes* octets aléatoires. Le texte est encodé en base64, chaque octet produit en moyenne 1,3 caractères. Si *nbytes* est ``None`` ou omis, une valeur par défaut raisonnable est utilisée.

source: How many bytes should tokens use?
fr: Combien d'octets mon jeton doit-il comporter ?

source: To be secure against `brute-force attacks <https://en.wikipedia.org/wiki/Brute-force_attack>`_, tokens need to have sufficient randomness. Unfortunately, what is considered sufficient will necessarily increase as computers get more powerful and able to make more guesses in a shorter period. As of 2015, it is believed that 32 bytes (256 bits) of randomness is sufficient for the typical use-case expected for the :mod:`secrets` module.
fr: Afin de se prémunir des `attaques par force brute <https://fr.wikipedia.org/wiki/Attaque_par_force_brute>`_, les jetons doivent être suffisamment aléatoires. Malheureusement, ce qui est considéré comme suffisant augmente nécessairement avec la puissance de calcul des ordinateurs qui leur permet de réaliser plus de tentatives dans un laps de temps plus court. En 2015, 32 octets (256 bits) aléatoires est généralement considéré suffisant pour les usages typiques du module :mod:`secrets`.

source: For those who want to manage their own token length, you can explicitly specify how much randomness is used for tokens by giving an :class:`int` argument to the various ``token_*`` functions. That argument is taken as the number of bytes of randomness to use.
fr: Si vous souhaitez gérer votre propre longueur de jeton, vous pouvez préciser explicitement quelle quantité d'aléatoire est utilisée pour les jetons en passant un argument :class:`int` aux différentes fonctions ``token_*``. Cet argument indique le nombre d'octets aléatoires à utiliser.

source: Otherwise, if no argument is provided, or if the argument is ``None``, the ``token_*`` functions will use a reasonable default instead.
fr: Sinon, si aucun argument n'est passé ou si celui-ci est ``None``, les fonctions ``token_*`` utilisent une valeur par défaut raisonnable à la place.

source: That default is subject to change at any time, including during maintenance releases.
fr: Cette valeur par défaut est susceptible de changer à n'importe quel moment, y compris lors des mises à jour de maintenance.

source: Other functions
fr: Autres fonctions

source: Return ``True`` if strings *a* and *b* are equal, otherwise ``False``, in such a way as to reduce the risk of `timing attacks <https://codahale.com/a-lesson-in-timing-attacks/>`_. See :func:`hmac.compare_digest` for additional details.
fr: Renvoie ``True`` si les chaînes *a* et *b* sont égales et ``False`` sinon, d'une manière permettant de réduire le risque d'`attaque temporelle <https://fr.wikipedia.org/wiki/Attaque_temporelle>`_. Se référer à :func:`hmac.compare_digest` pour plus de détails.

source: Recipes and best practices
fr: Recettes et bonnes pratiques

source: This section shows recipes and best practices for using :mod:`secrets` to manage a basic level of security.
fr: Cette section expose les recettes et les bonnes pratiques d'utilisation de :mod:`secrets` pour gérer un niveau minimal de sécurité.

source: Generate an eight-character alphanumeric password:
fr: Générer un mot de passe alphanumérique à huit caractères :

source: Applications should not `store passwords in a recoverable format <http://cwe.mitre.org/data/definitions/257.html>`_, whether plain text or encrypted. They should be salted and hashed using a cryptographically-strong one-way (irreversible) hash function.
fr: Les applications ne doivent jamais `stocker des mots de passe dans un format permettant leur récupération <http://cwe.mitre.org/data/definitions/257.html>`_, que ce soit en texte brut ou chiffré. Les mots de passe devraient être salés et transformés de façon irréversible par une fonction de hachage cryptographique.

source: Generate a ten-character alphanumeric password with at least one lowercase character, at least one uppercase character, and at least three digits:
fr: Générer un mot de passe alphanumérique à dix caractères contenant au moins un caractère en minuscule, au moins un caractère en majuscule et au moins trois chiffres :

source: Generate an `XKCD-style passphrase <https://xkcd.com/936/>`_:
fr: Générer une `phrase de passe dans le style xkcd <https://xkcd.com/936/>`_ :

source: Generate a hard-to-guess temporary URL containing a security token suitable for password recovery applications:
fr: Générer une URL temporaire difficile à deviner contenant un jeton de sécurité adapté à réinitialisation d'un mot de passe :
