Repository: python/python-docs-fr
Catalog: library/socketserver.po
Languages: fr

source: This function is called when the :attr:`timeout` attribute has been set to a value other than :const:`None` and the timeout period has passed with no requests being received. The default action for forking servers is to collect the status of any child processes that have exited, while in threading servers this method does nothing.
fr: Cette fonction est appelée lorsque l'attribut :attr:`timeout` est réglé à autre chose que :const:`None` et que le délai d'attente expire sans qu'aucune requête ne soit reçue. Par défaut, cette fonction récupère le statut de tous les processus enfants ayant terminé pour les serveurs utilisant des processus ou ne fait rien pour le cas des serveurs utilisant des fils d’exécution.

source: Calls :meth:`finish_request` to create an instance of the :attr:`RequestHandlerClass`. If desired, this function can create a new process or thread to handle the request; the :class:`ForkingMixIn` and :class:`ThreadingMixIn` classes do this.
fr: Appelle :meth:`finish_request` pour instancier :attr:`RequestHandlerClass`. Si désiré, cette fonction peut créer des processus fils ou des fils d’exécution pour traiter les requêtes ; les classes de mélange :class:`ForkingMixIn` et :class:`ThreadingMixIn` implémentent cela.

source: Called by the server's constructor to activate the server. The default behavior for a TCP server just invokes :meth:`~socket.socket.listen` on the server's socket. May be overridden.
fr: Appelée par le constructeur du serveur afin de l'activer. Le comportement par défaut pour un serveur TCP est de seulement invoquer :meth:`~socket.socket.listen` sur le connecteur du serveur. Peut être surchargée.

source: Called by the server's constructor to bind the socket to the desired address. May be overridden.
fr: Appelée par le constructeur du serveur afin d'assigner (*bind*) l'adresse requise au connecteur du serveur. Peut être surchargée.

source: Must return a Boolean value; if the value is :const:`True`, the request will be processed, and if it's :const:`False`, the request will be denied. This function can be overridden to implement access controls for a server. The default implementation always returns :const:`True`.
fr: Doit renvoyer un booléen. Si la valeur est :const:`True`, la requête sera traitée. Si la valeur est :const:`False`, la requête sera refusée. Cette fonction peut être surchargée afin d'implémenter une stratégie de contrôle d'accès au serveur. L'implémentation par défaut renvoie toujours :const:`True`.

source: Support for the :term:`context manager` protocol was added. Exiting the context manager is equivalent to calling :meth:`server_close`.
fr: La gestion du protocole :term:`context manager` a été ajoutée. Sortir du gestionnaire de contexte revient à appeler :meth:`server_close`.

source: Request Handler Objects
fr: Objets gestionnaire de requêtes

source: This is the superclass of all request handler objects. It defines the interface, given below. A concrete request handler subclass must define a new :meth:`handle` method, and can override any of the other methods. A new instance of the subclass is created for each request.
fr: Classe de base de tous les objets gestionnaire de requêtes. Elle déclare l'interface, définie ci-dessous, pour tous les gestionnaires. Une implémentation concrète doit définir une nouvelle méthode :meth:`handle` et peut surcharger n'importe quelle autre méthode. Cette classe concrète est instanciée pour chaque requête.

source: Called before the :meth:`handle` method to perform any initialization actions required. The default implementation does nothing.
fr: Appelée avant la méthode :meth:`handle` afin d'effectuer toutes les opérations d'initialisation requises. L'implémentation par défaut ne fait rien.

source: This function must do all the work required to service a request. The default implementation does nothing. Several instance attributes are available to it; the request is available as :attr:`self.request`; the client address as :attr:`self.client_address`; and the server instance as :attr:`self.server`, in case it needs access to per-server information.
fr: Cette fonction doit faire tout le nécessaire pour traiter une requête. L'implémentation par défaut ne fait rien. La fonction peut accéder à plusieurs attributs d'instance : la requête elle-même se trouve dans :attr:`self.request`, l'adresse du client dans :attr:`self.client_address` et l'instance du serveur dans :attr:`self.server` (dans le cas où il aurait besoin d'accéder aux informations du serveur).

source: The type of :attr:`self.request` is different for datagram or stream services. For stream services, :attr:`self.request` is a socket object; for datagram services, :attr:`self.request` is a pair of string and socket.
fr: Le type de :attr:`self.request` est différent pour les services utilisant des datagrammes ou des flux de données. Pour les services à flux de données, :attr:`self.request` renvoie l'objet connecteur ; pour les services à datagrammes, :attr:`self.request` est une paire constituée d'une chaîne de caractères et du connecteur.

source: Called after the :meth:`handle` method to perform any clean-up actions required. The default implementation does nothing. If :meth:`setup` raises an exception, this function will not be called.
fr: Appelée après la méthode :meth:`handle` pour effectuer les opérations de nettoyage requises. L'implémentation par défaut ne fait rien. Si :meth:`setup` lève une exception, cette méthode n'est pas appelée.

source: These :class:`BaseRequestHandler` subclasses override the :meth:`~BaseRequestHandler.setup` and :meth:`~BaseRequestHandler.finish` methods, and provide :attr:`self.rfile` and :attr:`self.wfile` attributes. The :attr:`self.rfile` and :attr:`self.wfile` attributes can be read or written, respectively, to get the request data or return data to the client.
fr: Ces classes, héritant de :class:`BaseRequestHandler`, redéfinissent les méthodes :meth:`~BaseRequestHandler.setup` et :meth:`~BaseRequestHandler.finish` et fournissent les attributs :attr:`self.rfile` et :attr:`self.wfile`. Les deux attributs :attr:`self.rfile` et :attr:`self.wfile` peuvent être respectivement lus ou écrits, afin de récupérer les données de la requête ou d'envoyer des données au client.

source: The :attr:`rfile` attributes of both classes support the :class:`io.BufferedIOBase` readable interface, and :attr:`DatagramRequestHandler.wfile` supports the :class:`io.BufferedIOBase` writable interface.
fr: L'attribut :attr:`rfile` des deux classes prend en charge l'interface de lecture de :class:`io.BufferedIOBase`. L'attribut :attr:`DatagramRequestHandler.wfile` sait gérer l'interface d'écriture de :class:`io.BufferedIOBase`.

source: :attr:`StreamRequestHandler.wfile` also supports the :class:`io.BufferedIOBase` writable interface.
fr: :attr:`StreamRequestHandler.wfile` prend également en charge l'interface d'écriture de :class:`io.BufferedIOBase`.

source: Examples
fr: Exemples

source: :class:`socketserver.TCPServer` Example
fr: Exemple pour :class:`socketserver.TCPServer`

source: This is the server side::
fr: Implémentation côté serveur ::

source: An alternative request handler class that makes use of streams (file-like objects that simplify communication by providing the standard file interface)::
fr: Une implémentation alternative du gestionnaire de requêtes utilisant les flux de données (avec des objets fichier-compatibles simplifiant la communication en fournissant l'interface fichier standard) ::

source: The difference is that the ``readline()`` call in the second handler will call ``recv()`` multiple times until it encounters a newline character, while the single ``recv()`` call in the first handler will just return what has been sent from the client in one ``sendall()`` call.
fr: La différence est que l'appel à ``readline()`` dans le second gestionnaire permet d'appeler ``recv()`` jusqu'à rencontrer un caractère de fin de ligne alors que dans le premier gestionnaire appelle directement ``recv()``, renvoyant toutes les données envoyées par le client en un seul appel à ``sendall()``.

source: This is the client side::
fr: Implémentation côté client ::

source: The output of the example should look something like this:
fr: La sortie de cet exemple devrait ressembler à ça :

source: Server:
fr: Serveur :

source: :class:`socketserver.UDPServer` Example
fr: Exemple pour :class:`socketserver.UDPServer`

source: The output of the example should look exactly like for the TCP server example.
fr: La sortie de cet exemple devrait ressembler exactement à la sortie de l'exemple pour le serveur TCP.

source: Asynchronous Mixins
fr: Classes de mélange asynchrone

source: To build asynchronous handlers, use the :class:`ThreadingMixIn` and :class:`ForkingMixIn` classes.
fr: Pour développer des gestionnaires asynchrones, utilisez les classes :class:`ThreadingMixIn` et :class:`ForkingMixIn`.

source: An example for the :class:`ThreadingMixIn` class::
fr: Exemple pour :class:`ThreadingMixIn` ::

source: The :class:`ForkingMixIn` class is used in the same way, except that the server will spawn a new process for each request. Available only on POSIX platforms that support :func:`~os.fork`.
fr: La classe :class:`ForkingMixIn` est utilisable de la même façon à la différence près que le serveur crée un nouveau processus fils pour chaque requête. Disponible uniquement sur les plateformes POSIX prenant en charge :func:`~os.fork`.
