Repository: python/python-docs-fr
Catalog: library/socketserver.po
Languages: fr

source: :mod:`socketserver` --- A framework for network servers
fr: :mod:`socketserver` — Cadriciel pour serveurs réseaux

source: **Source code:** :source:`Lib/socketserver.py`
fr: **Code source :** :source:`Lib/socketserver.py`

source: The :mod:`socketserver` module simplifies the task of writing network servers.
fr: Le module :mod:`socketserver` permet de simplifier le développement de serveurs réseaux.

source: There are four basic concrete server classes:
fr: Il existe quatre classes concrètes fondamentales :

source: This uses the internet TCP protocol, which provides for continuous streams of data between the client and server. If *bind_and_activate* is true, the constructor automatically attempts to invoke :meth:`~BaseServer.server_bind` and :meth:`~BaseServer.server_activate`. The other parameters are passed to the :class:`BaseServer` base class.
fr: Cette classe permet de créer des flux continus de données entre un client et un serveur en utilisant le protocole internet TCP. Si *bind_and_activate* est vrai, le constructeur tente automatiquement d'invoquer :meth:`~BaseServer.server_bind` et :meth:`~BaseServer.server_activate`. Les autres paramètres sont passés à la classe de base :class:`BaseServer`.

source: This uses datagrams, which are discrete packets of information that may arrive out of order or be lost while in transit. The parameters are the same as for :class:`TCPServer`.
fr: Cette classe utilise des datagrammes, qui sont des paquets d'information pouvant arriver dans le désordre, voire être perdus, durant le transport. Les paramètres sont identiques à :class:`TCPServer`.

source: These more infrequently used classes are similar to the TCP and UDP classes, but use Unix domain sockets; they're not available on non-Unix platforms. The parameters are the same as for :class:`TCPServer`.
fr: Ces classes, moins fréquemment utilisées, sont similaires aux classes pour TCP et UDP mais utilisent des connecteurs UNIX ; ces connecteurs ne sont disponibles que sur les plateformes UNIX. Les paramètres sont identiques à :class:`TCPServer`.

source: These four classes process requests :dfn:`synchronously`; each request must be completed before the next request can be started. This isn't suitable if each request takes a long time to complete, because it requires a lot of computation, or because it returns a lot of data which the client is slow to process. The solution is to create a separate process or thread to handle each request; the :class:`ForkingMixIn` and :class:`ThreadingMixIn` mix-in classes can be used to support asynchronous behaviour.
fr: Ces quatre classes traitent les requêtes de façon :dfn:`synchrone` : chaque requête doit être terminée avant de pouvoir traiter la suivante. Cette méthode n'est pas adaptée si les requêtes prennent beaucoup de temps à être traitées. Cela peut arriver si les requêtes demandent beaucoup de calcul, ou si elles renvoient beaucoup de données que le client peine à traiter. Dans ce cas, la solution est de créer un processus ou un fil d’exécution séparé pour chaque requête ; les classes de mélange :class:`ForkingMixIn` et :class:`ThreadingMixIn` peuvent être utilisées pour réaliser ce comportement asynchrone.

source: Creating a server requires several steps. First, you must create a request handler class by subclassing the :class:`BaseRequestHandler` class and overriding its :meth:`~BaseRequestHandler.handle` method; this method will process incoming requests. Second, you must instantiate one of the server classes, passing it the server's address and the request handler class. It is recommended to use the server in a :keyword:`with` statement. Then call the :meth:`~BaseServer.handle_request` or :meth:`~BaseServer.serve_forever` method of the server object to process one or many requests. Finally, call :meth:`~BaseServer.server_close` to close the socket (unless you used a :keyword:`!with` statement).
fr: La création d'un serveur requiert plusieurs étapes. Premièrement, vous devez créer une classe pour gérer les requêtes en héritant de :class:`BaseRequestHandler` et surcharger sa méthode :meth:`~BaseRequestHandler.handle`, laquelle traitera les requêtes entrantes. Deuxièmement, vous devez instancier l'une des classes serveurs et lui passer l’adresse du serveur ainsi que la classe gérant les requêtes. Il est recommandé de faire ceci dans une instruction :keyword:`with`. Ensuite, appelez la méthode :meth:`~BaseServer.handle_request` ou :meth:`~BaseServer.serve_forever` de l'objet serveur afin de traiter une ou plusieurs requêtes. Enfin, appelez la méthode :meth:`~BaseServer.server_close` pour fermer le connecteur (à moins que vous n'ayez utilisé une instruction :keyword:`!with`).

source: When inheriting from :class:`ThreadingMixIn` for threaded connection behavior, you should explicitly declare how you want your threads to behave on an abrupt shutdown. The :class:`ThreadingMixIn` class defines an attribute *daemon_threads*, which indicates whether or not the server should wait for thread termination. You should set the flag explicitly if you would like threads to behave autonomously; the default is :const:`False`, meaning that Python will not exit until all threads created by :class:`ThreadingMixIn` have exited.
fr: Lorsque vous héritez de :class:`ThreadingMixIn` pour déléguer les connexions à différent fils d’exécution, vous devez déclarer explicitement comment les fils d’exécution doivent se comporter en cas d'arrêt abrupt. La classe :class:`ThreadingMixIn` définit un attribut *daemon_threads*, indiquant si le serveur doit attendre la fin des fils d’exécution ou non. Vous pouvez utiliser cet attribut si vous souhaitez que les fils d’exécution soient autonomes. La valeur par défaut est :const:`False`, indiquant que Python ne doit pas quitter avant que tous les fils d'exécution créés par :class:`ThreadingMixIn` ne soient terminés.

source: Server classes have the same external methods and attributes, no matter what network protocol they use.
fr: Toutes les classes de serveurs exposent les mêmes méthodes et attributs, peu importe le protocole réseau utilisé.

source: Server Creation Notes
fr: Notes sur la création de serveurs

source: There are five classes in an inheritance diagram, four of which represent synchronous servers of four types::
fr: Il y a cinq classes dans la hiérarchie. Quatre d'entre elles représentent des serveurs synchrones de quatre types différents ::

source: Note that :class:`UnixDatagramServer` derives from :class:`UDPServer`, not from :class:`UnixStreamServer` --- the only difference between an IP and a Unix stream server is the address family, which is simply repeated in both Unix server classes.
fr: Notez que la classe :class:`UnixDatagramServer` hérite de :class:`UDPServer` et pas de :class:`UnixStreamServer` — la seule différente entre un serveur à flux de données IP et Unix est la famille d’adresse, qui est simplement répétée dans les deux classes serveur Unix.

source: Forking and threading versions of each type of server can be created using these mix-in classes. For instance, :class:`ThreadingUDPServer` is created as follows::
fr: Des versions utilisant des fils d’exécution ou des processus peuvent être créées pour chaque type de serveur, en utilisant ces classes de mélange. Par exemple, :class:`ThreadingUDPServer` est créé comme suit ::

source: The mix-in class comes first, since it overrides a method defined in :class:`UDPServer`. Setting the various attributes also changes the behavior of the underlying server mechanism.
fr: La classe de mélange est en premier car elle surcharge une méthode définie dans :class:`UDPServer`. Configurer les différents attributs changera également le comportement du serveur.

source: :class:`ForkingMixIn` and the Forking classes mentioned below are only available on POSIX platforms that support :func:`~os.fork`.
fr: La classe :class:`ForkingMixIn` et les classes créant des processus mentionnées ci-dessous sont uniquement disponibles sur les plateformes POSIX prenant en charge :func:`~os.fork`.

source: :meth:`socketserver.ForkingMixIn.server_close` waits until all child processes complete, except if :attr:`socketserver.ForkingMixIn.block_on_close` attribute is false.
fr: La méthode :meth:`socketserver.ForkingMixIn.server_close` attend jusqu'à ce que tous les processus enfants soient terminés, sauf si l'attribut :attr:`socketserver.ForkingMixIn.block_on_close` est faux.

source: :meth:`socketserver.ThreadingMixIn.server_close` waits until all non-daemon threads complete, except if :attr:`socketserver.ThreadingMixIn.block_on_close` attribute is false. Use daemonic threads by setting :data:`ThreadingMixIn.daemon_threads` to ``True`` to not wait until threads complete.
fr: La méthode :meth:`socketserver.ThreadingMixIn.server_close` attend que tous les fils d'exécution non-*daemon* soit terminés, sauf si l'attribut :attr:`socketserver.ThreadingMixIn.block_on_close` est faux. Utilisez des fils d'exécution *daemon* en réglant :data:`ThreadingMixIn.daemon_threads` à ``True`` afin de ne pas attendre que les fils d’exécution soit terminés.

source: :meth:`socketserver.ForkingMixIn.server_close` and :meth:`socketserver.ThreadingMixIn.server_close` now waits until all child processes and non-daemonic threads complete. Add a new :attr:`socketserver.ForkingMixIn.block_on_close` class attribute to opt-in for the pre-3.7 behaviour.
fr: Désormais, :meth:`socketserver.ForkingMixIn.server_close` et :meth:`socketserver.ThreadingMixIn.server_close` attendent que tous les processus enfants et les fils d’exécution non-*daemon* soit terminés. Ajout de :attr:`socketserver.ForkingMixIn.block_on_close`, un nouvel attribut de classe permettant de conserver le comportement pré-3.7.

source: These classes are pre-defined using the mix-in classes.
fr: Ces classes sont prédéfinies en utilisant les classes de mélange.

source: To implement a service, you must derive a class from :class:`BaseRequestHandler` and redefine its :meth:`~BaseRequestHandler.handle` method. You can then run various versions of the service by combining one of the server classes with your request handler class. The request handler class must be different for datagram or stream services. This can be hidden by using the handler subclasses :class:`StreamRequestHandler` or :class:`DatagramRequestHandler`.
fr: Pour implémenter un service, vous devez créer une classe héritant de :class:`BaseRequestHandler` et redéfinir sa méthode :meth:`~BaseRequestHandler.handle`. Ensuite, vous pourrez créer différentes versions de votre service en combinant les classes serveurs avec votre classe de gestion des requêtes. Cette classe de gestion des requêtes doit être différente pour les services utilisant des datagrammes ou des flux de données. Cette contrainte peut être dissimulée en utilisant les classes de gestion dérivées :class:`StreamRequestHandler` ou :class:`DatagramRequestHandler`.

source: Of course, you still have to use your head! For instance, it makes no sense to use a forking server if the service contains state in memory that can be modified by different requests, since the modifications in the child process would never reach the initial state kept in the parent process and passed to each child. In this case, you can use a threading server, but you will probably have to use locks to protect the integrity of the shared data.
fr: Bien entendu, vous devrez toujours utiliser votre tête ! Par exemple, utiliser un serveur utilisant des processus clonés (*forking*) n'aurait aucun sens si le serveur garde en mémoire des états pouvant être modifiés par les requêtes reçues. En effet, un processus enfant traitant une requête n'aurait alors aucun moyen de propager le nouvel état à son parent. Dans ce cas, vous devez utiliser un serveur utilisant des fils d'exécution, mais cela demande probablement d'utiliser des verrous pour protéger l’intégrité des données partagées.

source: On the other hand, if you are building an HTTP server where all data is stored externally (for instance, in the file system), a synchronous class will essentially render the service "deaf" while one request is being handled -- which may be for a very long time if a client is slow to receive all the data it has requested. Here a threading or forking server is appropriate.
fr: D'un autre côté, si vous développez un serveur HTTP qui a toutes ses données stockées hors de la mémoire (sur un système de fichiers par exemple), une classe synchrone rendrait le service sourd à toute nouvelle requête aussi longtemps qu'une précédente soit en cours de traitement. Cette situation pourrait perdurer pendant un long moment si le client prend du temps à recevoir toutes les données demandées. Dans ce cas, un serveur utilisant des processus ou des fils d'exécutions est approprié.

source: In some cases, it may be appropriate to process part of a request synchronously, but to finish processing in a forked child depending on the request data. This can be implemented by using a synchronous server and doing an explicit fork in the request handler class :meth:`~BaseRequestHandler.handle` method.
fr: Dans certains cas, il peut être judicieux de commencer à traiter une requête de façon synchrone mais de pouvoir déléguer le reste du traitement à un processus enfant si besoin. Ce comportement peut être implémenté en utilisant un serveur synchrone et en laissant à la méthode :meth:`~BaseRequestHandler.handle`, de la classe gérant les requêtes, le soin de créer le processus enfant explicitement.

source: Another approach to handling multiple simultaneous requests in an environment that supports neither threads nor :func:`~os.fork` (or where these are too expensive or inappropriate for the service) is to maintain an explicit table of partially finished requests and to use :mod:`selectors` to decide which request to work on next (or whether to handle a new incoming request). This is particularly important for stream services where each client can potentially be connected for a long time (if threads or subprocesses cannot be used). See :mod:`asyncore` for another way to manage this.
fr: Une autre méthode pour gérer plusieurs requêtes simultanément dans un environnement ne prenant en charge ni les fils d’exécution ni :func:`~os.fork` (ou si cela est trop coûteux ou inapproprié compte tenu de la nature du service) est de maintenir une table des requêtes en cours de traitement et d’utiliser :mod:`selectors` pour décider sur quelle requête travailler (et quand accepter une nouvelle requête). Cela est particulièrement important pour les services utilisant des flux de données où chaque client peut rester connecté pour longtemps. Pour une autre façon de gérer cela, voir :mod:`asyncore`.

source: Server Objects
fr: Objets serveur

source: This is the superclass of all Server objects in the module. It defines the interface, given below, but does not implement most of the methods, which is done in subclasses. The two parameters are stored in the respective :attr:`server_address` and :attr:`RequestHandlerClass` attributes.
fr: Il s'agit de la classe parente de tous les objets serveur du module. Elle déclare l'interface, définie ci-dessous, mais laisse aux classes filles le soin d'implémenter la plupart des méthodes. Les deux paramètres sont stockés respectivement dans les attributs :attr:`server_address` et :attr:`RequestHandlerClass`.

source: Return an integer file descriptor for the socket on which the server is listening. This function is most commonly passed to :mod:`selectors`, to allow monitoring multiple servers in the same process.
fr: Renvoie un entier représentant le descripteur de fichier pour le connecteur que le serveur écoute. Cette fonction est, la plupart du temps, passée à :mod:`selectors` afin de pouvoir surveiller plusieurs serveurs dans le même processus.

source: Process a single request. This function calls the following methods in order: :meth:`get_request`, :meth:`verify_request`, and :meth:`process_request`. If the user-provided :meth:`~BaseRequestHandler.handle` method of the handler class raises an exception, the server's :meth:`handle_error` method will be called. If no request is received within :attr:`timeout` seconds, :meth:`handle_timeout` will be called and :meth:`handle_request` will return.
fr: Traite une seule requête. Cette fonction appelle, dans l'ordre, les méthodes :meth:`get_request`, :meth:`verify_request` et :meth:`process_request`. Si la méthode :meth:`~BaseRequestHandler.handle` de la classe de gestion des requêtes lève une exception, alors la méthode :meth:`handle_error` du serveur est appelée. Si aucune requête n'est reçue avant « :attr:`timeout` » secondes, :meth:`handle_timeout` est appelée et :meth:`handle_request` rend la main.

source: Handle requests until an explicit :meth:`shutdown` request. Poll for shutdown every *poll_interval* seconds. Ignores the :attr:`timeout` attribute. It also calls :meth:`service_actions`, which may be used by a subclass or mixin to provide actions specific to a given service. For example, the :class:`ForkingMixIn` class uses :meth:`service_actions` to clean up zombie child processes.
fr: Gère les requêtes indéfiniment jusqu'à ce que :meth:`shutdown` soit appelée. Vérifie si une demande d’arrêt (*shutdown*) a été émise toutes les *poll_interval* secondes. Ignore l'attribut :attr:`timeout`. Appelle également :meth:`service_actions`, qui peut être utilisée par une classe enfant ou une classe de mélange afin d'implémenter une action spécifique pour un service donné. Par exemple, la classe :class:`ForkingMixIn` utilise :meth:`service_actions` pour supprimer les processus enfants zombies.

source: Added ``service_actions`` call to the ``serve_forever`` method.
fr: La méthode ``serve_forever`` appelle dorénavant ``service_actions``.

source: This is called in the :meth:`serve_forever` loop. This method can be overridden by subclasses or mixin classes to perform actions specific to a given service, such as cleanup actions.
fr: Cette méthode est appelée dans la boucle de :meth:`serve_forever`. Cette méthode peut être surchargée par une classe fille ou une classe de mélange afin d'effectuer une action spécifique à un service donné, comme une action de nettoyage.

source: Tell the :meth:`serve_forever` loop to stop and wait until it does. :meth:`shutdown` must be called while :meth:`serve_forever` is running in a different thread otherwise it will deadlock.
fr: Demande l'arrêt de la boucle de :meth:`serve_forever` et attend jusqu'à ce que ce soit fait. :meth:`shutdown` doit être appelée dans un fil d’exécution différent de :meth:`serve_forever` sous peine d'interblocage.

source: Clean up the server. May be overridden.
fr: Nettoie le serveur. Peut être surchargée.

source: The family of protocols to which the server's socket belongs. Common examples are :const:`socket.AF_INET` and :const:`socket.AF_UNIX`.
fr: La famille de protocoles auquel le connecteur appartient. Les exemples les plus communs sont :const:`socket.AF_INET` et :const:`socket.AF_UNIX`.

source: The user-provided request handler class; an instance of this class is created for each request.
fr: La classe de gestion des requêtes, fournie par l'utilisateur. Une instance de cette classe est créée pour chaque requête.

source: The address on which the server is listening. The format of addresses varies depending on the protocol family; see the documentation for the :mod:`socket` module for details. For internet protocols, this is a tuple containing a string giving the address, and an integer port number: ``('127.0.0.1', 80)``, for example.
fr: Renvoie l’adresse sur laquelle le serveur écoute. Le format de l’adresse dépend de la famille de protocoles utilisée ; pour plus de détails, voir la documentation du module :mod:`socket`. Pour les protocoles Internet, cette valeur est une paire formée d'une chaine de caractère pour l’adresse et d'un entier pour le port. Exemple : ``('127.0.0.1', 80)``.

source: The socket object on which the server will listen for incoming requests.
fr: L'objet connecteur utilisé par le serveur pour écouter les nouvelles requêtes.

source: The server classes support the following class variables:
fr: Les classes serveurs prennent en charge les variables de classe suivantes :

source: Whether the server will allow the reuse of an address. This defaults to :const:`False`, and can be set in subclasses to change the policy.
fr: Indique si le serveur autorise la réutilisation d'une adresse. La valeur par défaut est :const:`False` mais cela peut être changé dans les classes enfants.

source: The size of the request queue. If it takes a long time to process a single request, any requests that arrive while the server is busy are placed into a queue, up to :attr:`request_queue_size` requests. Once the queue is full, further requests from clients will get a "Connection denied" error. The default value is usually 5, but this can be overridden by subclasses.
fr: La taille de la file des requêtes. Lorsque traiter une requête prend du temps, toute nouvelle requête arrivant pendant que le serveur est occupé est placé dans une file jusqu'à atteindre « :attr:`request_queue_size` » requêtes. Si la queue est pleine, les nouvelles requêtes clientes se voient renvoyer une erreur *Connection denied*. La valeur par défaut est habituellement 5 mais peut être changée par les classes filles.

source: The type of socket used by the server; :const:`socket.SOCK_STREAM` and :const:`socket.SOCK_DGRAM` are two common values.
fr: Le type de connecteur utilisé par le serveur ; :const:`socket.SOCK_STREAM` et :const:`socket.SOCK_DGRAM` sont deux valeurs usuelles.

source: Timeout duration, measured in seconds, or :const:`None` if no timeout is desired. If :meth:`handle_request` receives no incoming requests within the timeout period, the :meth:`handle_timeout` method is called.
fr: Délai d'attente en secondes, ou :const:`None` si aucune limite n'est demandée. Si :meth:`handle_request` ne reçoit aucune requête entrante pendant le délai d'attente, la méthode :meth:`handle_timeout` est appelée.

source: There are various server methods that can be overridden by subclasses of base server classes like :class:`TCPServer`; these methods aren't useful to external users of the server object.
fr: Il existe plusieurs méthodes serveur pouvant être surchargées par des classes dérivant de classes de base comme :class:`TCPServer` ; ces méthodes ne sont pas utiles aux utilisateurs externes de l'objet serveur.

source: Actually processes the request by instantiating :attr:`RequestHandlerClass` and calling its :meth:`~BaseRequestHandler.handle` method.
fr: Méthode en charge de traiter la requête en instanciant :attr:`RequestHandlerClass` et en appelant sa méthode :meth:`~BaseRequestHandler.handle`.

source: Must accept a request from the socket, and return a 2-tuple containing the *new* socket object to be used to communicate with the client, and the client's address.
fr: Accepte obligatoirement une requête depuis le connecteur et renvoie une paire contenant le *nouvel* objet connecteur utilisé pour communiquer avec le client et l'adresse du client.

source: This function is called if the :meth:`~BaseRequestHandler.handle` method of a :attr:`RequestHandlerClass` instance raises an exception. The default action is to print the traceback to standard error and continue handling further requests.
fr: Cette fonction est appelée si la méthode :meth:`~BaseRequestHandler.handle` de l'objet :attr:`RequestHandlerClass` lève une exception. Par défaut, la méthode imprime la trace d'appels sur la sortie d'erreur standard et continue de traiter les requêtes suivantes.

source: Now only called for exceptions derived from the :exc:`Exception` class.
fr: N'est maintenant appelée que sur les exceptions dérivant de la classe :exc:`Exception`.
