Repository: python/python-docs-fr
Catalog: library/statistics.po
Languages: fr

source: :mod:`statistics` --- Mathematical statistics functions
fr: :mod:`statistics` — Fonctions mathématiques pour les statistiques

source: **Source code:** :source:`Lib/statistics.py`
fr: **Code source :** :source:`Lib/statistics.py`

source: This module provides functions for calculating mathematical statistics of numeric (:class:`~numbers.Real`-valued) data.
fr: Ce module fournit des fonctions pour le calcul de valeurs statistiques sur des données numériques (valeurs réelles de la classe :class:`~numbers.Real`).

source: The module is not intended to be a competitor to third-party libraries such as `NumPy <https://numpy.org>`_, `SciPy <https://www.scipy.org/>`_, or proprietary full-featured statistics packages aimed at professional statisticians such as Minitab, SAS and Matlab. It is aimed at the level of graphing and scientific calculators.
fr: Ce module n'est pas pensé comme substitut à des bibliothèques tierces telles que `NumPy <https://numpy.org>`_, `SciPy <https://www.scipy.org/>`_ ou des suites logicielles propriétaires complètes à destination des statisticiens professionnels comme Minitab, SAS ou Matlab. Ce module se situe au niveau des calculatrices scientifiques graphiques.

source: Unless explicitly noted, these functions support :class:`int`, :class:`float`, :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Behaviour with other types (whether in the numeric tower or not) is currently unsupported. Collections with a mix of types are also undefined and implementation-dependent. If your input data consists of mixed types, you may be able to use :func:`map` to ensure a consistent result, for example: ``map(float, input_data)``.
fr: À moins que cela ne soit précisé différemment, ces fonctions gèrent les objets :class:`int`, :class:`float`, :class:`~decimal.Decimal` et :class:`~fractions.Fraction`. Leur bon comportement avec d'autres types (numériques ou non) n'est pas garanti. Le comportement de ces fonctions sur des collections mixtes de différents types est indéfini et dépend de l'implémentation. Si vos données comportement un mélange de plusieurs types, vous pouvez utiliser :func:`map` pour vous assurer que le résultat est cohérent, par exemple : ``map(float, input_data)``.

source: Averages and measures of central location
fr: Moyennes et mesures de la tendance centrale

source: These functions calculate an average or typical value from a population or sample.
fr: Ces fonctions calculent une moyenne ou une valeur typique à partir d'une population ou d'un échantillon.

source: Arithmetic mean ("average") of data.
fr: Moyenne arithmétique des données.

source: Fast, floating point arithmetic mean.
fr: Moyenne arithmétique rapide en calcul à virgule flottante.

source: Geometric mean of data.
fr: Moyenne géométrique des données.

source: Harmonic mean of data.
fr: Moyenne harmonique des données.

source: Median (middle value) of data.
fr: Médiane (valeur centrale) des données.

source: Low median of data.
fr: Médiane basse des données.

source: High median of data.
fr: Médiane haute des données.

source: Median, or 50th percentile, of grouped data.
fr: Médiane de données groupées, calculée comme le 50\ :sup:`e` percentile.

source: Single mode (most common value) of discrete or nominal data.
fr: Mode principal (la valeur la plus représentée) de données discrètes ou nominales.

source: Divide data into intervals with equal probability.
fr: Divise les données en intervalles de même probabilité.

source: Measures of spread
fr: Mesures de la dispersion

source: These functions calculate a measure of how much the population or sample tends to deviate from the typical or average values.
fr: Ces fonctions mesurent la tendance de la population ou d'un échantillon à dévier des valeurs typiques ou des valeurs moyennes.

source: Population standard deviation of data.
fr: Écart-type de la population.

source: Population variance of data.
fr: Variance de la population.

source: Sample standard deviation of data.
fr: Écart-type d'un échantillon.

source: Sample variance of data.
fr: Variance d'un échantillon.

source: Function details
fr: Détails des fonctions

source: Note: The functions do not require the data given to them to be sorted. However, for reading convenience, most of the examples show sorted sequences.
fr: Note : les fonctions ne requièrent pas que les données soient ordonnées. Toutefois, pour en faciliter la lecture, les exemples utiliseront des séquences croissantes.

source: Return the sample arithmetic mean of *data* which can be a sequence or iterable.
fr: Renvoie la moyenne arithmétique de l'échantillon *data* qui peut être une séquence ou un itérable.

source: The arithmetic mean is the sum of the data divided by the number of data points. It is commonly called "the average", although it is only one of many different mathematical averages. It is a measure of the central location of the data.
fr: La moyenne arithmétique est la somme des valeurs divisée par le nombre d'observations. Il s'agit de la valeur couramment désignée comme la « moyenne » bien qu'il existe de multiples façons de définir mathématiquement la moyenne. C'est une mesure de la tendance centrale des données.

source: If *data* is empty, :exc:`StatisticsError` will be raised.
fr: Une erreur :exc:`StatisticsError` est levée si *data* est vide.

source: Some examples of use:
fr: Exemples d'utilisation :

source: The sample mean gives an unbiased estimate of the true population mean, so that when taken on average over all the possible samples, ``mean(sample)`` converges on the true mean of the entire population. If *data* represents the entire population rather than a sample, then ``mean(data)`` is equivalent to calculating the true population mean μ.
fr: La moyenne de l'échantillon est une estimation non biaisée de la moyenne de la véritable population. Ainsi, en calculant la moyenne sur tous les échantillons possibles, ``mean(sample)`` converge vers la moyenne réelle de la population entière. Si *data* est une population entière plutôt qu'un échantillon, alors ``mean(data)`` équivaut à calculer la véritable moyenne μ.

source: Convert *data* to floats and compute the arithmetic mean.
fr: Convertit *data* en nombres à virgule flottante et calcule la moyenne arithmétique.

source: This runs faster than the :func:`mean` function and it always returns a :class:`float`. The *data* may be a sequence or iterable. If the input dataset is empty, raises a :exc:`StatisticsError`.
fr: Cette fonction est plus rapide que :func:`mean` et renvoie toujours un :class:`float`. *data* peut être une séquence ou un itérable. Si les données d'entrée sont vides, la fonction lève une erreur :exc:`StatisticsError`.

source: Convert *data* to floats and compute the geometric mean.
fr: Convertit *data* en nombres à virgule flottante et calcule la moyenne géométrique.

source: The geometric mean indicates the central tendency or typical value of the *data* using the product of the values (as opposed to the arithmetic mean which uses their sum).
fr: La moyenne géométrique mesure la tendance centrale ou la valeur typique de *data* en utilisant le produit des valeurs (par opposition à la moyenne arithmétique qui utilise la somme).

source: Raises a :exc:`StatisticsError` if the input dataset is empty, if it contains a zero, or if it contains a negative value. The *data* may be a sequence or iterable.
fr: Lève une erreur :exc:`StatisticsError` si les données sont vides, si elles contiennent un zéro ou une valeur négative. *data* peut être une séquence ou un itérable.

source: No special efforts are made to achieve exact results. (However, this may change in the future.)
fr: Aucune mesure particulière n'est prise pour garantir que le résultat est parfaitement exact (cela peut toutefois changer dans une version future).

source: Suppose a car travels 10 km at 40 km/hr, then another 10 km at 60 km/hr. What is the average speed?
fr: Supposons qu'une voiture parcoure 10 km à 40 km/h puis 10 km à 60 km/h. Quelle a été sa vitesse moyenne ?

source: The current algorithm has an early-out when it encounters a zero in the input. This means that the subsequent inputs are not tested for validity. (This behavior may change in the future.)
fr: L'algorithme actuellement implémenté s'arrête prématurément lors de la rencontre d'un zéro dans le parcours de l'entrée. Cela signifie que la validité des valeurs suivantes n'est pas testée (ce comportement est susceptible de changer dans une version future).

source: Return the median (middle value) of numeric data, using the common "mean of middle two" method. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
fr: Renvoie la médiane (la valeur centrale) de données numériques en utilisant la méthode classique « moyenne des deux du milieu ». Lève une erreur :exc:`StatisticsError` si *data* est vide. *data* peut être une séquence ou un itérable.

source: The median is a robust measure of central location and is less affected by the presence of outliers. When the number of data points is odd, the middle data point is returned:
fr: La médiane est une mesure robuste de la tendance centrale et est moins sensible à la présence de valeurs aberrantes que la moyenne. Lorsque le nombre d'observations est impair, la valeur du milieu est renvoyée :

source: When the number of data points is even, the median is interpolated by taking the average of the two middle values:
fr: Lorsque le nombre d'observations est pair, la médiane est interpolée en calculant la moyenne des deux valeurs du milieu :

source: This is suited for when your data is discrete, and you don't mind that the median may not be an actual data point.
fr: Cette approche est adaptée à des données discrètes à condition que vous acceptiez que la médiane ne fasse pas nécessairement partie des observations.

source: If the data is ordinal (supports order operations) but not numeric (doesn't support addition), consider using :func:`median_low` or :func:`median_high` instead.
fr: Si les données sont ordinales (elles peuvent être ordonnées) mais pas numériques (elles ne peuvent être additionnées), utilisez :func:`median_low` ou :func:`median_high` à la place.

source: Return the low median of numeric data. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
fr: Renvoie la médiane basse de données numériques. Lève une erreur :exc:`StatisticsError` si *data* est vide. *data* peut être une séquence ou un itérable.

source: The low median is always a member of the data set. When the number of data points is odd, the middle value is returned. When it is even, the smaller of the two middle values is returned.
fr: La médiane basse est toujours une valeur représentée dans les données. Lorsque le nombre d'observations est impair, la valeur du milieu est renvoyée. Sinon, la plus petite des deux valeurs du milieu est renvoyée.

source: Use the low median when your data are discrete and you prefer the median to be an actual data point rather than interpolated.
fr: Utilisez la médiane basse lorsque vos données sont discrètes et que vous préférez que la médiane soit une valeur représentée dans vos observations plutôt que le résultat d'une interpolation.

source: Return the high median of data. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
fr: Renvoie la médiane haute des données. Lève une erreur :exc:`StatisticsError` si *data* est vide. *data* peut être une séquence ou un itérable.

source: The high median is always a member of the data set. When the number of data points is odd, the middle value is returned. When it is even, the larger of the two middle values is returned.
fr: La médiane haute est toujours une valeur représentée dans les données. Lorsque le nombre d'observations est impair, la valeur du milieu est renvoyée. Sinon, la plus grande des deux valeurs du milieu est renvoyée.

source: Use the high median when your data are discrete and you prefer the median to be an actual data point rather than interpolated.
fr: Utilisez la médiane haute lorsque vos données sont discrètes et que vous préférez que la médiane soit une valeur représentée dans vos observations plutôt que le résultat d'une interpolation.

source: Return the median of grouped continuous data, calculated as the 50th percentile, using interpolation. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
fr: Renvoie la médiane de données réelles groupées, calculée comme le 50\ :sup:`e` percentile (avec interpolation). Lève une erreur :exc:`StatisticsError` si *data* est vide. *data* peut être une séquence ou un itérable.

source: In the following example, the data are rounded, so that each value represents the midpoint of data classes, e.g. 1 is the midpoint of the class 0.5--1.5, 2 is the midpoint of 1.5--2.5, 3 is the midpoint of 2.5--3.5, etc. With the data given, the middle value falls somewhere in the class 3.5--4.5, and interpolation is used to estimate it:
fr: Dans l'exemple ci-dessous, les valeurs sont arrondies de sorte que chaque valeur représente le milieu d'un groupe. Par exemple 1 est le milieu du groupe 0,5 - 1, 2 est le milieu du groupe 1,5 - 2,5, 3 est le milieu de 2,5 - 3,5, etc. Compte-tenu des valeurs ci-dessous, la valeur centrale se situe quelque part dans le groupe 3,5 - 4,5 et est estimée par interpolation :

source: Optional argument *interval* represents the class interval, and defaults to 1. Changing the class interval naturally will change the interpolation:
fr: L'argument optionnel *interval* représente la largeur de l'intervalle des groupes (par défaut, 1). Changer l'intervalle des groupes change bien sûr l'interpolation :

source: This function does not check whether the data points are at least *interval* apart.
fr: Cette fonction ne vérifie pas que les valeurs sont bien séparées d'au moins une fois *interval*.

source: Under some circumstances, :func:`median_grouped` may coerce data points to floats. This behaviour is likely to change in the future.
fr: Sous certaines conditions, :func:`median_grouped` peut convertir les valeurs en nombres à virgule flottante. Ce comportement est susceptible de changer dans le futur.

source: "Statistics for the Behavioral Sciences", Frederick J Gravetter and Larry B Wallnau (8th Edition).
fr: *Statistics for the Behavioral Sciences*, Frederick J Gravetter et Larry B Wallnau (8\ :sup:`e` édition, ouvrage en anglais).

source: The `SSMEDIAN <https://help.gnome.org/users/gnumeric/stable/gnumeric.html#gnumeric-function-SSMEDIAN>`_ function in the Gnome Gnumeric spreadsheet, including `this discussion <https://mail.gnome.org/archives/gnumeric-list/2011-April/msg00018.html>`_.
fr: La fonction `SSMEDIAN <https://help.gnome.org/users/gnumeric/stable/gnumeric.html#gnumeric-function-SSMEDIAN>`_ du tableur Gnome Gnumeric ainsi que `cette discussion <https://mail.gnome.org/archives/gnumeric-list/2011-April/msg00018.html>`_.

source: Return the single most common data point from discrete or nominal *data*. The mode (when it exists) is the most typical value and serves as a measure of central location.
fr: Renvoie la valeur la plus représentée dans la collection *data* (discrète ou nominale). Ce mode, lorsqu'il existe, est la valeur la plus représentative des données et est une mesure de la tendance centrale.

source: If there are multiple modes with the same frequency, returns the first one encountered in the *data*. If the smallest or largest of those is desired instead, use ``min(multimode(data))`` or ``max(multimode(data))``. If the input *data* is empty, :exc:`StatisticsError` is raised.
fr: S'il existe plusieurs modes avec la même fréquence, cette fonction renvoie le premier qui a été rencontré dans *data*. Utilisez ``min(multimode(data))`` ou ``max(multimode(data))`` si vous désirez le plus petit mode ou le plus grand mode. Lève une erreur :exc:`StatisticsError` si *data* est vide.

source: ``mode`` assumes discrete data and returns a single value. This is the standard treatment of the mode as commonly taught in schools:
fr: ``mode`` suppose que les données sont discrètes et renvoie une seule valeur. Il s'agit de la définition usuelle du mode telle qu'enseignée dans à l'école :

source: The mode is unique in that it is the only statistic in this package that also applies to nominal (non-numeric) data:
fr: Le mode a la particularité d'être la seule statistique de ce module à pouvoir être calculée sur des données nominales (non numériques) :

source: Now handles multimodal datasets by returning the first mode encountered. Formerly, it raised :exc:`StatisticsError` when more than one mode was found.
fr: Gère désormais des jeux de données avec plusieurs modes en renvoyant le premier mode rencontré. Précédemment, une erreur :exc:`StatisticsError` était levée si plusieurs modes étaient trouvés.

source: Return a list of the most frequently occurring values in the order they were first encountered in the *data*. Will return more than one result if there are multiple modes or an empty list if the *data* is empty:
fr: Renvoie une liste des valeurs les plus fréquentes en suivant leur ordre d'apparition dans *data*. Renvoie plusieurs résultats s'il y a plusieurs modes ou une liste vide si *data* est vide :

source: Return the population standard deviation (the square root of the population variance). See :func:`pvariance` for arguments and other details.
fr: Renvoie l'écart-type de la population (racine carrée de la variance de la population). Voir :func:`pvariance` pour les arguments et d'autres précisions.

source: Return the population variance of *data*, a non-empty sequence or iterable of real-valued numbers. Variance, or second moment about the mean, is a measure of the variability (spread or dispersion) of data. A large variance indicates that the data is spread out; a small variance indicates it is clustered closely around the mean.
fr: Renvoie la variance de la population *data*, une séquence non-vide ou un itérable de valeurs réelles. La variance, ou moment de second ordre, est une mesure de la variabilité (ou dispersion) des données. Une variance élevée indique une large dispersion des valeurs ; une faible variance indique que les valeurs sont resserrées autour de la moyenne.

source: If the optional second argument *mu* is given, it is typically the mean of the *data*. It can also be used to compute the second moment around a point that is not the mean. If it is missing or ``None`` (the default), the arithmetic mean is automatically calculated.
fr: Si le second argument optionnel *mu* est n'est pas spécifié ou est ``None`` (par défaut), il est remplacé automatiquement par la moyenne arithmétique. Cet argument correspond en général à la moyenne de *data*. En le spécifiant autrement, cela permet de calculer le moment de second ordre autour d'un point qui n'est pas la moyenne.

source: Use this function to calculate the variance from the entire population. To estimate the variance from a sample, the :func:`variance` function is usually a better choice.
fr: Utilisez cette fonction pour calculer la variance sur une population complète. Pour estimer la variance à partir d'un échantillon, utilisez plutôt :func:`variance` à la place.

source: Raises :exc:`StatisticsError` if *data* is empty.
fr: Lève une erreur :exc:`StatisticsError` si *data* est vide.

source: Examples:
fr: Exemples :

source: If you have already calculated the mean of your data, you can pass it as the optional second argument *mu* to avoid recalculation:
fr: Si vous connaissez la moyenne de vos données, il est possible de la passer comme argument optionnel *mu* lors de l'appel de fonction pour éviter de la calculer une nouvelle fois :

source: Decimals and Fractions are supported:
fr: La fonction gère les nombres décimaux et les fractions :

source: When called with the entire population, this gives the population variance σ². When called on a sample instead, this is the biased sample variance s², also known as variance with N degrees of freedom.
fr: Cette fonction renvoie la variance de la population σ² lorsqu'elle est appliquée sur la population entière. Si elle est appliquée seulement sur un échantillon, le résultat est alors la variance de l'échantillon s² ou variance à N degrés de liberté.

source: If you somehow know the true population mean μ, you may use this function to calculate the variance of a sample, giving the known population mean as the second argument. Provided the data points are a random sample of the population, the result will be an unbiased estimate of the population variance.
fr: Si vous connaissez d'avance la vraie moyenne de la population μ, vous pouvez utiliser cette fonction pour calculer la variance de l'échantillon sachant la moyenne de la population en la passante comme second argument. En supposant que les observations sont issues d'un tirage aléatoire uniforme dans la population, le résultat sera une estimation non biaisée de la variance de la population.

source: Return the sample standard deviation (the square root of the sample variance). See :func:`variance` for arguments and other details.
fr: Renvoie l'écart-type de l'échantillon (racine carrée de la variance de l'échantillon). Voir :func:`variance` pour les arguments et plus de détails.

source: Return the sample variance of *data*, an iterable of at least two real-valued numbers. Variance, or second moment about the mean, is a measure of the variability (spread or dispersion) of data. A large variance indicates that the data is spread out; a small variance indicates it is clustered closely around the mean.
fr: Renvoie la variance de l'échantillon *data*, un itérable d'au moins deux valeurs réelles. La variance, ou moment de second ordre, est une mesure de la variabilité (ou dispersion) des données. Une variance élevée indique que les données sont très dispersées ; une variance faible indique que les valeurs sont resserrées autour de la moyenne.

source: If the optional second argument *xbar* is given, it should be the mean of *data*. If it is missing or ``None`` (the default), the mean is automatically calculated.
fr: Si le second argument optionnel *xbar* est spécifié, celui-ci doit correspondre à la moyenne de *data*. S'il n'est pas spécifié ou ``None`` (par défaut), la moyenne est automatiquement calculée.

source: Use this function when your data is a sample from a population. To calculate the variance from the entire population, see :func:`pvariance`.
fr: Utilisez cette fonction lorsque vos données forment un échantillon d'une population plus grande. Pour calculer la variance d'une population complète, utilisez :func:`pvariance`.

source: Raises :exc:`StatisticsError` if *data* has fewer than two values.
fr: Lève une erreur :exc:`StatisticsError` si *data* contient moins de deux éléments.

source: If you have already calculated the mean of your data, you can pass it as the optional second argument *xbar* to avoid recalculation:
fr: Si vous connaissez la moyenne de vos données, il est possible de la passer comme argument optionnel *xbar* lors de l'appel de fonction pour éviter de la calculer une nouvelle fois :

source: This function does not attempt to verify that you have passed the actual mean as *xbar*. Using arbitrary values for *xbar* can lead to invalid or impossible results.
fr: Cette fonction ne vérifie pas que la valeur passée dans l'argument *xbar* correspond bien à la moyenne. Utiliser des valeurs arbitraires pour *xbar* produit des résultats impossibles ou incorrects.

source: Decimal and Fraction values are supported:
fr: La fonction gère les nombres décimaux et les fractions :
