Repository: python/python-docs-fr
Catalog: library/statistics.po
Languages: fr

source: This is the sample variance s² with Bessel's correction, also known as variance with N-1 degrees of freedom. Provided that the data points are representative (e.g. independent and identically distributed), the result should be an unbiased estimate of the true population variance.
fr: Cela correspond à la variance s² de l'échantillon avec correction de Bessel (ou variance à N-1 degrés de liberté). En supposant que les observations sont représentatives de la population (c'est-à-dire indépendantes et identiquement distribuées), alors le résultat est une estimation non biaisée de la variance.

source: If you somehow know the actual population mean μ you should pass it to the :func:`pvariance` function as the *mu* parameter to get the variance of a sample.
fr: Si vous connaissez d'avance la vraie moyenne μ de la population, vous devriez la passer à :func:`pvariance` comme paramètre *mu* pour obtenir la variance de l'échantillon.

source: Divide *data* into *n* continuous intervals with equal probability. Returns a list of ``n - 1`` cut points separating the intervals.
fr: Divise *data* en *n* intervalles réels de même probabilité. Renvoie une liste de ``n - 1`` valeurs délimitant les intervalles (les quantiles).

source: Set *n* to 4 for quartiles (the default). Set *n* to 10 for deciles. Set *n* to 100 for percentiles which gives the 99 cuts points that separate *data* into 100 equal sized groups. Raises :exc:`StatisticsError` if *n* is not least 1.
fr: Utilisez ``n = 4`` pour obtenir les quartiles (le défaut), ``n = 10`` pour obtenir les déciles et ``n = 100`` pour obtenir les centiles (ce qui produit 99 valeurs qui séparent *data* en 100 groupes de même taille). Lève une erreur :exc:`StatisticsError` si *n* est strictement inférieur à 1.

source: The *data* can be any iterable containing sample data. For meaningful results, the number of data points in *data* should be larger than *n*. Raises :exc:`StatisticsError` if there are not at least two data points.
fr: *data* peut être n'importe quel itérable contenant les valeurs de l'échantillon. Pour que les résultats aient un sens, le nombre d'observations dans l'échantillon *data* doit être plus grand que *n*. Lève une erreur :exc:`StatisticsError` s'il n'y a pas au moins deux observations.

source: The cut points are linearly interpolated from the two nearest data points. For example, if a cut point falls one-third of the distance between two sample values, ``100`` and ``112``, the cut-point will evaluate to ``104``.
fr: Les quantiles sont linéairement interpolées à partir des deux valeurs les plus proches dans l'échantillon. Par exemple, si un quantile se situe à un tiers de la distance entre les deux valeurs de l'échantillon ``100`` et ``112``, le quantile vaudra ``104``.

source: The *method* for computing quantiles can be varied depending on whether the *data* includes or excludes the lowest and highest possible values from the population.
fr: L'argument *method* indique la méthode à utiliser pour calculer les quantiles et peut être modifié pour spécifier s'il faut inclure ou exclure les valeurs basses et hautes de *data* de la population.

source: The default *method* is "exclusive" and is used for data sampled from a population that can have more extreme values than found in the samples. The portion of the population falling below the *i-th* of *m* sorted data points is computed as ``i / (m + 1)``. Given nine sample values, the method sorts them and assigns the following percentiles: 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%.
fr: La valeur par défaut pour *method* est ``"exclusive"`` et est applicable pour des données échantillonnées dans une population dont une des valeurs extrêmes peut être plus grande (respectivement plus petite) que le maximum (respectivement le minimum) des valeurs de l'échantillon. La proportion de la population se situant en-dessous du i\ :sup:`e` de *m* valeurs ordonnées est calculée par la formule ``i / (m + 1)``. Par exemple, en supposant 9 valeurs dans l'échantillon, cette méthode les ordonne et leur associe les quantiles suivants : 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%.

source: Setting the *method* to "inclusive" is used for describing population data or for samples that are known to include the most extreme values from the population. The minimum value in *data* is treated as the 0th percentile and the maximum value is treated as the 100th percentile. The portion of the population falling below the *i-th* of *m* sorted data points is computed as ``(i - 1) / (m - 1)``. Given 11 sample values, the method sorts them and assigns the following percentiles: 0%, 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%, 100%.
fr: En utilisant ``"inclusive"`` comme valeur du paramètre *method*, on suppose que *data* correspond soit à une population entière, soit que les valeurs extrêmes de la population sont représentées dans l'échantillon. Le minimum de *data* est alors considéré comme 0\ :sup:`e` centile et le maximum comme 100\ :sup:`e` centile. La proportion de la population se situant sous la i\ :sup:`e` valeur de *m* valeurs ordonnées est calculée par la formule ``(i - 1)/(m - 1)``. En supposant que l'on a 11 valeurs dans l'échantillon, cette méthode les ordonne et leur associe les quantiles suivants : 0%, 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%, 100%.

source: A single exception is defined:
fr: Une seule exception est définie :

source: Subclass of :exc:`ValueError` for statistics-related exceptions.
fr: Sous-classe de :exc:`ValueError` pour les exceptions liées aux statistiques.

source: :class:`NormalDist` objects
fr: Objets :class:`NormalDist`

source: :class:`NormalDist` is a tool for creating and manipulating normal distributions of a `random variable <http://www.stat.yale.edu/Courses/1997-98/101/ranvar.htm>`_. It is a class that treats the mean and standard deviation of data measurements as a single entity.
fr: :class:`NormalDist` est un outil permettant de créer et manipuler des lois normales de `variables aléatoires <https://fr.wikipedia.org/wiki/Variable_al%C3%A9atoire>`_. Cette classe gère la moyenne et l'écart-type d'un ensemble d'observations comme une seule entité.

source: Normal distributions arise from the `Central Limit Theorem <https://en.wikipedia.org/wiki/Central_limit_theorem>`_ and have a wide range of applications in statistics.
fr: Les lois normales apparaissent dans de très nombreuses applications des statistiques. Leur ubiquité découle du `théorème central limite <https://fr.wikipedia.org/wiki/Th%C3%A9or%C3%A8me_central_limite>`_.

source: Returns a new *NormalDist* object where *mu* represents the `arithmetic mean <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ and *sigma* represents the `standard deviation <https://en.wikipedia.org/wiki/Standard_deviation>`_.
fr: Renvoie un nouvel objet *NormalDist* où *mu* représente la `moyenne arithmétique <https://fr.wikipedia.org/wiki/Moyenne_arithm%C3%A9tique>`_ et *sigma* `l'écart-type <https://fr.wikipedia.org/wiki/%C3%89cart_type>`_.

source: If *sigma* is negative, raises :exc:`StatisticsError`.
fr: Lève une erreur :exc:`StatisticsError` si *sigma* est négatif.

source: A read-only property for the `arithmetic mean <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ of a normal distribution.
fr: Attribut en lecture seule correspondant à la `moyenne arithmétique <https://fr.wikipedia.org/wiki/Moyenne_arithm%C3%A9tique>`_ d'une loi normale.

source: A read-only property for the `median <https://en.wikipedia.org/wiki/Median>`_ of a normal distribution.
fr: Attribut en lecture seule correspondant à la `médiane <https://fr.wikipedia.org/wiki/M%C3%A9diane_(statistiques)>`_ d'une loi normale.

source: A read-only property for the `mode <https://en.wikipedia.org/wiki/Mode_(statistics)>`_ of a normal distribution.
fr: Attribut en lecture seule correspondant au `mode <https://fr.wikipedia.org/wiki/Mode_(statistiques)>`_ d'une loi normale.

source: A read-only property for the `standard deviation <https://en.wikipedia.org/wiki/Standard_deviation>`_ of a normal distribution.
fr: Attribut en lecture seule correspondant à `l'écart-type <https://fr.wikipedia.org/wiki/%C3%89cart_type>`_ d'une loi normale.

source: A read-only property for the `variance <https://en.wikipedia.org/wiki/Variance>`_ of a normal distribution. Equal to the square of the standard deviation.
fr: Attribut en lecture seule correspondant à la `variance <https://fr.wikipedia.org/wiki/Variance>`_ d'une loi normale. La variance est égale au carré de l'écart-type.

source: Makes a normal distribution instance with *mu* and *sigma* parameters estimated from the *data* using :func:`fmean` and :func:`stdev`.
fr: Crée une instance de loi normale de paramètres *mu* et *sigma* estimés à partir de *data* en utilisant :func:`fmean` et :func:`stdev`.

source: The *data* can be any :term:`iterable` and should consist of values that can be converted to type :class:`float`. If *data* does not contain at least two elements, raises :exc:`StatisticsError` because it takes at least one point to estimate a central value and at least two points to estimate dispersion.
fr: *data* peut être n'importe quel :term:`iterable` de valeurs pouvant être converties en :class:`float`. Lève une erreur :exc:`StatisticsError` si *data* ne contient pas au moins deux éléments car il faut au moins un point pour estimer la moyenne et deux points pour estimer la variance.

source: Generates *n* random samples for a given mean and standard deviation. Returns a :class:`list` of :class:`float` values.
fr: Génère *n* valeurs aléatoires suivant une loi normale de moyenne et écart-type connus. Renvoie une :class:`list` de :class:`float`.

source: If *seed* is given, creates a new instance of the underlying random number generator. This is useful for creating reproducible results, even in a multi-threading context.
fr: Si *seed* est spécifié, sa valeur est utilisée pour initialiser une nouvelle instance du générateur de nombres aléatoires. Cela permet de produire des résultats reproductibles même dans un contexte de parallélisme par fils d'exécution.

source: Using a `probability density function (pdf) <https://en.wikipedia.org/wiki/Probability_density_function>`_, compute the relative likelihood that a random variable *X* will be near the given value *x*. Mathematically, it is the limit of the ratio ``P(x <= X < x+dx) / dx`` as *dx* approaches zero.
fr: Calcule la vraisemblance qu'une variable aléatoire *X* soit proche de la valeur *x* à partir de la `fonction de densité <https://fr.wikipedia.org/wiki/Variable_al%C3%A9atoire_%C3%A0_densit%C3%A9>`_. Mathématiquement, cela correspond à la limite de la fraction ``P(x <= X < x + dx) / dx`` lorsque ``dx`` tend vers zéro.

source: Using a `cumulative distribution function (cdf) <https://en.wikipedia.org/wiki/Cumulative_distribution_function>`_, compute the probability that a random variable *X* will be less than or equal to *x*. Mathematically, it is written ``P(X <= x)``.
fr: Calcule la probabilité qu'une variable aléatoire *X* soit inférieure ou égale à *x* à partir de la `fonction de répartition <https://fr.wikipedia.org/wiki/Fonction_de_r%C3%A9partition>`_. Mathématiquement, cela correspond à ``P(X <= x)``.

source: Finds the value *x* of the random variable *X* such that the probability of the variable being less than or equal to that value equals the given probability *p*.
fr: Détermine la valeur *x* de la variable aléatoire *X* telle que la probabilité que la variable soit inférieure ou égale à cette valeur *x* est égale à *p*.

source: Measures the agreement between two normal probability distributions. Returns a value between 0.0 and 1.0 giving `the overlapping area for the two probability density functions <https://www.rasch.org/rmt/rmt101r.htm>`_.
fr: Mesure le recouvrement entre deux lois normales. Renvoie une valeur réelle entre 0 et 1 indiquant `l'aire du recouvrement de deux densités de probabilité <https://www.rasch.org/rmt/rmt101r.htm>`_.

source: Divide the normal distribution into *n* continuous intervals with equal probability. Returns a list of (n - 1) cut points separating the intervals.
fr: Divise la loi normale entre *n* intervalles réels équiprobables. Renvoie une liste de ``(n - 1)`` quantiles séparant les intervalles.

source: Set *n* to 4 for quartiles (the default). Set *n* to 10 for deciles. Set *n* to 100 for percentiles which gives the 99 cuts points that separate the normal distribution into 100 equal sized groups.
fr: Utilisez ``n = 4`` pour obtenir les quartiles (le défaut), ``n = 10`` pour obtenir les déciles et ``n = 100`` pour obtenir les centiles (ce qui produit 99 valeurs qui séparent *data* en 100 groupes de même taille).

source: Instances of :class:`NormalDist` support addition, subtraction, multiplication and division by a constant. These operations are used for translation and scaling. For example:
fr: Les instances de la classe :class:`NormalDist` gèrent l'addition, la soustraction, la multiplication et la division par une constante. Ces opérations peuvent être utilisées pour la translation ou la mise à l'échelle, par exemple :

source: Dividing a constant by an instance of :class:`NormalDist` is not supported because the result wouldn't be normally distributed.
fr: Diviser une constante par une instance de :class:`NormalDist` n'est pas pris en charge car le résultat ne serait pas une loi normale.

source: Since normal distributions arise from additive effects of independent variables, it is possible to `add and subtract two independent normally distributed random variables <https://en.wikipedia.org/wiki/Sum_of_normally_distributed_random_variables>`_ represented as instances of :class:`NormalDist`. For example:
fr: Étant donné que les lois normales sont issues des propriétés additives de variables indépendantes, il est possible `d'ajouter ou de soustraite deux variables normales indépendantes <https://en.wikipedia.org/wiki/Sum_of_normally_distributed_random_variables>`_ représentées par des instances de :class:`NormalDist`. Par exemple :

source: :class:`NormalDist` Examples and Recipes
fr: Exemples d'utilisation de :class:`NormalDist`

source: :class:`NormalDist` readily solves classic probability problems.
fr: :class:`NormalDist` permet de résoudre aisément des problèmes probabilistes classiques.

source: For example, given `historical data for SAT exams <https://nces.ed.gov/programs/digest/d17/tables/dt17_226.40.asp>`_ showing that scores are normally distributed with a mean of 1060 and a standard deviation of 195, determine the percentage of students with test scores between 1100 and 1200, after rounding to the nearest whole number:
fr: Par exemple, sachant que les `scores aux examens SAT <https://nces.ed.gov/programs/digest/d17/tables/dt17_226.40.asp>`_ suivent une loi normale de moyenne 1060 et d'écart-type 195, déterminer le pourcentage d'étudiants dont les scores se situent entre 1100 et 1200, arrondi à l'entier le plus proche :

source: Find the `quartiles <https://en.wikipedia.org/wiki/Quartile>`_ and `deciles <https://en.wikipedia.org/wiki/Decile>`_ for the SAT scores:
fr: Déterminer les `quartiles <https://fr.wikipedia.org/wiki/Quartile>`_ et les `déciles <https://fr.wikipedia.org/wiki/Decile>`_ des scores SAT :

source: To estimate the distribution for a model than isn't easy to solve analytically, :class:`NormalDist` can generate input samples for a `Monte Carlo simulation <https://en.wikipedia.org/wiki/Monte_Carlo_method>`_:
fr: :class:`NormalDist` peut générer des observations pour une simulation utilisant la `méthode de Monte-Carlo <https://fr.wikipedia.org/wiki/M%C3%A9thode_de_Monte-Carlo>`_ afin d'estimer la distribution d'un modèle difficile à résoudre analytiquement :

source: For example, an open source conference has 750 attendees and two rooms with a 500 person capacity. There is a talk about Python and another about Ruby. In previous conferences, 65% of the attendees preferred to listen to Python talks. Assuming the population preferences haven't changed, what is the probability that the Python room will stay within its capacity limits?
fr: Par exemple, 750 personnes assistent à une conférence sur le logiciel libre. Il y a deux salles pouvant chacune accueillir 500 personnes. Dans la première salle a lieu une présentation sur Python, dans l'autre une présentation à propos de Ruby. Lors des conférences passées, 65% des personnes ont préféré écouter les présentations sur Python. En supposant que les préférences de la population n'ont pas changé, quelle est la probabilité que la salle Python reste en-dessous de sa capacité d'accueil ?

source: Normal distributions commonly arise in machine learning problems.
fr: Les lois normales interviennent souvent en apprentissage automatique.

source: We're given a training dataset with measurements for eight people. The measurements are assumed to be normally distributed, so we summarize the data with :class:`NormalDist`:
fr: Nous avons à notre disposition un jeu de données d'apprentissage contenant les mesures de huit personnes. On suppose que ces mesures suivent une loi normale. Nous pouvons donc synthétiser les données à l'aide de :class:`NormalDist` :

source: Next, we encounter a new person whose feature measurements are known but whose gender is unknown:
fr: Ensuite, nous rencontrons un nouvel individu dont nous connaissons les proportions mais pas le sexe :

source: Starting with a 50% `prior probability <https://en.wikipedia.org/wiki/Prior_probability>`_ of being male or female, we compute the posterior as the prior times the product of likelihoods for the feature measurements given the gender:
fr: En partant d'une `probabilité a priori <https://fr.wikipedia.org/wiki/Th%C3%A9or%C3%A8me_de_Bayes>`_ de 50% d'être un homme ou une femme, nous calculons la probabilité a posteriori comme le produit de la probabilité antérieure et de la vraisemblance des différentes mesures étant donné le sexe :

source: The final prediction goes to the largest posterior. This is known as the `maximum a posteriori <https://en.wikipedia.org/wiki/Maximum_a_posteriori_estimation>`_ or MAP:
fr: La prédiction finale est celle qui a la plus grande probabilité a posteriori. Cette approche est appelée `maximum a posteriori <https://fr.wikipedia.org/wiki/Maximum_a_posteriori>`_ ou MAP :
