Repository: python/python-docs-fr
Catalog: library/stdtypes.po
Languages: fr

source: The exception passed in should never be reraised explicitly - instead, this method should return a false value to indicate that the method completed successfully and does not want to suppress the raised exception. This allows context management code to easily detect whether or not an :meth:`__exit__` method has actually failed.
fr: L'exception reçue ne doit jamais être relancée explicitement, cette méthode devrait plutôt renvoyer une valeur fausse pour indiquer que son exécution s'est terminée avec succès et qu'elle ne veut pas supprimer l'exception. Ceci permet au code de gestion du contexte de comprendre si une méthode :meth:`__exit__` a échoué.

source: Python defines several context managers to support easy thread synchronisation, prompt closure of files or other objects, and simpler manipulation of the active decimal arithmetic context. The specific types are not treated specially beyond their implementation of the context management protocol. See the :mod:`contextlib` module for some examples.
fr: Python définit plusieurs gestionnaires de contexte pour faciliter la synchronisation des fils d'exécution, la fermeture des fichiers ou d'autres objets, et la configuration du contexte arithmétique décimal. Ces types spécifiques ne sont pas traités différemment, ils respectent simplement le protocole de gestion du contexte. Voir les exemples dans la documentation du module :mod:`contextlib`.

source: Python's :term:`generator`\s and the :class:`contextlib.contextmanager` decorator provide a convenient way to implement these protocols. If a generator function is decorated with the :class:`contextlib.contextmanager` decorator, it will return a context manager implementing the necessary :meth:`__enter__` and :meth:`__exit__` methods, rather than the iterator produced by an undecorated generator function.
fr: Les :term:`generator`\s de Python et le décorateur :class:`contextlib.contextmanager` permettent d'implémenter simplement ces protocoles. Si un générateur est décoré avec :class:`contextlib. contextmanager`, elle renverra un gestionnaire de contexte implémentant les méthodes :meth:`__enter__` et :meth:`__exit__`, plutôt que l'itérateur produit par un générateur non décoré.

source: Note that there is no specific slot for any of these methods in the type structure for Python objects in the Python/C API. Extension types wanting to define these methods must provide them as a normal Python accessible method. Compared to the overhead of setting up the runtime context, the overhead of a single class dictionary lookup is negligible.
fr: Notez qu'il n'y a pas d'emplacement spécifique pour ces méthodes dans la structure de type pour les objets Python dans l'API Python/C. Les types souhaitant définir ces méthodes doivent les fournir comme une méthode accessible en Python. Comparé au coût de la mise en place du contexte d'exécution, les le coût d'un accès au dictionnaire d'une classe unique est négligeable.

source: Other Built-in Types
fr: Autres types natifs

source: The interpreter supports several other kinds of objects. Most of these support only one or two operations.
fr: L'interpréteur gère aussi d'autres types d'objets, la plupart ne supportant cependant qu'une ou deux opérations.

source: The only special operation on a module is attribute access: ``m.name``, where *m* is a module and *name* accesses a name defined in *m*'s symbol table. Module attributes can be assigned to. (Note that the :keyword:`import` statement is not, strictly speaking, an operation on a module object; ``import foo`` does not require a module object named *foo* to exist, rather it requires an (external) *definition* for a module named *foo* somewhere.)
fr: La seule opération spéciale sur un module est l'accès à ses attributs : ``m.name``, où *m* est un module et *name* donne accès un nom défini dans la table des symboles de *m*. Il est possible d'assigner un attribut de module. (Notez que l'instruction :keyword:`import` n'est pas strictement une opération sur un objet module. ``import foo`` ne nécessite pas qu'un objet module nommé *foo* existe, il nécessite cependant une *définition* (externe) d'un module nommé *foo* quelque part.)

source: A special attribute of every module is :attr:`~object.__dict__`. This is the dictionary containing the module's symbol table. Modifying this dictionary will actually change the module's symbol table, but direct assignment to the :attr:`~object.__dict__` attribute is not possible (you can write ``m.__dict__['a'] = 1``, which defines ``m.a`` to be ``1``, but you can't write ``m.__dict__ = {}``). Modifying :attr:`~object.__dict__` directly is not recommended.
fr: Un attribut spécial à chaque module est :attr:`~object.__dict__`. C'est le dictionnaire contenant la table des symbole du module. Modifier ce dictionnaire changera la table des symboles du module, mais assigner directement :attr:`~object.__dict__` n'est pas possible (vous pouvez écrire ``m.__dict__['a'] = 1``, qui donne ``1`` comme valeur pour ``m.a``, mais vous ne pouvez pas écrire ``m.__dict__ = {}``). Modifier :attr:`~object.__dict__` directement n'est pas recommandé.

source: Modules built into the interpreter are written like this: ``<module 'sys' (built-in)>``. If loaded from a file, they are written as ``<module 'os' from '/usr/local/lib/pythonX.Y/os.pyc'>``.
fr: Les modules natifs à l'interpréteur sont représentés ``<module 'sys' (built-in)>``. S'ils sont chargés depuis un fichier, ils sont représentés ``<module 'os' from '/usr/local/lib/pythonX.Y/os.pyc'>``.

source: Classes and Class Instances
fr: Les classes et instances de classes

source: See :ref:`objects` and :ref:`class` for these.
fr: Voir :ref:`objects` et :ref:`class`.

source: Functions
fr: Fonctions

source: Function objects are created by function definitions. The only operation on a function object is to call it: ``func(argument-list)``.
fr: Les objets fonctions sont crées par les définitions de fonctions. La seule opération applicable à un objet fonction est de l'appeler : ``func(argument-list)``.

source: There are really two flavors of function objects: built-in functions and user-defined functions. Both support the same operation (to call the function), but the implementation is different, hence the different object types.
fr: Il existe en fait deux catégories d'objets fonctions : Les fonctions natives et les fonctions définies par l'utilisateur. Les deux gèrent les mêmes opérations (l'appel à la fonction), mais leur implémentation est différente, d'où les deux types distincts.

source: See :ref:`function` for more information.
fr: Voir :ref:`function` pour plus d'information.

source: Methods
fr: Méthodes

source: Methods are functions that are called using the attribute notation. There are two flavors: built-in methods (such as :meth:`append` on lists) and class instance methods. Built-in methods are described with the types that support them.
fr: Les méthodes sont des fonctions appelées via la notation d'attribut. Il en existe deux variantes : Les méthodes natives (tel que :meth:`append` sur les listes), et les méthodes d'instances de classes. Les méthodes natives sont représentées avec le type qui les supporte.

source: If you access a method (a function defined in a class namespace) through an instance, you get a special object: a :dfn:`bound method` (also called :dfn:`instance method`) object. When called, it will add the ``self`` argument to the argument list. Bound methods have two special read-only attributes: ``m.__self__`` is the object on which the method operates, and ``m.__func__`` is the function implementing the method. Calling ``m(arg-1, arg-2, ..., arg-n)`` is completely equivalent to calling ``m.__func__(m.__self__, arg-1, arg-2, ..., arg-n)``.
fr: Si vous accédez à une méthode (une fonction définie dans l'espace de nommage d'une classe) via une instance, vous obtenez un objet spécial, une :dfn:`bound method` (aussi appelée :dfn:`instance method`). Lorsqu'elle est appelée, elle ajoute l'argument ``self`` à la liste des arguments. Les méthodes liées ont deux attributs spéciaux, en lecture seule : ``m.__self__`` est l'objet sur lequel la méthode travaille, et ``m.__func__`` est la fonction implémentant la méthode. Appeler ``m(arg-1, arg-2, …, arg-n)`` est tout à fait équivalent à appeler ``m.__func__(m.__self__, arg-1, arg-2, …, arg-n)``.

source: Like function objects, bound method objects support getting arbitrary attributes. However, since method attributes are actually stored on the underlying function object (``meth.__func__``), setting method attributes on bound methods is disallowed. Attempting to set an attribute on a method results in an :exc:`AttributeError` being raised. In order to set a method attribute, you need to explicitly set it on the underlying function object::
fr: Comme les objets fonctions, les objets méthodes, liées, acceptent des attributs arbitraires. Cependant, puisque les attributs de méthodes doivent être stockés dans la fonction sous-jacente (``meth.__func__``), affecter des attributs à des objets *bound method* est interdit. Toute tentative d'affecter un attribut sur un objet *bound method* lèvera une :exc:`AttributeError`. Pour affecter l'attribut, vous devrez explicitement l'affecter à sa fonction sous-jacente ::

source: See :ref:`types` for more information.
fr: Voir :ref:`types` pour plus d'information.

source: Code Objects
fr: Objets code

source: Code objects are used by the implementation to represent "pseudo-compiled" executable Python code such as a function body. They differ from function objects because they don't contain a reference to their global execution environment. Code objects are returned by the built-in :func:`compile` function and can be extracted from function objects through their :attr:`__code__` attribute. See also the :mod:`code` module.
fr: Les objets code sont utilisés par l'implémentation pour représenter du code Python "pseudo-compilé", comme un corps de fonction. Ils sont différents des objets fonction dans le sens où ils ne contiennent pas de référence à leur environnement global d'exécution. Les objets code sont renvoyés par la fonction native :func:`compile` et peuvent être obtenus des objets fonction via leur attribut :attr:`__code__`. Voir aussi le module :mod:`code`.

source: A code object can be executed or evaluated by passing it (instead of a source string) to the :func:`exec` or :func:`eval` built-in functions.
fr: Les objets code peuvent être exécutés ou évalués en les passant (au lieu d'une chaîne contenant du code) aux fonction natives :func:`exec` ou :func:`eval`.

source: Type Objects
fr: Objets type

source: Type objects represent the various object types. An object's type is accessed by the built-in function :func:`type`. There are no special operations on types. The standard module :mod:`types` defines names for all standard built-in types.
fr: Les objets types représentent les différents types d'objets. Le type d'un objet est obtenu via la fonction native :func:`type`. Il n'existe aucune opération spéciale sur les types. Le module standard :mod:`types` définit les noms de tous les types natifs.

source: Types are written like this: ``<class 'int'>``.
fr: Les types sont représentés : ``<class 'int'>``.

source: The Null Object
fr: L'objet Null

source: This object is returned by functions that don't explicitly return a value. It supports no special operations. There is exactly one null object, named ``None`` (a built-in name). ``type(None)()`` produces the same singleton.
fr: Cet objet est renvoyé par les fonctions ne renvoyant pas explicitement une valeur. Il ne supporte aucune opération spéciale. Il existe exactement un objet *null* nommé ``None`` (c'est un nom natif). ``type(None)()``.

source: It is written as ``None``.
fr: C'est écrit ``None``.

source: The Ellipsis Object
fr: L'objet points de suspension

source: This object is commonly used by slicing (see :ref:`slicings`). It supports no special operations. There is exactly one ellipsis object, named :const:`Ellipsis` (a built-in name). ``type(Ellipsis)()`` produces the :const:`Ellipsis` singleton.
fr: Cet objet est utilisé classiquement lors des découpes (voir :ref:`slicings`). Il ne supporte aucune opération spéciale. Il n'y a qu'un seul objet *ellipsis*, nommé :const:`Ellipsis` (un nom natif). ``type(Ellipsis)()`` produit le *singleton* :const:`Ellipsis`.

source: It is written as ``Ellipsis`` or ``...``.
fr: C'est écrit ``Ellipsis`` ou ``...``.

source: The NotImplemented Object
fr: L'objet *NotImplemented*

source: This object is returned from comparisons and binary operations when they are asked to operate on types they don't support. See :ref:`comparisons` for more information. There is exactly one ``NotImplemented`` object. ``type(NotImplemented)()`` produces the singleton instance.
fr: Cet objet est renvoyé depuis des comparaisons ou des opérations binaires effectuées sur des types qu'elles ne supportent pas. Voir :ref:`comparisons` pour plus d'informations. Il n'y a qu'un seul objet ``NotImplemented``. ``type(NotImplemented)()`` renvoie un *singleton*.

source: It is written as ``NotImplemented``.
fr: C'est écrit ``NotImplemented``.

source: Boolean Values
fr: Valeurs booléennes

source: Boolean values are the two constant objects ``False`` and ``True``. They are used to represent truth values (although other values can also be considered false or true). In numeric contexts (for example when used as the argument to an arithmetic operator), they behave like the integers 0 and 1, respectively. The built-in function :func:`bool` can be used to convert any value to a Boolean, if the value can be interpreted as a truth value (see section :ref:`truth` above).
fr: Les valeurs booléennes sont les deux objets constants ``False`` et ``True``. Ils sont utilisés pour représenter les valeurs de vérité (bien que d'autres valeurs peuvent être considérées vraies ou fausses). Dans des contextes numériques (par exemple en argument d'un opérateur arithmétique), ils se comportent comme les nombres entiers 0 et 1, respectivement. La fonction native :func:`bool` peut être utilisée pour convertir n'importe quelle valeur en booléen tant que la valeur peut être interprétée en une valeur de vérité (voir :ref:`truth` au dessus).

source: They are written as ``False`` and ``True``, respectively.
fr: Ils s'écrivent ``False`` et ``True``, respectivement.

source: Internal Objects
fr: Objets internes

source: See :ref:`types` for this information. It describes stack frame objects, traceback objects, and slice objects.
fr: Voir :ref:`types`. Ils décrivent les objets *stack frame*, *traceback*, et *slice*.

source: Special Attributes
fr: Attributs spéciaux

source: The implementation adds a few special read-only attributes to several object types, where they are relevant. Some of these are not reported by the :func:`dir` built-in function.
fr: L'implémentation ajoute quelques attributs spéciaux et en lecture seule, à certains types, lorsque ça a du sens. Certains ne sont *pas* listés par la fonction native :func:`dir`.

source: A dictionary or other mapping object used to store an object's (writable) attributes.
fr: Un dictionnaire ou un autre *mapping object* utilisé pour stocker les attributs (modifiables) de l'objet.

source: The class to which a class instance belongs.
fr: La classe de l'instance de classe.

source: The tuple of base classes of a class object.
fr: Le *tuple* des classes parentes d'un objet classe.

source: The name of the class, function, method, descriptor, or generator instance.
fr: Le nom de la classe, fonction, méthode, descripteur, ou générateur.

source: The :term:`qualified name` of the class, function, method, descriptor, or generator instance.
fr: Le :term:`qualified name` de la classe, fonction, méthode, descripteur, ou générateur.

source: This attribute is a tuple of classes that are considered when looking for base classes during method resolution.
fr: Cet attribut est un *tuple* contenant les classes parents prises en compte lors de la résolution de méthode.

source: This method can be overridden by a metaclass to customize the method resolution order for its instances. It is called at class instantiation, and its result is stored in :attr:`~class.__mro__`.
fr: Cette méthode peut être surchargée par une méta-classe pour personnaliser l'ordre de la recherche de méthode pour ses instances. Elle est appelée à la l'initialisation de la classe, et son résultat est stocké dans l'attribut :attr:`~class.__mro__`.

source: Each class keeps a list of weak references to its immediate subclasses. This method returns a list of all those references still alive. Example::
fr: Chaque classe garde une liste de références faibles à ses classes filles immédiates. Cette méthode renvoie la liste de toutes ces références encore valables. Exemple ::

source: Footnotes
fr: Notes

source: Additional information on these special methods may be found in the Python Reference Manual (:ref:`customization`).
fr: Plus d'informations sur ces méthodes spéciales peuvent être trouvées dans le *Python Reference Manual* (:ref:`customization`).

source: As a consequence, the list ``[1, 2]`` is considered equal to ``[1.0, 2.0]``, and similarly for tuples.
fr: Par conséquent, la liste ``[1, 2]`` est considérée égale à ``[1.0, 2.0]``. Idem avec des tuples.

source: They must have since the parser can't tell the type of the operands.
fr: Nécessairement, puisque l'analyseur ne peut pas discerner le type des opérandes.

source: Cased characters are those with general category property being one of "Lu" (Letter, uppercase), "Ll" (Letter, lowercase), or "Lt" (Letter, titlecase).
fr: Les caractères capitalisables sont ceux dont la propriété Unicode *general category* est soit "Lu" (pour *Letter*, *uppercase*), soit "Ll" (pour *Letter*, *lowercase*), soit "Lt" (pour *Letter*, *titlecase*).

source: To format only a tuple you should therefore provide a singleton tuple whose only element is the tuple to be formatted.
fr: Pour insérer un *tuple*, vous devez donc donner un *tuple* d'un seul élément, contenant le *tuple* à insérer.
