Repository: python/python-docs-fr
Catalog: library/stdtypes.po
Languages: fr

source: Split the string at the first occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself, and the part after the separator. If the separator is not found, return a 3-tuple containing the string itself, followed by two empty strings.
fr: Divise la chaîne à la première occurrence de *sep*, et donne un *tuple* de trois éléments contenant la partie avant le séparateur, le séparateur lui-même, et la partie après le séparateur. Si le séparateur n'est pas trouvé, le *tuple* contiendra la chaîne elle-même, suivie de deux chaînes vides.

source: Return a copy of the string with all occurrences of substring *old* replaced by *new*. If the optional argument *count* is given, only the first *count* occurrences are replaced.
fr: Renvoie une copie de la chaîne dont toutes les occurrences de la sous-chaîne *old* sont remplacés par *new*. Si l'argument optionnel *count* est donné, seules les *count* premières occurrences sont remplacées.

source: Return the highest index in the string where substring *sub* is found, such that *sub* is contained within ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` on failure.
fr: Donne l'indice le plus élevé dans la chaîne où la sous-chaîne *sub* se trouve, de telle sorte que *sub* soit contenue dans ``s[start:end]``. Les arguments facultatifs *start* et *end* sont interprétés comme dans la notation des *slices*. Donne ``-1`` en cas d'échec.

source: Like :meth:`rfind` but raises :exc:`ValueError` when the substring *sub* is not found.
fr: Comme :meth:`rfind` mais lève une exception :exc:`ValueError` lorsque la sous-chaîne *sub* est introuvable.

source: Return the string right justified in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
fr: Renvoie la chaîne justifié à droite dans une chaîne de longueur *width*. Le rembourrage est fait en utilisant le caractère spécifié par *fillchar* (par défaut est un espace ASCII). La chaîne d'origine est renvoyée si *width* est inférieure ou égale à ``len(s)``.

source: Split the string at the last occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself, and the part after the separator. If the separator is not found, return a 3-tuple containing two empty strings, followed by the string itself.
fr: Divise la chaîne à la dernière occurrence de *sep*, et donne un tuple de trois éléments contenant la partie avant le séparateur, le séparateur lui-même, et la partie après le séparateur. Si le séparateur n'est pas trouvé, le *tuple* contiendra deux chaînes vides, puis par la chaîne elle-même.

source: Return a list of the words in the string, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done, the *rightmost* ones. If *sep* is not specified or ``None``, any whitespace string is a separator. Except for splitting from the right, :meth:`rsplit` behaves like :meth:`split` which is described in detail below.
fr: Renvoie une liste des mots de la chaîne, en utilisant *sep* comme séparateur. Si *maxsplit* est donné, c'est le nombre maximum de divisions qui pourront être faites, celles "à droite". Si *sep* est pas spécifié ou est ``None``, tout espace est un séparateur. En dehors du fait qu'il découpe par la droite, :meth:`rsplit` se comporte comme :meth:`split` qui est décrit en détail ci-dessous.

source: Return a copy of the string with trailing characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a suffix; rather, all combinations of its values are stripped::
fr: Renvoie une copie de la chaîne avec des caractères finaux supprimés. L'argument *chars* est une chaîne spécifiant le jeu de caractères à supprimer. En cas d'omission ou ``None``, les espaces sont supprimés. L'argument *chars* n'est pas un suffixe : toutes les combinaisons de ses valeurs sont retirées ::

source: Return a list of the words in the string, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done (thus, the list will have at most ``maxsplit+1`` elements). If *maxsplit* is not specified or ``-1``, then there is no limit on the number of splits (all possible splits are made).
fr: Renvoie une liste des mots de la chaîne, en utilisant *sep* comme séparateur de mots. Si *maxsplit* est donné, c'est le nombre maximum de divisions qui pourront être effectuées, (donnant ainsi une liste de longueur ``maxsplit+1``). Si *maxsplit* n'est pas fourni, ou vaut ``-1``, le nombre de découpes n'est pas limité (Toutes les découpes possibles sont faites).

source: If *sep* is given, consecutive delimiters are not grouped together and are deemed to delimit empty strings (for example, ``'1,,2'.split(',')`` returns ``['1', '', '2']``). The *sep* argument may consist of multiple characters (for example, ``'1<>2<>3'.split('<>')`` returns ``['1', '2', '3']``). Splitting an empty string with a specified separator returns ``['']``.
fr: Si *sep* est donné, les délimiteurs consécutifs ne sont pas regroupés et ainsi délimitent des chaînes vides (par exemple, ``'1,,2'.split(',')`` donne ``['1', '', '2']``). L'argument *sep* peut contenir plusieurs caractères (par exemple, ``'1<>2<>3'.split('<>')`` renvoie ``['1', '2', '3']``). Découper une chaîne vide en spécifiant *sep* donne ``['']``.

source: For example::
fr: Par exemple ::

source: If *sep* is not specified or is ``None``, a different splitting algorithm is applied: runs of consecutive whitespace are regarded as a single separator, and the result will contain no empty strings at the start or end if the string has leading or trailing whitespace. Consequently, splitting an empty string or a string consisting of just whitespace with a ``None`` separator returns ``[]``.
fr: Si *sep* n'est pas spécifié ou est ``None``, un autre algorithme de découpage est appliqué : les espaces consécutifs sont considérés comme un seul séparateur, et le résultat ne contiendra pas les chaînes vides de début ou de la fin si la chaîne est préfixée ou suffixé d'espaces. Par conséquent, diviser une chaîne vide ou une chaîne composée d'espaces avec un séparateur ``None`` renvoie ``[]``.

source: Return a list of the lines in the string, breaking at line boundaries. Line breaks are not included in the resulting list unless *keepends* is given and true.
fr: Renvoie les lignes de la chaîne sous forme de liste, la découpe se fait au niveau des limites des lignes. Les sauts de ligne ne sont pas inclus dans la liste des résultats, sauf si *keepends* est donné, et est vrai.

source: This method splits on the following line boundaries. In particular, the boundaries are a superset of :term:`universal newlines`.
fr: Cette méthode découpe sur les limites de ligne suivantes. Ces limites sont un sur ensemble de :term:`universal newlines`.

source: Representation
fr: Représentation

source: Line Feed
fr: Saut de ligne

source: Carriage Return
fr: Retour chariot

source: Carriage Return + Line Feed
fr: Retour chariot + saut de ligne

source: Line Tabulation
fr: Tabulation verticale

source: Form Feed
fr: Saut de page

source: File Separator
fr: Séparateur de fichiers

source: Group Separator
fr: Séparateur de groupes

source: Record Separator
fr: Séparateur d'enregistrements

source: Next Line (C1 Control Code)
fr: Ligne suivante (code de contrôle *C1*)

source: Line Separator
fr: Séparateur de ligne

source: Paragraph Separator
fr: Séparateur de paragraphe

source: ``\v`` and ``\f`` added to list of line boundaries.
fr: ``\v`` et ``\f`` ajoutés à la liste des limites de lignes.

source: Unlike :meth:`~str.split` when a delimiter string *sep* is given, this method returns an empty list for the empty string, and a terminal line break does not result in an extra line::
fr: Contrairement à :meth:`~str.split` lorsque *sep* est fourni, cette méthode renvoie une liste vide pour la chaîne vide, et un saut de ligne à la fin ne se traduit pas par une ligne supplémentaire ::

source: For comparison, ``split('\n')`` gives::
fr: À titre de comparaison, ``split('\n')`` donne ::

source: Return ``True`` if string starts with the *prefix*, otherwise return ``False``. *prefix* can also be a tuple of prefixes to look for. With optional *start*, test string beginning at that position. With optional *end*, stop comparing string at that position.
fr: Donne ``True`` si la chaîne commence par *prefix*, sinon ``False``. *prefix* peut aussi être un tuple de préfixes à rechercher. Lorsque *start* est donné, la comparaison commence à cette position, et lorsque *end* est donné, la comparaison s'arrête à celle ci.

source: Return a copy of the string with the leading and trailing characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a prefix or suffix; rather, all combinations of its values are stripped::
fr: Donne une copie de la chaîne dont des caractères initiaux et finaux sont supprimés. L'argument *chars* est une chaîne spécifiant le jeu de caractères à supprimer. En cas d'omission ou ``None``, les espaces sont supprimés. L'argument *chars* est pas un préfixe ni un suffixe, toutes les combinaisons de ses valeurs sont supprimées ::

source: The outermost leading and trailing *chars* argument values are stripped from the string. Characters are removed from the leading end until reaching a string character that is not contained in the set of characters in *chars*. A similar action takes place on the trailing end. For example::
fr: Les caractères de *char* sont retirés du début et de la fin de la chaîne. Les caractères sont retirés de la gauche jusqu'à atteindre un caractère ne figurant pas dans le jeu de caractères dans *chars*. La même opération à lieu par la droite. Par exemple ::

source: Return a copy of the string with uppercase characters converted to lowercase and vice versa. Note that it is not necessarily true that ``s.swapcase().swapcase() == s``.
fr: Renvoie une copie de la chaîne dont les caractères majuscules sont convertis en minuscules et vice versa. Notez qu'il est pas nécessairement vrai que ``s.swapcase().swapcase() == s``.

source: Return a titlecased version of the string where words start with an uppercase character and the remaining characters are lowercase.
fr: Renvoie une version en initiales majuscules de la chaîne où les mots commencent par une capitale et les caractères restants sont en minuscules.

source: The algorithm uses a simple language-independent definition of a word as groups of consecutive letters. The definition works in many contexts but it means that apostrophes in contractions and possessives form word boundaries, which may not be the desired result::
fr: Pour l'algorithme, la notion de mot est définie simplement et indépendamment de la langue comme un groupe de lettres consécutives. La définition fonctionne dans de nombreux contextes, mais cela signifie que les apostrophes (typiquement de la forme possessive en Anglais) forment les limites de mot, ce qui n'est pas toujours le résultat souhaité ::

source: A workaround for apostrophes can be constructed using regular expressions::
fr: Une solution pour contourner le problème des apostrophes peut être obtenue en utilisant des expressions rationnelles ::

source: Return a copy of the string in which each character has been mapped through the given translation table. The table must be an object that implements indexing via :meth:`__getitem__`, typically a :term:`mapping` or :term:`sequence`. When indexed by a Unicode ordinal (an integer), the table object can do any of the following: return a Unicode ordinal or a string, to map the character to one or more other characters; return ``None``, to delete the character from the return string; or raise a :exc:`LookupError` exception, to map the character to itself.
fr: Renvoie une copie de la chaîne dans laquelle chaque caractère a été changé selon la table de traduction donnée. La table doit être un objet qui implémente l'indexation via :meth:`__getitem__`, typiquement un :term:`mapping` ou une :term:`sequence`. Pour un ordinal Unicode (un entier), la table peut donner soit un ordinal Unicode ou une chaîne pour faire correspondre un ou plusieurs caractère au caractère donné, soit ``None`` pour supprimer le caractère de la chaîne de renvoyée soit lever une exception :exc:`LookupError` pour ne pas changer le caractère.

source: You can use :meth:`str.maketrans` to create a translation map from character-to-character mappings in different formats.
fr: Vous pouvez utiliser :meth:`str.maketrans` pour créer une table de correspondances de caractères dans différents formats.

source: See also the :mod:`codecs` module for a more flexible approach to custom character mappings.
fr: Voir aussi le module :mod:`codecs` pour une approche plus souple de changements de caractères par correspondance.

source: Return a copy of the string with all the cased characters [4]_ converted to uppercase. Note that ``s.upper().isupper()`` might be ``False`` if ``s`` contains uncased characters or if the Unicode category of the resulting character(s) is not "Lu" (Letter, uppercase), but e.g. "Lt" (Letter, titlecase).
fr: Renvoie une copie de la chaîne où tous les caractères capitalisables [4]_ ont été convertis en capitales. Notez que ``s.upper().isupper()`` peut être ``False`` si ``s`` contient des caractères non capitalisables ou si la catégorie Unicode d'un caractère du résultat n'est pas "Lu" (*Letter*, *uppercase*), mais par exemple "Lt" (*Letter*, *titlecase*).

source: The uppercasing algorithm used is described in section 3.13 of the Unicode Standard.
fr: L'algorithme de capitalisation utilisé est décrit dans la section 3.13 de la norme Unicode.

source: Return a copy of the string left filled with ASCII ``'0'`` digits to make a string of length *width*. A leading sign prefix (``'+'``/``'-'``) is handled by inserting the padding *after* the sign character rather than before. The original string is returned if *width* is less than or equal to ``len(s)``.
fr: Renvoie une copie de la chaîne remplie par la gauche du chiffre (le caractère ASCII) ``'0'`` pour faire une chaîne de longueur *width*. Un préfixe (``'+'`` / ``'-'``) est permis par l'insertion du caractère de rembourrage *après* le caractère désigne plutôt qu'avant. La chaîne d'origine est renvoyée si *width* est inférieur ou égale à ``len(s)``.

source: ``printf``-style String Formatting
fr: Formatage de chaines à la ``printf``

source: The formatting operations described here exhibit a variety of quirks that lead to a number of common errors (such as failing to display tuples and dictionaries correctly). Using the newer :ref:`formatted string literals <f-strings>`, the :meth:`str.format` interface, or :ref:`template strings <template-strings>` may help avoid these errors. Each of these alternatives provides their own trade-offs and benefits of simplicity, flexibility, and/or extensibility.
fr: Ces opérations de mise en forme contiennent des bizarreries menant à de nombreuses erreurs classiques (telles que ne pas réussir à afficher des *tuples* ou des dictionnaires correctement). Utiliser les :ref:`formatted string literals <f-strings>`, la méthode :meth:`str.format` ou les :ref:`template strings <template-strings>` aide à éviter ces erreurs. Chacune de ces alternatives apporte son lot d'avantages et inconvénients en matière de simplicité, de flexibilité et/ou de généralisation possible.

source: String objects have one unique built-in operation: the ``%`` operator (modulo). This is also known as the string *formatting* or *interpolation* operator. Given ``format % values`` (where *format* is a string), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. The effect is similar to using the :c:func:`sprintf` in the C language.
fr: Les objets *str* n'exposent qu'une opération : L'opérateur ``%`` (modulo). Aussi connu sous le nom d'opérateur de formatage, ou opérateur d'interpolation. Étant donné ``format % values`` (où *format* est une chaîne), les marqueurs ``%`` de *format* sont remplacés par zéro ou plusieurs éléments de *values*. L'effet est similaire à la fonction :c:func:`sprintf` du langage C.

source: If *format* requires a single argument, *values* may be a single non-tuple object. [5]_ Otherwise, *values* must be a tuple with exactly the number of items specified by the format string, or a single mapping object (for example, a dictionary).
fr: Si *format* ne nécessite qu'un seul argument, *values* peut être un objet unique. [5]_ Si *values* est un tuple, il doit contenir exactement le nombre d'éléments spécifiés par la chaîne de format, ou un seul objet de correspondances ( *mapping object*, par exemple, un dictionnaire).

source: A conversion specifier contains two or more characters and has the following components, which must occur in this order:
fr: Un indicateur de conversion contient deux ou plusieurs caractères et comporte les éléments suivants, qui doivent apparaître dans cet ordre :

source: The ``'%'`` character, which marks the start of the specifier.
fr: Le caractère ``'%'``, qui marque le début du marqueur.

source: Mapping key (optional), consisting of a parenthesised sequence of characters (for example, ``(somename)``).
fr: La clé de correspondance (facultative), composée d'une suite de caractères entre parenthèse (par exemple, ``(somename)``).

source: Conversion flags (optional), which affect the result of some conversion types.
fr: Des options de conversion, facultatives, qui affectent le résultat de certains types de conversion.

source: Minimum field width (optional). If specified as an ``'*'`` (asterisk), the actual width is read from the next element of the tuple in *values*, and the object to convert comes after the minimum field width and optional precision.
fr: Largeur minimum (facultative). Si elle vaut ``'*'`` (astérisque), la largeur est lue de l'élément suivant du tuple *values*, et l'objet à convertir vient après la largeur de champ minimale et la précision facultative.

source: Precision (optional), given as a ``'.'`` (dot) followed by the precision. If specified as ``'*'`` (an asterisk), the actual precision is read from the next element of the tuple in *values*, and the value to convert comes after the precision.
fr: Précision (facultatif), donnée sous la forme d'un ``'.'`` (point) suivi de la précision. Si la précision est ``'*'`` (un astérisque), la précision est lue à partir de l'élément suivant du tuple *values* et la valeur à convertir vient ensuite.

source: Length modifier (optional).
fr: Modificateur de longueur (facultatif).

source: Conversion type.
fr: Type de conversion.

source: When the right argument is a dictionary (or other mapping type), then the formats in the string *must* include a parenthesised mapping key into that dictionary inserted immediately after the ``'%'`` character. The mapping key selects the value to be formatted from the mapping. For example:
fr: Lorsque l'argument de droite est un dictionnaire (ou un autre type de *mapping*), les marqueurs dans la chaîne *doivent* inclure une clé présente dans le dictionnaire, écrite entre parenthèses, immédiatement après le caractère ``'%'``. La clé indique quelle valeur du dictionnaire doit être formatée. Par exemple :

source: In this case no ``*`` specifiers may occur in a format (since they require a sequential parameter list).
fr: Dans ce cas, aucune ``*`` ne peuvent se trouver dans le format (car ces ``*`` nécessitent une liste (accès séquentiel) de paramètres).

source: The conversion flag characters are:
fr: Les caractères indicateurs de conversion sont :

source: Flag
fr: Option

source: The value conversion will use the "alternate form" (where defined below).
fr: La conversion utilisera la "forme alternative" (définie ci-dessous).

source: The conversion will be zero padded for numeric values.
fr: Les valeurs numériques converties seront complétée de zéros.

source: The converted value is left adjusted (overrides the ``'0'`` conversion if both are given).
fr: La valeur convertie est ajustée à gauche (remplace la conversion ``'0'`` si les deux sont données).

source: (a space) A blank should be left before a positive number (or empty string) produced by a signed conversion.
fr: (un espace) Un espace doit être laissé avant un nombre positif (ou chaîne vide) produite par la conversion d'une valeur signée.

source: A sign character (``'+'`` or ``'-'``) will precede the conversion (overrides a "space" flag).
fr: Un caractère de signe (``'+'`` ou ``'-'``) précède la valeur convertie (remplace le marqueur "espace").

source: A length modifier (``h``, ``l``, or ``L``) may be present, but is ignored as it is not necessary for Python -- so e.g. ``%ld`` is identical to ``%d``.
fr: Un modificateur de longueur (``h``, ``l`` ou ``L``) peut être présent, mais est ignoré car il est pas nécessaire pour Python, donc par exemple ``%ld`` est identique à ``%d``.

source: The conversion types are:
fr: Les types utilisables dans les conversion sont :

source: Signed integer decimal.
fr: Entier décimal signé.

source: Signed octal value.
fr: Valeur octale signée.

source: Obsolete type -- it is identical to ``'d'``.
fr: Type obsolète — identique à ``'d'``.

source: Signed hexadecimal (lowercase).
fr: Hexadécimal signé (en minuscules).

source: Signed hexadecimal (uppercase).
fr: Hexadécimal signé (capitales).

source: Floating point exponential format (lowercase).
fr: Format exponentiel pour un *float* (minuscule).

source: Floating point exponential format (uppercase).
fr: Format exponentiel pour un *float* (en capitales).

source: Floating point decimal format.
fr: Format décimal pour un *float*.

source: Floating point format. Uses lowercase exponential format if exponent is less than -4 or not less than precision, decimal format otherwise.
fr: Format *float*. Utilise le format exponentiel minuscules si l'exposant est inférieur à ``-4`` ou pas plus petit que la précision, sinon le format décimal.

source: Floating point format. Uses uppercase exponential format if exponent is less than -4 or not less than precision, decimal format otherwise.
fr: Format *float*. Utilise le format exponentiel en capitales si l'exposant est inférieur à ``-4`` ou pas plus petit que la précision, sinon le format décimal.

source: Single character (accepts integer or single character string).
fr: Un seul caractère (accepte des entiers ou une chaîne d'un seul caractère).

source: String (converts any Python object using :func:`repr`).
fr: String (convertit n'importe quel objet Python avec :func:`repr`).

source: String (converts any Python object using :func:`str`).
fr: String (convertit n'importe quel objet Python avec :func:`str`).

source: String (converts any Python object using :func:`ascii`).
fr: String (convertit n'importe quel objet Python en utilisant :func:`ascii`).

source: No argument is converted, results in a ``'%'`` character in the result.
fr: Aucun argument n'est converti, donne un caractère de ``'%'`` dans le résultat.

source: The alternate form causes a leading octal specifier (``'0o'``) to be inserted before the first digit.
fr: La forme alternative entraîne l'insertion d'un préfixe octal (``'0o'``) avant le premier chiffre.
