Repository: python/python-docs-fr
Catalog: library/stdtypes.po
Languages: fr

source: Binary operations that mix :class:`set` instances with :class:`frozenset` return the type of the first operand. For example: ``frozenset('ab') | set('bc')`` returns an instance of :class:`frozenset`.
fr: Les opérations binaires mélangeant des instances de :class:`set` et :class:`frozenset` renvoient le type de la première opérande. Par exemple : ``frozenset('ab') | set('bc')`` renvoie une instance de :class:`frozenset`.

source: The following table lists operations available for :class:`set` that do not apply to immutable instances of :class:`frozenset`:
fr: La table suivante liste les opérations disponibles pour les :class:`set` mais qui ne s'appliquent pas aux instances de :class:`frozenset` :

source: Update the set, adding elements from all others.
fr: Met à jour l'ensemble, ajoutant les éléments de tous les autres.

source: Update the set, keeping only elements found in it and all others.
fr: Met à jour l'ensemble, ne gardant que les éléments trouvés dans tous les autres.

source: Update the set, removing elements found in others.
fr: Met à jour l'ensemble, retirant les éléments trouvés dans les autres.

source: Update the set, keeping only elements found in either set, but not in both.
fr: Met à jour le set, ne gardant que les éléments trouvés dans un des ensembles mais pas dans les deux.

source: Add element *elem* to the set.
fr: Ajoute l'élément *elem* au set.

source: Remove element *elem* from the set. Raises :exc:`KeyError` if *elem* is not contained in the set.
fr: Retire l'élément *elem* de l'ensemble. Lève une exception :exc:`KeyError` si *elem* n'est pas dans l'ensemble.

source: Remove element *elem* from the set if it is present.
fr: Retire l'élément *elem* de l'ensemble s'il y est.

source: Remove and return an arbitrary element from the set. Raises :exc:`KeyError` if the set is empty.
fr: Retire et renvoie un élément arbitraire de l'ensemble. Lève une exception :exc:`KeyError` si l'ensemble est vide.

source: Remove all elements from the set.
fr: Supprime tous les éléments du *set*.

source: Note, the non-operator versions of the :meth:`update`, :meth:`intersection_update`, :meth:`difference_update`, and :meth:`symmetric_difference_update` methods will accept any iterable as an argument.
fr: Notez que les versions non-opérateurs des méthodes :meth:`update`, :meth:`intersection_update`, :meth:`difference_update`, et :meth:`symmetric_difference_update` acceptent n'importe quel itérable comme argument.

source: Note, the *elem* argument to the :meth:`__contains__`, :meth:`remove`, and :meth:`discard` methods may be a set. To support searching for an equivalent frozenset, a temporary one is created from *elem*.
fr: Notez que l'argument *elem* des méthodes :meth:`__contains__`, :meth:`remove`, et :meth:`discard` peut être un ensemble. Pour supporter la recherche d'un *frozenset* équivalent, un *frozenset* temporaire est crée depuis *elem*.

source: Mapping Types --- :class:`dict`
fr: Les types de correspondances — :class:`dict`

source: A :term:`mapping` object maps :term:`hashable` values to arbitrary objects. Mappings are mutable objects. There is currently only one standard mapping type, the :dfn:`dictionary`. (For other containers see the built-in :class:`list`, :class:`set`, and :class:`tuple` classes, and the :mod:`collections` module.)
fr: Un objet :term:`mapping` fait correspondre des valeurs :term:`hashable` à des objets arbitraires. Les *mappings* sont des objets muables. Il n'existe pour le moment qu'un type de *mapping* standard, le :dfn:`dictionary`. (Pour les autres conteneurs, voir les types natifs :class:`list`, :class:`set`, et :class:`tuple`, ainsi que le module :mod:`collections`.)

source: A dictionary's keys are *almost* arbitrary values. Values that are not :term:`hashable`, that is, values containing lists, dictionaries or other mutable types (that are compared by value rather than by object identity) may not be used as keys. Numeric types used for keys obey the normal rules for numeric comparison: if two numbers compare equal (such as ``1`` and ``1.0``) then they can be used interchangeably to index the same dictionary entry. (Note however, that since computers store floating-point numbers as approximations it is usually unwise to use them as dictionary keys.)
fr: Les clefs d'un dictionnaire sont *presque* des données arbitraires. Les valeurs qui ne sont pas :term:`hashable`, c'est-à-dire qui contiennent les listes, des dictionnaires ou autre type muable (qui sont comparés par valeur plutôt que par leur identité) ne peuvent pas être utilisées comme clef de dictionnaire. Les types numériques utilisés comme clef obéissent aux règles classiques en ce qui concerne les comparaisons : si deux nombres sont égaux (comme ``1`` et ``1.0``) ils peuvent tous les deux être utilisés pour obtenir la même entrée d'un dictionnaire. (Notez cependant que puisque les ordinateurs stockent les nombres à virgule flottante sous forme d'approximations, il est généralement imprudent de les utiliser comme clefs de dictionnaires.)

source: Dictionaries can be created by placing a comma-separated list of ``key: value`` pairs within braces, for example: ``{'jack': 4098, 'sjoerd': 4127}`` or ``{4098: 'jack', 4127: 'sjoerd'}``, or by the :class:`dict` constructor.
fr: Il est possible de créer des dictionnaires en plaçant entre accolades une liste de paires de ``key: value`` séparés par des virgules, par exemple: ``{'jack': 4098, 'sjoerd': 4127}`` ou ``{4098: 'jack', 4127: 'sjoerd'}``, ou en utilisant le constructeur de :class:`dict`.

source: Return a new dictionary initialized from an optional positional argument and a possibly empty set of keyword arguments.
fr: Renvoie un nouveau dictionnaire initialisé depuis un argument positionnel optionnel, et un ensemble (vide ou non) d'arguments par mot clef.

source: If no positional argument is given, an empty dictionary is created. If a positional argument is given and it is a mapping object, a dictionary is created with the same key-value pairs as the mapping object. Otherwise, the positional argument must be an :term:`iterable` object. Each item in the iterable must itself be an iterable with exactly two objects. The first object of each item becomes a key in the new dictionary, and the second object the corresponding value. If a key occurs more than once, the last value for that key becomes the corresponding value in the new dictionary.
fr: Si aucun argument positionnel n'est donné, un dictionnaire vide est crée. Si un argument positionnel est donné et est un *mapping object*, un dictionnaire est crée avec les mêmes paires de clef-valeurs que le *mapping* donné. Autrement, l'argument positionnel doit être un objet :term:`iterable`. Chaque élément de cet itérable doit lui même être un itérable contenant exactement deux objets. Le premier objet de chaque élément devient la une clef du nouveau dictionnaire, et le second devient sa valeur correspondante. Si une clef apparaît plus d'une fois, la dernière valeur pour cette clef devient la valeur correspondante à cette clef dans le nouveau dictionnaire.

source: If keyword arguments are given, the keyword arguments and their values are added to the dictionary created from the positional argument. If a key being added is already present, the value from the keyword argument replaces the value from the positional argument.
fr: Si des arguments nommés sont donnés, ils sont ajoutés au dictionnaire créé depuis l'argument positionnel. Si une clef est déjà présente, la valeur de l'argument nommé remplace la valeur reçue par l'argument positionnel.

source: To illustrate, the following examples all return a dictionary equal to ``{"one": 1, "two": 2, "three": 3}``::
fr: Typiquement, les exemples suivants renvoient tous un dictionnaire valant ``{"one": 1, "two": 2, "three": 3}`` ::

source: Providing keyword arguments as in the first example only works for keys that are valid Python identifiers. Otherwise, any valid keys can be used.
fr: Fournir les arguments nommés comme dans le premier exemple en fonctionne que pour des clefs qui sont des identifiants valide en Python. Dans les autres cas, toutes les clefs valides sont utilisables.

source: These are the operations that dictionaries support (and therefore, custom mapping types should support too):
fr: Voici les opérations gérées par les dictionnaires, (par conséquent, d'autres types de *mapping* peuvent les gérer aussi) :

source: Return the number of items in the dictionary *d*.
fr: Renvoie le nombre d'éléments dans le dictionnaire *d*.

source: Return the item of *d* with key *key*. Raises a :exc:`KeyError` if *key* is not in the map.
fr: Donne l'élément de *d* dont la clef est *key*. Lève une exception :exc:`KeyError` si *key* n'est pas dans le dictionnaire.

source: If a subclass of dict defines a method :meth:`__missing__` and *key* is not present, the ``d[key]`` operation calls that method with the key *key* as argument. The ``d[key]`` operation then returns or raises whatever is returned or raised by the ``__missing__(key)`` call. No other operations or methods invoke :meth:`__missing__`. If :meth:`__missing__` is not defined, :exc:`KeyError` is raised. :meth:`__missing__` must be a method; it cannot be an instance variable::
fr: Si une sous-classe de *dict* définit une méthode :meth:`__missing__` et que *key* manque, l'opération ``d[key]`` appelle cette méthode avec la clef *key* en argument. L'opération ``d[key]`` renverra la valeur, ou lèvera l'exception renvoyée ou levée par l'appel à ``__missing__(key)``. Aucune autre opération ni méthode n'appellent :meth:`__missing__`. If :meth:`__missing__` n'est pas définie, une exception :exc:`KeyError` est levée. :meth:`__missing__` doit être une méthode; ça ne peut être une variable d'instance ::

source: The example above shows part of the implementation of :class:`collections.Counter`. A different ``__missing__`` method is used by :class:`collections.defaultdict`.
fr: L'exemple ci-dessus montre une partie de l'implémentation de :class:`collections.Counter`. :class:`collections.defaultdict` implémente aussi ``__missing__``.

source: Set ``d[key]`` to *value*.
fr: Assigne ``d[key]`` à *value*.

source: Remove ``d[key]`` from *d*. Raises a :exc:`KeyError` if *key* is not in the map.
fr: Supprime ``d[key]`` de *d*. Lève une exception :exc:`KeyError` si *key* n'est pas dans le dictionnaire.

source: Return ``True`` if *d* has a key *key*, else ``False``.
fr: Renvoie ``True`` si *d* a la clef *key*, sinon ``False``.

source: Equivalent to ``not key in d``.
fr: Équivalent à ``not key in d``.

source: Return an iterator over the keys of the dictionary. This is a shortcut for ``iter(d.keys())``.
fr: Renvoie un itérateur sur les clefs du dictionnaire. C'est un raccourci pour ``iter(d.keys())``.

source: Remove all items from the dictionary.
fr: Supprime tous les éléments du dictionnaire.

source: Return a shallow copy of the dictionary.
fr: Renvoie une copie de surface du dictionnaire.

source: Create a new dictionary with keys from *iterable* and values set to *value*.
fr: Crée un nouveau dictionnaire avec les clefs de *iterable* et les valeurs à *value*.

source: Return the value for *key* if *key* is in the dictionary, else *default*. If *default* is not given, it defaults to ``None``, so that this method never raises a :exc:`KeyError`.
fr: Renvoie la valeur de *key* si *key* est dans le dictionnaire, sinon *default*. Si *default* n'est pas donné, il vaut ``None`` par défaut, de manière à ce que cette méthode ne lève jamais :exc:`KeyError`.

source: Return a new view of the dictionary's items (``(key, value)`` pairs). See the :ref:`documentation of view objects <dict-views>`.
fr: Renvoie une nouvelle vue des éléments du dictionnaire (paires de ``(key, value)``). Voir la :ref:`documentation des vues <dict-views>`.

source: Return a new view of the dictionary's keys. See the :ref:`documentation of view objects <dict-views>`.
fr: Renvoie une nouvelle vue des clefs du dictionnaire. Voir la :ref:`documentation des vues <dict-views>`.

source: If *key* is in the dictionary, remove it and return its value, else return *default*. If *default* is not given and *key* is not in the dictionary, a :exc:`KeyError` is raised.
fr: Si *key* est dans le dictionnaire elle est supprimée et sa valeur est renvoyée, sinon renvoie *default*. Si *default* n'est pas donné et que *key* n'est pas dans le dictionnaire, une :exc:`KeyError` est levée.

source: Remove and return a ``(key, value)`` pair from the dictionary. Pairs are returned in :abbr:`LIFO (last-in, first-out)` order.
fr: Supprime et renvoie une paire ``(key, value)`` du dictionnaire. Les paires sont renvoyées dans un ordre :abbr:`LIFO (dernière entrée, prenière sortie)`.

source: :meth:`popitem` is useful to destructively iterate over a dictionary, as often used in set algorithms. If the dictionary is empty, calling :meth:`popitem` raises a :exc:`KeyError`.
fr: :meth:`popitem` est pratique pour itérer un dictionnaire de manière destructive, comme souvent dans les algorithmes sur les ensembles. Si le dictionnaire est vide, appeler :meth:`popitem` lève une :exc:`KeyError`.

source: LIFO order is now guaranteed. In prior versions, :meth:`popitem` would return an arbitrary key/value pair.
fr: L'ordre "dernier entré, premier sorti" (LIFO) est désormais assuré. Dans les versions précédentes, :meth:`popitem` renvoyait une paire clé/valeur arbitraire.

source: If *key* is in the dictionary, return its value. If not, insert *key* with a value of *default* and return *default*. *default* defaults to ``None``.
fr: Si *key* est dans le dictionnaire, sa valeur est renvoyée. Sinon, insère *key* avec comme valeur *default* et renvoie *default*. *default* vaut ``None`` par défaut.

source: Update the dictionary with the key/value pairs from *other*, overwriting existing keys. Return ``None``.
fr: Met à jour le dictionnaire avec les paires de clef/valeur d'*other*, écrasant les clefs existantes. Renvoie ``None``.

source: :meth:`update` accepts either another dictionary object or an iterable of key/value pairs (as tuples or other iterables of length two). If keyword arguments are specified, the dictionary is then updated with those key/value pairs: ``d.update(red=1, blue=2)``.
fr: :meth:`update` accepte aussi bien un autre dictionnaire qu'un itérable de clef/valeurs (sous forme de *tuples* ou autre itérables de longueur deux). Si des paramètres par mot-clef sont donnés, le dictionnaire et ensuite mis à jour avec ces pairs de clef/valeurs : ``d.update(red=1, blue=2)``.

source: Return a new view of the dictionary's values. See the :ref:`documentation of view objects <dict-views>`.
fr: Renvoie une nouvelle vue des valeurs du dictionnaire. Voir la :ref:`documentation des vues <dict-views>`.

source: Dictionaries preserve insertion order. Note that updating a key does not affect the order. Keys added after deletion are inserted at the end. ::
fr: Les dictionnaires préservent l'ordre des insertions. Notez que modifier une clé n'affecte pas l'ordre. Les clés ajoutées après un effacement sont insérées à la fin. ::

source: Dictionary order is guaranteed to be insertion order. This behavior was an implementation detail of CPython from 3.6.
fr: L'ordre d'un dictionnaire est toujours l'ordre des insertions. Ce comportement était un détail d'implémentation de CPython depuis la version 3.6.

source: :class:`types.MappingProxyType` can be used to create a read-only view of a :class:`dict`.
fr: :class:`types.MappingProxyType` peut être utilisé pour créer une vue en lecture seule d'un :class:`dict`.

source: Dictionary view objects
fr: Les vues de dictionnaires

source: The objects returned by :meth:`dict.keys`, :meth:`dict.values` and :meth:`dict.items` are *view objects*. They provide a dynamic view on the dictionary's entries, which means that when the dictionary changes, the view reflects these changes.
fr: Les objets renvoyés par :meth:`dict.keys`, :meth:`dict.values` et :meth:`dict.items` sont des *vues*. Ils fournissent une vue dynamique des éléments du dictionnaire, ce qui signifie que si le dictionnaire change, la vue reflète ces changements.

source: Dictionary views can be iterated over to yield their respective data, and support membership tests:
fr: Les vues de dictionnaires peuvent être itérées et ainsi renvoyer les données du dictionnaire, elle gèrent aussi les tests de présence :

source: Return the number of entries in the dictionary.
fr: Renvoie le nombre d'entrées du dictionnaire.

source: Return an iterator over the keys, values or items (represented as tuples of ``(key, value)``) in the dictionary.
fr: Renvoie un itérateur sur les clefs, les valeurs, ou les éléments (représentés par des *tuples* de ``(key, value)`` du dictionnaire.

source: Keys and values are iterated over in insertion order. This allows the creation of ``(value, key)`` pairs using :func:`zip`: ``pairs = zip(d.values(), d.keys())``. Another way to create the same list is ``pairs = [(v, k) for (k, v) in d.items()]``.
fr: Les clefs et les valeurs sont itérées dans l'ordre de leur insertion. Ceci permet la création de paires de ``(key, value)`` en utilisant :func:`zip` : ``pairs = zip(d.values(), d.keys())``. Un autre moyen de construire la même liste est ``pairs = [(v, k) for (k, v) in d.items()]``.

source: Iterating views while adding or deleting entries in the dictionary may raise a :exc:`RuntimeError` or fail to iterate over all entries.
fr: Parcourir des vues tout en ajoutant ou supprimant des entrées dans un dictionnaire peut lever une :exc:`RuntimeError` ou ne pas fournir toutes les entrées.

source: Dictionary order is guaranteed to be insertion order.
fr: L'ordre d'un dictionnaire est toujours l'ordre des insertions.

source: Return ``True`` if *x* is in the underlying dictionary's keys, values or items (in the latter case, *x* should be a ``(key, value)`` tuple).
fr: Renvoie ``True`` si *x* est dans les clefs, les valeurs, ou les éléments du dictionnaire sous-jacent (dans le dernier cas, *x* doit être un *tuple* ``(key, value)``).

source: Keys views are set-like since their entries are unique and hashable. If all values are hashable, so that ``(key, value)`` pairs are unique and hashable, then the items view is also set-like. (Values views are not treated as set-like since the entries are generally not unique.) For set-like views, all of the operations defined for the abstract base class :class:`collections.abc.Set` are available (for example, ``==``, ``<``, or ``^``).
fr: Les vues de clefs sont semblables à des ensembles puisque leurs entrées sont uniques et hachables. Si toutes les valeurs sont hachables, et qu'ainsi toutes les paires de ``(key, value`` sont uniques et hachables, alors la vue donnée par *items()* est aussi semblable à un ensemble. (Les vues données par *items()* ne sont généralement pas traitées comme des ensembles, car leurs valeurs ne sont généralement pas uniques.) Pour les vues semblables aux ensembles, toutes les opérations définies dans la classe de base abstraite :class:`collections.abc.Set` sont disponibles (comme ``==``, ``<``, ou ``^``).

source: An example of dictionary view usage::
fr: Exemple d'utilisation de vue de dictionnaire ::

source: Context Manager Types
fr: Le type gestionnaire de contexte

source: Python's :keyword:`with` statement supports the concept of a runtime context defined by a context manager. This is implemented using a pair of methods that allow user-defined classes to define a runtime context that is entered before the statement body is executed and exited when the statement ends:
fr: L'instruction :keyword:`with` permet l'existence de contextes définis à l'exécution par des gestionnaires de contextes. C'est implémenté via une paire de méthodes permettant de définir un contexte, à l'exécution, qui est entré avant l'exécution du corps de l'instruction, et qui est quitté lorsque l'instruction se termine :

source: Enter the runtime context and return either this object or another object related to the runtime context. The value returned by this method is bound to the identifier in the :keyword:`!as` clause of :keyword:`with` statements using this context manager.
fr: Entre dans le contexte à l'exécution, soit se renvoyant lui-même, soit en renvoyant un autre objet en lien avec ce contexte. La valeur renvoyée par cette méthode est liée à l'identifiant donné au :keyword:`!as` de l'instruction :keyword:`with` utilisant ce gestionnaire de contexte.

source: An example of a context manager that returns itself is a :term:`file object`. File objects return themselves from __enter__() to allow :func:`open` to be used as the context expression in a :keyword:`with` statement.
fr: Un exemple de gestionnaire de contexte se renvoyant lui-même est :term:`file object`. Les *file objects* se renvoient eux-même depuis ``__enter__()`` et autorisent :func:`open` à être utilisé comme contexte à une instruction :keyword:`with`.

source: An example of a context manager that returns a related object is the one returned by :func:`decimal.localcontext`. These managers set the active decimal context to a copy of the original decimal context and then return the copy. This allows changes to be made to the current decimal context in the body of the :keyword:`with` statement without affecting code outside the :keyword:`!with` statement.
fr: Un exemple de gestionnaire de contexte renvoyant un objet connexe est celui renvoyé par :func:`decimal.localcontext`. Ces gestionnaires remplacent le contexte décimal courant par une copie de l'original, copie qui est renvoyée. Ça permet de changer le contexte courant dans le corps du :keyword:`with` sans affecter le code en dehors de l'instruction :keyword:`!with`.

source: Exit the runtime context and return a Boolean flag indicating if any exception that occurred should be suppressed. If an exception occurred while executing the body of the :keyword:`with` statement, the arguments contain the exception type, value and traceback information. Otherwise, all three arguments are ``None``.
fr: Sort du contexte et renvoie un booléen indiquant si une exception survenue doit être supprimée. Si une exception est survenue lors de l'exécution du corps de l'instruction :keyword:`with`, les arguments contiennent le type de l'exception, sa valeur, et la trace de la pile (*traceback*). Sinon les trois arguments valent ``None``.

source: Returning a true value from this method will cause the :keyword:`with` statement to suppress the exception and continue execution with the statement immediately following the :keyword:`!with` statement. Otherwise the exception continues propagating after this method has finished executing. Exceptions that occur during execution of this method will replace any exception that occurred in the body of the :keyword:`!with` statement.
fr: L'instruction :keyword:`with` inhibera l'exception si cette méthode renvoie une valeur vraie, l'exécution continuera ainsi à l'instruction suivant immédiatement l'instruction :keyword:`!with`. Sinon, l'exception continuera de se propager après la fin de cette méthode. Les exceptions se produisant pendant l'exécution de cette méthode remplaceront toute exception qui s'est produite dans le corps du :keyword:`!with`.
