Repository: python/python-docs-fr
Catalog: library/stdtypes.po
Languages: fr

source: if concatenating :class:`str` objects, you can build a list and use :meth:`str.join` at the end or else write to an :class:`io.StringIO` instance and retrieve its value when complete
fr: si vous concaténez des :class:`str`, vous pouvez construire une liste puis utiliser :meth:`str.join` à la fin, ou bien écrire dans une instance de :class:`io.StringIO` et récupérer sa valeur lorsque vous avez terminé

source: if concatenating :class:`bytes` objects, you can similarly use :meth:`bytes.join` or :class:`io.BytesIO`, or you can do in-place concatenation with a :class:`bytearray` object. :class:`bytearray` objects are mutable and have an efficient overallocation mechanism
fr: si vous concaténez des :class:`bytes`, vous pouvez aussi utiliser :meth:`bytes.join` ou :class:`io.BytesIO`, ou vous pouvez faire les concaténation sur place avec un objet :class:`bytearray`. Les objets :class:`bytearray` sont muables et ont un mécanisme de sur-allocation efficace

source: if concatenating :class:`tuple` objects, extend a :class:`list` instead
fr: si vous concaténez des :class:`tuple`, utilisez plutôt *extend* sur une :class:`list`

source: for other types, investigate the relevant class documentation
fr: pour d'autres types, cherchez dans la documentation de la classe concernée

source: Some sequence types (such as :class:`range`) only support item sequences that follow specific patterns, and hence don't support sequence concatenation or repetition.
fr: Certains types séquentiels (tels que :class:`range`) ne supportent que des séquences qui suivent des modèles spécifiques, et donc ne prennent pas en charge la concaténation ou la répétition.

source: ``index`` raises :exc:`ValueError` when *x* is not found in *s*. Not all implementations support passing the additional arguments *i* and *j*. These arguments allow efficient searching of subsections of the sequence. Passing the extra arguments is roughly equivalent to using ``s[i:j].index(x)``, only without copying any data and with the returned index being relative to the start of the sequence rather than the start of the slice.
fr: ``index`` lève une exception :exc:`ValueError` quand *x* ne se trouve pas dans *s*. Toutes les implémentations ne gèrent pas les deux paramètres supplémentaires *i* et *j*. Ces deux arguments permettent de chercher efficacement dans une sous-séquence de la séquence. Donner ces arguments est plus ou moins équivalent à ``s[i:j].index(x)``, sans copier les données ; l'indice renvoyé alors relatif au début de la séquence plutôt qu'au début de la tranche.

source: Immutable Sequence Types
fr: Types de séquences immuables

source: The only operation that immutable sequence types generally implement that is not also implemented by mutable sequence types is support for the :func:`hash` built-in.
fr: La seule opération que les types de séquences immuables implémentent qui n'est pas implémentée par les types de séquences muables est le support de la fonction native :func:`hash`.

source: This support allows immutable sequences, such as :class:`tuple` instances, to be used as :class:`dict` keys and stored in :class:`set` and :class:`frozenset` instances.
fr: Cette implémentation permet d'utiliser des séquences immuables, comme les instances de :class:`tuple`, en tant que clés de :class:`dict` et stockées dans les instances de :class:`set` et :class:`frozenset`.

source: Attempting to hash an immutable sequence that contains unhashable values will result in :exc:`TypeError`.
fr: Essayer de hacher une séquence immuable qui contient des valeurs non-hachables lèvera une :exc:`TypeError`.

source: Mutable Sequence Types
fr: Types de séquences muables

source: The operations in the following table are defined on mutable sequence types. The :class:`collections.abc.MutableSequence` ABC is provided to make it easier to correctly implement these operations on custom sequence types.
fr: Les opérations dans le tableau ci-dessous sont définies sur les types de séquences muables. La classe de base abstraite :class:`collections.abc.MutableSequence` est prévue pour faciliter l'implémentation correcte de ces opérations sur les types de séquence personnalisées.

source: In the table *s* is an instance of a mutable sequence type, *t* is any iterable object and *x* is an arbitrary object that meets any type and value restrictions imposed by *s* (for example, :class:`bytearray` only accepts integers that meet the value restriction ``0 <= x <= 255``).
fr: Dans le tableau *s* est une instance d'un type de séquence muable, *t* est un objet itérable et *x* est un objet arbitraire qui répond à toutes les restrictions de type et de valeur imposées par *s* (par exemple, :class:`bytearray` accepte uniquement des nombres entiers qui répondent à la restriction de la valeur ``0 <= x <= 255``).

source: item *i* of *s* is replaced by *x*
fr: élément *i* de *s* est remplacé par *x*

source: slice of *s* from *i* to *j* is replaced by the contents of the iterable *t*
fr: tranche de *s* de *i* à *j* est remplacée par le contenu de l'itérable *t*

source: same as ``s[i:j] = []``
fr: identique à ``s[i:j] = []``

source: the elements of ``s[i:j:k]`` are replaced by those of *t*
fr: les éléments de ``s[i:j:k]`` sont remplacés par ceux de *t*

source: removes the elements of ``s[i:j:k]`` from the list
fr: supprime les éléments de ``s[i:j:k]`` de la liste

source: appends *x* to the end of the sequence (same as ``s[len(s):len(s)] = [x]``)
fr: ajoute *x* à la fin de la séquence (identique à ``s[len(s):len(s)] = [x]``)

source: removes all items from *s* (same as ``del s[:]``)
fr: supprime tous les éléments de *s* (identique à ``del s[:]``)

source: creates a shallow copy of *s* (same as ``s[:]``)
fr: crée une copie superficielle de *s* (identique à ``s[:]``)

source: extends *s* with the contents of *t* (for the most part the same as ``s[len(s):len(s)] = t``)
fr: étend *s* avec le contenu de *t* (proche de ``s[len(s):len(s)] = t``)

source: updates *s* with its contents repeated *n* times
fr: met à jour *s* avec son contenu répété *n* fois

source: inserts *x* into *s* at the index given by *i* (same as ``s[i:i] = [x]``)
fr: insère *x* dans *s* à l'index donné par *i* (identique à ``s[i:i] = [x]``)

source: retrieves the item at *i* and also removes it from *s*
fr: récupère l'élément à *i* et le supprime de *s*

source: remove the first item from *s* where ``s[i]`` is equal to *x*
fr: supprime le premier élément de *s* pour lequel ``s[i]`` est égal à *x*

source: reverses the items of *s* in place
fr: inverse sur place les éléments de *s*

source: *t* must have the same length as the slice it is replacing.
fr: *t* doit avoir la même longueur que la tranche qu'il remplace.

source: The optional argument *i* defaults to ``-1``, so that by default the last item is removed and returned.
fr: L'argument optionnel *i* vaut ``-1`` par défaut, afin que, par défaut, le dernier élément soit retiré et renvoyé.

source: The :meth:`reverse` method modifies the sequence in place for economy of space when reversing a large sequence. To remind users that it operates by side effect, it does not return the reversed sequence.
fr: La méthode :meth:`reverse` modifie les séquence sur place pour économiser de l'espace lors du traitement de grandes séquences. Pour rappeler aux utilisateurs qu'elle a un effet de bord, elle ne renvoie pas la séquence inversée.

source: :meth:`clear` and :meth:`!copy` methods.
fr: méthodes :meth:`clear` et :meth:`!copy`.

source: The value *n* is an integer, or an object implementing :meth:`~object.__index__`. Zero and negative values of *n* clear the sequence. Items in the sequence are not copied; they are referenced multiple times, as explained for ``s * n`` under :ref:`typesseq-common`.
fr: La valeur *n* est un entier, ou un objet implémentant :meth:`~object.__index__`. Zéro et les valeurs négatives de *n* permettent d'effacer la séquence. Les éléments dans la séquence ne sont pas copiés ; ils sont référencés plusieurs fois, comme expliqué pour ``s * n`` dans :ref:`typesseq-common`.

source: Lists
fr: Listes

source: Lists are mutable sequences, typically used to store collections of homogeneous items (where the precise degree of similarity will vary by application).
fr: Les listes sont des séquences muables, généralement utilisées pour stocker des collections d'éléments homogènes (où le degré de similitude variera selon l'usage).

source: Lists may be constructed in several ways:
fr: Les listes peuvent être construites de différentes manières :

source: Using a pair of square brackets to denote the empty list: ``[]``
fr: En utilisant une paire de crochets pour indiquer une liste vide : ``[]``

source: Using square brackets, separating items with commas: ``[a]``, ``[a, b, c]``
fr: Au moyen de crochets, séparant les éléments par des virgules : ``[a]``, ``[a, b, c]``

source: Using a list comprehension: ``[x for x in iterable]``
fr: En utilisant une liste en compréhension : ``[x for x in iterable]``

source: Using the type constructor: ``list()`` or ``list(iterable)``
fr: En utilisant le constructeur du type : ``list()`` ou ``list(iterable)``

source: The constructor builds a list whose items are the same and in the same order as *iterable*'s items. *iterable* may be either a sequence, a container that supports iteration, or an iterator object. If *iterable* is already a list, a copy is made and returned, similar to ``iterable[:]``. For example, ``list('abc')`` returns ``['a', 'b', 'c']`` and ``list( (1, 2, 3) )`` returns ``[1, 2, 3]``. If no argument is given, the constructor creates a new empty list, ``[]``.
fr: Le constructeur crée une liste dont les éléments sont les mêmes et dans le même ordre que les éléments d'*iterable*. *iterable* peut être soit une séquence, un conteneur qui supporte l'itération, soit un itérateur. Si *iterable* est déjà une liste, une copie est faite et renvoyée, comme avec ``iterable[:]``. Par exemple, ``list('abc')`` renvoie ``['a', 'b', 'c']`` et ``list( (1, 2, 3) )`` renvoie ``[1, 2, 3]``. Si aucun argument est donné, le constructeur crée une nouvelle liste vide, ``[]``.

source: Many other operations also produce lists, including the :func:`sorted` built-in.
fr: De nombreuses autres opérations produisent des listes, tel que la fonction native :func:`sorted`.

source: Lists implement all of the :ref:`common <typesseq-common>` and :ref:`mutable <typesseq-mutable>` sequence operations. Lists also provide the following additional method:
fr: Les listes supportent toutes les opérations des séquences :ref:`communes <typesseq-common>` et :ref:`muables <typesseq-mutable>`. Les listes fournissent également la méthode supplémentaire suivante :

source: This method sorts the list in place, using only ``<`` comparisons between items. Exceptions are not suppressed - if any comparison operations fail, the entire sort operation will fail (and the list will likely be left in a partially modified state).
fr: Cette méthode trie la liste sur place, en utilisant uniquement des comparaisons ``<`` entre les éléments. Les exceptions ne sont pas supprimées si n'importe quelle opération de comparaison échoue, le tri échouera (et la liste sera probablement laissée dans un état partiellement modifié).

source: :meth:`sort` accepts two arguments that can only be passed by keyword (:ref:`keyword-only arguments <keyword-only_parameter>`):
fr: :meth:`sort` accepte deux arguments qui ne peuvent être fournis que par mot-clé (:ref:`keyword-only arguments <keyword-only_parameter>`):

source: *key* specifies a function of one argument that is used to extract a comparison key from each list element (for example, ``key=str.lower``). The key corresponding to each item in the list is calculated once and then used for the entire sorting process. The default value of ``None`` means that list items are sorted directly without calculating a separate key value.
fr: *key* spécifie une fonction d'un argument utilisée pour extraire une clé de comparaison de chaque élément de la liste (par exemple, ``key=str.lower``). La clé correspondant à chaque élément de la liste n'est calculée qu'une seule fois, puis utilisée durant tout le processus. La valeur par défaut, ``None``, signifie que les éléments sont triés directement sans en calculer une valeur "clé" séparée.

source: The :func:`functools.cmp_to_key` utility is available to convert a 2.x style *cmp* function to a *key* function.
fr: La fonction utilitaire :func:`functools.cmp_to_key` est disponible pour convertir une fonction *cmp* du style 2.x à une fonction *key*.

source: *reverse* is a boolean value. If set to ``True``, then the list elements are sorted as if each comparison were reversed.
fr: *reverse*, une valeur booléenne. Si elle est ``True``, la liste d'éléments est triée comme si toutes les comparaisons étaient inversées.

source: This method modifies the sequence in place for economy of space when sorting a large sequence. To remind users that it operates by side effect, it does not return the sorted sequence (use :func:`sorted` to explicitly request a new sorted list instance).
fr: Cette méthode modifie la séquence sur place pour économiser de l'espace lors du tri de grandes séquences. Pour rappeler aux utilisateurs cet effet de bord, elle ne renvoie pas la séquence triée (utilisez :func:`sorted` pour demander explicitement une nouvelle instance de liste triée).

source: The :meth:`sort` method is guaranteed to be stable. A sort is stable if it guarantees not to change the relative order of elements that compare equal --- this is helpful for sorting in multiple passes (for example, sort by department, then by salary grade).
fr: La méthode :meth:`sort` est garantie stable. Un tri est stable s'il garantit de ne pas changer l'ordre relatif des éléments égaux --- cela est utile pour trier en plusieurs passes (par exemple, trier par département, puis par niveau de salaire).

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
fr: Pour des exemples de tris et un bref tutoriel, consultez :ref:`sortinghowto`.

source: While a list is being sorted, the effect of attempting to mutate, or even inspect, the list is undefined. The C implementation of Python makes the list appear empty for the duration, and raises :exc:`ValueError` if it can detect that the list has been mutated during a sort.
fr: L'effet de tenter de modifier, ou même inspecter la liste pendant qu'elle se fait trier est indéfini. L'implémentation C de Python fait apparaître la liste comme vide pour la durée du traitement, et lève :exc:`ValueError` si elle détecte que la liste a été modifiée au cours du tri.

source: Tuples are immutable sequences, typically used to store collections of heterogeneous data (such as the 2-tuples produced by the :func:`enumerate` built-in). Tuples are also used for cases where an immutable sequence of homogeneous data is needed (such as allowing storage in a :class:`set` or :class:`dict` instance).
fr: Les tuples (*n-uplets* en français) sont des séquences immuables, généralement utilisées pour stocker des collections de données hétérogènes (tels que les tuples de deux éléments produits par la fonction native :func:`enumerate`). Les tuples sont également utilisés dans des cas où une séquence homogène et immuable de données est nécessaire (pour, par exemple, les stocker dans un :class:`set` ou un :class:`dict`).

source: Tuples may be constructed in a number of ways:
fr: Les tuples peuvent être construits de différentes façons :

source: Using a pair of parentheses to denote the empty tuple: ``()``
fr: En utilisant une paire de parenthèses pour désigner le tuple vide : ``()``

source: Using a trailing comma for a singleton tuple: ``a,`` or ``(a,)``
fr: En utilisant une virgule, pour créer un tuple d'un élément : ``a,`` ou ``(a,)``

source: Separating items with commas: ``a, b, c`` or ``(a, b, c)``
fr: En séparant les éléments avec des virgules : ``a, b, c`` ou ``(a, b, c)``

source: Using the :func:`tuple` built-in: ``tuple()`` or ``tuple(iterable)``
fr: En utilisant la fonction native :func:`tuple` : ``tuple()`` ou ``tuple(iterable)``

source: The constructor builds a tuple whose items are the same and in the same order as *iterable*'s items. *iterable* may be either a sequence, a container that supports iteration, or an iterator object. If *iterable* is already a tuple, it is returned unchanged. For example, ``tuple('abc')`` returns ``('a', 'b', 'c')`` and ``tuple( [1, 2, 3] )`` returns ``(1, 2, 3)``. If no argument is given, the constructor creates a new empty tuple, ``()``.
fr: Le constructeur construit un tuple dont les éléments sont les mêmes et dans le même ordre que les éléments de *iterable*. *iterable* peut être soit une séquence, un conteneur qui supporte l'itération, soit un itérateur. Si *iterable* est déjà un tuple, il est renvoyé inchangé. Par exemple, ``tuple('abc')`` renvoie ``('a', 'b', 'c')`` et ``tuple( [1, 2, 3] )`` renvoie ``(1, 2, 3)``. Si aucun argument est donné, le constructeur crée un nouveau tuple vide, ``()``.

source: Note that it is actually the comma which makes a tuple, not the parentheses. The parentheses are optional, except in the empty tuple case, or when they are needed to avoid syntactic ambiguity. For example, ``f(a, b, c)`` is a function call with three arguments, while ``f((a, b, c))`` is a function call with a 3-tuple as the sole argument.
fr: Notez que c'est en fait la virgule qui fait un tuple et non les parenthèses. Les parenthèses sont facultatives, sauf dans le cas du tuple vide, ou lorsqu'elles sont nécessaires pour éviter l'ambiguïté syntaxique. Par exemple, ``f(a, b, c)`` est un appel de fonction avec trois arguments, alors que ``f((a, b, c))`` est un appel de fonction avec un tuple de trois éléments comme unique argument.

source: Tuples implement all of the :ref:`common <typesseq-common>` sequence operations.
fr: Les tuples implémentent toutes les opérations :ref:`communes <typesseq-common>` des séquences.

source: For heterogeneous collections of data where access by name is clearer than access by index, :func:`collections.namedtuple` may be a more appropriate choice than a simple tuple object.
fr: Pour les collections hétérogènes de données où l'accès par nom est plus clair que l'accès par index, :func:`collections.namedtuple` peut être un choix plus approprié qu'un simple tuple.

source: The :class:`range` type represents an immutable sequence of numbers and is commonly used for looping a specific number of times in :keyword:`for` loops.
fr: Le type :class:`range` représente une séquence immuable de nombres et est couramment utilisé pour itérer un certain nombre de fois dans les boucles :keyword:`for`.

source: The arguments to the range constructor must be integers (either built-in :class:`int` or any object that implements the ``__index__`` special method). If the *step* argument is omitted, it defaults to ``1``. If the *start* argument is omitted, it defaults to ``0``. If *step* is zero, :exc:`ValueError` is raised.
fr: Les arguments du constructeur de *range* doivent être des entiers (des :class:`int` ou tout autre objet qui implémente la méthode spéciale ``__index__``). La valeur par défaut de l'argument *step* est ``1``. La valeur par défaut de l'argument *start* est ``0``. Si *step* est égal à zéro, une exception :exc:`ValueError` est levée.

source: For a positive *step*, the contents of a range ``r`` are determined by the formula ``r[i] = start + step*i`` where ``i >= 0`` and ``r[i] < stop``.
fr: Pour un *step* positif, le contenu d'un *range* ``r`` est déterminé par la formule ``r[i] = start + step*i`` où ``i >= 0`` et ``r[i] < stop``.

source: For a negative *step*, the contents of the range are still determined by the formula ``r[i] = start + step*i``, but the constraints are ``i >= 0`` and ``r[i] > stop``.
fr: Pour un *step* négatif, le contenu du *range* est toujours déterminé par la formule ``r[i] = start + step*i``, mais les contraintes sont ``i >= 0`` et ``r[i] > stop``.

source: A range object will be empty if ``r[0]`` does not meet the value constraint. Ranges do support negative indices, but these are interpreted as indexing from the end of the sequence determined by the positive indices.
fr: Un objet *range* sera vide si ``r[0]`` ne répond pas à la contrainte de valeur. Les *range* prennent en charge les indices négatifs, mais ceux-ci sont interprétées comme une indexation de la fin de la séquence déterminée par les indices positifs.

source: Ranges containing absolute values larger than :data:`sys.maxsize` are permitted but some features (such as :func:`len`) may raise :exc:`OverflowError`.
fr: Les *range* contenant des valeurs absolues plus grandes que :data:`sys.maxsize` sont permises, mais certaines fonctionnalités (comme :func:`len`) peuvent lever :exc:`OverflowError`.

source: Range examples::
fr: Exemples avec *range* ::

source: Ranges implement all of the :ref:`common <typesseq-common>` sequence operations except concatenation and repetition (due to the fact that range objects can only represent sequences that follow a strict pattern and repetition and concatenation will usually violate that pattern).
fr: *range* implémente toutes les opérations :ref:`communes <typesseq-common>` des séquences sauf la concaténation et la répétition (en raison du fait que les *range* ne peuvent représenter que des séquences qui respectent un motif strict et que la répétition et la concaténation les feraient dévier de ce motif).

source: The value of the *start* parameter (or ``0`` if the parameter was not supplied)
fr: La valeur du paramètre *start* (ou ``0`` si le paramètre n'a pas été fourni)

source: The value of the *stop* parameter
fr: La valeur du paramètre *stop*

source: The value of the *step* parameter (or ``1`` if the parameter was not supplied)
fr: La valeur du paramètre *step* (ou ``1`` si le paramètre n'a pas été fourni)

source: The advantage of the :class:`range` type over a regular :class:`list` or :class:`tuple` is that a :class:`range` object will always take the same (small) amount of memory, no matter the size of the range it represents (as it only stores the ``start``, ``stop`` and ``step`` values, calculating individual items and subranges as needed).
fr: L'avantage du type :class:`range` sur une :class:`list` classique ou :class:`tuple` est qu'un objet :class:`range` prendra toujours la même (petite) quantité de mémoire, peu importe la taille de la gamme qu'elle représente (car elle ne stocke que les valeurs ``start``, ``stop`` et ``step`` , le calcul des éléments individuels et les sous-intervalles au besoin).

source: Range objects implement the :class:`collections.abc.Sequence` ABC, and provide features such as containment tests, element index lookup, slicing and support for negative indices (see :ref:`typesseq`):
fr: Les *range* implémentent la classe de base abstraite :class:`collections.abc.Sequence` et offrent des fonctionnalités telles que les tests d'appartenance (avec *in*), de recherche par index, le tranchage et ils gèrent les indices négatifs (voir :ref:`typesseq`):
