Repository: python/python-docs-fr
Catalog: library/stdtypes.po
Languages: fr

source: :class:`memoryview` objects allow Python code to access the internal data of an object that supports the :ref:`buffer protocol <bufferobjects>` without copying.
fr: Les :class:`memoryview` permettent a du code Python d'accéder sans copie aux données internes d'un objet pendant en charge le :ref:`buffer protocol <bufferobjects>`.

source: Create a :class:`memoryview` that references *obj*. *obj* must support the buffer protocol. Built-in objects that support the buffer protocol include :class:`bytes` and :class:`bytearray`.
fr: Crée une :class:`memoryview` faisant référence à *obj*. *obj* doit supporter le *buffer protocol*. Les objets natifs pendant en charge le *buffer protocol* sont :class:`bytes` et :class:`bytearray`.

source: A :class:`memoryview` has the notion of an *element*, which is the atomic memory unit handled by the originating object *obj*. For many simple types such as :class:`bytes` and :class:`bytearray`, an element is a single byte, but other types such as :class:`array.array` may have bigger elements.
fr: Une :class:`memoryview` a la notion d'*element*, qui est l'unité de mémoire atomique géré par l'objet *obj* d'origine. Pour de nombreux types simples comme :class:`bytes` et :class:`bytearray`, l'élément est l'octet, mais pour d'autres types tels que :class:`array.array` les éléments peuvent être plus grands.

source: ``len(view)`` is equal to the length of :class:`~memoryview.tolist`. If ``view.ndim = 0``, the length is 1. If ``view.ndim = 1``, the length is equal to the number of elements in the view. For higher dimensions, the length is equal to the length of the nested list representation of the view. The :class:`~memoryview.itemsize` attribute will give you the number of bytes in a single element.
fr: ``len(view)`` est égal à la grandeur de :class:`~memoryview.tolist`. Si ``view.ndim = 0``, la longueur vaut 1. Si ``view.ndim = 1``, la longueur est égale au nombre d'éléments de la vue. Pour les dimensions plus grandes, la longueur est égale à la longueur de la sous-liste représentée par la vue. L'attribut :class:`~memoryview.itemsize` vous donnera la taille en octets d'un élément.

source: A :class:`memoryview` supports slicing and indexing to expose its data. One-dimensional slicing will result in a subview::
fr: Une :class:`memoryview` autorise le découpage et l'indiçage de ses données. Découper sur une dimension donnera une sous-vue ::

source: If :class:`~memoryview.format` is one of the native format specifiers from the :mod:`struct` module, indexing with an integer or a tuple of integers is also supported and returns a single *element* with the correct type. One-dimensional memoryviews can be indexed with an integer or a one-integer tuple. Multi-dimensional memoryviews can be indexed with tuples of exactly *ndim* integers where *ndim* is the number of dimensions. Zero-dimensional memoryviews can be indexed with the empty tuple.
fr: Si le :class:`~memoryview.format` est un des formats natif du module :mod:`struct`, indexer avec un nombre entier ou un *tuple* de nombres entiers est aussi autorisé et renvoie un seul *element* du bon type. Les *memoryview* à une dimension peuvent être indexées avec un nombre entier ou un *tuple* d'un entier. Les *memoryview* multi-dimensionnelles peuvent être indexées avec des *tuples* d'exactement *ndim* entiers où *ndim* est le nombre de dimensions. Les *memoryviews* à zéro dimension peuvent être indexées avec un *tuple* vide.

source: Here is an example with a non-byte format::
fr: Voici un exemple avec un autre format que *byte* ::

source: If the underlying object is writable, the memoryview supports one-dimensional slice assignment. Resizing is not allowed::
fr: Si l'objet sous-jacent est accessible en écriture, la *memoryview* autorisera les assignations de tranches à une dimension. Redimensionner n'est cependant pas autorisé ::

source: One-dimensional memoryviews of hashable (read-only) types with formats 'B', 'b' or 'c' are also hashable. The hash is defined as ``hash(m) == hash(m.tobytes())``::
fr: Les *memoryviews* à une dimension de types hachables (lecture seule) avec les formats 'B', 'b', ou 'c' sont aussi hachables. La fonction de hachage est définie tel que ``hash(m) == hash(m.tobytes())`` ::

source: One-dimensional memoryviews can now be sliced. One-dimensional memoryviews with formats 'B', 'b' or 'c' are now hashable.
fr: Les *memoryviews* à une dimension peuvent aussi être découpées. Les *memoryviews* à une dimension avec les formats 'B', 'b', ou 'c' sont maintenant hachables.

source: memoryview is now registered automatically with :class:`collections.abc.Sequence`
fr: *memoryview* est maintenant enregistrée automatiquement avec :class:`collections.abc.Sequence`

source: memoryviews can now be indexed with tuple of integers.
fr: les *memoryviews* peut maintenant être indexées par un n-uplet d'entiers.

source: :class:`memoryview` has several methods:
fr: La :class:`memoryview` dispose de plusieurs méthodes :

source: A memoryview and a :pep:`3118` exporter are equal if their shapes are equivalent and if all corresponding values are equal when the operands' respective format codes are interpreted using :mod:`struct` syntax.
fr: Une *memoryview* et un *exporter* de la :pep:`3118` sont égaux si leurs formes sont équivalentes et si toutes les valeurs correspondantes sont égales, le format respectifs des opérandes étant interprétés en utilisant la syntaxe de :mod:`struct`.

source: For the subset of :mod:`struct` format strings currently supported by :meth:`tolist`, ``v`` and ``w`` are equal if ``v.tolist() == w.tolist()``::
fr: Pour le sous-ensemble des formats de :mod:`struct` supportés par :meth:`tolist`, ``v`` et ``w`` sont égaux si ``v.tolist() ==w.tolist()`` ::

source: If either format string is not supported by the :mod:`struct` module, then the objects will always compare as unequal (even if the format strings and buffer contents are identical)::
fr: Si l'un des format n'est pas supporté par le module de :mod:`struct`, les objets seront toujours considérés différents (même si les formats et les valeurs contenues sont identiques) ::

source: Note that, as with floating point numbers, ``v is w`` does *not* imply ``v == w`` for memoryview objects.
fr: Notez que pour les *memoryview*, comme pour les nombres à virgule flottante, ``v is w`` *n'implique pas* ``v == w``.

source: Previous versions compared the raw memory disregarding the item format and the logical array structure.
fr: Les versions précédentes comparaient la mémoire brute sans tenir compte du format de l'objet ni de sa structure logique.

source: Return the data in the buffer as a bytestring. This is equivalent to calling the :class:`bytes` constructor on the memoryview. ::
fr: Renvoie les données du *buffer* sous forme de *bytes*. Cela équivaut à appeler le constructeur :class:`bytes` sur le *memoryview*. ::

source: For non-contiguous arrays the result is equal to the flattened list representation with all elements converted to bytes. :meth:`tobytes` supports all format strings, including those that are not in :mod:`struct` module syntax.
fr: Pour les listes non contiguës le résultat est égal à la représentation en liste aplatie dont tous les éléments sont convertis en octets. :meth:`tobytes` supporte toutes les chaînes de format, y compris celles qui ne sont pas connues du module :mod:`struct`.

source: Return a string object containing two hexadecimal digits for each byte in the buffer. ::
fr: Renvoie une chaîne contenant deux chiffres hexadécimaux pour chaque octet de la mémoire. ::

source: Return the data in the buffer as a list of elements. ::
fr: Renvoie les données de la mémoire sous la forme d'une liste d'éléments. ::

source: :meth:`tolist` now supports all single character native formats in :mod:`struct` module syntax as well as multi-dimensional representations.
fr: :meth:`tolist` prend désormais en charge tous les formats d'un caractère du module :mod:`struct` ainsi que des représentations multidimensionnelles.

source: Release the underlying buffer exposed by the memoryview object. Many objects take special actions when a view is held on them (for example, a :class:`bytearray` would temporarily forbid resizing); therefore, calling release() is handy to remove these restrictions (and free any dangling resources) as soon as possible.
fr: Libère le tampon sous-jacent exposé par l'objet *memoryview*. Beaucoup d'objets prennent des initiatives particulières lorsqu'ils sont liés à une vue (par exemple, un :class:`bytearray` refusera temporairement de se faire redimensionner). Par conséquent, appeler *release()* peut être pratique pour lever ces restrictions (et en libérer les ressources liées) aussi tôt que possible.

source: After this method has been called, any further operation on the view raises a :class:`ValueError` (except :meth:`release()` itself which can be called multiple times)::
fr: Après le premier appel de cette méthode, toute nouvelle opération sur la *view* lève une :class:`ValueError` (sauf :meth:`release()` elle-même qui peut être appelée plusieurs fois) ::

source: The context management protocol can be used for a similar effect, using the ``with`` statement::
fr: Le protocole de gestion de contexte peut être utilisé pour obtenir un effet similaire, via l'instruction ``with`` ::

source: Cast a memoryview to a new format or shape. *shape* defaults to ``[byte_length//new_itemsize]``, which means that the result view will be one-dimensional. The return value is a new memoryview, but the buffer itself is not copied. Supported casts are 1D -> C-:term:`contiguous` and C-contiguous -> 1D.
fr: Change le format ou la forme d'une *memoryview*. Par défaut *shape* vaut ``[byte_length//new_itemsize]``, ce qui signifie que la vue résultante n'aura qu'une dimension. La valeur renvoyée est une nouvelle *memoryview*, mais la mémoire elle-même n'est pas copiée. Les changements supportés sont une dimension vers C-:term:`contiguous` et *C-contiguous* vers une dimension.

source: The destination format is restricted to a single element native format in :mod:`struct` syntax. One of the formats must be a byte format ('B', 'b' or 'c'). The byte length of the result must be the same as the original length.
fr: Le format de destination est limité à un seul élément natif de la syntaxe du module :mod:`struct`. L'un des formats doit être un *byte* ('B', 'b', ou 'c'). La longueur du résultat en octets doit être la même que la longueur initiale.

source: Cast 1D/long to 1D/unsigned bytes::
fr: Transforme *1D/long* en *1D/unsigned bytes* ::

source: Cast 1D/unsigned bytes to 1D/char::
fr: Transforme *1D/unsigned bytes* en *1D/char* ::

source: Cast 1D/bytes to 3D/ints to 1D/signed char::
fr: Transforme *1D/bytes* en *3D/ints* en *1D/signed char* ::

source: The source format is no longer restricted when casting to a byte view.
fr: Le format de la source n'est plus restreint lors de la transformation vers une vue d'octets.

source: There are also several readonly attributes available:
fr: Plusieurs attributs en lecture seule sont également disponibles :

source: The underlying object of the memoryview::
fr: L'objet sous-jacent de la *memoryview* ::

source: ``nbytes == product(shape) * itemsize == len(m.tobytes())``. This is the amount of space in bytes that the array would use in a contiguous representation. It is not necessarily equal to ``len(m)``::
fr: ``nbytes == product(shape) * itemsize == len(m.tobytes())``. Ceci est l'espace que la liste utiliserait en octets, dans une représentation contiguë. Ce n'est pas nécessairement égale à ``len(m)`` ::

source: Multi-dimensional arrays::
fr: Tableaux multidimensionnels ::

source: A bool indicating whether the memory is read only.
fr: Un booléen indiquant si la mémoire est en lecture seule.

source: A string containing the format (in :mod:`struct` module style) for each element in the view. A memoryview can be created from exporters with arbitrary format strings, but some methods (e.g. :meth:`tolist`) are restricted to native single element formats.
fr: Une chaîne contenant le format (dans le style de :mod:`struct`) pour chaque élément de la vue. Une *memoryview* peut être crée depuis des exportateurs de formats arbitraires, mais certaines méthodes (comme :meth:`tolist`) sont limitées aux formats natifs à un seul élément.

source: format ``'B'`` is now handled according to the struct module syntax. This means that ``memoryview(b'abc')[0] == b'abc'[0] == 97``.
fr: le format ``'B'`` est maintenant traité selon la syntaxe du module *struct*. Cela signifie que ``memoryview(b'abc')[0] == b'abc'[0] == 97``.

source: The size in bytes of each element of the memoryview::
fr: La taille en octets de chaque élément d'une *memoryview* ::

source: An integer indicating how many dimensions of a multi-dimensional array the memory represents.
fr: Un nombre entier indiquant le nombre de dimensions d'un tableau multi-dimensionnel représenté par la *memoryview*.

source: A tuple of integers the length of :attr:`ndim` giving the shape of the memory as an N-dimensional array.
fr: Un *tuple* d'entiers de longueur :attr:`ndim` donnant la forme de la *memoryview* sous forme d'un tableau à N dimensions.

source: An empty tuple instead of ``None`` when ndim = 0.
fr: Un *tuple* vide au lieu de ``None`` lorsque *ndim = 0*.

source: A tuple of integers the length of :attr:`ndim` giving the size in bytes to access each element for each dimension of the array.
fr: Un *tuple* d'entiers de longueur :attr:`ndim` donnant la taille en octets permettant d'accéder à chaque dimensions du tableau.

source: Used internally for PIL-style arrays. The value is informational only.
fr: Détail de l'implémentation des *PIL-style arrays*. La valeur n'est donné qu'a titre d'information.

source: A bool indicating whether the memory is C-:term:`contiguous`.
fr: Un booléen indiquant si la mémoire est C-:term:`contiguous`.

source: A bool indicating whether the memory is Fortran :term:`contiguous`.
fr: Un booléen indiquant si la mémoire est Fortran :term:`contiguous`.

source: A bool indicating whether the memory is :term:`contiguous`.
fr: Un booléen indiquant si la mémoire est :term:`contiguous`.

source: Set Types --- :class:`set`, :class:`frozenset`
fr: Types d'ensembles — :class:`set`, :class:`frozenset`

source: A :dfn:`set` object is an unordered collection of distinct :term:`hashable` objects. Common uses include membership testing, removing duplicates from a sequence, and computing mathematical operations such as intersection, union, difference, and symmetric difference. (For other containers see the built-in :class:`dict`, :class:`list`, and :class:`tuple` classes, and the :mod:`collections` module.)
fr: Un objet :dfn:`set` est une collection non-triée d'objets :term:`hashable` distincts. Les utilisations classiques sont le test d'appartenance, la déduplication d'une séquence, ou le calcul d'opérations mathématiques telles que l'intersection, l'union, la différence, ou la différence symétrique. (Pour les autres conteneurs, voir les classes natives :class:`dict`, :class:`list`, et :class:`tuple`, ainsi que le module :mod:`collections`.)

source: Like other collections, sets support ``x in set``, ``len(set)``, and ``for x in set``. Being an unordered collection, sets do not record element position or order of insertion. Accordingly, sets do not support indexing, slicing, or other sequence-like behavior.
fr: Comme pour les autres collections, les ensembles supportent ``x in set``, ``len(set)``, et ``for x in set``. En tant que collection non-triée, les ensembles n'enregistrent pas la position des éléments ou leur ordre d'insertion. En conséquence, les *sets* n'autorisent ni l'indexation, ni le découpage, ou tout autre comportement de séquence.

source: There are currently two built-in set types, :class:`set` and :class:`frozenset`. The :class:`set` type is mutable --- the contents can be changed using methods like :meth:`~set.add` and :meth:`~set.remove`. Since it is mutable, it has no hash value and cannot be used as either a dictionary key or as an element of another set. The :class:`frozenset` type is immutable and :term:`hashable` --- its contents cannot be altered after it is created; it can therefore be used as a dictionary key or as an element of another set.
fr: Il existe actuellement deux types natifs pour les ensembles, :class:`set` et :class:`fronzenset`. Le type :class:`set` est muable --- son contenu peut changer en utilisant des méthodes comme :meth:`~set.add` et :meth:`~set.remove`. Puisqu'il est muable, il n'a pas de valeur de hachage et ne peut donc pas être utilisé ni comme clef de dictionnaire ni comme élément d'un autre ensemble. Le type :class:`frozenset` est immuable et :term:`hashable` --- son contenu ne peut être modifié après sa création, il peut ainsi être utilisé comme clef de dictionnaire ou élément d'un autre *set*.

source: Non-empty sets (not frozensets) can be created by placing a comma-separated list of elements within braces, for example: ``{'jack', 'sjoerd'}``, in addition to the :class:`set` constructor.
fr: Des *sets* (mais pas des *frozensets*) peuvent être crées par une liste d'éléments séparés par des virgules et entre accolades, par exemple : ``{'jack', 'sjoerd'}``, en plus du constructeur de la classe :class:`set`.

source: The constructors for both classes work the same:
fr: Les constructeurs des deux classes fonctionnent pareil :

source: Return a new set or frozenset object whose elements are taken from *iterable*. The elements of a set must be :term:`hashable`. To represent sets of sets, the inner sets must be :class:`frozenset` objects. If *iterable* is not specified, a new empty set is returned.
fr: Renvoie un nouveau *set* ou *frozenset* dont les éléments viennent d'*iterable*. Les éléments d'un *set* doivent être :term:`hashable`. Pour représenter des *sets* de *sets* les *sets* intérieurs doivent être des :class:`frozenset`. Si *iterable* n'est pas spécifié, un nouveau *set* vide est renvoyé.

source: Instances of :class:`set` and :class:`frozenset` provide the following operations:
fr: Les instances de :class:`set` et :class:`frozenset` fournissent les opérations suivantes :

source: Return the number of elements in set *s* (cardinality of *s*).
fr: Donne le nombre d'éléments dans le *set* *s* (cardinalité de *s*).

source: Test *x* for membership in *s*.
fr: Test d'appartenance de *x* dans *s*.

source: Test *x* for non-membership in *s*.
fr: Test de non-appartenance de *x* dans *s*.

source: Return ``True`` if the set has no elements in common with *other*. Sets are disjoint if and only if their intersection is the empty set.
fr: Renvoie ``True`` si l'ensemble n'a aucun élément en commun avec *other*. Les ensembles sont disjoints si et seulement si leurs intersection est un ensemble vide.

source: Test whether every element in the set is in *other*.
fr: Teste si tous les éléments du set sont dans *other*.

source: Test whether the set is a proper subset of *other*, that is, ``set <= other and set != other``.
fr: Teste si l'ensemble est un sous-ensemble de *other*, c'est-à-dire, ``set <= other and set != other``.

source: Test whether every element in *other* is in the set.
fr: Teste si tous les éléments de *other* sont dans l'ensemble.

source: Test whether the set is a proper superset of *other*, that is, ``set >= other and set != other``.
fr: Teste si l'ensemble est un sur-ensemble de *other*, c'est-à-dire, ``set >= other and set != other``.

source: Return a new set with elements from the set and all others.
fr: Renvoie un nouvel ensemble dont les éléments viennent de l'ensemble et de tous les autres.

source: Return a new set with elements common to the set and all others.
fr: Renvoie un nouvel ensemble dont les éléments sont commun à l'ensemble et à tous les autres.

source: Return a new set with elements in the set that are not in the others.
fr: Renvoie un nouvel ensemble dont les éléments sont dans l'ensemble mais ne sont dans aucun des autres.

source: Return a new set with elements in either the set or *other* but not both.
fr: Renvoie un nouvel ensemble dont les éléments sont soit dans l'ensemble, soit dans les autres, mais pas dans les deux.

source: Return a shallow copy of the set.
fr: Renvoie une copie de surface du dictionnaire.

source: Note, the non-operator versions of :meth:`union`, :meth:`intersection`, :meth:`difference`, and :meth:`symmetric_difference`, :meth:`issubset`, and :meth:`issuperset` methods will accept any iterable as an argument. In contrast, their operator based counterparts require their arguments to be sets. This precludes error-prone constructions like ``set('abc') & 'cbs'`` in favor of the more readable ``set('abc').intersection('cbs')``.
fr: Remarque : Les méthodes :meth:`union`, :meth:`intersection`, :meth:`difference`, et :meth:`symmetric_difference`, :meth:`issubset`, et :meth:`issuperset` acceptent n'importe quel itérable comme argument, contrairement aux opérateurs équivalents qui n'acceptent que des *sets*. Il est donc préférable d'éviter les constructions comme ``set('abc') & 'cbs'``, sources typiques d'erreurs, en faveur d'une construction plus lisible : ``set('abc').intersection('cbs')``.

source: Both :class:`set` and :class:`frozenset` support set to set comparisons. Two sets are equal if and only if every element of each set is contained in the other (each is a subset of the other). A set is less than another set if and only if the first set is a proper subset of the second set (is a subset, but is not equal). A set is greater than another set if and only if the first set is a proper superset of the second set (is a superset, but is not equal).
fr: Les classes :class:`set` et :class:`frozenset` supportent les comparaisons d'ensemble à ensemble. Deux ensembles sont égaux si et seulement si chaque éléments de chaque ensemble est contenu dans l'autre (autrement dit que chaque ensemble est un sous-ensemble de l'autre). Un ensemble est plus petit qu'un autre ensemble si et seulement si le premier est un sous-ensemble du second (un sous-ensemble, mais pas égal). Un ensemble est plus grand qu'un autre ensemble si et seulement si le premier est un sur-ensemble du second (est un sur-ensemble mais n'est pas égal).

source: Instances of :class:`set` are compared to instances of :class:`frozenset` based on their members. For example, ``set('abc') == frozenset('abc')`` returns ``True`` and so does ``set('abc') in set([frozenset('abc')])``.
fr: Les instances de :class:`set` se comparent aux instances de :class:`frozenset` en fonction de leurs membres. Par exemple, ``set('abc') == frozenset('abc')`` envoie ``True``, ainsi que ``set('abc') in set([frozenset('abc')])``.

source: The subset and equality comparisons do not generalize to a total ordering function. For example, any two nonempty disjoint sets are not equal and are not subsets of each other, so *all* of the following return ``False``: ``a<b``, ``a==b``, or ``a>b``.
fr: Les comparaisons de sous-ensemble et d'égalité ne se généralisent pas en une fonction donnant un ordre total. Par exemple, deux ensemble disjoints non vides ne sont ni égaux et ni des sous-ensembles l'un de l'autre, donc toutes ces comparaisons donnent ``False`` : ``a<b``, ``a==b``, et ``a>b``.

source: Since sets only define partial ordering (subset relationships), the output of the :meth:`list.sort` method is undefined for lists of sets.
fr: Puisque les *sets* ne définissent qu'un ordre partiel (par leurs relations de sous-ensembles), la sortie de la méthode :meth:`list.sort` n'est pas définie pour des listes d'ensembles.

source: Set elements, like dictionary keys, must be :term:`hashable`.
fr: Les éléments des *sets*, comme les clefs de dictionnaires, doivent être :term:`hashable`.
