Repository: python/python-docs-fr
Catalog: library/stdtypes.po
Languages: fr

source: Two methods support conversion to and from hexadecimal strings. Since Python's floats are stored internally as binary numbers, converting a float to or from a *decimal* string usually involves a small rounding error. In contrast, hexadecimal strings allow exact representation and specification of floating-point numbers. This can be useful when debugging, and in numerical work.
fr: Deux méthodes prennent en charge la conversion vers et à partir de chaînes hexadécimales. Étant donné que les *float* de Python sont stockés en interne sous forme de nombres binaires, la conversion d'un *float* depuis ou vers une chaine décimale implique généralement une petite erreur d'arrondi. En revanche, les chaînes hexadécimales permettent de représenter exactement les nombres à virgule flottante. Cela peut être utile lors du débogage, et dans un travail numérique.

source: Return a representation of a floating-point number as a hexadecimal string. For finite floating-point numbers, this representation will always include a leading ``0x`` and a trailing ``p`` and exponent.
fr: Donne une représentation d'un nombre à virgule flottante sous forme de chaîne hexadécimale. Pour les nombres à virgule flottante finis, cette représentation comprendra toujours un préfixe ``0x``, un suffixe ``p``, et un exposant.

source: Class method to return the float represented by a hexadecimal string *s*. The string *s* may have leading and trailing whitespace.
fr: Méthode de classe pour obtenir le *float* représenté par une chaîne de caractères hexadécimale *s*. La chaîne *s* peut contenir des espaces avant et après le chiffre.

source: Note that :meth:`float.hex` is an instance method, while :meth:`float.fromhex` is a class method.
fr: Notez que :meth:`float.hex` est une méthode d'instance, alors que :meth:`float.fromhex` est une méthode de classe.

source: A hexadecimal string takes the form::
fr: Une chaîne hexadécimale prend la forme ::

source: where the optional ``sign`` may by either ``+`` or ``-``, ``integer`` and ``fraction`` are strings of hexadecimal digits, and ``exponent`` is a decimal integer with an optional leading sign. Case is not significant, and there must be at least one hexadecimal digit in either the integer or the fraction. This syntax is similar to the syntax specified in section 6.4.4.2 of the C99 standard, and also to the syntax used in Java 1.5 onwards. In particular, the output of :meth:`float.hex` is usable as a hexadecimal floating-point literal in C or Java code, and hexadecimal strings produced by C's ``%a`` format character or Java's ``Double.toHexString`` are accepted by :meth:`float.fromhex`.
fr: où ``sign`` peut être soit ``+`` soit ``-``, ``integer`` et ``fraction`` sont des chaînes de chiffres hexadécimales, et ``exponent`` est un entier décimal facultativement signé. La casse n'est pas significative, et il doit y avoir au moins un chiffre hexadécimal soit dans le nombre entier soit dans la fraction. Cette syntaxe est similaire à la syntaxe spécifiée dans la section 6.4.4.2 de la norme C99, et est aussi la syntaxe utilisée à partir de Java 1.5. En particulier, la sortie de :meth:`float.hex` est utilisable comme valeur hexadécimale à virgule flottante littérale en C ou Java, et des chaînes hexadécimales produites en C via un format ``%a`` ou Java via ``Double.toHexString`` sont acceptées par :meth:`float.fromhex`.

source: Note that the exponent is written in decimal rather than hexadecimal, and that it gives the power of 2 by which to multiply the coefficient. For example, the hexadecimal string ``0x3.a7p10`` represents the floating-point number ``(3 + 10./16 + 7./16**2) * 2.0**10``, or ``3740.0``::
fr: Notez que l'exposant est écrit en décimal plutôt qu'en hexadécimal, et qu'il donne la puissance de 2 par lequel multiplier le coefficient. Par exemple, la chaîne hexadécimale ``0x3.a7p10`` représente le nombre à virgule flottante ``(3 + 10./16 + 7./16**2) *2.0**10``, ou ``3740.0`` ::

source: Applying the reverse conversion to ``3740.0`` gives a different hexadecimal string representing the same number::
fr: L'application de la conversion inverse à ``3740.0`` donne une chaîne hexadécimale différente représentant le même nombre ::

source: Hashing of numeric types
fr: Hachage des types numériques

source: For numbers ``x`` and ``y``, possibly of different types, it's a requirement that ``hash(x) == hash(y)`` whenever ``x == y`` (see the :meth:`__hash__` method documentation for more details). For ease of implementation and efficiency across a variety of numeric types (including :class:`int`, :class:`float`, :class:`decimal.Decimal` and :class:`fractions.Fraction`) Python's hash for numeric types is based on a single mathematical function that's defined for any rational number, and hence applies to all instances of :class:`int` and :class:`fractions.Fraction`, and all finite instances of :class:`float` and :class:`decimal.Decimal`. Essentially, this function is given by reduction modulo ``P`` for a fixed prime ``P``. The value of ``P`` is made available to Python as the :attr:`modulus` attribute of :data:`sys.hash_info`.
fr: Pour deux nombres égaux ``x`` et ``y`` (``x == y``), pouvant être de différents types, il est une requis que ``hash(x) == hash(y)`` (voir la documentation de :meth:`__hash__`). Pour faciliter la mise en œuvre et l'efficacité à travers une variété de types numériques (y compris :class:`int`, :class:`float`, :class:`decimal.Decimal` et :class:`fractions.Fraction`) le hachage en Python pour les types numérique est basé sur une fonction mathématique unique qui est définie pour tout nombre rationnel, et donc s'applique à toutes les instances de :class:`int` et :class:`fractions.Fraction`, et toutes les instances finies de :class:`float` et :class:`decimal.Decimal`. Essentiellement, cette fonction est donnée par la réduction modulo ``P`` pour un nombre ``P`` premier fixe. La valeur de ``P`` est disponible comme attribut :attr:`modulus` de :data:`sys.hash_info`.

source: Currently, the prime used is ``P = 2**31 - 1`` on machines with 32-bit C longs and ``P = 2**61 - 1`` on machines with 64-bit C longs.
fr: Actuellement, le premier utilisé est ``P = 2 ** 31 - 1`` sur des machines dont les *longs* en C sont de 32 bits ``P = 2 ** 61 - 1`` sur des machines dont les *longs* en C font 64 bits.

source: Here are the rules in detail:
fr: Voici les règles en détail :

source: If ``x = m / n`` is a nonnegative rational number and ``n`` is not divisible by ``P``, define ``hash(x)`` as ``m * invmod(n, P) % P``, where ``invmod(n, P)`` gives the inverse of ``n`` modulo ``P``.
fr: Si ``x = m / n`` est un nombre rationnel non négatif et ``n`` n'est pas divisible par ``P``, définir ``hash(x)`` comme ``m * invmod(n, P) % P``, où ``invmod(n, P)`` donne l'inverse de ``n`` modulo ``P``.

source: If ``x = m / n`` is a nonnegative rational number and ``n`` is divisible by ``P`` (but ``m`` is not) then ``n`` has no inverse modulo ``P`` and the rule above doesn't apply; in this case define ``hash(x)`` to be the constant value ``sys.hash_info.inf``.
fr: Si ``x = m / n`` est un nombre rationnel non négatif et ``n`` est divisible par ``P`` (mais ``m`` ne l'est pas), alors ``n`` n'a pas de modulo inverse ``P`` et la règle ci-dessus n'est pas applicable ; dans ce cas définir ``hash(x)`` comme étant la valeur de la constante ``sys.hash_info.inf``.

source: If ``x = m / n`` is a negative rational number define ``hash(x)`` as ``-hash(-x)``. If the resulting hash is ``-1``, replace it with ``-2``.
fr: Si ``x = m / n`` est un nombre rationnel négatif définir ``hash(x)`` comme ``-hash(-x)``. Si le résultat est ``-1``, le remplacer par ``-2``.

source: The particular values ``sys.hash_info.inf``, ``-sys.hash_info.inf`` and ``sys.hash_info.nan`` are used as hash values for positive infinity, negative infinity, or nans (respectively). (All hashable nans have the same hash value.)
fr: Les valeurs particulières ``sys.hash_info.inf``, ``-sys.hash_info.inf`` et ``sys.hash_info.nan`` sont utilisées comme valeurs de hachage pour l'infini positif, l'infini négatif, ou *nans* (respectivement). (Tous les *nans* hachables ont la même valeur de hachage.)

source: For a :class:`complex` number ``z``, the hash values of the real and imaginary parts are combined by computing ``hash(z.real) + sys.hash_info.imag * hash(z.imag)``, reduced modulo ``2**sys.hash_info.width`` so that it lies in ``range(-2**(sys.hash_info.width - 1), 2**(sys.hash_info.width - 1))``. Again, if the result is ``-1``, it's replaced with ``-2``.
fr: Pour un nombre :class:`complexe <complex>` ``z``, les valeurs de hachage des parties réelles et imaginaires sont combinées en calculant ``hash(z.real) + sys.hash_info.imag * hash(z.imag)``, réduit au modulo ``2**sys.hash_info.width`` de sorte qu'il se trouve dans ``range(-2**(sys.hash_info.width - 1), 2**(sys.hash_info.width - 1))``. Encore une fois, si le résultat est ``-1``, il est remplacé par ``-2``.

source: To clarify the above rules, here's some example Python code, equivalent to the built-in hash, for computing the hash of a rational number, :class:`float`, or :class:`complex`::
fr: Afin de clarifier les règles ci-dessus, voici quelques exemples de code Python, équivalent à la fonction de hachage native, pour calculer le hachage d'un nombre rationnel, d'un :class:`float`, ou d'un :class:`complex` ::

source: Iterator Types
fr: Les types itérateurs

source: Python supports a concept of iteration over containers. This is implemented using two distinct methods; these are used to allow user-defined classes to support iteration. Sequences, described below in more detail, always support the iteration methods.
fr: Python supporte un concept d'itération sur les conteneurs. C'est implémenté en utilisant deux méthodes distinctes qui permettent aux classes définies par l'utilisateur de devenir itérables. Les séquences, décrites plus bas en détail, supportent toujours les méthodes d'itération.

source: One method needs to be defined for container objects to provide iteration support:
fr: Une méthode doit être définie afin que les objets conteneurs supportent l'itération :

source: Return an iterator object. The object is required to support the iterator protocol described below. If a container supports different types of iteration, additional methods can be provided to specifically request iterators for those iteration types. (An example of an object supporting multiple forms of iteration would be a tree structure which supports both breadth-first and depth-first traversal.) This method corresponds to the :c:member:`~PyTypeObject.tp_iter` slot of the type structure for Python objects in the Python/C API.
fr: Donne un objet itérateur. L'objet doit implémenter le protocole d'itération décrit ci-dessous. Si un conteneur prend en charge différents types d'itération, d'autres méthodes peuvent être fournies pour obtenir spécifiquement les itérateurs pour ces types d'itération. (Exemple d'un objet supportant plusieurs formes d'itération : une structure d'arbre pouvant être parcourue en largeur ou en profondeur.) Cette méthode correspond à l'attribut :c:member:`~PyTypeObject.tp_iter` de la structure du type des objets Python dans l'API Python/C.

source: The iterator objects themselves are required to support the following two methods, which together form the :dfn:`iterator protocol`:
fr: Les itérateurs eux-mêmes doivent implémenter les deux méthodes suivantes, qui forment ensemble le :dfn:`protocole d'itérateur <iterator protocol>` :

source: Return the iterator object itself. This is required to allow both containers and iterators to be used with the :keyword:`for` and :keyword:`in` statements. This method corresponds to the :c:member:`~PyTypeObject.tp_iter` slot of the type structure for Python objects in the Python/C API.
fr: Donne l'objet itérateur lui-même. Cela est nécessaire pour permettre à la fois à des conteneurs et des itérateurs d'être utilisés avec les instructions :keyword:`for` et :keyword:`in`. Cette méthode correspond à l'attribut :c:member:`~PyTypeObject.tp_iter` de la structure des types des objets Python dans l'API Python/C.

source: Return the next item from the container. If there are no further items, raise the :exc:`StopIteration` exception. This method corresponds to the :c:member:`~PyTypeObject.tp_iternext` slot of the type structure for Python objects in the Python/C API.
fr: Donne l'élément suivant du conteneur. S'il n'y a pas d'autres éléments, une exception :exc:`StopIteration` est levée. Cette méthode correspond à l'attribut :c:member:`PyTypeObject.tp_iternext` de la structure du type des objets Python dans l'API Python/C.

source: Python defines several iterator objects to support iteration over general and specific sequence types, dictionaries, and other more specialized forms. The specific types are not important beyond their implementation of the iterator protocol.
fr: Python définit plusieurs objets itérateurs pour itérer sur les types standards ou spécifiques de séquence, de dictionnaires et d'autres formes plus spécialisées. Les types spécifiques ne sont pas importants au-delà de leur implémentation du protocole d'itération.

source: Once an iterator's :meth:`~iterator.__next__` method raises :exc:`StopIteration`, it must continue to do so on subsequent calls. Implementations that do not obey this property are deemed broken.
fr: Dès que la méthode :meth:`~iterator .__next__` lève une exception :exc:`StopIteration`, elle doit continuer à le faire lors des appels ultérieurs.Implémentations qui ne respectent pas cette propriété sont considérées cassées.

source: Generator Types
fr: Types générateurs

source: Python's :term:`generator`\s provide a convenient way to implement the iterator protocol. If a container object's :meth:`__iter__` method is implemented as a generator, it will automatically return an iterator object (technically, a generator object) supplying the :meth:`__iter__` and :meth:`~generator.__next__` methods. More information about generators can be found in :ref:`the documentation for the yield expression <yieldexpr>`.
fr: Les :term:`generator`\s offrent un moyen pratique d'implémenter le protocole d'itération. Si la méthode :meth:`__iter__` d'un objet conteneur est implémentée comme un générateur, elle renverra automatiquement un objet *iterator* (techniquement, un objet générateur) fournissant les méthodes :meth:`__iter__` et :meth:`~generator.__next__`. Plus d'informations sur les générateurs peuvent être trouvés dans :ref:`la documentation de l'expression yield <yieldexpr>`.

source: Sequence Types --- :class:`list`, :class:`tuple`, :class:`range`
fr: Types séquentiels — :class:`list`, :class:`tuple`, :class:`range`

source: There are three basic sequence types: lists, tuples, and range objects. Additional sequence types tailored for processing of :ref:`binary data <binaryseq>` and :ref:`text strings <textseq>` are described in dedicated sections.
fr: Il existe trois types séquentiels basiques: les *lists*, *tuples* et les *range*. D'autres types séquentiels spécifiques au traitement de :ref:`données binaires <binaryseq>` et :ref:`chaînes de caractères <textseq>` sont décrits dans des sections dédiées.

source: Common Sequence Operations
fr: Opérations communes sur les séquences

source: The operations in the following table are supported by most sequence types, both mutable and immutable. The :class:`collections.abc.Sequence` ABC is provided to make it easier to correctly implement these operations on custom sequence types.
fr: Les opérations dans le tableau ci-dessous sont pris en charge par la plupart des types séquentiels, variables et immuables. La classe de base abstraite :class:`collections.abc.Sequence` est fournie pour aider à implémenter correctement ces opérations sur les types séquentiels personnalisés.

source: This table lists the sequence operations sorted in ascending priority. In the table, *s* and *t* are sequences of the same type, *n*, *i*, *j* and *k* are integers and *x* is an arbitrary object that meets any type and value restrictions imposed by *s*.
fr: Ce tableau répertorie les opérations sur les séquences triées par priorité ascendante. Dans le tableau, *s,* et *t* sont des séquences du même type, *n*, *i*, *j* et *k* sont des nombres entiers et *x* est un objet arbitraire qui répond à toutes les restrictions de type et de valeur imposée par *s*.

source: The ``in`` and ``not in`` operations have the same priorities as the comparison operations. The ``+`` (concatenation) and ``*`` (repetition) operations have the same priority as the corresponding numeric operations. [3]_
fr: Les opérations ``in`` et ``not in`` ont les mêmes priorités que les opérations de comparaison. Les opérations ``+`` (concaténation) et ``*`` (répétition) ont la même priorité que les opérations numériques correspondantes. [3]_

source: ``True`` if an item of *s* is equal to *x*, else ``False``
fr: ``True`` si un élément de *s* est égal à *x*, sinon ``False``

source: ``False`` if an item of *s* is equal to *x*, else ``True``
fr: ``False`` si un élément de *s* est égal à *x*, sinon ``True``

source: the concatenation of *s* and *t*
fr: la concaténation de *s* et *t*

source: equivalent to adding *s* to itself *n* times
fr: équivalent à ajouter *s* *n* fois à lui même

source: *i*\ th item of *s*, origin 0
fr: *i*\ :sup:`e` élément de *s* en commençant par 0

source: slice of *s* from *i* to *j*
fr: tranche (*slice*) de *s* de *i* à *j*

source: slice of *s* from *i* to *j* with step *k*
fr: tranche (*slice*) de *s* de *i* à *j* avec un pas de *k*

source: length of *s*
fr: longueur de *s*

source: smallest item of *s*
fr: plus petit élément de *s*

source: largest item of *s*
fr: plus grand élément de *s*

source: index of the first occurrence of *x* in *s* (at or after index *i* and before index *j*)
fr: indice de la première occurrence de *x* dans *s* (à ou après l'indice *i* et avant indice *j*)

source: total number of occurrences of *x* in *s*
fr: nombre total d'occurrences de *x* dans *s*

source: Sequences of the same type also support comparisons. In particular, tuples and lists are compared lexicographically by comparing corresponding elements. This means that to compare equal, every element must compare equal and the two sequences must be of the same type and have the same length. (For full details see :ref:`comparisons` in the language reference.)
fr: Les séquences du même type supportent également la comparaison. En particulier, les n-uplets et les listes sont comparés lexicographiquement en comparant les éléments correspondants. Cela signifie que pour que deux séquences soit égales, les éléments les constituant doivent être égaux deux à deux et les deux séquences doivent être du même type et de la même longueur. (Pour plus de détails voir :ref:`comparisons` dans la référence du langage.)

source: While the ``in`` and ``not in`` operations are used only for simple containment testing in the general case, some specialised sequences (such as :class:`str`, :class:`bytes` and :class:`bytearray`) also use them for subsequence testing::
fr: Bien que les opérations ``in`` et ``not in`` ne soient généralement utilisées que pour les tests d'appartenance simple, certaines séquences spécialisées (telles que :class:`str`, :class:`bytes` et :class:`bytearray`) les utilisent aussi pour tester l'existence de sous-séquences ::

source: Values of *n* less than ``0`` are treated as ``0`` (which yields an empty sequence of the same type as *s*). Note that items in the sequence *s* are not copied; they are referenced multiple times. This often haunts new Python programmers; consider::
fr: Les valeurs de *n* plus petites que ``0`` sont traitées comme ``0`` (ce qui donne une séquence vide du même type que *s*). Notez que les éléments de *s* ne sont pas copiés ; ils sont référencés plusieurs fois. Cela hante souvent de nouveaux développeurs Python, typiquement ::

source: What has happened is that ``[[]]`` is a one-element list containing an empty list, so all three elements of ``[[]] * 3`` are references to this single empty list. Modifying any of the elements of ``lists`` modifies this single list. You can create a list of different lists this way::
fr: Ce qui est arrivé est que ``[[]]`` est une liste à un élément contenant une liste vide, de sorte que les trois éléments de ``[[]] * 3`` sont des références à cette seule liste vide. Modifier l'un des éléments de ``lists`` modifie cette liste unique. Vous pouvez créer une liste des différentes listes de cette façon ::

source: Further explanation is available in the FAQ entry :ref:`faq-multidimensional-list`.
fr: De plus amples explications sont disponibles dans la FAQ à la question :ref:`faq-multidimensional-list`.

source: If *i* or *j* is negative, the index is relative to the end of sequence *s*: ``len(s) + i`` or ``len(s) + j`` is substituted. But note that ``-0`` is still ``0``.
fr: Si *i* ou *j* sont négatifs, l'indice est relatif à la fin de la séquence *s* : ``len(s) + i`` ou ``len(s) + j`` est substitué. Mais notez que ``-0`` est toujours ``0``.

source: The slice of *s* from *i* to *j* is defined as the sequence of items with index *k* such that ``i <= k < j``. If *i* or *j* is greater than ``len(s)``, use ``len(s)``. If *i* is omitted or ``None``, use ``0``. If *j* is omitted or ``None``, use ``len(s)``. If *i* is greater than or equal to *j*, the slice is empty.
fr: La tranche de *s* de *i* à *j* est définie comme la séquence d'éléments d'indice *k* tels que ``i <= k < j``. Si *i* ou *j* est supérieur à ``len(s)``, ``len(s)`` est utilisé. Si *i* est omis ou ``None``, ``0`` est utilisé. Si *j* est omis ou ``None``, ``len(s)`` est utilisé. Si *i* est supérieure ou égale à *j*, la tranche est vide.

source: The slice of *s* from *i* to *j* with step *k* is defined as the sequence of items with index ``x = i + n*k`` such that ``0 <= n < (j-i)/k``. In other words, the indices are ``i``, ``i+k``, ``i+2*k``, ``i+3*k`` and so on, stopping when *j* is reached (but never including *j*). When *k* is positive, *i* and *j* are reduced to ``len(s)`` if they are greater. When *k* is negative, *i* and *j* are reduced to ``len(s) - 1`` if they are greater. If *i* or *j* are omitted or ``None``, they become "end" values (which end depends on the sign of *k*). Note, *k* cannot be zero. If *k* is ``None``, it is treated like ``1``.
fr: La tranche de *s* de *i* à *j* avec un pas de *k* est définie comme la séquence d'éléments d'indice ``x = i + n*k`` tels que ``0 <= n < (j-i)/k``. En d'autres termes, les indices sont ``i``, ``i+k``, ``i+2*k``, ``i+3*k`` et ainsi de suite, en arrêtant lorsque *j* est atteint (mais jamais inclus). Si *k* est positif, *i* et *j* sont réduits, s'ils sont plus grands, à ``len(s)``. Si *k* est négatif, *i* et *j* sont réduits à ``len(s) - 1`` s'ils sont plus grands. Si *i* ou *j* sont omis ou sont ``None``, ils deviennent des valeurs "extrêmes" (où l'ordre dépend du signe de *k*). Remarquez, *k* ne peut pas valoir zéro. Si *k* est ``None``, il est traité comme ``1``.

source: Concatenating immutable sequences always results in a new object. This means that building up a sequence by repeated concatenation will have a quadratic runtime cost in the total sequence length. To get a linear runtime cost, you must switch to one of the alternatives below:
fr: Concaténer des séquences immuables donne toujours un nouvel objet. Cela signifie que la construction d'une séquence par concaténations répétées aura une durée d'exécution quadratique par rapport à la longueur de la séquence totale. Pour obtenir un temps d'exécution linéaire, vous devez utiliser l'une des alternatives suivantes :
