Repository: python/python-docs-fr
Catalog: library/stdtypes.po
Languages: fr

source: The alternate form causes a leading ``'0x'`` or ``'0X'`` (depending on whether the ``'x'`` or ``'X'`` format was used) to be inserted before the first digit.
fr: La forme alternative entraîne l'insertion d'un préfixe ``'0x'`` ou ``'0X'`` (respectivement pour les formats ``'x'`` et ``'X'``) avant le premier chiffre.

source: The alternate form causes the result to always contain a decimal point, even if no digits follow it.
fr: La forme alternative implique la présence d'un point décimal, même si aucun chiffre ne le suit.

source: The precision determines the number of digits after the decimal point and defaults to 6.
fr: La précision détermine le nombre de chiffres après la virgule, 6 par défaut.

source: The alternate form causes the result to always contain a decimal point, and trailing zeroes are not removed as they would otherwise be.
fr: La forme alternative implique la présence d'un point décimal et les zéros non significatifs sont conservés (ils ne le seraient pas autrement).

source: The precision determines the number of significant digits before and after the decimal point and defaults to 6.
fr: La précision détermine le nombre de chiffres significatifs avant et après la virgule. 6 par défaut.

source: If precision is ``N``, the output is truncated to ``N`` characters.
fr: Si la précision est ``N``, la sortie est tronquée à ``N`` caractères.

source: See :pep:`237`.
fr: Voir la :pep:`237`.

source: Since Python strings have an explicit length, ``%s`` conversions do not assume that ``'\0'`` is the end of the string.
fr: Puisque les chaînes Python ont une longueur explicite, les conversions ``%s`` ne considèrent pas ``'\0'`` comme la fin de la chaîne.

source: ``%f`` conversions for numbers whose absolute value is over 1e50 are no longer replaced by ``%g`` conversions.
fr: Les conversions ``%f`` pour nombres dont la valeur absolue est supérieure à ``1e50`` ne sont plus remplacés par des conversions ``%g``.

source: Binary Sequence Types --- :class:`bytes`, :class:`bytearray`, :class:`memoryview`
fr: Séquences Binaires --- :class:`bytes`, :class:`bytearray`, :class:`memoryview`

source: The core built-in types for manipulating binary data are :class:`bytes` and :class:`bytearray`. They are supported by :class:`memoryview` which uses the :ref:`buffer protocol <bufferobjects>` to access the memory of other binary objects without needing to make a copy.
fr: Les principaux types natifs pour manipuler des données binaires sont :class:`bytes` et :class:`bytearray`. Ils sont supportés par :class:`memoryview` qui utilise le :ref:`buffer protocol <bufferobjects>` pour accéder à la mémoire d'autres objets binaires sans avoir besoin d'en faire une copie.

source: The :mod:`array` module supports efficient storage of basic data types like 32-bit integers and IEEE754 double-precision floating values.
fr: Le module :mod:`array` permet le stockage efficace de types basiques comme les entiers de 32 bits et les *float* double précision IEEE754.

source: Bytes Objects
fr: Objets *bytes*

source: Bytes objects are immutable sequences of single bytes. Since many major binary protocols are based on the ASCII text encoding, bytes objects offer several methods that are only valid when working with ASCII compatible data and are closely related to string objects in a variety of other ways.
fr: Les *bytes* sont des séquences immuables d'octets. Comme beaucoup de protocoles binaires utilisent l'ASCII, les objets *bytes* offrent plusieurs méthodes qui ne sont valables que lors de la manipulation de données ASCII et sont étroitement liés aux objets *str* dans bien d'autres aspects.

source: Firstly, the syntax for bytes literals is largely the same as that for string literals, except that a ``b`` prefix is added:
fr: Tout d'abord, la syntaxe des *bytes* littéraux est en grande partie la même que pour les chaînes littérales, en dehors du préfixe ``b`` :

source: Single quotes: ``b'still allows embedded "double" quotes'``
fr: Les guillemets simples : ``b'autorisent aussi les guillemets "doubles"'``

source: Double quotes: ``b"still allows embedded 'single' quotes"``.
fr: Les guillemets doubles : ``b"permettent aussi les guillemets 'simples'"``.

source: Triple quoted: ``b'''3 single quotes'''``, ``b"""3 double quotes"""``
fr: Les guillemets triples : ``b'''3 single quotes'''``, ``b"""3 double quotes"""``

source: Only ASCII characters are permitted in bytes literals (regardless of the declared source code encoding). Any binary values over 127 must be entered into bytes literals using the appropriate escape sequence.
fr: Seuls les caractères ASCII sont autorisés dans les littéraux de *bytes* (quel que soit l'encodage du code source déclaré). Toutes les valeurs au delà de 127 doivent être entrés dans littéraux de *bytes* en utilisant une séquence d'échappement appropriée.

source: As with string literals, bytes literals may also use a ``r`` prefix to disable processing of escape sequences. See :ref:`strings` for more about the various forms of bytes literal, including supported escape sequences.
fr: Comme avec les chaînes littérales, les *bytes* littéraux peuvent également utiliser un préfixe ``r`` pour désactiver le traitement des séquences d'échappement. Voir :ref:`strings` pour plus d'informations sur les différentes formes littérales de *bytes*, y compris les séquences d'échappement supportées.

source: While bytes literals and representations are based on ASCII text, bytes objects actually behave like immutable sequences of integers, with each value in the sequence restricted such that ``0 <= x < 256`` (attempts to violate this restriction will trigger :exc:`ValueError`). This is done deliberately to emphasise that while many binary formats include ASCII based elements and can be usefully manipulated with some text-oriented algorithms, this is not generally the case for arbitrary binary data (blindly applying text processing algorithms to binary data formats that are not ASCII compatible will usually lead to data corruption).
fr: Bien que les *bytes* littéraux, et leurs représentation, soient basés sur du texte ASCII, les *bytes* se comportent en fait comme des séquences immuables de nombres entiers, dont les valeurs sont restreintes dans ``0 <= x < 256`` (ne pas respecter cette restriction lève une :exc:`ValueError`. Ceci est fait délibérément afin de souligner que, bien que de nombreux encodages binaires soient compatibles avec l'ASCII, et peuvent être manipulés avec des algorithmes orientés texte, ce n'est généralement pas le cas pour les données binaires arbitraires (appliquer aveuglément des algorithmes de texte sur des données binaires qui ne sont pas compatibles ASCII conduit généralement à leur corruption).

source: In addition to the literal forms, bytes objects can be created in a number of other ways:
fr: En plus des formes littérales, des objets *bytes* peuvent être créés par de nombreux moyens :

source: A zero-filled bytes object of a specified length: ``bytes(10)``
fr: Un objet *bytes* rempli de zéros d'une longueur spécifiée : ``bytes(10)``

source: From an iterable of integers: ``bytes(range(20))``
fr: D'un itérable d'entiers : ``bytes(range(20))``

source: Copying existing binary data via the buffer protocol: ``bytes(obj)``
fr: Copier des données binaires existantes via le *buffer protocol* : ``bytes(obj)``

source: Also see the :ref:`bytes <func-bytes>` built-in.
fr: Voir aussi la fonction native :ref:`bytes <func-bytes>`.

source: Since 2 hexadecimal digits correspond precisely to a single byte, hexadecimal numbers are a commonly used format for describing binary data. Accordingly, the bytes type has an additional class method to read data in that format:
fr: Puisque 2 chiffres hexadécimaux correspondent précisément à un seul octet, les nombres hexadécimaux sont un format couramment utilisé pour décrire les données binaires. Par conséquent, le type *bytes* a une méthode de classe pour lire des données dans ce format :

source: This :class:`bytes` class method returns a bytes object, decoding the given string object. The string must contain two hexadecimal digits per byte, with ASCII whitespace being ignored.
fr: Cette méthode de la classe :class:`bytes` renvoie un objet *bytes*, décodant la chaîne donnée. La chaîne doit contenir deux chiffres hexadécimaux par octet, les espaces ASCII sont ignorés.

source: :meth:`bytes.fromhex` now skips all ASCII whitespace in the string, not just spaces.
fr: :meth:`bytes.fromhex` saute maintenant dans la chaîne tous les caractères ASCII "blancs", pas seulement les espaces.

source: A reverse conversion function exists to transform a bytes object into its hexadecimal representation.
fr: Une fonction de conversion inverse existe pour transformer un objet *bytes* en sa représentation hexadécimale.

source: Return a string object containing two hexadecimal digits for each byte in the instance.
fr: Renvoie une chaîne contenant deux chiffres hexadécimaux pour chaque octet du *byte*.

source: Since bytes objects are sequences of integers (akin to a tuple), for a bytes object *b*, ``b[0]`` will be an integer, while ``b[0:1]`` will be a bytes object of length 1. (This contrasts with text strings, where both indexing and slicing will produce a string of length 1)
fr: Comme les objets *bytes* sont des séquences d'entiers (semblables à un tuple), pour une instance de *bytes* *b*, ``b[0]`` sera un entier, tandis que``b[0:1]`` sera un objet *bytes* de longueur 1. (Cela contraste avec les chaînes, où l'indexation et le *slicing* donne une chaîne de longueur 1)

source: The representation of bytes objects uses the literal format (``b'...'``) since it is often more useful than e.g. ``bytes([46, 46, 46])``. You can always convert a bytes object into a list of integers using ``list(b)``.
fr: La représentation des *bytes* utilise le format littéral (``b'...'``) car il est souvent plus utile que par exemple ``bytes([46, 46, 46])``. Vous pouvez toujours convertir un *bytes* en liste d'entiers en utilisant ``list(b)``.

source: For Python 2.x users: In the Python 2.x series, a variety of implicit conversions between 8-bit strings (the closest thing 2.x offers to a built-in binary data type) and Unicode strings were permitted. This was a backwards compatibility workaround to account for the fact that Python originally only supported 8-bit text, and Unicode text was a later addition. In Python 3.x, those implicit conversions are gone - conversions between 8-bit binary data and Unicode text must be explicit, and bytes and string objects will always compare unequal.
fr: Pour les utilisateurs de Python 2.x : Dans la série 2.x de Python, une variété de conversions implicites entre les chaînes 8-bit (la chose la plus proche d'un type natif de données binaires offert par Python 2) et des chaînes Unicode étaient permises. C'était une solution de contournement, pour garder la rétro-compatibilité, considérant que Python ne prenait initialement en charge que le texte 8 bits, le texte Unicode est un ajout ultérieur. En Python 3.x, ces conversions implicites ont disparues, les conversions entre les données binaires et texte Unicode doivent être explicites, et les *bytes* sont toujours différents des chaînes.

source: Bytearray Objects
fr: Objets *bytearray*

source: :class:`bytearray` objects are a mutable counterpart to :class:`bytes` objects.
fr: Les objets :class:`bytearray` sont l'équivalent muable des objets :class:`bytes`.

source: There is no dedicated literal syntax for bytearray objects, instead they are always created by calling the constructor:
fr: Il n'y a pas de syntaxe littérale dédiée aux *bytearray*, ils sont toujours créés en appelant le constructeur :

source: Creating an empty instance: ``bytearray()``
fr: Créer une instance vide: ``bytearray()``

source: Creating a zero-filled instance with a given length: ``bytearray(10)``
fr: Créer une instance remplie de zéros d'une longueur donnée : ``bytearray(10)``

source: From an iterable of integers: ``bytearray(range(20))``
fr: À partir d'un itérable d'entiers : ``bytearray(range(20))``

source: Copying existing binary data via the buffer protocol: ``bytearray(b'Hi!')``
fr: Copie des données binaires existantes via le *buffer protocol* : ``bytearray(b'Hi!')``

source: As bytearray objects are mutable, they support the :ref:`mutable <typesseq-mutable>` sequence operations in addition to the common bytes and bytearray operations described in :ref:`bytes-methods`.
fr: Comme les *bytearray* sont muables, ils prennent en charge les opérations de séquence :ref:`muables <typesseq-mutable>` en plus des opérations communes de *bytes* et *bytearray* décrites dans :ref:`bytes-methods`.

source: Also see the :ref:`bytearray <func-bytearray>` built-in.
fr: Voir aussi la fonction native :ref:`bytearray <func-bytearray>`.

source: Since 2 hexadecimal digits correspond precisely to a single byte, hexadecimal numbers are a commonly used format for describing binary data. Accordingly, the bytearray type has an additional class method to read data in that format:
fr: Puisque 2 chiffres hexadécimaux correspondent précisément à un octet, les nombres hexadécimaux sont un format couramment utilisé pour décrire les données binaires. Par conséquent, le type *bytearray* a une méthode de classe pour lire les données dans ce format :

source: This :class:`bytearray` class method returns bytearray object, decoding the given string object. The string must contain two hexadecimal digits per byte, with ASCII whitespace being ignored.
fr: Cette méthode de la classe :class:`bytearray` renvoie un objet *bytearray*, décodant la chaîne donnée. La chaîne doit contenir deux chiffres hexadécimaux par octet, les espaces ASCII sont ignorés.

source: :meth:`bytearray.fromhex` now skips all ASCII whitespace in the string, not just spaces.
fr: :meth:`bytearray.fromhex` saute maintenant tous les caractères "blancs" ASCII dans la chaîne, pas seulement les espaces.

source: A reverse conversion function exists to transform a bytearray object into its hexadecimal representation.
fr: Une fonction de conversion inverse existe pour transformer un objet *bytearray* en sa représentation hexadécimale.

source: Since bytearray objects are sequences of integers (akin to a list), for a bytearray object *b*, ``b[0]`` will be an integer, while ``b[0:1]`` will be a bytearray object of length 1. (This contrasts with text strings, where both indexing and slicing will produce a string of length 1)
fr: Comme les *bytearray* sont des séquences d'entiers (semblables à une liste), pour un objet *bytearray* *b*, ``b[0]`` sera un entier, tandis que ``b[0:1]`` sera un objet *bytearray* de longueur 1. (Ceci contraste avec les chaînes de texte, où l'indexation et le *slicing* produit une chaîne de longueur 1)

source: The representation of bytearray objects uses the bytes literal format (``bytearray(b'...')``) since it is often more useful than e.g. ``bytearray([46, 46, 46])``. You can always convert a bytearray object into a list of integers using ``list(b)``.
fr: La représentation des objets *bytearray* utilise le format littéral des *bytes* (``bytearray(b'...')``) car il est souvent plus utile que par exemple ``bytearray([46, 46, 46])``. Vous pouvez toujours convertir un objet *bytearray* en une liste de nombres entiers en utilisant ``list(b)``.

source: Bytes and Bytearray Operations
fr: Opérations sur les *bytes* et *bytearray*

source: Both bytes and bytearray objects support the :ref:`common <typesseq-common>` sequence operations. They interoperate not just with operands of the same type, but with any :term:`bytes-like object`. Due to this flexibility, they can be freely mixed in operations without causing errors. However, the return type of the result may depend on the order of operands.
fr: *bytes* et *bytearray* prennent en charge les opérations :ref:`communes <typesseq-common>` des séquences. Ils interagissent non seulement avec des opérandes de même type, mais aussi avec les :term:`bytes-like object`. En raison de cette flexibilité, ils peuvent être mélangés librement dans des opérations sans provoquer d'erreurs. Cependant, le type du résultat peut dépendre de l'ordre des opérandes.

source: The methods on bytes and bytearray objects don't accept strings as their arguments, just as the methods on strings don't accept bytes as their arguments. For example, you have to write::
fr: Les méthodes sur les *bytes* et les *bytearray* n'acceptent pas les chaînes comme arguments, tout comme les méthodes sur les chaînes n'acceptent pas les *bytes* comme arguments. Par exemple, vous devez écrire ::

source: and::
fr: et ::

source: Some bytes and bytearray operations assume the use of ASCII compatible binary formats, and hence should be avoided when working with arbitrary binary data. These restrictions are covered below.
fr: Quelques opérations de *bytes* et *bytesarray* supposent l'utilisation de formats binaires compatibles ASCII, et donc doivent être évités lorsque vous travaillez avec des données binaires arbitraires. Ces restrictions sont couvertes ci-dessous.

source: Using these ASCII based operations to manipulate binary data that is not stored in an ASCII based format may lead to data corruption.
fr: Utiliser ces opérations basées sur l'ASCII pour manipuler des données binaires qui ne sont pas au format ASCII peut les corrompre.

source: The following methods on bytes and bytearray objects can be used with arbitrary binary data.
fr: Les méthodes suivantes sur les *bytes* et *bytearray* peuvent être utilisées avec des données binaires arbitraires.

source: Return the number of non-overlapping occurrences of subsequence *sub* in the range [*start*, *end*]. Optional arguments *start* and *end* are interpreted as in slice notation.
fr: Renvoie le nombre d'occurrences qui ne se chevauchent pas de la sous-séquence *sub* dans l'intervalle [*start*, *end*]. Les arguments facultatifs *start* et *end* sont interprétés comme pour un *slice*.

source: The subsequence to search for may be any :term:`bytes-like object` or an integer in the range 0 to 255.
fr: La sous-séquence à rechercher peut être un quelconque :term:`bytes-like object` ou un nombre entier compris entre 0 et 255.

source: Also accept an integer in the range 0 to 255 as the subsequence.
fr: Accepte aussi un nombre entier compris entre 0 et 255 comme sous-séquence.

source: Return a string decoded from the given bytes. Default encoding is ``'utf-8'``. *errors* may be given to set a different error handling scheme. The default for *errors* is ``'strict'``, meaning that encoding errors raise a :exc:`UnicodeError`. Other possible values are ``'ignore'``, ``'replace'`` and any other name registered via :func:`codecs.register_error`, see section :ref:`error-handlers`. For a list of possible encodings, see section :ref:`standard-encodings`.
fr: Décode les octets donnés, et le renvoie sous forme d'une chaîne de caractères. L'encodage par défaut est ``'utf-8'``. *errors* peut être donné pour changer de système de gestion des erreurs. Sa valeur par défaut est ``'strict'``, ce qui signifie que les erreurs d'encodage lèvent une :exc:`UnicodeError`. Les autres valeurs possibles sont ``'ignore'``, ``'replace'`` et tout autre nom enregistré via :func:`codecs.register_error`, voir la section :ref:`error-handlers`. Pour une liste des encodages possibles, voir la section :ref:`standard-encodings`.

source: Passing the *encoding* argument to :class:`str` allows decoding any :term:`bytes-like object` directly, without needing to make a temporary bytes or bytearray object.
fr: Passer l'argument *encoding* à :class:`str` permet de décoder tout :term:`bytes-like object` directement, sans avoir besoin d'utiliser un *bytes* ou *bytearray* temporaire.

source: Added support for keyword arguments.
fr: Gère les arguments nommés.

source: Return ``True`` if the binary data ends with the specified *suffix*, otherwise return ``False``. *suffix* can also be a tuple of suffixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
fr: Donne ``True`` si les octets se terminent par *suffix*, sinon ``False``. *suffix* peut aussi être un tuple de suffixes à rechercher. Avec l'argument optionnel *start*, la recherche se fait à partir de cette position. Avec l'argument optionnel *end*, la comparaison s'arrête à cette position.

source: The suffix(es) to search for may be any :term:`bytes-like object`.
fr: Les suffixes à rechercher peuvent être n'importe quel :term:`bytes-like object`.

source: Return the lowest index in the data where the subsequence *sub* is found, such that *sub* is contained in the slice ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` if *sub* is not found.
fr: Donne la première position où le *sub* se trouve dans les données, de telle sorte que *sub* soit contenue dans ``s[start:end]``. Les arguments facultatifs *start* et *end* sont interprétés comme dans la notation des *slices*. Donne ``-1`` si *sub* n'est pas trouvé.

source: The :meth:`~bytes.find` method should be used only if you need to know the position of *sub*. To check if *sub* is a substring or not, use the :keyword:`in` operator::
fr: La méthode :meth:`~bytes.find` ne doit être utilisée que si vous avez besoin de connaître la position de *sub*. Pour vérifier si *sub* est présent ou non, utilisez l'opérateur :keyword:`in` ::

source: Like :meth:`~bytes.find`, but raise :exc:`ValueError` when the subsequence is not found.
fr: Comme :meth:`~bytes.find`, mais lève une :exc:`ValueError` lorsque la séquence est introuvable.

source: Return a bytes or bytearray object which is the concatenation of the binary data sequences in *iterable*. A :exc:`TypeError` will be raised if there are any values in *iterable* that are not :term:`bytes-like objects <bytes-like object>`, including :class:`str` objects. The separator between elements is the contents of the bytes or bytearray object providing this method.
fr: Donne un *bytes* ou *bytearray* qui est la concaténation des séquences de données binaires dans *iterable*. Une exception :exc:`TypeError` est levée si une valeur d'*iterable* n'est pas un :term:`bytes-like objects <bytes-like object>`, y compris pour des :class:`str`. Le séparateur entre les éléments est le contenu du *bytes* ou du *bytearray* depuis lequel cette méthode est appelée.

source: This static method returns a translation table usable for :meth:`bytes.translate` that will map each character in *from* into the character at the same position in *to*; *from* and *to* must both be :term:`bytes-like objects <bytes-like object>` and have the same length.
fr: Cette méthode statique renvoie une table de traduction utilisable par :meth:`bytes.translate` qui permettra de changer chaque caractère de *from* par un caractère à la même position dans *to*; *from* et *to* doivent tous deux être des :term:`bytes-like objects <bytes-like object>` et avoir la même longueur.

source: Split the sequence at the first occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself or its bytearray copy, and the part after the separator. If the separator is not found, return a 3-tuple containing a copy of the original sequence, followed by two empty bytes or bytearray objects.
fr: Divise la séquence à la première occurrence de *sep*, et renvoie un 3-tuple contenant la partie précédant le séparateur, le séparateur lui même (ou sa copie en *byterray*), et la partie suivant le séparateur. Si le séparateur est pas trouvé, le 3-tuple renvoyé contiendra une copie de la séquence d'origine, suivi de deux *bytes* ou *bytearray* vides.

source: The separator to search for may be any :term:`bytes-like object`.
fr: Le séparateur à rechercher peut être tout :term:`bytes-like object`.
