Repository: python/python-docs-fr
Catalog: library/stdtypes.po
Languages: fr

source: Built-in Types
fr: Types natifs

source: The following sections describe the standard types that are built into the interpreter.
fr: Les sections suivantes décrivent les types standards intégrés à l'interpréteur.

source: The principal built-in types are numerics, sequences, mappings, classes, instances and exceptions.
fr: Les principaux types natifs sont les numériques, les séquences, les dictionnaires, les classes, les instances et les exceptions.

source: Some collection classes are mutable. The methods that add, subtract, or rearrange their members in place, and don't return a specific item, never return the collection instance itself but ``None``.
fr: Certaines classes de collection sont muables. Les méthodes qui ajoutent, retirent, ou réorganisent leurs éléments sur place, et qui ne renvoient pas un élément spécifique, ne renvoient jamais l'instance de la collection elle-même, mais ``None``.

source: Truth Value Testing
fr: Valeurs booléennes

source: Any object can be tested for truth value, for use in an :keyword:`if` or :keyword:`while` condition or as operand of the Boolean operations below.
fr: Tout objet peut être comparé à une valeur booléenne, typiquement dans une condition :keyword:`if` ou :keyword:`while` ou comme opérande des opérations booléennes ci-dessous.

source: By default, an object is considered true unless its class defines either a :meth:`__bool__` method that returns ``False`` or a :meth:`__len__` method that returns zero, when called with the object. [1]_ Here are most of the built-in objects considered false:
fr: Par défaut, tout objet est considéré vrai à moins que sa classe définisse soit une méthode :meth:`__bool__` renvoyant ``False`` soit une méthode :meth:`__len__` renvoyant zéro lorsqu'elle est appelée avec l'objet. [1]_ Voici la majorité des objets natifs considérés comme étant faux :

source: constants defined to be false: ``None`` and ``False``.
fr: les constantes définies comme étant fausses : ``None`` et ``False``.

source: zero of any numeric type: ``0``, ``0.0``, ``0j``, ``Decimal(0)``, ``Fraction(0, 1)``
fr: zéro de tout type numérique : ``0``, ``0.0``, ``0j``, ``Decimal(0)``, ``Fraction(0, 1)``

source: empty sequences and collections: ``''``, ``()``, ``[]``, ``{}``, ``set()``, ``range(0)``
fr: les chaînes et collections vides : ``''``, ``()``, ``[]``, ``{}``, ``set()``, ``range(0)``

source: Operations and built-in functions that have a Boolean result always return ``0`` or ``False`` for false and ``1`` or ``True`` for true, unless otherwise stated. (Important exception: the Boolean operations ``or`` and ``and`` always return one of their operands.)
fr: Les opérations et fonctions natives dont le résultat est booléen donnent toujours ``0`` ou ``False`` pour faux et ``1`` ou ``True`` pour vrai, sauf indication contraire. (Exception importante : les opérations booléennes ``or`` et ``and`` renvoient toujours l'une de leurs opérandes.)

source: Boolean Operations --- :keyword:`!and`, :keyword:`!or`, :keyword:`!not`
fr: Opérations booléennes --- :keyword:`!and`, :keyword:`!or`, :keyword:`!not`

source: These are the Boolean operations, ordered by ascending priority:
fr: Ce sont les opérations booléennes, classées par priorité ascendante :

source: Operation
fr: Opération

source: Result
fr: Résultat

source: if *x* is false, then *y*, else *x*
fr: si *x* est faux, alors *y*, sinon *x*

source: if *x* is false, then *x*, else *y*
fr: si *x* est faux, alors *x*, sinon *y*

source: if *x* is false, then ``True``, else ``False``
fr: si *x* est faux, alors ``True``, sinon ``False``

source: This is a short-circuit operator, so it only evaluates the second argument if the first one is false.
fr: Ceci est un opérateur court-circuit : il n'évalue le deuxième argument que si le premier est faux.

source: This is a short-circuit operator, so it only evaluates the second argument if the first one is true.
fr: Ceci est un opérateur court-circuit, il n'évalue le deuxième argument si le premier est vrai.

source: ``not`` has a lower priority than non-Boolean operators, so ``not a == b`` is interpreted as ``not (a == b)``, and ``a == not b`` is a syntax error.
fr: ``not`` a une priorité inférieure à celle des opérateurs non-booléens, donc ``not a == b`` est interprété comme ``not (a == b)`` et ``a == not b`` est une erreur de syntaxe.

source: Comparisons
fr: Comparaisons

source: There are eight comparison operations in Python. They all have the same priority (which is higher than that of the Boolean operations). Comparisons can be chained arbitrarily; for example, ``x < y <= z`` is equivalent to ``x < y and y <= z``, except that *y* is evaluated only once (but in both cases *z* is not evaluated at all when ``x < y`` is found to be false).
fr: Il y a huit opérations de comparaison en Python. Elles ont toutes la même priorité (qui est supérieure à celle des opérations booléennes). Les comparaisons peuvent être enchaînées arbitrairement ; par exemple, ``x < y <= z`` est équivalent à ``x < y and y <= z``, sauf que *y* n'est évalué qu'une seule fois (mais dans les deux cas *z* n'est pas évalué du tout quand ``x < y`` est faux).

source: This table summarizes the comparison operations:
fr: Ce tableau résume les opérations de comparaison :

source: Meaning
fr: Signification

source: strictly less than
fr: strictement inférieur

source: less than or equal
fr: inférieur ou égal

source: strictly greater than
fr: strictement supérieur

source: greater than or equal
fr: supérieur ou égal

source: equal
fr: égal

source: not equal
fr: différent

source: object identity
fr: identité d'objet

source: negated object identity
fr: contraire de l'identité d'objet

source: Non-identical instances of a class normally compare as non-equal unless the class defines the :meth:`__eq__` method.
fr: Des instances différentes d'une classe sont normalement considérées différentes à moins que la classe ne définisse la méthode :meth:`__eq__`.

source: Instances of a class cannot be ordered with respect to other instances of the same class, or other types of object, unless the class defines enough of the methods :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__`, and :meth:`__ge__` (in general, :meth:`__lt__` and :meth:`__eq__` are sufficient, if you want the conventional meanings of the comparison operators).
fr: Les instances d'une classe ne peuvent pas être ordonnées par rapport à d'autres instances de la même classe, ou d'autres types d'objets, à moins que la classe ne définisse suffisamment de méthodes parmi :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__` et :meth:`__ge__` (en général, :meth:`__lt__` et :meth:`__eq__` sont suffisantes, si vous voulez les significations classiques des opérateurs de comparaison).

source: The behavior of the :keyword:`is` and :keyword:`is not` operators cannot be customized; also they can be applied to any two objects and never raise an exception.
fr: Le comportement des opérateurs :keyword:`is` et :keyword:`is not` ne peut pas être personnalisé ; aussi ils peuvent être appliqués à deux objets quelconques et ne lèvent jamais d'exception.

source: Two more operations with the same syntactic priority, :keyword:`in` and :keyword:`not in`, are supported by types that are :term:`iterable` or implement the :meth:`__contains__` method.
fr: Deux autres opérations avec la même priorité syntaxique, :keyword:`in` et :keyword:`not in`, sont pris en charge par les types :term:`itérables <iterable>` ou qui implémentent la méthode :meth:`__contains__`.

source: Numeric Types --- :class:`int`, :class:`float`, :class:`complex`
fr: Types numériques — :class:`int`, :class:`float`, :class:`complex`

source: There are three distinct numeric types: :dfn:`integers`, :dfn:`floating point numbers`, and :dfn:`complex numbers`. In addition, Booleans are a subtype of integers. Integers have unlimited precision. Floating point numbers are usually implemented using :c:type:`double` in C; information about the precision and internal representation of floating point numbers for the machine on which your program is running is available in :data:`sys.float_info`. Complex numbers have a real and imaginary part, which are each a floating point number. To extract these parts from a complex number *z*, use ``z.real`` and ``z.imag``. (The standard library includes the additional numeric types :mod:`fractions.Fraction`, for rationals, and :mod:`decimal.Decimal`, for floating-point numbers with user-definable precision.)
fr: Il existe trois types numériques distincts: :dfn:`integers` (entiers), :dfn:`floating point numbers` (nombres flottants) et :dfn:`complex numbers` (nombres complexes). En outre, les booléens sont un sous-type des entiers. Les entiers ont une précision illimitée. Les nombres à virgule flottante sont généralement implémentés en utilisant des :c:type:`double` en C ; des informations sur la précision et la représentation interne des nombres à virgule flottante pour la machine sur laquelle le programme est en cours d'exécution est disponible dans :data:`sys.float_info`. Les nombres complexes ont une partie réelle et une partie imaginaire, qui sont chacune des nombres à virgule flottante. Pour extraire ces parties d'un nombre complexe *z*, utilisez ``z.real`` et ``z.imag``. (La bibliothèque standard comprend les types numériques additionnels :mod:`fractions.Fraction` pour les rationnels et :mod:`decimal.Decimal` pour les nombres à virgule flottante avec une précision définissable par l'utilisateur.)

source: Numbers are created by numeric literals or as the result of built-in functions and operators. Unadorned integer literals (including hex, octal and binary numbers) yield integers. Numeric literals containing a decimal point or an exponent sign yield floating point numbers. Appending ``'j'`` or ``'J'`` to a numeric literal yields an imaginary number (a complex number with a zero real part) which you can add to an integer or float to get a complex number with real and imaginary parts.
fr: Les nombres sont créés par des littéraux numériques ou sont le résultat de fonctions natives ou d'opérateurs. Les entiers littéraux basiques (y compris leur forme hexadécimale, octale et binaire) donnent des entiers. Les nombres littéraux contenant un point décimal ou un exposant donnent des nombres à virgule flottante. Suffixer ``'j'`` ou ``'J'`` à un nombre littéral donne un nombre imaginaire (un nombre complexe avec une partie réelle nulle) que vous pouvez ajouter à un nombre entier ou un à virgule flottante pour obtenir un nombre complexe avec une partie réelle et une partie imaginaire.

source: Python fully supports mixed arithmetic: when a binary arithmetic operator has operands of different numeric types, the operand with the "narrower" type is widened to that of the other, where integer is narrower than floating point, which is narrower than complex. Comparisons between numbers of mixed type use the same rule. [2]_ The constructors :func:`int`, :func:`float`, and :func:`complex` can be used to produce numbers of a specific type.
fr: Python gère pleinement l'arithmétique mixte : quand un opérateur arithmétique binaire a des opérandes de types numériques différents, l'opérande avec le type "le plus étroit" est élargie au type de l'autre, où l'entier est plus étroit que la virgule flottante, qui est plus étroite que les complexes. Les comparaisons entre des nombres de type mixte utilisent la même règle. [2]_ Les constructeurs :func:`int`, :func:`float` et :func:`complex` peuvent être utilisé pour produire des nombres d'un type spécifique.

source: All numeric types (except complex) support the following operations (for priorities of the operations, see :ref:`operator-summary`):
fr: Tous les types numériques (sauf complexe) gèrent les opérations suivantes (pour les priorités des opérations, voir :ref:`operator-summary`) :

source: Full documentation
fr: Documentation complète

source: sum of *x* and *y*
fr: somme de *x* et *y*

source: difference of *x* and *y*
fr: différence de *x* et *y*

source: product of *x* and *y*
fr: produit de *x* et *y*

source: quotient of *x* and *y*
fr: quotient de *x* et *y*

source: floored quotient of *x* and *y*
fr: quotient entier de *x* et *y*

source: remainder of ``x / y``
fr: reste de ``x / y``

source: *x* negated
fr: négatif de *x*

source: *x* unchanged
fr: *x* inchangé

source: absolute value or magnitude of *x*
fr: valeur absolue de *x*

source: *x* converted to integer
fr: *x* converti en nombre entier

source: *x* converted to floating point
fr: *x* converti en nombre à virgule flottante

source: a complex number with real part *re*, imaginary part *im*. *im* defaults to zero.
fr: un nombre complexe avec *re* pour partie réelle et *im* pour partie imaginaire. *im* vaut zéro par défaut.

source: conjugate of the complex number *c*
fr: conjugué du nombre complexe *c*

source: the pair ``(x // y, x % y)``
fr: la paire ``(x // y, x % y)``

source: *x* to the power *y*
fr: *x* à la puissance *y*

source: Also referred to as integer division. The resultant value is a whole integer, though the result's type is not necessarily int. The result is always rounded towards minus infinity: ``1//2`` is ``0``, ``(-1)//2`` is ``-1``, ``1//(-2)`` is ``-1``, and ``(-1)//(-2)`` is ``0``.
fr: Également appelé division entière. La valeur résultante est un nombre entier, bien que le type du résultat ne soit pas nécessairement *int*. Le résultat est toujours arrondi vers moins l'infini : ``1//2`` vaut ``0``, ``(-1)//2`` vaut ``-1``, ``1//(-2)`` vaut ``-1``, et ``(-1)//(-2)`` vaut ``0``.

source: Not for complex numbers. Instead convert to floats using :func:`abs` if appropriate.
fr: Pas pour les nombres complexes. Convertissez-les plutôt en nombres flottants à l'aide de :func:`abs` si c'est approprié.

source: Conversion from floating point to integer may round or truncate as in C; see functions :func:`math.floor` and :func:`math.ceil` for well-defined conversions.
fr: La conversion de virgule flottante en entier peut arrondir ou tronquer comme en C ; voir les fonctions :func:`math.floor` et :func:`math.ceil` pour des conversions bien définies.

source: float also accepts the strings "nan" and "inf" with an optional prefix "+" or "-" for Not a Number (NaN) and positive or negative infinity.
fr: *float* accepte aussi les chaînes *nan* et *inf* avec un préfixe optionnel ``+`` ou ``-`` pour *Not a Number* (*NaN*) et les infinis positif ou négatif.

source: Python defines ``pow(0, 0)`` and ``0 ** 0`` to be ``1``, as is common for programming languages.
fr: Python définit ``pow(0, 0)`` et ``0 ** 0`` valant ``1``, puisque c'est courant pour les langages de programmation, et logique.

source: The numeric literals accepted include the digits ``0`` to ``9`` or any Unicode equivalent (code points with the ``Nd`` property).
fr: Les littéraux numériques acceptés comprennent les chiffres ``0`` à ``9`` ou tout équivalent Unicode (caractères avec la propriété ``Nd``).

source: All :class:`numbers.Real` types (:class:`int` and :class:`float`) also include the following operations:
fr: Tous types :class:`numbers.Real` (:class:`int` et :class:`float`) comprennent également les opérations suivantes :

source: *x* truncated to :class:`~numbers.Integral`
fr: *x* tronqué à l':class:`~numbers.Integral`

source: *x* rounded to *n* digits, rounding half to even. If *n* is omitted, it defaults to 0.
fr: *x* arrondi à *n* chiffres, arrondissant la moitié au pair. Si *n* est omis, la valeur par défaut à 0.

source: the greatest :class:`~numbers.Integral` <= *x*
fr: le plus grand :class:`~numbers.Integral` <= *x*

source: the least :class:`~numbers.Integral` >= *x*
fr: le plus petit :class:`~numbers.Integral` >= *x*

source: For additional numeric operations see the :mod:`math` and :mod:`cmath` modules.
fr: Pour d'autres opérations numériques voir les modules :mod:`math` et :mod:`cmath`.

source: Bitwise Operations on Integer Types
fr: Opérations sur les bits des nombres entiers

source: Bitwise operations only make sense for integers. The result of bitwise operations is calculated as though carried out in two's complement with an infinite number of sign bits.
fr: Les opérations bit à bit n'ont de sens que pour les entiers relatifs. Le résultat d'une opération bit à bit est calculé comme si elle était effectuée en complément à deux avec un nombre infini de bits de signe.

source: The priorities of the binary bitwise operations are all lower than the numeric operations and higher than the comparisons; the unary operation ``~`` has the same priority as the other unary numeric operations (``+`` and ``-``).
fr: Les priorités de toutes les opération à deux opérandes sur des bits sont inférieures aux opérations numériques et plus élevées que les comparaisons ; l'opération unaire ``~`` a la même priorité que les autres opérations numériques unaires (``+`` et ``-``).

source: This table lists the bitwise operations sorted in ascending priority:
fr: Ce tableau répertorie les opérations binaires triées par priorité ascendante :

source: bitwise :dfn:`or` of *x* and *y*
fr: :dfn:`ou <or>` binaire de *x* et *y*

source: bitwise :dfn:`exclusive or` of *x* and *y*
fr: :dfn:`ou <or>` exclusive binaire de *x* et *y*

source: bitwise :dfn:`and` of *x* and *y*
fr: :dfn:`et binaire <and>` de *x* et *y*

source: *x* shifted left by *n* bits
fr: *x* décalé vers la gauche de *n* bits

source: *x* shifted right by *n* bits
fr: *x* décalé vers la droite de *n* bits

source: the bits of *x* inverted
fr: les bits de *x*, inversés

source: Negative shift counts are illegal and cause a :exc:`ValueError` to be raised.
fr: Des valeurs de décalage négatives sont illégales et provoquent une exception :exc:`ValueError`.

source: A left shift by *n* bits is equivalent to multiplication by ``pow(2, n)`` without overflow check.
fr: Un décalage à gauche de *n* bits est équivalent à la multiplication par ``pow(2, n)`` sans vérification de débordement.

source: A right shift by *n* bits is equivalent to division by ``pow(2, n)`` without overflow check.
fr: Un décalage à droite de *n* les bits est équivalent à la division par ``pow(2, n)`` sans vérification de débordement.

source: Performing these calculations with at least one extra sign extension bit in a finite two's complement representation (a working bit-width of ``1 + max(x.bit_length(), y.bit_length())`` or more) is sufficient to get the same result as if there were an infinite number of sign bits.
fr: Effectuer ces calculs avec au moins un bit d'extension de signe supplémentaire dans une représentation finie du complément à deux éléments (une largeur de bit fonctionnelle de ``1 + max(x.bit_length(), y.bit_length()`` ou plus) est suffisante pour obtenir le même résultat que s'il y avait un nombre infini de bits de signe.

source: Additional Methods on Integer Types
fr: Méthodes supplémentaires sur les entiers

source: The int type implements the :class:`numbers.Integral` :term:`abstract base class`. In addition, it provides a few more methods:
fr: Le type *int* implémente la :term:`classe de base abstraite <abstract base class>` :class:`numbers.Integral`. Il fournit aussi quelques autres méthodes :

source: Return the number of bits necessary to represent an integer in binary, excluding the sign and leading zeros::
fr: Renvoie le nombre de bits nécessaires pour représenter un nombre entier en binaire, à l'exclusion du signe et des zéros non significatifs ::

source: More precisely, if ``x`` is nonzero, then ``x.bit_length()`` is the unique positive integer ``k`` such that ``2**(k-1) <= abs(x) < 2**k``. Equivalently, when ``abs(x)`` is small enough to have a correctly rounded logarithm, then ``k = 1 + int(log(abs(x), 2))``. If ``x`` is zero, then ``x.bit_length()`` returns ``0``.
fr: Plus précisément, si ``x`` est différent de zéro, ``x.bit_length()`` est le nombre entier positif unique, ``k`` tel que ``2**(k-1) <= abs(x) < 2**k``. Équivalemment, quand ``abs(x)`` est assez petit pour avoir un logarithme correctement arrondi, ``k = 1 + int(log(abs(x), 2))``. Si ``x`` est nul, alors ``x.bit_length()`` donne ``0``.

source: Equivalent to::
fr: Équivalent à ::

source: Return an array of bytes representing an integer.
fr: Renvoie un tableau d'octets représentant un nombre entier.

source: The integer is represented using *length* bytes. An :exc:`OverflowError` is raised if the integer is not representable with the given number of bytes.
fr: L'entier est représenté par *length* octets. Une exception :exc:`OverflowError` est levée s'il n'est pas possible de représenter l'entier avec le nombre d'octets donnés.

source: The *byteorder* argument determines the byte order used to represent the integer. If *byteorder* is ``"big"``, the most significant byte is at the beginning of the byte array. If *byteorder* is ``"little"``, the most significant byte is at the end of the byte array. To request the native byte order of the host system, use :data:`sys.byteorder` as the byte order value.
fr: L'argument *byteorder* détermine l'ordre des octets utilisé pour représenter le nombre entier. Si *byteorder* est ``"big"``, l'octet le plus significatif est au début du tableau d'octets. Si *byteorder* est ``"little"``, l'octet le plus significatif est à la fin du tableau d'octets. Pour demander l'ordre natif des octets du système hôte, donnez :data:`sys.byteorder` comme *byteorder*.

source: The *signed* argument determines whether two's complement is used to represent the integer. If *signed* is ``False`` and a negative integer is given, an :exc:`OverflowError` is raised. The default value for *signed* is ``False``.
fr: L'argument *signed* détermine si le complément à deux est utilisé pour représenter le nombre entier. Si *signed* est ``False`` et qu'un entier négatif est donné, une exception :exc:`OverflowError` est levée. La valeur par défaut pour *signed* est ``False``.

source: Return the integer represented by the given array of bytes.
fr: Donne le nombre entier représenté par le tableau d'octets fourni.

source: The argument *bytes* must either be a :term:`bytes-like object` or an iterable producing bytes.
fr: L'argument *bytes* doit être soit un :term:`bytes-like object` soit un itérable produisant des *bytes*.

source: The *signed* argument indicates whether two's complement is used to represent the integer.
fr: L'argument *signed* indique si le complément à deux est utilisé pour représenter le nombre entier.

source: Additional Methods on Float
fr: Méthodes supplémentaires sur les nombres à virgule flottante

source: The float type implements the :class:`numbers.Real` :term:`abstract base class`. float also has the following additional methods.
fr: Le type *float* implémente la :term:`classe de base abstraite <abstract base class>` :class:`numbers.Real` et a également les méthodes suivantes.

source: Return a pair of integers whose ratio is exactly equal to the original float and with a positive denominator. Raises :exc:`OverflowError` on infinities and a :exc:`ValueError` on NaNs.
fr: Renvoie une paire de nombres entiers dont le rapport est exactement égal au nombre d'origine et avec un dénominateur positif. Lève :exc:`OverflowError` avec un infini et :exc:`ValueError` avec un NaN.

source: Return ``True`` if the float instance is finite with integral value, and ``False`` otherwise::
fr: Donne ``True`` si l'instance de *float* est finie avec une valeur entière, et ``False`` autrement ::
