Repository: python/python-docs-fr
Catalog: library/stdtypes.po
Languages: fr

source: Return a copy of the sequence with all occurrences of subsequence *old* replaced by *new*. If the optional argument *count* is given, only the first *count* occurrences are replaced.
fr: Renvoie une copie de la séquence dont toutes les occurrences de la sous-séquence *old* sont remplacées par *new*. Si l'argument optionnel *count* est donné, seules les *count* premières occurrences de sont remplacés.

source: The subsequence to search for and its replacement may be any :term:`bytes-like object`.
fr: La sous-séquence à rechercher et son remplacement peuvent être n'importe quel :term:`bytes-like object`.

source: The bytearray version of this method does *not* operate in place - it always produces a new object, even if no changes were made.
fr: La version *bytearray* de cette méthode *ne modifie pas* les octets, elle produit toujours un nouvel objet, même si aucune modification n'a été effectuée.

source: Return the highest index in the sequence where the subsequence *sub* is found, such that *sub* is contained within ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` on failure.
fr: Donne la plus grande position de *sub* dans la séquence, de telle sorte que *sub* soit dans ``s[start:end]``. Les arguments facultatifs *start* et *end* sont interprétés comme dans la notation des *slices*. Donne ``-1`` si *sub* n'est pas trouvable.

source: Like :meth:`~bytes.rfind` but raises :exc:`ValueError` when the subsequence *sub* is not found.
fr: Semblable à :meth:`~bytes.rfind` mais lève une :exc:`ValueError` lorsque *sub* est introuvable.

source: Split the sequence at the last occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself or its bytearray copy, and the part after the separator. If the separator is not found, return a 3-tuple containing two empty bytes or bytearray objects, followed by a copy of the original sequence.
fr: Coupe la séquence à la dernière occurrence de *sep*, et renvoie un triplet de trois éléments contenant la partie précédent le séparateur, le séparateur lui même (ou sa copie, un *bytearray*), et la partie suivant le séparateur. Si le séparateur n'est pas trouvé, le triplet contiendra deux *bytes* ou *bytesarray* vides suivi d’une copie de la séquence d'origine.

source: Return ``True`` if the binary data starts with the specified *prefix*, otherwise return ``False``. *prefix* can also be a tuple of prefixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
fr: Donne ``True`` si les données binaires commencent par le *prefix* spécifié, sinon ``False``. *prefix* peut aussi être un tuple de préfixes à rechercher. Avec l'argument *start* la recherche commence à cette position. Avec l'argument *end* option, la recherche s'arrête à cette position.

source: The prefix(es) to search for may be any :term:`bytes-like object`.
fr: Le préfixe(s) à rechercher peuvent être n'importe quel :term:`bytes-like object`.

source: Return a copy of the bytes or bytearray object where all bytes occurring in the optional argument *delete* are removed, and the remaining bytes have been mapped through the given translation table, which must be a bytes object of length 256.
fr: Renvoie une copie du *bytes* ou *bytearray* dont tous les octets de *delete* sont supprimés, et les octets restants changés par la table de correspondance donnée, qui doit être un objet *bytes* d'une longueur de 256.

source: You can use the :func:`bytes.maketrans` method to create a translation table.
fr: Vous pouvez utiliser la méthode :func:`bytes.maketrans` pour créer une table de correspondance.

source: Set the *table* argument to ``None`` for translations that only delete characters::
fr: Donnez ``None`` comme *table* pour seulement supprimer des caractères ::

source: *delete* is now supported as a keyword argument.
fr: *delete* est maintenant accepté comme argument nommé.

source: The following methods on bytes and bytearray objects have default behaviours that assume the use of ASCII compatible binary formats, but can still be used with arbitrary binary data by passing appropriate arguments. Note that all of the bytearray methods in this section do *not* operate in place, and instead produce new objects.
fr: Les méthodes suivantes sur les *bytes* et *bytearray* supposent par défaut que les données traitées sont compatibles ASCII, mais peuvent toujours être utilisées avec des données binaires, arbitraires, en passant des arguments appropriés. Notez que toutes les méthodes de *bytearray* de cette section ne travaillent jamais sur l'objet lui même, mais renvoient un nouvel objet.

source: Return a copy of the object centered in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
fr: Renvoie une copie de l'objet centrée dans une séquence de longueur *width*. Le remplissage est fait en utilisant *fillbyte* (qui par défaut est un espace ASCII). Pour les objets :class:`bytes`, la séquence initiale est renvoyée si *width* est inférieur ou égal à ``len(s)``.

source: Return a copy of the object left justified in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
fr: Renvoie une copie de l'objet aligné à gauche dans une séquence de longueur *width*. Le remplissage est fait en utilisant *fillbyte* (par défaut un espace ASCII). Pour les objets :class:`bytes`, la séquence initiale est renvoyée si *width* est inférieure ou égale à ``len(s)``.

source: Return a copy of the sequence with specified leading bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a prefix; rather, all combinations of its values are stripped::
fr: Renvoie une copie de la séquence dont certains préfixes ont été supprimés. L’argument *chars* est une séquence binaire spécifiant le jeu d'octets à supprimer. Ce nom se réfère au fait de cette méthode est généralement utilisée avec des caractères ASCII. En cas d’omission ou ``None``, la valeur par défaut de *chars* permet de supprimer des espaces ASCII. L’argument *chars* n’est pas un préfixe, toutes les combinaisons de ses valeurs sont supprimées ::

source: The binary sequence of byte values to remove may be any :term:`bytes-like object`.
fr: La séquence de valeurs à supprimer peut être tout :term:`bytes-like object`.

source: Return a copy of the object right justified in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
fr: Renvoie une copie de l'objet justifié à droite dans une séquence de longueur *width*. Le remplissage est fait en utilisant le caractère *fillbyte* (par défaut est un espace ASCII). Pour les objets :class:`bytes`, la séquence d'origine est renvoyée si *width* est inférieure ou égale à ``len(s)``.

source: Split the binary sequence into subsequences of the same type, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done, the *rightmost* ones. If *sep* is not specified or ``None``, any subsequence consisting solely of ASCII whitespace is a separator. Except for splitting from the right, :meth:`rsplit` behaves like :meth:`split` which is described in detail below.
fr: Divise la séquence d'octets en sous-séquences du même type, en utilisant *sep* comme séparateur. Si *maxsplit* est donné, c'est le nombre maximum de divisions qui pourront être faites, celles "à droite". Si *sep* est pas spécifié ou est ``None``, toute sous-séquence composée uniquement d'espaces ASCII est un séparateur. En dehors du fait qu'il découpe par la droite, :meth:`rsplit` se comporte comme :meth:`split` qui est décrit en détail ci-dessous.

source: Return a copy of the sequence with specified trailing bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a suffix; rather, all combinations of its values are stripped::
fr: Renvoie une copie de la séquence dont des octets finaux sont supprimés. L'argument *chars* est une séquence d'octets spécifiant le jeu de caractères à supprimer. En cas d'omission ou ``None``, les espaces ASCII sont supprimés. L'argument *chars* n'est pas un suffixe : toutes les combinaisons de ses valeurs sont retirées ::

source: Split the binary sequence into subsequences of the same type, using *sep* as the delimiter string. If *maxsplit* is given and non-negative, at most *maxsplit* splits are done (thus, the list will have at most ``maxsplit+1`` elements). If *maxsplit* is not specified or is ``-1``, then there is no limit on the number of splits (all possible splits are made).
fr: Divise la séquence en sous-séquences du même type, en utilisant *sep* comme séparateur. Si *maxsplit* est donné, c'est le nombre maximum de divisions qui pourront être faites (la liste aura donc au plus ``maxsplit+1`` éléments), Si *maxsplit* n'est pas spécifié ou faut ``-1``, il n'y a aucune limite au nombre de découpes (elles sont toutes effectuées).

source: If *sep* is given, consecutive delimiters are not grouped together and are deemed to delimit empty subsequences (for example, ``b'1,,2'.split(b',')`` returns ``[b'1', b'', b'2']``). The *sep* argument may consist of a multibyte sequence (for example, ``b'1<>2<>3'.split(b'<>')`` returns ``[b'1', b'2', b'3']``). Splitting an empty sequence with a specified separator returns ``[b'']`` or ``[bytearray(b'')]`` depending on the type of object being split. The *sep* argument may be any :term:`bytes-like object`.
fr: Si *sep* est donné, les délimiteurs consécutifs ne sont pas regroupés et ainsi délimitent ainsi des chaînes vides (par exemple, ``b'1,,2'.split(b',')`` donne ``[b'1', b'', b'2']``). L'argument *sep* peut contenir plusieurs sous séquences (par exemple, ``b'1<>2<>3'.split(b'<>')`` renvoie ``[b'1', b'2', b'3']``). Découper une chaîne vide en spécifiant *sep* donne ``[b'']`` ou ``[bytearray(b'')]`` en fonction du type de l'objet découpé. L'argument *sep* peut être n'importe quel :term:`bytes-like object`.

source: If *sep* is not specified or is ``None``, a different splitting algorithm is applied: runs of consecutive ASCII whitespace are regarded as a single separator, and the result will contain no empty strings at the start or end if the sequence has leading or trailing whitespace. Consequently, splitting an empty sequence or a sequence consisting solely of ASCII whitespace without a specified separator returns ``[]``.
fr: Si *sep* n'est pas spécifié ou est ``None``, un autre algorithme de découpe est appliqué : les espaces ASCII consécutifs sont considérés comme un seul séparateur, et le résultat ne contiendra pas les chaînes vides de début ou de la fin si la chaîne est préfixée ou suffixé d'espaces. Par conséquent, diviser une séquence vide ou une séquence composée d'espaces ASCII avec un séparateur ``None`` renvoie ``[]``.

source: Return a copy of the sequence with specified leading and trailing bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a prefix or suffix; rather, all combinations of its values are stripped::
fr: Renvoie une copie de la séquence dont des caractères initiaux et finaux sont supprimés. L'argument *chars* est une séquence spécifiant le jeu d'octets à supprimer, le nom se réfère au fait de cette méthode est généralement utilisée avec des caractères ASCII. En cas d'omission ou ``None``, les espaces ASCII sont supprimés. L'argument *chars* n'est ni un préfixe ni un suffixe, toutes les combinaisons de ses valeurs sont supprimées ::

source: The following methods on bytes and bytearray objects assume the use of ASCII compatible binary formats and should not be applied to arbitrary binary data. Note that all of the bytearray methods in this section do *not* operate in place, and instead produce new objects.
fr: Les méthodes suivantes sur les *bytes* et *bytearray* supposent l'utilisation d'un format binaire compatible ASCII, et donc doivent être évités lorsque vous travaillez avec des données binaires arbitraires. Notez que toutes les méthodes de *bytearray* de cette section *ne modifient pas* les octets, ils produisent de nouveaux objets.

source: Return a copy of the sequence with each byte interpreted as an ASCII character, and the first byte capitalized and the rest lowercased. Non-ASCII byte values are passed through unchanged.
fr: Renvoie une copie de la séquence dont chaque octet est interprété comme un caractère ASCII, le premier octet en capitale et le reste en minuscules. Les octets non ASCII ne sont pas modifiés.

source: Return a copy of the sequence where all ASCII tab characters are replaced by one or more ASCII spaces, depending on the current column and the given tab size. Tab positions occur every *tabsize* bytes (default is 8, giving tab positions at columns 0, 8, 16 and so on). To expand the sequence, the current column is set to zero and the sequence is examined byte by byte. If the byte is an ASCII tab character (``b'\t'``), one or more space characters are inserted in the result until the current column is equal to the next tab position. (The tab character itself is not copied.) If the current byte is an ASCII newline (``b'\n'``) or carriage return (``b'\r'``), it is copied and the current column is reset to zero. Any other byte value is copied unchanged and the current column is incremented by one regardless of how the byte value is represented when printed::
fr: Renvoie une copie de la séquence où toutes les tabulations ASCII sont remplacées par un ou plusieurs espaces ASCII, en fonction de la colonne courante et de la taille de tabulation donnée. Les positions des tabulations se trouvent tous les *tabsize* caractères (8 par défaut, ce qui donne les positions de tabulations aux colonnes 0, 8, 16 et ainsi de suite). Pour travailler sur la séquence, la colonne en cours est mise à zéro et la séquence est examinée octets par octets. Si l'octet est une tabulation ASCII (``b' '``), un ou plusieurs espaces sont insérés au résultat jusqu’à ce que la colonne courante soit égale à la position de tabulation suivante. (Le caractère tabulation lui-même n’est pas copié.) Si l'octet courant est un saut de ligne ASCII (``b' '``) ou un retour chariot (``b'\r'``), il est copié et la colonne en cours est remise à zéro. Tout autre octet est copié inchangé et la colonne en cours est incrémentée de un indépendamment de la façon dont l'octet est représenté lors de l’affichage ::

source: Lowercase ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyz'``. Uppercase ASCII characters are those byte values in the sequence ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``.
fr: Les caractères ASCII minuscules sont ``b'abcdefghijklmnopqrstuvwxyz'``. Les capitales ASCII sont ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``.

source: Return a copy of the sequence with all the uppercase ASCII characters converted to their corresponding lowercase counterpart.
fr: Renvoie une copie de la séquence dont tous les caractères ASCII en majuscules sont convertis en leur équivalent en minuscules.

source: Return a list of the lines in the binary sequence, breaking at ASCII line boundaries. This method uses the :term:`universal newlines` approach to splitting lines. Line breaks are not included in the resulting list unless *keepends* is given and true.
fr: Renvoie une liste des lignes de la séquence d'octets, découpant au niveau des fin de lignes ASCII. Cette méthode utilise l'approche :term:`universal newlines` pour découper les lignes. Les fins de ligne ne sont pas inclus dans la liste des résultats, sauf si *keepends* est donné et vrai.

source: Unlike :meth:`~bytes.split` when a delimiter string *sep* is given, this method returns an empty list for the empty string, and a terminal line break does not result in an extra line::
fr: Contrairement à :meth:`~bytes.split` lorsque le délimiteur *sep* est fourni, cette méthode renvoie une liste vide pour la chaîne vide, et un saut de ligne à la fin ne se traduit pas par une ligne supplémentaire ::

source: Return a copy of the sequence with all the lowercase ASCII characters converted to their corresponding uppercase counterpart and vice-versa.
fr: Renvoie une copie de la séquence dont tous les caractères ASCII minuscules sont convertis en majuscules et vice-versa.

source: Unlike :func:`str.swapcase()`, it is always the case that ``bin.swapcase().swapcase() == bin`` for the binary versions. Case conversions are symmetrical in ASCII, even though that is not generally true for arbitrary Unicode code points.
fr: Contrairement à :func:`str.swapcase()`, ``bin.swapcase().swapcase() == bin`` est toujours vrai. Les conversions majuscule/minuscule en ASCII étant toujours symétrique, ce qui n'est pas toujours vrai avec Unicode.

source: Return a titlecased version of the binary sequence where words start with an uppercase ASCII character and the remaining characters are lowercase. Uncased byte values are left unmodified.
fr: Renvoie une version *titlecased* de la séquence d'octets où les mots commencent par un caractère ASCII majuscule et les caractères restants sont en minuscules. Les octets non capitalisables ne sont pas modifiés.

source: Lowercase ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyz'``. Uppercase ASCII characters are those byte values in the sequence ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``. All other byte values are uncased.
fr: Les caractères ASCII minuscules sont ``b'abcdefghijklmnopqrstuvwxyz'``. Les caractères ASCII majuscules sont ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``. Aucun autre octet n'est capitalisable.

source: Return a copy of the sequence with all the lowercase ASCII characters converted to their corresponding uppercase counterpart.
fr: Renvoie une copie de la séquence dont tous les caractères ASCII minuscules sont convertis en leur équivalent majuscule.

source: Return a copy of the sequence left filled with ASCII ``b'0'`` digits to make a sequence of length *width*. A leading sign prefix (``b'+'``/ ``b'-'``) is handled by inserting the padding *after* the sign character rather than before. For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(seq)``.
fr: Renvoie une copie de la séquence remplie par la gauche du chiffre ``b'0'`` pour en faire une séquence de longueur *width*. Un préfixe (``b'+'`` / ``b'-'``) est permis par l'insertion du caractère de remplissage *après* le caractère de signe plutôt qu'avant. Pour les objets :class:`bytes` la séquence d'origine est renvoyée si *width* est inférieur ou égale à ``len(seq)``.

source: ``printf``-style Bytes Formatting
fr: Formatage de *bytes* a la ``printf``

source: The formatting operations described here exhibit a variety of quirks that lead to a number of common errors (such as failing to display tuples and dictionaries correctly). If the value being printed may be a tuple or dictionary, wrap it in a tuple.
fr: Les opérations de formatage décrites ici présentent une variété de bizarreries qui conduisent à un certain nombre d’erreurs classiques (typiquement, échouer à afficher des tuples ou des dictionnaires correctement). Si la valeur à afficher peut être un tuple ou un dictionnaire, mettez le a l'intérieur d'un autre tuple.

source: Bytes objects (``bytes``/``bytearray``) have one unique built-in operation: the ``%`` operator (modulo). This is also known as the bytes *formatting* or *interpolation* operator. Given ``format % values`` (where *format* is a bytes object), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. The effect is similar to using the :c:func:`sprintf` in the C language.
fr: Les objets *bytes* (``bytes`` et ``bytearray``) ont un unique opérateur : l'opérateur ``%`` (modulo). Il est aussi connu sous le nom d'opérateur de mise en forme. Avec ``format % values`` (où *format* est un objet *bytes*), les marqueurs de conversion ``%`` dans *format* sont remplacés par zéro ou plus de *values*. L'effet est similaire à la fonction :c:func:`sprintf` du langage C.

source: If *format* requires a single argument, *values* may be a single non-tuple object. [5]_ Otherwise, *values* must be a tuple with exactly the number of items specified by the format bytes object, or a single mapping object (for example, a dictionary).
fr: Si *format* ne nécessite qu'un seul argument, *values* peut être un objet unique. [5]_ Si *values* est un tuple, il doit contenir exactement le nombre d'éléments spécifiés dans le format en *bytes*, ou un seul objet de correspondances ( *mapping object*, par exemple, un dictionnaire).

source: When the right argument is a dictionary (or other mapping type), then the formats in the bytes object *must* include a parenthesised mapping key into that dictionary inserted immediately after the ``'%'`` character. The mapping key selects the value to be formatted from the mapping. For example:
fr: Lorsque l'argument de droite est un dictionnaire (ou un autre type de *mapping*), les marqueurs dans le *bytes* *doivent* inclure une clé présente dans le dictionnaire, écrite entre parenthèses, immédiatement après le caractère ``'%'``. La clé indique quelle valeur du dictionnaire doit être formatée. Par exemple :

source: Single byte (accepts integer or single byte objects).
fr: Octet simple (Accepte un nombre entier ou un seul objet *byte*).

source: Bytes (any object that follows the :ref:`buffer protocol <bufferobjects>` or has :meth:`__bytes__`).
fr: *Bytes* (tout objet respectant le :ref:`buffer protocol <bufferobjects>` ou ayant la méthode :meth:`__bytes__`).

source: ``'s'`` is an alias for ``'b'`` and should only be used for Python2/3 code bases.
fr: ``'s'`` est un alias de ``'b'`` et ne devrait être utilisé que pour du code Python2/3.

source: Bytes (converts any Python object using ``repr(obj).encode('ascii','backslashreplace)``).
fr: *Bytes* (convertis n'importe quel objet Python en utilisant ``repr(obj).encode('ascii', 'backslashreplace)``).

source: ``'r'`` is an alias for ``'a'`` and should only be used for Python2/3 code bases.
fr: ``'r'`` est un alias de ``'a'`` et ne devrait être utilise que dans du code Python2/3.

source: ``b'%s'`` is deprecated, but will not be removed during the 3.x series.
fr: ``b'%s'`` est obsolète, mais ne sera pas retiré des version 3.x.

source: ``b'%r'`` is deprecated, but will not be removed during the 3.x series.
fr: ``b'%r'`` est obsolète mais ne sera pas retiré dans Python 3.x.

source: :pep:`461` - Adding % formatting to bytes and bytearray
fr: :pep:`461` -- Ajout du formatage via % aux *bytes* et *bytesarray*

source: Memory Views
fr: Vues de mémoires
