Repository: python/python-docs-fr
Catalog: library/stdtypes.po
Languages: fr

source: Testing range objects for equality with ``==`` and ``!=`` compares them as sequences. That is, two range objects are considered equal if they represent the same sequence of values. (Note that two range objects that compare equal might have different :attr:`~range.start`, :attr:`~range.stop` and :attr:`~range.step` attributes, for example ``range(0) == range(2, 1, 3)`` or ``range(0, 3, 2) == range(0, 4, 2)``.)
fr: Comparer des *range* avec ``==`` et ``!=`` les compare comme des séquences. Soit deux objets *range* sont considérées comme égaux si ils représentent la même séquence de valeurs. (Notez que deux objets *range* dits égaux pourraient avoir leurs attributs :attr:`~range.start`, :attr:`~range.stop` et :attr:`~range.step` différents, par exemple ``range(0) == range(2, 1, 3)`` ou ``range(0, 3, 2) == range(0, 4, 2)``.)

source: Implement the Sequence ABC. Support slicing and negative indices. Test :class:`int` objects for membership in constant time instead of iterating through all items.
fr: Implémente la classe de base abstraite *Sequence*. Supporte le *slicing* et les indices négatifs. Tester l'appartenance d'un :class:`int` en temps constant au lieu d'itérer tous les éléments.

source: Define '==' and '!=' to compare range objects based on the sequence of values they define (instead of comparing based on object identity).
fr: ``==`` et ``!=`` comparent des *range* en fonction de la séquence de valeurs qu'ils définissent (au lieu d'une comparaison fondée sur l'identité de l'objet).

source: The :attr:`~range.start`, :attr:`~range.stop` and :attr:`~range.step` attributes.
fr: Les attributs :attr:`~range.start`, :attr:`~range.stop` et :attr:`~range.step`.

source: The `linspace recipe <http://code.activestate.com/recipes/579000/>`_ shows how to implement a lazy version of range suitable for floating point applications.
fr: La `recette linspace <http://code.activestate.com/recipes/579000/>`_ montre comment implémenter une version paresseuse de *range* adaptée aux nombres à virgule flottante.

source: Text Sequence Type --- :class:`str`
fr: Type Séquence de Texte — :class:`str`

source: Textual data in Python is handled with :class:`str` objects, or :dfn:`strings`. Strings are immutable :ref:`sequences <typesseq>` of Unicode code points. String literals are written in a variety of ways:
fr: Les données textuelles en Python est manipulé avec des objets :class:`str` ou :dfn:`strings`. Les chaînes sont des :ref:`séquences <typesseq>` immuables de points de code Unicode. Les chaînes littérales peuvent être écrites de différentes manières :

source: Single quotes: ``'allows embedded "double" quotes'``
fr: Les guillemets simples : ``'autorisent les "guillemets"'``

source: Double quotes: ``"allows embedded 'single' quotes"``.
fr: Les guillemets : ``"autorisent les guillemets 'simples'"``.

source: Triple quoted: ``'''Three single quotes'''``, ``"""Three double quotes"""``
fr: Guillemets triples : ``'''Trois guillemets simples'''``, ``"""Trois guillemets"""``

source: Triple quoted strings may span multiple lines - all associated whitespace will be included in the string literal.
fr: Les chaînes entre triple guillemets peuvent couvrir plusieurs lignes, tous les espaces associés seront inclus dans la chaîne littérale.

source: String literals that are part of a single expression and have only whitespace between them will be implicitly converted to a single string literal. That is, ``("spam " "eggs") == "spam eggs"``.
fr: Les chaînes littérales qui font partie d'une seule expression et ont seulement des espaces entre elles sont implicitement converties en une seule chaîne littérale. Autrement dit, ``("spam " "eggs") == "spam eggs"``.

source: See :ref:`strings` for more about the various forms of string literal, including supported escape sequences, and the ``r`` ("raw") prefix that disables most escape sequence processing.
fr: Voir :ref:`strings` pour plus d'informations sur les différentes formes de chaînes littérales, y compris des séquences d'échappement prises en charge, et le préfixe ``r`` (*raw* (brut)) qui désactive la plupart des traitements de séquence d'échappement.

source: Strings may also be created from other objects using the :class:`str` constructor.
fr: Les chaînes peuvent également être créés à partir d'autres objets à l'aide du constructeur :class:`str`.

source: Since there is no separate "character" type, indexing a string produces strings of length 1. That is, for a non-empty string *s*, ``s[0] == s[0:1]``.
fr: Comme il n'y a pas de type "caractère" distinct, l'indexation d'une chaîne produit des chaînes de longueur 1. Autrement dit, pour une chaîne non vide *s*, ``s[0] == s[0:1]``.

source: There is also no mutable string type, but :meth:`str.join` or :class:`io.StringIO` can be used to efficiently construct strings from multiple fragments.
fr: Il n'y a aucun type de chaîne muable, mais :meth:`str.join` ou :class:`io.StringIO` peuvent être utilisées pour construire efficacement des chaînes à partir de plusieurs fragments.

source: For backwards compatibility with the Python 2 series, the ``u`` prefix is once again permitted on string literals. It has no effect on the meaning of string literals and cannot be combined with the ``r`` prefix.
fr: Pour une compatibilité ascendante avec la série Python 2, le préfixe ``u`` est à nouveau autorisé sur les chaînes littérales. Elle n'a aucun effet sur le sens des chaînes littérales et ne peut être combiné avec le préfixe ``r``.

source: Return a :ref:`string <textseq>` version of *object*. If *object* is not provided, returns the empty string. Otherwise, the behavior of ``str()`` depends on whether *encoding* or *errors* is given, as follows.
fr: Renvoie une représentation :ref:`string <textseq>` de *object*. Si *object* n'est pas fourni, renvoie une chaîne vide. Sinon, le comportement de ``str()`` dépend de si *encoding* ou *errors* sont donnés, voir l'exemple.

source: If neither *encoding* nor *errors* is given, ``str(object)`` returns :meth:`object.__str__() <object.__str__>`, which is the "informal" or nicely printable string representation of *object*. For string objects, this is the string itself. If *object* does not have a :meth:`~object.__str__` method, then :func:`str` falls back to returning :meth:`repr(object) <repr>`.
fr: Si ni *encoding* ni *errors* ne sont donnés, ``str(object)`` renvoie :meth:`object.__str__() <object.__str__>`, qui est la représentation de chaîne "informelle" ou bien affichable de *object*. Pour les chaînes, c'est la chaîne elle-même. Si *object* n'a pas de méthode :meth:`~object.__str__`, :func:`str` utilise :meth:`repr(object) <repr>`.

source: If at least one of *encoding* or *errors* is given, *object* should be a :term:`bytes-like object` (e.g. :class:`bytes` or :class:`bytearray`). In this case, if *object* is a :class:`bytes` (or :class:`bytearray`) object, then ``str(bytes, encoding, errors)`` is equivalent to :meth:`bytes.decode(encoding, errors) <bytes.decode>`. Otherwise, the bytes object underlying the buffer object is obtained before calling :meth:`bytes.decode`. See :ref:`binaryseq` and :ref:`bufferobjects` for information on buffer objects.
fr: Si au moins un des deux arguments *encoding* ou *errors* est donné, *object* doit être un :term:`bytes-like object` (par exemple :class:`bytes` ou :class:`bytearray`). Dans ce cas, si *object* est un objet :class:`bytes` (ou :class:`bytearray`), alors ``str(bytes, encoding, errors)`` est équivalent à :meth:`bytes.decode(encoding, errors) <bytes.decode>`. Sinon, l'objet *bytes* du *buffer* est obtenu avant d'appeler :meth:`bytes.decode`. Voir :ref:`binaryseq` et :ref:`bufferobjects` pour plus d'informations sur les *buffers*.

source: Passing a :class:`bytes` object to :func:`str` without the *encoding* or *errors* arguments falls under the first case of returning the informal string representation (see also the :option:`-b` command-line option to Python). For example::
fr: Donner un objet :class:`bytes` à :func:`str` sans ni l'argument *encoding* ni l'argument *errors* relève du premier cas, où la représentation informelle de la chaîne est renvoyé (voir aussi l'option :option:`-b` de Python). Par exemple ::

source: For more information on the ``str`` class and its methods, see :ref:`textseq` and the :ref:`string-methods` section below. To output formatted strings, see the :ref:`f-strings` and :ref:`formatstrings` sections. In addition, see the :ref:`stringservices` section.
fr: Pour plus d'informations sur la classe ``str`` et ses méthodes, voir les sections :ref:`textseq` et :ref:`string-methods`. Pour formater des chaînes de caractères, voir les sections :ref:`f-strings` et :ref:`formatstrings`. La section :ref:`stringservices` contient aussi des informations.

source: String Methods
fr: Méthodes de chaînes de caractères

source: Strings implement all of the :ref:`common <typesseq-common>` sequence operations, along with the additional methods described below.
fr: Les chaînes implémentent toutes les opérations :ref:`communes des séquences <typesseq-common>`, ainsi que les autres méthodes décrites ci-dessous.

source: Strings also support two styles of string formatting, one providing a large degree of flexibility and customization (see :meth:`str.format`, :ref:`formatstrings` and :ref:`string-formatting`) and the other based on C ``printf`` style formatting that handles a narrower range of types and is slightly harder to use correctly, but is often faster for the cases it can handle (:ref:`old-string-formatting`).
fr: Les chaînes gèrent aussi deux styles de mise en forme, l'un fournissant une grande flexibilité et de personnalisation (voir :meth:`str.format`, :ref:`formatstrings` et :ref:`string-formatting`) et l'autre basée sur ``printf`` du C qui gère une gamme plus étroite des types et est légèrement plus difficile à utiliser correctement, mais il est souvent plus rapide pour les cas, il peut gérer (:ref:`old-string-formatting`).

source: The :ref:`textservices` section of the standard library covers a number of other modules that provide various text related utilities (including regular expression support in the :mod:`re` module).
fr: La section :ref:`textservices` de la bibliothèque standard couvre un certain nombre d'autres modules qui fournissent différents services relatifs au texte (y compris les expressions régulières dans le module :mod:`re`).

source: Return a copy of the string with its first character capitalized and the rest lowercased.
fr: Renvoie une copie de la chaîne avec son premier caractère en majuscule et le reste en minuscule.

source: Return a casefolded copy of the string. Casefolded strings may be used for caseless matching.
fr: Renvoie une copie *casefolded* de la chaîne. Les chaînes *casefolded* peuvent être utilisées dans des comparaison insensibles à la casse.

source: Casefolding is similar to lowercasing but more aggressive because it is intended to remove all case distinctions in a string. For example, the German lowercase letter ``'ß'`` is equivalent to ``"ss"``. Since it is already lowercase, :meth:`lower` would do nothing to ``'ß'``; :meth:`casefold` converts it to ``"ss"``.
fr: Le *casefolding* est une technique agressive de mise en minuscule, car il vise à éliminer toutes les distinctions de casse dans une chaîne. Par exemple, la lettre minuscule ``'ß'`` de l'allemand équivaut à ``"ss"``. Comme il est déjà minuscule, :meth:`lower` ferait rien à ``'ß'``; :meth:`casefold` le convertit en ``"ss"``.

source: The casefolding algorithm is described in section 3.13 of the Unicode Standard.
fr: L'algorithme de *casefolding* est décrit dans la section 3.13 de la norme Unicode.

source: Return centered in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
fr: Donne la chaîne au centre d'une chaîne de longueur *width*. Le remplissage est fait en utilisant l'argument *fillchar* (qui par défaut est un espace ASCII). La chaîne d'origine est renvoyée si *width* est inférieur ou égale à ``len(s)``.

source: Return the number of non-overlapping occurrences of substring *sub* in the range [*start*, *end*]. Optional arguments *start* and *end* are interpreted as in slice notation.
fr: Donne le nombre d'occurrences de *sub* ne se chevauchant pas dans le *range* [*start*, *end*]. Les arguments facultatifs *start* et *end* sont interprétés comme pour des *slices*.

source: Return an encoded version of the string as a bytes object. Default encoding is ``'utf-8'``. *errors* may be given to set a different error handling scheme. The default for *errors* is ``'strict'``, meaning that encoding errors raise a :exc:`UnicodeError`. Other possible values are ``'ignore'``, ``'replace'``, ``'xmlcharrefreplace'``, ``'backslashreplace'`` and any other name registered via :func:`codecs.register_error`, see section :ref:`error-handlers`. For a list of possible encodings, see section :ref:`standard-encodings`.
fr: Donne une version encodée de la chaîne sous la forme d'un objet *bytes*. L'encodage par défaut est ``'utf-8'``. *errors* peut être donné pour choisir un autre système de gestion d'erreur. La valeur par défaut pour *errors* est ``'strict'``, ce qui signifie que les erreurs d'encodage lèvent une :exc:`UnicodeError`. Les autres valeurs possibles sont ``'ignore'``, ``'replace'``, ``'xmlcharrefreplace'``, ``'backslashreplace'`` et tout autre nom enregistré *via* :func:`codecs.register_error`, voir la section :ref:`error-handlers`. Pour une liste des encodages possibles, voir la section :ref:`standard-encodings`.

source: Support for keyword arguments added.
fr: Gestion des arguments par mot clef.

source: Return ``True`` if the string ends with the specified *suffix*, otherwise return ``False``. *suffix* can also be a tuple of suffixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
fr: Donne ``True`` si la chaîne se termine par *suffix*, sinon ``False``. *suffix* peut aussi être un tuple de suffixes à rechercher. Si l'argument optionnel *start* est donné, le test se fait à partir de cette position. Si l'argument optionnel *end* est fourni, la comparaison s'arrête à cette position.

source: Return a copy of the string where all tab characters are replaced by one or more spaces, depending on the current column and the given tab size. Tab positions occur every *tabsize* characters (default is 8, giving tab positions at columns 0, 8, 16 and so on). To expand the string, the current column is set to zero and the string is examined character by character. If the character is a tab (``\t``), one or more space characters are inserted in the result until the current column is equal to the next tab position. (The tab character itself is not copied.) If the character is a newline (``\n``) or return (``\r``), it is copied and the current column is reset to zero. Any other character is copied unchanged and the current column is incremented by one regardless of how the character is represented when printed.
fr: Donne une copie de la chaîne où toutes les tabulations sont remplacées par un ou plusieurs espaces, en fonction de la colonne courante et de la taille de tabulation donnée. Les positions des tabulations se trouvent tous les *tabsize* caractères (8 par défaut, ce qui donne les positions de tabulations aux colonnes 0, 8, 16 et ainsi de suite). Pour travailler sur la chaîne, la colonne en cours est mise à zéro et la chaîne est examinée caractère par caractère. Si le caractère est une tabulation (``\t``), un ou plusieurs caractères d'espacement sont insérés dans le résultat jusqu'à ce que la colonne courante soit égale à la position de tabulation suivante. (Le caractère tabulation lui-même n'est pas copié.) Si le caractère est un saut de ligne (``\n``) ou un retour chariot (``\r``), il est copié et la colonne en cours est remise à zéro. Tout autre caractère est copié inchangé et la colonne en cours est incrémentée de un indépendamment de la façon dont le caractère est représenté lors de l'affichage.

source: Return the lowest index in the string where substring *sub* is found within the slice ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` if *sub* is not found.
fr: Donne la première la position dans la chaîne où *sub* est trouvé dans le *slice* ``s[start:end]``. Les arguments facultatifs *start* et *end* sont interprétés comme dans la notation des *slice*. Donne ``-1`` si *sub* n'est pas trouvé.

source: The :meth:`~str.find` method should be used only if you need to know the position of *sub*. To check if *sub* is a substring or not, use the :keyword:`in` operator::
fr: La méthode :meth:`~str.find` ne doit être utilisée que si vous avez besoin de connaître la position de *sub*. Pour vérifier si *sub* est une sous chaine ou non, utilisez l'opérateur :keyword:`in` ::

source: Perform a string formatting operation. The string on which this method is called can contain literal text or replacement fields delimited by braces ``{}``. Each replacement field contains either the numeric index of a positional argument, or the name of a keyword argument. Returns a copy of the string where each replacement field is replaced with the string value of the corresponding argument.
fr: Formate une chaîne. La chaîne sur laquelle cette méthode est appelée peut contenir du texte littéral ou des emplacements de remplacement délimités par des accolades ``{}``. Chaque champ de remplacement contient soit l'indice numérique d'un argument positionnel, ou le nom d'un argument donné par mot-clé. Renvoie une copie de la chaîne où chaque champ de remplacement est remplacé par la valeur de chaîne de l'argument correspondant.

source: See :ref:`formatstrings` for a description of the various formatting options that can be specified in format strings.
fr: Voir :ref:`formatstrings` pour une description des options de formatage qui peuvent être spécifiées dans les chaînes de format.

source: When formatting a number (:class:`int`, :class:`float`, :class:`complex`, :class:`decimal.Decimal` and subclasses) with the ``n`` type (ex: ``'{:n}'.format(1234)``), the function temporarily sets the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale to decode ``decimal_point`` and ``thousands_sep`` fields of :c:func:`localeconv` if they are non-ASCII or longer than 1 byte, and the ``LC_NUMERIC`` locale is different than the ``LC_CTYPE`` locale. This temporary change affects other threads.
fr: Lors du formatage avec le format ``n`` (comme ``'{:n}'.format(1234)``) d'un nombre (:class:`int`, :class:`float`, :class:`complex`, :class:`decimal.Decimal` et dérivées), la fonction met temporairement la variable ``LC_CTYPE`` à la valeur de ``LC_NUMERIC`` pour décoder correctement les attributs ``decimal_point`` et ``thousands_sep`` de :c:func:`localeconv`, s'ils ne sont pas en ASCII ou font plus d'un octet, et que ``LC_NUMERIC`` est différent de ``LC_CTYPE``. Ce changement temporaire affecte les autres fils d'exécution.

source: When formatting a number with the ``n`` type, the function sets temporarily the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale in some cases.
fr: Lors du formatage d'un nombre avec le format ``n``, la fonction change temporairement ``LC_CTYPE`` par la valeur de ``LC_NUMERIC`` dans certains cas.

source: Similar to ``str.format(**mapping)``, except that ``mapping`` is used directly and not copied to a :class:`dict`. This is useful if for example ``mapping`` is a dict subclass:
fr: Semblable à ``str.format(**mapping)``, sauf que ``mapping`` est utilisé directement et non copié dans un :class:`dict`. C'est utile si, par exemple ``mapping`` est une sous-classe de ``dict`` :

source: Like :meth:`~str.find`, but raise :exc:`ValueError` when the substring is not found.
fr: Comme :meth:`~str.find`, mais lève une :exc:`ValueError` lorsque la chaîne est introuvable.

source: Return a string which is the concatenation of the strings in *iterable*. A :exc:`TypeError` will be raised if there are any non-string values in *iterable*, including :class:`bytes` objects. The separator between elements is the string providing this method.
fr: Donne une chaîne qui est la concaténation des chaînes contenues dans *iterable*. Une :exc:`TypeError` sera levée si une valeur d'*iterable* n'est pas une chaîne, y compris pour les objets :class:`bytes`. Le séparateur entre les éléments est la chaîne fournissant cette méthode.

source: Return the string left justified in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
fr: Renvoie la chaîne justifiée à gauche dans une chaîne de longueur *width*. Le rembourrage est fait en utilisant *fillchar* (qui par défaut est un espace ASCII). La chaîne d'origine est renvoyée si *width* est inférieur ou égale à ``len(s)``.

source: Return a copy of the string with all the cased characters [4]_ converted to lowercase.
fr: Renvoie une copie de la chaîne avec tous les caractères capitalisables [4]_ convertis en minuscules.

source: The lowercasing algorithm used is described in section 3.13 of the Unicode Standard.
fr: L'algorithme de mise en minuscules utilisé est décrit dans la section 3.13 de la norme Unicode.

source: Return a copy of the string with leading characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a prefix; rather, all combinations of its values are stripped::
fr: Renvoie une copie de la chaîne des caractères supprimés au début. L'argument *chars* est une chaîne spécifiant le jeu de caractères à supprimer. En cas d'omission ou ``None``, la valeur par défaut de *chars* permet de supprimer des espaces. L'argument *chars* n'est pas un préfixe, toutes les combinaisons de ses valeurs sont supprimées ::

source: This static method returns a translation table usable for :meth:`str.translate`.
fr: Cette méthode statique renvoie une table de traduction utilisable pour :meth:`str.translate`.

source: If there is only one argument, it must be a dictionary mapping Unicode ordinals (integers) or characters (strings of length 1) to Unicode ordinals, strings (of arbitrary lengths) or ``None``. Character keys will then be converted to ordinals.
fr: Si un seul argument est fourni, ce soit être un dictionnaire faisant correspondre des points de code Unicode (nombres entiers) ou des caractères (chaînes de longueur 1) à des points de code Unicode.

source: If there are two arguments, they must be strings of equal length, and in the resulting dictionary, each character in x will be mapped to the character at the same position in y. If there is a third argument, it must be a string, whose characters will be mapped to ``None`` in the result.
fr: Si deux arguments sont fournis, ce doit être deux chaînes de caractères de même longueur. Le dictionnaire renvoyé fera correspondre pour chaque caractère de x un caractère de y pris à la même place. Si un troisième argument est fourni, ce doit être une chaîne dont chaque caractère correspondra à ``None`` dans le résultat.
