Repository: python/python-docs-fr
Catalog: library/string.po
Languages: fr

source: Alternatively, you can provide the entire regular expression pattern by overriding the class attribute *pattern*. If you do this, the value must be a regular expression object with four named capturing groups. The capturing groups correspond to the rules given above, along with the invalid placeholder rule:
fr: Également, vous pouvez fournir le motif d'expression rationnelle en entier en redéfinissant l'attribut *pattern*. Si vous faites cela, la valeur doit être un objet 'expression rationnelle' avec quatre groupes de capture de noms. Les groupes de capture correspondent aux règles données au-dessus, ainsi qu'à la règle du substituant invalide :

source: *escaped* -- This group matches the escape sequence, e.g. ``$$``, in the default pattern.
fr: *escaped* -- Ce groupe lie les séquences échappées (par exemple ``$$``) dans le motif par défaut.

source: *named* -- This group matches the unbraced placeholder name; it should not include the delimiter in capturing group.
fr: *named* -- Ce groupe lie les substituants non entourés d'accolades ; il ne devrait pas inclure le délimiteur dans le groupe de capture.

source: *braced* -- This group matches the brace enclosed placeholder name; it should not include either the delimiter or braces in the capturing group.
fr: *braced* -- Ce groupe lie le nom entouré d'accolades ; il ne devrait inclure ni le délimiteur, ni les accolades dans le groupe de capture.

source: *invalid* -- This group matches any other delimiter pattern (usually a single delimiter), and it should appear last in the regular expression.
fr: *invalid* -- Ce groupe lie tout autre motif de délimitation (habituellement, un seul délimiteur) et il devrait apparaître en dernier dans l'expression rationnelle.

source: Helper functions
fr: Fonctions d'assistance

source: Split the argument into words using :meth:`str.split`, capitalize each word using :meth:`str.capitalize`, and join the capitalized words using :meth:`str.join`. If the optional second argument *sep* is absent or ``None``, runs of whitespace characters are replaced by a single space and leading and trailing whitespace are removed, otherwise *sep* is used to split and join the words.
fr: Divise l'argument en mots en utilisant :meth:`str.split`, capitalise chaque mot en utilisant :meth:`str.capitalize` et assemble les mots capitalisés en utilisant :meth:`str.join`. Si le second argument optionnel *sep* est absent ou vaut ``None``, les séquences de caractères blancs sont remplacées par un seul espace et les espaces débutant et finissant la chaîne sont retirés. Sinon, *sep* et utilisé pour séparer et ré-assembler les mots.
