Repository: python/python-docs-fr
Catalog: library/string.po
Languages: fr

source: :mod:`string` --- Common string operations
fr: :mod:`string` --- Opérations usuelles sur des chaînes

source: **Source code:** :source:`Lib/string.py`
fr: **Code source :** :source:`Lib/string.py`

source: String constants
fr: Chaînes constantes

source: The constants defined in this module are:
fr: Les constantes définies dans ce module sont :

source: The concatenation of the :const:`ascii_lowercase` and :const:`ascii_uppercase` constants described below. This value is not locale-dependent.
fr: La concaténation des constantes :const:`ascii_lowercase` et :const:`ascii.uppercase` décrites ci-dessous. Cette valeur n'est pas dépendante de l'environnement linguistique.

source: The lowercase letters ``'abcdefghijklmnopqrstuvwxyz'``. This value is not locale-dependent and will not change.
fr: Les lettres minuscules ``'abcdefghijklmnopqrstuvwxyz``. Cette valeur de dépend pas de l'environnement linguistique et ne changera pas.

source: The uppercase letters ``'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``. This value is not locale-dependent and will not change.
fr: Les lettres majuscules ``'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``. Cette valeur de dépend pas de l'environnement linguistique et ne changera pas.

source: The string ``'0123456789'``.
fr: La chaîne ``'0123456789'``.

source: The string ``'0123456789abcdefABCDEF'``.
fr: La chaîne ``'0123456789abcdefABCDEF'``.

source: The string ``'01234567'``.
fr: La chaîne ``'01234567``.

source: String of ASCII characters which are considered punctuation characters in the ``C`` locale.
fr: Chaîne de caractères ASCII considérés comme ponctuation dans l'environnement linguistique ``C``.

source: String of ASCII characters which are considered printable. This is a combination of :const:`digits`, :const:`ascii_letters`, :const:`punctuation`, and :const:`whitespace`.
fr: Chaîne de caractères ASCII considérés comme affichables. C'est une combinaison de :const:`digits`, :const:`ascii_letters`, :const:`punctuation`, et :const:`whitespace`.

source: A string containing all ASCII characters that are considered whitespace. This includes the characters space, tab, linefeed, return, formfeed, and vertical tab.
fr: Une chaîne comprenant tous les caractères ASCII considérés comme espaces. Sont inclus les caractères espace, tabulations, saut de ligne, retour du chariot, saut de page, et tabulation verticale.

source: Custom String Formatting
fr: Formatage personnalisé de chaîne

source: The built-in string class provides the ability to do complex variable substitutions and value formatting via the :meth:`~str.format` method described in :pep:`3101`. The :class:`Formatter` class in the :mod:`string` module allows you to create and customize your own string formatting behaviors using the same implementation as the built-in :meth:`~str.format` method.
fr: La classe primitive `string` fournit la possibilité de faire des substitutions de variables complexes et du formatage de valeurs via la méthode :meth:`~str.format` décrite par :pep:`3101`. La classe :class:`Formatter` dans le module :mod:`string` permet de créer et personnaliser vos propres comportements de formatage de chaînes en utilisant la même implémentation que la méthode primitive :meth:`~str.format`.

source: The :class:`Formatter` class has the following public methods:
fr: La classe :class:`Formatter` a les méthodes publiques suivantes : ::

source: The primary API method. It takes a format string and an arbitrary set of positional and keyword arguments. It is just a wrapper that calls :meth:`vformat`.
fr: La méthode principale de l'API. Elle prend une chaîne de format et un ensemble arbitraire d'arguments positions et mot-clefs. C'est uniquement un conteneur qui appelle :meth:`vformat`.

source: A format string argument is now :ref:`positional-only <positional-only_parameter>`.
fr: L'argument *format_string* est maintenant :ref:`obligatoirement un paramètre positionnel <positional-only_parameter>`.

source: This function does the actual work of formatting. It is exposed as a separate function for cases where you want to pass in a predefined dictionary of arguments, rather than unpacking and repacking the dictionary as individual arguments using the ``*args`` and ``**kwargs`` syntax. :meth:`vformat` does the work of breaking up the format string into character data and replacement fields. It calls the various methods described below.
fr: Cette fonction fait le travail effectif du formatage. Elle existe comme méthode séparée au cas où vous voudriez passer un dictionnaire d'arguments prédéfini plutôt que décompresser et recompresser le dictionnaire en arguments individuels en utilisant la syntaxe ``*args`` et ``**kwargs``. :meth:`vformat` s'occupe de découper la chaîne de format en données de caractères et champs de remplacement. Elle appelle les différentes méthodes décrites ci-dessous.

source: In addition, the :class:`Formatter` defines a number of methods that are intended to be replaced by subclasses:
fr: De plus, la classe :class:`Formatter` définit un certain nombre de méthodes qui ont pour vocation d'être remplacées par des sous-classes :

source: Loop over the format_string and return an iterable of tuples (*literal_text*, *field_name*, *format_spec*, *conversion*). This is used by :meth:`vformat` to break the string into either literal text, or replacement fields.
fr: Boucle sur la chaîne de format et renvoie un itérable de *tuples* (*literal_text*, *field_name*, *format_spec*, *conversion*). Ceci est utilisé par :meth:`vformat` pour découper la chaîne de format en littéraux ou en champs de remplacement.

source: The values in the tuple conceptually represent a span of literal text followed by a single replacement field. If there is no literal text (which can happen if two replacement fields occur consecutively), then *literal_text* will be a zero-length string. If there is no replacement field, then the values of *field_name*, *format_spec* and *conversion* will be ``None``.
fr: Les valeurs dans le *tuple* représentent conceptuellement un ensemble de littéraux suivis d'un unique champ de remplacement. S'il n'y a pas de littéral, (ce qui peut arriver si deux champs de remplacement sont placés côte à côte), alors *literal_text* est une chaîne vide. S'il n'y a pas de champ de remplacement, les valeurs *field_name*, *format_spec* et *conversion* sont mises à ``None``.

source: Given *field_name* as returned by :meth:`parse` (see above), convert it to an object to be formatted. Returns a tuple (obj, used_key). The default version takes strings of the form defined in :pep:`3101`, such as "0[name]" or "label.title". *args* and *kwargs* are as passed in to :meth:`vformat`. The return value *used_key* has the same meaning as the *key* parameter to :meth:`get_value`.
fr: Récupère le champ *field_name* du *tuple* renvoyé par :meth:`parse` (voir ci-dessus), le convertit en un objet à formater. Renvoie un *tuple* (*obj*, *used_key*). La version par défaut prend une chaîne de la forme définie par :pep:`3101`, telle que `"0[name]"` ou `"label.title"`. *args* et *kwargs* sont tels que ceux passés à :meth:`vformat`. La valeur renvoyée *used_key* a le même sens que le paramètre *key* de :meth:`get_value`.

source: Retrieve a given field value. The *key* argument will be either an integer or a string. If it is an integer, it represents the index of the positional argument in *args*; if it is a string, then it represents a named argument in *kwargs*.
fr: récupère la valeur d'un champ donné. L'argument *key* est soit un entier, soit une chaîne. Si c'est un entier, il représente l'indice de la l'argument dans *args*. Si c'est une chaîne de caractères, elle représente le nom de l'argument dans *kwargs*.

source: The *args* parameter is set to the list of positional arguments to :meth:`vformat`, and the *kwargs* parameter is set to the dictionary of keyword arguments.
fr: Le paramètre *args* est défini par la liste des arguments positionnels de :meth:`vformat`, et le paramètre *kwargs* est défini par le dictionnaire des arguments mot-clefs.

source: For compound field names, these functions are only called for the first component of the field name; Subsequent components are handled through normal attribute and indexing operations.
fr: Pour les noms de champs composés, ces fonctions sont uniquement appelées sur la première composante du nom. Les composantes suivantes sont manipulées au travers des attributs normaux et des opérations sur les indices.

source: So for example, the field expression '0.name' would cause :meth:`get_value` to be called with a *key* argument of 0. The ``name`` attribute will be looked up after :meth:`get_value` returns by calling the built-in :func:`getattr` function.
fr: Donc par exemple, le champ-expression ``0.name`` amènerait :meth:`get_value` à être appelée avec un argument *key* valant 0. L'attribut ``name`` sera recherché après l'appel :meth:`get_value` en faisant appel à la primitive :func:`getattr`.

source: If the index or keyword refers to an item that does not exist, then an :exc:`IndexError` or :exc:`KeyError` should be raised.
fr: Si l'indice ou le mot-clef fait référence à un objet qui n'existe pas, alors une exception :exc:`IndexError` ou :exc:`KeyError` doit être levée.

source: Implement checking for unused arguments if desired. The arguments to this function is the set of all argument keys that were actually referred to in the format string (integers for positional arguments, and strings for named arguments), and a reference to the *args* and *kwargs* that was passed to vformat. The set of unused args can be calculated from these parameters. :meth:`check_unused_args` is assumed to raise an exception if the check fails.
fr: Implémente une vérification pour les arguments non utilisés si désiré. L'argument de cette fonction est l'ensemble des clefs qui ont été effectivement référencées dans la chaîne de format (des entiers pour les indices et des chaînes de caractères pour les arguments nommés), et une référence vers les arguments *args* et *kwargs* qui ont été passés à `vformat`. L'ensemble des arguments non utilisés peut être calculé sur base de ces paramètres. :meth:`check_unused_args` est censée lever une exception si la vérification échoue.

source: :meth:`format_field` simply calls the global :func:`format` built-in. The method is provided so that subclasses can override it.
fr: La méthode :meth:`format_field` fait simplement appel à la primitive globale :func:`format`. Cette méthode est fournie afin que les sous-classes puisse la redéfinir.

source: Converts the value (returned by :meth:`get_field`) given a conversion type (as in the tuple returned by the :meth:`parse` method). The default version understands 's' (str), 'r' (repr) and 'a' (ascii) conversion types.
fr: Convertit la valeur (renvoyée par :meth:`get_field`) selon un type de conversion donné (comme dans le tuple renvoyé par la méthode :meth:`parse`). La version par défaut comprend 's' (`str`), 'r' (`repr`) et 'a' (ASCII) comme types de conversion.

source: Format String Syntax
fr: Syntaxe de formatage de chaîne

source: The :meth:`str.format` method and the :class:`Formatter` class share the same syntax for format strings (although in the case of :class:`Formatter`, subclasses can define their own format string syntax). The syntax is related to that of :ref:`formatted string literals <f-strings>`, but there are differences.
fr: La méthode :meth:`str.format` et la classe :class:`Formatter` partagent la même syntaxe pour les chaînes de formatage (bien que dans le cas de :class:`Formatter` les sous-classes puissent définir leur propre syntaxe). La syntaxe est liée à celle des :ref:`chaînes de formatage littérales <f-strings>`, mais il y a quelques différences.

source: Format strings contain "replacement fields" surrounded by curly braces ``{}``. Anything that is not contained in braces is considered literal text, which is copied unchanged to the output. If you need to include a brace character in the literal text, it can be escaped by doubling: ``{{`` and ``}}``.
fr: Les chaînes de formatage contiennent des "champs de remplacement" entourés d'accolades ``{}``. Tout ce qui n'est pas placé entre deux accolades est considéré comme littéral, qui est copié tel quel dans le résultat. Si vous avez besoin d'inclure une accolade en littéral, elles peuvent être échappées en les doublant : ``{{`` et ``}}``.

source: The grammar for a replacement field is as follows:
fr: La grammaire pour un champ de remplacement est défini comme suit :

source: In less formal terms, the replacement field can start with a *field_name* that specifies the object whose value is to be formatted and inserted into the output instead of the replacement field. The *field_name* is optionally followed by a *conversion* field, which is preceded by an exclamation point ``'!'``, and a *format_spec*, which is preceded by a colon ``':'``. These specify a non-default format for the replacement value.
fr: En termes moins formels, un champ de remplacement peut débuter par un *field_name* qui spécifie l'objet dont la valeur va être formatée et insérée dans le résultat à l'endroit du champ de remplacement Le *field_name* peut éventuellement être suivi d'un champ *conversion* qui est précédé d'un point d'exclamation ``'!'``, et d'un *format_spec* qui est précédé par deux-points ``':'``. Cela définit un format personnalisé pour le remplacement d'une valeur.

source: See also the :ref:`formatspec` section.
fr: Voir également la section :ref:`formatspec`.

source: The *field_name* itself begins with an *arg_name* that is either a number or a keyword. If it's a number, it refers to a positional argument, and if it's a keyword, it refers to a named keyword argument. If the numerical arg_names in a format string are 0, 1, 2, ... in sequence, they can all be omitted (not just some) and the numbers 0, 1, 2, ... will be automatically inserted in that order. Because *arg_name* is not quote-delimited, it is not possible to specify arbitrary dictionary keys (e.g., the strings ``'10'`` or ``':-]'``) within a format string. The *arg_name* can be followed by any number of index or attribute expressions. An expression of the form ``'.name'`` selects the named attribute using :func:`getattr`, while an expression of the form ``'[index]'`` does an index lookup using :func:`__getitem__`.
fr: Le champ *field_name* débute par un *arg_name* qui est soit un nombre, soit un mot-clef. Si c'est un nombre, il fait référence à un des arguments positionnels et si c'est un mot-clef, il fait référence à un des arguments nommés. Si les valeurs numériques de *arg_name* dans une chaîne de format sont 0, 1, 2, ... dans l'ordre, elles peuvent être omises (toutes ou aucune), et les nombres 0, 1, 2, ... seront automatiquement insérés dans cet ordre. Puisque *arg_name* n'est pas délimité par des guillemets, il n'est pas possible de spécifier des clefs de dictionnaire arbitraires (par exemple les chaînes ``'10'`` ou ``':-]'``) dans une chaîne de format. La valeur *arg_name* peut être suivie par un nombre d'indices ou d'expressions quelconque. Une expression de la forme ``'.name'`` sélectionne l'attribut nommé en utilisant :func:`getattr` alors qu'une expression de la forme ``'[index]'`` recherche l'indice en utilisant :func:`__getitem__`.

source: The positional argument specifiers can be omitted for :meth:`str.format`, so ``'{} {}'.format(a, b)`` is equivalent to ``'{0} {1}'.format(a, b)``.
fr: Les spécificateurs de position d'argument peuvent être omis dans les appels à :meth:`str.format`. Donc ``'{} {}'.format(a, b)`` est équivalent à ``'{0} {1}'.format(a, b)``.

source: The positional argument specifiers can be omitted for :class:`Formatter`.
fr: Les spécificateurs de position d'argument peuvent être omis pour :class:`Formatter`.

source: Some simple format string examples::
fr: Quelques exemples simples de formatage de chaînes : ::

source: The *conversion* field causes a type coercion before formatting. Normally, the job of formatting a value is done by the :meth:`__format__` method of the value itself. However, in some cases it is desirable to force a type to be formatted as a string, overriding its own definition of formatting. By converting the value to a string before calling :meth:`__format__`, the normal formatting logic is bypassed.
fr: Le champ *conversion* crée une contrainte de type avant de formater. Normalement, le travail de formatage d'une valeur est fait par la méthode :meth:`__format__` de la valeur elle-même. Cependant, dans certains cas, il est désirable de forcer un type à être formaté en une chaîne, en ré-définissant sa propre définition de formatage. En convertissant une valeur en chaîne de caractère avant d'appeler la méthode :meth:`__format__`, on outrepasse la logique usuelle de formatage.

source: Three conversion flags are currently supported: ``'!s'`` which calls :func:`str` on the value, ``'!r'`` which calls :func:`repr` and ``'!a'`` which calls :func:`ascii`.
fr: Actuellement, trois indicateurs sont supportés : ``'!s'`` qui appelle la fonction :func:`str` sur la valeur, ``'!r'`` qui appelle la fonction :func:`repr` et ``!a`` qui appelle la fonction :func:`ascii`.

source: Some examples::
fr: Quelques exemples : ::

source: The *format_spec* field contains a specification of how the value should be presented, including such details as field width, alignment, padding, decimal precision and so on. Each value type can define its own "formatting mini-language" or interpretation of the *format_spec*.
fr: Le champ *format_spec* contient une spécification sur la manière selon laquelle la valeur devrait être représentée : des informations telles que la longueur du champ, l'alignement, le remplissage, la précision décimale, etc. Chaque type peut définir son propre "mini-langage de formatage" ou sa propre interprétation de *format_spec*.

source: Most built-in types support a common formatting mini-language, which is described in the next section.
fr: La plupart des types natifs supportent un mini-langage de formatage usuel qui est décrit dans la section suivante.

source: A *format_spec* field can also include nested replacement fields within it. These nested replacement fields may contain a field name, conversion flag and format specification, but deeper nesting is not allowed. The replacement fields within the format_spec are substituted before the *format_spec* string is interpreted. This allows the formatting of a value to be dynamically specified.
fr: Un champ *format_spec* peut contenir un champ de remplacement imbriqué. Ces champs de remplacement imbriqués peuvent contenir un nom de champ, un indicateur de conversion, mais une imbrication récursive plus profonde n'est pas permise. Les champs de remplacement au sein de *format_spec* sont substitués avant que la chaîne *format_spec* ne soit interprétée. Cela permet que le formatage d'une valeur soit dynamiquement spécifié.

source: See the :ref:`formatexamples` section for some examples.
fr: Voir la section :ref:`formatexamples` pour des exemples.

source: Format Specification Mini-Language
fr: Mini-langage de spécification de format

source: "Format specifications" are used within replacement fields contained within a format string to define how individual values are presented (see :ref:`formatstrings` and :ref:`f-strings`). They can also be passed directly to the built-in :func:`format` function. Each formattable type may define how the format specification is to be interpreted.
fr: Les "Spécifications de format" sont utilisées avec les champs de remplacement contenus dans les chaînes de formatage, pour définir comment les valeurs doivent être représentées (voir :ref:`formatstrings` et :ref:`f-strings`). Elles peuvent aussi être passées directement à la fonction native :func:`format`. Chaque type *formatable* peut définir comment les spécifications sur les valeurs de ce type doivent être interprétées.

source: Most built-in types implement the following options for format specifications, although some of the formatting options are only supported by the numeric types.
fr: La plupart des primitives implémentent les les options suivantes, même si certaines options de formatage ne sont supportées que pour les types numériques.

source: A general convention is that an empty format string (``""``) produces the same result as if you had called :func:`str` on the value. A non-empty format string typically modifies the result.
fr: Une convention généralement admise est qu'une chaîne vide (``""``) produit le même résultat que si vous aviez appelé :func:`str` sur la valeur. Une chaîne de format non vide modifie typiquement le résultat.

source: The general form of a *standard format specifier* is:
fr: La forme générale d'un *spécificateur de format standard* est : ::

source: If a valid *align* value is specified, it can be preceded by a *fill* character that can be any character and defaults to a space if omitted. It is not possible to use a literal curly brace ("``{``" or "``}``") as the *fill* character in a :ref:`formatted string literal <f-strings>` or when using the :meth:`str.format` method. However, it is possible to insert a curly brace with a nested replacement field. This limitation doesn't affect the :func:`format` function.
fr: Si une valeur valide est spécifiée pour *align*, elle peut être précédée par un caractère *fill*, qui peut être n'importe quel caractère (espace par défaut si la valeur est omise). Il n'est pas possible d'utiliser une accolade littérale ("``{``" ou "``}``") comme caractère *fill* dans une :ref:`chaîne de formatage littérale <f-strings>` ou avec la méthode :meth:`str.format`. Cependant, il est possible d'insérer une accolade à l'aide d'un champ de remplacement imbriqué. Cette limitation n'affecte pas la fonction :func:`format`.

source: The meaning of the various alignment options is as follows:
fr: Le sens des différentes options d'alignement est donné comme suit :

source: Meaning
fr: Signification

source: Forces the field to be left-aligned within the available space (this is the default for most objects).
fr: Force le champ à être aligné à gauche dans l'espace disponible (c'est le spécificateur par défaut pour la plupart des objets).

source: Forces the field to be right-aligned within the available space (this is the default for numbers).
fr: Force le champ à être aligné à droite dans l'espace disponible (c'est le spécificateur par défaut pour les nombres).

source: Forces the padding to be placed after the sign (if any) but before the digits. This is used for printing fields in the form '+000000120'. This alignment option is only valid for numeric types. It becomes the default when '0' immediately precedes the field width.
fr: Force le remplissage (*padding*) à être placé après le signe (si signe il y a) mais avant les chiffres. L'option est utilisée pour afficher les champs sous la forme "+000000120". Cette option d'alignement est valide uniquement pour les types numériques. Elle devient activée par défaut quand "0" précède directement la largeur de champ.

source: Forces the field to be centered within the available space.
fr: Force le champ à être centré dans l'espace disponible.

source: Note that unless a minimum field width is defined, the field width will always be the same size as the data to fill it, so that the alignment option has no meaning in this case.
fr: Notons que la longueur du champ est toujours égale à la la taille nécessaire pour remplir le champ avec l'objet à moins que la valeur minimum ne soit précisée. Ainsi, si aucune valeur n'est précisée, l'option d'alignement n'a aucun sens.

source: The *sign* option is only valid for number types, and can be one of the following:
fr: L'option *sign* est uniquement valide pour les type numériques, et peut valoir :
