Repository: python/python-docs-fr
Catalog: library/string.po
Languages: fr

source: indicates that a sign should be used for both positive as well as negative numbers.
fr: Indique que le signe doit être affiché pour les nombres tant positifs que négatifs.

source: indicates that a sign should be used only for negative numbers (this is the default behavior).
fr: Indique que le signe doit être affiché uniquement pour les nombres négatifs (c'est le comportement par défaut).

source: space
fr: espace

source: indicates that a leading space should be used on positive numbers, and a minus sign on negative numbers.
fr: Indique qu'un espace doit précéder les nombres positifs et qu'un signe moins doit précéder les nombres négatifs.

source: The ``'#'`` option causes the "alternate form" to be used for the conversion. The alternate form is defined differently for different types. This option is only valid for integer, float, complex and Decimal types. For integers, when binary, octal, or hexadecimal output is used, this option adds the prefix respective ``'0b'``, ``'0o'``, or ``'0x'`` to the output value. For floats, complex and Decimal the alternate form causes the result of the conversion to always contain a decimal-point character, even if no digits follow it. Normally, a decimal-point character appears in the result of these conversions only if a digit follows it. In addition, for ``'g'`` and ``'G'`` conversions, trailing zeros are not removed from the result.
fr: L'option ``'#'`` impose l'utilisation de la "forme alternative" pour la conversion. La forme alternative est définie différemment pour différent types. Cette option est uniquement valide pour les types entiers flottants, complexes, et décimaux. Pour les entiers, quand l'affichage binaire, octal ou hexadécimal est utilisé, cette option ajoute le préfixe ``'0b'``, ``'0o'``, ou ``'0x'`` à la valeur affichée. Pour les flottants, les complexes, et les décimaux, la forme alternative impose que le résultat de la conversion contienne toujours une virgule, même si aucun chiffre ne vient après. Normalement, une virgule apparaît dans le résultat de ces conversions seulement si un chiffre le suit. De plus, pour les conversions ``'g'`` et ``'G'``, les zéros finaux ne sont pas retirés du résultat.

source: The ``','`` option signals the use of a comma for a thousands separator. For a locale aware separator, use the ``'n'`` integer presentation type instead.
fr: L'option ``','`` signale l'utilisation d'une virgule comme séparateur des milliers. Pour un séparateur conscient de l'environnement linguistique, utilisez plutôt le type de présentation entière ``'n'``.

source: Added the ``','`` option (see also :pep:`378`).
fr: Ajout de l'option ``','`` (voir :pep:`378`).

source: The ``'_'`` option signals the use of an underscore for a thousands separator for floating point presentation types and for integer presentation type ``'d'``. For integer presentation types ``'b'``, ``'o'``, ``'x'``, and ``'X'``, underscores will be inserted every 4 digits. For other presentation types, specifying this option is an error.
fr: L'option ``'_'`` demande l'utilisation d'un tiret bas comme séparateur des milliers pour les représentations de nombres flottants et pour les entiers représentés par le type ``'d'``. Pour les types de représentation d'entiers ``'b'``, ``'o'``, ``'x'`` et ``'X'``, les tirets bas seront insérés tous les 4 chiffres. Pour les autres types de représentation, spécifier cette option est une erreur.

source: Added the ``'_'`` option (see also :pep:`515`).
fr: Ajout de l'option ``'_'`` (voir aussi :pep`515`).

source: *width* is a decimal integer defining the minimum field width. If not specified, then the field width will be determined by the content.
fr: *width* est un entier en base 10 qui définit la longueur minimale du champ. Si elle n'est pas spécifiée, alors le champ *width* est déterminé par le contenu.

source: When no explicit alignment is given, preceding the *width* field by a zero (``'0'``) character enables sign-aware zero-padding for numeric types. This is equivalent to a *fill* character of ``'0'`` with an *alignment* type of ``'='``.
fr: Quand aucun alignement explicite n'est donné, précéder le champs *width* d'un caractère zéro (``'0'``) active le remplissage par zéro des types numériques selon leur signe. Cela est équivalent à un caractère de remplissage *fill* valant ``'0'`` avec le type d'alignement *alignment* valant ``'='``.

source: The *precision* is a decimal number indicating how many digits should be displayed after the decimal point for a floating point value formatted with ``'f'`` and ``'F'``, or before and after the decimal point for a floating point value formatted with ``'g'`` or ``'G'``. For non-number types the field indicates the maximum field size - in other words, how many characters will be used from the field content. The *precision* is not allowed for integer values.
fr: La valeur *precision* est un nombre en base 10 indiquant combien de chiffres doivent être affichés après la virgule pour une valeur à virgule flottante formatée avec ``'f'`` ou ``'F'``, ou avant et après le point-décimal pour une valeur à virgule flottante formatée avec ``'g'`` ou ``'G'``. Pour les types non numériques, ce champ indique la taille maximale du champ, autrement dit, combien de caractères du champ sont utilisés. Le spécificateur *precision* n'est pas autorisé sur les entiers.

source: Finally, the *type* determines how the data should be presented.
fr: Finalement, le spécificateur *type* détermine comment la donnée doit être représentée.

source: The available string presentation types are:
fr: Les types disponibles de représentation de chaîne sont :

source: String format. This is the default type for strings and may be omitted.
fr: Format de chaîne. C'est le type par défaut pour les chaînes de caractères et peut être omis.

source: The same as ``'s'``.
fr: Pareil que ``'s'``.

source: The available integer presentation types are:
fr: Les types disponibles de représentation d'entier sont :

source: Binary format. Outputs the number in base 2.
fr: Format binaire. Affiche le nombre en base 2.

source: Character. Converts the integer to the corresponding unicode character before printing.
fr: Caractère. Convertit l'entier en le caractère Unicode associé avant de l'afficher.

source: Decimal Integer. Outputs the number in base 10.
fr: Entier décimal. Affiche le nombre en base 10.

source: Octal format. Outputs the number in base 8.
fr: Format octal. Affiche le nombre en base 8.

source: Number. This is the same as ``'d'``, except that it uses the current locale setting to insert the appropriate number separator characters.
fr: Nombre. Pareil que ``'d'`` si ce n'est que l'environnement linguistique est utilisé afin de déterminer le séparateur de nombres approprié.

source: The same as ``'d'``.
fr: Pareil que ``'d'``.

source: In addition to the above presentation types, integers can be formatted with the floating point presentation types listed below (except ``'n'`` and ``None``). When doing so, :func:`float` is used to convert the integer to a floating point number before formatting.
fr: En plus des types de représentation ci-dessus, les entiers peuvent aussi être formatés avec les types de représentation des flottants listés ci-dessous (à l'exception de ``'n'`` et ``None``). Dans ce cas, la fonction :func:`float` est utilisée pour convertir l'entier en flottant avant le formatage.

source: The available presentation types for floating point and decimal values are:
fr: les types de représentation pour les nombres flottants et les valeurs décimales sont :

source: Exponent notation. Prints the number in scientific notation using the letter 'e' to indicate the exponent. The default precision is ``6``.
fr: Notation par exposant. Affiche le nombre dans sa notation scientifique en utilisant la lettre 'e' pour indiquer l'exposant. La précision par défaut est ``6``.

source: Exponent notation. Same as ``'e'`` except it uses an upper case 'E' as the separator character.
fr: Notation par exposant. Pareil que ``'e'`` sauf l'utilisation de la lettre majuscule 'E' comme séparateur.

source: Fixed-point notation. Displays the number as a fixed-point number. The default precision is ``6``.
fr: Virgule fixe. Affiche le nombre comme un nombre à virgule fixe. La précision par défaut est ``6``.

source: Fixed-point notation. Same as ``'f'``, but converts ``nan`` to ``NAN`` and ``inf`` to ``INF``.
fr: Virgule fixe. Pareil que ``'f'`` à part ``nan`` qui devient ``NAN`` et ``inf`` qui devient ``INF``.

source: General format. For a given precision ``p >= 1``, this rounds the number to ``p`` significant digits and then formats the result in either fixed-point format or in scientific notation, depending on its magnitude.
fr: Format général. Pour une précision donnée ``p >= 1``, ceci arrondit le nombre à ``p`` chiffres significatifs et puis formate le résultat soit en virgule fixe soit en notation scientifique, en fonction de la magnitude.

source: The precise rules are as follows: suppose that the result formatted with presentation type ``'e'`` and precision ``p-1`` would have exponent ``exp``. Then if ``-4 <= exp < p``, the number is formatted with presentation type ``'f'`` and precision ``p-1-exp``. Otherwise, the number is formatted with presentation type ``'e'`` and precision ``p-1``. In both cases insignificant trailing zeros are removed from the significand, and the decimal point is also removed if there are no remaining digits following it.
fr: Les règles précises sont les suivantes : supposons que le résultat formaté avec le type de représentation ``'e'`` et une précision ``1`` ait un exposant ``exp``. Alors, si ``-4 <= exp <= p``, le nombre est formaté avec le type de représentation ``'f'`` et une précision ``p-1-exp``. Sinon, le nombre est formaté avec le type de représentation ``'e'`` et une précision ``p-1``. Dans les deux cas, les zéros finaux et non significatifs sont retirés, et la virgule est également retirée s'il n'y a aucun chiffre la suivant.

source: Positive and negative infinity, positive and negative zero, and nans, are formatted as ``inf``, ``-inf``, ``0``, ``-0`` and ``nan`` respectively, regardless of the precision.
fr: Les valeurs suivantes : infini négatif, infini positif, zéro positif, zéro négatif, *not a number* sont formatées respectivement par ``inf``, ``-inf``, ``0``, ``-0`` et ``nan``, peu importe la précision.

source: A precision of ``0`` is treated as equivalent to a precision of ``1``. The default precision is ``6``.
fr: Une précision de ``0`` est interprétée comme une précision de ``1``. La précision par défaut est ``6``.

source: General format. Same as ``'g'`` except switches to ``'E'`` if the number gets too large. The representations of infinity and NaN are uppercased, too.
fr: Format général. Pareil que ``'G'`` si ce n'est que ``'E'`` est utilisé si le nombre est trop grand. Également, la représentation des infinis et de Nan sont en majuscules également.

source: Number. This is the same as ``'g'``, except that it uses the current locale setting to insert the appropriate number separator characters.
fr: Nombre. Pareil que ``'g'``, si ce n'est que l'environnement linguistique est pris en compte pour insérer le séparateur approprié.

source: Percentage. Multiplies the number by 100 and displays in fixed (``'f'``) format, followed by a percent sign.
fr: Pourcentage. Multiplie le nombre par 100 et l'affiche en virgule fixe (``'f'``), suivi d'un symbole pourcent ``'%'``.

source: Similar to ``'g'``, except that fixed-point notation, when used, has at least one digit past the decimal point. The default precision is as high as needed to represent the particular value. The overall effect is to match the output of :func:`str` as altered by the other format modifiers.
fr: Pareil que ``'g'``, si ce n'est que lorsque la notation en virgule fixe est utilisée, il y a toujours au moins un chiffre derrière la virgule. La précision par défaut celle nécessaire pour afficher la valeur donnée. L'effet visé est de le faire correspondre à la valeur renvoyée par :func:`str` altérée par les autres modificateurs de format.

source: Format examples
fr: Exemples de formats

source: This section contains examples of the :meth:`str.format` syntax and comparison with the old ``%``-formatting.
fr: Cette section contient des exemples de la syntaxe de :meth:`str.format` et des comparaisons avec l'ancien formatage par ``%``.

source: In most of the cases the syntax is similar to the old ``%``-formatting, with the addition of the ``{}`` and with ``:`` used instead of ``%``. For example, ``'%03.2f'`` can be translated to ``'{:03.2f}'``.
fr: Dans la plupart des cases, la syntaxe est similaire à l'ancien formatage par ``%``, avec l'ajout de ``{}`` et avec ``:`` au lieu de ``%``. Par exemple : ``'%03.2f'`` peut être changé en ``'{03.2f}'``.

source: Accessing arguments by position::
fr: Accéder à un argument par sa position : ::

source: Accessing arguments by name::
fr: Accéder à un argument par son nom : ::

source: Accessing arguments' attributes::
fr: Accéder aux attributs d'un argument : ::

source: Accessing arguments' items::
fr: Accéder aux éléments d'un argument : ::

source: Replacing ``%s`` and ``%r``::
fr: Remplacer ``%s`` et ``%r`` : ::

source: Aligning the text and specifying a width::
fr: Aligner le texte et spécifier une longueur minimale : ::

source: Replacing ``%+f``, ``%-f``, and ``% f`` and specifying a sign::
fr: Remplacer ``%+f``, ``%-f``, et ``%f`` et spécifier un signe : ::

source: Replacing ``%x`` and ``%o`` and converting the value to different bases::
fr: Remplacer ``%x`` et ``%o`` et convertir la valeur dans différentes bases : ::

source: Using the comma as a thousands separator::
fr: Utiliser une virgule comme séparateur des milliers : ::

source: Expressing a percentage::
fr: Exprimer un pourcentage : ::

source: Using type-specific formatting::
fr: Utiliser un formatage propre au type : ::

source: Nesting arguments and more complex examples::
fr: Arguments imbriqués et des exemples plus complexes : ::

source: Template strings
fr: Chaînes modèles

source: Template strings provide simpler string substitutions as described in :pep:`292`. A primary use case for template strings is for internationalization (i18n) since in that context, the simpler syntax and functionality makes it easier to translate than other built-in string formatting facilities in Python. As an example of a library built on template strings for i18n, see the `flufl.i18n <http://flufli18n.readthedocs.io/en/latest/>`_ package.
fr: Les chaînes modèles fournissent des substitutions de chaînes plus simples, comme décrit dans :pep:`292`. L’internationalisation (*i18n*) est un cas d’utilisation principale pour les chaînes modèles, car dans ce contexte, la syntaxe et les fonctionnalités simplifiées facilitent la traduction par rapport aux autres fonctions de formatage de chaînes intégrées en Python. Comme exemple de bibliothèque construite sur des chaînes modèles pour l'internationalisation, voir le paquet `flufl.i18n <http://flufli18n.readthedocs.io/en/latest/>`.

source: Template strings support ``$``-based substitutions, using the following rules:
fr: Les chaînes modèles prennent en charge les substitutions basées sur ``$`` en utilisant les règles suivantes :

source: ``$$`` is an escape; it is replaced with a single ``$``.
fr: ``$$`` est un échappement ; il est remplacé par un simple ``$``.

source: ``$identifier`` names a substitution placeholder matching a mapping key of ``"identifier"``. By default, ``"identifier"`` is restricted to any case-insensitive ASCII alphanumeric string (including underscores) that starts with an underscore or ASCII letter. The first non-identifier character after the ``$`` character terminates this placeholder specification.
fr: ``$identifier`` dénomme un substituant lié à la clef ``"identifier"``. Par défaut, ``"identifier"`` est restreint à toute chaîne de caractères ASCII alphanumériques sensibles à la casse (avec les *underscores*) commençant avec un *underscore* ou un caractère alphanumérique. Le premier caractère n'étant pas un identifieur après le ``$`` termine la spécification du substituant.

source: ``${identifier}`` is equivalent to ``$identifier``. It is required when valid identifier characters follow the placeholder but are not part of the placeholder, such as ``"${noun}ification"``.
fr: ``${identifier}`` est équivalent à ``$identifier``. Cette notation est requise quand un caractère valide pour une clef de substituant suit directement le substituant mais ne fait pas partie du substituant, comme ``"${noun}ification"``.

source: Any other appearance of ``$`` in the string will result in a :exc:`ValueError` being raised.
fr: Tout autre présence du symbole ``$`` dans une chaîne résultera en la levée d'une :exc:`ValueError`.

source: The :mod:`string` module provides a :class:`Template` class that implements these rules. The methods of :class:`Template` are:
fr: Le module :mod:`string` fournit une classe :class:`Template` qui implémente ces règles. Les méthodes de :class:`Template` sont :

source: The constructor takes a single argument which is the template string.
fr: Le constructeur prend un seul argument qui est la chaîne du *template*.

source: Performs the template substitution, returning a new string. *mapping* is any dictionary-like object with keys that match the placeholders in the template. Alternatively, you can provide keyword arguments, where the keywords are the placeholders. When both *mapping* and *kwds* are given and there are duplicates, the placeholders from *kwds* take precedence.
fr: Applique les substitutions du *template*, et la renvoie dans une nouvelle chaîne. *mapping* est un objet dictionnaire-compatible qui lie les substituants dans le *template*. De même, vous pouvez fournir des arguments mot-clefs tels que les mot-clefs sont les substituants. Quand à la fois *mapping* et *kwds* sont donnés et qu'il y a des doublons, les substituants de *kwds* sont prioritaires.

source: Like :meth:`substitute`, except that if placeholders are missing from *mapping* and *kwds*, instead of raising a :exc:`KeyError` exception, the original placeholder will appear in the resulting string intact. Also, unlike with :meth:`substitute`, any other appearances of the ``$`` will simply return ``$`` instead of raising :exc:`ValueError`.
fr: Comme :meth:`substitute`, si ce n'est qu'au lieu de lever une :exc:`KeyError` si un substituant n'est ni dans *mapping*, ni dans *kwds*, c'est le nom du substituant inchangé qui apparaît dans la chaîne finale. Également, à l'inverse de :meth:`substitute`, toute autre apparition de ``$`` renverra simplement ``$`` au lieu de lever une exception :exc:`ValueError`.

source: :class:`Template` instances also provide one public data attribute:
fr: Les instances de la classe :class:`Template` fournissent également un attribut public :

source: This is the object passed to the constructor's *template* argument. In general, you shouldn't change it, but read-only access is not enforced.
fr: C'est l'objet *template* passé comme argument au constructeur. En général, vous ne devriez pas le changer, mais un accès en lecture-seule n'est pas possible à fournir.

source: Here is an example of how to use a Template::
fr: Voici un exemple de comment utiliser un *Template* : ::

source: Advanced usage: you can derive subclasses of :class:`Template` to customize the placeholder syntax, delimiter character, or the entire regular expression used to parse template strings. To do this, you can override these class attributes:
fr: Usage avancé : vous pouvez faire dériver vos sous-classes de :class:`Template` pour personnaliser la syntaxe des substituants, les caractères délimiteurs, ou l'entièreté de l'expression rationnelle utilisée pour analyser les chaînes *templates*. Pour faire cela, vous pouvez redéfinir les attributs suivants :

source: *delimiter* -- This is the literal string describing a placeholder introducing delimiter. The default value is ``$``. Note that this should *not* be a regular expression, as the implementation will call :meth:`re.escape` on this string as needed. Note further that you cannot change the delimiter after class creation (i.e. a different delimiter must be set in the subclass's class namespace).
fr: *delimiter* -- La chaîne littérale décrivant le délimiteur pour introduire un substituant. Sa valeur par défaut est ``$``. Notez qu'elle ne doit *pas* être une expression rationnelle, puisque l'implémentation appelle :meth:`re.escape` sur cette chaîne si nécessaire. Notez aussi que le délimiteur ne peut pas être changé après la création de la classe.

source: *idpattern* -- This is the regular expression describing the pattern for non-braced placeholders. The default value is the regular expression ``(?a:[_a-z][_a-z0-9]*)``. If this is given and *braceidpattern* is ``None`` this pattern will also apply to braced placeholders.
fr: *idpattern* -- L'expression rationnelle décrivant le motif pour les substituants non entourés d'accolades. La valeur par défaut de cette expression rationnelle est ``(?a:[_a-z][_a-z0-9]*)``. Si *idpattern* est donné et *braceidpattern* est ``None``, ce motif est aussi utilisé pour les marqueurs entre accolades.

source: Since default *flags* is ``re.IGNORECASE``, pattern ``[a-z]`` can match with some non-ASCII characters. That's why we use the local ``a`` flag here.
fr: Puisque par défaut *flags* vaut ``re.IGNORECASE``, des caractères *non-ASCII* peuvent correspondre au motif ``[a-z]``. C'est pourquoi on utilise une option locale ``a`` ici.

source: *braceidpattern* can be used to define separate patterns used inside and outside the braces.
fr: *braceidpattern* peut être utilisé pour définir des motifs des motifs différents suivant qu’ils sont à l’intérieur ou à l’extérieur des accolades.

source: *braceidpattern* -- This is like *idpattern* but describes the pattern for braced placeholders. Defaults to ``None`` which means to fall back to *idpattern* (i.e. the same pattern is used both inside and outside braces). If given, this allows you to define different patterns for braced and unbraced placeholders.
fr: *braceidpattern* — Similaire à *idpattern* mais décrit le motif quand il est placé entre accolades. La valeur par défaut est ``None``` ce qui signifie que seul *idpattern* est pris en compte (le motif est le même, qu’il soit à l’intérieur d’accolades ou non). S’il est donné, cela vous permet de définir définir des motifs entre accolades différents des motifs sans accolades.

source: *flags* -- The regular expression flags that will be applied when compiling the regular expression used for recognizing substitutions. The default value is ``re.IGNORECASE``. Note that ``re.VERBOSE`` will always be added to the flags, so custom *idpattern*\ s must follow conventions for verbose regular expressions.
fr: *flags* -- L'indicateur d'expression rationnelle qui sera appliqué lors de la compilation de l'expression rationnelle pour reconnaître les substitutions. La valeur par défaut est ``re.IGNORECASE``. Notez que ``re.VERBOSE`` sera toujours ajouté à l'indicateur. Donc, un *idpattern* personnalisé doit suivre les conventions des expressions rationnelles *verbose*.
