Repository: python/python-docs-fr
Catalog: library/subprocess.po
Languages: fr

source: The function now returns (exitcode, output) instead of (status, output) as it did in Python 3.3.3 and earlier. exitcode has the same value as :attr:`~Popen.returncode`.
fr: La fonction renvoie maintenant ``(exitcode, output)`` plutôt que ``(status, output)`` comme dans les versions de Python 3.3.3 ou antérieures. *exitcode* vaut la même valeur que :attr:`~Popen.returncode`.

source: Return output (stdout and stderr) of executing *cmd* in a shell.
fr: Renvoie la sortie (standard et d'erreur) de l'exécution de *cmd* dans un *shell*.

source: Like :func:`getstatusoutput`, except the exit code is ignored and the return value is a string containing the command's output. Example::
fr: Comme :func:`getstatusoutput`, à l'exception que le code de statut est ignoré et que la valeur de retour est une chaîne contenant la sortie de la commande. Exemple ::

source: Windows support added
fr: Ajout de la gestion de Windows

source: Converting an argument sequence to a string on Windows
fr: Convertir une séquence d'arguments vers une chaîne de caractères sous Windows

source: On Windows, an *args* sequence is converted to a string that can be parsed using the following rules (which correspond to the rules used by the MS C runtime):
fr: Sous Windows, une séquence *args* est convertie vers une chaîne qui peut être analysée avec les règles suivantes (qui correspondent aux règles utilisées par l'environnement *MS C*) :

source: Arguments are delimited by white space, which is either a space or a tab.
fr: Les arguments sont délimités par des espacements, qui peuvent être des espaces ou des tabulations.

source: A string surrounded by double quotation marks is interpreted as a single argument, regardless of white space contained within. A quoted string can be embedded in an argument.
fr: Une chaîne entourée de double guillemets est interprétée comme un argument seul, qu'elle contienne ou non des espacements. Une chaîne entre guillemets peut être intégrée dans un argument.

source: A double quotation mark preceded by a backslash is interpreted as a literal double quotation mark.
fr: Un guillemet double précédé d'un *backslash* est interprété comme un guillemet double littéral.

source: Backslashes are interpreted literally, unless they immediately precede a double quotation mark.
fr: Les *backslashs* sont interprétés littéralement, à moins qu'ils précèdent immédiatement un guillemet double.

source: If backslashes immediately precede a double quotation mark, every pair of backslashes is interpreted as a literal backslash. If the number of backslashes is odd, the last backslash escapes the next double quotation mark as described in rule 3.
fr: Si des *backslashs* précèdent directement un guillemet double, toute paire de *backslashs* est interprétée comme un *backslash* littéral. Si le nombre de *backslashs* est impair, le dernier *backslash* échappe le prochain guillemet double comme décrit en règle 3.

source: Module which provides function to parse and escape command lines.
fr: Module qui fournit des fonctions pour analyser et échapper les lignes de commandes.
