Repository: python/python-docs-fr
Catalog: library/subprocess.po
Languages: fr

source: If the *stderr* argument was :data:`PIPE`, this attribute is a readable stream object as returned by :func:`open`. Reading from the stream provides error output from the child process. If the *encoding* or *errors* arguments were specified or the *universal_newlines* argument was ``True``, the stream is a text stream, otherwise it is a byte stream. If the *stderr* argument was not :data:`PIPE`, this attribute is ``None``.
fr: Si l'argument *stderr* valait :data:`PIPE`, cet attribut est un flux accessible en lecture comme renvoyé par :func:`open`. Lire depuis le flux fournit la sortie d'erreur du processus fils. Si les arguments *encoding* ou *errors* ont été spécifiés, ou si *universal_newlines* valait ``True``, le flux est textuel, il est autrement binaire. Si l'argument *stderr* ne valait pas :data:`PIPE`, cet attribut est ``None``.

source: Use :meth:`~Popen.communicate` rather than :attr:`.stdin.write <Popen.stdin>`, :attr:`.stdout.read <Popen.stdout>` or :attr:`.stderr.read <Popen.stderr>` to avoid deadlocks due to any of the other OS pipe buffers filling up and blocking the child process.
fr: Utilisez :meth:`~Popen.communicate` plutôt que :attr:`.stdin.write <Popen.stdin>`, :attr:`.stdout.read <Popen.stdout>` ou :attr:`.stderr.read <Popen.stderr>` pour empêcher les *deadlocks* dus au remplissage des tampons des tubes de l'OS et bloquant le processus enfant.

source: The process ID of the child process.
fr: L'identifiant de processus du processus enfant.

source: Note that if you set the *shell* argument to ``True``, this is the process ID of the spawned shell.
fr: Notez que si vous passez l'argument *shell* à ``True``, il s'agit alors de l'identifiant du *shell* instancié.

source: The child return code, set by :meth:`poll` and :meth:`wait` (and indirectly by :meth:`communicate`). A ``None`` value indicates that the process hasn't terminated yet.
fr: Le code de retour de l'enfant, attribué par :meth:`poll` et :meth:`wait` (et indirectement par :meth:`communicate`). Une valeur ``None`` indique que le processus ne s'est pas encore terminé.

source: Windows Popen Helpers
fr: Utilitaires *Popen* pour Windows

source: The :class:`STARTUPINFO` class and following constants are only available on Windows.
fr: La classe :class:`STARTUPINFO` et les constantes suivantes sont seulement disponibles sous Windows.

source: Partial support of the Windows `STARTUPINFO <https://msdn.microsoft.com/en-us/library/ms686331(v=vs.85).aspx>`__ structure is used for :class:`Popen` creation. The following attributes can be set by passing them as keyword-only arguments.
fr: Une gestion partielle de la structure `STARTUPINFO <https://msdn.microsoft.com/en-us/library/ms686331(v=vs.85).aspx>`__ est utilisée lors de la création d'un objet :class:`Popen`. Les attributs ci-dessous peuvent être passés en tant que paramètres *keyword-only*.

source: Keyword-only argument support was added.
fr: Ajout de la gestion des paramètres *keyword-only*.

source: A bit field that determines whether certain :class:`STARTUPINFO` attributes are used when the process creates a window. ::
fr: Un champ de bits déterminant si certains attributs :class:`STARTUPINFO` sont utilisés quand le processus crée une fenêtre ::

source: If :attr:`dwFlags` specifies :data:`STARTF_USESTDHANDLES`, this attribute is the standard input handle for the process. If :data:`STARTF_USESTDHANDLES` is not specified, the default for standard input is the keyboard buffer.
fr: Si :attr:`dwFlags` spécifie :data:`STARTF_USESTDHANDLES`, cet attribut est le descripteur d'entrée standard du processus. Si :data:`STARTF_USESTDHANDLES` n'est pas spécifié, l'entrée standard par défaut est le tampon du clavier.

source: If :attr:`dwFlags` specifies :data:`STARTF_USESTDHANDLES`, this attribute is the standard output handle for the process. Otherwise, this attribute is ignored and the default for standard output is the console window's buffer.
fr: Si :attr:`dwFlags` spécifie :data:`STARTF_USESTDHANDLES`, cet attribut est le descripteur de sortie standard du processus. Autrement, l'attribut est ignoré et la sortie standard par défaut est le tampon de la console.

source: If :attr:`dwFlags` specifies :data:`STARTF_USESTDHANDLES`, this attribute is the standard error handle for the process. Otherwise, this attribute is ignored and the default for standard error is the console window's buffer.
fr: Si :attr:`dwFlags` spécifie :data:`STARTF_USESTDHANDLES`, cet attribut est le descripteur de sortie d'erreur du processus. Autrement, l'attribut est ignoré et la sortie d'erreur par défaut est le tampon de la console.

source: If :attr:`dwFlags` specifies :data:`STARTF_USESHOWWINDOW`, this attribute can be any of the values that can be specified in the ``nCmdShow`` parameter for the `ShowWindow <https://msdn.microsoft.com/en-us/library/ms633548(v=vs.85).aspx>`__ function, except for ``SW_SHOWDEFAULT``. Otherwise, this attribute is ignored.
fr: Si :attr:`dwFlags` spécifie :data:`STARTF_USESHOWWINDOW`, cet attribut peut-être n'importe quel attribut valide pour le paramètre ``nCmdShow`` de la fonction `ShowWindow <https://msdn.microsoft.com/en-us/library/ms633548(v=vs.85).aspx>`__, à l'exception de ``SW_SHOWDEFAULT``. Autrement, cet attribut est ignoré.

source: :data:`SW_HIDE` is provided for this attribute. It is used when :class:`Popen` is called with ``shell=True``.
fr: :data:`SW_HIDE` est fourni pour cet attribut. Il est utilisé quand :class:`Popen` est appelée avec ``shell=True``.

source: A dictionary of additional attributes for process creation as given in ``STARTUPINFOEX``, see `UpdateProcThreadAttribute <https://msdn.microsoft.com/en-us/library/windows/desktop/ms686880(v=vs.85).aspx>`__.
fr: Dictionnaire des attributs supplémentaires pour la création d'un processus comme donnés dans ``STARTUPINFOEX``, lisez `UpdateProcThreadAttribute <https://msdn.microsoft.com/en-us/library/windows/desktop/ms686880(v=vs.85).aspx>`__ (ressource en anglais).

source: Supported attributes:
fr: Attributs gérés :

source: Sequence of handles that will be inherited. *close_fds* must be true if non-empty.
fr: Séquence des descripteurs qui hérités du parent. *close_fds* doit être vrai si la séquence n'est pas vide.

source: The handles must be temporarily made inheritable by :func:`os.set_handle_inheritable` when passed to the :class:`Popen` constructor, else :class:`OSError` will be raised with Windows error ``ERROR_INVALID_PARAMETER`` (87).
fr: Les descripteurs doivent être temporairement héritables par :func:`os.set_handle_inheritable` quand ils sont passés au constructeur :class:`Popen`, sinon :class:`OSError` est levée avec l'erreur Windows ``ERROR_INVALID_PARAMETER`` (87).

source: In a multithreaded process, use caution to avoid leaking handles that are marked inheritable when combining this feature with concurrent calls to other process creation functions that inherit all handles such as :func:`os.system`. This also applies to standard handle redirection, which temporarily creates inheritable handles.
fr: Dans un processus avec plusieurs fils d'exécution, faites très attention à éviter la fuite de descripteurs qui sont marqués comme héritables quand vous combinez ceci avec des appels concurrents vers des fonctions de création d'autres processus qui héritent de tous les descripteurs (telle que :func:`os.system`).

source: Windows Constants
fr: Constantes Windows

source: The :mod:`subprocess` module exposes the following constants.
fr: Le module :mod:`subprocess` expose les constantes suivantes.

source: The standard input device. Initially, this is the console input buffer, ``CONIN$``.
fr: Le périphérique d'entrée standard. Initialement, il s'agit du tampon de la console d'entrée, ``CONIN$``.

source: The standard output device. Initially, this is the active console screen buffer, ``CONOUT$``.
fr: Le périphérique de sortie standard. Initialement, il s'agit du tampon de l'écran de console actif, ``CONOUT$``.

source: The standard error device. Initially, this is the active console screen buffer, ``CONOUT$``.
fr: Le périphérique de sortie d'erreur. Initialement, il s'agit du tampon de l'écran de console actif, ``CONOUT$``.

source: Hides the window. Another window will be activated.
fr: Cache la fenêtre. Une autre fenêtre sera activée.

source: Specifies that the :attr:`STARTUPINFO.hStdInput`, :attr:`STARTUPINFO.hStdOutput`, and :attr:`STARTUPINFO.hStdError` attributes contain additional information.
fr: Spécifie que les attributs :attr:`STARTUPINFO.hStdInput`, :attr:`STARTUPINFO.hStdOutput` et :attr:`STARTUPINFO.hStdError` contiennent des informations additionnelles.

source: Specifies that the :attr:`STARTUPINFO.wShowWindow` attribute contains additional information.
fr: Spécifie que l'attribut :attr:`STARTUPINFO.wShowWindow` contient des informations additionnelles.

source: The new process has a new console, instead of inheriting its parent's console (the default).
fr: Le nouveau processus instancie une nouvelle console, plutôt que d'hériter de celle de son père (par défaut).

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process group will be created. This flag is necessary for using :func:`os.kill` on the subprocess.
fr: Paramètre ``creationflags`` de :class:`Popen` pour spécifier si un nouveau groupe de processus doit être créé. Cette option est nécessaire pour utiliser :func:`os.kill` sur le sous-processus.

source: This flag is ignored if :data:`CREATE_NEW_CONSOLE` is specified.
fr: L'option est ignorée si :data:`CREATE_NEW_CONSOLE` est spécifié.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have an above average priority.
fr: Paramètre ``creationflags`` de :class:`Popen` pour spécifier qu'un processus aura une priorité au-dessus de la moyenne.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have a below average priority.
fr: Paramètre ``creationflags`` de :class:`Popen` pour spécifier qu'un processus aura une priorité au-dessous de la moyenne.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have a high priority.
fr: Paramètre ``creationflags`` de :class:`Popen` pour spécifier qu'un processus aura une priorité haute.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have an idle (lowest) priority.
fr: Paramètre ``creationflags`` de :class:`Popen` pour spécifier qu'un processus aura la priorité la plus basse (inactif ou *idle*).

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have an normal priority. (default)
fr: Paramètre ``creationflags`` de :class:`Popen` pour spécifier qu'un processus aura une priorité normale (le défaut).

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have realtime priority. You should almost never use REALTIME_PRIORITY_CLASS, because this interrupts system threads that manage mouse input, keyboard input, and background disk flushing. This class can be appropriate for applications that "talk" directly to hardware or that perform brief tasks that should have limited interruptions.
fr: Paramètre ``creationflags`` de :class:`Popen` pour spécifier qu’un nouveau processus aura une priorité en temps réel. Vous ne devriez presque JAMAIS utiliser ``REALTIME_PRIORITY_CLASS``, car cela interrompt les fils d’exécution système qui gèrent les entrées de la souris, du clavier et *flush* le cache de disque en arrière-plan. Cette classe peut convenir aux applications qui « parlent » directement au matériel ou qui effectuent de brèves tâches nécessitant des interruptions limitées.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will not create a window.
fr: Paramètre ``creationflags`` de :class:`Popen` pour spécifier qu'un processus ne créera pas une nouvelle fenêtre.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will not inherit its parent's console. This value cannot be used with CREATE_NEW_CONSOLE.
fr: Paramètre ``creationflags`` de :class:`Popen` pour spécifier qu'un nouveau processus n'héritera pas de la console du processus parent. Cette valeur ne peut pas être utilisée avec CREATE_NEW_CONSOLE.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process does not inherit the error mode of the calling process. Instead, the new process gets the default error mode. This feature is particularly useful for multithreaded shell applications that run with hard errors disabled.
fr: Paramètre ``creationflags`` de :class:`Popen` pour spécifier qu'un nouveau processus n'hérite pas du mode de gestion des erreurs du processus appelant. À la place, le nouveau processus acquiert le mode d'erreur par défaut. Cette fonctionnalité est particulièrement utile pour les applications *shell* avec de multiples fils d'exécution qui s'exécutent avec les erreurs irréversibles désactivées.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process is not associated with the job.
fr: Paramètre ``creationflags`` de :class:`Popen` pour spécifier qu'un processus n'est pas associé au *job*.

source: Older high-level API
fr: Ancienne interface (*API*) haut-niveau

source: Prior to Python 3.5, these three functions comprised the high level API to subprocess. You can now use :func:`run` in many cases, but lots of existing code calls these functions.
fr: Avant Python 3.5, ces trois fonctions représentaient l'API haut-niveau de *subprocess*. Vous pouvez maintenant utiliser :func:`run` dans de nombreux cas, mais beaucoup de codes existant font appel à ces trois fonctions.

source: Run the command described by *args*. Wait for command to complete, then return the :attr:`~Popen.returncode` attribute.
fr: Lance la commande décrite par *args*, attend qu'elle se termine, et renvoie son attribut :attr:`~Popen.returncode`.

source: Code needing to capture stdout or stderr should use :func:`run` instead::
fr: Le code ayant besoin de capturer *stdout* ou *stderr* doit plutôt utiliser ::func:`run` ::

source: To suppress stdout or stderr, supply a value of :data:`DEVNULL`.
fr: Pour supprimer *stdout* ou *stderr*, passez la valeur :data:`DEVNULL`.

source: The arguments shown above are merely some common ones. The full function signature is the same as that of the :class:`Popen` constructor - this function passes all supplied arguments other than *timeout* directly through to that interface.
fr: Les arguments montrés plus haut sont sûrement les plus communs. La signature complète de la fonction est en grande partie la même que le constructeur de :class:`Popen` : cette fonction passe tous les arguments fournis autre que *timeout* directement à travers cette interface.

source: Do not use ``stdout=PIPE`` or ``stderr=PIPE`` with this function. The child process will block if it generates enough output to a pipe to fill up the OS pipe buffer as the pipes are not being read from.
fr: N'utilisez pas ``stdout=PIPE`` ou ``stderr=PIPE`` avec cette fonction. Le processus enfant bloquera s'il génère assez de données pour remplir le tampon du tube de l'OS, puisque les tubes ne seront jamais lus.

source: Run command with arguments and return its output.
fr: Lance la commande avec les arguments et renvoie sa sortie.

source: If the return code was non-zero it raises a :exc:`CalledProcessError`. The :exc:`CalledProcessError` object will have the return code in the :attr:`~CalledProcessError.returncode` attribute and any output in the :attr:`~CalledProcessError.output` attribute.
fr: Si le code de retour est non-nul, la fonction lève une :exc:`CalledProcessError`. L'objet :exc:`CalledProcessError` contiendra le code de retour dans son attribut :attr:`~CalledProcessError.returncode`, et la sortie du programme dans son attribut :attr:`~CalledProcessError.output`.

source: This is equivalent to::
fr: C’est équivalent à ::

source: By default, this function will return the data as encoded bytes. The actual encoding of the output data may depend on the command being invoked, so the decoding to text will often need to be handled at the application level.
fr: Par défaut, cette fonction renvoie les données encodées sous forme de *bytes*. Le réel encodage des données de sortie peut dépendre de la commande invoquée, donc le décodage du texte devra souvent être géré au niveau de l'application.

source: This behaviour may be overridden by setting *text*, *encoding*, *errors*, or *universal_newlines* to ``True`` as described in :ref:`frequently-used-arguments` and :func:`run`.
fr: Ce comportement peut être redéfini en mettant *text*, *encoding*, *errors*, ou *universal_newlines* à ``True`` comme décrit dans :ref:`frequently-used-arguments` et :func:`run`.

source: To also capture standard error in the result, use ``stderr=subprocess.STDOUT``::
fr: Pour capturer aussi la sortie d'erreur dans le résultat, utilisez ``stderr=subprocess.STDOUT`` ::

source: Support for the *input* keyword argument was added.
fr: Ajout de la gestion de l'argument nommé *input*.

source: *encoding* and *errors* were added. See :func:`run` for details.
fr: Ajout d'*encoding* et *errors*. Consultez :func:`run` pour plus d'informations.

source: Replacing Older Functions with the :mod:`subprocess` Module
fr: Remplacer les fonctions plus anciennes par le module :mod:`subprocess`

source: In this section, "a becomes b" means that b can be used as a replacement for a.
fr: Dans cette section, « a devient b » signifie que b peut être utilisée en remplacement de a.

source: All "a" functions in this section fail (more or less) silently if the executed program cannot be found; the "b" replacements raise :exc:`OSError` instead.
fr: Toutes les fonctions « a » dans cette section échouent (plus ou moins) silencieusement si le programme à exécuter ne peut être trouvé ; les fonctions « b » de remplacement lèvent à la place une :exc:`OSError`.

source: In addition, the replacements using :func:`check_output` will fail with a :exc:`CalledProcessError` if the requested operation produces a non-zero return code. The output is still available as the :attr:`~CalledProcessError.output` attribute of the raised exception.
fr: De plus, les remplacements utilisant :func:`check_output` échoueront avec une :exc:`CalledProcessError` si l'opération requise produit un code de retour non-nul. La sortie est toujours disponible par l'attribut :attr:`~CalledProcessError.output` de l'exception levée.

source: In the following examples, we assume that the relevant functions have already been imported from the :mod:`subprocess` module.
fr: Dans les exemples suivants, nous supposons que les fonctions utilisées ont déjà été importées depuis le module :mod:`subprocess`.

source: Replacing :program:`/bin/sh` shell command substitution
fr: Remplacement de la substitution de commandes de terminal :program:`/bin/sh`

source: becomes::
fr: devient ::

source: Replacing shell pipeline
fr: Remplacer les *pipes* du *shell*

source: The ``p1.stdout.close()`` call after starting the p2 is important in order for p1 to receive a SIGPIPE if p2 exits before p1.
fr: L'appel à ``p1.stdout.close()`` après le démarrage de *p2* est important pour que *p1* reçoive un *SIGPIPE* si *p2* se termine avant lui.

source: Alternatively, for trusted input, the shell's own pipeline support may still be used directly:
fr: Alternativement, pour des entrées fiables, la gestion des tubes du *shell* peut directement être utilisé :

source: Replacing :func:`os.system`
fr: Remplacer :func:`os.system`

source: Calling the program through the shell is usually not required.
fr: Appeler le programme à travers un *shell* n'est habituellement pas requis.

source: A more realistic example would look like this::
fr: Un exemple plus réaliste ressemblerait à cela ::

source: Replacing the :func:`os.spawn <os.spawnl>` family
fr: Remplacer les fonctions de la famille :func:`os.spawn <os.spawnl>`

source: P_NOWAIT example::
fr: Exemple avec *P_NOWAIT* ::

source: P_WAIT example::
fr: Exemple avec *P_WAIT* ::

source: Vector example::
fr: Exemple avec un tableau ::

source: Environment example::
fr: Exemple en passant un environnement ::

source: Replacing :func:`os.popen`, :func:`os.popen2`, :func:`os.popen3`
fr: Remplacer :func:`os.popen`, :func:`os.popen2`, :func:`os.popen3`

source: Return code handling translates as follows::
fr: La gestion du code de retour se traduit comme suit ::

source: Replacing functions from the :mod:`popen2` module
fr: Remplacer les fonctions du module :mod:`popen2`

source: If the cmd argument to popen2 functions is a string, the command is executed through /bin/sh. If it is a list, the command is directly executed.
fr: Si l'argument *cmd* des fonctions de *popen2* est une chaîne de caractères, la commande est exécutée à travers */bin/sh*. Si c'est une liste, la commande est directement exécutée.

source: :class:`popen2.Popen3` and :class:`popen2.Popen4` basically work as :class:`subprocess.Popen`, except that:
fr: :class:`popen2.Popen3` et :class:`popen2.Popen4` fonctionnent basiquement comme :class:`subprocess.Popen`, excepté que :

source: :class:`Popen` raises an exception if the execution fails.
fr: :class:`Popen` lève une exception si l'exécution échoue.

source: The *capturestderr* argument is replaced with the *stderr* argument.
fr: L'argument *capturestderr* est remplacé par *stderr*.

source: ``stdin=PIPE`` and ``stdout=PIPE`` must be specified.
fr: ``stdin=PIPE`` et ``stdout=PIPE`` doivent être spécifiés.

source: popen2 closes all file descriptors by default, but you have to specify ``close_fds=True`` with :class:`Popen` to guarantee this behavior on all platforms or past Python versions.
fr: *popen2* ferme tous les descripteurs de fichiers par défaut, mais vous devez spécifier ``close_fds=True`` avec :class:`Popen` pour garantir ce comportement sur toutes les plateformes ou les anciennes versions de Python.

source: Legacy Shell Invocation Functions
fr: Remplacement des fonctions originales d'invocation du *shell*

source: This module also provides the following legacy functions from the 2.x ``commands`` module. These operations implicitly invoke the system shell and none of the guarantees described above regarding security and exception handling consistency are valid for these functions.
fr: Ce module fournit aussi les fonctions suivantes héritées du module ``commands`` de Python 2.x. Ces opérations invoquent implicitement le *shell* du système et n'apportent aucune des garanties décrites ci-dessus par rapport à la sécurité ou la cohérence de la gestion des exceptions.

source: Return ``(exitcode, output)`` of executing *cmd* in a shell.
fr: Renvoie les valeurs ``(exitcode, output)`` de l'exécution de *cmd* dans un *shell*.

source: Execute the string *cmd* in a shell with :meth:`Popen.check_output` and return a 2-tuple ``(exitcode, output)``. The locale encoding is used; see the notes on :ref:`frequently-used-arguments` for more details.
fr: Exécute la chaîne *cmd* dans un *shell* avec :meth:`Popen.check_output` et renvoie une paire ``(exitcode, output)``. L'encodage local est utilisé, voir les notes de la section :ref:`frequently-used-arguments` pour plus de détails.

source: A trailing newline is stripped from the output. The exit code for the command can be interpreted as the return code of subprocess. Example::
fr: Si la sortie se termine par un caractère de fin de ligne, ce dernier est supprimé. Le code de statut de la commande peut être interprété comme le code de retour de *subprocess*. Par exemple ::

source: :ref:`Availability <availability>`: POSIX & Windows.
fr: :ref:`Disponibilité <availability>` : POSIX et Windows.

source: Windows support was added.
fr: Ajout de la gestion de Windows.
