Repository: python/python-docs-fr
Catalog: library/subprocess.po
Languages: fr

source: On Windows with ``shell=True``, the :envvar:`COMSPEC` environment variable specifies the default shell. The only time you need to specify ``shell=True`` on Windows is when the command you wish to execute is built into the shell (e.g. :command:`dir` or :command:`copy`). You do not need ``shell=True`` to run a batch file or console-based executable.
fr: Sous Windows avec ``shell=True``, la variable d'environnement :envvar:`COMSPEC` spécifie le *shell* par défaut. La seule raison pour laquelle vous devriez spécifier ``shell=True`` sous Windows est quand la commande que vous souhaitez exécuter est une *built-in* du *shell* (p. ex. :command:`dir` ou :command:`copy`). Vous n'avez pas besoin de ``shell=True`` pour lancer un fichier batch ou un exécutable console.

source: *bufsize* will be supplied as the corresponding argument to the :func:`open` function when creating the stdin/stdout/stderr pipe file objects:
fr: *bufsize* sera fourni comme l'argument correspondant à la fonction :func:`open`, lors de la création des objets de fichiers pour les tubes *stdin*/*stdout*/*stderr* :

source: :const:`0` means unbuffered (read and write are one system call and can return short)
fr: :const:`0` indique de ne pas utiliser de tampon (les lectures et écritures sont des appels systèmes et peuvent renvoyer des données incomplètes) ;

source: :const:`1` means line buffered (only usable if ``universal_newlines=True`` i.e., in a text mode)
fr: :const:`1` indique une mise en cache par ligne (utilisable seulement si ``universal_newlines=True``, c'est-à-dire en mode texte) ;

source: any other positive value means use a buffer of approximately that size
fr: toutes les autres valeurs positives indiquent d'utiliser un tampon d'approximativement cette taille ;

source: negative bufsize (the default) means the system default of io.DEFAULT_BUFFER_SIZE will be used.
fr: un *bufsize* négatif (par défaut) indique au système d'utiliser la valeur par défaut *io.DEFAULT_BUFFER_SIZE*.

source: *bufsize* now defaults to -1 to enable buffering by default to match the behavior that most code expects. In versions prior to Python 3.2.4 and 3.3.1 it incorrectly defaulted to :const:`0` which was unbuffered and allowed short reads. This was unintentional and did not match the behavior of Python 2 as most code expected.
fr: *bufsize* vaut maintenant ``-1`` par défaut, pour activer par défaut la mise en cache et correspondre au comportement attendu par la plupart des codes. Dans les versions de Python antérieures à 3.2.4 et 3.3.1, par erreur, la valeur par défaut était :const:`0` qui ne réalisait aucune mise en cache et autorisait les lectures incomplètes. Cela n'était pas intentionnel et ne correspondait pas au comportement de Python 2 attendu par la plupart des codes.

source: The *executable* argument specifies a replacement program to execute. It is very seldom needed. When ``shell=False``, *executable* replaces the program to execute specified by *args*. However, the original *args* is still passed to the program. Most programs treat the program specified by *args* as the command name, which can then be different from the program actually executed. On POSIX, the *args* name becomes the display name for the executable in utilities such as :program:`ps`. If ``shell=True``, on POSIX the *executable* argument specifies a replacement shell for the default :file:`/bin/sh`.
fr: L'argument *executable* spécifie un programme de remplacement à exécuter. Il est très rarement nécessaire. Quand ``shell=False``, *executable* remplace le programme à exécuter spécifié par *args*. Cependant, les arguments originels d'*args` sont toujours passés au programme. La plupart des programmes traitent le programme spécifié par *args* comme le nom de la commande, qui peut être différent du programme réellement exécuté. Sur les systèmes POSIX, le nom tiré d'*args* devient le nom affiché pour l'exécutable dans des utilitaires tels que :program:`ps`. Si ``shell=True``, sur les systèmes POSIX, l'argument *executable* précise le *shell* à utiliser plutôt que :file:`/bin/sh` par défaut.

source: *executable* parameter accepts a :term:`path-like object` on POSIX.
fr: le paramètre *executable* accepte un :term:`objet chemin <path-like object>` sur les systèmes POSIX.

source: *executable* parameter accepts a bytes and :term:`path-like object` on Windows.
fr: le paramètre *executable* accepte un objet *bytes* ou un :term:`objet chemin <path-like object>` sur Windows.

source: If *preexec_fn* is set to a callable object, this object will be called in the child process just before the child is executed. (POSIX only)
fr: Si un objet appelable est passé à *preexec_fn*, cet objet sera appelé dans le processus enfant juste avant d'exécuter le programme. (POSIX seulement)

source: The *preexec_fn* parameter is not safe to use in the presence of threads in your application. The child process could deadlock before exec is called. If you must use it, keep it trivial! Minimize the number of libraries you call into.
fr: Le paramètre *preexec_fn* n'est pas sain à utiliser en présence d'autres fils d'exécution dans votre application. Le processus fils pourrait être bloqué (*deadlock*) avant qu'*exec* ne soit appelée. Si vous devez utiliser ce paramètre, gardez son utilisation triviale ! Minimisez le nombre de bibliothèques que vous y appelez.

source: If you need to modify the environment for the child use the *env* parameter rather than doing it in a *preexec_fn*. The *start_new_session* parameter can take the place of a previously common use of *preexec_fn* to call os.setsid() in the child.
fr: Si vous devez modifier l'environnement du fils, utilisez le paramètre *env* plutôt que faire cela dans une *preexec_fn*. Le paramètre *start_new_session* peut prendre la place de *preexec_fn* qui était autrefois communément utilisé pour appeler *os.setsid()* dans le fils.

source: The *preexec_fn* parameter is no longer supported in subinterpreters. The use of the parameter in a subinterpreter raises :exc:`RuntimeError`. The new restriction may affect applications that are deployed in mod_wsgi, uWSGI, and other embedded environments.
fr: Le paramètre *preexec_fn* n'est plus pris en charge dans les sous-interpréteurs. L'utilisation de ce paramètre lève :exc:`RuntimeError`. Cette nouvelle restriction peut affecter les applications déployées avec *mod_wsgi*, *uWSGI* et d'autres environnements qui peuvent embarquer Python.

source: If *close_fds* is true, all file descriptors except :const:`0`, :const:`1` and :const:`2` will be closed before the child process is executed. Otherwise when *close_fds* is false, file descriptors obey their inheritable flag as described in :ref:`fd_inheritance`.
fr: Si *close_fds* est vrai, tous les descripteurs de fichiers exceptés :const:`0`, :const:`1` et :const:`2` sont fermés avant que le processus enfant soit exécuté. Sinon, quand *close_fds* est faux, les descripteurs de fichiers se comportent conformément à leur option d'héritage décrite dans :ref:`fd_inheritance`.

source: On Windows, if *close_fds* is true then no handles will be inherited by the child process unless explicitly passed in the ``handle_list`` element of :attr:`STARTUPINFO.lpAttributeList`, or by standard handle redirection.
fr: Sur Windows, si *close_fds* est vrai, alors aucun descripteur n'est hérité par le processus enfant à moins d'être explicitement passé dans l'élément ``handle_list`` de :attr:`STARTUPINFO.lpAttributeList`, ou par redirection des descripteurs standards.

source: The default for *close_fds* was changed from :const:`False` to what is described above.
fr: La valeur par défaut de *close_fds* n'est plus :const:`False`, comme décrit ci-dessus.

source: On Windows the default for *close_fds* was changed from :const:`False` to :const:`True` when redirecting the standard handles. It's now possible to set *close_fds* to :const:`True` when redirecting the standard handles.
fr: Sur Windows, la valeur par défaut de *close_fds* a été changée de :const:`False` à :const:`True` lors d'une redirection des descripteurs standards. Il est maintenant possible de donner la valeur :const:`True` à *close_fds* lors d'une redirection de descripteurs standards.

source: *pass_fds* is an optional sequence of file descriptors to keep open between the parent and child. Providing any *pass_fds* forces *close_fds* to be :const:`True`. (POSIX only)
fr: *pass_fds* est une séquence optionnelle de descripteurs de fichiers à garder ouverts entre le parent et l'enfant. Fournir *pass_fds* force *close_fds* à valoir :const:`True`. (POSIX seulement)

source: The *pass_fds* parameter was added.
fr: Ajout du paramètre *pass_fds*.

source: *cwd* parameter accepts a :term:`path-like object` on POSIX.
fr: le paramètre *cwd* accepte un :term:`objet chemin <path-like object>` sur les systèmes POSIX.

source: *cwd* parameter accepts a :term:`path-like object` on Windows.
fr: le paramètre *cwd* accepte un :term:`objet chemin <path-like object>` sur Windows.

source: *cwd* parameter accepts a bytes object on Windows.
fr: le paramètre *cwd* accepte une séquence d'octets sur Windows

source: If *restore_signals* is true (the default) all signals that Python has set to SIG_IGN are restored to SIG_DFL in the child process before the exec. Currently this includes the SIGPIPE, SIGXFZ and SIGXFSZ signals. (POSIX only)
fr: Si *restore_signals* est vrai (par défaut), tous les signaux que Python a mis à *SIG_IGN* sont restaurés à *SIG_DFL* dans le processus fils avant l'appel à *exec*. Actuellement, cela inclut les signaux *SIGPIPE*, *SIGXFZ* et *SIGXFSZ*. (POSIX seulement)

source: *restore_signals* was added.
fr: Ajout de *restore_signals*.

source: If *start_new_session* is true the setsid() system call will be made in the child process prior to the execution of the subprocess. (POSIX only)
fr: Si *start_new_session* est vrai, l'appel système à *setsid()* sera réalisé dans le processus fils avant l'exécution du sous-processus. (POSIX seulement)

source: *start_new_session* was added.
fr: Ajout de *start_new_session*.

source: If *env* is not ``None``, it must be a mapping that defines the environment variables for the new process; these are used instead of the default behavior of inheriting the current process' environment.
fr: Si *env* n'est pas ``None``, il doit être un tableau associatif définissant les variables d'environnement du nouveau processus ; elles seront utilisées à la place du comportement par défaut qui est d'hériter de l'environnement du processus courant.

source: If specified, *env* must provide any variables required for the program to execute. On Windows, in order to run a `side-by-side assembly`_ the specified *env* **must** include a valid :envvar:`SystemRoot`.
fr: Si spécifié, *env* doit fournir chaque variable requise pour l'exécution du programme. Sous Windows, afin d'exécuter un `side-by-side assembly`_, l'environnement *env* spécifié **doit** contenir une variable :envvar:`SystemRoot` valide.

source: If *encoding* or *errors* are specified, or *text* is true, the file objects *stdin*, *stdout* and *stderr* are opened in text mode with the specified encoding and *errors*, as described above in :ref:`frequently-used-arguments`. The *universal_newlines* argument is equivalent to *text* and is provided for backwards compatibility. By default, file objects are opened in binary mode.
fr: Si *encoding* ou *errors* sont spécifiés, ou si *text* est vrai, les fichiers *stdin*, *stdout* et *stderr* sont ouverts en mode texte, avec l'encodage et la valeur d'*errors* spécifiés, comme décrit ci-dessus dans :ref:`frequently-used-arguments`. L'argument *universal_newlines*, équivalent à *text*, est fourni pour la rétrocompatibilité. Autrement, ils sont ouverts comme des flux binaires.

source: *encoding* and *errors* were added.
fr: Ajout d'*encoding* et *errors*.

source: *text* was added as a more readable alias for *universal_newlines*.
fr: *text* a été ajouté comme un alias plus lisible de *universal_newlines*.

source: If given, *startupinfo* will be a :class:`STARTUPINFO` object, which is passed to the underlying ``CreateProcess`` function. *creationflags*, if given, can be one or more of the following flags:
fr: Si fourni, *startupinfo* sera un objet :class:`STARTUPINFO`, qui sera passé à la fonction ``CreateProcess`` inhérente. *creationflags*, si fourni, peut avoir l'une des valeurs suivantes :

source: Popen objects are supported as context managers via the :keyword:`with` statement: on exit, standard file descriptors are closed, and the process is waited for. ::
fr: Les objets *Popen* sont gérés comme gestionnaires de contexte avec l'instruction :keyword:`with` : à la sortie, les descripteurs de fichiers standards sont fermés, et le processus est attendu ::

source: Raises an :ref:`auditing event <auditing>` ``subprocess.Popen`` with arguments ``executable``, ``args``, ``cwd``, ``env``.
fr: Lève un :ref:`évènement d'audit <auditing>` ``subprocess.Popen`` avec comme arguments ``executable``, ``args``, ``cwd`` et ``env``.

source: Popen and the other functions in this module that use it raise an :ref:`auditing event <auditing>` ``subprocess.Popen`` with arguments ``executable``, ``args``, ``cwd``, and ``env``. The value for ``args`` may be a single string or a list of strings, depending on platform.
fr: *Popen* et les autres fonctions dans ce module qui l'utilisent lèvent un :ref:`évènement d'audit <auditing>` ``subprocess.Popen`` avec comme arguments ``executable``, ``args``, ``cwd`` et ``env``. La valeur pour ``args`` peut être une simple chaîne de caractères ou une liste de chaînes, en fonction de la plateforme.

source: Added context manager support.
fr: Ajout de la gestion des gestionnaires de contexte.

source: Popen destructor now emits a :exc:`ResourceWarning` warning if the child process is still running.
fr: Le destructeur de *Popen* émet maintenant un avertissement :exc:`ResourceWarning` si le processus fils est toujours en cours d'exécution.

source: Popen can use :func:`os.posix_spawn` in some cases for better performance. On Windows Subsystem for Linux and QEMU User Emulation, Popen constructor using :func:`os.posix_spawn` no longer raise an exception on errors like missing program, but the child process fails with a non-zero :attr:`~Popen.returncode`.
fr: *Popen* peut utiliser :func:`os.posix_spawn` dans certains cas pour de meilleures performances. Sur le sous-système Linux de Windows et sur *QEMU* en mode utilisateur, le constructeur de *Popen* utilisant :func:`os.posix_spawn` ne lève plus d'exception sur les erreurs comme programme manquant, mais le processus enfant échoue avec un :attr:`~Popen.returncode` différent de zéro.

source: Exceptions raised in the child process, before the new program has started to execute, will be re-raised in the parent.
fr: Les exceptions levées dans le processus fils, avant que le nouveau programme ait commencé à s'exécuter, seront ré-levées dans le parent.

source: A :exc:`ValueError` will be raised if :class:`Popen` is called with invalid arguments.
fr: Une :exc:`ValueError` sera levée si :class:`Popen` est appelé avec des arguments invalides.

source: :func:`check_call` and :func:`check_output` will raise :exc:`CalledProcessError` if the called process returns a non-zero return code.
fr: :func:`check_call` et :func:`check_output` lèveront une :exc:`CalledProcessError` si le processus appelé renvoie un code de retour non nul.

source: All of the functions and methods that accept a *timeout* parameter, such as :func:`call` and :meth:`Popen.communicate` will raise :exc:`TimeoutExpired` if the timeout expires before the process exits.
fr: Toutes les fonctions et méthodes qui acceptent un paramètre *timeout*, telles que :func:`call` et :meth:`Popen.communicate` lèveront une :exc:`TImeoutExpired` si le *timeout* expire avant la fin du processus.

source: Exceptions defined in this module all inherit from :exc:`SubprocessError`.
fr: Toutes les exceptions définies dans ce module héritent de :exc:`SubprocessError`.

source: The :exc:`SubprocessError` base class was added.
fr: Ajout de la classe de base :exc:`SubprocessError`.

source: Security Considerations
fr: Considérations de sécurité

source: Popen Objects
fr: Objets *Popen*

source: Instances of the :class:`Popen` class have the following methods:
fr: Les instances de la classe :class:`Popen` possèdent les méthodes suivantes :

source: Check if child process has terminated. Set and return :attr:`~Popen.returncode` attribute. Otherwise, returns ``None``.
fr: Vérifie que le processus enfant s'est terminé. Modifie et renvoie l'attribut :attr:`~Popen.returncode`, sinon, renvoie ``None``.

source: Wait for child process to terminate. Set and return :attr:`~Popen.returncode` attribute.
fr: Attend qu'un processus enfant se termine. Modifie l'attribut :attr:`~Popen.returncode` et le renvoie.

source: If the process does not terminate after *timeout* seconds, raise a :exc:`TimeoutExpired` exception. It is safe to catch this exception and retry the wait.
fr: Si le processus ne se termine pas après le nombre de secondes spécifié par *timeout*, une exception :exc:`TimeoutExpired` est levée. Cela ne pose aucun problème d'attraper cette exception et de réessayer d'attendre.

source: This will deadlock when using ``stdout=PIPE`` or ``stderr=PIPE`` and the child process generates enough output to a pipe such that it blocks waiting for the OS pipe buffer to accept more data. Use :meth:`Popen.communicate` when using pipes to avoid that.
fr: Cela provoquera un blocage (*deadlock*) lors de l'utilisation de ``stdout=PIPE`` ou ``stderr=PIPE`` si le processus fils génère tellement de données sur le tube qu'il le bloque, en attente que le système d'exploitation permette au tampon du tube d'accepter plus de données. Utilisez :meth:`Popen.communicate` pour éviter ce problème lors de l'utilisation de tubes.

source: The function is implemented using a busy loop (non-blocking call and short sleeps). Use the :mod:`asyncio` module for an asynchronous wait: see :class:`asyncio.create_subprocess_exec`.
fr: Cette fonction est implémentée avec une attente active (appels non bloquants et *sleep* courts). Utilisez le module :mod:`asyncio` pour une attente asynchrone : voir :class:`asyncio.create_subprocess_exec`.

source: *timeout* was added.
fr: Ajout de *timeout*.

source: :meth:`communicate` returns a tuple ``(stdout_data, stderr_data)``. The data will be strings if streams were opened in text mode; otherwise, bytes.
fr: :meth:`communicate` renvoie une paire ``(stdout_data, stderr_data)``. Les données seront des chaînes de caractères si les flux sont ouverts en mode texte, et des objets *bytes* dans le cas contraire.

source: Note that if you want to send data to the process's stdin, you need to create the Popen object with ``stdin=PIPE``. Similarly, to get anything other than ``None`` in the result tuple, you need to give ``stdout=PIPE`` and/or ``stderr=PIPE`` too.
fr: Notez que si vous souhaitez envoyer des données sur l'entrée standard du processus, vous devez créer l'objet *Popen* avec ``stdin=PIPE``. Similairement, pour obtenir autre chose que ``None`` dans le *n*-uplet résultant, vous devez aussi préciser ``stdout=PIPE`` et/ou ``stderr=PIPE``.

source: If the process does not terminate after *timeout* seconds, a :exc:`TimeoutExpired` exception will be raised. Catching this exception and retrying communication will not lose any output.
fr: Si le processus ne se termine pas après *timeout* secondes, une exception :exc:`TimeoutExpired` est levée. Attraper cette exception et retenter la communication ne fait perdre aucune donnée de sortie.

source: The child process is not killed if the timeout expires, so in order to cleanup properly a well-behaved application should kill the child process and finish communication::
fr: Le processus enfant n'est pas tué si le *timeout* expire, donc afin de nettoyer proprement le tout, une application polie devrait tuer le processus fils et terminer la communication ::

source: The data read is buffered in memory, so do not use this method if the data size is large or unlimited.
fr: Les données lues sont mises en cache en mémoire, donc n'utilisez pas cette méthode si la taille des données est importante voire illimitée.

source: Sends the signal *signal* to the child.
fr: Envoie le signal *signal* au fils.

source: On Windows, SIGTERM is an alias for :meth:`terminate`. CTRL_C_EVENT and CTRL_BREAK_EVENT can be sent to processes started with a *creationflags* parameter which includes `CREATE_NEW_PROCESS_GROUP`.
fr: Sous Windows, *SIGTERM* est un alias pour :meth:`terminate`. *CTRL_C_EVENT* et *CTRL_BREAK_EVENT* peuvent être envoyés aux processus démarrés avec un paramètre *creationflags* incluant ``CREATE_NEW_PROCESS_GROUP``.

source: Stop the child. On POSIX OSs the method sends SIGTERM to the child. On Windows the Win32 API function :c:func:`TerminateProcess` is called to stop the child.
fr: Stoppe le processus fils. Sur les systèmes POSIX, la méthode envoie un signal *SIGTERM* au fils. Sous Windows, la fonction :c:func:`TerminateProcess` de l'API *Win32* est appelée pour arrêter le fils.

source: Kills the child. On POSIX OSs the function sends SIGKILL to the child. On Windows :meth:`kill` is an alias for :meth:`terminate`.
fr: Tue le processus fils. Sur les systèmes POSIX, la fonction envoie un signal *SIGKILL* au fils. Sous Windows, :meth:`kill` est un alias pour :meth:`terminate`.

source: The following attributes are also available:
fr: Les attributs suivants sont aussi disponibles :

source: The *args* argument as it was passed to :class:`Popen` -- a sequence of program arguments or else a single string.
fr: L'argument *args* tel que passé à :class:`Popen` -- une séquence d'arguments du programme ou une simple chaîne de caractères.

source: If the *stdin* argument was :data:`PIPE`, this attribute is a writeable stream object as returned by :func:`open`. If the *encoding* or *errors* arguments were specified or the *universal_newlines* argument was ``True``, the stream is a text stream, otherwise it is a byte stream. If the *stdin* argument was not :data:`PIPE`, this attribute is ``None``.
fr: Si l'argument *stdin* valait :data:`PIPE`, cet attribut est un flux accessible en écriture comme renvoyé par :func:`open`. Si les arguments *encoding* ou *errors* ont été spécifiés, ou si *universal_newlines* valait ``True``, le flux est textuel, il est autrement binaire. Si l'argument *stdin* ne valait pas :data:`PIPE`, cet attribut est ``None``.

source: If the *stdout* argument was :data:`PIPE`, this attribute is a readable stream object as returned by :func:`open`. Reading from the stream provides output from the child process. If the *encoding* or *errors* arguments were specified or the *universal_newlines* argument was ``True``, the stream is a text stream, otherwise it is a byte stream. If the *stdout* argument was not :data:`PIPE`, this attribute is ``None``.
fr: Si l'argument *stdout* valait :data:`PIPE`, cet attribut est un flux accessible en lecture comme renvoyé par :func:`open`. Lire depuis le flux fournit la sortie du processus fils. Si les arguments *encoding* ou *errors* ont été spécifiés, ou si *universal_newlines* valait ``True``, le flux est textuel, il est autrement binaire. Si l'argument *stdout* ne valait pas :data:`PIPE`, cet attribut est ``None``.
