Repository: python/python-docs-fr
Catalog: library/subprocess.po
Languages: fr

source: :mod:`subprocess` --- Subprocess management
fr: :mod:`subprocess` — Gestion de sous-processus

source: **Source code:** :source:`Lib/subprocess.py`
fr: **Code source :** :source:`Lib/subprocess.py`

source: The :mod:`subprocess` module allows you to spawn new processes, connect to their input/output/error pipes, and obtain their return codes. This module intends to replace several older modules and functions::
fr: Le module :mod:`subprocess` vous permet de lancer de nouveaux processus, les connecter à des tubes d'entrée/sortie/erreur, et d'obtenir leurs codes de retour. Ce module a l'intention de remplacer plusieurs anciens modules et fonctions ::

source: Information about how the :mod:`subprocess` module can be used to replace these modules and functions can be found in the following sections.
fr: De plus amples informations sur comment le module :mod:`subprocess` peut être utilisé pour remplacer ces modules et fonctions peuvent être trouvées dans les sections suivantes.

source: :pep:`324` -- PEP proposing the subprocess module
fr: :pep:`324` -- PEP proposant le module *subprocess*

source: Using the :mod:`subprocess` Module
fr: Utiliser le module :mod:`subprocess`

source: The recommended approach to invoking subprocesses is to use the :func:`run` function for all use cases it can handle. For more advanced use cases, the underlying :class:`Popen` interface can be used directly.
fr: L'approche recommandée pour invoquer un sous-processus est d'utiliser la fonction :func:`run` pour tous les cas d'utilisation qu'elle gère. Pour les cas d'utilisation plus avancés, l'interface inhérente :class:`Popen` peut être utilisée directement.

source: Run the command described by *args*. Wait for command to complete, then return a :class:`CompletedProcess` instance.
fr: Lance la commande décrite par *args*. Attend que la commande se termine, puis renvoie une instance :class:`CompletedProcess`.

source: The arguments shown above are merely the most common ones, described below in :ref:`frequently-used-arguments` (hence the use of keyword-only notation in the abbreviated signature). The full function signature is largely the same as that of the :class:`Popen` constructor - most of the arguments to this function are passed through to that interface. (*timeout*, *input*, *check*, and *capture_output* are not.)
fr: Les arguments présentés ci-dessus sont simplement les plus utilisés, décrits ci-dessous dans la section :ref:`frequently-used-arguments` (d'où l'utilisation de la notation *keyword-only* dans la signature abrégée). La signature complète de la fonction est sensiblement la même que celle du constructeur de :class:`Popen`, à l'exception de *timeout*, *input*, *check* et *capture_output*, tous les arguments donnés à cette fonction passent à travers cette interface.

source: If *capture_output* is true, stdout and stderr will be captured. When used, the internal :class:`Popen` object is automatically created with ``stdout=PIPE`` and ``stderr=PIPE``. The *stdout* and *stderr* arguments may not be supplied at the same time as *capture_output*. If you wish to capture and combine both streams into one, use ``stdout=PIPE`` and ``stderr=STDOUT`` instead of *capture_output*.
fr: Si *capture_output* est vrai, la sortie et l'erreur standard (``stdout`` et ``stderr``) sont capturées. Dans ce cas, l'objet interne :class:`Popen` est automatiquement créé avec les arguments ``stdout=PIPE`` et ``stderr=PIPE``. Les arguments *stdout* et *stderr* ne doivent pas être passés en même temps que *capture_output*. Si vous souhaitez capturer et combiner les deux flux dans un seul, utilisez ``stdout=PIPE`` et ``stderr=STDOUT`` au lieu de *capture_output*.

source: The *timeout* argument is passed to :meth:`Popen.communicate`. If the timeout expires, the child process will be killed and waited for. The :exc:`TimeoutExpired` exception will be re-raised after the child process has terminated.
fr: L'argument *timeout* est passé à :meth:`Popen.communicate`. Si le *timeout* expire, le processus enfant sera tué et attendu. Une exception :exc:`TimeoutExpired` sera levée une fois que le processus enfant se sera terminé.

source: The *input* argument is passed to :meth:`Popen.communicate` and thus to the subprocess's stdin. If used it must be a byte sequence, or a string if *encoding* or *errors* is specified or *text* is true. When used, the internal :class:`Popen` object is automatically created with ``stdin=PIPE``, and the *stdin* argument may not be used as well.
fr: L'argument *input* est passé à :meth:`Popen.communicate` et donc à l'entrée standard (*stdin*) du sous-processus. Si l'argument est utilisé, il doit contenir une séquence de *bytes*, ou une chaîne de caractères si *encoding* ou *errors* sont spécifiés, ou si *text* est vrai. Quand cet argument est utilisé, l'objet interne :class:`Popen` est automatiquement créé avec ``stdin=PIPE``, et l'argument *stdin* ne doit donc pas être utilisé.

source: If *check* is true, and the process exits with a non-zero exit code, a :exc:`CalledProcessError` exception will be raised. Attributes of that exception hold the arguments, the exit code, and stdout and stderr if they were captured.
fr: Si *check* est vrai, et que le processus s'arrête avec un code de statut non nul, une exception :exc:`CalledProcessError` est levée. Les attributs de cette exception contiennent les arguments, le code de statut, et les sorties standard et d'erreur si elles ont été capturées.

source: If *encoding* or *errors* are specified, or *text* is true, file objects for stdin, stdout and stderr are opened in text mode using the specified *encoding* and *errors* or the :class:`io.TextIOWrapper` default. The *universal_newlines* argument is equivalent to *text* and is provided for backwards compatibility. By default, file objects are opened in binary mode.
fr: Si *encoding* ou *errors* sont spécifiés, ou *text* est vrai, les fichiers pour les entrées et sorties sont ouverts en mode texte en utilisant les paramètres *encoding* et *errors* spécifiés, ou les valeurs par défaut de :class:`io.TextIOWrapper`. L'argument *universal_newlines* est équivalent à *text* et est fourni pour la rétrocompatibilité. Par défaut, les fichiers sont ouverts en mode binaire.

source: If *env* is not ``None``, it must be a mapping that defines the environment variables for the new process; these are used instead of the default behavior of inheriting the current process' environment. It is passed directly to :class:`Popen`.
fr: Si *env* n'est pas ``None``, il doit être un tableau associatif définissant les variables d'environnement du nouveau processus ; elles seront utilisées à la place du comportement par défaut qui est d'hériter de l'environnement du processus courant. Il est passé directement à :class:`Popen`.

source: Examples::
fr: Exemples ::

source: Added *encoding* and *errors* parameters
fr: Ajout des paramètres *encoding* et *errors*

source: Added the *text* parameter, as a more understandable alias of *universal_newlines*. Added the *capture_output* parameter.
fr: Ajout du paramètre *text*, qui agit comme un alias plus compréhensible de *universal_newlines*. Ajout du paramètre *capture_output*.

source: The return value from :func:`run`, representing a process that has finished.
fr: La valeur de retour de :func:`run`, représentant un processus qui s'est terminé.

source: The arguments used to launch the process. This may be a list or a string.
fr: Les arguments utilisés pour lancer le processus. Cela peut être une liste ou une chaîne de caractères.

source: Exit status of the child process. Typically, an exit status of 0 indicates that it ran successfully.
fr: Le code de statut du processus fils. Typiquement, un code de statut de 0 indique qu'il s'est exécuté avec succès.

source: A negative value ``-N`` indicates that the child was terminated by signal ``N`` (POSIX only).
fr: Une valeur négative ``-N`` indique que le processus enfant a été terminé par un signal ``N`` (seulement sur les systèmes *POSIX*).

source: Captured stdout from the child process. A bytes sequence, or a string if :func:`run` was called with an encoding, errors, or text=True. ``None`` if stdout was not captured.
fr: La sortie standard capturée du processus enfant. Une séquence de *bytes*, ou une chaîne de caractères si :func:`run` a été appelée avec *encoding*, *errors* ou *text=True*. Vaut ``None`` si la sortie standard n'était pas capturée.

source: If you ran the process with ``stderr=subprocess.STDOUT``, stdout and stderr will be combined in this attribute, and :attr:`stderr` will be ``None``.
fr: Si vous avez lancé le processus avec ``stderr=subprocess.STDOUT``, les sorties standard et d'erreur seront combinées dans cet attribut, et :attr:`stderr` sera mis à ``None``.

source: Captured stderr from the child process. A bytes sequence, or a string if :func:`run` was called with an encoding, errors, or text=True. ``None`` if stderr was not captured.
fr: La sortie d'erreur capturée du processus enfant. Une séquence de *bytes*, ou une chaîne de caractères si :func:`run` a été appelée avec *encoding*, *errors* ou *text=True*. Vaut ``None`` si la sortie d'erreur n'était pas capturée.

source: If :attr:`returncode` is non-zero, raise a :exc:`CalledProcessError`.
fr: Si :attr:`returncode` n'est pas nul, lève une :exc:`CalledProcessError`.

source: Special value that can be used as the *stdin*, *stdout* or *stderr* argument to :class:`Popen` and indicates that the special file :data:`os.devnull` will be used.
fr: Valeur spéciale qui peut être utilisée pour les arguments *stdin*, *stdout* ou *stderr* de :class:`Popen` et qui indique que le fichier spécial :data:`os.devnull` sera utilisé.

source: Special value that can be used as the *stdin*, *stdout* or *stderr* argument to :class:`Popen` and indicates that a pipe to the standard stream should be opened. Most useful with :meth:`Popen.communicate`.
fr: Valeur spéciale qui peut être utilisée pour les arguments *stdin*, *stdout* ou *stderr* de :class:`Popen` et qui indique qu'un tube vers le flux standard doit être ouvert. Surtout utile avec :meth:`Popen.communicate`.

source: Special value that can be used as the *stderr* argument to :class:`Popen` and indicates that standard error should go into the same handle as standard output.
fr: Valeur spéciale qui peut être utilisée pour l'argument *stderr* de :class:`Popen` et qui indique que la sortie d'erreur doit être redirigée vers le même descripteur que la sortie standard.

source: Base class for all other exceptions from this module.
fr: Classe de base à toutes les autres exceptions du module.

source: Subclass of :exc:`SubprocessError`, raised when a timeout expires while waiting for a child process.
fr: Sous-classe de :exc:`SubprocessError`, levée quand un *timeout* expire pendant l'attente d'un processus enfant.

source: Command that was used to spawn the child process.
fr: La commande utilisée pour instancier le processus fils.

source: Timeout in seconds.
fr: Le *timeout* en secondes.

source: Alias for output, for symmetry with :attr:`stderr`.
fr: Alias pour *output*, afin d'avoir une symétrie avec :attr:`stderr`.

source: *stdout* and *stderr* attributes added
fr: Ajout des attributs *stdout* et *stderr*

source: Exit status of the child process. If the process exited due to a signal, this will be the negative signal number.
fr: Code de statut du processus fils. Si le processus a été arrêté par un signal, le code sera négatif et correspondra à l'opposé du numéro de signal.

source: Output of the child process if it was captured by :func:`run` or :func:`check_output`. Otherwise, ``None``.
fr: La sortie du processus fils, si capturée par :func:`run` ou :func:`check_output`. Autrement, ``None``.

source: Stderr output of the child process if it was captured by :func:`run`. Otherwise, ``None``.
fr: La sortie d'erreur du processus fils, si capturée par :func:`run`. Autrement, ``None``.

source: Frequently Used Arguments
fr: Arguments fréquemment utilisés

source: To support a wide variety of use cases, the :class:`Popen` constructor (and the convenience functions) accept a large number of optional arguments. For most typical use cases, many of these arguments can be safely left at their default values. The arguments that are most commonly needed are:
fr: Pour gérer un large ensemble de cas, le constructeur de :class:`Popen` (et les fonctions de convenance) acceptent de nombreux arguments optionnels. Pour les cas d'utilisation les plus typiques, beaucoup de ces arguments peuvent sans problème être laissés à leurs valeurs par défaut. Les arguments les plus communément nécessaires sont :

source: *args* is required for all calls and should be a string, or a sequence of program arguments. Providing a sequence of arguments is generally preferred, as it allows the module to take care of any required escaping and quoting of arguments (e.g. to permit spaces in file names). If passing a single string, either *shell* must be :const:`True` (see below) or else the string must simply name the program to be executed without specifying any arguments.
fr: *args* est requis pour tous les appels et doit être une chaîne de caractères ou une séquence d'arguments du programme. Il est généralement préférable de fournir une séquence d'arguments, puisque cela permet au module de s'occuper des potentiels échappements ou guillemets autour des arguments (p. ex. pour permettre des espaces dans des noms de fichiers). Si l'argument est passé comme une simple chaîne, soit *shell* doit valoir :const:`True` (voir ci-dessous) soit la chaîne doit simplement contenir le nom du programme à exécuter sans spécifier d'arguments supplémentaires.

source: If *encoding* or *errors* are specified, or *text* (also known as *universal_newlines*) is true, the file objects *stdin*, *stdout* and *stderr* will be opened in text mode using the *encoding* and *errors* specified in the call or the defaults for :class:`io.TextIOWrapper`.
fr: Si *encoding* ou *errors* sont spécifiés, ou si *text* (aussi appelé *universal_newlines*) est vrai, les fichiers *stdin*, *stdout* et *stderr* seront ouverts en mode texte en utilisant les *encoding* et *errors* spécifiés à l'appel, ou les valeurs par défaut de :class:`io.TextIOWrapper`.

source: For *stdin*, line ending characters ``'\n'`` in the input will be converted to the default line separator :data:`os.linesep`. For *stdout* and *stderr*, all line endings in the output will be converted to ``'\n'``. For more information see the documentation of the :class:`io.TextIOWrapper` class when the *newline* argument to its constructor is ``None``.
fr: Pour *stdin*, les caractères de fin de ligne ``'\n'`` de l'entrée seront convertis vers des séparateurs de ligne par défaut :data:`os.linesep`. Pour *stdout* et *stderr*, toutes les fins de lignes des sorties seront converties vers ``'\n'``. Pour plus d'informations, voir la documentation de la classe :class:`io.TextIOWrapper` quand l'argument *newline* du constructeur est ``None``.

source: If text mode is not used, *stdin*, *stdout* and *stderr* will be opened as binary streams. No encoding or line ending conversion is performed.
fr: Si le mode texte n'est pas utilisé, *stdin*, *stdout* et *stderr* seront ouverts comme des flux binaires. Aucune conversion d'encodage ou de fins de ligne ne sera réalisée.

source: Added *encoding* and *errors* parameters.
fr: Ajout des paramètres *encoding* et *errors*.

source: Added the *text* parameter as an alias for *universal_newlines*.
fr: Ajout du paramètre *text* comme alias de *universal_newlines*.

source: The newlines attribute of the file objects :attr:`Popen.stdin`, :attr:`Popen.stdout` and :attr:`Popen.stderr` are not updated by the :meth:`Popen.communicate` method.
fr: L'attribut *newlines* des objets :attr:`Popen.stdin`, :attr:`Popen.stdout` et :attr:`Popen.stderr` ne sont pas mis à jour par la méthode :meth:`Popen.communicate`.

source: If *shell* is ``True``, the specified command will be executed through the shell. This can be useful if you are using Python primarily for the enhanced control flow it offers over most system shells and still want convenient access to other shell features such as shell pipes, filename wildcards, environment variable expansion, and expansion of ``~`` to a user's home directory. However, note that Python itself offers implementations of many shell-like features (in particular, :mod:`glob`, :mod:`fnmatch`, :func:`os.walk`, :func:`os.path.expandvars`, :func:`os.path.expanduser`, and :mod:`shutil`).
fr: Si *shell* vaut ``True``, la commande spécifiée sera exécutée à travers un *shell*. Cela peut être utile si vous utilisez Python pour le contrôle de flot qu'il propose par rapport à beaucoup de *shells* système et voulez tout de même profiter des autres fonctionnalités des *shells* telles que les tubes (*pipes*), les motifs de fichiers, l'expansion des variables d'environnement, et l'expansion du ``~`` vers le répertoire d’accueil de l'utilisateur. Cependant, notez que Python lui-même propose l'implémentation de beaucoup de ces fonctionnalités (en particulier :mod:`glob`, :mod:`fnmatch`, :func:`os.walk`, :func:`os.path.expandvars`, :func:`os.path.expanduser` et :mod:`shutil`).

source: When *universal_newlines* is ``True``, the class uses the encoding :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` instead of ``locale.getpreferredencoding()``. See the :class:`io.TextIOWrapper` class for more information on this change.
fr: Quand *universal_newlines* vaut ``True``, la classe utilise l'encodage :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` plutôt que ``locale.getpreferredencoding()``. Voir la classe :class:`io.TextIOWrapper` pour plus d'informations sur ce changement.

source: Read the `Security Considerations`_ section before using ``shell=True``.
fr: Lire la section `Security Considerations`_ avant d'utiliser ``shell=True``.

source: These options, along with all of the other options, are described in more detail in the :class:`Popen` constructor documentation.
fr: Ces options, ainsi que toutes les autres, sont décrites plus en détails dans la documentation du constructeur de :class:`Popen`.

source: Popen Constructor
fr: Constructeur de *Popen*

source: The underlying process creation and management in this module is handled by the :class:`Popen` class. It offers a lot of flexibility so that developers are able to handle the less common cases not covered by the convenience functions.
fr: La création et la gestion sous-jacentes des processus est gérée par la classe :class:`Popen`. Elle offre beaucoup de flexibilité de façon à ce que les développeurs soient capables de gérer les cas d'utilisation les moins communs, non couverts par les fonctions de convenance.

source: *args* should be a sequence of program arguments or else a single string or :term:`path-like object`. By default, the program to execute is the first item in *args* if *args* is a sequence. If *args* is a string, the interpretation is platform-dependent and described below. See the *shell* and *executable* arguments for additional differences from the default behavior. Unless otherwise stated, it is recommended to pass *args* as a sequence.
fr: *args* peut être une séquence d'arguments du programme, une chaîne seule ou un :term:`objet chemin <path-like object>`. Par défaut, le programme à exécuter est le premier élément de *args* si *args* est une séquence. Si *args* est une chaîne de caractères, l'interprétation dépend de la plateforme et est décrite plus bas. Voir les arguments *shell* et *executable* pour d'autres différences avec le comportement par défaut. Sans autre indication, il est recommandé de passer *args* comme une séquence.

source: On POSIX, if *args* is a string, the string is interpreted as the name or path of the program to execute. However, this can only be done if not passing arguments to the program.
fr: Sur les systèmes *POSIX*, si *args* est une chaîne, elle est interprétée comme le nom ou le chemin du programme à exécuter. Cependant, cela ne peut être fait que si le programme est passé sans arguments.

source: Note in particular that options (such as *-input*) and arguments (such as *eggs.txt*) that are separated by whitespace in the shell go in separate list elements, while arguments that need quoting or backslash escaping when used in the shell (such as filenames containing spaces or the *echo* command shown above) are single list elements.
fr: Notez en particulier que les options (comme *-input*) et arguments (comme *eggs.txt*) qui sont séparés par des espaces dans le *shell* iront dans des éléments séparés de la liste, alors que les arguments qui nécessitent des guillemets et échappements quand utilisés dans le *shell* (comme les noms de fichiers contenant des espaces ou la commande *echo* montrée plus haut) forment des éléments uniques.

source: On Windows, if *args* is a sequence, it will be converted to a string in a manner described in :ref:`converting-argument-sequence`. This is because the underlying ``CreateProcess()`` operates on strings.
fr: Sous Windows, si *args* est une séquence, elle sera convertie vers une chaîne de caractères de la manière décrite dans :ref:`converting-argument-sequence`. Cela fonctionne ainsi parce que la fonction ``CreateProcess()`` opère sur des chaînes.

source: *args* parameter accepts a :term:`path-like object` if *shell* is ``False`` and a sequence containing path-like objects on POSIX.
fr: Le paramètre *args* accepte un :term:`objet chemin <path-like object>` si *shell* vaut ``False`` et une séquence contenant des objets fichier sur POSIX.

source: *args* parameter accepts a :term:`path-like object` if *shell* is ``False`` and a sequence containing bytes and path-like objects on Windows.
fr: Le paramètre *args* accepte un :term:`objet chemin <path-like object>` si *shell* vaut ``False`` et une séquence contenant des chaines d'octets et des objets chemins sur Windows.

source: The *shell* argument (which defaults to ``False``) specifies whether to use the shell as the program to execute. If *shell* is ``True``, it is recommended to pass *args* as a string rather than as a sequence.
fr: L'argument *shell* (qui vaut ``False`` par défaut) spécifie s'il faut utiliser un *shell* comme programme à exécuter. Si *shell* vaut ``True``, il est recommandé de passer *args* comme une chaîne de caractères plutôt qu'une séquence.

source: On POSIX with ``shell=True``, the shell defaults to :file:`/bin/sh`. If *args* is a string, the string specifies the command to execute through the shell. This means that the string must be formatted exactly as it would be when typed at the shell prompt. This includes, for example, quoting or backslash escaping filenames with spaces in them. If *args* is a sequence, the first item specifies the command string, and any additional items will be treated as additional arguments to the shell itself. That is to say, :class:`Popen` does the equivalent of::
fr: Sur les systèmes POSIX avec ``shell=True``, le *shell* par défaut est :file:`/bin/sh`. Si *args* est une chaîne de caractères, la chaîne spécifie la commande à exécuter à travers le *shell*. Cela signifie que la chaîne doit être formatée exactement comme elle le serait si elle était tapée dans l'invite de commandes du *shell*. Cela inclut, par exemple, les guillemets ou les *backslashs* échappant les noms de fichiers contenant des espaces. Si *args* est une séquence, le premier élément spécifie la commande, et les éléments supplémentaires seront traités comme des arguments additionnels à passer au *shell* lui-même. Pour ainsi dire, :class:`Popen` réalise l'équivalent de ::
