Repository: python/python-docs-fr
Catalog: library/sys.po
Languages: fr

source: Set the system's profile function, which allows you to implement a Python source code profiler in Python. See chapter :ref:`profile` for more information on the Python profiler. The system's profile function is called similarly to the system's trace function (see :func:`settrace`), but it is called with different events, for example it isn't called for each executed line of code (only on call and return, but the return event is reported even when an exception has been set). The function is thread-specific, but there is no way for the profiler to know about context switches between threads, so it does not make sense to use this in the presence of multiple threads. Also, its return value is not used, so it can simply return ``None``. Error in the profile function will cause itself unset.
fr: Définit la fonction de profilage du système, qui vous permet d'implémenter un profileur de code source Python en Python. Voir le chapitre :ref:`profile` pour plus d'informations sur le profileur Python. La fonction de profilage du système est appelée de la même façon que la fonction trace du système (voir :func:`settrace`), mais elle est appelée pour des évènements différents, par exemple elle n'est pas appelée à chaque ligne de code exécutée (seulement sur appel et retours, mais l'événement pour les retours est appelé même en cas d'exception). Cette fonction est locale au fil d'exécution, et il n'existe aucun moyen, du point de vue du profileur, de prendre conscience des changements de contextes entre fils d'exécution, ça n'a donc aucun sens d'utiliser cette fonction dans un contexte *multithread*. Sa valeur de retour n'est pas utilisée, elle peut simplement renvoyer ``None``.

source: Profile functions should have three arguments: *frame*, *event*, and *arg*. *frame* is the current stack frame. *event* is a string: ``'call'``, ``'return'``, ``'c_call'``, ``'c_return'``, or ``'c_exception'``. *arg* depends on the event type.
fr: Les fonctions de traçage doivent avoir trois arguments : *frame*, *event*, et *arg*. *frame* est la *stack frame* actuelle. *event* est une chaîne de caractères pouvant valoir : ``'call'``, ``'return'``, ``'c_call'``, ``'c_return'`` ou ``'c_exception'``. *arg* dépend du type de l'évènement.

source: The events have the following meaning:
fr: Les événements ont la signification suivante :

source: A function is called (or some other code block entered). The profile function is called; *arg* is ``None``.
fr: Une fonction est appelée (ou Python entre dans un autre bloc de code). La fonction de traçage est appelée, *arg* est ``None``.

source: A function (or other code block) is about to return. The profile function is called; *arg* is the value that will be returned, or ``None`` if the event is caused by an exception being raised.
fr: La fonction (ou un autre type de bloc) est sur le point de se terminer. La fonction de traçage est appelée, *arg* est la valeur qui sera renvoyée, ou ``None`` si l'événement est causé par la levée d'une exception.

source: A C function is about to be called. This may be an extension function or a built-in. *arg* is the C function object.
fr: Une fonction C est sur le point d'être appelée. C'est soit une fonction d'extension ou une fonction native. *arg* représente la fonction C.

source: A C function has returned. *arg* is the C function object.
fr: Une fonction C a renvoyé une valeur. *arg* représente la fonction C.

source: A C function has raised an exception. *arg* is the C function object.
fr: Une fonction C a levé une exception. *arg* représente la fonction C.

source: Set the maximum depth of the Python interpreter stack to *limit*. This limit prevents infinite recursion from causing an overflow of the C stack and crashing Python.
fr: Définit la profondeur maximale de la pile de l'interpréteur Python à *limit*. Cette limite empêche une récursion infinie de provoquer un débordement de la pile C et ainsi un crash de Python.

source: The highest possible limit is platform-dependent. A user may need to set the limit higher when they have a program that requires deep recursion and a platform that supports a higher limit. This should be done with care, because a too-high limit can lead to a crash.
fr: La limite haute dépend de la plate-forme. Un utilisateur pourrait avoir besoin de remonter la limite, lorsque son programme nécessite une récursion profonde, si sa plate-forme le permet. Cela doit être fait avec précaution, car une limite trop élevée peut conduire à un crash.

source: If the new limit is too low at the current recursion depth, a :exc:`RecursionError` exception is raised.
fr: Si la nouvelle limite est plus basse que la profondeur actuelle, une :exc:`RecursionError` est levée.

source: A :exc:`RecursionError` exception is now raised if the new limit is too low at the current recursion depth.
fr: Une :exc:`RecursionError` est maintenant levée si la nouvelle limite est plus basse que la profondeur de récursion actuelle.

source: Set the interpreter's thread switch interval (in seconds). This floating-point value determines the ideal duration of the "timeslices" allocated to concurrently running Python threads. Please note that the actual value can be higher, especially if long-running internal functions or methods are used. Also, which thread becomes scheduled at the end of the interval is the operating system's decision. The interpreter doesn't have its own scheduler.
fr: Configure l'intervalle de bascule des fils d'exécution de l'interpréteur (en secondes). Ce nombre à virgule flottante détermine la durée idéale allouée aux fils d'exécution en cour d'exécution (durée appelée *timeslices*). Notez que la durée observée peut être plus grande, typiquement si des fonctions ou méthodes prenant beaucoup de temps sont utilisées. Aussi, le choix du fil d'exécution prenant la main à la fin de l'intervalle revient au système d'exploitation. L'interpréteur n'a pas son propre ordonnanceur.

source: Set the system's trace function, which allows you to implement a Python source code debugger in Python. The function is thread-specific; for a debugger to support multiple threads, it must register a trace function using :func:`settrace` for each thread being debugged or use :func:`threading.settrace`.
fr: Définit la fonction de traçage du système, qui vous permet d'implémenter un débogueur de code source Python en Python. Cette fonction est locale au fil d'exécution courant. Pour qu'un débogueur puisse gérer plusieurs fils d'exécution, il doit enregistrer sa fonction en appelant :func:`settrace` pour chaque fil d'exécution qu'il souhaite surveiller ou utilisez :func:`threading.settrace`.

source: Trace functions should have three arguments: *frame*, *event*, and *arg*. *frame* is the current stack frame. *event* is a string: ``'call'``, ``'line'``, ``'return'``, ``'exception'`` or ``'opcode'``. *arg* depends on the event type.
fr: Les fonctions de traçage doivent avoir trois arguments : *frame*, *event*, et *arg*. *frame* est la *stack frame* actuelle. *event* est une chaîne de caractères pouvant valoir : ``'call'``, ``'line'``, ``'return'``, ``'exception'`` ou ``'opcode'``. *arg* dépend du type de l'évènement.

source: The trace function is invoked (with *event* set to ``'call'``) whenever a new local scope is entered; it should return a reference to a local trace function to be used for the new scope, or ``None`` if the scope shouldn't be traced.
fr: La fonction de traçage est appelée (avec *event* à ``'call'``) à chaque fois que l'interpréteur entre dans un nouveau *scope*. Elle doit renvoyer une référence à une fonction de traçage locale à utiliser pour ce *scope*, ou ``None`` si le *Scope* ne doit pas être tracé.

source: The local trace function should return a reference to itself (or to another function for further tracing in that scope), or ``None`` to turn off tracing in that scope.
fr: La fonction de traçage doit renvoyer une référence à elle-même (ou à une autre fonction de traçage pour un traçage ultérieur dans cette portée), ou ``None`` pour désactiver le traçage dans cette portée.

source: If there is any error occurred in the trace function, it will be unset, just like ``settrace(None)`` is called.
fr: Si une erreur se produit dans la fonction de trace, elle sera désactivée, tout comme si ``settrace(None)`` avait été appelée.

source: A function is called (or some other code block entered). The global trace function is called; *arg* is ``None``; the return value specifies the local trace function.
fr: Une fonction est appelée (un un bloc de code). La fonction de traçage globale est appelée, *arg* est ``None``, la valeur renvoyée donne la fonction de traçage locale.

source: The interpreter is about to execute a new line of code or re-execute the condition of a loop. The local trace function is called; *arg* is ``None``; the return value specifies the new local trace function. See :file:`Objects/lnotab_notes.txt` for a detailed explanation of how this works. Per-line events may be disabled for a frame by setting :attr:`f_trace_lines` to :const:`False` on that frame.
fr: L'interpréteur est sur le point d'exécuter une nouvelle ligne de code ou de ré-exécuter la condition d'une boucle. La fonction de traçage locale est appelée, *arg* vaut ``None``, et la valeur de retour donne la nouvelle fonction de traçage locale. Voir :file:`Objects/lnotab_notes.txt` pour une explication détaillée de ce mécanisme. Les évènements par ligne peuvent être désactivés pour un cadre d'exécution en mettant :attr:`f_trace_lines` à :const:`False` pour ce cadre d'exécution.

source: A function (or other code block) is about to return. The local trace function is called; *arg* is the value that will be returned, or ``None`` if the event is caused by an exception being raised. The trace function's return value is ignored.
fr: La fonction (ou un autre type de bloc) est sur le point de se terminer. La fonction de traçage locale est appelée, *arg* est la valeur qui sera renvoyée, ou ``None`` si l'événement est causé par la levée d'une exception. La valeur renvoyée par la fonction de traçage est ignorée.

source: An exception has occurred. The local trace function is called; *arg* is a tuple ``(exception, value, traceback)``; the return value specifies the new local trace function.
fr: Une exception est survenue. La fonction de traçage locale est appelée, *arg* est le *tuple* ``(exception, valeur, traceback)``, la valeur renvoyée spécifie la nouvelle fonction de traçage locale.

source: The interpreter is about to execute a new opcode (see :mod:`dis` for opcode details). The local trace function is called; *arg* is ``None``; the return value specifies the new local trace function. Per-opcode events are not emitted by default: they must be explicitly requested by setting :attr:`f_trace_opcodes` to :const:`True` on the frame.
fr: L'interpréteur va exécuter un nouvel *opcode* (voyez :mod:`dis` pour plus de détails). La fonction de traçage locale est appelée ; *arg* vaut ``None`` ; la valeur retournée donne la nouvelle fonction de traçage locale. Le traçage ne se fait pas *opcode* par *opcode* par défaut : cela doit être explicitement requis en mettant :attr:`f_trace_opcodes` à :const:`True` pour cette *frame*.

source: Note that as an exception is propagated down the chain of callers, an ``'exception'`` event is generated at each level.
fr: Remarquez que, comme une exception se propage au travers de toute chaîne d'appelants, un événement ``'exception'`` est généré à chaque niveau.

source: For more information on code and frame objects, refer to :ref:`types`.
fr: Pour plus d'informations sur les objets code et objets représentant une *frame* de la pile, consultez :ref:`types`.

source: The :func:`settrace` function is intended only for implementing debuggers, profilers, coverage tools and the like. Its behavior is part of the implementation platform, rather than part of the language definition, and thus may not be available in all Python implementations.
fr: La fonction :func:`settrace` est destinée uniquement à l'implémentation de débogueurs, de profileurs, d'outils d'analyse de couverture et d'autres outils similaires. Son comportement fait partie de l'implémentation, plutôt que de la définition du langage, et peut donc ne pas être disponible dans toutes les implémentations de Python.

source: ``'opcode'`` event type added; :attr:`f_trace_lines` and :attr:`f_trace_opcodes` attributes added to frames
fr: Ajout du type d’événement ``'opcode'`` ; les attributs :attr:`f_trace_lines` et :attr:`f_trace_opcodes` ont été ajoutés aux cadres d'exécution

source: Accepts two optional keyword arguments which are callables that accept an :term:`asynchronous generator iterator` as an argument. The *firstiter* callable will be called when an asynchronous generator is iterated for the first time. The *finalizer* will be called when an asynchronous generator is about to be garbage collected.
fr: Accepte deux arguments optionnels nommés, qui sont appelables qui acceptent un :term:`asynchronous generator iterator` comme argument. L'appelable *firsttiter* sera appelé lorsqu'un générateur asynchrone sera itéré pour la première fois, et l'appelable *finalizer* sera appelé lorsqu'un générateur asynchrone est sur le point d'être détruit.

source: See :pep:`525` for more details, and for a reference example of a *finalizer* method see the implementation of ``asyncio.Loop.shutdown_asyncgens`` in :source:`Lib/asyncio/base_events.py`
fr: Voir la :pep:`525` pour plus de détails. Pour un exemple de *finalizer*, voir l'implémentation de ``asyncio.Loop.shutdown_asyncgens`` dans :source:`Lib/asyncio/base_events.py`

source: Allows enabling or disabling coroutine origin tracking. When enabled, the ``cr_origin`` attribute on coroutine objects will contain a tuple of (filename, line number, function name) tuples describing the traceback where the coroutine object was created, with the most recent call first. When disabled, ``cr_origin`` will be None.
fr: Permet d'activer ou de désactiver le suivi d'origine de la coroutine. Lorsque cette option est activée, l'attribut ``cr_origin`` sur les objets de la coroutine contient un tuple (nom de fichier, numéro de ligne, nom de fonction) de tuples gardant la trace d'appels de l'endroit où l'objet coroutine a été créé, avec l'appel le plus récent en premier. Lorsqu'il est désactivé, la valeur de ``cr_origin`` est ``None``.

source: To enable, pass a *depth* value greater than zero; this sets the number of frames whose information will be captured. To disable, pass set *depth* to zero.
fr: Pour l'activer, passez une valeur *depth* supérieure à zéro ; cela définit le nombre de cadres d'exécution dont les informations sont capturées. Pour le désactiver, mettez *depth* à zéro.

source: This setting is thread-specific.
fr: Ce paramètre est spécifique au fil d'exécution courant.

source: Changes the default filesystem encoding and errors mode to 'mbcs' and 'replace' respectively, for consistency with versions of Python prior to 3.6.
fr: Change l'encodage et le mode de gestion d'erreur par défaut du système de fichiers à *mbcs* et *replace* respectivement, par cohérence avec les versions de Python antérieures à la 3.6.

source: This is equivalent to defining the :envvar:`PYTHONLEGACYWINDOWSFSENCODING` environment variable before launching Python.
fr: Équivaut à définir la variable d'environnement :envvar:`PYTHONLEGACYWINDOWSFSENCODING` avant de lancer Python.

source: See :pep:`529` for more details.
fr: Voir la :pep:`529` pour plus d'informations.

source: :term:`File objects <file object>` used by the interpreter for standard input, output and errors:
fr: :term:`objets fichiers <file object>` utilisés par l'interpréteur pour l'entrée standard, la sortie standard et la sortie d'erreurs :

source: ``stdin`` is used for all interactive input (including calls to :func:`input`);
fr: ``stdin`` est utilisé pour toutes les entrées interactives (y compris les appels à :func:`input`)

source: ``stdout`` is used for the output of :func:`print` and :term:`expression` statements and for the prompts of :func:`input`;
fr: ``stdout`` est utilisé pour la sortie de :func:`print`, des :term:`expression` et pour les invites de :func:`input` ;

source: The interpreter's own prompts and its error messages go to ``stderr``.
fr: Les invites de l'interpréteur et ses messages d'erreur sont écrits sur ``stderr``.

source: These streams are regular :term:`text files <text file>` like those returned by the :func:`open` function. Their parameters are chosen as follows:
fr: Ces flux sont de classiques :term:`fichiers texte <text file>` comme ceux renvoyés par la fonction :func:`open`. Leurs paramètres sont choisis comme suit :

source: The character encoding is platform-dependent. Non-Windows platforms use the locale encoding (see :meth:`locale.getpreferredencoding()`).
fr: L'encodage des caractères dépend de la plateforme. Les plateformes non Windows utilisent l'encodage défini dans les paramètres régionaux (voir :meth:`locale.getpreferredencoding()`).

source: On Windows, UTF-8 is used for the console device. Non-character devices such as disk files and pipes use the system locale encoding (i.e. the ANSI codepage). Non-console character devices such as NUL (i.e. where ``isatty()`` returns ``True``) use the value of the console input and output codepages at startup, respectively for stdin and stdout/stderr. This defaults to the system locale encoding if the process is not initially attached to a console.
fr: Sous Windows, UTF-8 est utilisé pour le périphérique de console. Les périphériques non-caractères tels que les fichiers de disque et les tubes (*pipe* en anglais) utilisent l'encodage des paramètres régionaux du système (c'est-à-dire la page de codes ANSI). Les périphériques de caractères non-console tels que NUL (par exemple où ``isatty()`` renvoie ``True``) utilisent la valeur des pages de code d'entrée et de sortie de la console au démarrage, respectivement pour l’entrée standard et la sortie standard/sortie d'erreur. Cette valeur par défaut est l'encodage des paramètres régionaux système si le processus n'est pas attaché initialement à une console.

source: The special behaviour of the console can be overridden by setting the environment variable PYTHONLEGACYWINDOWSSTDIO before starting Python. In that case, the console codepages are used as for any other character device.
fr: Le comportement spécial de la console peut être redéfini en assignant la variable d'environnement *PYTHONLEGACYWINDOWSSTDIO* avant de démarrer Python. Dans ce cas, les pages de code de la console sont utilisées comme pour tout autre périphérique de caractères.

source: Under all platforms, you can override the character encoding by setting the :envvar:`PYTHONIOENCODING` environment variable before starting Python or by using the new :option:`-X` ``utf8`` command line option and :envvar:`PYTHONUTF8` environment variable. However, for the Windows console, this only applies when :envvar:`PYTHONLEGACYWINDOWSSTDIO` is also set.
fr: Sous toutes les plateformes, vous pouvez redéfinir le codage de caractères en assignant la variable d'environnement :envvar:`PYTHONIOENCODING` avant de démarrer Python ou en utilisant la nouvelle option de ligne de commande :option:`-X` ``utf8`` et la variable d'environnement :envvar:`PYTHONUTF8`. Toutefois, pour la console Windows, cela s'applique uniquement lorsque :envvar:`PYTHONLEGACYWINDOWSSTDIO` est également défini.

source: When interactive, ``stdout`` and ``stderr`` streams are line-buffered. Otherwise, they are block-buffered like regular text files. You can override this value with the :option:`-u` command-line option.
fr: En mode interactif, les entrées et sorties standards passent par un tampon d'une ligne. Autrement, elles passent par blocs dans un tampon, comme les fichiers textes classiques. Vous pouvez remplacer cette valeur avec l'option :option:`-u` en ligne de commande.

source: To write or read binary data from/to the standard streams, use the underlying binary :data:`~io.TextIOBase.buffer` object. For example, to write bytes to :data:`stdout`, use ``sys.stdout.buffer.write(b'abc')``.
fr: Pour écrire ou lire des données binaires depuis ou vers les flux standards, utilisez l'objet sous-jacent :data:`~io.TextIOBase.buffer`. Par exemple, pour écrire des octets sur :data:`stdout`, utilisez ``sys.stdout.buffer.write(b'abc')``.

source: However, if you are writing a library (and do not control in which context its code will be executed), be aware that the standard streams may be replaced with file-like objects like :class:`io.StringIO` which do not support the :attr:`~io.BufferedIOBase.buffer` attribute.
fr: Cependant, si vous écrivez une bibliothèque (ou ne contrôlez pas dans quel contexte son code sera exécuté), sachez que les flux standards peuvent être remplacés par des objets de type fichier tel un :class:`io.StringIO` qui n'ont pas l'attribut :attr:`~io.BufferedIOBase.buffer`.

source: These objects contain the original values of ``stdin``, ``stderr`` and ``stdout`` at the start of the program. They are used during finalization, and could be useful to print to the actual standard stream no matter if the ``sys.std*`` object has been redirected.
fr: Ces objets contiennent les valeurs d'origine de ``stdin``, ``stderr`` et ``stdout`` tel que présentes au début du programme. Ils sont utilisés pendant la finalisation, et peuvent être utiles pour écrire dans le vrai flux standard, peu importe si l'objet ``sys.std*`` a été redirigé.

source: It can also be used to restore the actual files to known working file objects in case they have been overwritten with a broken object. However, the preferred way to do this is to explicitly save the previous stream before replacing it, and restore the saved object.
fr: Ils peuvent également être utilisés pour restaurer les entrées / sorties d'origine, au cas où ils auraient été écrasés par des objets cassé, cependant la bonne façon de faire serait de sauvegarder explicitement les flux avant de les remplacer et ainsi pouvoir les restaurer.

source: Under some conditions ``stdin``, ``stdout`` and ``stderr`` as well as the original values ``__stdin__``, ``__stdout__`` and ``__stderr__`` can be ``None``. It is usually the case for Windows GUI apps that aren't connected to a console and Python apps started with :program:`pythonw`.
fr: Dans certaines cas, ``stdin``, ``stdout`` et ``stderr`` ainsi que les valeurs initiales ``__stdin__``, ``__stdout__`` et ``__stderr__`` peuvent être ``None``. C'est typiquement le cas pour les applications graphiques sur Windows qui ne sont pas connectées à une console, ou les applications Python démarrées avec :program:`pythonw`.

source: A :term:`named tuple` holding information about the thread implementation.
fr: Un :term:`named tuple` contenant des informations sur l'implémentation des fils d'exécution.

source: Name of the thread implementation:
fr: Nom de l'implémentation des fils d'exécution :

source: ``'nt'``: Windows threads
fr: ``'nt'`` : Fils d'exécution Windows

source: ``'pthread'``: POSIX threads
fr: ``'pthread'`` : Fils d'exécution POSIX

source: ``'solaris'``: Solaris threads
fr: ``'solaris'`` : Fils d'exécution Solaris

source: Name of the lock implementation:
fr: Nom de l'implémentation du système de verrou :

source: ``'semaphore'``: a lock uses a semaphore
fr: ``'semaphore'`` : Verrou utilisant une sémaphore

source: ``'mutex+cond'``: a lock uses a mutex and a condition variable
fr: ``'mutex+cond'`` : Un verrou utilisant un *mutex* et une *condition variable*

source: ``None`` if this information is unknown
fr: ``None`` si cette information n'est pas connue
