Repository: python/python-docs-fr
Catalog: library/sys.po
Languages: fr

source: :mod:`sys` --- System-specific parameters and functions
fr: :mod:`sys` — Paramètres et fonctions propres à des systèmes

source: This module provides access to some variables used or maintained by the interpreter and to functions that interact strongly with the interpreter. It is always available.
fr: Ce module fournit un accès à certaines variables utilisées et maintenues par l'interpréteur, et à des fonctions interagissant fortement avec ce dernier. Ce module est toujours disponible.

source: On POSIX systems where Python was built with the standard ``configure`` script, this contains the ABI flags as specified by :pep:`3149`.
fr: Contient, sur les systèmes POSIX où Python a été compilé avec le script ``configure``, les *ABI flags* tels que définis par la :pep:`3149`.

source: Default flags became an empty string (``m`` flag for pymalloc has been removed).
fr: Les options par défaut sont devenues des chaines de caractères vides (l'option ``m`` pour *pymalloc* a été enlevée).

source: Append the callable *hook* to the list of active auditing hooks for the current interpreter.
fr: Ajoute un *hook* appelable dans la liste des fonctions de rappel d'audits actifs pour l’interpréteur en cours d'exécution.

source: When an auditing event is raised through the :func:`sys.audit` function, each hook will be called in the order it was added with the event name and the tuple of arguments. Native hooks added by :c:func:`PySys_AddAuditHook` are called first, followed by hooks added in the current interpreter.
fr: Quand un événement d'audit est déclenché par la fonction :func:`sys.audit`, chaque fonction de rappel est appelée dans l'ordre dans lequel elle a été ajoutée avec le nom de l'événement et le *tuple* des arguments. Les fonctions de rappel qui sont ajoutées par :c:func:`PySys_AddAuditHook` sont appelées les premières, suivi par les fonctions de rappel ajoutées dans l'interpréteur en cours d'exécution.

source: Raises an :ref:`auditing event <auditing>` ``sys.addaudithook`` with no arguments.
fr: Déclenche un :ref:`événement d'audit <auditing>` ``sys.addaudithook`` sans arguments.

source: Raise an auditing event ``sys.addaudithook`` with no arguments. If any existing hooks raise an exception derived from :class:`RuntimeError`, the new hook will not be added and the exception suppressed. As a result, callers cannot assume that their hook has been added unless they control all existing hooks.
fr: Déclenche un événement d'audit ``sys.addaudithook`` sans arguments. Si n'importe quel *hooks* lève une exception dérivée de :class:`RuntimeError`, le nouveau *hook* ne sera pas ajouté et l'exception supprimée. Par conséquent, les appels ne peuvent pas supposer que leurs *hooks* ont été ajoutés à moins de contrôler tous les *hooks* existants.

source: Exceptions derived from :class:`Exception` but not :class:`RuntimeError` are no longer suppressed.
fr: Les exceptions dérivées de :class:`Exception` mais pas :class:`RuntimeError` ne sont plus supprimées.

source: When tracing is enabled (see :func:`settrace`), Python hooks are only traced if the callable has a ``__cantrace__`` member that is set to a true value. Otherwise, trace functions will skip the hook.
fr: Quand le traçage est activé (voir :func:`settrace`), les *hooks* Python ne sont tracés que si la fonction a un membre ``__cantrace__`` dont la valeur est vraie. Autrement, les fonctions de traçage ignorent le *hook*.

source: The list of command line arguments passed to a Python script. ``argv[0]`` is the script name (it is operating system dependent whether this is a full pathname or not). If the command was executed using the :option:`-c` command line option to the interpreter, ``argv[0]`` is set to the string ``'-c'``. If no script name was passed to the Python interpreter, ``argv[0]`` is the empty string.
fr: La liste des arguments de la ligne de commande passés à un script Python. ``argv[0]`` est le nom du script (chemin complet, ou non, en fonction du système d'exploitation). Si la commande a été exécutée avec l'option :option:`-c` de l'interpréteur, ``argv[0]`` vaut la chaîne ``'-c'``. Si aucun nom de script n'a été donné à l'interpréteur Python, ``argv[0]`` sera une chaîne vide.

source: To loop over the standard input, or the list of files given on the command line, see the :mod:`fileinput` module.
fr: Pour boucler sur l'entrée standard, ou la liste des fichiers donnés sur la ligne de commande, utilisez le module :mod:`fileinput`.

source: On Unix, command line arguments are passed by bytes from OS. Python decodes them with filesystem encoding and "surrogateescape" error handler. When you need original bytes, you can get it by ``[os.fsencode(arg) for arg in sys.argv]``.
fr: Sous Unix, les arguments de ligne de commande sont passés par des octets depuis le système d'exploitation. Python les décode en utilisant l’encodage du système de fichiers et le gestionnaire d’erreur *surrogateescape*. Quand vous avez besoin des octets originaux, vous pouvez les récupérer avec ``[os.fsencode(arg) for arg in sys.argv]``.

source: Raise an auditing event with any active hooks. The event name is a string identifying the event and its associated schema, which is the number and types of arguments. The schema for a given event is considered public and stable API and should not be modified between releases.
fr: Déclenche un événement d'audit pour tous les *hooks* actifs. Le nom de l’éventement est une chaine de caractères identifiant l'événement et son prototype associé qui est le nombre et les types et ses arguments. Pour un événement donné, le prototype est considéré comme une API publique et stable et ne doit pas être modifié entre les différentes versions de Python.

source: Set during Python startup, before ``site.py`` is run, to the same value as :data:`prefix`. If not running in a :ref:`virtual environment <venv-def>`, the values will stay the same; if ``site.py`` finds that a virtual environment is in use, the values of :data:`prefix` and :data:`exec_prefix` will be changed to point to the virtual environment, whereas :data:`base_prefix` and :data:`base_exec_prefix` will remain pointing to the base Python installation (the one which the virtual environment was created from).
fr: Défini au démarrage de Python, avant que ``site.py`` ne soit évalué, à la même valeur que :data:`prefix`. Hors d'un :ref:`environnement virtuel <venv-def>`, les valeurs restent les mêmes ; si ``site.py`` détecte qu'un environnement virtuel est utilisé, les valeurs de :data:`prefix` et :data:`exec_prefix` sont modifiées pour pointer vers l'environnement virtuel, alors que :data:`base_prefix` et :data:`base_exec_prefix` pointent toujours à la racine de l'installation de Python (celui utilisé pour créer l'environnement virtuel).

source: An indicator of the native byte order. This will have the value ``'big'`` on big-endian (most-significant byte first) platforms, and ``'little'`` on little-endian (least-significant byte first) platforms.
fr: Un indicateur de l'ordre natif des octets. Vaudra ``'big'`` sur les plateformes gros-boutistes (octet le plus significatif en premier), et ``'little'`` sur les plateformes petit-boutiste (octet le moins significatif en premier).

source: A tuple of strings giving the names of all modules that are compiled into this Python interpreter. (This information is not available in any other way --- ``modules.keys()`` only lists the imported modules.)
fr: Un *tuple* de chaînes de caractères donnant les noms de tous les modules compilés dans l'interpréteur Python. (Cette information n'est pas disponible autrement --- ```modules.keys()`` liste seulement les modules importés.)

source: Call ``func(*args)``, while tracing is enabled. The tracing state is saved, and restored afterwards. This is intended to be called from a debugger from a checkpoint, to recursively debug some other code.
fr: Appelle ``func(*args)``, avec le traçage activé. L'état du traçage est sauvegardé et restauré après l'appel. Ceci est destiné à être appelé depuis un débogueur à partir d'un point de contrôle, pour déboguer récursivement un autre code.

source: A string containing the copyright pertaining to the Python interpreter.
fr: Une chaîne contenant le copyright relatif à l'interpréteur Python.

source: Clear the internal type cache. The type cache is used to speed up attribute and method lookups. Use the function *only* to drop unnecessary references during reference leak debugging.
fr: Vide le cache interne de types. Le cache de types est utilisé pour accélérer les recherches d'attributs et de méthodes. N'utilisez cette fonction *que* pour libérer des références inutiles durant le débogage de fuite de référence.

source: This function should be used for internal and specialized purposes only.
fr: Cette fonction ne devrait être utilisée que pour un usage interne et spécialisé.

source: Return a dictionary mapping each thread's identifier to the topmost stack frame currently active in that thread at the time the function is called. Note that functions in the :mod:`traceback` module can build the call stack given such a frame.
fr: Renvoie un dictionnaire faisant correspondre chaque identifiant de fil d'exécution à la *stack frame* actuellement active pour ces fils d'exécution au moment où la fonction est appelée. Notez que les fonctions du module :mod:`traceback` peuvent construire une *call stack* à partir d'une telle *frame*.

source: This is most useful for debugging deadlock: this function does not require the deadlocked threads' cooperation, and such threads' call stacks are frozen for as long as they remain deadlocked. The frame returned for a non-deadlocked thread may bear no relationship to that thread's current activity by the time calling code examines the frame.
fr: N'ayant pas besoin de la coopération des fils d'exécution bloqués, cette fonction est très utile pour déboguer un *deadlock*. Aussi, les *call stack* de ces fils d'exécution ne changeront pas tant qu'ils seront bloqués. La *frame* renvoyée pour un fil d'exécution non bloqué peut ne plus être liée à l'activité courante du fil d'exécution au moment où le code appelant examine la *frame*.

source: This hook function is called by built-in :func:`breakpoint`. By default, it drops you into the :mod:`pdb` debugger, but it can be set to any other function so that you can choose which debugger gets used.
fr: Cette fonction auto-déclenchée (*hook function* en anglais) est appelée par la fonction native :func:`breakpoint`. Par défaut, elle vous place dans le débogueur :mod:`pdb`, mais elle peut être dirigée vers n'importe quelle autre fonction pour que vous puissiez choisir le débogueur utilisé.

source: The signature of this function is dependent on what it calls. For example, the default binding (e.g. ``pdb.set_trace()``) expects no arguments, but you might bind it to a function that expects additional arguments (positional and/or keyword). The built-in ``breakpoint()`` function passes its ``*args`` and ``**kws`` straight through. Whatever ``breakpointhooks()`` returns is returned from ``breakpoint()``.
fr: La signature de cette fonction dépend de ce qu'elle appelle. Par exemple, l'appel par défaut (e.g. ``pdb.set_trace()``) n'attend pas d'argument, mais vous pourriez la lier à une fonction qui attend des arguments supplémentaires (positionnels et/ou mots-clés). La fonction native `breakpoint()` passe ses ``*args`` et ``**kws`` directement au travers. Tout ce que renvoie ``breakpointhooks()`` est renvoyé par ``breakpoint()``.

source: The default implementation first consults the environment variable :envvar:`PYTHONBREAKPOINT`. If that is set to ``"0"`` then this function returns immediately; i.e. it is a no-op. If the environment variable is not set, or is set to the empty string, ``pdb.set_trace()`` is called. Otherwise this variable should name a function to run, using Python's dotted-import nomenclature, e.g. ``package.subpackage.module.function``. In this case, ``package.subpackage.module`` would be imported and the resulting module must have a callable named ``function()``. This is run, passing in ``*args`` and ``**kws``, and whatever ``function()`` returns, ``sys.breakpointhook()`` returns to the built-in :func:`breakpoint` function.
fr: L'implémentation par défaut consulte d'abord la variable d'environnement :envvar:`PYTHONBREAKPOINT`. Si elle vaut ``"0"`` alors cette fonction s'achève immédiatement (elle ne fait donc rien). Si la variable d'environnement n'est pas définie, ou s'il s'agit d'une chaîne vide, ``pdb.set_trace()`` est appelée. Sinon cette variable doit nommer une fonction à appeler, en utilisant la syntaxe d'importation de Python, par exemple ``package.subpackage.module.function``. Dans ce cas, ``package.subpackage.module`` sera importé et le module devra contenir une fonction appelable ``function()``. Celle-ci est lancée en lui passant ``*args`` et ``*kws`` et, quoique renvoie ``function()``, ``sys.breakpointhook()`` retourne à la fonction native :func:`breakpoint`.

source: Note that if anything goes wrong while importing the callable named by :envvar:`PYTHONBREAKPOINT`, a :exc:`RuntimeWarning` is reported and the breakpoint is ignored.
fr: Notez que si un problème apparaît au moment de l'importation de la fonction nommée dans :envvar:`PYTHONBREAKPOINT`, une alerte :exc:`RuntimeWarning` est indiquée et le point d'arrêt est ignoré.

source: Also note that if ``sys.breakpointhook()`` is overridden programmatically, :envvar:`PYTHONBREAKPOINT` is *not* consulted.
fr: Notez également que si ``sys.breakpointhook()`` est surchargé de manière programmatique, :envvar:`PYTHONBREAKPOINT` *n'est pas* consulté.

source: Print low-level information to stderr about the state of CPython's memory allocator.
fr: Affiche des informations bas-niveau sur la sortie d'erreur à propos de l'état de l'allocateur de mémoire de CPython.

source: If Python is configured --with-pydebug, it also performs some expensive internal consistency checks.
fr: Si Python est configuré avec l'option *--with-pydebug*, il effectuera aussi quelques coûteuses vérifications de cohérence interne.

source: This function is specific to CPython. The exact output format is not defined here, and may change.
fr: Cette fonction est spécifique à CPython. Le format de sa sortie n'est pas définit ici et pourrait changer.

source: Integer specifying the handle of the Python DLL.
fr: Nombre entier spécifiant le descripteur de la DLL Python.

source: :ref:`Availability <availability>`: Windows.
fr: :ref:`Disponibilité <availability>` : Windows.

source: If *value* is not ``None``, this function prints ``repr(value)`` to ``sys.stdout``, and saves *value* in ``builtins._``. If ``repr(value)`` is not encodable to ``sys.stdout.encoding`` with ``sys.stdout.errors`` error handler (which is probably ``'strict'``), encode it to ``sys.stdout.encoding`` with ``'backslashreplace'`` error handler.
fr: Si *value* n'est pas ``None``, cette fonction écrit ``repr(value)`` sur ``sys.stdout``, et sauvegarde *value* dans ``builtins._``. Si ``repr(value)`` ne peut pas être encodé avec ``sys.stdout.encoding`` en utilisant le gestionnaire d'erreur ``sys.stdout.errors`` (qui est probablement ``'strict'``), elle sera encodée avec ``sys.stdout.encoding`` en utilisant le gestionnaire d'erreur ``'backslashreplace'``.

source: ``sys.displayhook`` is called on the result of evaluating an :term:`expression` entered in an interactive Python session. The display of these values can be customized by assigning another one-argument function to ``sys.displayhook``.
fr: ``sys.displayhook`` est appelé avec le résultat de l'évaluation d'une :term:`expression` entrée dans une session Python interactive. L'affichage de ces valeurs peut être personnalisé en assignant une autre fonction d'un argument à ``sys.displayhook``.

source: Use ``'backslashreplace'`` error handler on :exc:`UnicodeEncodeError`.
fr: Utiliser le gestionnaire d'erreur ``'backslashreplace'`` en cas d':exc:`UnicodeEncodeError`.

source: If this is true, Python won't try to write ``.pyc`` files on the import of source modules. This value is initially set to ``True`` or ``False`` depending on the :option:`-B` command line option and the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable, but you can set it yourself to control bytecode file generation.
fr: Si vrai, Python n'essaiera pas d'écrire de fichiers ``.pyc`` à l'importation de modules source. Cette valeur est initialement définie à ``True`` ou ``False`` en fonction de l'option de la ligne de commande :option:`-B` et de la variable d'environnement :envvar:`PYTHONDONDONTWRITEBYTECODE`, mais vous pouvez aussi la modifier vous-même pour contrôler la génération des fichiers de *bytecode*.

source: This function prints out a given traceback and exception to ``sys.stderr``.
fr: Cette fonction affiche la *traceback* et l'exception donnée sur ``sys.stderr``.

source: When an exception is raised and uncaught, the interpreter calls ``sys.excepthook`` with three arguments, the exception class, exception instance, and a traceback object. In an interactive session this happens just before control is returned to the prompt; in a Python program this happens just before the program exits. The handling of such top-level exceptions can be customized by assigning another three-argument function to ``sys.excepthook``.
fr: Lorsqu'une exception est levée et n'est pas attrapée, l'interpréteur appelle ``sys.excepthook`` avec trois arguments, la classe de l'exception, l'instance de l'exception, et un objet *traceback*. Dans une session interactive, cela se produit juste avant que le que l'invite soit rendue. Dans un programme Python, cela se produit juste avant que le programme quitte. La gestion de ces exceptions peut être personnalisé en affectant une autre fonction de trois arguments à ``sys.excepthook``.

source: These objects contain the original values of ``breakpointhook``, ``displayhook``, ``excepthook``, and ``unraisablehook`` at the start of the program. They are saved so that ``breakpointhook``, ``displayhook`` and ``excepthook``, ``unraisablehook`` can be restored in case they happen to get replaced with broken or alternative objects.
fr: Ces objets contiennent les valeurs originales de ``breakpointhook``, ``displayhook``, ``excepthook`` et ``unraisablehook`` au début du programme.Ils sont sauvegardés de façon à ce que ``breakpointhook``, ``displayhook``, ``excepthook`` et ``unraisablehook`` puissent être restaurés au cas où ils seraient remplacés par des objets cassés ou alternatifs.

source: This function returns a tuple of three values that give information about the exception that is currently being handled. The information returned is specific both to the current thread and to the current stack frame. If the current stack frame is not handling an exception, the information is taken from the calling stack frame, or its caller, and so on until a stack frame is found that is handling an exception. Here, "handling an exception" is defined as "executing an except clause." For any stack frame, only information about the exception being currently handled is accessible.
fr: Cette fonction renvoie un *tuple* de trois valeurs qui donnent des informations sur l'exception actuellement traitée. L'information renvoyée est spécifique à la fois au fil d'exécution courant et à la *stack frame* courante. Si la *stack frame* actuelle ne traite pas d'exception, l'information est extraite de la *stack frame* parente, puis celle appelante, et ainsi de suite jusqu'à trouver une *stack frame* traitant une exception. Ici, "traiter une exception" signifie "exécute une clause *except*". Pour chaque *stack frame*, seule l'information à propos d'une exception actuellement traitée est accessible.

source: If no exception is being handled anywhere on the stack, a tuple containing three ``None`` values is returned. Otherwise, the values returned are ``(type, value, traceback)``. Their meaning is: *type* gets the type of the exception being handled (a subclass of :exc:`BaseException`); *value* gets the exception instance (an instance of the exception type); *traceback* gets a :ref:`traceback object <traceback-objects>` which encapsulates the call stack at the point where the exception originally occurred.
fr: Si aucune exception n'est actuellement traitée de toute la pile, un *tuple* contenant trois valeurs ``None`` sera renvoyé. Autrement, les valeurs renvoyées sont ``(type, value, traceback)``. Respectivement *type* reçoit le type de l'exception traitée (une classe fille de :exc:`BaseException`), *value* reçoit l'instance de l'exception (une instance du type de l'exception), et *traceback* reçoit un :ref:`objet traceback <traceback-objects>` qui encapsule la pile d'appels au point où l'exception s'est produite à l'origine.

source: A string giving the site-specific directory prefix where the platform-dependent Python files are installed; by default, this is also ``'/usr/local'``. This can be set at build time with the ``--exec-prefix`` argument to the :program:`configure` script. Specifically, all configuration files (e.g. the :file:`pyconfig.h` header file) are installed in the directory :file:`{exec_prefix}/lib/python{X.Y}/config`, and shared library modules are installed in :file:`{exec_prefix}/lib/python{X.Y}/lib-dynload`, where *X.Y* is the version number of Python, for example ``3.2``.
fr: Une chaîne donnant le préfixe de dossier spécifique au site où les fichiers dépendant de la plateforme sont installés. Par défaut, c'est ``'/usr/local'``. C'est configurable à la compilation avec l'option ``--exec-prefix`` du script :program:`configure`. Tous les fichiers de configurations (tel que :file:`pyconfig,h`) sont installés dans le dossier :file:`{exec_prefix}/lib/python{X.Y}/config`, et les modules sous forme de bibliothèques partagées sont installés dans :file:`{exec_prefix}/lib/python{X.Y}/lib-dynload`, où *X.Y* est le numéro de version de Python, par exemple ``3.2``.

source: If a :ref:`virtual environment <venv-def>` is in effect, this value will be changed in ``site.py`` to point to the virtual environment. The value for the Python installation will still be available, via :data:`base_exec_prefix`.
fr: Si un :ref:`environment virtuel <venv-def>` est actif, cette valeur sera modifiée par ``site.py`` pour pointer vers l'environnement virtuel. La valeur d'origine sera toujours disponible via :data:`base_exec_prefix`.

source: A string giving the absolute path of the executable binary for the Python interpreter, on systems where this makes sense. If Python is unable to retrieve the real path to its executable, :data:`sys.executable` will be an empty string or ``None``.
fr: Une chaîne donnant le chemin absolu vers l'interpréteur Python, un fichier binaire exécutable, sur les système sur lesquels ça à du sens. Si Python n'est pas capable de récupérer le chemin réel de son exécutable, :data:`sys.executable` sera une chaîne vide ou ``None``.

source: Exit from Python. This is implemented by raising the :exc:`SystemExit` exception, so cleanup actions specified by finally clauses of :keyword:`try` statements are honored, and it is possible to intercept the exit attempt at an outer level.
fr: Quitte Python. C'est implémente en levant l'exception :exc:`SystemExit`, afin que toutes les actions de nettoyage spécifiées par des clauses *finally* des instructions :keyword:`try` soient correctement exécutées. Il est aussi possible d'intercepter la tentative de sortie à un niveau au dessus.
