Repository: python/python-docs-fr
Catalog: library/sys.po
Languages: fr

source: This is called ``hexversion`` since it only really looks meaningful when viewed as the result of passing it to the built-in :func:`hex` function. The :term:`named tuple` :data:`sys.version_info` may be used for a more human-friendly encoding of the same information.
fr: Cet attribut s'appelle ``hexversion`` dans le sens où il ne semble avoir du sens que s'il est regardé après avoir été passé à la fonction native :func:`hex`. Le :term:`named tuple` :data:`sys.version_info` représente la même information d'une manière plus humaine.

source: More details of ``hexversion`` can be found at :ref:`apiabiversion`.
fr: Consultez :ref:`apiabiversion` pour plus d'informations sur ``hexversion``.

source: An object containing information about the implementation of the currently running Python interpreter. The following attributes are required to exist in all Python implementations.
fr: Un objet contenant des informations sur l'implémentation de la version actuelle de l'interpréteur Python. Les attributs suivants existent obligatoirement sur toutes les implémentations Python.

source: *name* is the implementation's identifier, e.g. ``'cpython'``. The actual string is defined by the Python implementation, but it is guaranteed to be lower case.
fr: *name* est l'identifiant de l'implémentation, e.g. ``'cpython'``. Cette chaîne est définie par l'implémentation de Python, mais sera toujours en minuscule.

source: *version* is a named tuple, in the same format as :data:`sys.version_info`. It represents the version of the Python *implementation*. This has a distinct meaning from the specific version of the Python *language* to which the currently running interpreter conforms, which ``sys.version_info`` represents. For example, for PyPy 1.8 ``sys.implementation.version`` might be ``sys.version_info(1, 8, 0, 'final', 0)``, whereas ``sys.version_info`` would be ``sys.version_info(2, 7, 2, 'final', 0)``. For CPython they are the same value, since it is the reference implementation.
fr: *version* est un *named tuple*, du même format que :data:`sys.version_info`. Il représente la version de l'**implementation** de Python. C'est une information différente de la version du **langage** auquel l'interpréteur actuel se conforme (donnée par ``sys.version_info``). Par exemple, pour PyPy 1.8 ``sys.implementation.version`` peut valoir ``sys.version_info(1, 8, 0, 'final', 0)``, alors que ``sys.version_info`` peut valoir ``sys.version_info(2, 7, 2, 'final', 0)``. Pour CPython ces deux valeurs sont identiques puisque c'est l'implémentation de référence.

source: *hexversion* is the implementation version in hexadecimal format, like :data:`sys.hexversion`.
fr: *hexversion* est la version de l'implémentation sous forme hexadécimale, comme :data:`sys.hexversion`.

source: *cache_tag* is the tag used by the import machinery in the filenames of cached modules. By convention, it would be a composite of the implementation's name and version, like ``'cpython-33'``. However, a Python implementation may use some other value if appropriate. If ``cache_tag`` is set to ``None``, it indicates that module caching should be disabled.
fr: *cache_tag* est la balise utilisée par le mécanisme d'importation dans les noms de fichiers des modules mis en cache. Par convention, il devrait se composer du nom et de la version de l'implémentation, comme ```cpython-33'`. Cependant, une implémentation Python peut utiliser une autre valeur si nécessaire. ``cache_tag`` à ``None`` signifie que la mise en cache des modules doit être désactivée.

source: :data:`sys.implementation` may contain additional attributes specific to the Python implementation. These non-standard attributes must start with an underscore, and are not described here. Regardless of its contents, :data:`sys.implementation` will not change during a run of the interpreter, nor between implementation versions. (It may change between Python language versions, however.) See :pep:`421` for more information.
fr: :data:`sys.implementation` peut contenir d'autres attributs spécifiques à l'implémentation de Python. Ces attributs spécifiques doivent commencer par un *underscore*, et ne sont pas documentés ici. Indépendamment de son contenu, :data:`sys.implementation` ne change jamais durant l'exécution de l'interpréteur, ni entre les versions d'une même implémentation. (Il peut cependant changer entre les versions du langage Python.) Voir la :pep:`421` pour plus d'informations.

source: A :term:`named tuple` that holds information about Python's internal representation of integers. The attributes are read only.
fr: Un :term:`named tuple` qui contient des informations sur la représentation interne des entiers de Python. Les attributs sont en lecture seule.

source: Attribute
fr: Attribut

source: Explanation
fr: Explication

source: number of bits held in each digit. Python integers are stored internally in base ``2**int_info.bits_per_digit``
fr: nombre de bits utilisés pour chaque chiffre. Les entiers Python sont stockés en interne en base ``2**int_info.bits_per_digit``

source: size in bytes of the C type used to represent a digit
fr: taille en octets du type C utilisé pour représenter un chiffre

source: When this attribute exists, its value is automatically called (with no arguments) when the interpreter is launched in :ref:`interactive mode <tut-interactive>`. This is done after the :envvar:`PYTHONSTARTUP` file is read, so that you can set this hook there. The :mod:`site` module :ref:`sets this <rlcompleter-config>`.
fr: Lorsque cet attribut existe, sa valeur est automatiquement appelée (sans argument) par l'interpréteur lors de son démarrage en :ref:`mode interactif <tut-interactive>`. L'appel se fait après que le fichier :envvar:`PYTHONSTARTUP` soit lu, afin que vous puissiez y configurer votre fonction. :ref:`Configuré <rlcompleter-config>` par le module :mod:`site`.

source: Enter *string* in the table of "interned" strings and return the interned string -- which is *string* itself or a copy. Interning strings is useful to gain a little performance on dictionary lookup -- if the keys in a dictionary are interned, and the lookup key is interned, the key comparisons (after hashing) can be done by a pointer compare instead of a string compare. Normally, the names used in Python programs are automatically interned, and the dictionaries used to hold module, class or instance attributes have interned keys.
fr: Ajoute *string* dans le tableau des chaînes "internées" et renvoie la chaîne internée -- qui peut être *string* elle-même ou une copie. Interner une chaîne de caractères permet de gagner un peu de performance lors de l'accès aux dictionnaires -- si les clés du dictionnaire et la clé recherchée sont internées, les comparaisons de clés (après le hachage) pourront se faire en comparant les pointeurs plutôt que caractère par caractère. Normalement, les noms utilisés dans les programmes Python sont automatiquement internés, et les dictionnaires utilisés pour stocker les attributs de modules, de classes, ou d'instances ont aussi leurs clés internées.

source: Interned strings are not immortal; you must keep a reference to the return value of :func:`intern` around to benefit from it.
fr: Les chaînes internées ne sont pas immortelles ; vous devez garder une référence à la valeur renvoyée par :func:`intern` pour en bénéficier.

source: Return :const:`True` if the Python interpreter is :term:`shutting down <interpreter shutdown>`, :const:`False` otherwise.
fr: Donne :const:`True` si l'interpréteur Python est :term:`en train de s'arrêter <interpreter shutdown>`, et :const:`False` dans le cas contraire.

source: These three variables are not always defined; they are set when an exception is not handled and the interpreter prints an error message and a stack traceback. Their intended use is to allow an interactive user to import a debugger module and engage in post-mortem debugging without having to re-execute the command that caused the error. (Typical use is ``import pdb; pdb.pm()`` to enter the post-mortem debugger; see :mod:`pdb` module for more information.)
fr: Ces trois variables ne sont pas toujours définies. Elles sont définies lorsqu'une exception n'est pas gérée et que l'interpréteur affiche un message d'erreur et une *stacktrace*. Elles sont là pour permettre à un utilisateur, en mode interactif, d'importer un module de débogage et de faire son débogage post-mortem sans avoir à ré-exécuter la commande qui a causé l'erreur. (L'utilisation typique pour entrer dans le débogueur post-mortem est ``import pdb; pdb.pm()``, voir :mod:`pdb` pour plus d'informations.).

source: The meaning of the variables is the same as that of the return values from :func:`exc_info` above.
fr: La signification de ces variables est la même que celle des valeurs renvoyées par :func:`exc_info` ci-dessus.

source: An integer giving the maximum value a variable of type :c:type:`Py_ssize_t` can take. It's usually ``2**31 - 1`` on a 32-bit platform and ``2**63 - 1`` on a 64-bit platform.
fr: Un entier donnant à la valeur maximale qu'une variable de type :c:type:`Py_ssize_t` peut prendre. C'est typiquement ``2**31 - 1`` sur une plateforme 32 bits et ``2**63 - 1``` sur une plateforme 64 bits.

source: An integer giving the value of the largest Unicode code point, i.e. ``1114111`` (``0x10FFFF`` in hexadecimal).
fr: Un entier donnant la valeur du plus grand point de code Unicode, c'est-à-dire ``1114111`` (```0x10FFFF`` en hexadécimal).

source: Before :pep:`393`, ``sys.maxunicode`` used to be either ``0xFFFF`` or ``0x10FFFF``, depending on the configuration option that specified whether Unicode characters were stored as UCS-2 or UCS-4.
fr: Avant la :pep:`393`, ``sys.maxunicode`` valait soit ``0xFFFF`` soit ``0x10FFFF``, en fonction l'option de configuration qui spécifiait si les caractères Unicode étaient stockés en UCS-2 ou UCS-4.

source: A list of :term:`meta path finder` objects that have their :meth:`~importlib.abc.MetaPathFinder.find_spec` methods called to see if one of the objects can find the module to be imported. The :meth:`~importlib.abc.MetaPathFinder.find_spec` method is called with at least the absolute name of the module being imported. If the module to be imported is contained in a package, then the parent package's :attr:`__path__` attribute is passed in as a second argument. The method returns a :term:`module spec`, or ``None`` if the module cannot be found.
fr: Une liste d'objets :term:`meta path finder` qui ont leur méthode :meth:`~importlib.abc.MetaPathFinder.find_spec` appelée pour voir si un des objets peut trouver le module à importer. La méthode :meth:`~importlib.abc.MetaPathFinder.find_spec` est appelée avec au moins le nom absolu du module importé. Si le module à importer est contenu dans un paquet, l'attribut :attr:`__path__` du paquet parent est donné en deuxième argument. La méthode renvoie un :term:`module spec`, ou ``None`` si le module ne peut être trouvé.

source: The abstract base class defining the interface of finder objects on :data:`meta_path`.
fr: La classe de base abstraite définissant l'interface des objets *finder* de :data:`meta_path`.

source: The concrete class which :meth:`~importlib.abc.MetaPathFinder.find_spec` should return instances of.
fr: La classe concrète dont :meth:`~importlib.abc.MetaPathFinder.find_spec` devrait renvoyer des instances.

source: :term:`Module specs <module spec>` were introduced in Python 3.4, by :pep:`451`. Earlier versions of Python looked for a method called :meth:`~importlib.abc.MetaPathFinder.find_module`. This is still called as a fallback if a :data:`meta_path` entry doesn't have a :meth:`~importlib.abc.MetaPathFinder.find_spec` method.
fr: Les :term:`Module specs <module spec>` ont été introduits en Python 3.4, par la :pep:`451`. Les versions antérieures de Python cherchaient une méthode appelée :meth:`~importlib.abc.MetaPathFinder.find_module`. Celle-ci est toujours appelée en dernier recours, dans le cas où une :data:`meta_path` n'a pas de méthode :meth:`~importlib.abc.MetaPathFinder.find_spec`.

source: This is a dictionary that maps module names to modules which have already been loaded. This can be manipulated to force reloading of modules and other tricks. However, replacing the dictionary will not necessarily work as expected and deleting essential items from the dictionary may cause Python to fail.
fr: Un dictionnaire faisant correspondre des noms de modules à des modules déjà chargés. Il peut être manipulé, entre autre, pour forcer un module à être rechargé. Cependant, le remplacer ne fonctionnera pas forcément comme prévu et en supprimer des éléments essentiels peut planter Python.

source: A list of strings that specifies the search path for modules. Initialized from the environment variable :envvar:`PYTHONPATH`, plus an installation-dependent default.
fr: Une liste de chaînes de caractères spécifiant les chemins de recherche des modules, initialisée à partir de la variable d'environnement :envvar:`PYTHONPATH` et d'une valeur par défaut dépendante de l'installation.

source: As initialized upon program startup, the first item of this list, ``path[0]``, is the directory containing the script that was used to invoke the Python interpreter. If the script directory is not available (e.g. if the interpreter is invoked interactively or if the script is read from standard input), ``path[0]`` is the empty string, which directs Python to search modules in the current directory first. Notice that the script directory is inserted *before* the entries inserted as a result of :envvar:`PYTHONPATH`.
fr: Puisqu'il est initialisé au démarrage du programme, le premier élément de cette liste, ``path[0]``, est le dossier contenant le script qui a été utilisé pour invoquer l'interpréteur Python. Si le dossier du script n'est pas disponible (typiquement, si l'interpréteur est invoqué interactivement ou si le script est lu à partir d'une entrée standard), ``path[0]`` sera une chaîne vide, qui indiquera à Python de chercher des modules dans le dossier actuel. Notez que le dossier du script est inséré *avant* les dossiers de :envvar:`PYTHONPATH`.

source: A program is free to modify this list for its own purposes. Only strings and bytes should be added to :data:`sys.path`; all other data types are ignored during import.
fr: Un programme est libre de modifier cette liste pour ses propres besoins. Seuls des *str* ou des *bytes* ne devraient être ajoutés à :data:`sys.path`, tous les autres types de données étant ignorés durant l'importation.

source: Module :mod:`site` This describes how to use .pth files to extend :data:`sys.path`.
fr: Le module :mod:`site` décrit comment utiliser les fichiers *.pth* pour étendre :data:`sys.path`.

source: A list of callables that take a path argument to try to create a :term:`finder` for the path. If a finder can be created, it is to be returned by the callable, else raise :exc:`ImportError`.
fr: Une liste d'appelables d'un argument, *path*, pour essayer de créer un :term:`finder` pour ce chemin. Si un *finder* peut être créé, il doit être renvoyé par l'appelable, sinon une :exc:`ImportError` doit être levée.

source: Originally specified in :pep:`302`.
fr: Précisé à l'origine dans la :pep:`302`.

source: A dictionary acting as a cache for :term:`finder` objects. The keys are paths that have been passed to :data:`sys.path_hooks` and the values are the finders that are found. If a path is a valid file system path but no finder is found on :data:`sys.path_hooks` then ``None`` is stored.
fr: Un dictionnaire faisant office de cache pour les objets :term:`finder`. Les clés sont les chemins qui ont été passés à :data:`sys.path_hooks` et les valeurs sont les *finders* trouvés. Si un chemin est valide selon le système de fichiers mais qu'aucun *finder* n'est trouvé dans :data:`sys.path_hooks`, ``None`` est stocké.

source: ``None`` is stored instead of :class:`imp.NullImporter` when no finder is found.
fr: ``None`` est stocké à la place de :class:`imp.NullImporter` si aucun localisateur n'est trouvé.

source: This string contains a platform identifier that can be used to append platform-specific components to :data:`sys.path`, for instance.
fr: Cette chaîne contient un identificateur de plateforme qui peut être typiquement utilisé pour ajouter des composants spécifiques à :data:`sys.path`.

source: For Unix systems, except on Linux and AIX, this is the lowercased OS name as returned by ``uname -s`` with the first part of the version as returned by ``uname -r`` appended, e.g. ``'sunos5'`` or ``'freebsd8'``, *at the time when Python was built*. Unless you want to test for a specific system version, it is therefore recommended to use the following idiom::
fr: Pour les systèmes Unix, sauf sur Linux et AIX, c'est le nom de l'OS en minuscules comme renvoyé par ``uname -s`` suivi de la première partie de la version comme renvoyée par ``uname -r``, e.g. ``'sunos5'`` ou ``'freebsd8'``, *au moment où Python a été compilé*. A moins que vous ne souhaitiez tester pour une version spécifique du système, vous pouvez faire comme suit ::

source: For other systems, the values are:
fr: Pour les autres systèmes, les valeurs sont :

source: System
fr: Le système une station de travail.

source: ``platform`` value
fr: Valeur pour ``plateforme``

source: On Linux, :attr:`sys.platform` doesn't contain the major version anymore. It is always ``'linux'``, instead of ``'linux2'`` or ``'linux3'``. Since older Python versions include the version number, it is recommended to always use the ``startswith`` idiom presented above.
fr: Sur Linux, :attr:`sys.platform` ne contient plus la version majeure, c'est toujours ``'linux'``, au lieu de ``'linux2'`` ou ``'linux3'``. Comme les anciennes versions de Python incluent le numéro de version, il est recommandé de toujours utiliser ``startswith``, tel qu'utilisé ci-dessus.

source: On AIX, :attr:`sys.platform` doesn't contain the major version anymore. It is always ``'aix'``, instead of ``'aix5'`` or ``'aix7'``. Since older Python versions include the version number, it is recommended to always use the ``startswith`` idiom presented above.
fr: Sur AIX, :attr:`sys.platform` ne contient plus la version majeure, c'est toujours ``'aix'``, au lieu de ``'aix5'`` ou ``'aix7'``. Comme les anciennes versions de Python incluent le numéro de version, il est recommandé de toujours utiliser ``startswith``, tel qu'utilisé ci-dessus.

source: :attr:`os.name` has a coarser granularity. :func:`os.uname` gives system-dependent version information.
fr: :attr:`os.name` a une granularité plus grossière. :func:`os.uname` donne des informations sur la version dépendantes du système.

source: The :mod:`platform` module provides detailed checks for the system's identity.
fr: Le module :mod:`platform` fournit des vérifications détaillées pour l'identité du système.

source: A string giving the site-specific directory prefix where the platform independent Python files are installed; by default, this is the string ``'/usr/local'``. This can be set at build time with the ``--prefix`` argument to the :program:`configure` script. The main collection of Python library modules is installed in the directory :file:`{prefix}/lib/python{X.Y}` while the platform independent header files (all except :file:`pyconfig.h`) are stored in :file:`{prefix}/include/python{X.Y}`, where *X.Y* is the version number of Python, for example ``3.2``.
fr: Une chaîne donnant le préfixe de répertoire spécifique au site dans lequel les fichiers Python indépendants de la plate-forme sont installés. Par défaut, c'est ``'/usr/local'``. Ceci peut être défini à la compilation en passant l'argument ``--prefix`` au script :program:`configure`. La collection principale des modules de la bibliothèque Python est installée dans le dossier :file:`{prefix}/lib/python{X.Y}` et les entêtes indépendantes de la plateforme (toutes sauf :file:`pyconfig.h`) sont stockées dans :file:`{prefix}/include/python{X.Y}`, où *X.Y* est le numéro de version de Python, par exemple ``3.2``.

source: If a :ref:`virtual environment <venv-def>` is in effect, this value will be changed in ``site.py`` to point to the virtual environment. The value for the Python installation will still be available, via :data:`base_prefix`.
fr: Si a :ref:`environnement virtuel <venv-def>` est activé, cette valeur sera changée par ``site py`` pour pointer vers l'environnement virtuel. La valeur donnée au moment de la compilation de Python sera toujours disponible, dans :data:`base_prefix`.

source: Strings specifying the primary and secondary prompt of the interpreter. These are only defined if the interpreter is in interactive mode. Their initial values in this case are ``'>>> '`` and ``'... '``. If a non-string object is assigned to either variable, its :func:`str` is re-evaluated each time the interpreter prepares to read a new interactive command; this can be used to implement a dynamic prompt.
fr: Chaînes spécifiant l'invite primaire et secondaire de l'interpréteur. Celles-ci ne sont définies que si l'interpréteur est en mode interactif. Dans ce cas, leurs valeurs initiales sont ``'>>>'`` et ``'...'``. Si un objet qui n'est pas une chaîne est assigné à l'une ou l'autre variable, sa méthode :func:`str` sera appelée à chaque fois que l'interpréteur se prépare à lire une nouvelle commande interactive, c'est donc utilisable pour implémenter une invite dynamique.

source: Set the interpreter's "check interval". This integer value determines how often the interpreter checks for periodic things such as thread switches and signal handlers. The default is ``100``, meaning the check is performed every 100 Python virtual instructions. Setting it to a larger value may increase performance for programs using threads. Setting it to a value ``<=`` 0 checks every virtual instruction, maximizing responsiveness as well as overhead.
fr: Défini l'"intervalle de vérification" de l'interpréteur. Ce nombre entier détermine la fréquence à laquelle l'interpréteur effectue des tâches périodiques tels que la commutation de fil d'exécution et la gestion de signaux. La valeur par défaut est ``100``, ce qui signifie que le contrôle est effectué toutes les 100 instructions virtuelles Python. L'augmenter peut améliorer les performances des programmes utilisant des fils d'exécution. Le paramétrer à une valeur inférieure ou égale à zéro permet d'effectuer ces tâches à chaque instruction virtuelle, maximisant ainsi la réactivité mais aussi son surcoût.

source: This function doesn't have an effect anymore, as the internal logic for thread switching and asynchronous tasks has been rewritten. Use :func:`setswitchinterval` instead.
fr: Cette fonction n'a plus aucun effet : La logique interne de commutation de fils d'exécution et de gestion des tâches asynchrones ayant été réécrite. Utilisez :func:`setswitchinterval` à la place.

source: Set the flags used by the interpreter for :c:func:`dlopen` calls, such as when the interpreter loads extension modules. Among other things, this will enable a lazy resolving of symbols when importing a module, if called as ``sys.setdlopenflags(0)``. To share symbols across extension modules, call as ``sys.setdlopenflags(os.RTLD_GLOBAL)``. Symbolic names for the flag values can be found in the :mod:`os` module (``RTLD_xxx`` constants, e.g. :data:`os.RTLD_LAZY`).
fr: Définit les options utilisées par l'interpréteur lors des appels à :c:func:`dlopen`, typiquement utilisé par l'interpréteur pour charger des modules d'extension. Permet entre autre de résoudre tardivement les symboles lors des importations de modules (si appelé ``sys.setdlopenflags(0)``). Pour partager les symboles entre modules, appelez ``sys.setdlopenflags(os.RTLD_GLOBAL)``. Les noms pour les valeurs de ces options peuvent être trouvés dans le module :mod:`os` (ce sont les constantes ``RTLD_xxx``, comme :data:`os.RTLD_LAZY`).
