Repository: python/python-docs-fr
Catalog: library/sys.po
Languages: fr

source: Name and version of the thread library. It is a string, or ``None`` if this information is unknown.
fr: Nom et version de l'implémentation des fils d'exécution, c'est une chaîne, ou ``None`` si ces informations sont inconnues.

source: When this variable is set to an integer value, it determines the maximum number of levels of traceback information printed when an unhandled exception occurs. The default is ``1000``. When set to ``0`` or less, all traceback information is suppressed and only the exception type and value are printed.
fr: Lorsque cette variable contient un nombre entier, elle détermine la profondeur maximum de la pile d'appels affichée lorsqu'une exception non gérée se produit. La valeur par défaut est ``1000``, lorsque cette valeur est égale ou inférieure à ``0``, la pile d'appels n'est pas affichée, seul seuls le type et la valeur de l'exception sont le sont.

source: The *unraisable* argument has the following attributes:
fr: Les arguments *unraisable* ont la signification suivante :

source: *exc_type*: Exception type.
fr: *exc_type* : le type de l'exception ;

source: *exc_value*: Exception value, can be ``None``.
fr: *exc_value*: la valeur de l'exception, peut être ``None`` ;

source: *exc_traceback*: Exception traceback, can be ``None``.
fr: *exc_traceback* : la pile d'appels pour cette exception, peut être ``None`` ;

source: Storing *exc_value* using a custom hook can create a reference cycle. It should be cleared explicitly to break the reference cycle when the exception is no longer needed.
fr: Stocker *exc_value* en utilisant une fonction de rappel personnalisée peut créer un cycle de références. *exc_value* doit être nettoyée explicitement pour casser ce cycle lorsque l'exception n'est plus nécessaire.

source: A string containing the version number of the Python interpreter plus additional information on the build number and compiler used. This string is displayed when the interactive interpreter is started. Do not extract version information out of it, rather, use :data:`version_info` and the functions provided by the :mod:`platform` module.
fr: Une chaîne contenant le numéro de version de l'interpréteur Python, ainsi que d'autres informations comme le numéro de compilation et le compilateur utilisé. Cette chaîne est affichée lorsque l'interpréteur est démarré en mode interactif. N'essayez pas d'en extraire des informations de version, utilisez plutôt :data:`version_info` et les fonctions fournies par le module :mod:`platform`.

source: The C API version for this interpreter. Programmers may find this useful when debugging version conflicts between Python and extension modules.
fr: La version de l'API C pour cet interpréteur. Les développeurs peuvent trouver cette information utile en déboguant des conflits de versions entre Python et des modules d'extension.

source: A tuple containing the five components of the version number: *major*, *minor*, *micro*, *releaselevel*, and *serial*. All values except *releaselevel* are integers; the release level is ``'alpha'``, ``'beta'``, ``'candidate'``, or ``'final'``. The ``version_info`` value corresponding to the Python version 2.0 is ``(2, 0, 0, 'final', 0)``. The components can also be accessed by name, so ``sys.version_info[0]`` is equivalent to ``sys.version_info.major`` and so on.
fr: Un *tuple* contenant les cinq composants du numéro de version : *major*, *minor*, *micro*, *releaselevel* et *serial*. Toutes les valeurs sauf *releaselevel* sont des nombres entiers. *releaselevel* peut valoir ``'alpha'``, ``'beta'``, ``'candidate'``, ou ``'final'``. La valeur de ``version_info`` pour Python 2.0 est ``(2, 0, 0, 'final', 0)``. Ces attributs sont aussi accessibles par leur nom, ainsi ``sys.version_info[0]`` est équivalent à ``sys.version_info.major``, et ainsi de suite.

source: Added named component attributes.
fr: Ajout des attributs nommés.

source: This is an implementation detail of the warnings framework; do not modify this value. Refer to the :mod:`warnings` module for more information on the warnings framework.
fr: C'est une spécificité de l'implémentation de la gestion des avertissements. Ne modifiez pas cette valeur. Reportez-vous au module :mod:`warnings` pour plus d'informations sur le gestionnaire d'avertissements.

source: The version number used to form registry keys on Windows platforms. This is stored as string resource 1000 in the Python DLL. The value is normally the first three characters of :const:`version`. It is provided in the :mod:`sys` module for informational purposes; modifying this value has no effect on the registry keys used by Python.
fr: Le numéro de version utilisé pour construire les clefs de registre sous Windows. Elle est stockée en tant que *string resource* 1000 dans la DLL Python. Cette valeur équivaut typiquement aux trois premiers caractères de :const:`version`. Elle est fournie par le module :mod:`sys` à titre d'information, et la modifier n'a aucun effet sur les clés de registre utilisées par Python.

source: A dictionary of the various implementation-specific flags passed through the :option:`-X` command-line option. Option names are either mapped to their values, if given explicitly, or to :const:`True`. Example:
fr: Un dictionnaire des différentes options spécifiques à l'implémentation passés en ligne de commande via l'option :option:`-X`. Aux noms des options correspondent soit leur valeur, si elle est donnée explicitement, soit à :const:`True`. Exemple :

source: This is a CPython-specific way of accessing options passed through :option:`-X`. Other implementations may export them through other means, or not at all.
fr: C'est un moyen spécifique à CPython pour accéder aux options passées via l'option :option:`-X`. D'autres implémentations pourraient les exposer par d'autres moyens, ou pas du tout.

source: ISO/IEC 9899:1999. "Programming languages -- C." A public draft of this standard is available at http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1256.pdf\ .
fr: *ISO/IEC 9899:1999*. "Langages de programmation -- C." Un texte public de ce standard est disponible à http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1256.pdf\ .
