Repository: python/python-docs-fr
Catalog: library/sys.po
Languages: fr

source: The optional argument *arg* can be an integer giving the exit status (defaulting to zero), or another type of object. If it is an integer, zero is considered "successful termination" and any nonzero value is considered "abnormal termination" by shells and the like. Most systems require it to be in the range 0--127, and produce undefined results otherwise. Some systems have a convention for assigning specific meanings to specific exit codes, but these are generally underdeveloped; Unix programs generally use 2 for command line syntax errors and 1 for all other kind of errors. If another type of object is passed, ``None`` is equivalent to passing zero, and any other object is printed to :data:`stderr` and results in an exit code of 1. In particular, ``sys.exit("some error message")`` is a quick way to exit a program when an error occurs.
fr: L'argument optionnel *arg* peut être un nombre entier donnant l'état de sortie (zéro par défaut), ou un autre type d'objet. Pour les *shells* (et autres), si c'est un entier, zéro signifie "terminé avec succès", et toutes les autres valeurs signifient "terminé anormalement". La plupart des systèmes imposent qu'il se situe dans la plage 0--127, et leur comportement n'est pas défini pour les autres cas. Certains systèmes peu communs ont pour convention d'assigner un sens particulier à des valeur spécifiques. Les programmes Unix utilisent généralement 2 pour les erreurs de syntaxe dans les arguments de la ligne de commande, et 1 pour toutes les autres erreurs. Si un autre type est passé, ``None`` est équivalent à zéro, et tout autre objet est écrit sur :data:`stderr` et donne un code de sortie 1. Typiquement, ``sys.exit("some error message")`` est un moyen rapide de quitter un programme en cas d'erreur.

source: Since :func:`exit` ultimately "only" raises an exception, it will only exit the process when called from the main thread, and the exception is not intercepted.
fr: Puisque la fonction :func:`exit` ne fait "que" lever une exception, elle ne fera quitter le processus que si elle est appelée depuis le fil d'exécution principal, et que l'exception n'est pas interceptée.

source: If an error occurs in the cleanup after the Python interpreter has caught :exc:`SystemExit` (such as an error flushing buffered data in the standard streams), the exit status is changed to 120.
fr: Si une erreur survient lors du nettoyage après que l'interpréteur Python ai intercepté un :exc:`SystemExit` (typiquement une erreur en vidant les tampons des sorties standard), le code de sortie est changé à 120.

source: The :term:`named tuple` *flags* exposes the status of command line flags. The attributes are read only.
fr: La :term:`named tuple` *flags* expose l'état des options de ligne de commande. Ces attributs sont en lecture seule.

source: attribute
fr: attribut

source: flag
fr: option

source: Added ``quiet`` attribute for the new :option:`-q` flag.
fr: Ajout de l'attribut ``quiet`` pour la nouvelle option :option:`-q`.

source: The ``hash_randomization`` attribute.
fr: L'attribut ``hash_randomization``.

source: Removed obsolete ``division_warning`` attribute.
fr: Suppression de l'attribut obsolète ``division_warning``.

source: Added ``isolated`` attribute for :option:`-I` ``isolated`` flag.
fr: Ajout de l'attribut ``isolated`` pour l'option :option:`-I` ``isolated``.

source: Added ``dev_mode`` attribute for the new :option:`-X` ``dev`` flag and ``utf8_mode`` attribute for the new :option:`-X` ``utf8`` flag.
fr: Ajout de l'attribut ``dev_mode`` pour la nouvelle option :option:`-X` ``dev`` et l'attribut ``utf8_mode`` pour la nouvelle option :option:`-X` ``utf8``.

source: A :term:`named tuple` holding information about the float type. It contains low level information about the precision and internal representation. The values correspond to the various floating-point constants defined in the standard header file :file:`float.h` for the 'C' programming language; see section 5.2.4.2.2 of the 1999 ISO/IEC C standard [C99]_, 'Characteristics of floating types', for details.
fr: Un :term:`named tuple` contenant des informations à propos du type *float*. Il contient des informations de bas niveau à propos de la précision et de la représentation interne. Les valeurs correspondent aux différentes constantes à propos des nombres à virgule flottantes définies dans le fichier d'entête :file:`float.h` pour le langage de programmation C. Voir la section 5.2.4.2.2 de *1999 ISO/IEC C standard* [C99]_, *Characteristics of floating types*, pour plus de détails.

source: float.h macro
fr: macro *float.h*

source: explanation
fr: explication

source: maximum number of decimal digits that can be faithfully represented in a float; see below
fr: nombre maximum de décimales pouvant être représentées fidèlement dans un *float* (voir ci-dessous)

source: float precision: the number of base-``radix`` digits in the significand of a float
fr: précision : nombre de *base-*\ ``radix`` chiffres dans la mantisse du *float*

source: radix of exponent representation
fr: base de la représentation de l'exposant

source: integer constant representing the rounding mode used for arithmetic operations. This reflects the value of the system FLT_ROUNDS macro at interpreter startup time. See section 5.2.4.2.2 of the C99 standard for an explanation of the possible values and their meanings.
fr: constante, nombre entier représentant le mode d'arrondi utilisé pour les opérations arithmétiques. Elle reflète la valeur de la macro système FLT_ROUNDS au moment du démarrage de l'interpréteur. Voir section 5.2.4.4.2.2 de la norme C99 pour une explication des valeurs possibles et de leurs significations.

source: The attribute :attr:`sys.float_info.dig` needs further explanation. If ``s`` is any string representing a decimal number with at most :attr:`sys.float_info.dig` significant digits, then converting ``s`` to a float and back again will recover a string representing the same decimal value::
fr: L'attribut :attr:`sys.float_info.dig` nécessite plus d'explications : Si ``s`` est une chaîne représentant un nombre décimal avec au plus :attr:`sys.float_info.dig` chiffres significatifs, alors, convertir ``s`` en un nombre à virgule flottante puis à nouveau en chaîne redonnera la même valeur ::

source: But for strings with more than :attr:`sys.float_info.dig` significant digits, this isn't always true::
fr: Cependant, pour les chaînes avec plus de :attr:`sys.float_info.dig` chiffres significatifs, ce n'est pas toujours vrai ::

source: A string indicating how the :func:`repr` function behaves for floats. If the string has value ``'short'`` then for a finite float ``x``, ``repr(x)`` aims to produce a short string with the property that ``float(repr(x)) == x``. This is the usual behaviour in Python 3.1 and later. Otherwise, ``float_repr_style`` has value ``'legacy'`` and ``repr(x)`` behaves in the same way as it did in versions of Python prior to 3.1.
fr: Une chaîne indiquant comment la fonction :func:`repr` se comporte avec les nombres à virgule flottante. Si la chaîne a la valeur ``'short'``, alors pour un *float* finit ``x``, ``repr(x)`` essaye de donner une courte chaîne tel que ``float(repr(x)) == x``. C'est le comportement typique à partir de Python 3.1. Autrement, ``float_repr_style`` a la valeur ``'legacy'`` et ``repr(x)`` se comporte comme les versions antérieures à 3.1.

source: Return the number of memory blocks currently allocated by the interpreter, regardless of their size. This function is mainly useful for tracking and debugging memory leaks. Because of the interpreter's internal caches, the result can vary from call to call; you may have to call :func:`_clear_type_cache()` and :func:`gc.collect()` to get more predictable results.
fr: Renvoie le nombre de blocs mémoire actuellement alloués par l'interpréteur, peu importe leur taille. Cette fonction est principalement utile pour pister les fuites de mémoire. À cause des caches internes de l'interpréteur, le résultat peut varier d'un appel à l'autre. Appeler :func:`_clear_type_cache()` et :func:`gc.collect()` peut permettre d'obtenir des résultats plus prévisibles.

source: If a Python build or implementation cannot reasonably compute this information, :func:`getallocatedblocks()` is allowed to return 0 instead.
fr: Si Python n'arrive pas a calculer raisonnablement cette information, :func:`getallocatedblocks()` est autorisé à renvoyer 0 à la place.

source: Return the build time API version of Android as an integer.
fr: Renvoie la version de l'API Android utilisée pour compiler sous forme d'un entier.

source: :ref:`Availability <availability>`: Android.
fr: :ref:`Disponibilité <availability>` : Android.

source: Return the interpreter's "check interval"; see :func:`setcheckinterval`.
fr: Renvoie le *check interval* de l'interpréteur, voir :func:`setcheckinterval`.

source: Use :func:`getswitchinterval` instead.
fr: Utilisez plutôt :func:`getswitchinterval`.

source: Return the name of the current default string encoding used by the Unicode implementation.
fr: Renvoie le nom du codage par défaut actuellement utilisé par l'implémentation *Unicode* pour coder les chaînes.

source: Return the current value of the flags that are used for :c:func:`dlopen` calls. Symbolic names for the flag values can be found in the :mod:`os` module (``RTLD_xxx`` constants, e.g. :data:`os.RTLD_LAZY`).
fr: Renvoie la valeur actuelle des drapeaux utilisés par les appels de :c:func:`dlopen`. Les noms symboliques valeurs peuvent être trouvées dans le module :mod:`os`. (Ce sont les constantes ``RTLD_xxx`` e.g. :data:`os.RTLD_LAZY`).

source: :ref:`Availability <availability>`: Unix.
fr: :ref:`Disponibilité <availability>` : Unix.

source: Return the name of the encoding used to convert between Unicode filenames and bytes filenames. For best compatibility, str should be used for filenames in all cases, although representing filenames as bytes is also supported. Functions accepting or returning filenames should support either str or bytes and internally convert to the system's preferred representation.
fr: Donne le nom de l'encodage utilisé pour les conversions entre les noms de fichiers Unicode et les noms de fichiers en octets. Pour une compatibilité optimale, les noms de fichiers devraient toujours être représentés sous forme de chaînes de caractères, cependant les représenter sous forme d'objet *bytes* est aussi accepté. Les fonctions acceptant ou renvoyant des noms de fichiers devraient supporter les deux (*str* ou *bytes*), et convertir en interne dans la représentation du système.

source: This encoding is always ASCII-compatible.
fr: Cet encodage est toujours compatible avec ASCII.

source: :func:`os.fsencode` and :func:`os.fsdecode` should be used to ensure that the correct encoding and errors mode are used.
fr: Les fonctions :func:`os.fsencode` et :func:`os.fsdecode` devraient être utilisées pour s'assurer qu'un encodage et un gestionnaire d'erreurs correct sont utilisés.

source: In the UTF-8 mode, the encoding is ``utf-8`` on any platform.
fr: Dans le mode UTF-8, l'encodage est ``'utf-8'`` sur toutes les plate-formes.

source: On macOS, the encoding is ``'utf-8'``.
fr: Sur macOS, l'encodage est ``'utf-8'``.

source: On Unix, the encoding is the locale encoding.
fr: Sur Unix, l'encodage est celui des paramètres régionaux.

source: On Windows, the encoding may be ``'utf-8'`` or ``'mbcs'``, depending on user configuration.
fr: Sur Windows, l'encodage peut être ``'utf-8'`` ou ``'mbcs'``, en fonction des paramètres de l'utilisateur.

source: On Android, the encoding is ``'utf-8'``.
fr: Sur Android, l'encodage est ``'utf-8'``.

source: On VxWorks, the encoding is ``'utf-8'``.
fr: Sur VxWorks, l'encodage est ``'utf-8'``.

source: :func:`getfilesystemencoding` result cannot be ``None`` anymore.
fr: :func:`getfilesystemencoding` ne peut plus renvoyer ``None``.

source: Windows is no longer guaranteed to return ``'mbcs'``. See :pep:`529` and :func:`_enablelegacywindowsfsencoding` for more information.
fr: Sur Windows, on est plus assurés d'obtenir ``'mbcs'``. Voir la :pep:`529` et :func:`_enablelegacywindowsfsencoding` pour plus d'informations.

source: Return 'utf-8' in the UTF-8 mode.
fr: Renvoie `"utf-8"` en mode UTF-8.

source: Return the name of the error mode used to convert between Unicode filenames and bytes filenames. The encoding name is returned from :func:`getfilesystemencoding`.
fr: Donne le nom du mode de gestion d'erreur utilisé lors de la conversion des noms de fichiers entre Unicode et octets. Le nom de l'encodage est renvoyé par :func:`getfilesystemencoding`.

source: Return the reference count of the *object*. The count returned is generally one higher than you might expect, because it includes the (temporary) reference as an argument to :func:`getrefcount`.
fr: Donne le nombre de référence de l'objet *object*. Le nombre renvoyé est généralement d'une référence de plus qu'attendu, puisqu'il compte la référence (temporaire) de l'argument à :func:`getrefcount`.

source: Return the current value of the recursion limit, the maximum depth of the Python interpreter stack. This limit prevents infinite recursion from causing an overflow of the C stack and crashing Python. It can be set by :func:`setrecursionlimit`.
fr: Donne la limite actuelle de la limite de récursion, la profondeur maximum de la pile de l'interpréteur. Cette limite empêche Python de planter lors d'une récursion infinie à cause d'un débordement de la pile. Elle peut être modifiée par :func:`setrecursionlimit`.

source: Return the size of an object in bytes. The object can be any type of object. All built-in objects will return correct results, but this does not have to hold true for third-party extensions as it is implementation specific.
fr: Donne la taille d'un objet en octets. L'objet peut être de n'importe quel type. Le résultat sera correct pour tous les objets natifs, mais le résultat peut ne pas être toujours vrai pour les extensions, la valeur étant dépendante de l'implémentation.

source: Only the memory consumption directly attributed to the object is accounted for, not the memory consumption of objects it refers to.
fr: Seule la mémoire directement attribuée à l'objet est prise en compte, pas la mémoire consommée par les objets vers lesquels il a des références.

source: If given, *default* will be returned if the object does not provide means to retrieve the size. Otherwise a :exc:`TypeError` will be raised.
fr: S'il est fourni, *default* sera renvoyé si l'objet ne fournit aucun moyen de récupérer sa taille. Sinon, une exception :exc:`TypeError` sera levée.

source: :func:`getsizeof` calls the object's ``__sizeof__`` method and adds an additional garbage collector overhead if the object is managed by the garbage collector.
fr: :func:`getsizeof` appelle la méthode ``__sizeof__`` de l'objet, et s'il est géré par lui, ajoute le surcoût du ramasse-miettes.

source: See `recursive sizeof recipe <https://code.activestate.com/recipes/577504>`_ for an example of using :func:`getsizeof` recursively to find the size of containers and all their contents.
fr: Voir la `recursive sizeof recipe <https://code.activestate.com/recipes/577504>`_ pour un exemple d'utilisation récursive de :func:`getsizeof` pour trouver la taille d'un contenant et de son contenu.

source: Return the interpreter's "thread switch interval"; see :func:`setswitchinterval`.
fr: Renvoie la valeur du *thread switch interval* de l'interpréteur, voir :func:`setswitchinterval`.

source: Return a frame object from the call stack. If optional integer *depth* is given, return the frame object that many calls below the top of the stack. If that is deeper than the call stack, :exc:`ValueError` is raised. The default for *depth* is zero, returning the frame at the top of the call stack.
fr: Renvoie une *frame* de la pile d'appels. Si le nombre entier optionnel *depth* est donné, la *frame* donnée sera de *depth* appels depuis le haut de la pile. Si c'est plus profond que la hauteur de la pile, une exception :exc:`ValueError` est levée. La profondeur par défaut est zéro, donnant ainsi la *frame* du dessus de la pile.

source: This function should be used for internal and specialized purposes only. It is not guaranteed to exist in all implementations of Python.
fr: Cette fonction ne devrait être utilisée que pour une utilisation interne et spécifique. Il n'est pas garanti qu'elle existe dans toutes les implémentations de Python.

source: Get the profiler function as set by :func:`setprofile`.
fr: Renvoie la fonction de profilage tel que défini par :func:`setprofile`.

source: Get the trace function as set by :func:`settrace`.
fr: Renvoie la fonction de traçage tel que définie par :func:`settrace`.

source: The :func:`gettrace` function is intended only for implementing debuggers, profilers, coverage tools and the like. Its behavior is part of the implementation platform, rather than part of the language definition, and thus may not be available in all Python implementations.
fr: La fonction :func:`gettrace` ne sert que pour implémenter des débogueurs, des *profilers*, outils d'analyse de couverture, etc…. Son comportement dépend de l'implémentation et non du langage, elle n'est donc pas forcément disponible dans toutes les implémentations de Python.

source: Return a named tuple describing the Windows version currently running. The named elements are *major*, *minor*, *build*, *platform*, *service_pack*, *service_pack_minor*, *service_pack_major*, *suite_mask*, *product_type* and *platform_version*. *service_pack* contains a string, *platform_version* a 3-tuple and all other values are integers. The components can also be accessed by name, so ``sys.getwindowsversion()[0]`` is equivalent to ``sys.getwindowsversion().major``. For compatibility with prior versions, only the first 5 elements are retrievable by indexing.
fr: Renvoie un tuple nommé décrivant la version de Windows en cours d'exécution. Les attributs nommés sont *major*, *minor*, *build*, *platform*, *service_pack*, *service_pack_minor*, *service_pack_major*, *suite_mask*, *product_type* et *platform_version*. *service_pack* contient une string, *platform_version* un *tuple* de trois valeurs, et tous les autres sont des nombres entiers. Ces attributs sont également accessibles par leur nom, donc ``sys.getwindowsversion()[0]`` est équivalent à ``sys.getwindowsversion().major``. Pour des raisons de compatibilité avec les versions antérieures, seuls les 5 premiers éléments sont accessibles par leur indice.

source: *platform* will be :const:`2 (VER_PLATFORM_WIN32_NT)`.
fr: *platform* sera :const:`2 (VER_PLATFORM_WIN32_NT)`.

source: *product_type* may be one of the following values:
fr: *product_type* peut être une des valeurs suivantes :

source: Constant
fr: Constante

source: Meaning
fr: Signification

source: The system is a workstation.
fr: Le système une station de travail.

source: The system is a domain controller.
fr: Le système est un contrôleur de domaine.

source: The system is a server, but not a domain controller.
fr: Le système est un serveur, mais pas un contrôleur de domaine.

source: This function wraps the Win32 :c:func:`GetVersionEx` function; see the Microsoft documentation on :c:func:`OSVERSIONINFOEX` for more information about these fields.
fr: Cette fonction enveloppe la fonction Win32 :c:func:`GetVersionEx`. Voir la documentation de Microsoft sur :c:func:`OSVERSIONINFOEX` pour plus d'informations sur ces champs.

source: *platform_version* returns the accurate major version, minor version and build number of the current operating system, rather than the version that is being emulated for the process. It is intended for use in logging rather than for feature detection.
fr: *platform_version* donne précisément la version majeure, mineure, et numéro de compilation du système d'exploitation sous-jacent, plutôt que la version émulée pour ce processus. Il est destiné à être utilisé pour de la journalisation plutôt que pour la détection de fonctionnalités.

source: Changed to a named tuple and added *service_pack_minor*, *service_pack_major*, *suite_mask*, and *product_type*.
fr: Changé en un *tuple* nommé, et ajout de *service_pack_minor*, *service_pack_major*, *suite_mask*, et *product_type*.

source: Added *platform_version*
fr: Ajout de *platform_version*

source: Returns an *asyncgen_hooks* object, which is similar to a :class:`~collections.namedtuple` of the form `(firstiter, finalizer)`, where *firstiter* and *finalizer* are expected to be either ``None`` or functions which take an :term:`asynchronous generator iterator` as an argument, and are used to schedule finalization of an asynchronous generator by an event loop.
fr: Renvoie un objet *asyncgen_hooks*, qui est semblable à un :class:`~collections.namedtuple` de la forme `(firstiter, finalizer)`, où *firstiter* et *finalizer* sont soit ``None`` ou des fonctions qui prennent un :term:`asynchronous generator iterator` comme argument, et sont utilisées pour planifier la finalisation d'un générateur asynchrone par un *event loop*.

source: See :pep:`525` for more details.
fr: Voir la :pep:`525` pour plus d'informations.

source: This function has been added on a provisional basis (see :pep:`411` for details.)
fr: Cette fonction à été ajoutée à titre provisoire (voir la :pep:`411` pour plus d'informations.)

source: Get the current coroutine origin tracking depth, as set by :func:`set_coroutine_origin_tracking_depth`.
fr: Récupère le nombre de cadres d'exécution conservés par les coroutines pour le suivi de leur création, telle que défini par :func:`set_coroutine_origin_tracking_depth`.

source: This function has been added on a provisional basis (see :pep:`411` for details.) Use it only for debugging purposes.
fr: Cette fonction à été ajoutée à titre provisoire (Voir la :pep:`411` pour plus d'informations.) Utilisez la uniquement à des fins de débogage.

source: A :term:`named tuple` giving parameters of the numeric hash implementation. For more details about hashing of numeric types, see :ref:`numeric-hash`.
fr: Un :term:`named tuple` donnant les paramètres de l'implémentation de la fonction de hachage de nombres. Pour plus d'informations sur le hachage des types numériques, consultez :ref:`numeric-hash`.

source: width in bits used for hash values
fr: Nombre de bits des valeurs de *hash*

source: prime modulus P used for numeric hash scheme
fr: contient le premier P utilisé dans le modulo pour les *hash* numériques

source: hash value returned for a positive infinity
fr: valeur du *hash* pour un infini positif

source: hash value returned for a nan
fr: valeur du *hash* pour un *nan*

source: multiplier used for the imaginary part of a complex number
fr: multiplicateur utilisé pour la partie imaginaire d'un nombre complexe

source: name of the algorithm for hashing of str, bytes, and memoryview
fr: nom de l'algorithme pour le hachage des *str*, *bytes*, et *memoryview*

source: internal output size of the hash algorithm
fr: taille de la sortie interne de l'algorithme de hachage

source: size of the seed key of the hash algorithm
fr: taille de la *seed key* utilisée par l'algorithme de hachage

source: Added *algorithm*, *hash_bits* and *seed_bits*
fr: Ajout de *algorithm*, *hash_bits* et *seed_bits*

source: The version number encoded as a single integer. This is guaranteed to increase with each version, including proper support for non-production releases. For example, to test that the Python interpreter is at least version 1.5.2, use::
fr: Le numéro de version codé sous forme d'un seul nombre entier. Ce numéro augmente avec chaque version, y compris pour les versions hors production. Par exemple, pour vérifier que l'interpréteur Python est au moins la version 1.5, utilisez ::
