Repository: python/python-docs-fr
Catalog: library/tabnanny.po
Languages: fr

source: :mod:`tabnanny` --- Detection of ambiguous indentation
fr: :mod:`tabnanny` --- Détection d'indentation ambiguë

source: **Source code:** :source:`Lib/tabnanny.py`
fr: **Code source:** :source:`Lib/tabnanny.py`

source: For the time being this module is intended to be called as a script. However it is possible to import it into an IDE and use the function :func:`check` described below.
fr: Pour l'instant ce module est destiné à être appelé comme un script. Toutefois, il est possible de l'importer dans un IDE et d'utiliser la fonction :func:`check` décrite ci-dessous.

source: The API provided by this module is likely to change in future releases; such changes may not be backward compatible.
fr: L'API fournie par ce module est susceptible de changer dans les versions futures ; ces modifications peuvent ne pas être rétro-compatibles.

source: If *file_or_dir* is a directory and not a symbolic link, then recursively descend the directory tree named by *file_or_dir*, checking all :file:`.py` files along the way. If *file_or_dir* is an ordinary Python source file, it is checked for whitespace related problems. The diagnostic messages are written to standard output using the :func:`print` function.
fr: Si *file_or_dir* est un répertoire et non un lien symbolique, alors descendez récursivement l'arborescence de répertoire nommée par *file_or_dir*, en vérifiant tous les fichiers :file:`.py` en chemin. Si *file_or_dir* est un fichier source Python ordinaire, il est vérifié pour les problèmes liés aux espaces blancs. Les messages de diagnostic sont écrits sur la sortie standard à l'aide de la fonction :func:`print`.

source: Flag indicating whether to print verbose messages. This is incremented by the ``-v`` option if called as a script.
fr: Indicateur indiquant s'il faut imprimer des messages détaillés. Cela est incrémenté par l'option ``-v`` 's'il est appelé comme un script.

source: Flag indicating whether to print only the filenames of files containing whitespace related problems. This is set to true by the ``-q`` option if called as a script.
fr: Indicateur indiquant s'il faut imprimer uniquement les noms de fichiers contenant des problèmes liés aux espaces blancs. Est défini à True par l'option ``-q`` s'il est appelé comme un script.

source: Raised by :func:`process_tokens` if detecting an ambiguous indent. Captured and handled in :func:`check`.
fr: Déclenché par :func:`process_tokens` si une indentation ambiguë est détectée. Capturé et géré dans :func:`check`.

source: This function is used by :func:`check` to process tokens generated by the :mod:`tokenize` module.
fr: Cette fonction est utilisée par :func:`check` pour traiter les jetons générés par le module :mod:`tokenize`.

source: Lexical scanner for Python source code.
fr: Analyseur lexical pour le code source Python.
