Repository: python/python-docs-fr
Catalog: library/tarfile.po
Languages: fr

source: For :const:`PAX_FORMAT` archives (the default), *encoding* is generally not needed because all the metadata is stored using *UTF-8*. *encoding* is only used in the rare cases when binary pax headers are decoded or when strings with surrogate characters are stored.
fr: Pour les archives :const:`PAX_FORMAT` (par défaut), l'encodage n'est généralement pas nécessaire car toutes les métadonnées sont stockées à l'aide de *UTF-8*. L'encodage n'est utilisé que dans les rares cas où les en-têtes *pax* binaires sont décodés ou lorsque les chaînes avec des caractères de substitution sont stockées.
