Repository: python/python-docs-fr
Catalog: library/tarfile.po
Languages: fr

source: Extract all members from the archive to the current working directory or directory *path*. If optional *members* is given, it must be a subset of the list returned by :meth:`getmembers`. Directory information like owner, modification time and permissions are set after all members have been extracted. This is done to work around two problems: A directory's modification time is reset each time a file is created in it. And, if a directory's permissions do not allow writing, extracting files to it will fail.
fr: Extrait tous les membres de l'archive vers le répertoire de travail actuel ou le répertoire *chemin*. Si des *membres* facultatifs sont fournis, il doit s'agir d'un sous-ensemble de la liste renvoyée par :meth:`getmembers`. Les informations d'annuaire telles que le propriétaire, l'heure de modification et les autorisations sont définies une fois tous les membres extraits. Cela est fait pour contourner deux problèmes : l'heure de modification d'un répertoire est réinitialisée chaque fois qu'un fichier y est créé. Et, si les autorisations d'un répertoire ne permettent pas l'écriture, l'extraction de fichiers échoue.

source: If *numeric_owner* is :const:`True`, the uid and gid numbers from the tarfile are used to set the owner/group for the extracted files. Otherwise, the named values from the tarfile are used.
fr: Si *numeric_owner* est :const:`True`, les numéros *uid* et *gid* du fichier *tar* sont utilisés pour définir le propriétaire et le groupe des fichiers extraits. Sinon, les valeurs nommées du fichier *tar* sont utilisées.

source: Never extract archives from untrusted sources without prior inspection. It is possible that files are created outside of *path*, e.g. members that have absolute filenames starting with ``"/"`` or filenames with two dots ``".."``.
fr: Ne jamais extraire des archives de sources non fiables sans inspection préalable. Il est possible que des fichiers soient créés en dehors de *chemin*, par exemple : les membres qui ont des noms de fichiers absolus commençant par ``"/"`` ou des noms de fichiers avec deux points ``".."``.

source: Added the *numeric_owner* parameter.
fr: Ajout du paramètre *numeric_owner*.

source: The *path* parameter accepts a :term:`path-like object`.
fr: Le paramètre *path* accepte un :term:`path-like object`.

source: Extract a member from the archive to the current working directory, using its full name. Its file information is extracted as accurately as possible. *member* may be a filename or a :class:`TarInfo` object. You can specify a different directory using *path*. *path* may be a :term:`path-like object`. File attributes (owner, mtime, mode) are set unless *set_attrs* is false.
fr: Extrait un membre de l'archive vers le répertoire de travail actuel, en utilisant son nom complet. Les informations de son fichier sont extraites aussi précisément que possible. Le membre peut être un nom de fichier ou un objet :class:`TarInfo`. Vous pouvez spécifier un répertoire différent en utilisant *path*. *path* peut être un :term:`path-like object`. Les attributs de fichier (propriétaire, *mtime*, mode) sont définis sauf si *set_attrs* est faux.

source: The :meth:`extract` method does not take care of several extraction issues. In most cases you should consider using the :meth:`extractall` method.
fr: La méthode :meth:`extract` ne prend pas en charge plusieurs problèmes d'extraction. Dans la plupart des cas, vous devriez envisager d'utiliser la méthode :meth:`extractall`.

source: See the warning for :meth:`extractall`.
fr: Voir l'avertissement pour :meth:`extractall`.

source: Added the *set_attrs* parameter.
fr: Ajout du paramètre *set_attrs*.

source: Extract a member from the archive as a file object. *member* may be a filename or a :class:`TarInfo` object. If *member* is a regular file or a link, an :class:`io.BufferedReader` object is returned. For all other existing members, :const:`None` is returned. If *member* does not appear in the archive, :exc:`KeyError` is raised.
fr: Extrait un membre de l'archive en tant qu'objet fichier. *member* peut être un nom de fichier ou un objet :class:`TarInfo`. Si *member* est un fichier normal ou un lien, un objet :class:`io.BufferedReader` est renvoyé. Sinon, :const:`None` est renvoyé. Lève une exception :exc:`KeyError` si *member* n'est pas présent dans l'archive.

source: Return an :class:`io.BufferedReader` object.
fr: Renvoie un objet :class:`io.BufferedReader`.

source: Add the file *name* to the archive. *name* may be any type of file (directory, fifo, symbolic link, etc.). If given, *arcname* specifies an alternative name for the file in the archive. Directories are added recursively by default. This can be avoided by setting *recursive* to :const:`False`. Recursion adds entries in sorted order. If *filter* is given, it should be a function that takes a :class:`TarInfo` object argument and returns the changed :class:`TarInfo` object. If it instead returns :const:`None` the :class:`TarInfo` object will be excluded from the archive. See :ref:`tar-examples` for an example.
fr: Ajoute le fichier *name* à l'archive. *name* peut être n'importe quel type de fichier (répertoire, *fifo*, lien symbolique, etc.). S'il est donné, *arcname* spécifie un autre nom pour le fichier dans l'archive. Les répertoires sont ajoutés récursivement par défaut. Cela peut être évité en définissant *recursive* sur :const:`False`. La récursivité ajoute des entrées dans l'ordre trié. Si *filter* est donné, il convient que ce soit une fonction qui prend un argument d'objet :class:`TarInfo` et renvoie l'objet changé :class:`TarInfo`. S'il renvoie à la place :const:`None`, l'objet :class:`TarInfo` sera exclu de l'archive. Voir :ref:`tar-examples` pour un exemple.

source: Added the *filter* parameter.
fr: Ajout du paramètre *filter*.

source: Recursion adds entries in sorted order.
fr: La récursivité ajoute les entrées dans un ordre trié.

source: Add the :class:`TarInfo` object *tarinfo* to the archive. If *fileobj* is given, it should be a :term:`binary file`, and ``tarinfo.size`` bytes are read from it and added to the archive. You can create :class:`TarInfo` objects directly, or by using :meth:`gettarinfo`.
fr: Ajoute l'objet :class:`TarInfo` *tarinfo* à l'archive. Si *fileobj* est donné, il convient que ce soit un :term:`fichier binaire`, et les octets ``tarinfo.size`` sont lus à partir de celui-ci et ajoutés à l'archive. Vous pouvez créer des objets :class:`TarInfo` directement, ou en utilisant :meth:`gettarinfo`.

source: Create a :class:`TarInfo` object from the result of :func:`os.stat` or equivalent on an existing file. The file is either named by *name*, or specified as a :term:`file object` *fileobj* with a file descriptor. *name* may be a :term:`path-like object`. If given, *arcname* specifies an alternative name for the file in the archive, otherwise, the name is taken from *fileobj*’s :attr:`~io.FileIO.name` attribute, or the *name* argument. The name should be a text string.
fr: Crée un objet :class:`TarInfo` à partir du résultat de :func:`os.stat` ou équivalent sur un fichier existant. Le fichier est soit nommé par *name*, soit spécifié comme :term:`file object` *fileobj* avec un descripteur de fichier. *name* peut être un :term:`objet` semblable à un chemin. S'il est donné, *arcname* spécifie un autre nom pour le fichier dans l'archive, sinon, le nom est tiré de l'attribut *fileobj* :attr:`~io.FileIO.name`, ou de l'argument *name*. Le nom doit être une chaîne de texte.

source: You can modify some of the :class:`TarInfo`’s attributes before you add it using :meth:`addfile`. If the file object is not an ordinary file object positioned at the beginning of the file, attributes such as :attr:`~TarInfo.size` may need modifying. This is the case for objects such as :class:`~gzip.GzipFile`. The :attr:`~TarInfo.name` may also be modified, in which case *arcname* could be a dummy string.
fr: Vous pouvez modifier certains des attributs de :class:`TarInfo` avant de les ajouter en utilisant :meth:`addfile`. Si l'objet fichier n'est pas un objet fichier ordinaire positionné au début du fichier, des attributs tels que :attr:`~TarInfo.size` peuvent nécessiter une modification. C'est le cas pour des objets tels que :class:`~gzip.GzipFile`. Le :attr:`~TarInfo.name` peut également être modifié, auquel cas *arcname* pourrait être une chaîne factice.

source: Close the :class:`TarFile`. In write mode, two finishing zero blocks are appended to the archive.
fr: Ferme le :class:`TarFile`. En mode écriture, deux blocs de finition à zéro sont ajoutés à l'archive.

source: A dictionary containing key-value pairs of pax global headers.
fr: Un dictionnaire contenant des paires clé-valeur d'en-têtes globaux *pax*.

source: TarInfo Objects
fr: Les objets *TarInfo*

source: A :class:`TarInfo` object represents one member in a :class:`TarFile`. Aside from storing all required attributes of a file (like file type, size, time, permissions, owner etc.), it provides some useful methods to determine its type. It does *not* contain the file's data itself.
fr: Un objet :class:`TarInfo` représente un membre dans un :class:`TarFile`. En plus de stocker tous les attributs requis d'un fichier (comme le type de fichier, la taille, l'heure, les autorisations, le propriétaire, etc.), il fournit quelques méthodes utiles pour déterminer son type. Il ne contient pas les données du fichier lui-même.

source: :class:`TarInfo` objects are returned by :class:`TarFile`'s methods :meth:`getmember`, :meth:`getmembers` and :meth:`gettarinfo`.
fr: Les objets :class:`TarInfo` sont renvoyés par les méthodes de :class:`TarFile` :meth:`getmember`, :meth:`getmembers` et :meth:`gettarinfo`.

source: Create a :class:`TarInfo` object.
fr: Crée un objet :class:`TarInfo`.

source: Create and return a :class:`TarInfo` object from string buffer *buf*.
fr: Crée et renvoie un objet :class:`TarInfo` à partir de la chaîne tampon *buf*.

source: Raises :exc:`HeaderError` if the buffer is invalid.
fr: Lève :exc:`HeaderError` si le tampon n'est pas valide.

source: Read the next member from the :class:`TarFile` object *tarfile* and return it as a :class:`TarInfo` object.
fr: Lit le membre suivant dans l'objet :class:`TarFile` *tarfile* et le renvoie comme un objet :class:`TarInfo`.

source: Create a string buffer from a :class:`TarInfo` object. For information on the arguments see the constructor of the :class:`TarFile` class.
fr: Crée un tampon de chaîne de caractères à partir d'un objet :class:`TarInfo`. Pour plus d'informations sur les arguments, voir le constructeur de la classe :class:`TarFile`.

source: A ``TarInfo`` object has the following public data attributes:
fr: Un objet ``TarInfo`` a les attributs de données publics suivants :

source: Name of the archive member.
fr: Nom du membre de l'archive.

source: Size in bytes.
fr: La taille en octets.

source: Time of last modification.
fr: L'heure de la dernière modification.

source: Permission bits.
fr: Bits d'autorisation.

source: File type. *type* is usually one of these constants: :const:`REGTYPE`, :const:`AREGTYPE`, :const:`LNKTYPE`, :const:`SYMTYPE`, :const:`DIRTYPE`, :const:`FIFOTYPE`, :const:`CONTTYPE`, :const:`CHRTYPE`, :const:`BLKTYPE`, :const:`GNUTYPE_SPARSE`. To determine the type of a :class:`TarInfo` object more conveniently, use the ``is*()`` methods below.
fr: Type de fichier. *type* est généralement l'une des constantes suivantes : :const:`REGTYPE`, :const:`AREGTYPE`, :const:`LNKTYPE`, :const:`SYMTYPE`, :const:`DIRTYPE`, :const:`FIFOTYPE`, :const:`CONTTYPE`, :const:`CHRTYPE`, :const:`BLKTYPE`, :const:`GNUTYPE_SPARSE`. Pour déterminer plus facilement le type d'un objet :class:`TarInfo`, utilisez les méthodes ``is*()`` ci-dessous.

source: Name of the target file name, which is only present in :class:`TarInfo` objects of type :const:`LNKTYPE` and :const:`SYMTYPE`.
fr: Nom du fichier cible, qui n'est présent que dans les objets :class:`TarInfo` de type :const:`LNKTYPE` et :const:`SYMTYPE`.

source: User ID of the user who originally stored this member.
fr: ID de l'utilisateur qui a initialement stocké ce membre.

source: Group ID of the user who originally stored this member.
fr: ID de groupe de l'utilisateur qui a initialement stocké ce membre.

source: User name.
fr: Nom d'utilisateur.

source: Group name.
fr: Nom de groupe.

source: A dictionary containing key-value pairs of an associated pax extended header.
fr: Un dictionnaire contenant des paires clé-valeur d'un en-tête étendu *pax* associé.

source: A :class:`TarInfo` object also provides some convenient query methods:
fr: Un objet :class:`TarInfo` fournit également des méthodes de requête pratiques :

source: Return :const:`True` if the :class:`Tarinfo` object is a regular file.
fr: Renvoie :const:`True` si l'objet :class:`Tarinfo` est un fichier normal.

source: Same as :meth:`isfile`.
fr: Identique à :meth:`isfile`.

source: Return :const:`True` if it is a directory.
fr: Renvoie :const:`True` si c'est un dossier.

source: Return :const:`True` if it is a symbolic link.
fr: Renvoie :const:`True` s'il s'agit d'un lien symbolique.

source: Return :const:`True` if it is a hard link.
fr: Renvoie :const:`True` s'il s'agit d'un lien physique.

source: Return :const:`True` if it is a character device.
fr: Renvoie :const:`True` s'il s'agit d'un périphérique de caractères.

source: Return :const:`True` if it is a block device.
fr: Renvoie :const:`True` s'il s'agit d'un périphérique de bloc.

source: Return :const:`True` if it is a FIFO.
fr: Renvoie :const:`True` s'il s'agit d'un tube nommé (*FIFO*).

source: Return :const:`True` if it is one of character device, block device or FIFO.
fr: Renvoie :const:`True` s'il s'agit d'un périphérique de caractères, d'un périphérique de bloc ou d'un tube nommé.

source: Command-Line Interface
fr: Interface en ligne de commande

source: The :mod:`tarfile` module provides a simple command-line interface to interact with tar archives.
fr: Le module :mod:`tarfile` fournit une interface de ligne de commande simple pour interagir avec les archives *tar*.

source: If you want to create a new tar archive, specify its name after the :option:`-c` option and then list the filename(s) that should be included:
fr: Si vous souhaitez créer une nouvelle archive *tar*, spécifiez son nom après l'option :option:`-c`, puis répertorie-le ou les noms de fichiers à inclure :

source: Passing a directory is also acceptable:
fr: Passer un répertoire est aussi possible :

source: If you want to extract a tar archive into the current directory, use the :option:`-e` option:
fr: Si vous souhaitez extraire une archive *tar* dans le répertoire courant, utilisez l'option :option:`-e` :

source: You can also extract a tar archive into a different directory by passing the directory's name:
fr: Vous pouvez également extraire une archive *tar* dans un autre répertoire en passant le nom du répertoire :

source: For a list of the files in a tar archive, use the :option:`-l` option:
fr: Pour une liste des fichiers dans une archive *tar*, utilisez l'option :option:`-l` :

source: Command-line options
fr: Options de la ligne de commande

source: List files in a tarfile.
fr: Liste les fichiers dans une archive *tar*.

source: Create tarfile from source files.
fr: Crée une archive *tar* à partir des fichiers sources.

source: Extract tarfile into the current directory if *output_dir* is not specified.
fr: Extrait l'archive *tar* dans le répertoire courant si *output_dir* n'est pas spécifié.

source: Test whether the tarfile is valid or not.
fr: Teste si l'archive *tar* est valide ou non.

source: Verbose output.
fr: Sortie verbeuse.

source: Examples
fr: Exemples

source: How to extract an entire tar archive to the current working directory::
fr: Comment extraire une archive *tar* dans le dossier de travail courant ::

source: How to extract a subset of a tar archive with :meth:`TarFile.extractall` using a generator function instead of a list::
fr: Comment extraire un sous-ensemble d'une archive *tar* avec :meth:`TarFile.extractall` en utilisant une fonction de générateur au lieu d'une liste ::

source: How to create an uncompressed tar archive from a list of filenames::
fr: Comment créer une archive *tar* non compressée à partir d'une liste de noms de fichiers ::

source: The same example using the :keyword:`with` statement::
fr: Le même exemple en utilisant l'instruction :keyword:`with` ::

source: How to read a gzip compressed tar archive and display some member information::
fr: Comment lire une archive *tar* compressée avec *gzip* et afficher des informations des membres ::

source: How to create an archive and reset the user information using the *filter* parameter in :meth:`TarFile.add`::
fr: Comment créer une archive et réinitialiser les informations de l'utilisateur en utilisant le paramètre *filter* dans :meth:`TarFile.add` ::

source: Supported tar formats
fr: Formats *tar* pris en charge

source: There are three tar formats that can be created with the :mod:`tarfile` module:
fr: Il existe trois formats *tar* qui peuvent être créés avec le module :mod:`tarfile` :

source: The POSIX.1-1988 ustar format (:const:`USTAR_FORMAT`). It supports filenames up to a length of at best 256 characters and linknames up to 100 characters. The maximum file size is 8 GiB. This is an old and limited but widely supported format.
fr: Le format *POSIX.1-1988* *ustar* (:const:`ustar_FORMAT`). Il prend en charge les noms de fichiers jusqu'à une longueur maximale de 256 caractères et les noms de liens jusqu'à 100 caractères. La taille maximale du fichier est de 8 Go. Il s'agit d'un format ancien et limité mais largement pris en charge.

source: The GNU tar format (:const:`GNU_FORMAT`). It supports long filenames and linknames, files bigger than 8 GiB and sparse files. It is the de facto standard on GNU/Linux systems. :mod:`tarfile` fully supports the GNU tar extensions for long names, sparse file support is read-only.
fr: Le format GNU *tar* (:const:`GNU_FORMAT`). Il prend en charge les noms de fichiers longs et les noms de liens, les fichiers supérieurs à 8 Go et les fichiers discontinus. C'est la norme de facto des systèmes GNU / Linux. :mod:`tarfile` prend entièrement en charge les extensions GNU *tar* pour les noms longs, la prise en charge des fichiers discontinus est en lecture seule.

source: It extends the existing *ustar* format with extra headers for information that cannot be stored otherwise. There are two flavours of pax headers: Extended headers only affect the subsequent file header, global headers are valid for the complete archive and affect all following files. All the data in a pax header is encoded in *UTF-8* for portability reasons.
fr: Il étend le format *ustar* existant avec des en-têtes supplémentaires pour les informations qui ne peuvent pas être stockées autrement. Il existe deux types d'en-têtes *pax* : les en-têtes étendus n'affectent que l'en-tête de fichier suivant, les en-têtes globaux sont valides pour l'archive complète et affectent tous les fichiers suivants. Toutes les données d'un en-tête *pax* sont encodées en *UTF-8* pour des raisons de portabilité.

source: There are some more variants of the tar format which can be read, but not created:
fr: Il existe d'autres variantes du format *tar* qui peuvent être lues, mais pas créées

source: The ancient V7 format. This is the first tar format from Unix Seventh Edition, storing only regular files and directories. Names must not be longer than 100 characters, there is no user/group name information. Some archives have miscalculated header checksums in case of fields with non-ASCII characters.
fr: L'ancien format *V7*. Il s'agit du premier format *tar* d'*Unix Seventh Edition*, ne stockant que des fichiers et répertoires normaux. Les noms ne doivent pas dépasser 100 caractères, il n'y a aucune information de nom d'utilisateur / groupe. Certaines archives ont des sommes de contrôle d'en-tête mal calculées dans le cas de champs avec des caractères non ASCII.

source: The SunOS tar extended format. This format is a variant of the POSIX.1-2001 pax format, but is not compatible.
fr: Format étendu *SunOS* *tar*. Ce format est une variante du format *POSIX.1-2001* *pax*, mais n'est pas compatible.

source: Unicode issues
fr: Problèmes *unicode*

source: The tar format was originally conceived to make backups on tape drives with the main focus on preserving file system information. Nowadays tar archives are commonly used for file distribution and exchanging archives over networks. One problem of the original format (which is the basis of all other formats) is that there is no concept of supporting different character encodings. For example, an ordinary tar archive created on a *UTF-8* system cannot be read correctly on a *Latin-1* system if it contains non-*ASCII* characters. Textual metadata (like filenames, linknames, user/group names) will appear damaged. Unfortunately, there is no way to autodetect the encoding of an archive. The pax format was designed to solve this problem. It stores non-ASCII metadata using the universal character encoding *UTF-8*.
fr: Le format *tar* a été initialement conçu pour effectuer des sauvegardes sur des lecteurs de bande en mettant principalement l'accent sur la préservation des informations du système de fichiers. De nos jours, les archives *tar* sont couramment utilisées pour la distribution de fichiers et l'échange d'archives sur des réseaux. Un problème du format d'origine (qui est la base de tous les autres formats) est qu'il n'existe aucun concept de prise en charge d'encodages de caractères différents. Par exemple, une archive *tar* ordinaire créée sur un système *UTF-8* ne peut pas être lue correctement sur un système *Latin-1* si elle contient des caractères non *ASCII*. Les métadonnées textuelles (comme les noms de fichiers, les noms de liens, les noms d'utilisateurs / de groupes) sembleront endommagées. Malheureusement, il n'y a aucun moyen de détecter automatiquement l'encodage d'une archive. Le format *pax* a été conçu pour résoudre ce problème. Il stocke les métadonnées non ASCII en utilisant l'encodage universel des caractères *UTF-8*.

source: The details of character conversion in :mod:`tarfile` are controlled by the *encoding* and *errors* keyword arguments of the :class:`TarFile` class.
fr: Les détails de la conversion des caractères dans :mod:`tarfile` sont contrôlés par les arguments nommés *encoding* et *errors* de la classe :class:`TarFile`.

source: *encoding* defines the character encoding to use for the metadata in the archive. The default value is :func:`sys.getfilesystemencoding` or ``'ascii'`` as a fallback. Depending on whether the archive is read or written, the metadata must be either decoded or encoded. If *encoding* is not set appropriately, this conversion may fail.
fr: *encoding* définit l'encodage de caractères à utiliser pour les métadonnées de l'archive. La valeur par défaut est :func:`sys.getfilesystemencoding` ou ``'ascii'`` comme solution de rechange. Selon que l'archive est lue ou écrite, les métadonnées doivent être décodées ou encodées. Si l'encodage n'est pas défini correctement, cette conversion peut échouer.

source: The *errors* argument defines how characters are treated that cannot be converted. Possible values are listed in section :ref:`error-handlers`. The default scheme is ``'surrogateescape'`` which Python also uses for its file system calls, see :ref:`os-filenames`.
fr: L'argument *errors* définit le traitement des caractères qui ne peuvent pas être convertis. Les valeurs possibles sont répertoriées dans la section :ref:`error-handlers`. Le schéma par défaut est ``'surrogateescape'`` que Python utilise également pour ses appels de système de fichiers, voir :ref:`os-filenames`.
