Repository: python/python-docs-fr
Catalog: library/tarfile.po
Languages: fr

source: :mod:`tarfile` --- Read and write tar archive files
fr: :mod:`tarfile` — Lecture et écriture de fichiers d'archives **tar**

source: **Source code:** :source:`Lib/tarfile.py`
fr: **Code source :** :source:`Lib/tarfile.py`

source: The :mod:`tarfile` module makes it possible to read and write tar archives, including those using gzip, bz2 and lzma compression. Use the :mod:`zipfile` module to read or write :file:`.zip` files, or the higher-level functions in :ref:`shutil <archiving-operations>`.
fr: Le module :mod:`tarfile` rend possible la lecture et l'écriture des archives *tar*, incluant celles utilisant la compression *gzip*, *bz2* et *lzma*. Utilisez le module :mod:`zipfile` pour lire ou écrire des fichiers :file:`zip`, ou les fonctions de niveau supérieur dans :ref:`shutil <archiving-operations>`.

source: Some facts and figures:
fr: Quelques faits et chiffres :

source: reads and writes :mod:`gzip`, :mod:`bz2` and :mod:`lzma` compressed archives if the respective modules are available.
fr: lit et écrit des archives compressées avec :mod:`gzip`, :mod:`bz2` ou :mod:`lzma` si les modules respectifs sont disponibles.

source: read/write support for the POSIX.1-1988 (ustar) format.
fr: prise en charge de la lecture/écriture pour le format *POSIX.1-1988* (*ustar*).

source: read/write support for the GNU tar format including *longname* and *longlink* extensions, read-only support for all variants of the *sparse* extension including restoration of sparse files.
fr: prise en charge de la lecture/écriture pour le format GNU *tar* incluant les extensions *longname* et *longlink*, prise en charge de la lecture seule de toutes les variantes de l'extension *sparse* incluant la restauration des fichiers discontinus.

source: read/write support for the POSIX.1-2001 (pax) format.
fr: prise en charge de la lecture/écriture pour le format *POSIX.1-2001* (*pax*).

source: handles directories, regular files, hardlinks, symbolic links, fifos, character devices and block devices and is able to acquire and restore file information like timestamp, access permissions and owner.
fr: gère les répertoires, les fichiers normaux, les liens directs (*hard links* en anglais), les liens symboliques, les tubes nommés (*FIFO* en anglais), les périphériques de caractère et les périphériques de bloc et est en mesure d'acquérir et de restaurer les informations du fichier comme l'horodatage, les autorisations d'accès et le propriétaire.

source: Added support for :mod:`lzma` compression.
fr: prise en charge de la compression :mod:`lzma`.

source: Return a :class:`TarFile` object for the pathname *name*. For detailed information on :class:`TarFile` objects and the keyword arguments that are allowed, see :ref:`tarfile-objects`.
fr: Renvoie un objet :class:`TarFile` pour le nom de chemin *name*. Pour plus d'informations sur les objets :class:`TarFile` et les mot-clefs arguments permis, voir :ref:`tarfile-objects`.

source: *mode* has to be a string of the form ``'filemode[:compression]'``, it defaults to ``'r'``. Here is a full list of mode combinations:
fr: Le *mode* doit être une chaîne de caractères de la forme ``'filemode[:compression]'``, par défaut à ``'r'``. Voici une liste complète des combinaisons de mode :

source: ``'r' or 'r:*'``
fr: ``'r' ou 'r:*'``

source: Open for reading with transparent compression (recommended).
fr: Ouvre en lecture avec compression transparente (recommandé).

source: Open for reading exclusively without compression.
fr: Ouvre en lecture, sans compression.

source: Open for reading with gzip compression.
fr: Ouvre en lecture avec la compression *gzip*.

source: Open for reading with bzip2 compression.
fr: Ouvre en lecture avec la compression *bzip2*.

source: Open for reading with lzma compression.
fr: Ouvre en lecture avec la compression *lzma*.

source: ``'x'`` or ``'x:'``
fr: ``'x'`` ou ``'x:'``

source: Create a tarfile exclusively without compression. Raise an :exc:`FileExistsError` exception if it already exists.
fr: Crée un fichier *tar* sans compression. Lève une exception :exc:`FileExistsError` s'il existe déjà.

source: Create a tarfile with gzip compression. Raise an :exc:`FileExistsError` exception if it already exists.
fr: Crée un fichier *tar* avec la compression *gzip*. Lève une exception :exc:`FileExistsError` s'il existe déjà.

source: Create a tarfile with bzip2 compression. Raise an :exc:`FileExistsError` exception if it already exists.
fr: Crée un fichier *tar* avec la compression *bzip2*. Lève une exception :exc:`FileExistsError` s'il existe déjà.

source: Create a tarfile with lzma compression. Raise an :exc:`FileExistsError` exception if it already exists.
fr: Crée un fichier *tar* avec la compression *lzma*. Lève une exception :exc:`FileExistsError` s'il existe déjà.

source: ``'a' or 'a:'``
fr: ``'a' ou 'a:'``

source: Open for appending with no compression. The file is created if it does not exist.
fr: Ouvre pour ajouter à la fin, sans compression. Le fichier est créé s'il n'existe pas.

source: ``'w' or 'w:'``
fr: ``'w' ou 'w:'``

source: Open for uncompressed writing.
fr: Ouvre en écriture, sans compression.

source: Open for gzip compressed writing.
fr: Ouvre en écriture avec compression *gzip*.

source: Open for bzip2 compressed writing.
fr: Ouvre en écriture avec compression *bzip2*.

source: Open for lzma compressed writing.
fr: Ouvre en écriture avec la compression *lzma*.

source: Note that ``'a:gz'``, ``'a:bz2'`` or ``'a:xz'`` is not possible. If *mode* is not suitable to open a certain (compressed) file for reading, :exc:`ReadError` is raised. Use *mode* ``'r'`` to avoid this. If a compression method is not supported, :exc:`CompressionError` is raised.
fr: Notez que les combinaisons ``'a:gz'``, ``'a:bz2'`` ou ``'a:xz'`` ne sont pas possibles. Si le mode n'est pas adapté pour ouvrir un certain fichier (compressé) pour la lecture, une exception :exc:`ReadError` est levée. Utilisez le mode ``'r'`` pour éviter cela. Si une méthode de compression n'est pas prise en charge, :exc:`CompressionError` est levée.

source: If *fileobj* is specified, it is used as an alternative to a :term:`file object` opened in binary mode for *name*. It is supposed to be at position 0.
fr: Si *fileobj* est spécifié, il est utilisé comme une alternative au :term:`file object` ouvert en mode binaire pour *name*. Il est censé être à la position 0.

source: For modes ``'w:gz'``, ``'r:gz'``, ``'w:bz2'``, ``'r:bz2'``, ``'x:gz'``, ``'x:bz2'``, :func:`tarfile.open` accepts the keyword argument *compresslevel* (default ``9``) to specify the compression level of the file.
fr: Pour les modes ``'w:gz'``, ``'r:gz'``, ``'w:bz2'``, ``'r:bz2'``, ``'x:gz'``, ``'x:bz2'``, :func:`tarfile.open` accepte l'argument nommé *compresslevel* (par défaut à ``9``) pour spécifier le niveau de compression du fichier.

source: For modes ``'w:xz'`` and ``'x:xz'``, :func:`tarfile.open` accepts the keyword argument *preset* to specify the compression level of the file.
fr: Pour les modes ``'w:xz'`` et ``'x:xz'``, :func:`tarfile.open` accepte l'argument nommé *preset* pour spécifier le niveau de compression du fichier.

source: For special purposes, there is a second format for *mode*: ``'filemode|[compression]'``. :func:`tarfile.open` will return a :class:`TarFile` object that processes its data as a stream of blocks. No random seeking will be done on the file. If given, *fileobj* may be any object that has a :meth:`read` or :meth:`write` method (depending on the *mode*). *bufsize* specifies the blocksize and defaults to ``20 * 512`` bytes. Use this variant in combination with e.g. ``sys.stdin``, a socket :term:`file object` or a tape device. However, such a :class:`TarFile` object is limited in that it does not allow random access, see :ref:`tar-examples`. The currently possible modes:
fr: Pour des cas particuliers, il existe un deuxième format pour le *mode* : ``'filemode[compression]'``. :func:`tarfile.open` renvoie un objet :class:`TarFile` qui traite ses données comme un flux de blocs. Aucun retour en arrière ne sera effectué lors de la lecture du fichier. S'il est donné, *fileobj* peut être n'importe quel objet qui a une méthode :meth:`read` ou :meth:`write` (selon le *mode*). Le paramètre *bufsize* spécifie la taille du bloc et vaut par défaut ``20 * 512`` octets. Utilisez cette variante en combinaison avec par exemple ``sys.stdin``, une connexion (*socket* en anglais) :term:`file object` ou un dispositif de bande. Cependant, un tel objet :class:`TarFile` est limité en ce qu'il ne permet pas l'accès aléatoire, voir :ref:`tar-examples`. Les modes actuellement possibles :

source: Open a *stream* of tar blocks for reading with transparent compression.
fr: Ouvre un *flux* des blocs de *tar* en lecture avec une compression transparente.

source: Open a *stream* of uncompressed tar blocks for reading.
fr: Ouvre un *flux* de blocs *tar* non compressés en lecture.

source: Open a gzip compressed *stream* for reading.
fr: Ouvre un flux compressé avec *gzip* en lecture.

source: Open a bzip2 compressed *stream* for reading.
fr: Ouvre un *flux* compressé avec *bzip2* en lecture.

source: Open an lzma compressed *stream* for reading.
fr: Ouvre un *flux* compressé avec *lzma* en lecture.

source: Open an uncompressed *stream* for writing.
fr: Ouvre un *flux* non compressé en écriture.

source: Open a gzip compressed *stream* for writing.
fr: Ouvre un *flux* compressé avec *gzip* en écriture.

source: Open a bzip2 compressed *stream* for writing.
fr: Ouvre un *flux* compressé avec *bzip2* en écriture.

source: Open an lzma compressed *stream* for writing.
fr: Ouvre un *flux* compressé avec *lzma* en écriture.

source: The ``'x'`` (exclusive creation) mode was added.
fr: le mode ``'x'`` (création exclusive) a été ajouté.

source: The *name* parameter accepts a :term:`path-like object`.
fr: le paramètre *name* accepte un :term:`path-like object`.

source: Class for reading and writing tar archives. Do not use this class directly: use :func:`tarfile.open` instead. See :ref:`tarfile-objects`.
fr: Classe pour la lecture et l'écriture d'archives *tar*. N'utilisez pas cette classe directement, préférez :func:`tarfile.open`. Voir :ref:`tarfile-objects`.

source: Return :const:`True` if *name* is a tar archive file, that the :mod:`tarfile` module can read. *name* may be a :class:`str`, file, or file-like object.
fr: Renvoie :const:`True` si *name* est un fichier d'archive *tar*, que le module :mod:`tarfile` peut lire. *name* peut être une :class:`str`, un ficher ou un objet fichier-compatible.

source: Support for file and file-like objects.
fr: Prise en charge des fichiers et des objets fichier-compatibles.

source: The :mod:`tarfile` module defines the following exceptions:
fr: Le module :mod:`tarfile` définit les exceptions suivantes :

source: Base class for all :mod:`tarfile` exceptions.
fr: Classe de base pour toutes les exceptions du module :mod:`tarfile`.

source: Is raised when a tar archive is opened, that either cannot be handled by the :mod:`tarfile` module or is somehow invalid.
fr: Est levée lors de l'ouverture d'une archive *tar*, qui ne peut pas être gérée par le module :mod:`tarfile` ou est invalide.

source: Is raised when a compression method is not supported or when the data cannot be decoded properly.
fr: Est levée lorsqu'une méthode de compression n'est pas prise en charge ou lorsque les données ne peuvent pas être décodées correctement.

source: Is raised for the limitations that are typical for stream-like :class:`TarFile` objects.
fr: Est levée pour les limitations typiques des objets de type flux :class:`TarFile`.

source: Is raised for *non-fatal* errors when using :meth:`TarFile.extract`, but only if :attr:`TarFile.errorlevel`\ ``== 2``.
fr: Est levée pour des erreurs *non-fatales* lors de l'utilisation de :meth:`TarFile.extract`, mais uniquement si :attr:`TarFile.errorlevel`\ ``== 2``.

source: Is raised by :meth:`TarInfo.frombuf` if the buffer it gets is invalid.
fr: Est levée par :meth:`TarInfo.frombuf` si le tampon qu'il obtient n'est pas valide.

source: The following constants are available at the module level:
fr: Les constantes suivantes sont disponibles au niveau du module :

source: The default character encoding: ``'utf-8'`` on Windows, the value returned by :func:`sys.getfilesystemencoding` otherwise.
fr: L'encodage des caractères par défaut est ``'utf-8'`` sous Windows, sinon la valeur renvoyée par :func:`sys.getfilesystemencoding`.

source: Each of the following constants defines a tar archive format that the :mod:`tarfile` module is able to create. See section :ref:`tar-formats` for details.
fr: Chacune des constantes suivantes définit un format d'archive *tar* que le module :mod:`tarfile` est capable de créer. Voir la section :ref:`tar-formats` pour plus de détails.

source: POSIX.1-1988 (ustar) format.
fr: Le format *POSIX.1-1988* (*ustar*).

source: GNU tar format.
fr: Le format GNU *tar*.

source: POSIX.1-2001 (pax) format.
fr: Le format *POSIX.1-2001* (*pax*).

source: The default format for creating archives. This is currently :const:`PAX_FORMAT`.
fr: Format par défaut pour la création d'archives. C'est actuellement :const:`PAX_FORMAT`.

source: The default format for new archives was changed to :const:`PAX_FORMAT` from :const:`GNU_FORMAT`.
fr: Le format par défaut des nouvelles archives a été changé de :const:`GNU_FORMAT` en :const:`PAX_FORMAT`.

source: Documentation of the :mod:`zipfile` standard module.
fr: Documentation du module standard :mod:`zipfile`.

source: Documentation of the higher-level archiving facilities provided by the standard :mod:`shutil` module.
fr: Documentation des outils d'archivage de haut niveau fournis par le module standard :mod:`shutil`.

source: `GNU tar manual, Basic Tar Format <https://www.gnu.org/software/tar/manual/html_node/Standard.html>`_
fr: `Manuel GNU *tar*, format *tar* basique (en anglais) <https://www.gnu.org/software/tar/manual/html_node/Standard.html>`_

source: Documentation for tar archive files, including GNU tar extensions.
fr: Documentation pour les fichiers d'archive *tar*, y compris les extensions *tar* GNU.

source: TarFile Objects
fr: Les objets *TarFile*

source: The :class:`TarFile` object provides an interface to a tar archive. A tar archive is a sequence of blocks. An archive member (a stored file) is made up of a header block followed by data blocks. It is possible to store a file in a tar archive several times. Each archive member is represented by a :class:`TarInfo` object, see :ref:`tarinfo-objects` for details.
fr: L'objet :class:`TarFile` fournit une interface vers une archive *tar*. Une archive *tar* est une séquence de blocs. Un membre d'archive (un fichier stocké) est composé d'un bloc d'en-tête suivi des blocs de données. Il est possible de stocker plusieurs fois un fichier dans une archive *tar*. Chaque membre d'archive est représenté par un objet :class:`TarInfo`, voir :ref:`tarinfo-objects` pour plus de détails.

source: A :class:`TarFile` object can be used as a context manager in a :keyword:`with` statement. It will automatically be closed when the block is completed. Please note that in the event of an exception an archive opened for writing will not be finalized; only the internally used file object will be closed. See the :ref:`tar-examples` section for a use case.
fr: Un objet :class:`TarFile` peut être utilisé comme gestionnaire de contexte dans une instruction :keyword:`with`. Il sera automatiquement fermé une fois le bloc terminé. Veuillez noter qu'en cas d'exception, une archive ouverte en écriture ne sera pas finalisée ; seul l'objet fichier utilisé en interne sera fermé. Voir la section :ref:`tar-examples` pour un cas d'utilisation.

source: Added support for the context management protocol.
fr: Ajout de la prise en charge du protocole de gestion de contexte.

source: All following arguments are optional and can be accessed as instance attributes as well.
fr: Tous les arguments suivants sont facultatifs et sont également accessibles en tant qu'instance d'attributs.

source: *name* is the pathname of the archive. *name* may be a :term:`path-like object`. It can be omitted if *fileobj* is given. In this case, the file object's :attr:`name` attribute is used if it exists.
fr: Le *name* est le chemin d'accès de l'archive. *name* peut être un :term:`path-like object`. Il peut être omis si *fileobj* est donné. Dans ce cas, l'attribut :attr:`name` de l'objet fichier est utilisé s'il existe.

source: *mode* is either ``'r'`` to read from an existing archive, ``'a'`` to append data to an existing file, ``'w'`` to create a new file overwriting an existing one, or ``'x'`` to create a new file only if it does not already exist.
fr: Le *mode* est soit ``'r'`` pour lire à partir d'une archive existante, ``'a'`` pour ajouter des données à un fichier existant, ``'w'`` pour créer un nouveau fichier en écrasant un existant, ou ``'x'`` pour créer un nouveau fichier uniquement s'il n'existe pas déjà.

source: If *fileobj* is given, it is used for reading or writing data. If it can be determined, *mode* is overridden by *fileobj*'s mode. *fileobj* will be used from position 0.
fr: Si *fileobj* est fourni, il est utilisé pour lire ou écrire des données. S'il peut être déterminé, le *mode* est remplacé par le mode de *fileobj*. *fileobj* sera utilisé à partir de la position 0.

source: *fileobj* is not closed, when :class:`TarFile` is closed.
fr: *fileobj* n'est pas fermé, lorsque :class:`TarFile` est fermé.

source: *format* controls the archive format for writing. It must be one of the constants :const:`USTAR_FORMAT`, :const:`GNU_FORMAT` or :const:`PAX_FORMAT` that are defined at module level. When reading, format will be automatically detected, even if different formats are present in a single archive.
fr: Le *format* contrôle le format d'archive en écriture. Il doit s'agir de l'une des constantes :const:`USTAR_FORMAT`, :const:`GNU_FORMAT` ou :const:`PAX_FORMAT` définies au niveau du module. Lors de la lecture, le format sera automatiquement détecté, même si différents formats sont présents dans une même archive.

source: The *tarinfo* argument can be used to replace the default :class:`TarInfo` class with a different one.
fr: L'argument *tarinfo* peut être utilisé pour remplacer la classe par défaut :class:`TarInfo` par une autre.

source: If *dereference* is :const:`False`, add symbolic and hard links to the archive. If it is :const:`True`, add the content of the target files to the archive. This has no effect on systems that do not support symbolic links.
fr: Si *dereference* est :const:`False`, ajoute des liens symboliques et physiques à l'archive. Si c'est :const:`True`, ajoute le contenu des fichiers cibles à l'archive. Cela n'a aucun effet sur les systèmes qui ne prennent pas en charge les liens symboliques.

source: If *ignore_zeros* is :const:`False`, treat an empty block as the end of the archive. If it is :const:`True`, skip empty (and invalid) blocks and try to get as many members as possible. This is only useful for reading concatenated or damaged archives.
fr: Si *ignore_zeros* est :const:`False`, traite un bloc vide comme la fin de l'archive. Si c'est le cas :const:`True`, saute les blocs vides (et invalides) et essaye d'obtenir autant de membres que possible. Ceci n'est utile que pour lire des archives concaténées ou endommagées.

source: *debug* can be set from ``0`` (no debug messages) up to ``3`` (all debug messages). The messages are written to ``sys.stderr``.
fr: *debug* peut être défini de ``0`` (aucun message de débogage) à ``3`` (tous les messages de débogage). Les messages sont écrits dans ``sys.stderr``.

source: If *errorlevel* is ``0``, all errors are ignored when using :meth:`TarFile.extract`. Nevertheless, they appear as error messages in the debug output, when debugging is enabled. If ``1``, all *fatal* errors are raised as :exc:`OSError` exceptions. If ``2``, all *non-fatal* errors are raised as :exc:`TarError` exceptions as well.
fr: Si *errorlevel* est ``0``, toutes les erreurs sont ignorées lors de l'utilisation de :meth:`TarFile.extract`. Néanmoins, ils apparaissent comme des messages d'erreur dans la sortie de débogage, lorsque le débogage est activé. Si ``1``, toutes les erreurs *fatales* sont déclenchées comme des exceptions :exc:`OSError`. Si ``2``, toutes les erreurs *non-fatales* sont déclenchées comme des exceptions :exc:`TarError` également.

source: The *encoding* and *errors* arguments define the character encoding to be used for reading or writing the archive and how conversion errors are going to be handled. The default settings will work for most users. See section :ref:`tar-unicode` for in-depth information.
fr: Les arguments *encoding* et *errors* définissent l'encodage de caractères à utiliser pour lire ou écrire l'archive et comment les erreurs de conversion vont être traitées. Les paramètres par défaut fonctionneront pour la plupart des utilisateurs. Voir la section :ref:`tar-unicode` pour des informations détaillées.

source: The *pax_headers* argument is an optional dictionary of strings which will be added as a pax global header if *format* is :const:`PAX_FORMAT`.
fr: L'argument *pax_headers* est un dictionnaire facultatif de chaînes de caractères qui sera ajouté en tant qu'en-tête global *pax* si le *format* est :const:`PAX_FORMAT`.

source: Use ``'surrogateescape'`` as the default for the *errors* argument.
fr: Utilise ``'surrogateescape'`` comme valeur par défaut pour l'argument *errors*.

source: Alternative constructor. The :func:`tarfile.open` function is actually a shortcut to this classmethod.
fr: Constructeur alternatif. La fonction :func:`tarfile.open` est en fait un raccourci vers cette méthode de classe.

source: Return a :class:`TarInfo` object for member *name*. If *name* can not be found in the archive, :exc:`KeyError` is raised.
fr: Renvoie un objet :class:`TarInfo` pour le membre *name*. Si *name* est introuvable dans l'archive, :exc:`KeyError` est levée.

source: If a member occurs more than once in the archive, its last occurrence is assumed to be the most up-to-date version.
fr: Si un membre apparaît plus d'une fois dans l'archive, sa dernière occurrence est supposée être la version la plus récente.

source: Return the members of the archive as a list of :class:`TarInfo` objects. The list has the same order as the members in the archive.
fr: Renvoie les membres de l'archive sous la forme d'une liste d'objets :class:`TarInfo`. La liste a le même ordre que les membres de l'archive.

source: Return the members as a list of their names. It has the same order as the list returned by :meth:`getmembers`.
fr: Renvoie les membres comme une liste de leurs noms. Il a le même ordre que la liste renvoyée par :meth:`getmembers`.

source: Print a table of contents to ``sys.stdout``. If *verbose* is :const:`False`, only the names of the members are printed. If it is :const:`True`, output similar to that of :program:`ls -l` is produced. If optional *members* is given, it must be a subset of the list returned by :meth:`getmembers`.
fr: Imprime une table des matières dans ``sys.stdout``. Si *verbose* est :const:`False`, seuls les noms des membres sont imprimés. Si c'est :const:`True`, une sortie similaire à celle de :program:`ls -l` est produite. Si des *membres* facultatifs sont fournis, il doit s'agir d'un sous-ensemble de la liste renvoyée par :meth:`getmembers`.

source: Added the *members* parameter.
fr: Ajout du paramètre *members*.

source: Return the next member of the archive as a :class:`TarInfo` object, when :class:`TarFile` is opened for reading. Return :const:`None` if there is no more available.
fr: Renvoie le membre suivant de l'archive en tant qu'objet :class:`TarInfo`, lorsque la classe :class:`TarFile` est ouverte en lecture. Renvoie :const:`None` s'il n'y a pas.
