Repository: python/python-docs-fr
Catalog: library/tempfile.po
Languages: fr

source: :mod:`tempfile` --- Generate temporary files and directories
fr: :mod:`tempfile` — Génération de fichiers et répertoires temporaires

source: **Source code:** :source:`Lib/tempfile.py`
fr: **Code source :** :source:`Lib/tempfile.py`

source: This module creates temporary files and directories. It works on all supported platforms. :class:`TemporaryFile`, :class:`NamedTemporaryFile`, :class:`TemporaryDirectory`, and :class:`SpooledTemporaryFile` are high-level interfaces which provide automatic cleanup and can be used as context managers. :func:`mkstemp` and :func:`mkdtemp` are lower-level functions which require manual cleanup.
fr: Ce module crée des fichiers et répertoires temporaires. Il fonctionne sur toutes les plateformes supportées. :class:`TemporaryFile`, :class:`NamedTemporaryFile`, :class:`TemporaryDirectory`, et :class:`SpooledTemporaryFile` sont des interfaces haut-niveau qui fournissent un nettoyage automatique et peuvent être utilisées comme gestionnaire de contexte. :func:`mkstemp` et :func:`mkdtemp` sont des fonctions bas-niveau qui nécessitent un nettoyage manuel.

source: All the user-callable functions and constructors take additional arguments which allow direct control over the location and name of temporary files and directories. Files names used by this module include a string of random characters which allows those files to be securely created in shared temporary directories. To maintain backward compatibility, the argument order is somewhat odd; it is recommended to use keyword arguments for clarity.
fr: Toutes les fonctions et constructeurs appelables par l'utilisateur ont des arguments additionnels qui permettent de contrôler directement le chemin et le nom des répertoires et fichiers. Les noms de fichiers utilisés par ce module incluent une chaîne de caractères aléatoires qui leur permet d'être créés de manière sécurisée dans des répertoires temporaires partagés. Afin de maintenir la compatibilité descendante, l'ordre des arguments est quelque peu étrange ; pour des questions de clarté, il est recommandé d'utiliser les arguments nommés.

source: The module defines the following user-callable items:
fr: Le module définit les éléments suivants pouvant être appelés par l'utilisateur :

source: Return a :term:`file-like object` that can be used as a temporary storage area. The file is created securely, using the same rules as :func:`mkstemp`. It will be destroyed as soon as it is closed (including an implicit close when the object is garbage collected). Under Unix, the directory entry for the file is either not created at all or is removed immediately after the file is created. Other platforms do not support this; your code should not rely on a temporary file created using this function having or not having a visible name in the file system.
fr: Renvoie un :term:`objet fichier <file-like object>` qui peut être utilisé comme une zone de stockage temporaire. Le fichier est créé de manière sécurisé, utilisant les mêmes règles que :func:`mkstemp`. Il sera détruit dès qu'il sera fermé (y compris lorsque le fichier est implicitement fermé quand il est collecté par le ramasse-miette). Sous Unix, l'entrée du répertoire n'est soit pas du tout créée, ou est supprimée immédiatement après sa création. Les autres plateformes ne gèrent pas cela, votre code ne doit pas compter sur un fichier temporaire créé en utilisant cette fonction ayant ou non un nom visible sur le système de fichier.

source: The resulting object can be used as a context manager (see :ref:`tempfile-examples`). On completion of the context or destruction of the file object the temporary file will be removed from the filesystem.
fr: L'objet résultat peut être utilisé comme un gestionnaire de contexte (voir :ref:`tempfile-examples`). Une fois le contexte ou la destruction de l'objet fichier terminé, le fichier temporaire sera supprimé du système de fichiers.

source: The *mode* parameter defaults to ``'w+b'`` so that the file created can be read and written without being closed. Binary mode is used so that it behaves consistently on all platforms without regard for the data that is stored. *buffering*, *encoding*, *errors* and *newline* are interpreted as for :func:`open`.
fr: Le paramètre *mode* vaut par défaut ``'w+b'`` afin que le fichier créé puisse être lu et écrit sans être fermé. Le mode binaire est utilisé afin que le comportement soit le même sur toutes les plateformes quelle que soit la donnée qui est stockée. *buffering*, *encoding*, *errors* et *newline* sont interprétés de la même façon que pour :func:`open`.

source: The *dir*, *prefix* and *suffix* parameters have the same meaning and defaults as with :func:`mkstemp`.
fr: Les paramètres *dir*, *prefix* et *suffix* ont la même signification et même valeur par défaut que :func:`mkstemp`.

source: The returned object is a true file object on POSIX platforms. On other platforms, it is a file-like object whose :attr:`!file` attribute is the underlying true file object.
fr: L'objet renvoyé est un véritable fichier sur les plateformes POSIX. Sur les autres plateformes, un objet fichier-compatible est retourné où l'attribut :attr:`!file` est le véritable fichier.

source: The :py:data:`os.O_TMPFILE` flag is used if it is available and works (Linux-specific, requires Linux kernel 3.11 or later).
fr: L'option :py:data:`os.O_TMPFILE` est utilisé s'il est disponible et fonctionne (Linux exclusivement, nécessite un noyau Linux 3.11 ou plus).

source: Raises an :ref:`auditing event <auditing>` ``tempfile.mkstemp`` with argument ``fullpath``.
fr: Lève un :ref:`évènement d'audit <auditing>` ``tempfile.mkstemp`` avec comme argument ``fullpath``.

source: The :py:data:`os.O_TMPFILE` flag is now used if available.
fr: L'option :py:data:`os.O_TMPFILE` est maintenant utilisé si disponible.

source: Added *errors* parameter.
fr: Le paramètre *errors* a été ajouté.

source: This function operates exactly as :func:`TemporaryFile` does, except that the file is guaranteed to have a visible name in the file system (on Unix, the directory entry is not unlinked). That name can be retrieved from the :attr:`name` attribute of the returned file-like object. Whether the name can be used to open the file a second time, while the named temporary file is still open, varies across platforms (it can be so used on Unix; it cannot on Windows NT or later). If *delete* is true (the default), the file is deleted as soon as it is closed. The returned object is always a file-like object whose :attr:`!file` attribute is the underlying true file object. This file-like object can be used in a :keyword:`with` statement, just like a normal file.
fr: Cette fonction fonctionne exactement comme :func:`TemporaryFile`, à la différence qu'il est garanti que le fichier soit visible dans le système de fichier (sur Unix, l'entrée du répertoire est supprimée). Le nom peut être récupéré depuis l'attribut :attr:`name` de l'objet fichier-compatible retourné. Le fait que le nom puisse être utilisé pour ouvrir le fichier une seconde fois, tant que le fichier temporaire nommé est toujours ouvert, varie entre les plateformes (cela peut l'être sur Unix, mais c'est impossible sur Windows NT et plus). Si *delete* est vrai (valeur par défaut), le fichier est supprimé dès qu'il est fermé. L'objet retourné est toujours un objet fichier-compatible où l'attribut :attr:`!file` est le véritable fichier. L'objet fichier-compatible peut être utilisé dans un gestionnaire de contexte (instruction :keyword:`with`), juste comme un fichier normal.

source: This function operates exactly as :func:`TemporaryFile` does, except that data is spooled in memory until the file size exceeds *max_size*, or until the file's :func:`fileno` method is called, at which point the contents are written to disk and operation proceeds as with :func:`TemporaryFile`.
fr: Cette fonction se comporte exactement comme :func:`TemporaryFile`, à l'exception que les données sont stockées en mémoire jusqu'à ce que leur taille dépasse *max_size*, ou que la méthode :func:`fileno` soit appelée. À ce moment, le contenu est écrit sur disque et le fonctionnement redevient similaire à celui de :func:`TemporaryFile`.

source: The resulting file has one additional method, :func:`rollover`, which causes the file to roll over to an on-disk file regardless of its size.
fr: Le fichier renvoyé a une méthode supplémentaire, :func:`rollover`, qui provoque la mise en écriture sur disque quelque soit la taille du fichier.

source: the truncate method now accepts a ``size`` argument.
fr: la méthode de troncature accepte maintenant un argument ``size``.

source: This function securely creates a temporary directory using the same rules as :func:`mkdtemp`. The resulting object can be used as a context manager (see :ref:`tempfile-examples`). On completion of the context or destruction of the temporary directory object the newly created temporary directory and all its contents are removed from the filesystem.
fr: Cette fonction crée un répertoire temporaire de manière sécurisée utilisant les mêmes règles que :func:`mkdtemp`. L'objet renvoyé peut être utilisé comme un gestionnaire de contexte (voir :ref:`tempfile-examples`). À la sortie du contexte d’exécution ou à la destruction de l'objet, le répertoire temporaire et tout son contenu sont supprimés du système de fichiers.

source: The directory name can be retrieved from the :attr:`name` attribute of the returned object. When the returned object is used as a context manager, the :attr:`name` will be assigned to the target of the :keyword:`!as` clause in the :keyword:`with` statement, if there is one.
fr: Le nom du répertoire peut être récupéré via l'attribut :attr:`name` de l'objet renvoyé. Quand l'objet renvoyé est utilisé comme gestionnaire de contexte, l'attribut :attr:`name` sera lié au nom donné à la clause :keyword:`!as` de l'instruction :keyword:`with`, si elle est spécifiée.

source: The directory can be explicitly cleaned up by calling the :func:`cleanup` method.
fr: Le répertoire peut être explicitement nettoyé en appelant la méthode :func:`cleanup`.

source: Raises an :ref:`auditing event <auditing>` ``tempfile.mkdtemp`` with argument ``fullpath``.
fr: Lève un :ref:`évènement d'audit <auditing>` ``tempfile.mkdtemp`` avec comme argument ``fullpath``.

source: Creates a temporary file in the most secure manner possible. There are no race conditions in the file's creation, assuming that the platform properly implements the :const:`os.O_EXCL` flag for :func:`os.open`. The file is readable and writable only by the creating user ID. If the platform uses permission bits to indicate whether a file is executable, the file is executable by no one. The file descriptor is not inherited by child processes.
fr: Crée un fichier temporaire de la manière la plus sécurisée qui soit. Il n'y a pas d'accès concurrent (``race condition``) au moment de la création du fichier, en supposant que la plateforme implémente correctement l'option :const:`os.O_EXCL` pour :func:`os.open`. Le fichier est seulement accessible en lecture et écriture par l'ID de l'utilisateur créateur. Si la plateforme utilise des bits de permissions pour indiquer si le fichier est exécutable, alors le fichier n'est exécutable par personne. Le descripteur de fichier n'est pas hérité par les processus fils.

source: Unlike :func:`TemporaryFile`, the user of :func:`mkstemp` is responsible for deleting the temporary file when done with it.
fr: À la différence de :func:`TemporaryFile`, l'utilisateur de :func:`mkstemp` est responsable de la suppression du fichier temporaire quand il n'en a plus besoin.

source: If *suffix* is not ``None``, the file name will end with that suffix, otherwise there will be no suffix. :func:`mkstemp` does not put a dot between the file name and the suffix; if you need one, put it at the beginning of *suffix*.
fr: Si *suffix* ne vaut pas ``None``, le nom de fichier se terminera avec ce suffixe, sinon il n'y aura pas de suffixe. :func:`mkstemp` ne met pas de point entre le nom du fichier et le suffixe. Si vous en avez besoin, mettez le point au début de *suffix*.

source: If *prefix* is not ``None``, the file name will begin with that prefix; otherwise, a default prefix is used. The default is the return value of :func:`gettempprefix` or :func:`gettempprefixb`, as appropriate.
fr: Si *prefix* ne vaut pas ``None``, le nom de fichier commencera avec ce préfixe, sinon un préfixe par défaut est utilisé. La valeur par défaut est la valeur retournée par :func:`gettempprefix` ou :func:`gettempprefixb`.

source: If *dir* is not ``None``, the file will be created in that directory; otherwise, a default directory is used. The default directory is chosen from a platform-dependent list, but the user of the application can control the directory location by setting the *TMPDIR*, *TEMP* or *TMP* environment variables. There is thus no guarantee that the generated filename will have any nice properties, such as not requiring quoting when passed to external commands via ``os.popen()``.
fr: Si *dir* ne vaut pas ``None``, le fichier sera créé dans ce répertoire, autrement, un répertoire par défaut sera utilisé. Le répertoire par défaut est choisi depuis une liste dépendante de la plateforme, mais l'utilisateur de l'application peut contrôler l'emplacement du répertoire en spécifiant les variables d'environnement *TMPDIR*, *TEMP* ou *TMP*. Il n'y a pas de garantie que le nom de fichier généré aura de bonnes propriétés telles que ne pas avoir besoin de le mettre entre guillemets lorsque celui-ci est passé à des commandes externes via ``os.popen()``.

source: If any of *suffix*, *prefix*, and *dir* are not ``None``, they must be the same type. If they are bytes, the returned name will be bytes instead of str. If you want to force a bytes return value with otherwise default behavior, pass ``suffix=b''``.
fr: Si l'un des paramètres *suffix*, *prefix* et *dir* n'est pas ``None``, ils doivent être du même type. S'ils sont de type ``bytes``, le nom renvoyée sera de type ``bytes`` plutôt que de type ``str``. Si vous voulez forcer la valeur renvoyée en ``bytes``, passez ``suffix=b''``.

source: If *text* is specified, it indicates whether to open the file in binary mode (the default) or text mode. On some platforms, this makes no difference.
fr: Si *text* est spécifié, cela indique si le fichier doit être ouvert en mode binaire (par défaut) ou en mode texte. Sur certaines plateformes, cela ne fait aucune différence.

source: :func:`mkstemp` returns a tuple containing an OS-level handle to an open file (as would be returned by :func:`os.open`) and the absolute pathname of that file, in that order.
fr: :func:`mkstemp` renvoie un n-uplet contenant un descripteur (*handle* en anglais) au niveau du système d'exploitation vers un fichier ouvert (le même que renvoie :func:`os.open`) et le chemin d'accès absolu de ce fichier, dans cet ordre.

source: *suffix*, *prefix*, and *dir* may now be supplied in bytes in order to obtain a bytes return value. Prior to this, only str was allowed. *suffix* and *prefix* now accept and default to ``None`` to cause an appropriate default value to be used.
fr: *suffix*, *prefix*, et *dir* peuvent maintenant être spécifiés en ``bytes`` pour obtenir un résultat en ``bytes``. Avant cela, le type ``str`` était le seul autorisé. *suffix* et *prefix* acceptent maintenant la valeur par défaut ``None`` pour que la valeur par défaut appropriée soit utilisée.

source: Creates a temporary directory in the most secure manner possible. There are no race conditions in the directory's creation. The directory is readable, writable, and searchable only by the creating user ID.
fr: Crée un répertoire temporaire de la manière la plus sécurisée qu'il soit. Il n'y a pas d'accès concurrent (``race condition``) au moment de la création du répertoire. Le répertoire est accessible en lecture, en écriture, et son contenu lisible uniquement pour l'ID de l'utilisateur créateur.

source: The user of :func:`mkdtemp` is responsible for deleting the temporary directory and its contents when done with it.
fr: L'utilisateur de :func:`mkdtemp` est responsable de la suppression du répertoire temporaire et de son contenu lorsqu'il n'en a plus besoin.

source: The *prefix*, *suffix*, and *dir* arguments are the same as for :func:`mkstemp`.
fr: Les arguments *prefix*, *suffix*, et *dir* sont les mêmes que pour :func:`mkstemp`.

source: :func:`mkdtemp` returns the absolute pathname of the new directory.
fr: :func:`mkdtemp` renvoie le chemin absolu du nouveau répertoire.

source: Return the name of the directory used for temporary files. This defines the default value for the *dir* argument to all functions in this module.
fr: Renvoie le nom du répertoire utilisé pour les fichiers temporaires. C'est la valeur par défaut pour l'argument *dir* de toutes les fonctions de ce module.

source: Python searches a standard list of directories to find one which the calling user can create files in. The list is:
fr: Python cherche un répertoire parmi une liste standard de répertoires dans lequel l'utilisateur final peut créer des fichiers. La liste est :

source: The directory named by the :envvar:`TMPDIR` environment variable.
fr: Le répertoire correspondant à la variable d'environnement :envvar:`TMPDIR`.

source: The directory named by the :envvar:`TEMP` environment variable.
fr: Le répertoire correspondant à la variable d'environnement :envvar:`TEMP`.

source: The directory named by the :envvar:`TMP` environment variable.
fr: Le répertoire correspondant à la variable d'environnement :envvar:`TMP`.

source: A platform-specific location:
fr: Un emplacement dépendant à la plateforme :

source: On Windows, the directories :file:`C:\\TEMP`, :file:`C:\\TMP`, :file:`\\TEMP`, and :file:`\\TMP`, in that order.
fr: Sur Windows, les répertoires :file:`C:\\TEMP`, :file:`C:\\TMP`, :file:`\\TEMP`, et :file:`\\TMP`, dans cet ordre.

source: On all other platforms, the directories :file:`/tmp`, :file:`/var/tmp`, and :file:`/usr/tmp`, in that order.
fr: Sur toutes les autres plate-formes, les répertoires :file:`/tmp`, :file:`/var/tmp`, et :file:`/usr/tmp`, dans cet ordre.

source: As a last resort, the current working directory.
fr: En dernier ressort, le répertoire de travail courant.

source: The result of this search is cached, see the description of :data:`tempdir` below.
fr: Le résultat de cette recherche est mis en cache, voir la description de :data:`tempdir` dessous.

source: Same as :func:`gettempdir` but the return value is in bytes.
fr: Similaire à :func:`gettempdir` mais la valeur retournée est en *bytes*.

source: Return the filename prefix used to create temporary files. This does not contain the directory component.
fr: Renvoie le préfixe de nom de fichier utilisé pour créer les fichiers temporaires. Cela ne contient pas le nom du répertoire.

source: Same as :func:`gettempprefix` but the return value is in bytes.
fr: Similaire à :func:`gettempprefix` mais la valeur retournée est en *bytes*.

source: The module uses a global variable to store the name of the directory used for temporary files returned by :func:`gettempdir`. It can be set directly to override the selection process, but this is discouraged. All functions in this module take a *dir* argument which can be used to specify the directory and this is the recommended approach.
fr: Le module utilise une variable globale pour stocker le nom du répertoire utilisé pour les fichiers temporaires renvoyés par :func:`gettempdir`. Vous pouvez directement utiliser la variable globale pour surcharger le processus de sélection, mais ceci est déconseillé. Toutes les fonctions de ce module prennent un argument *dir* qui peut être utilisé pour spécifier le répertoire. Il s'agit de la méthode recommandée.

source: When set to a value other than ``None``, this variable defines the default value for the *dir* argument to the functions defined in this module.
fr: Quand une valeur autre que ``None`` est spécifiée, cette variable définit la valeur par défaut pour l'argument *dir* des fonctions définies dans ce module.

source: If ``tempdir`` is ``None`` (the default) at any call to any of the above functions except :func:`gettempprefix` it is initialized following the algorithm described in :func:`gettempdir`.
fr: Si ``tempdir`` vaut ``None`` (par défaut) pour n'importe quelle des fonctions ci-dessus, sauf :func:`gettempprefix`, la variable est initialisée suivant l'algorithme décrit dans :func:`gettempdir`.

source: Examples
fr: Exemples

source: Here are some examples of typical usage of the :mod:`tempfile` module::
fr: Voici quelques exemples classiques d'utilisation du module :mod:`tempfile` ::

source: Deprecated functions and variables
fr: Fonctions et variables obsolètes

source: A historical way to create temporary files was to first generate a file name with the :func:`mktemp` function and then create a file using this name. Unfortunately this is not secure, because a different process may create a file with this name in the time between the call to :func:`mktemp` and the subsequent attempt to create the file by the first process. The solution is to combine the two steps and create the file immediately. This approach is used by :func:`mkstemp` and the other functions described above.
fr: Historiquement, la méthode pour créer des fichiers temporaires consistait à générer un nom de fichier avec la fonction :func:`mktemp` puis créer un fichier en utilisant ce nom. Malheureusement, cette méthode n'est pas fiable car un autre processus peut créer un fichier avec ce nom entre l'appel à la fonction :func:`mktemp` et la tentative de création de fichier par le premier processus en cours. La solution est de combiner les deux étapes et de créer le fichier immédiatement. Cette approche est utilisée par :func:`mkstemp` et les autres fonctions décrites plus haut.

source: Use :func:`mkstemp` instead.
fr: Utilisez :func:`mkstemp` à la place.

source: Return an absolute pathname of a file that did not exist at the time the call is made. The *prefix*, *suffix*, and *dir* arguments are similar to those of :func:`mkstemp`, except that bytes file names, ``suffix=None`` and ``prefix=None`` are not supported.
fr: Renvoie le chemin absolu d'un fichier qui n'existe pas lorsque l'appel est fait. Les arguments *prefix*, *suffix*, et *dir* sont similaires à ceux de :func:`mkstemp` mais les noms de fichiers en *bytes*, ``sufix=None`` et ``prefix=None`` ne sont pas implémentées.

source: Use of this function may introduce a security hole in your program. By the time you get around to doing anything with the file name it returns, someone else may have beaten you to the punch. :func:`mktemp` usage can be replaced easily with :func:`NamedTemporaryFile`, passing it the ``delete=False`` parameter::
fr: Utiliser cette fonction peut introduire une faille de sécurité dans votre programme. Avant que vous n'ayez le temps de faire quoi que ce soit avec le nom de fichier renvoyé, quelqu'un peut l'utiliser. L'utilisation de :func:`mktemp` peut être remplacée facilement avec :func:`NamedTemporaryFile` en y passant le paramètre ``delete=False`` ::
