Repository: python/python-docs-fr
Catalog: library/termios.po
Languages: fr

source: :mod:`termios` --- POSIX style tty control
fr: :mod:`termios` — Le style POSIX le contrôle TTY

source: This module provides an interface to the POSIX calls for tty I/O control. For a complete description of these calls, see :manpage:`termios(3)` Unix manual page. It is only available for those Unix versions that support POSIX *termios* style tty I/O control configured during installation.
fr: Ce module fournit une interface aux appels POSIX pour le contrôle des E/S TTY. Pour une description complète de ces appels, voir la page du manuel UNIX :manpage:`termios(3)`. C’est disponible uniquement pour les versions Unix qui supportent le style POSIX *termios* et les contrôles d’entrées/sorties TTY configurés à l’installation.

source: All functions in this module take a file descriptor *fd* as their first argument. This can be an integer file descriptor, such as returned by ``sys.stdin.fileno()``, or a :term:`file object`, such as ``sys.stdin`` itself.
fr: Toutes les fonctions de ce module prennent un descripteur de fichier *fd* comme premier argument. Ça peut être un descripteur de fichiers entier, tel que le retourne ``sys.stdin.fileno()``, ou un :term:`file object`, tel que ``sys.stdin``.

source: This module also defines all the constants needed to work with the functions provided here; these have the same name as their counterparts in C. Please refer to your system documentation for more information on using these terminal control interfaces.
fr: Ce module définit aussi toutes les constantes nécessaires pour travailler avec les fonctions fournies ici; elles ont les mêmes noms que leurs équivalents en C. Pour plus d’informations sur l’utilisation de ces terminaux, veuillez vous référer à votre documentation système.

source: The module defines the following functions:
fr: Le module définit les fonctions suivantes :

source: Return a list containing the tty attributes for file descriptor *fd*, as follows: ``[iflag, oflag, cflag, lflag, ispeed, ospeed, cc]`` where *cc* is a list of the tty special characters (each a string of length 1, except the items with indices :const:`VMIN` and :const:`VTIME`, which are integers when these fields are defined). The interpretation of the flags and the speeds as well as the indexing in the *cc* array must be done using the symbolic constants defined in the :mod:`termios` module.
fr: Retourne une liste contenant les attributs TTY pour le descripteur de fichier *fd*, tel que: ``[iflag, oflag, cflag, lflag, ispeed, ospeed, cc]`` où *cc* est une liste de caractères spéciaux TTY (chacun est une chaine de caractère de longueur 1, à l’exception des éléments ayant les indices :const:`VMIN` et :const:`VTIME`, ceux-ci sont alors des entiers quand ces champs sont définis). L’interprétation des options (*flags* en anglais) et des vitesses ainsi que l’indexation dans le tableau *cc* doit être fait en utilisant les constantes symboliques définies dans le module :mod:`termios`.

source: Set the tty attributes for file descriptor *fd* from the *attributes*, which is a list like the one returned by :func:`tcgetattr`. The *when* argument determines when the attributes are changed: :const:`TCSANOW` to change immediately, :const:`TCSADRAIN` to change after transmitting all queued output, or :const:`TCSAFLUSH` to change after transmitting all queued output and discarding all queued input.
fr: Définit les attributs TTY pour le descripteur de fichiers *fd* à partir des *attributs*, qui est une liste comme celle retournée par :func:`tcgetattr`. L’argument *when* détermine quand les attributs sont changés: :const:`TCSANOW` pour un changement immédiat, :const:`TCSADRAIN` pour un changement après la transmission de toute sortie en file d’attente, ou :const:`TCSAFLUSH` pour un changement après avoir transmis toute sortie en file d’attente et rejeté toutes entrée en file d’attente.

source: Send a break on file descriptor *fd*. A zero *duration* sends a break for 0.25--0.5 seconds; a nonzero *duration* has a system dependent meaning.
fr: Envoie une pause sur le descripteur de fichier *fd*. Une *duration* à zéro envoie une pause de 0.25 -- 0.5 seconde ; Une *duration* différente de zéro à une définition spécifique pour chaque système.

source: Wait until all output written to file descriptor *fd* has been transmitted.
fr: Attends que toutes les sorties écrites dans le descripteur de fichier *fd* soient transmises.

source: Discard queued data on file descriptor *fd*. The *queue* selector specifies which queue: :const:`TCIFLUSH` for the input queue, :const:`TCOFLUSH` for the output queue, or :const:`TCIOFLUSH` for both queues.
fr: Vide la queue de données du descripteur de fichier *fd*. Le sélecteur *queue* précise la queue: :const:`TCIFLUSH` pour la queue des entrées, :const:`TCOFLUSH` pour la queue des sorties, ou :const:`TCIOFLUSH` pour les deux queues.

source: Suspend or resume input or output on file descriptor *fd*. The *action* argument can be :const:`TCOOFF` to suspend output, :const:`TCOON` to restart output, :const:`TCIOFF` to suspend input, or :const:`TCION` to restart input.
fr: Suspends ou reprends l’entrée ou la sortie du descripteur de fichier *fd*. L’argument *action* peut être :const:`TCOOFF` pour suspendre la sortie, :const:`TCOON` pour relancer la sortie, :const:`TCIOFF` pour suspendre l’entrée, ou :const:`TCION` pour relancer l’entrée.

source: Module :mod:`tty`
fr: Le module :mod:`tty`

source: Convenience functions for common terminal control operations.
fr: Fonctions utiles pour les opérations de contrôle communes dans le terminal.

source: Example
fr: Exemple

source: Here's a function that prompts for a password with echoing turned off. Note the technique using a separate :func:`tcgetattr` call and a :keyword:`try` ... :keyword:`finally` statement to ensure that the old tty attributes are restored exactly no matter what happens::
fr: Voici une fonction qui demande à l’utilisateur d’entrer un mot de passe sans l’afficher. Remarquez la technique qui consiste à séparer un appel à :func:`tcgetattr` et une instruction :keyword:`try`… :keyword:`finally` pour s’assurer que les anciens attributs tty soient restaurés tels quels quoi qu’il arrive::
