Repository: python/python-docs-fr
Catalog: library/time.po
Languages: fr

source: Year without century as a decimal number [00,99].
fr: Année sans siècle comme un nombre décimal [00, 99].

source: Year with century as a decimal number.
fr: Année complète sur quatre chiffres.

source: Time zone offset indicating a positive or negative time difference from UTC/GMT of the form +HHMM or -HHMM, where H represents decimal hour digits and M represents decimal minute digits [-23:59, +23:59].
fr: Décalage de fuseau horaire indiquant une différence de temps positive ou négative par rapport à UTC / GMT de la forme *+HHMM* ou *-HHMM*, où H représente les chiffres des heures décimales et M, les chiffres des minutes décimales [*-23:59*, *+23:59*].

source: Time zone name (no characters if no time zone exists).
fr: Nom du fuseau horaire (pas de caractères s’il n’y a pas de fuseau horaire).

source: A literal ``'%'`` character.
fr: Un caractère ``'%'`` littéral.

source: When used with the :func:`strptime` function, the ``%p`` directive only affects the output hour field if the ``%I`` directive is used to parse the hour.
fr: Lorsqu’elle est utilisée avec la fonction :func:`strptime`, la directive ``%p`` n’affecte le champ d’heure en sortie que si la directive ``%I`` est utilisée pour analyser l’heure.

source: The range really is ``0`` to ``61``; value ``60`` is valid in timestamps representing `leap seconds`_ and value ``61`` is supported for historical reasons.
fr: La plage est en réalité de ``0`` à ``61`` ; La valeur ``60`` est valide dans les *timestamps* représentant des `leap seconds`_ et la valeur ``61`` est prise en charge pour des raisons historiques.

source: When used with the :func:`strptime` function, ``%U`` and ``%W`` are only used in calculations when the day of the week and the year are specified.
fr: Lorsqu’elles sont utilisées avec la fonction :func:`strptime`, ``%U`` et ``%W`` ne sont utilisées que dans les calculs lorsque le jour de la semaine et l’année sont spécifiés.

source: Here is an example, a format for dates compatible with that specified in the :rfc:`2822` Internet email standard. [#]_ ::
fr: Voici un exemple de format de date compatible avec celui spécifié dans la norme de courrier électronique Internet suivante :rfc:`2822`. [#]_ ::

source: Additional directives may be supported on certain platforms, but only the ones listed here have a meaning standardized by ANSI C. To see the full set of format codes supported on your platform, consult the :manpage:`strftime(3)` documentation.
fr: Des directives supplémentaires peuvent être prises en charge sur certaines plates-formes, mais seules celles énumérées ici ont une signification normalisée par ANSI C. Pour voir la liste complète des codes de format pris en charge sur votre plate-forme, consultez la documentation :manpage:`strftime(3)`.

source: On some platforms, an optional field width and precision specification can immediately follow the initial ``'%'`` of a directive in the following order; this is also not portable. The field width is normally 2 except for ``%j`` where it is 3.
fr: Sur certaines plates-formes, une spécification facultative de largeur et de précision de champ peut suivre immédiatement le ``'%'`` initial d’une directive dans l’ordre suivant ; ce n’est pas non plus portable. La largeur du champ est normalement 2 sauf pour ``%j`` où il est 3.

source: Parse a string representing a time according to a format. The return value is a :class:`struct_time` as returned by :func:`gmtime` or :func:`localtime`.
fr: Analyse une chaîne représentant une heure selon un format. La valeur renvoyée est une :class:`struct_time` tel que renvoyé par :func:`gmtime` ou :func:`localtime`.

source: The *format* parameter uses the same directives as those used by :func:`strftime`; it defaults to ``"%a %b %d %H:%M:%S %Y"`` which matches the formatting returned by :func:`ctime`. If *string* cannot be parsed according to *format*, or if it has excess data after parsing, :exc:`ValueError` is raised. The default values used to fill in any missing data when more accurate values cannot be inferred are ``(1900, 1, 1, 0, 0, 0, 0, 1, -1)``. Both *string* and *format* must be strings.
fr: Le paramètre *format* utilise les mêmes directives que celles utilisées par :func:`strftime`; La valeur par défaut est ``"%a %b %d %H:%M:%S %Y"`` qui correspond à la mise en forme renvoyée par :func:`ctime`. Si *string* ne peut pas être analysé selon *format*, ou s’il contient trop de données après l’analyse, une exception :exc:`ValueError` est levée. Les valeurs par défaut utilisées pour renseigner les données manquantes lorsque des valeurs plus précises ne peuvent pas être inférées sont ``(1900, 1, 1, 0, 0, 0, 0, 1, -1)``. *string* et *format* doivent être des chaînes.

source: For example:
fr: Par exemple :

source: Support for the ``%Z`` directive is based on the values contained in ``tzname`` and whether ``daylight`` is true. Because of this, it is platform-specific except for recognizing UTC and GMT which are always known (and are considered to be non-daylight savings timezones).
fr: La prise en charge de la directive ``%Z`` est basée sur les valeurs contenues dans ``tzname`` et sur le fait de savoir si ``daylight`` est vrai. Pour cette raison, il est spécifique à la plate-forme, à l’exception de la reconnaissance des heures UTC et GMT, qui sont toujours connues (et considérées comme des fuseaux horaires ne respectant pas l’heure d’été).

source: Only the directives specified in the documentation are supported. Because ``strftime()`` is implemented per platform it can sometimes offer more directives than those listed. But ``strptime()`` is independent of any platform and thus does not necessarily support all directives available that are not documented as supported.
fr: Seules les directives spécifiées dans la documentation sont prises en charge. Parce que ``strftime()`` peut être implémenté différemment sur chaque plate-forme, il peut parfois offrir plus de directives que celles listées. Mais ``strptime()`` est indépendant de toute plate-forme et ne supporte donc pas nécessairement toutes les directives disponibles qui ne sont pas documentées comme gérées.

source: The type of the time value sequence returned by :func:`gmtime`, :func:`localtime`, and :func:`strptime`. It is an object with a :term:`named tuple` interface: values can be accessed by index and by attribute name. The following values are present:
fr: Le type de la séquence de valeur temporelle renvoyé par :func:`gmtime`, :func:`localtime` et :func:`strptime`. Semblable à un :term:`named tuple` : ses valeurs sont accessibles par index et par nom d’attribut. Les valeurs suivantes sont présentes :

source: Attribute
fr: Attribut

source: Values
fr: Valeurs

source: (for example, 1993)
fr: (par exemple, 1993)

source: range [1, 12]
fr: plage [1, 12]

source: range [1, 31]
fr: plage [1, 31]

source: range [0, 23]
fr: plage [0, 23]

source: range [0, 59]
fr: plage [0, 59]

source: range [0, 61]; see **(2)** in :func:`strftime` description
fr: plage [0, 61]; voir **(2)** dans la description :func:`strftime`

source: range [0, 6], Monday is 0
fr: plage [0, 6], Lundi valant 0

source: range [1, 366]
fr: plage [1, 366]

source: 0, 1 or -1; see below
fr: ``0``, ``1`` or ``-1`` ; voir en bas

source: abbreviation of timezone name
fr: abréviation du nom du fuseau horaire

source: offset east of UTC in seconds
fr: décalage à l’est de UTC en secondes

source: Note that unlike the C structure, the month value is a range of [1, 12], not [0, 11].
fr: Notez que contrairement à la structure C, la valeur du mois est une plage de [1, 12], pas de [0, 11].

source: In calls to :func:`mktime`, :attr:`tm_isdst` may be set to 1 when daylight savings time is in effect, and 0 when it is not. A value of -1 indicates that this is not known, and will usually result in the correct state being filled in.
fr: Dans les appels à :func:`mktime`, :attr:`tm_isdst` peut être défini sur 1 lorsque l’heure d'été est en vigueur et sur 0 lorsque ce n’est pas le cas. Une valeur de ``-1`` indique que cela n’est pas connu et entraînera généralement le remplissage de l’état correct.

source: When a tuple with an incorrect length is passed to a function expecting a :class:`struct_time`, or having elements of the wrong type, a :exc:`TypeError` is raised.
fr: Lorsqu’un *tuple* de longueur incorrecte est passé à une fonction acceptant une :class:`struct_time`, ou comportant des éléments de type incorrect, une exception :exc:`TypeError` est levé.

source: Return the time in seconds since the epoch_ as a floating point number. The specific date of the epoch and the handling of `leap seconds`_ is platform dependent. On Windows and most Unix systems, the epoch is January 1, 1970, 00:00:00 (UTC) and leap seconds are not counted towards the time in seconds since the epoch. This is commonly referred to as `Unix time <https://en.wikipedia.org/wiki/Unix_time>`_. To find out what the epoch is on a given platform, look at ``gmtime(0)``.
fr: Renvoie le temps en secondes depuis epoch_ sous forme de nombre à virgule flottante. La date spécifique de *epoch* et le traitement des secondes intercalaires (`leap seconds`_) dépendent de la plate-forme. Sous Windows et la plupart des systèmes Unix, *epoch* est le 1\ :sup:`er` janvier 1970, 00:00:00 (UTC) et les secondes intercalaires ne sont pas comptées dans le temps en secondes depuis *epoch*. Ceci est communément appelé `Heure Unix <https://en.wikipedia.org/wiki/Unix_time>`_. Pour savoir quelle est *epoch* sur une plate-forme donnée, consultez ``gmtime(0)``.

source: Note that even though the time is always returned as a floating point number, not all systems provide time with a better precision than 1 second. While this function normally returns non-decreasing values, it can return a lower value than a previous call if the system clock has been set back between the two calls.
fr: Notez que même si l’heure est toujours renvoyée sous forme de nombre à virgule flottante, tous les systèmes ne fournissent pas l’heure avec une précision supérieure à 1 seconde. Bien que cette fonction renvoie normalement des valeurs croissantes, elle peut renvoyer une valeur inférieure à celle d’un appel précédent si l’horloge système a été réglée entre les deux appels.

source: The number returned by :func:`.time` may be converted into a more common time format (i.e. year, month, day, hour, etc...) in UTC by passing it to :func:`gmtime` function or in local time by passing it to the :func:`localtime` function. In both cases a :class:`struct_time` object is returned, from which the components of the calendar date may be accessed as attributes.
fr: Le nombre renvoyé par :func:`.time` peut être converti en un format d’heure plus courant (année, mois, jour, heure, etc.) en UTC en le transmettant à la fonction :func:`gmtime` ou dans heure locale en le transmettant à la fonction :func:`localtime`. Dans les deux cas, un objet :class:`struct_time` est renvoyé, à partir duquel les composants de la date du calendrier peuvent être consultés en tant qu’attributs.

source: Return the value (in fractional seconds) of the sum of the system and user CPU time of the current thread. It does not include time elapsed during sleep. It is thread-specific by definition. The reference point of the returned value is undefined, so that only the difference between the results of consecutive calls in the same thread is valid.
fr: Renvoie la valeur (en quelques fractions de secondes) de la somme des temps processeur système et utilisateur du thread en cours. Il ne comprend pas le temps écoulé pendant le sommeil. Il est spécifique au thread par définition. Le point de référence de la valeur renvoyée est indéfini, de sorte que seule la différence entre les résultats d’appels consécutifs dans le même thread est valide.

source: :ref:`Availability <availability>`: Windows, Linux, Unix systems supporting ``CLOCK_THREAD_CPUTIME_ID``.
fr: :ref:`Disponibilité <availability>` : Systèmes Windows, Linux, Unix prenant en charge ``CLOCK_THREAD_CPUTIME_ID``.

source: Similar to :func:`thread_time` but return time as nanoseconds.
fr: Similaire à :func:`thread_time` mais renvoie le temps en nanosecondes.

source: Similar to :func:`~time.time` but returns time as an integer number of nanoseconds since the epoch_.
fr: Similaire à :func:`~time.time` mais renvoie le nombre de nanosecondes depuis epoch_ sous la forme d'un entier.

source: Reset the time conversion rules used by the library routines. The environment variable :envvar:`TZ` specifies how this is done. It will also set the variables ``tzname`` (from the :envvar:`TZ` environment variable), ``timezone`` (non-DST seconds West of UTC), ``altzone`` (DST seconds west of UTC) and ``daylight`` (to 0 if this timezone does not have any daylight saving time rules, or to nonzero if there is a time, past, present or future when daylight saving time applies).
fr: Réinitialise les règles de conversion de temps utilisées par les routines de la bibliothèque. La variable d’environnement :envvar:`TZ` spécifie comment cela est effectué. La fonction définira également les variables ``tzname`` (à partir de la variable d’environnement :envvar:`TZ`), ``timezone`` (secondes non DST à l’ouest de l’UTC), ``altzone`` (secondes DST à l’ouest de UTC) et ``daylight`` (à 0 si ce fuseau horaire ne comporte aucune règle d’heure d’été, ou non nul s’il existe une heure, passée, présente ou future lorsque l’heure d’été est appliquée).

source: Although in many cases, changing the :envvar:`TZ` environment variable may affect the output of functions like :func:`localtime` without calling :func:`tzset`, this behavior should not be relied on.
fr: Bien que dans de nombreux cas, la modification de la variable d’environnement :envvar:`TZ` puisse affecter la sortie de fonctions telles que :func:`localtime` sans appeler :func:`tzset`, ce comportement n'est pas garanti.

source: The :envvar:`TZ` environment variable should contain no whitespace.
fr: La variable d’environnement :envvar:`TZ` ne doit contenir aucun espace.

source: The standard format of the :envvar:`TZ` environment variable is (whitespace added for clarity)::
fr: Le format standard de la variable d’environnement :envvar:`TZ` est (espaces ajoutés pour plus de clarté) ::

source: Where the components are:
fr: Où les composants sont :

source: ``std`` and ``dst``
fr: ``std`` et ``dst``

source: Three or more alphanumerics giving the timezone abbreviations. These will be propagated into time.tzname
fr: Trois alphanumériques ou plus donnant les abréviations du fuseau horaire. Ceux-ci seront propagés dans *time.tzname*

source: The offset has the form: ``± hh[:mm[:ss]]``. This indicates the value added the local time to arrive at UTC. If preceded by a '-', the timezone is east of the Prime Meridian; otherwise, it is west. If no offset follows dst, summer time is assumed to be one hour ahead of standard time.
fr: Le décalage a la forme suivante : ``± hh[:mm[:ss]]``. Cela indique la valeur ajoutée à l’heure locale pour arriver à UTC. S'il est précédé d’un ``'-'``, le fuseau horaire est à l’est du Premier Méridien ; sinon, c’est l’ouest. Si aucun décalage ne suit *dst*, l’heure d’été est supposée être en avance d’une heure sur l’heure standard.

source: Indicates when to change to and back from DST. The format of the start and end dates are one of the following:
fr: Indique quand passer à DST et en revenir. Le format des dates de début et de fin est l’un des suivants :

source: The Julian day *n* (1 <= *n* <= 365). Leap days are not counted, so in all years February 28 is day 59 and March 1 is day 60.
fr: Le jour Julien *n* (1 <= *n* <= 365). Les jours bissextiles ne sont pas comptabilisés. Par conséquent, le 28 février est le 59\ :sup:`e` jour et le 1\ :sup:`er` Mars est le 60\ :sup:`e` jour de toutes les années.

source: The zero-based Julian day (0 <= *n* <= 365). Leap days are counted, and it is possible to refer to February 29.
fr: Le jour Julien de base zéro (0 <= *n* <= 365). Les jours bissextiles sont comptés et il est possible de se référer au 29 février.

source: The *d*'th day (0 <= *d* <= 6) of week *n* of month *m* of the year (1 <= *n* <= 5, 1 <= *m* <= 12, where week 5 means "the last *d* day in month *m*" which may occur in either the fourth or the fifth week). Week 1 is the first week in which the *d*'th day occurs. Day zero is a Sunday.
fr: Le *d* jour (0 <= *d* <= 6) de la semaine *n* du mois *m* de l’année (1 <= *n* <= 5, 1 <= *m* <= 12, où semaine 5 signifie “le *dernier* jour du mois *m*” pouvant se produire au cours de la quatrième ou de la cinquième semaine). La semaine 1 est la première semaine au cours de laquelle le *jour* se produit. Le jour zéro est un dimanche.

source: ``time`` has the same format as ``offset`` except that no leading sign ('-' or '+') is allowed. The default, if time is not given, is 02:00:00.
fr: ``time`` a le même format que ``offset`` sauf qu’aucun signe de direction (``'-'`` ou ``'+'``) n’est autorisé. La valeur par défaut, si l’heure n’est pas spécifiée, est 02:00:00.

source: On many Unix systems (including \*BSD, Linux, Solaris, and Darwin), it is more convenient to use the system's zoneinfo (:manpage:`tzfile(5)`) database to specify the timezone rules. To do this, set the :envvar:`TZ` environment variable to the path of the required timezone datafile, relative to the root of the systems 'zoneinfo' timezone database, usually located at :file:`/usr/share/zoneinfo`. For example, ``'US/Eastern'``, ``'Australia/Melbourne'``, ``'Egypt'`` or ``'Europe/Amsterdam'``. ::
fr: Sur de nombreux systèmes Unix (y compris \*BSD, Linux, Solaris et Darwin), il est plus pratique d’utiliser la base de données *zoneinfo* (:manpage:`tzfile (5)`) du système pour spécifier les règles de fuseau horaire. Pour ce faire, définissez la variable d’environnement :envvar:`TZ` sur le chemin du fichier de fuseau horaire requis, par rapport à la racine de la base de données du système *zoneinfo*, généralement situé à :file:`/usr/share/zoneinfo`. Par exemple, ``'US/Eastern'``, ``'Australia/Melbourne'``, ``'Egypt'`` ou ``'Europe/Amsterdam'``. ::

source: Clock ID Constants
fr: Constantes d’identification d’horloge

source: These constants are used as parameters for :func:`clock_getres` and :func:`clock_gettime`.
fr: Ces constantes sont utilisées comme paramètres pour :func:`clock_getres` et :func:`clock_gettime`.

source: Identical to :data:`CLOCK_MONOTONIC`, except it also includes any time that the system is suspended.
fr: Identique à :data:`CLOCK_MONOTONIC`, sauf qu'elle inclut également toute suspension du système.

source: This allows applications to get a suspend-aware monotonic clock without having to deal with the complications of :data:`CLOCK_REALTIME`, which may have discontinuities if the time is changed using ``settimeofday()`` or similar.
fr: Cela permet aux applications d’obtenir une horloge monotone tenant compte de la suspension sans avoir à gérer les complications de :data:`CLOCK_REALTIME`, qui peuvent présenter des discontinuités si l’heure est modifiée à l’aide de ``settimeofday()`` ou similaire.

source: :ref:`Availability <availability>`: Linux 2.6.39 or later.
fr: :ref:`Disponibilité <availability>` : Linux 2.6.39 et ultérieures.

source: The Solaris OS has a ``CLOCK_HIGHRES`` timer that attempts to use an optimal hardware source, and may give close to nanosecond resolution. ``CLOCK_HIGHRES`` is the nonadjustable, high-resolution clock.
fr: Le système d’exploitation Solaris dispose d’une horloge ``CLOCK_HIGHRES`` qui tente d’utiliser une source matérielle optimale et peut donner une résolution proche de la nanoseconde. ``CLOCK_HIGHRES`` est l’horloge haute résolution non ajustable.

source: :ref:`Availability <availability>`: Solaris.
fr: :ref:`Disponibilité <availability>` : Solaris.

source: Clock that cannot be set and represents monotonic time since some unspecified starting point.
fr: Horloge qui ne peut pas être réglée et représente l’heure monotone depuis un point de départ non spécifié.

source: Similar to :data:`CLOCK_MONOTONIC`, but provides access to a raw hardware-based time that is not subject to NTP adjustments.
fr: Similaire à :data:`CLOCK_MONOTONIC`, mais donne accès à une heure matérielle brute qui n’est pas soumise aux ajustements NTP.

source: :ref:`Availability <availability>`: Linux 2.6.28 and newer, macOS 10.12 and newer.
fr: :ref:`Disponibilité <availability>`: Linux 2.6.28 et ultérieur, MacOS 10.12 et ultérieur.

source: High-resolution per-process timer from the CPU.
fr: Minuterie haute résolution par processus du CPU.

source: :ref:`Availability <availability>`: FreeBSD, NetBSD 7 or later, OpenBSD.
fr: :ref:`Disponibilité <availability>` : FreeBSD, NetBSD 7 ou version ultérieure, OpenBSD.

source: Thread-specific CPU-time clock.
fr: Horloge de temps CPU spécifique au thread.

source: Time whose absolute value is the time the system has been running and not suspended, providing accurate uptime measurement, both absolute and interval.
fr: Heure dont la valeur absolue correspond à l’heure à laquelle le système a été exécuté et non suspendu, fournissant une mesure précise du temps de disponibilité, à la fois absolue et à intervalle.

source: :ref:`Availability <availability>`: FreeBSD, OpenBSD 5.5 or later.
fr: :ref:`Disponibilité <availability>` : FreeBSD, OpenBSD 5.5 ou version ultérieure.

source: Clock that increments monotonically, tracking the time since an arbitrary point, unaffected by frequency or time adjustments and not incremented while the system is asleep.
fr: Horloge qui s'incrémente de manière monotone, en suivant le temps écoulé depuis un point arbitraire, n'est pas affectée par les ajustements de fréquence ou de temps et n'est pas incrémentée lorsque le système est en veille.

source: :ref:`Availability <availability>`: macOS 10.12 and newer.
fr: :ref:`Disponibilité <availability>` : MacOS 10.12 et ultérieur.

source: The following constant is the only parameter that can be sent to :func:`clock_settime`.
fr: La constante suivante est le seul paramètre pouvant être envoyé à :func:`clock_settime`.

source: System-wide real-time clock. Setting this clock requires appropriate privileges.
fr: Horloge en temps réel à l’échelle du système. Le réglage de cette horloge nécessite des privilèges appropriés.

source: Timezone Constants
fr: Constantes de fuseau horaire

source: The offset of the local DST timezone, in seconds west of UTC, if one is defined. This is negative if the local DST timezone is east of UTC (as in Western Europe, including the UK). Only use this if ``daylight`` is nonzero. See note below.
fr: Décalage du fuseau horaire DST local, en secondes à l’ouest de UTC, s’il en est défini un. Cela est négatif si le fuseau horaire DST local est à l’est de UTC (comme en Europe occidentale, y compris le Royaume-Uni). Utilisez ceci uniquement si ``daylight`` est différent de zéro. Voir note ci-dessous.

source: Nonzero if a DST timezone is defined. See note below.
fr: Non nul si un fuseau horaire DST est défini. Voir note ci-dessous.

source: The offset of the local (non-DST) timezone, in seconds west of UTC (negative in most of Western Europe, positive in the US, zero in the UK). See note below.
fr: Décalage du fuseau horaire local (hors heure d’été), en secondes à l’ouest de l’UTC (négatif dans la plupart des pays d’Europe occidentale, positif aux États-Unis, nul au Royaume-Uni). Voir note ci-dessous.

source: A tuple of two strings: the first is the name of the local non-DST timezone, the second is the name of the local DST timezone. If no DST timezone is defined, the second string should not be used. See note below.
fr: Un *tuple* de deux chaînes : la première est le nom du fuseau horaire local autre que DST, la seconde est le nom du fuseau horaire DST local. Si aucun fuseau horaire DST n’est défini, la deuxième chaîne ne doit pas être utilisée. Voir note ci-dessous.
