Repository: python/python-docs-fr
Catalog: library/time.po
Languages: fr

source: For the above Timezone constants (:data:`altzone`, :data:`daylight`, :data:`timezone`, and :data:`tzname`), the value is determined by the timezone rules in effect at module load time or the last time :func:`tzset` is called and may be incorrect for times in the past. It is recommended to use the :attr:`tm_gmtoff` and :attr:`tm_zone` results from :func:`localtime` to obtain timezone information.
fr: Pour les constantes de fuseau horaire ci-dessus ( :data:`altzone`, :data:`daylight`, :data:`timezone` et :data:`tzname`), la valeur est déterminée par les règles de fuseau horaire en vigueur au moment du chargement du module ou la dernière fois :func:`tzset` est appelé et peut être incorrect pour des temps passés. Il est recommandé d’utiliser :attr:`tm_gmtoff` et :attr:`tm_zone` résulte de :func:`localtime` pour obtenir des informations sur le fuseau horaire.

source: More object-oriented interface to dates and times.
fr: Interface plus orientée objet vers les dates et les heures.

source: Internationalization services. The locale setting affects the interpretation of many format specifiers in :func:`strftime` and :func:`strptime`.
fr: Services d’internationalisation. Les paramètres régionaux affectent l’interprétation de nombreux spécificateurs de format dans :func:`strftime` et :func:`strptime`.

source: General calendar-related functions. :func:`~calendar.timegm` is the inverse of :func:`gmtime` from this module.
fr: Fonctions générales liées au calendrier. :func:`~calendar.timegm` est l’inverse de :func:`gmtime` à partir de ce module.

source: Footnotes
fr: Notes

source: The use of ``%Z`` is now deprecated, but the ``%z`` escape that expands to the preferred hour/minute offset is not supported by all ANSI C libraries. Also, a strict reading of the original 1982 :rfc:`822` standard calls for a two-digit year (%y rather than %Y), but practice moved to 4-digit years long before the year 2000. After that, :rfc:`822` became obsolete and the 4-digit year has been first recommended by :rfc:`1123` and then mandated by :rfc:`2822`.
fr: L'utilisation de ``%Z`` est maintenant obsolète, mais l'échappement ``%z`` qui donne le décalage horaire jusqu'à la minute et dépendant des paramètres régionaux n'est pas pris en charge par toutes les bibliothèques C ANSI. En outre, une lecture stricte du standard :rfc:`822` de 1982 milite pour une année à deux chiffres (%y plutôt que %Y), mais la pratique a migré vers des années à 4 chiffres de long avant l'année 2000. Après cela, la :rfc:`822` est devenue obsolète et l'année à 4 chiffres a été recommandée pour la première fois par la :rfc:`1123` puis rendue obligatoire par la :rfc:`2822`.
