Repository: python/python-docs-fr
Catalog: library/timeit.po
Languages: fr

source: :mod:`timeit` --- Measure execution time of small code snippets
fr: :mod:`timeit` — Mesurer le temps d'exécution de fragments de code

source: **Source code:** :source:`Lib/timeit.py`
fr: **Code source :** :source:`Lib/timeit.py`

source: This module provides a simple way to time small bits of Python code. It has both a :ref:`timeit-command-line-interface` as well as a :ref:`callable <python-interface>` one. It avoids a number of common traps for measuring execution times. See also Tim Peters' introduction to the "Algorithms" chapter in the *Python Cookbook*, published by O'Reilly.
fr: Ce module fournit une façon simple de mesurer le temps d'exécution de fragments de code Python. Il expose une :ref:`timeit-command-line-interface` ainsi qu'une :ref:`interface Python <python-interface>`. Ce module permet d'éviter un certain nombre de problèmes classiques liés à la mesure des temps d'exécution. Voir par exemple à ce sujet l'introduction par Tim Peters du chapitre « Algorithmes » dans le livre *Python Cookbook*, aux éditions O'Reilly.

source: Basic Examples
fr: Exemples simples

source: The following example shows how the :ref:`timeit-command-line-interface` can be used to compare three different expressions:
fr: L'exemple suivant illustre l'utilisation de l':ref:`timeit-command-line-interface` afin de comparer trois expressions différentes :

source: This can be achieved from the :ref:`python-interface` with::
fr: L':ref:`python-interface` peut être utilisée aux mêmes fins avec ::

source: A callable can also be passed from the :ref:`python-interface`::
fr: Un objet appelable peut également être passé en argument à l':ref:`python-interface` ::

source: Note however that :func:`.timeit` will automatically determine the number of repetitions only when the command-line interface is used. In the :ref:`timeit-examples` section you can find more advanced examples.
fr: Notez cependant que :func:`.timeit` détermine automatiquement le nombre de répétitions seulement lorsque l'interface en ligne de commande est utilisée. Vous pouvez trouver des exemples d'usages avancés dans la section :ref:`timeit-examples`.

source: Python Interface
fr: Interface Python

source: The module defines three convenience functions and a public class:
fr: Ce module définit une classe publique ainsi que trois fonctions destinées à simplifier son usage :

source: Create a :class:`Timer` instance with the given statement, *setup* code and *timer* function and run its :meth:`.timeit` method with *number* executions. The optional *globals* argument specifies a namespace in which to execute the code.
fr: Crée une instance d'objet :class:`Timer` à partir de l'instruction donnée, du code *setup* et de la fonction *timer*, puis exécute sa méthode :meth:`.timeit` à *number* reprises. L'argument optionnel *globals* spécifie un espace de nommage dans lequel exécuter le code.

source: The optional *globals* parameter was added.
fr: Le paramètre optionnel *globals* a été ajouté.

source: Create a :class:`Timer` instance with the given statement, *setup* code and *timer* function and run its :meth:`.repeat` method with the given *repeat* count and *number* executions. The optional *globals* argument specifies a namespace in which to execute the code.
fr: Crée une instance d'objet :class:`Timer` à partir de l'instruction donnée, du code *setup* et de la fonction *timer*, puis exécute sa méthode :meth:`.repeat` à *number* reprises, *repeat* fois. L'argument optionnel *globals* spécifie un espace de nommage dans lequel exécuter le code.

source: Default value of *repeat* changed from 3 to 5.
fr: La valeur par défaut de *repeat* est passée de 3 à 5.

source: The default timer, which is always :func:`time.perf_counter`.
fr: Le minuteur par défaut, qui est toujours :func:`time.perf_counter`.

source: :func:`time.perf_counter` is now the default timer.
fr: :func:`time.perf_counter` est désormais le minuteur par défaut.

source: Class for timing execution speed of small code snippets.
fr: Classe permettant de mesurer le temps d'exécution de fragments de code.

source: The constructor takes a statement to be timed, an additional statement used for setup, and a timer function. Both statements default to ``'pass'``; the timer function is platform-dependent (see the module doc string). *stmt* and *setup* may also contain multiple statements separated by ``;`` or newlines, as long as they don't contain multi-line string literals. The statement will by default be executed within timeit's namespace; this behavior can be controlled by passing a namespace to *globals*.
fr: Ce constructeur prend en argument une instruction dont le temps d'exécution doit être mesuré, une instruction additionnelle de mise en place et une fonction de chronométrage. Les deux instructions valent ``'pass'`` par défaut; la fonction de chronométrage dépend de la plateforme d'exécution (se référer au *doc string* du module). *stmt* et *setup* peuvent contenir plusieurs instructions séparées par des ``;`` ou des sauts de lignes tant qu'ils ne comportent pas de littéraux sur plusieurs lignes. L'instruction est exécutée dans l'espace de nommage de *timeit* par défaut ; ce comportement peut être modifié en passant un espace de nommage au paramètre *globals*.

source: To measure the execution time of the first statement, use the :meth:`.timeit` method. The :meth:`.repeat` and :meth:`.autorange` methods are convenience methods to call :meth:`.timeit` multiple times.
fr: Pour mesurer le temps d'exécution de la première instruction, utilisez la méthode :meth:`.timeit`. Les méthodes :meth:`.repeat` et :meth:`.autorange` sont des méthodes d'agrément permettant d'appeler :meth:`.timeit` à plusieurs reprises.

source: The execution time of *setup* is excluded from the overall timed execution run.
fr: Le temps d'exécution de *setup* n'est pas pris en compte dans le temps global d'exécution.

source: The *stmt* and *setup* parameters can also take objects that are callable without arguments. This will embed calls to them in a timer function that will then be executed by :meth:`.timeit`. Note that the timing overhead is a little larger in this case because of the extra function calls.
fr: Les paramètres *stmt* et *setup* peuvent également recevoir des objets appelables sans argument. Ceci transforme alors les appels à ces objets en fonction de chronométrage qui seront exécutées par :meth:`.timeit`. Notez que le surcoût lié à la mesure du temps d'exécution dans ce cas est légèrement supérieur en raisons des appels de fonction supplémentaires.

source: Time *number* executions of the main statement. This executes the setup statement once, and then returns the time it takes to execute the main statement a number of times, measured in seconds as a float. The argument is the number of times through the loop, defaulting to one million. The main statement, the setup statement and the timer function to be used are passed to the constructor.
fr: Mesure le temps *number* exécution de l'instruction principale. Ceci exécute l'instruction de mise en place une seule fois puis renvoie un flottant correspondant au temps nécessaire à l'exécution de l'instruction principale à plusieurs reprises, mesuré en secondes. L'argument correspond au nombre d'itérations dans la boucle, par défaut un million. L'instruction principale, l'instruction de mise en place et la fonction de chronométrage utilisée sont passées au constructeur.

source: By default, :meth:`.timeit` temporarily turns off :term:`garbage collection` during the timing. The advantage of this approach is that it makes independent timings more comparable. The disadvantage is that GC may be an important component of the performance of the function being measured. If so, GC can be re-enabled as the first statement in the *setup* string. For example::
fr: Par défaut, :meth:`.timeit` désactive temporairement le :term:`ramasse-miettes` pendant le chronométrage. Cette approche a l'avantage de permettre de comparer des mesures indépendantes. L'inconvénient de cette méthode est que le ramasse-miettes peut avoir un impact significatif sur les performances de la fonction étudiée. Dans ce cas, le ramasse-miettes peut être réactivé en première instruction de la chaîne *setup*. Par exemple ::

source: Automatically determine how many times to call :meth:`.timeit`.
fr: Détermine automatiquement combien de fois appeler :meth:`.timeit`.

source: This is a convenience function that calls :meth:`.timeit` repeatedly so that the total time >= 0.2 second, returning the eventual (number of loops, time taken for that number of loops). It calls :meth:`.timeit` with increasing numbers from the sequence 1, 2, 5, 10, 20, 50, ... until the time taken is at least 0.2 second.
fr: Cette fonction d'agrément appelle :meth:`.timeit` à plusieurs reprises jusqu'à ce que le temps total écoulé soit supérieur à 0,2 secondes et renvoie le couple (nombre de boucles, temps nécessaire pour exécuter ce nombre de boucles). Elle appelle :meth:`.timeit` avec un nombre d'itérations croissant selon la séquence 1, 2, 5, 10, 20, 50, … jusqu'à ce que le temps d'exécution dépasse 0,2 secondes.

source: If *callback* is given and is not ``None``, it will be called after each trial with two arguments: ``callback(number, time_taken)``.
fr: Si *callback* est spécifié et n'est pas ``None``, elle est appelée après chaque itération avec deux arguments (numéro de l'itération et temps écoulé) : ``callback(number, time_taken)``.

source: Call :meth:`.timeit` a few times.
fr: Appelle :meth:`.timeit` plusieurs fois.

source: This is a convenience function that calls the :meth:`.timeit` repeatedly, returning a list of results. The first argument specifies how many times to call :meth:`.timeit`. The second argument specifies the *number* argument for :meth:`.timeit`.
fr: Cette fonction d'agrément appelle :meth:`.timeit` à plusieurs reprises et renvoie une liste de résultats. Le premier argument spécifie le nombre d'appels à :meth:`.timeit`. Le second argument spécifie l'argument *number* de :meth:`.timeit`.

source: It's tempting to calculate mean and standard deviation from the result vector and report these. However, this is not very useful. In a typical case, the lowest value gives a lower bound for how fast your machine can run the given code snippet; higher values in the result vector are typically not caused by variability in Python's speed, but by other processes interfering with your timing accuracy. So the :func:`min` of the result is probably the only number you should be interested in. After that, you should look at the entire vector and apply common sense rather than statistics.
fr: Il est tentant de vouloir calculer la moyenne et l'écart-type des résultats et notifier ces valeurs. Ce n'est cependant pas très utile. En pratique, la valeur la plus basse donne une estimation basse de la vitesse maximale à laquelle votre machine peut exécuter le fragment de code spécifié ; les valeurs hautes de la liste sont typiquement provoquées non pas par une variabilité de la vitesse d'exécution de Python, mais par d'autres processus interférant avec la précision du chronométrage. Le :func:`min` du résultat est probablement la seule valeur à laquelle vous devriez vous intéresser. Pour aller plus loin, vous devriez regarder l'intégralité des résultats et utiliser le bon sens plutôt que les statistiques.

source: Helper to print a traceback from the timed code.
fr: Outil permettant d'afficher la trace du code chronométré.

source: Typical use::
fr: Usage typique ::

source: The advantage over the standard traceback is that source lines in the compiled template will be displayed. The optional *file* argument directs where the traceback is sent; it defaults to :data:`sys.stderr`.
fr: L'avantage par rapport à la trace standard est que les lignes sources du code compilé sont affichées. Le paramètre optionnel *file* définit l'endroit où la trace est envoyée, par défaut :data:`sys.stderr`.

source: Command-Line Interface
fr: Interface en ligne de commande

source: When called as a program from the command line, the following form is used::
fr: Lorsque le module est appelé comme un programme en ligne de commande, la syntaxe suivante est utilisée ::

source: Where the following options are understood:
fr: Les options suivantes sont gérées :

source: how many times to execute 'statement'
fr: nombre d'exécutions de l'instruction *statement*

source: how many times to repeat the timer (default 5)
fr: nombre de répétitions du chronomètre (5 par défaut)

source: statement to be executed once initially (default ``pass``)
fr: instruction exécutée une seule fois à l'initialisation (``pass`` par défaut)

source: measure process time, not wallclock time, using :func:`time.process_time` instead of :func:`time.perf_counter`, which is the default
fr: mesure le temps au niveau du processus et non au niveau du système, en utilisant :func:`time.process_time` plutôt que :func:`time.perf_counter` qui est utilisée par défaut

source: specify a time unit for timer output; can select nsec, usec, msec, or sec
fr: spécifie l'unité de temps utilisée pour la sortie du chronomètre (parmi *nsec*, *usec*, *msec* ou *sec*)

source: print raw timing results; repeat for more digits precision
fr: affiche les temps d'exécutions bruts, répéter pour plus de précision

source: print a short usage message and exit
fr: affiche un court message d'aide puis quitte

source: A multi-line statement may be given by specifying each line as a separate statement argument; indented lines are possible by enclosing an argument in quotes and using leading spaces. Multiple :option:`-s` options are treated similarly.
fr: Une instruction sur plusieurs lignes peut être donnée en entrée en spécifiant chaque ligne comme un argument séparé. Indenter une ligne est possible en encadrant l'argument de guillemets et en le préfixant par des espaces. Plusieurs :option:`-s` sont gérées de la même façon.

source: If :option:`-n` is not given, a suitable number of loops is calculated by trying successive powers of 10 until the total time is at least 0.2 seconds.
fr: Si :option:`-n` n'est pas donnée, le nombre de boucles adapté est déterminé automatiquement en essayant les puissances de 10 successives jusqu'à ce que le temps total d'exécution dépasse 0,2 secondes.

source: :func:`default_timer` measurements can be affected by other programs running on the same machine, so the best thing to do when accurate timing is necessary is to repeat the timing a few times and use the best time. The :option:`-r` option is good for this; the default of 5 repetitions is probably enough in most cases. You can use :func:`time.process_time` to measure CPU time.
fr: Les mesures de :func:`default_timer` peuvent être altérées par d'autres programmes s'exécutant sur la même machine. La meilleure approche lorsqu'un chronométrage exact est nécessaire est de répéter celui-ci à plusieurs reprises et considérer le meilleur temps. L'option :option:`-r` est adaptée à ce fonctionnement, les cinq répétitions par défaut suffisent probablement dans la plupart des cas. Vous pouvez utiliser :func:`time.process_time` pour mesurer le temps processeur.

source: There is a certain baseline overhead associated with executing a pass statement. The code here doesn't try to hide it, but you should be aware of it. The baseline overhead can be measured by invoking the program without arguments, and it might differ between Python versions.
fr: Il existe un surcoût minimal associé à l'exécution de l'instruction `pass`. Le code présenté ici ne tente pas de le masquer, mais vous devez être conscient de son existence. Ce surcoût minimal peut être mesuré en invoquant le programme sans argument ; il peut différer en fonction des versions de Python.

source: Examples
fr: Exemples

source: It is possible to provide a setup statement that is executed only once at the beginning:
fr: Il est possible de fournir une instruction de mise en place exécutée une seule fois au début du chronométrage :

source: The same can be done using the :class:`Timer` class and its methods::
fr: La même chose peut être réalisée en utilisant la classe :class:`Timer` et ses méthodes ::

source: The following examples show how to time expressions that contain multiple lines. Here we compare the cost of using :func:`hasattr` vs. :keyword:`try`/:keyword:`except` to test for missing and present object attributes:
fr: Les exemples qui suivent montrent comment chronométrer des expressions sur plusieurs lignes. Nous comparons ici le coût d'utilisation de :func:`hasattr` par rapport à :keyword:`try`/:keyword:`except` pour tester la présence ou l'absence d'attributs d'un objet :

source: To give the :mod:`timeit` module access to functions you define, you can pass a *setup* parameter which contains an import statement::
fr: Afin de permettre à :mod:`timeit` d'accéder aux fonctions que vous avez définies, vous pouvez passer au paramètre *setup* une instruction d'importation ::

source: Another option is to pass :func:`globals` to the *globals* parameter, which will cause the code to be executed within your current global namespace. This can be more convenient than individually specifying imports::
fr: Une autre possibilité est de passer :func:`globals` au paramètre *globals*, ceci qui exécutera le code dans l'espace de nommage global courant. Cela peut être plus pratique que de spécifier manuellement des importations ::
