Repository: python/python-docs-fr
Catalog: library/time.po
Languages: fr

source: :mod:`time` --- Time access and conversions
fr: :mod:`time` — Accès au temps et conversions

source: This module provides various time-related functions. For related functionality, see also the :mod:`datetime` and :mod:`calendar` modules.
fr: Ce module fournit différentes fonctions liées au temps. Pour les fonctionnalités associées, voir aussi les modules :mod:`datetime` et :mod:`calendar`.

source: Although this module is always available, not all functions are available on all platforms. Most of the functions defined in this module call platform C library functions with the same name. It may sometimes be helpful to consult the platform documentation, because the semantics of these functions varies among platforms.
fr: Bien que ce module soit toujours disponible, toutes les fonctions ne sont pas disponibles sur toutes les plateformes. La plupart des fonctions définies dans ce module délèguent à des fonctions de même nom de la bibliothèque C. Il peut parfois être utile de consulter la documentation de la plate-forme, car la sémantique de ces fonctions peut varier.

source: An explanation of some terminology and conventions is in order.
fr: Vous trouvez ci-dessous, mises en ordre, quelques explications relative à la terminologie et aux conventions.

source: The :dfn:`epoch` is the point where the time starts, and is platform dependent. For Unix, the epoch is January 1, 1970, 00:00:00 (UTC). To find out what the epoch is on a given platform, look at ``time.gmtime(0)``.
fr: L':dfn:`epoch` est le point de départ du temps et dépend de la plate-forme. Pour Unix, *epoch* est le 1\ :sup:`er` janvier 1970 à 00:00:00 (UTC). Pour savoir comment est définie *epoch* sur une plate-forme donnée, regardez ``time.gmtime(0)``.

source: The term :dfn:`seconds since the epoch` refers to the total number of elapsed seconds since the epoch, typically excluding `leap seconds`_. Leap seconds are excluded from this total on all POSIX-compliant platforms.
fr: Le terme :dfn:`secondes depuis *epoch*` désigne le nombre total de secondes écoulées depuis *epoch*, souvent en excluant les secondes intercalaires (`leap seconds`_). Les secondes intercalaires sont exclues de ce total sur toutes les plates-formes conformes POSIX.

source: The functions in this module may not handle dates and times before the epoch or far in the future. The cut-off point in the future is determined by the C library; for 32-bit systems, it is typically in 2038.
fr: Les fonctions de ce module peuvent ne pas gérer les dates et heures antérieures à *epoch* ou dans un avenir lointain. Le seuil du futur est déterminé par la bibliothèque C ; pour les systèmes 32 bits, il s’agit généralement de 2038.

source: UTC is Coordinated Universal Time (formerly known as Greenwich Mean Time, or GMT). The acronym UTC is not a mistake but a compromise between English and French.
fr: UTC désigne le temps universel coordonné (*Coordinated Universal Time* en anglais), anciennement l'heure de Greenwich (ou GMT). L'acronyme UTC n'est pas une erreur mais un compromis entre l'anglais et le français.

source: DST is Daylight Saving Time, an adjustment of the timezone by (usually) one hour during part of the year. DST rules are magic (determined by local law) and can change from year to year. The C library has a table containing the local rules (often it is read from a system file for flexibility) and is the only source of True Wisdom in this respect.
fr: Le DST (*Daylight Saving Time*) correspond à l’heure d’été, un ajustement du fuseau horaire d’une heure (généralement) pendant une partie de l’année. Les règles de DST sont magiques (déterminées par la loi locale) et peuvent changer d’année en année. La bibliothèque C possède une table contenant les règles locales (souvent, elle est lue dans un fichier système par souci de souplesse) et constitue la seule source fiable.

source: The precision of the various real-time functions may be less than suggested by the units in which their value or argument is expressed. E.g. on most Unix systems, the clock "ticks" only 50 or 100 times a second.
fr: La précision des diverses fonctions en temps réel peut être inférieure à celle suggérée par les unités dans lesquelles leur valeur ou leur argument est exprimé. Par exemple, sur la plupart des systèmes Unix, l’horloge ne « bat » que 50 ou 100 fois par seconde.

source: On the other hand, the precision of :func:`.time` and :func:`sleep` is better than their Unix equivalents: times are expressed as floating point numbers, :func:`.time` returns the most accurate time available (using Unix :c:func:`gettimeofday` where available), and :func:`sleep` will accept a time with a nonzero fraction (Unix :c:func:`select` is used to implement this, where available).
fr: D’autre part, la précision de :func:`.time` et :func:`sleep` est meilleure que leurs équivalents Unix : les temps sont exprimés en nombres à virgule flottante, :func:`.time` renvoie le temps le plus précis disponible (en utilisant :c:func:`gettimeofday` d'Unix si elle est disponible), et :func:`sleep` accepte le temps avec une fraction non nulle (:c:func:`select` d'Unix est utilisée pour l’implémenter, si elle est disponible).

source: The time value as returned by :func:`gmtime`, :func:`localtime`, and :func:`strptime`, and accepted by :func:`asctime`, :func:`mktime` and :func:`strftime`, is a sequence of 9 integers. The return values of :func:`gmtime`, :func:`localtime`, and :func:`strptime` also offer attribute names for individual fields.
fr: La valeur temporelle renvoyée par :func:`gmtime`, :func:`localtime` et :func:`strptime`, et acceptée par :func:`asctime`, :func:`mktime` et :func:`strftime`, est une séquence de 9 nombres entiers. Les valeurs de retour de :func:`gmtime`, :func:`localtime` et :func:`strptime` proposent également des noms d’attributs pour des champs individuels.

source: See :class:`struct_time` for a description of these objects.
fr: Voir :class:`struct_time` pour une description de ces objets.

source: The :class:`struct_time` type was extended to provide the :attr:`tm_gmtoff` and :attr:`tm_zone` attributes when platform supports corresponding ``struct tm`` members.
fr: Le type :class:`struct_time` a été étendu pour fournir les attributs :attr:`tm_gmtoff` et :attr:`tm_zone` lorsque la plateforme prend en charge les membres ``struct tm`` correspondants.

source: The :class:`struct_time` attributes :attr:`tm_gmtoff` and :attr:`tm_zone` are now available on all platforms.
fr: Les attributs :class:`struct_time` :attr:`tm_gmtoff` et :attr:`tm_zone` sont maintenant disponibles sur toutes les plateformes.

source: Use the following functions to convert between time representations:
fr: Utilisez les fonctions suivantes pour convertir des représentations temporelles :

source: From
fr: De

source: To
fr: À

source: Use
fr: Utilisez

source: seconds since the epoch
fr: secondes depuis *epoch*

source: :class:`struct_time` in UTC
fr: :class:`struct_time` en UTC

source: :class:`struct_time` in local time
fr: :class:`struct_time` en heure locale

source: Functions
fr: Fonctions

source: Convert a tuple or :class:`struct_time` representing a time as returned by :func:`gmtime` or :func:`localtime` to a string of the following form: ``'Sun Jun 20 23:21:05 1993'``. The day field is two characters long and is space padded if the day is a single digit, e.g.: ``'Wed Jun 9 04:26:40 1993'``.
fr: Convertit un n-uplet ou :class:`struct_time` représentant une heure renvoyée par :func:`gmtime` ou :func:`localtime` en une chaîne de la forme suivante : ``'Sun Jun 20 23:21:05 1993'``. Le numéro du jour est un champ de deux caractères complété par une espace si celui-ci n'a qu'un seul chiffre, par exemple : ``'Wed Jun 9 04:26:40 1993'``.

source: If *t* is not provided, the current time as returned by :func:`localtime` is used. Locale information is not used by :func:`asctime`.
fr: Si *t* n’est pas fourni, l’heure actuelle renvoyée par :func:`localtime` est utilisée. Les informations sur les paramètres régionaux ne sont pas utilisées par :func:`asctime`.

source: Unlike the C function of the same name, :func:`asctime` does not add a trailing newline.
fr: Contrairement à la fonction C du même nom, :func:`asctime` n’ajoute pas de caractère de fin de ligne.

source: Return the *clk_id* of the thread-specific CPU-time clock for the specified *thread_id*.
fr: Renvoie le *clk_id* de l'horloge du temps CPU spécifique au fil d'exécution pour le *thread_id* spécifié.

source: Use :func:`threading.get_ident` or the :attr:`~threading.Thread.ident` attribute of :class:`threading.Thread` objects to get a suitable value for *thread_id*.
fr: Utilisez :func:`threading.get_ident` ou l'attribut :attr:`~threading.Thread.ident` de :class:`threading.Thread` pour obtenir une valeur appropriée pour *thread_id*.

source: Passing an invalid or expired *thread_id* may result in undefined behavior, such as segmentation fault.
fr: Passer un *thread_id* invalide ou arrivé à expiration peut entraîner un comportement indéfini, tel qu’une erreur de segmentation.

source: :ref:`Availability <availability>`: Unix (see the man page for :manpage:`pthread_getcpuclockid(3)` for further information).
fr: :ref:`Disponibilité <availability>` : Unix (regardez la page man pour :manpage:`pthread_getcpuclockid(3)` pour plus d’information).

source: Return the resolution (precision) of the specified clock *clk_id*. Refer to :ref:`time-clock-id-constants` for a list of accepted values for *clk_id*.
fr: Renvoie la résolution (précision) de l’horloge *clk_id*. Référez-vous à :ref:`time-clock-id-constants` pour une liste des valeurs acceptées pour *clk_id*.

source: :ref:`Availability <availability>`: Unix.
fr: :ref:`Disponibilité <availability>` : Unix.

source: Return the time of the specified clock *clk_id*. Refer to :ref:`time-clock-id-constants` for a list of accepted values for *clk_id*.
fr: Renvoie l’heure de l’horloge *clk_id*. Référez-vous à :ref:`time-clock-id-constants` pour une liste des valeurs acceptées pour *clk_id*.

source: Similar to :func:`clock_gettime` but return time as nanoseconds.
fr: Similaire à :func:`clock_gettime` mais le temps renvoyé est exprimé en nanosecondes.

source: Set the time of the specified clock *clk_id*. Currently, :data:`CLOCK_REALTIME` is the only accepted value for *clk_id*.
fr: Définit l’heure de l’horloge *clk_id*. Actuellement, :data:`CLOCK_REALTIME` est la seule valeur acceptée pour *clk_id*.

source: Similar to :func:`clock_settime` but set time with nanoseconds.
fr: Similaire à :func:`clock_settime` mais définit l’heure avec des nanosecondes.

source: Convert a time expressed in seconds since the epoch to a string of a form: ``'Sun Jun 20 23:21:05 1993'`` representing local time. The day field is two characters long and is space padded if the day is a single digit, e.g.: ``'Wed Jun 9 04:26:40 1993'``.
fr: Convertit une heure exprimée en secondes depuis *epoch* en une chaîne représentant l’heure locale, sous la forme suivante : ``'Sun Jun 20 23:21:05 1993'``. Le numéro du jour est un champ de deux caractères complété par une espace si celui-ci n'a qu'un seul chiffre, par exemple : ``'Wed Jun 9 04:26:40 1993'``.

source: If *secs* is not provided or :const:`None`, the current time as returned by :func:`.time` is used. ``ctime(secs)`` is equivalent to ``asctime(localtime(secs))``. Locale information is not used by :func:`ctime`.
fr: Si *secs* n’est pas fourni ou vaut :const:`None`, l’heure actuelle renvoyée par :func:`.time` est utilisée. ``ctime(secs)`` est équivalent à ``asctime(localtime(secs))``. Les informations sur les paramètres régionaux ne sont pas utilisées par :func:`ctime`.

source: Get information on the specified clock as a namespace object. Supported clock names and the corresponding functions to read their value are:
fr: Renvoie des informations sur l’horloge spécifiée en tant qu’objet d’espace de nom. Les noms d’horloge pris en charge et les fonctions correspondantes permettant de lire leur valeur sont les suivants :

source: The result has the following attributes:
fr: Le résultat a les attributs suivants :

source: *adjustable*: ``True`` if the clock can be changed automatically (e.g. by a NTP daemon) or manually by the system administrator, ``False`` otherwise
fr: *adjustable* : ``True`` si l’horloge peut être changée automatiquement (par exemple par un démon NTP) ou manuellement par l’administrateur système, ``False`` autrement

source: *implementation*: The name of the underlying C function used to get the clock value. Refer to :ref:`time-clock-id-constants` for possible values.
fr: *implementation* : nom de la fonction C sous-jacente utilisée pour obtenir la valeur d’horloge. Voir :ref:`time-clock-id-constants` pour les valeurs possibles.

source: *monotonic*: ``True`` if the clock cannot go backward, ``False`` otherwise
fr: *monotonic* : ``True`` si l’horloge ne peut pas revenir en arrière, ``False`` autrement

source: *resolution*: The resolution of the clock in seconds (:class:`float`)
fr: *resolution* : La résolution de l’horloge en secondes (:class:`float`)

source: Convert a time expressed in seconds since the epoch to a :class:`struct_time` in UTC in which the dst flag is always zero. If *secs* is not provided or :const:`None`, the current time as returned by :func:`.time` is used. Fractions of a second are ignored. See above for a description of the :class:`struct_time` object. See :func:`calendar.timegm` for the inverse of this function.
fr: Convertit un temps exprimé en secondes depuis *epoch* en un :class:`struct_time` au format UTC dans lequel le drapeau *dst* est toujours égal à zéro. Si *secs* n’est pas fourni ou vaut :const:`None`, l’heure actuelle renvoyée par :func:`.time` est utilisée. Les fractions de seconde sont ignorées. Voir ci-dessus pour une description de l’objet :class:`struct_time`. Voir :func:`calendar.timegm` pour l’inverse de cette fonction.

source: Like :func:`gmtime` but converts to local time. If *secs* is not provided or :const:`None`, the current time as returned by :func:`.time` is used. The dst flag is set to ``1`` when DST applies to the given time.
fr: Comme :func:`gmtime` mais convertit le résultat en heure locale. Si *secs* n’est pas fourni ou vaut :const:`None`, l’heure actuelle renvoyée par :func:`.time` est utilisée. Le drapeau *dst* est mis à ``1`` lorsque l’heure d’été s’applique à l’heure indiquée.

source: This is the inverse function of :func:`localtime`. Its argument is the :class:`struct_time` or full 9-tuple (since the dst flag is needed; use ``-1`` as the dst flag if it is unknown) which expresses the time in *local* time, not UTC. It returns a floating point number, for compatibility with :func:`.time`. If the input value cannot be represented as a valid time, either :exc:`OverflowError` or :exc:`ValueError` will be raised (which depends on whether the invalid value is caught by Python or the underlying C libraries). The earliest date for which it can generate a time is platform-dependent.
fr: C’est la fonction inverse de :func:`localtime`. Son argument est soit un :class:`struct_time` soit un 9-tuple (puisque le drapeau *dst* est nécessaire ; utilisez ``-1`` comme drapeau *dst* s’il est inconnu) qui exprime le temps **local**, pas UTC. Il retourne un nombre à virgule flottante, pour compatibilité avec :func:`.time`. Si la valeur d’entrée ne peut pas être représentée comme une heure valide, soit :exc:`OverflowError` ou :exc:`ValueError` sera levée (selon que la valeur non valide est interceptée par Python ou par les bibliothèque C sous-jacentes). La date la plus proche pour laquelle il peut générer une heure dépend de la plate-forme.

source: Return the value (in fractional seconds) of a monotonic clock, i.e. a clock that cannot go backwards. The clock is not affected by system clock updates. The reference point of the returned value is undefined, so that only the difference between the results of consecutive calls is valid.
fr: Renvoie la valeur (en quelques fractions de secondes) d’une horloge monotone, c’est-à-dire une horloge qui ne peut pas revenir en arrière. L’horloge n’est pas affectée par les mises à jour de l’horloge système. Le point de référence de la valeur renvoyée n’est pas défini, de sorte que seule la différence entre les résultats d’appels consécutifs est valide.

source: The function is now always available and always system-wide.
fr: La fonction est maintenant toujours disponible et toujours à l’échelle du système.

source: Similar to :func:`monotonic`, but return time as nanoseconds.
fr: Similaire à :func:`monotonique`, mais le temps de retour est exprimé en nanosecondes.

source: Return the value (in fractional seconds) of a performance counter, i.e. a clock with the highest available resolution to measure a short duration. It does include time elapsed during sleep and is system-wide. The reference point of the returned value is undefined, so that only the difference between the results of consecutive calls is valid.
fr: Renvoie la valeur (en quelques fractions de secondes) d’un compteur de performance, c’est-à-dire une horloge avec la résolution disponible la plus élevée possible pour mesurer une courte durée. Cela inclut le temps écoulé pendant le sommeil et concerne l’ensemble du système. Le point de référence de la valeur renvoyée n’est pas défini, de sorte que seule la différence entre les résultats d’appels consécutifs est valide.

source: Similar to :func:`perf_counter`, but return time as nanoseconds.
fr: Similaire à :func:`perf_counter`, mais renvoie le temps en nanosecondes.

source: Return the value (in fractional seconds) of the sum of the system and user CPU time of the current process. It does not include time elapsed during sleep. It is process-wide by definition. The reference point of the returned value is undefined, so that only the difference between the results of consecutive calls is valid.
fr: Renvoie la valeur (en quelques fractions de secondes) de la somme des temps système et utilisateur du processus en cours. Il ne comprend pas le temps écoulé pendant le sommeil. C’est un processus par définition. Le point de référence de la valeur renvoyée n’est pas défini, de sorte que seule la différence entre les résultats d’appels consécutifs est valide.

source: Similar to :func:`process_time` but return time as nanoseconds.
fr: Similaire à :func:`process_time` mais renvoie le temps en nanosecondes.

source: Suspend execution of the calling thread for the given number of seconds. The argument may be a floating point number to indicate a more precise sleep time. The actual suspension time may be less than that requested because any caught signal will terminate the :func:`sleep` following execution of that signal's catching routine. Also, the suspension time may be longer than requested by an arbitrary amount because of the scheduling of other activity in the system.
fr: Suspend l’exécution du thread appelant pendant le nombre de secondes indiqué. L’argument peut être un nombre à virgule flottante pour indiquer un temps de sommeil plus précis. Le temps de suspension réel peut être inférieur à celui demandé, car tout signal capturé mettra fin à la commande :func:`sleep` après l’exécution de la routine de capture de ce signal. En outre, le temps de suspension peut être plus long que celui demandé par un montant arbitraire en raison de la planification d’une autre activité dans le système.

source: The function now sleeps at least *secs* even if the sleep is interrupted by a signal, except if the signal handler raises an exception (see :pep:`475` for the rationale).
fr: La fonction dort maintenant au moins *secondes* même si le sommeil est interrompu par un signal, sauf si le gestionnaire de signaux lève une exception (voir :pep:`475` pour la justification).

source: Convert a tuple or :class:`struct_time` representing a time as returned by :func:`gmtime` or :func:`localtime` to a string as specified by the *format* argument. If *t* is not provided, the current time as returned by :func:`localtime` is used. *format* must be a string. :exc:`ValueError` is raised if any field in *t* is outside of the allowed range.
fr: Convertit un *tuple* ou :class:`struct_time` représentant une heure renvoyée par :func:`gmtime` ou :func:`localtime` en une chaîne spécifiée par l’argument *format*. Si *t* n’est pas fourni, l’heure actuelle renvoyée par :func:`localtime` est utilisée. *format* doit être une chaîne. Si l’un des champs de *t* se situe en dehors de la plage autorisée, une :exc:`ValueError` est levée .

source: 0 is a legal argument for any position in the time tuple; if it is normally illegal the value is forced to a correct one.
fr: 0 est un argument légal pour toute position dans le *tuple* temporel ; s’il est normalement illégal, la valeur est forcée à une valeur correcte.

source: The following directives can be embedded in the *format* string. They are shown without the optional field width and precision specification, and are replaced by the indicated characters in the :func:`strftime` result:
fr: Les directives suivantes peuvent être incorporées dans la chaîne *format*. Ils sont affichés sans la spécification facultative de largeur de champ ni de précision, et sont remplacés par les caractères indiqués dans le résultat de :func:`strftime` :

source: Meaning
fr: Signification

source: Locale's abbreviated weekday name.
fr: Nom abrégé du jour de la semaine selon les paramètres régionaux.

source: Locale's full weekday name.
fr: Le nom de semaine complet de la région.

source: Locale's abbreviated month name.
fr: Nom abrégé du mois de la région.

source: Locale's full month name.
fr: Nom complet du mois de la région.

source: Locale's appropriate date and time representation.
fr: Représentation appropriée de la date et de l’heure selon les paramètres régionaux.

source: Day of the month as a decimal number [01,31].
fr: Jour du mois sous forme décimale [01,31].

source: Hour (24-hour clock) as a decimal number [00,23].
fr: Heure (horloge sur 24 heures) sous forme de nombre décimal [00,23].

source: Hour (12-hour clock) as a decimal number [01,12].
fr: Heure (horloge sur 12 heures) sous forme de nombre décimal [01,12].

source: Day of the year as a decimal number [001,366].
fr: Jour de l’année sous forme de nombre décimal [001,366].

source: Month as a decimal number [01,12].
fr: Mois sous forme décimale [01,12].

source: Minute as a decimal number [00,59].
fr: Minutes sous forme décimale [00,59].

source: Locale's equivalent of either AM or PM.
fr: L’équivalent local de AM ou PM.

source: Second as a decimal number [00,61].
fr: Deuxième sous forme de nombre décimal [00,61].

source: Week number of the year (Sunday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Sunday are considered to be in week 0.
fr: Numéro de semaine de l’année (dimanche en tant que premier jour de la semaine) sous forme décimale [00,53]. Tous les jours d’une nouvelle année précédant le premier dimanche sont considérés comme appartenant à la semaine 0.

source: Weekday as a decimal number [0(Sunday),6].
fr: Jour de la semaine sous forme de nombre décimal [0 (dimanche), 6].

source: Week number of the year (Monday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Monday are considered to be in week 0.
fr: Numéro de semaine de l’année (lundi comme premier jour de la semaine) sous forme décimale [00,53]. Tous les jours d’une nouvelle année précédant le premier lundi sont considérés comme appartenant à la semaine 0.

source: Locale's appropriate date representation.
fr: Représentation de la date appropriée par les paramètres régionaux.

source: Locale's appropriate time representation.
fr: Représentation locale de l'heure.
