Repository: python/python-docs-fr
Catalog: library/tkinter.tix.po
Languages: fr

source: The `Form <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixForm.htm>`_ geometry manager based on attachment rules for all Tk widgets.
fr: Le gestionnaire de géométrie `Form <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixForm.htm>`_ basé sur les règles de connexions pour tous les widgets *Tk*.

source: Tix Commands
fr: Commandes *Tix*

source: The `tix commands <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tix.htm>`_ provide access to miscellaneous elements of :mod:`Tix`'s internal state and the :mod:`Tix` application context. Most of the information manipulated by these methods pertains to the application as a whole, or to a screen or display, rather than to a particular window.
fr: Les commandes `tix <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tix.htm>`_ permettent d'accéder à divers éléments de l'état interne de :mod:`Tix` et du contexte d'application :mod:`Tix`. La plupart des informations manipulées par ces méthodes concernent l'application dans son ensemble, ou un écran ou un affichage, plutôt qu'une fenêtre particulière.

source: To view the current settings, the common usage is::
fr: Pour afficher les paramètres actuels, l'utilisation courante est ::

source: Query or modify the configuration options of the Tix application context. If no option is specified, returns a dictionary all of the available options. If option is specified with no value, then the method returns a list describing the one named option (this list will be identical to the corresponding sublist of the value returned if no option is specified). If one or more option-value pairs are specified, then the method modifies the given option(s) to have the given value(s); in this case the method returns an empty string. Option may be any of the configuration options.
fr: Interroge ou modifie les options de configuration du contexte applicatif *Tix*. Si aucune option n'est spécifiée, renvoie un dictionnaire de toutes les options disponibles. Si l'option est spécifiée sans valeur, alors la méthode renvoie une liste décrivant l'option nommée (cette liste sera identique à la sous-liste correspondante de la valeur renvoyée si aucune option n'est spécifiée). Si une ou plusieurs paires option-valeur sont spécifiées, alors la méthode modifie la ou les options données pour avoir la ou les valeurs données ; dans ce cas, la méthode renvoie une chaîne vide. L'option peut être n'importe laquelle des options de configuration.

source: Returns the current value of the configuration option given by *option*. Option may be any of the configuration options.
fr: Renvoie la valeur actuelle de l'option de configuration donnée par *option*. L'option peut être n'importe laquelle des options de configuration.

source: Locates a bitmap file of the name ``name.xpm`` or ``name`` in one of the bitmap directories (see the :meth:`tix_addbitmapdir` method). By using :meth:`tix_getbitmap`, you can avoid hard coding the pathnames of the bitmap files in your application. When successful, it returns the complete pathname of the bitmap file, prefixed with the character ``@``. The returned value can be used to configure the ``bitmap`` option of the Tk and Tix widgets.
fr: Cherche un fichier bitmap du nom ``name.xpm`` ou ``name`` dans l'un des répertoires bitmap (voir la méthode :meth:`tix_addbitmapdir`). En utilisant :meth:`tix_getbitmap`, vous pouvez éviter de coder en dur les noms de chemin des fichiers bitmap dans votre application. En cas de succès, il renvoie le chemin d'accès complet du fichier bitmap, préfixé par le caractère ``@``. La valeur renvoyée peut être utilisée pour configurer l'option ``bitmap`` des widgets *Tk* et *Tix*.

source: Tix maintains a list of directories under which the :meth:`tix_getimage` and :meth:`tix_getbitmap` methods will search for image files. The standard bitmap directory is :file:`$TIX_LIBRARY/bitmaps`. The :meth:`tix_addbitmapdir` method adds *directory* into this list. By using this method, the image files of an applications can also be located using the :meth:`tix_getimage` or :meth:`tix_getbitmap` method.
fr: *Tix* maintient une liste de répertoires dans lesquels les méthodes :meth:`tix_getimage` et :meth:`tix_getbitmap` recherchent les fichiers images. Le répertoire bitmap standard est :file:`$TIX_LIBRARY/bitmaps`. La méthode :meth:`tix_addbitmapdir` ajoute *directory* dans cette liste. En utilisant cette méthode, les fichiers images d'une application peuvent également être localisés en utilisant la méthode :meth:`tix_getimage` ou :meth:`tix_getbitmap`.

source: Returns the file selection dialog that may be shared among different calls from this application. This method will create a file selection dialog widget when it is called the first time. This dialog will be returned by all subsequent calls to :meth:`tix_filedialog`. An optional dlgclass parameter can be passed as a string to specified what type of file selection dialog widget is desired. Possible options are ``tix``, ``FileSelectDialog`` or ``tixExFileSelectDialog``.
fr: Renvoie la boîte de dialogue de sélection de fichier qui peut être partagée entre différents appels de cette application. Cette méthode crée un widget de dialogue de sélection de fichier lors de son premier appel. Cette boîte de dialogue est renvoyée par tous les appels ultérieurs à :meth:`tix_filedialog`. Un paramètre facultatif *dlgclass* peut être passé sous forme de chaîne pour spécifier le type de widget de dialogue de sélection de fichier souhaité. Les options possibles sont ``tix``, ``FileSelectDialog`` ou ``tixExFileSelectDialog``.

source: Locates an image file of the name :file:`name.xpm`, :file:`name.xbm` or :file:`name.ppm` in one of the bitmap directories (see the :meth:`tix_addbitmapdir` method above). If more than one file with the same name (but different extensions) exist, then the image type is chosen according to the depth of the X display: xbm images are chosen on monochrome displays and color images are chosen on color displays. By using :meth:`tix_getimage`, you can avoid hard coding the pathnames of the image files in your application. When successful, this method returns the name of the newly created image, which can be used to configure the ``image`` option of the Tk and Tix widgets.
fr: Localise un fichier image du nom :file:`name.xpm`, :file:`name.xbm` ou :file:`name.ppm` dans l'un des répertoires bitmap (voir la méthode :meth:`tix_addbitmapdir` ci-dessus). S'il existe plusieurs fichiers portant le même nom (mais avec des extensions différentes), le type d'image est choisi en fonction de la profondeur de l'affichage X : les images *xbm* sont choisies sur les écrans monochromes et les images couleurs sont choisies sur les écrans couleurs. En utilisant :meth:`tix_getimage`, vous pouvez éviter de coder en dur les noms de chemin des fichiers image dans votre application. En cas de succès, cette méthode renvoie le nom de l'image nouvellement créée, qui peut être utilisée pour configurer l'option ``image`` des widgets *Tk* et *Tix*.

source: Gets the options maintained by the Tix scheme mechanism.
fr: Obtient les options maintenues par le mécanisme de schéma *Tix*.

source: Resets the scheme and fontset of the Tix application to *newScheme* and *newFontSet*, respectively. This affects only those widgets created after this call. Therefore, it is best to call the resetoptions method before the creation of any widgets in a Tix application.
fr: Réinitialise le schéma et le jeu de polices de l'application *Tix* sur *newScheme* et *newFontSet*, respectivement. Cela n'affecte que les widgets créés après cet appel. Par conséquent, il est préférable d'appeler la méthode *resetoptions* avant la création de tout widget dans une application *Tix*.

source: The optional parameter *newScmPrio* can be given to reset the priority level of the Tk options set by the Tix schemes.
fr: Le paramètre facultatif *newScmPrio* peut être donné pour réinitialiser le niveau de priorité des options *Tk* définies par les schémas *Tix*.

source: Because of the way Tk handles the X option database, after Tix has been has imported and inited, it is not possible to reset the color schemes and font sets using the :meth:`tix_config` method. Instead, the :meth:`tix_resetoptions` method must be used.
fr: En raison de la façon dont *Tk* gère la base de données d'options X, après l'importation et l'initialisation de *Tix*, il n'est pas possible de réinitialiser les schémas de couleurs et les jeux de polices à l'aide de la méthode :meth:`tix_config`. À la place, la méthode :meth:`tix_resetoptions` doit être utilisée.
