Repository: python/python-docs-fr
Catalog: library/tkinter.po
Languages: fr

source: Notice how the widget field of the event is being accessed in the ``turn_red()`` callback. This field contains the widget that caught the X event. The following table lists the other event fields you can access, and how they are denoted in Tk, which can be useful when referring to the Tk man pages.
fr: Remarquez comment on accède au champ *objet graphique* de l'événement dans la fonction de rappel ``turn_red()``. Ce champ contient l'objet graphique qui a capturé l'événement Xorg. Le tableau suivant répertorie les autres champs d'événements auxquels vous pouvez accéder, et comment ils sont nommés dans Tk, ce qui peut être utile lorsque vous vous référez aux pages de manuel Tk.

source: Tkinter Event Field
fr: Champ *évènement* de Tkinter

source: height
fr: hauteur

source: The index Parameter
fr: Le paramètre index

source: A number of widgets require "index" parameters to be passed. These are used to point at a specific place in a Text widget, or to particular characters in an Entry widget, or to particular menu items in a Menu widget.
fr: Un certain nombre d'objets graphiques nécessitent le passage de paramètres « indicés ». Ils sont utilisés pour pointer vers un endroit spécifique dans un objet graphique de type *Texte*, ou vers des caractères particuliers dans un objet graphique de type *Entrée*, ou vers des éléments de menu particuliers dans un objet graphique de type *Menu*.

source: Entry widget indexes (index, view index, etc.)
fr: Index des objets graphique de type *Entrée* (``index``, ``view index``, etc.)

source: Entry widgets have options that refer to character positions in the text being displayed. You can use these :mod:`tkinter` functions to access these special points in text widgets:
fr: Les objets graphiques de type *Entrée* ont des options qui se réfèrent à la position des caractères dans le texte affiché. Vous pouvez utiliser ces fonctions :mod:`tkinter` pour accéder à ces points spéciaux dans les objets graphiques texte :

source: Text widget indexes
fr: Index des objets graphiques texte

source: The index notation for Text widgets is very rich and is best described in the Tk man pages.
fr: La notation de l'index des objets graphiques de type *Texte* est très riche et mieux décrite dans les pages du manuel Tk.

source: Menu indexes (menu.invoke(), menu.entryconfig(), etc.)
fr: Index menu (`menu.invoke()`, `menu.entryconfig()`, etc.)

source: Some options and methods for menus manipulate specific menu entries. Anytime a menu index is needed for an option or a parameter, you may pass in:
fr: Certaines options et méthodes pour manipuler les menus nécessitent des éléments de spécifiques. Chaque fois qu'un index de menu est nécessaire pour une option ou un paramètre, vous pouvez utiliser :

source: an integer which refers to the numeric position of the entry in the widget, counted from the top, starting with 0;
fr: un entier qui fait référence à la position numérique de l'entrée dans l'objet graphique, comptée à partir du haut, en commençant par 0 ;

source: the string ``"active"``, which refers to the menu position that is currently under the cursor;
fr: la chaîne de caractères ``"active"``, qui fait référence à la position du menu qui se trouve actuellement sous le curseur ;

source: the string ``"last"`` which refers to the last menu item;
fr: la chaîne de caractères ``"last"`` qui fait référence au dernier élément du menu ;

source: An integer preceded by ``@``, as in ``@6``, where the integer is interpreted as a y pixel coordinate in the menu's coordinate system;
fr: un entier précédé de ``@``, comme dans ``@6``, où l'entier est interprété comme une coordonnée y de pixels dans le système de coordonnées du menu ;

source: the string ``"none"``, which indicates no menu entry at all, most often used with menu.activate() to deactivate all entries, and finally,
fr: la chaîne de caractères ``"none"``, qui n'indique aucune entrée du menu, le plus souvent utilisée avec ``menu.activate()`` pour désactiver toutes les entrées, et enfin,

source: a text string that is pattern matched against the label of the menu entry, as scanned from the top of the menu to the bottom. Note that this index type is considered after all the others, which means that matches for menu items labelled ``last``, ``active``, or ``none`` may be interpreted as the above literals, instead.
fr: une chaîne de texte dont le motif correspond à l'étiquette de l'entrée de menu, telle qu'elle est balayée du haut vers le bas du menu. Notez que ce type d'index est considéré après tous les autres, ce qui signifie que les correspondances pour les éléments de menu étiquetés ``last``, ``active`` ou ``none`` peuvent être interprétés comme les littéraux ci-dessus, plutôt.

source: Images of different formats can be created through the corresponding subclass of :class:`tkinter.Image`:
fr: Des images de différents formats peuvent être créées à travers la sous-classe correspondante de :class:`tkinter.Image` :

source: :class:`BitmapImage` for images in XBM format.
fr: :class:`BitmapImage` pour les images au format *XBM*.

source: :class:`PhotoImage` for images in PGM, PPM, GIF and PNG formats. The latter is supported starting with Tk 8.6.
fr: :class:`PhotoImage` pour les images aux formats *PGM*, *PPM*, *GIF* et *PNG*. Ce dernier est géré à partir de Tk 8.6.

source: Either type of image is created through either the ``file`` or the ``data`` option (other options are available as well).
fr: L'un ou l'autre type d'image est créé par l'option ``file`` ou ``data`` (d'autres options sont également disponibles).

source: The image object can then be used wherever an ``image`` option is supported by some widget (e.g. labels, buttons, menus). In these cases, Tk will not keep a reference to the image. When the last Python reference to the image object is deleted, the image data is deleted as well, and Tk will display an empty box wherever the image was used.
fr: L'objet image peut alors être utilisé partout où un objet graphique sait gérer une option ``image`` (par ex. étiquettes, boutons, menus). Dans ces cas, Tk ne conserve pas de référence à l'image. Lorsque la dernière référence Python à l'objet image est supprimée, les données de l'image sont également supprimées, et Tk affiche une boite vide à l'endroit où l'image était utilisée.

source: The `Pillow <http://python-pillow.org/>`_ package adds support for formats such as BMP, JPEG, TIFF, and WebP, among others.
fr: Le paquet `Pillow <http://python-pillow.org/>`_ ajoute la prise en charge de formats tels que *BMP*, *JPEG*, *TIFF* et *WebP*, entre autres.

source: File Handlers
fr: Gestionnaires de fichiers

source: Tk allows you to register and unregister a callback function which will be called from the Tk mainloop when I/O is possible on a file descriptor. Only one handler may be registered per file descriptor. Example code::
fr: *Tk* vous permet d'enregistrer et de *désenregistrer* une fonction de rappel qui est appelée depuis la boucle principale de Tk lorsque des entrées-sorties sont possibles sur un descripteur de fichier. Un seul gestionnaire peut être enregistré par descripteur de fichier. Exemple de code ::

source: This feature is not available on Windows.
fr: Cette fonction n'est pas disponible sous Windows.

source: Since you don't know how many bytes are available for reading, you may not want to use the :class:`~io.BufferedIOBase` or :class:`~io.TextIOBase` :meth:`~io.BufferedIOBase.read` or :meth:`~io.IOBase.readline` methods, since these will insist on reading a predefined number of bytes. For sockets, the :meth:`~socket.socket.recv` or :meth:`~socket.socket.recvfrom` methods will work fine; for other files, use raw reads or ``os.read(file.fileno(), maxbytecount)``.
fr: Dans la mesure où vous ne savez pas combien d'octets sont disponibles en lecture, il ne faut pas utiliser les méthodes :class:`~io.BufferedIOBase` ou :class:`~io.TextIOBase` :meth:`~io.BufferedIOBase.read` ou :meth:`~io.IOBase.readline`, car elles requièrent d'indiquer le nombre de *bytes* à lire. Pour les connecteurs, les méthodes :meth:`~socket.socket.socket.recv` ou :meth:`~socket.socket.recvfrom` fonctionnent bien ; pour les autres fichiers, utilisez des lectures brutes ou ``os.read(file.fileno(), maxbytecount)``.

source: Registers the file handler callback function *func*. The *file* argument may either be an object with a :meth:`~io.IOBase.fileno` method (such as a file or socket object), or an integer file descriptor. The *mask* argument is an ORed combination of any of the three constants below. The callback is called as follows::
fr: Enregistre la fonction de rappel du gestionnaire de fichiers *func*. L'argument ``file`` peut être soit un objet avec une méthode :meth:`~io.IOBase.fileno` (comme un objet fichier ou connecteur), soit un descripteur de fichier de type entier. L'argument ``mask`` est une combinaison *OU* de l'une des trois constantes ci-dessous. La fonction de rappel s'utilise comme suit ::

source: Unregisters a file handler.
fr: Désenregistre un gestionnaire de fichiers.

source: Constants used in the *mask* arguments.
fr: Constantes utilisées dans les arguments ``mask``.
