Repository: python/python-docs-fr
Catalog: library/tkinter.dnd.po
Languages: fr

source: :mod:`tkinter.dnd` --- Drag and drop support
fr: :mod:`tkinter.dnd` – Prise en charge du glisser-déposer

source: **Source code:** :source:`Lib/tkinter/dnd.py`
fr: **Code source :** :source:`Lib/tkinter/dnd.py`

source: This is experimental and due to be deprecated when it is replaced with the Tk DND.
fr: Ceci est expérimental et devrait être obsolète lorsqu'il sera remplacé par le *Tk DND*.

source: The :mod:`tkinter.dnd` module provides drag-and-drop support for objects within a single application, within the same window or between windows. To enable an object to be dragged, you must create an event binding for it that starts the drag-and-drop process. Typically, you bind a ButtonPress event to a callback function that you write (see :ref:`Bindings-and-Events`). The function should call :func:`dnd_start`, where 'source' is the object to be dragged, and 'event' is the event that invoked the call (the argument to your callback function).
fr: Le module :mod:`tkinter.dnd` offre une prise en charge du glisser-déposer d'objets au sein d'une même application, dans la même fenêtre ou entre les fenêtres. Pour activer le glissement d'un objet, vous devez créer une liaison d'événements pour celui-ci qui démarre le processus de glisser-déposer. En règle générale, vous liez un événement *ButtonPress* à une fonction de rappel que vous écrivez (voir :ref:`Bindings-and-Events`). La fonction doit appeler :func:`dnd_start`, où *source* est l'objet à faire glisser et *event* est l'événement qui a invoqué l'appel (l'argument de votre fonction de rappel).

source: Selection of a target object occurs as follows:
fr: La sélection d'un objet cible se produit comme suit :

source: Top-down search of area under mouse for target widget
fr: Recherche descendante de la zone sous la souris pour le widget cible

source: Target widget should have a callable *dnd_accept* attribute
fr: Le widget cible doit avoir un attribut appelable *dnd_accept*

source: If *dnd_accept* is not present or returns None, search moves to parent widget
fr: Si *dnd_accept* n'est pas présent ou renvoie ``None``, la recherche se déplace vers le widget parent

source: If no target widget is found, then the target object is None
fr: Si aucun widget cible n'est trouvé, alors l'objet cible est ``None``

source: Call to *<old_target>.dnd_leave(source, event)*
fr: Appel à ``<old_target>.dnd_leave(source, event)``

source: Call to *<new_target>.dnd_enter(source, event)*
fr: Appel à ``<new_target>.dnd_enter(source, event)``

source: Call to *<target>.dnd_commit(source, event)* to notify of drop
fr: Appel à ``<target>.dnd_commit(source, event)`` pour notifier le déposer.

source: Call to *<source>.dnd_end(target, event)* to signal end of drag-and-drop
fr: Appel à ``<source>.dnd_end(target, event)`` pour signaler la fin du glisser-déposer

source: The *DndHandler* class handles drag-and-drop events tracking Motion and ButtonRelease events on the root of the event widget.
fr: La classe *DndHandler* gère les événements de glisser-déposer qui suivent les événements *Motion* et *ButtonRelease* à la racine du widget d'événement.

source: Cancel the drag-and-drop process.
fr: Annule le processus de glisser-déposer.

source: Execute end of drag-and-drop functions.
fr: Exécute les fonctions de fin de glisser-déposer.

source: Inspect area below mouse for target objects while drag is performed.
fr: Inspecte la zone sous la souris pour les objets cibles pendant que le glissement est effectué.

source: Signal end of drag when the release pattern is triggered.
fr: Signale la fin de la traînée lorsque le modèle de relâchement est déclenché.

source: Factory function for drag-and-drop process.
fr: Fonction de fabrique pour le processus de glisser-déposer.
