Repository: python/python-docs-fr
Catalog: library/tkinter.ttk.po
Languages: fr

source: Each item should have the same number of values as the widget option columns. If there are fewer values than columns, the remaining values are assumed empty. If there are more values than columns, the extra values are ignored.
fr: Chaque élément doit avoir le même nombre de valeurs que les colonnes d'options du widget. S'il y a moins de valeurs que de colonnes, les valeurs restantes sont supposées vides. S'il y a plus de valeurs que de colonnes, les valeurs supplémentaires sont ignorées.

source: ``True``/``False`` value indicating whether the item's children should be displayed or hidden.
fr: Valeur ``True`` ou ``False`` indiquant si les enfants de l'élément doivent être affichés ou masqués.

source: A list of tags associated with this item.
fr: Liste de balises associées à cet élément.

source: Tag Options
fr: Options de balise

source: The following options may be specified on tags:
fr: Les options suivantes peuvent être spécifiées sur les balises :

source: Specifies the text foreground color.
fr: Spécifie la couleur de premier plan du texte.

source: Specifies the cell or item background color.
fr: Spécifie la couleur d'arrière-plan de la cellule ou de l'élément.

source: Specifies the font to use when drawing text.
fr: Spécifie la police à utiliser lors du dessin du texte.

source: Specifies the item image, in case the item's image option is empty.
fr: Spécifie l'image de l'élément, au cas où l'option d'image de l'élément est vide.

source: Column Identifiers
fr: Identifiants de colonnes

source: Column identifiers take any of the following forms:
fr: Les identifiants de colonnes prennent l'une des formes suivantes :

source: A symbolic name from the list of columns option.
fr: Un nom symbolique de l'option de liste de colonnes.

source: An integer n, specifying the nth data column.
fr: Un entier n, spécifiant la n\ :sup:`ième` colonne de données.

source: A string of the form #n, where n is an integer, specifying the nth display column.
fr: Une chaîne de la forme #n, où n est un entier, spécifiant la n\ :sup:`ième` colonne d'affichage.

source: Item's option values may be displayed in a different order than the order in which they are stored.
fr: Les valeurs d'option de l'élément peuvent être affichées dans un ordre différent de celui dans lequel elles sont stockées.

source: Column #0 always refers to the tree column, even if show="tree" is not specified.
fr: La colonne #0 fait toujours référence à la colonne de l'arborescence, même si ``show="tree"`` n'est pas spécifié.

source: A data column number is an index into an item's option values list; a display column number is the column number in the tree where the values are displayed. Tree labels are displayed in column #0. If option displaycolumns is not set, then data column n is displayed in column #n+1. Again, **column #0 always refers to the tree column**.
fr: Un numéro de colonne de données est un indice dans la liste des valeurs d'option d'un élément ; un numéro de colonne d'affichage est le numéro de colonne dans l'arborescence où les valeurs sont affichées. Les étiquettes d'arbre sont affichées dans la colonne #0. Si l'option *displaycolumns* n'est pas définie, la colonne de données n s'affiche dans la colonne #n+1. Encore une fois, **la colonne #0 fait toujours référence à la colonne de l'arborescence**.

source: The Treeview widget generates the following virtual events.
fr: Le widget *Treeview* génère les événements virtuels suivants.

source: Event
fr: Événement

source: Generated whenever the selection changes.
fr: Généré chaque fois que la sélection change.

source: Generated just before settings the focus item to open=True.
fr: Généré juste avant de définir l'élément de focus sur ``open=True``.

source: Generated just after setting the focus item to open=False.
fr: Généré juste après avoir défini l'élément de focus sur ``open=False``.

source: The :meth:`Treeview.focus` and :meth:`Treeview.selection` methods can be used to determine the affected item or items.
fr: Les méthodes :meth:`Treeview.focus` et :meth:`Treeview.selection` peuvent être utilisées pour déterminer le ou les éléments concernés.

source: Returns the bounding box (relative to the treeview widget's window) of the specified *item* in the form (x, y, width, height).
fr: Renvoie la boîte englobante (relative à la fenêtre du widget *treeview*) de l'*item* spécifié sous la forme (x, y, largeur, hauteur).

source: If *column* is specified, returns the bounding box of that cell. If the *item* is not visible (i.e., if it is a descendant of a closed item or is scrolled offscreen), returns an empty string.
fr: Si *column* est spécifié, renvoie la boîte englobante de cette cellule. Si *item* n'est pas visible (c'est-à-dire s'il est un descendant d'un élément fermé ou se trouve hors écran en raison du défilement), renvoie une chaîne vide.

source: Returns the list of children belonging to *item*.
fr: Renvoie la liste des enfants appartenant à *item*.

source: If *item* is not specified, returns root children.
fr: Si *item* n'est pas spécifié, renvoie les enfants racine.

source: Replaces *item*'s child with *newchildren*.
fr: Remplace l'enfant de *item* par *newchildren*.

source: Children present in *item* that are not present in *newchildren* are detached from the tree. No items in *newchildren* may be an ancestor of *item*. Note that not specifying *newchildren* results in detaching *item*'s children.
fr: Les enfants présents dans *item* qui ne sont pas présents dans *newchildren* sont détachés de l'arbre. Aucun élément de *newchildren* ne peut être un ancêtre de *item*. Notez que ne pas spécifier *newchildren* entraîne le détachement des enfants de *item*.

source: Query or modify the options for the specified *column*.
fr: Interroge ou modifie les options pour la *column* spécifiée.

source: If *kw* is not given, returns a dict of the column option values. If *option* is specified then the value for that *option* is returned. Otherwise, sets the options to the corresponding values.
fr: Si *kw* n'est pas donné, renvoie un dictionnaire des valeurs d'option de colonne. Si *option* est spécifié, la valeur de cette *option* est renvoyée. Sinon, définit les options sur les valeurs correspondantes.

source: The valid options/values are:
fr: Les options/valeurs valides sont :

source: Returns the column name. This is a read-only option.
fr: Renvoie le nom de la colonne. Il s'agit d'une option en lecture seule.

source: anchor: One of the standard Tk anchor values.
fr: *anchor* : une des valeurs d'ancre *Tk* standard.

source: Specifies how the text in this column should be aligned with respect to the cell.
fr: Spécifie comment le texte de cette colonne doit être aligné par rapport à la cellule.

source: minwidth: width
fr: *minwidth* : largeur

source: The minimum width of the column in pixels. The treeview widget will not make the column any smaller than specified by this option when the widget is resized or the user drags a column.
fr: La largeur minimale de la colonne en pixels. Le widget *Treeview* ne rend pas la colonne plus petite que celle spécifiée par cette option lorsque le widget est redimensionné ou que l'utilisateur fait glisser une colonne.

source: Specifies whether the column's width should be adjusted when the widget is resized.
fr: Spécifie si la largeur de la colonne doit être ajustée lorsque le widget est redimensionné.

source: width: width
fr: *width* : largeur

source: The width of the column in pixels.
fr: La largeur de la colonne en pixels.

source: To configure the tree column, call this with column = "#0"
fr: Pour configurer la colonne d'arborescence, appelez-la avec ``column = "#0"``

source: Delete all specified *items* and all their descendants.
fr: Supprime tous les *items* spécifiés et tous leurs descendants.

source: The root item may not be deleted.
fr: L'élément racine ne peut pas être supprimé.

source: Unlinks all of the specified *items* from the tree.
fr: Dissocie tous les *items* spécifiés de l'arborescence.

source: The items and all of their descendants are still present, and may be reinserted at another point in the tree, but will not be displayed.
fr: Les éléments et tous leurs descendants sont toujours présents et peuvent être réinsérés à un autre point de l'arborescence, mais ne seront pas affichés.

source: The root item may not be detached.
fr: L'élément racine ne peut pas être détaché.

source: Returns ``True`` if the specified *item* is present in the tree.
fr: Renvoie ``True`` si l'*item* spécifié est présent dans l'arborescence.

source: If *item* is specified, sets the focus item to *item*. Otherwise, returns the current focus item, or '' if there is none.
fr: Si *item* est spécifié, définit l'élément de focus sur *item*. Sinon, renvoie l'élément de focus actuel, ou ``''`` s'il n'y en a pas.

source: Query or modify the heading options for the specified *column*.
fr: Interroge ou modifie les options d'en-tête pour la *column* spécifiée.

source: If *kw* is not given, returns a dict of the heading option values. If *option* is specified then the value for that *option* is returned. Otherwise, sets the options to the corresponding values.
fr: Si *kw* n'est pas donné, renvoie un dictionnaire des valeurs d'option d'en-tête. Si *option* est spécifié, la valeur de cette *option* est renvoyée. Sinon, définit les options sur les valeurs correspondantes.

source: text: text
fr: *text* : texte

source: The text to display in the column heading.
fr: Texte à afficher dans l'en-tête de colonne.

source: image: imageName
fr: *image* : nom de l'image

source: Specifies an image to display to the right of the column heading.
fr: Spécifie une image à afficher à droite de l'en-tête de colonne.

source: anchor: anchor
fr: *anchor* : ancre

source: Specifies how the heading text should be aligned. One of the standard Tk anchor values.
fr: Spécifie comment le texte du titre doit être aligné. Une des valeurs d'ancrage *Tk* standard.

source: command: callback
fr: *command* : rappel

source: A callback to be invoked when the heading label is pressed.
fr: Un rappel à invoquer lorsque l'étiquette d'en-tête est pressée.

source: To configure the tree column heading, call this with column = "#0".
fr: Pour configurer l'en-tête de colonne de l'arborescence, appelez-la avec ``column = "#0"``.

source: Returns a description of the specified *component* under the point given by *x* and *y*, or the empty string if no such *component* is present at that position.
fr: Renvoie une description du *component* spécifié sous le point donné par *x* et *y*, ou la chaîne vide si aucun *component* de ce type n'est présent à cette position.

source: Returns the item ID of the item at position *y*.
fr: Renvoie l'ID d'élément de l'élément à la position *y*.

source: Returns the data column identifier of the cell at position *x*.
fr: Renvoie l'identificateur de colonne de données de la cellule à la position *x*.

source: The tree column has ID #0.
fr: La colonne arborescence possède l'ID #0.

source: Returns one of:
fr: Renvoie l'un des éléments suivants :

source: meaning
fr: signification

source: Tree heading area.
fr: Zone d'en-tête de l'arbre.

source: Space between two columns headings.
fr: Espace entre deux en-têtes de colonnes.

source: tree
fr: *tree* (arbre)

source: The tree area.
fr: Une zone de l'arbre.

source: A data cell.
fr: Une cellule de données.

source: Availability: Tk 8.6.
fr: Disponibilité : *Tk* 8.6.

source: Returns the element at position *x*, *y*.
fr: Renvoie l'élément à la position *x*, *y*.

source: Returns the integer index of *item* within its parent's list of children.
fr: Renvoie l'indice (entier) de *item* dans la liste des enfants de son parent.

source: Creates a new item and returns the item identifier of the newly created item.
fr: Crée un nouvel élément et renvoie l'identifiant de l'élément nouvellement créé.

source: *parent* is the item ID of the parent item, or the empty string to create a new top-level item. *index* is an integer, or the value "end", specifying where in the list of parent's children to insert the new item. If *index* is less than or equal to zero, the new node is inserted at the beginning; if *index* is greater than or equal to the current number of children, it is inserted at the end. If *iid* is specified, it is used as the item identifier; *iid* must not already exist in the tree. Otherwise, a new unique identifier is generated.
fr: *parent* est l'ID d'élément de l'élément parent ou la chaîne vide pour créer un nouvel élément de niveau supérieur. *index* est un entier, ou la valeur ``"end"``, spécifiant où dans la liste des enfants du parent insérer le nouvel élément. Si *index* est inférieur ou égal à zéro, le nouveau nœud est inséré au début ; si *index* est supérieur ou égal au nombre actuel d'enfants, il est inséré à la fin. Si *iid* est spécifié, il est utilisé comme identifiant d'élément ; *iid* ne doit pas déjà exister dans l'arborescence. Sinon, un nouvel identifiant unique est généré.

source: See `Item Options`_ for the list of available points.
fr: Voir `Options d'éléments`_ pour la liste des options disponibles.

source: Query or modify the options for the specified *item*.
fr: Interroge ou modifie les options pour l'*item* spécifié.

source: If no options are given, a dict with options/values for the item is returned. If *option* is specified then the value for that option is returned. Otherwise, sets the options to the corresponding values as given by *kw*.
fr: Si aucune option n'est donnée, un dictionnaire avec des options/valeurs pour l'élément est renvoyé. Si *option* est spécifié, la valeur de cette option est renvoyée. Sinon, définit les options sur les valeurs correspondantes données par *kw*.

source: Moves *item* to position *index* in *parent*'s list of children.
fr: Déplace *item* vers la position *index* dans la liste des enfants de *parent*.

source: It is illegal to move an item under one of its descendants. If *index* is less than or equal to zero, *item* is moved to the beginning; if greater than or equal to the number of children, it is moved to the end. If *item* was detached it is reattached.
fr: Il est interdit de déplacer un élément sous l'un de ses descendants. Si *index* est inférieur ou égal à zéro, *item* est déplacé au début ; s'il est supérieur ou égal au nombre d'enfants, il est déplacé à la fin. Si *item* a été détaché, il est rattaché.

source: Returns the identifier of *item*'s next sibling, or '' if *item* is the last child of its parent.
fr: Renvoie l'identifiant du frère suivant de *item*, ou ``''`` si *item* est le dernier enfant de son parent.

source: Returns the ID of the parent of *item*, or '' if *item* is at the top level of the hierarchy.
fr: Renvoie l'identifiant du parent de *item*, ou ``''`` si *item* est au niveau supérieur de la hiérarchie.

source: Returns the identifier of *item*'s previous sibling, or '' if *item* is the first child of its parent.
fr: Renvoie l'identifiant du frère précédent de *item*, ou ``''`` si *item* est le premier enfant de son parent.

source: An alias for :meth:`Treeview.move`.
fr: Alias pour :meth:`Treeview.move`.

source: Ensure that *item* is visible.
fr: Fait en sorte que *item* soit visible.

source: Sets all of *item*'s ancestors open option to ``True``, and scrolls the widget if necessary so that *item* is within the visible portion of the tree.
fr: Définit l'option d'ouverture de tous les ancêtres de *item* sur ``True``, et fait défiler le widget si nécessaire afin que *item* soit dans la partie visible de l'arborescence.

source: Returns a tuple of selected items.
fr: Renvoie un *n*-uplet d'éléments sélectionnés.

source: ``selection()`` no longer takes arguments. For changing the selection state use the following selection methods.
fr: ``selection()`` ne prend plus d'arguments. Pour modifier l'état de sélection, utilisez les méthodes de sélection suivantes.

source: *items* becomes the new selection.
fr: *items* devient la nouvelle sélection.

source: *items* can be passed as separate arguments, not just as a single tuple.
fr: *items* peut être passé en tant qu'arguments séparés, pas seulement en tant que *n*-uplet.

source: Add *items* to the selection.
fr: Ajoute des *items* à la sélection.

source: Remove *items* from the selection.
fr: Supprime les *items* de la sélection.

source: Toggle the selection state of each item in *items*.
fr: Bascule l'état de sélection de chaque élément de *items*.

source: With one argument, returns a dictionary of column/value pairs for the specified *item*. With two arguments, returns the current value of the specified *column*. With three arguments, sets the value of given *column* in given *item* to the specified *value*.
fr: Avec un argument, renvoie un dictionnaire de paires colonne/valeur pour l'*item* spécifié. Avec deux arguments, renvoie la valeur actuelle de la *column* spécifiée. Avec trois arguments, définit la valeur de la *column* donnée dans l'*item* donné à la *value* spécifiée.

source: Bind a callback for the given event *sequence* to the tag *tagname*. When an event is delivered to an item, the callbacks for each of the item's tags option are called.
fr: Lie le rappel *callback* à l'événement donné *sequence* pour la balise *tagname*. Lorsqu'un événement est envoyé à un élément, les rappels pour chacune des options de balises de l'élément sont appelés.

source: Query or modify the options for the specified *tagname*.
fr: Interroge ou modifie les options pour le *tagname* spécifié.

source: If *kw* is not given, returns a dict of the option settings for *tagname*. If *option* is specified, returns the value for that *option* for the specified *tagname*. Otherwise, sets the options to the corresponding values for the given *tagname*.
fr: Si *kw* n'est pas donné, renvoie un dictionnaire des paramètres d'option pour *tagname*. Si *option* est spécifié, renvoie la valeur de cette *option* pour le *tagname* spécifié. Sinon, définit les options sur les valeurs correspondantes pour le *tagname* donné.

source: If *item* is specified, returns 1 or 0 depending on whether the specified *item* has the given *tagname*. Otherwise, returns a list of all items that have the specified tag.
fr: Si *item* est spécifié, renvoie 1 ou 0 selon que *item* spécifié a le *tagname* donné. Sinon, renvoie une liste de tous les éléments qui ont la balise spécifiée.

source: Availability: Tk 8.6
fr: Disponibilité : *Tk* 8.6

source: Query or modify horizontal position of the treeview.
fr: Interroge ou modifie la position horizontale de l'arborescence.

source: Query or modify vertical position of the treeview.
fr: Interroge ou modifie la position verticale de l'arborescence.

source: Ttk Styling
fr: Style Ttk

source: Each widget in :mod:`ttk` is assigned a style, which specifies the set of elements making up the widget and how they are arranged, along with dynamic and default settings for element options. By default the style name is the same as the widget's class name, but it may be overridden by the widget's style option. If you don't know the class name of a widget, use the method :meth:`Misc.winfo_class` (somewidget.winfo_class()).
fr: Chaque widget dans :mod:`ttk` se voit attribuer un style, qui spécifie l'ensemble d'éléments composant le widget et la façon dont ils sont disposés, ainsi que les paramètres dynamiques et par défaut pour les options d'élément. Par défaut, le nom du style est le même que le nom de la classe du widget, mais il peut être remplacé par l'option de style du widget. Si vous ne connaissez pas le nom de classe d'un widget, utilisez la méthode :meth:`Misc.winfo_class` (*somewidget.winfo_class()*).

source: This document explains how the theme engine works
fr: Ce document explique le fonctionnement du moteur de thème

source: This class is used to manipulate the style database.
fr: Cette classe est utilisée pour manipuler la base de données de style.

source: Query or set the default value of the specified option(s) in *style*.
fr: Interroge ou définit la valeur par défaut des options spécifiées dans *style*.

source: Each key in *kw* is an option and each value is a string identifying the value for that option.
fr: Chaque clé dans *kw* est une option et chaque valeur est une chaîne identifiant la valeur de cette option.

source: For example, to change every default button to be a flat button with some padding and a different background color::
fr: Par exemple, pour changer chaque bouton par défaut en un bouton plat avec un ajustement et une couleur d'arrière-plan différente :

source: Query or sets dynamic values of the specified option(s) in *style*.
fr: Interroge ou définit les valeurs dynamiques des options spécifiées dans *style*.

source: Each key in *kw* is an option and each value should be a list or a tuple (usually) containing statespecs grouped in tuples, lists, or some other preference. A statespec is a compound of one or more states and then a value.
fr: Chaque clé dans *kw* est une option et chaque valeur doit être une liste ou un *n*-uplet (généralement) contenant des spécifications d'état regroupées dans des *n*-uplets, des listes ou une autre préférence. Un *statespec* est un composé d'un ou plusieurs états, puis d'une valeur.

source: An example may make it more understandable::
fr: Un exemple peut le rendre plus compréhensible ::

source: Note that the order of the (states, value) sequences for an option does matter, if the order is changed to ``[('active', 'blue'), ('pressed', 'red')]`` in the foreground option, for example, the result would be a blue foreground when the widget were in active or pressed states.
fr: Notez que l'ordre des séquences (états, valeur) pour une option est important, si l'ordre est changé en ``[('active', 'blue'), ('pressed', 'red')]`` dans l'option de premier plan, par exemple, le résultat est un premier plan bleu lorsque le widget est dans les états actif ou pressé.

source: Returns the value specified for *option* in *style*.
fr: Renvoie la valeur spécifiée pour *option* dans *style*.

source: If *state* is specified, it is expected to be a sequence of one or more states. If the *default* argument is set, it is used as a fallback value in case no specification for option is found.
fr: Si *state* est spécifié, on s'attend à ce qu'il s'agisse d'une séquence d'un ou plusieurs états. Si l'argument *default* est défini, il est utilisé comme valeur de secours au cas où aucune spécification d'option n'est trouvée.

source: To check what font a Button uses by default::
fr: Pour vérifier quelle police un bouton utilise par défaut :

source: Define the widget layout for given *style*. If *layoutspec* is omitted, return the layout specification for given style.
fr: Définit la disposition du widget pour un *style* donné. Si *layoutspec* est omis, renvoie la spécification de mise en page pour le style donné.

source: *layoutspec*, if specified, is expected to be a list or some other sequence type (excluding strings), where each item should be a tuple and the first item is the layout name and the second item should have the format described in `Layouts`_.
fr: *layoutspec*, si spécifié, doit être une liste ou un autre type de séquence (à l'exception des chaînes), où chaque élément doit être un *n*-uplet et le premier élément est le nom de la mise en page et le deuxième élément doit avoir le format décrit dans `Layouts`_.

source: To understand the format, see the following example (it is not intended to do anything useful)::
fr: Pour comprendre le format, consultez l'exemple suivant (il n'est pas destiné à faire quoi que ce soit d'utile) ::
