Repository: python/python-docs-fr
Catalog: library/tkinter.po
Languages: fr

source: This call (say, for example, creating a button widget), is implemented in the :mod:`tkinter` package, which is written in Python. This Python function will parse the commands and the arguments and convert them into a form that makes them look as if they had come from a Tk script instead of a Python script.
fr: Cet appel (par exemple, la création d'un objet graphique de type bouton) est implémenté dans le paquet :mod:`tkinter`, qui est écrit en Python. Cette fonction Python analyse les commandes et les arguments et les convertit en une forme qui les fait ressembler à un script Tk au lieu d'un script Python.

source: These commands and their arguments will be passed to a C function in the :mod:`_tkinter` - note the underscore - extension module.
fr: Ces commandes et leurs arguments sont passés à une fonction C dans le module d'extension :mod:`_tkinter` — notez le tiret bas.

source: Tk Widgets (C and Tcl)
fr: Objets graphiques Tk (C et Tcl)

source: This C function is able to make calls into other C modules, including the C functions that make up the Tk library. Tk is implemented in C and some Tcl. The Tcl part of the Tk widgets is used to bind certain default behaviors to widgets, and is executed once at the point where the Python :mod:`tkinter` package is imported. (The user never sees this stage).
fr: Cette fonction C est capable d'effectuer des appels vers d'autres modules C, y compris les fonctions C qui composent la bibliothèque Tk. Tk est implémenté en C et un peu en Tcl. La partie Tcl des objets graphiques Tk est utilisée pour lier certains comportements par défaut aux objets graphiques, et est exécutée une fois au moment où le paquet Python :mod:`tkinter` est importé (cette étape est transparente pour l'utilisateur).

source: The Tk part of the Tk Widgets implement the final mapping to ...
fr: La partie Tk des objets graphiques Tk implémente la correspondance finale avec …

source: the Xlib library to draw graphics on the screen.
fr: la bibliothèque *Xlib* pour dessiner des éléments graphiques à l'écran.

source: Handy Reference
fr: Guide pratique

source: Setting Options
fr: Définition des options

source: Options control things like the color and border width of a widget. Options can be set in three ways:
fr: Les options contrôlent des paramètres tels que la couleur et la largeur de la bordure d'un objet graphique. Les options peuvent être réglées de trois façons :

source: At object creation time, using keyword arguments
fr: Lors de la création de l'objet, à l'aide d'arguments par mots-clés

source: After object creation, treating the option name like a dictionary index
fr: Après la création de l'objet, en manipulant le nom de l'option comme une entrée de dictionnaire

source: Use the config() method to update multiple attrs subsequent to object creation
fr: Utilisez la méthode ``config()`` pour mettre à jour plusieurs attributs après la création de l'objet

source: For a complete explanation of a given option and its behavior, see the Tk man pages for the widget in question.
fr: Pour l'explication complète d'une option donnée et de son comportement, voir les pages de manuel Tk de l'objet graphique en question.

source: Note that the man pages list "STANDARD OPTIONS" and "WIDGET SPECIFIC OPTIONS" for each widget. The former is a list of options that are common to many widgets, the latter are the options that are idiosyncratic to that particular widget. The Standard Options are documented on the :manpage:`options(3)` man page.
fr: Notez que les pages de manuel listent « OPTIONS STANDARD » et « OPTIONS SPÉCIFIQUES D'OBJETS GRAPHIQUES » pour chaque objet graphique. La première est une liste d'options communes à de nombreux objets graphiques, la seconde est une liste d'options propres à cet objet graphique particulier. Les options standard sont documentées sur la page de manuel :manpage:`options(3)`.

source: No distinction between standard and widget-specific options is made in this document. Some options don't apply to some kinds of widgets. Whether a given widget responds to a particular option depends on the class of the widget; buttons have a ``command`` option, labels do not.
fr: Aucune distinction n'est faite dans ce document entre les options standard et les options spécifiques à un objet graphique. Certaines options ne s'appliquent pas à certains types d'objets graphiques. La réaction d'un objet graphique donné à une option particulière dépend de la classe de l'objet graphique ; les boutons possèdent une option ``command``, pas les étiquettes.

source: The options supported by a given widget are listed in that widget's man page, or can be queried at runtime by calling the :meth:`config` method without arguments, or by calling the :meth:`keys` method on that widget. The return value of these calls is a dictionary whose key is the name of the option as a string (for example, ``'relief'``) and whose values are 5-tuples.
fr: Les options gérées par un objet graphique donné sont listées dans la page de manuel de cet objet graphique, ou peuvent être interrogées à l'exécution en appelant la méthode :meth:`config` sans argument, ou en appelant la méthode :meth:`keys` sur cet objet graphique. La valeur de retour de ces appels est un dictionnaire dont la clé est le nom de l'option sous forme de chaîne (par exemple, ``'relief'``) et dont les valeurs sont des *5-uplets*.

source: Some options, like ``bg`` are synonyms for common options with long names (``bg`` is shorthand for "background"). Passing the ``config()`` method the name of a shorthand option will return a 2-tuple, not 5-tuple. The 2-tuple passed back will contain the name of the synonym and the "real" option (such as ``('bg', 'background')``).
fr: Certaines options, comme ``bg``, sont des synonymes d'options communes qui ont des noms longs (``bg`` est une abréviation pour ``background`` « arrière-plan »). Passer le nom abrégé d'une option à la méthode ``config()`` renvoie un couple, pas un quintuplet. Le couple renvoyé contient le nom abrégé et le nom *réel* de l'option, par exemple ``('bg','background')``.

source: Meaning
fr: Signification

source: Example
fr: Exemple

source: option name
fr: nom des options

source: option name for database lookup
fr: nom de l'option pour la recherche dans la base de données

source: option class for database lookup
fr: classe de l'option pour la recherche dans la base de données

source: default value
fr: valeur par défaut

source: current value
fr: valeur actuelle

source: Example::
fr: Exemple ::

source: Of course, the dictionary printed will include all the options available and their values. This is meant only as an example.
fr: Bien sûr, le dictionnaire affiché contient toutes les options disponibles et leurs valeurs. Ceci n'est donné qu'à titre d'exemple.

source: The Packer
fr: L'empaqueteur

source: The packer is one of Tk's geometry-management mechanisms. Geometry managers are used to specify the relative positioning of the positioning of widgets within their container - their mutual *master*. In contrast to the more cumbersome *placer* (which is used less commonly, and we do not cover here), the packer takes qualitative relationship specification - *above*, *to the left of*, *filling*, etc - and works everything out to determine the exact placement coordinates for you.
fr: L'empaqueteur est l'un des mécanismes de Tk pour la gestion de la disposition des éléments sur l'écran. Les gestionnaires de géométrie sont utilisés pour spécifier le positionnement relatif du positionnement des objets graphiques dans leur conteneur — leur *constructeur* mutuel. Contrairement au plus encombrant *placeur* (qui est utilisé moins souvent, et nous n'en parlons pas ici), l'empaqueteur prend les spécifications qualitatives de relation — *above*, *to the left of*, *filling*, etc — et calcule tout pour déterminer les coordonnées exactes du placement pour vous.

source: The size of any *master* widget is determined by the size of the "slave widgets" inside. The packer is used to control where slave widgets appear inside the master into which they are packed. You can pack widgets into frames, and frames into other frames, in order to achieve the kind of layout you desire. Additionally, the arrangement is dynamically adjusted to accommodate incremental changes to the configuration, once it is packed.
fr: La taille d'un objet graphique *constructeur* est déterminée par la taille des « objets graphiques hérités » à l'intérieur. L'empaqueteur est utilisé pour contrôler l'endroit où les objets graphiques hérités apparaissent à l'intérieur du constructeur dans lequel ils sont empaquetés. Vous pouvez regrouper des objets graphiques dans des cadres, et des cadres dans d'autres cadres, afin d'obtenir le type de mise en page souhaité. De plus, l'arrangement est ajusté dynamiquement pour s'adapter aux changements incrémentiels de la configuration, une fois qu'elle est empaquetées.

source: Note that widgets do not appear until they have had their geometry specified with a geometry manager. It's a common early mistake to leave out the geometry specification, and then be surprised when the widget is created but nothing appears. A widget will appear only after it has had, for example, the packer's :meth:`pack` method applied to it.
fr: Notez que les objets graphiques n'apparaissent pas tant que leur disposition n'a pas été spécifiée avec un gestionnaire de géométrie. C'est une erreur de débutant courante de ne pas tenir compte de la spécification de la géométrie, puis d'être surpris lorsque l'objet graphique est créé mais que rien n'apparaît. Un objet graphique n'apparaît qu'après que, par exemple, la méthode :meth:`pack` de l'empaqueteur lui ait été appliquée.

source: The pack() method can be called with keyword-option/value pairs that control where the widget is to appear within its container, and how it is to behave when the main application window is resized. Here are some examples::
fr: La méthode `pack()` peut être appelée avec des paires mot-clé-option/valeur qui contrôlent où l'objet graphique doit apparaître dans son conteneur et comment il doit se comporter lorsque la fenêtre principale de l'application est redimensionnée. En voici quelques exemples ::

source: Packer Options
fr: Options de l'empaqueteur

source: For more extensive information on the packer and the options that it can take, see the man pages and page 183 of John Ousterhout's book.
fr: Pour de plus amples informations sur l'empaqueteur et les options qu'il peut prendre, voir les pages de manuel et la page 183 du livre de John Ousterhout.

source: Anchor type. Denotes where the packer is to place each slave in its parcel.
fr: Type d'ancrage. Indique l'endroit où l'empaqueteur doit placer chaque enfant dans son espace.

source: Boolean, ``0`` or ``1``.
fr: Booléen, ``0`` ou ``1``.

source: Legal values: ``'x'``, ``'y'``, ``'both'``, ``'none'``.
fr: Valeurs acceptées : ``'x'``, ``'y'``, ``'both'``, ``'none'``.

source: ipadx and ipady
fr: *ipadx* et *ipady*

source: A distance - designating internal padding on each side of the slave widget.
fr: Une distance — désignant l'écart interne de chaque côté de l'objet graphique hérité.

source: padx and pady
fr: *padx* et *pady*

source: A distance - designating external padding on each side of the slave widget.
fr: Une distance — désignant l'écart externe de chaque côté de l'objet graphique hérité.

source: Legal values are: ``'left'``, ``'right'``, ``'top'``, ``'bottom'``.
fr: Valeurs acceptées : ``'left'``, ``'right'``, ``'top'``, ``'bottom'``.

source: Coupling Widget Variables
fr: Association des variables de l'objet graphique

source: The current-value setting of some widgets (like text entry widgets) can be connected directly to application variables by using special options. These options are ``variable``, ``textvariable``, ``onvalue``, ``offvalue``, and ``value``. This connection works both ways: if the variable changes for any reason, the widget it's connected to will be updated to reflect the new value.
fr: L'assignation d'une valeur à certains objets graphiques (comme les objets graphique de saisie de texte) peut être liée directement aux variables de votre application à l'aide d'options spéciales. Ces options sont ``variable``, ``textvariable``, ``onvalue``, ``offvalue`` et ``value``. Ce lien fonctionne dans les deux sens : si la variable change pour une raison ou pour une autre, l'objet graphique auquel elle est connectée est mis à jour pour refléter la nouvelle valeur.

source: Unfortunately, in the current implementation of :mod:`tkinter` it is not possible to hand over an arbitrary Python variable to a widget through a ``variable`` or ``textvariable`` option. The only kinds of variables for which this works are variables that are subclassed from a class called Variable, defined in :mod:`tkinter`.
fr: Malheureusement, dans l'implémentation actuelle de :mod:`tkinter` il n'est pas possible de passer une variable Python arbitraire à un objet graphique via une option ``variable`` ou ``textvariable``. Les seuls types de variables pour lesquels cela fonctionne sont les variables qui sont sous-classées à partir d'une classe appelée `Variable`, définie dans :mod:`tkinter`.

source: There are many useful subclasses of Variable already defined: :class:`StringVar`, :class:`IntVar`, :class:`DoubleVar`, and :class:`BooleanVar`. To read the current value of such a variable, call the :meth:`get` method on it, and to change its value you call the :meth:`!set` method. If you follow this protocol, the widget will always track the value of the variable, with no further intervention on your part.
fr: Il existe de nombreuses sous-classes utiles de `Variable` déjà définies : :class:`StringVar`, :class:`IntVar`, :class:`DoubleVar` et :class:`BooleanVar`. Pour lire la valeur courante d'une telle variable, appelez la méthode :meth:`get` dessus et, pour changer sa valeur, appelez la méthode :meth:`!set`. Si vous suivez ce protocole, l'objet graphique suivra toujours la valeur de la variable, sans autre intervention de votre part.

source: The Window Manager
fr: Le gestionnaire de fenêtres

source: In Tk, there is a utility command, ``wm``, for interacting with the window manager. Options to the ``wm`` command allow you to control things like titles, placement, icon bitmaps, and the like. In :mod:`tkinter`, these commands have been implemented as methods on the :class:`Wm` class. Toplevel widgets are subclassed from the :class:`Wm` class, and so can call the :class:`Wm` methods directly.
fr: Dans Tk, il y a une commande pratique, ``wm``, pour interagir avec le gestionnaire de fenêtres. Les options de la commande ``wm`` vous permettent de contrôler les titres, le placement, les icônes en mode *bitmap* et encore d'autres choses du même genre. Dans :mod:`tkinter`, ces commandes ont été implémentées en tant que méthodes sur la classe :class:`Wm`. Les objets graphiques de haut niveau sont sous-classés à partir de la classe :class:`Wm`, ils peuvent donc appeler directement les méthodes de :class:`Wm`.

source: To get at the toplevel window that contains a given widget, you can often just refer to the widget's master. Of course if the widget has been packed inside of a frame, the master won't represent a toplevel window. To get at the toplevel window that contains an arbitrary widget, you can call the :meth:`_root` method. This method begins with an underscore to denote the fact that this function is part of the implementation, and not an interface to Tk functionality.
fr: Pour accéder à la fenêtre du plus haut niveau qui contient un objet graphique donné, vous pouvez souvent simplement vous référer au parent de cet objet graphique. Bien sûr, si l'objet graphique a été empaqueté à l'intérieur d'un cadre, le parent ne représentera pas la fenêtre de plus haut niveau. Pour accéder à la fenêtre du plus haut niveau qui contient un objet graphique arbitraire, vous pouvez appeler la méthode :meth:`_root`. Cette méthode commence par un soulignement pour indiquer que cette fonction fait partie de l'implémentation, et non d'une interface avec la fonctionnalité Tk.

source: Here are some examples of typical usage::
fr: Voici quelques exemples d'utilisation courante ::

source: Tk Option Data Types
fr: Types de données des options Tk

source: Legal values are points of the compass: ``"n"``, ``"ne"``, ``"e"``, ``"se"``, ``"s"``, ``"sw"``, ``"w"``, ``"nw"``, and also ``"center"``.
fr: Les valeurs acceptées sont des points cardinaux : ``« n »``, ``« ne »``, ``« e »``, ``« se »``, ``« s »``, ``« sw »``, ``« w »``, ``« nw »`` et ``« center »``.

source: There are eight built-in, named bitmaps: ``'error'``, ``'gray25'``, ``'gray50'``, ``'hourglass'``, ``'info'``, ``'questhead'``, ``'question'``, ``'warning'``. To specify an X bitmap filename, give the full path to the file, preceded with an ``@``, as in ``"@/usr/contrib/bitmap/gumby.bit"``.
fr: Il y a huit bitmaps intégrés nommés : ``« error »``, ``« gray25 »``, ``« gray50 »``, ``« hourglass »``, ``« info »``, ``« questhead »``, ``« question »``, ``« warning »'``. Pour spécifier un nom de fichier bitmap X, indiquez le chemin complet du fichier, précédé de ``@``, comme dans ``"@/usr/contrib/bitmap/gumby.bit"``.

source: You can pass integers 0 or 1 or the strings ``"yes"`` or ``"no"``.
fr: Vous pouvez lui donner les entiers 0 ou 1 ou les chaînes de caractères ``"yes"`` ou ``"no"``.

source: This is any Python function that takes no arguments. For example::
fr: N'importe quelle fonction Python qui ne prend pas d'argument. Par exemple ::

source: Colors can be given as the names of X colors in the rgb.txt file, or as strings representing RGB values in 4 bit: ``"#RGB"``, 8 bit: ``"#RRGGBB"``, 12 bit" ``"#RRRGGGBBB"``, or 16 bit ``"#RRRRGGGGBBBB"`` ranges, where R,G,B here represent any legal hex digit. See page 160 of Ousterhout's book for details.
fr: Les couleurs peuvent être données sous forme de noms de couleurs Xorg dans le fichier *rgb.txt*, ou sous forme de chaînes représentant les valeurs RVB en 4 bits : ``« #RGB »``, 8 bits : ``« #RRVVBB »``, 12 bits``« #RRRVVVBBB »``, ou 16 bits ``« #RRRRVVVVBBBB »``, où R,V,B représente ici tout chiffre hexadécimal valide. Voir page 160 du livre d'Ousterhout pour plus de détails.

source: The standard X cursor names from :file:`cursorfont.h` can be used, without the ``XC_`` prefix. For example to get a hand cursor (:const:`XC_hand2`), use the string ``"hand2"``. You can also specify a bitmap and mask file of your own. See page 179 of Ousterhout's book.
fr: Les noms de curseurs Xorg standard que l'on trouve dans :file:`cursorfont.h` peuvent être utilisés, sans le préfixe ``XC_``. Par exemple pour obtenir un curseur en forme de main (:const:`XC_hand2`), utilisez la chaîne ``« hand2 »``. Vous pouvez également spécifier votre propre bitmap et fichier masque. Voir page 179 du livre d'Ousterhout.

source: Screen distances can be specified in either pixels or absolute distances. Pixels are given as numbers and absolute distances as strings, with the trailing character denoting units: ``c`` for centimetres, ``i`` for inches, ``m`` for millimetres, ``p`` for printer's points. For example, 3.5 inches is expressed as ``"3.5i"``.
fr: Les distances à l'écran peuvent être spécifiées en pixels ou en distances absolues. Les pixels sont donnés sous forme de nombres et les distances absolues sous forme de chaînes de caractères, le dernier caractère indiquant les unités : ``c`` pour les centimètres, ``i`` pour les pouces (*inches* en anglais), ``m`` pour les millimètres, ``p`` pour les points d'impression. Par exemple, 3,5 pouces est noté ``« 3.5i »``.

source: Tk uses a list font name format, such as ``{courier 10 bold}``. Font sizes with positive numbers are measured in points; sizes with negative numbers are measured in pixels.
fr: *Tk* utilise un format de nom de police sous forme de liste, tel que ``{courier 10 bold}``. Les tailles de polices avec des nombres positifs sont mesurées en points ; les tailles avec des nombres négatifs sont mesurées en pixels.

source: This is a string of the form ``widthxheight``, where width and height are measured in pixels for most widgets (in characters for widgets displaying text). For example: ``fred["geometry"] = "200x100"``.
fr: Il s'agit d'une chaîne de caractères de la forme ``largeurxhauteur``, où la largeur et la hauteur sont mesurées en pixels pour la plupart des objets graphiques (en caractères pour les objets graphiques affichant du texte). Par exemple : ``fred["geometry"] = "200x100"``.

source: Legal values are the strings: ``"left"``, ``"center"``, ``"right"``, and ``"fill"``.
fr: Les valeurs acceptées sont les chaînes de caractères : `« left »``, ``« center »``, ``« right »`` et ``« fill »``.

source: This is a string with four space-delimited elements, each of which is a legal distance (see above). For example: ``"2 3 4 5"`` and ``"3i 2i 4.5i 2i"`` and ``"3c 2c 4c 10.43c"`` are all legal regions.
fr: c'est une chaîne de caractères avec quatre éléments séparés par des espaces, chacun d'eux étant une distance valide (voir ci-dessus). Par exemple : ``"2 3 4 5"``et ``" 3i 2i 4.5i 2i"``et ``"3c 2c 4c 10.43c"`` sont toutes des régions valides.

source: Determines what the border style of a widget will be. Legal values are: ``"raised"``, ``"sunken"``, ``"flat"``, ``"groove"``, and ``"ridge"``.
fr: Détermine le style de bordure d'un objet graphique. Les valeurs valides sont : ``"raised"``, ``"sunken"``, ``"flat"``, ``"groove"``, et ``"ridge"``.

source: This is almost always the :meth:`!set` method of some scrollbar widget, but can be any widget method that takes a single argument.
fr: C'est presque toujours la méthode :meth:`!set` d'un objet graphique de défilement, mais peut être n'importe quelle méthode d'objet graphique qui prend un seul argument.

source: Must be one of: ``"none"``, ``"char"``, or ``"word"``.
fr: Doit être l'un d'eux : ``"none"``, ``"char"``, ou ``"word"``.

source: Bindings and Events
fr: Liaisons et événements

source: The bind method from the widget command allows you to watch for certain events and to have a callback function trigger when that event type occurs. The form of the bind method is::
fr: La méthode `bind` de la commande d'objet graphique vous permet de surveiller certains événements et d'avoir un déclencheur de fonction de rappel lorsque ce type d'événement se produit. La forme de la méthode de liaison est la suivante ::

source: where:
fr: où :

source: is a string that denotes the target kind of event. (See the bind man page and page 201 of John Ousterhout's book for details).
fr: est une chaîne de caractères qui indique le type d'événement cible. (Voir la page du manuel de *bind* et la page 201 du livre de John Ousterhout pour plus de détails).

source: is a Python function, taking one argument, to be invoked when the event occurs. An Event instance will be passed as the argument. (Functions deployed this way are commonly known as *callbacks*.)
fr: est une fonction Python, prenant un argument, à invoquer lorsque l'événement se produit. Une instance d’évènement sera passée en argument. (Les fonctions déployées de cette façon sont communément appelées *callbacks* ou « fonctions de rappel » en français).

source: is optional, either ``''`` or ``'+'``. Passing an empty string denotes that this binding is to replace any other bindings that this event is associated with. Passing a ``'+'`` means that this function is to be added to the list of functions bound to this event type.
fr: est facultative, soit ``''`` ou ``'+'``. L'envoi d'une chaîne de caractères vide indique que cette liaison doit remplacer toute autre liaison à laquelle cet événement est associé. L'envoi de``«+»`` signifie que cette fonction doit être ajoutée à la liste des fonctions liées à ce type d'événement.
