Repository: python/python-docs-fr
Catalog: library/tkinter.ttk.po
Languages: fr

source: String value. This specifies the format of numbers set by the increment/decrement buttons. It must be in the form "%W.Pf", where W is the padded width of the value, P is the precision, and '%' and 'f' are literal.
fr: Valeur sous forme de chaîne. Cela spécifie le format des nombres définis par les boutons d'incrémentation/décrémentation. Il doit être sous la forme ``"%W.Pf"``, où W est la largeur de la valeur, P est la précision et ``'%'`` et ``'f'`` sont littéraux.

source: Python callable. Will be called with no arguments whenever either of the increment or decrement buttons are pressed.
fr: appelable Python. Est appelé sans argument chaque fois que l'un des boutons d'incrémentation ou de décrémentation est enfoncé.

source: The spinbox widget generates an **<<Increment>>** virtual event when the user presses <Up>, and a **<<Decrement>>** virtual event when the user presses <Down>.
fr: Le widget *spinbox* génère un événement virtuel **<<Increment>>** lorsque l'utilisateur appuie sur <Up>, et un événement virtuel **<<Decrement>>** lorsque l'utilisateur appuie sur <Down>.

source: Returns the current value of the spinbox.
fr: Renvoie la valeur actuelle du *spinbox*.

source: Sets the value of the spinbox to *value*.
fr: Définit la valeur du *spinbox* sur *value*.

source: Notebook
fr: Carnet de notes (*notebook*)

source: Ttk Notebook widget manages a collection of windows and displays a single one at a time. Each child window is associated with a tab, which the user may select to change the currently displayed window.
fr: Le widget *Ttk Notebook* gère une collection de fenêtres et n'en affiche qu'une seule à la fois. Chaque fenêtre enfant est associée à un onglet, que l'utilisateur peut sélectionner pour changer la fenêtre actuellement affichée.

source: If present and greater than zero, specifies the desired height of the pane area (not including internal padding or tabs). Otherwise, the maximum height of all panes is used.
fr: S'il est présent et supérieur à zéro, spécifie la hauteur souhaitée de la zone du volet (sans compter l'ajustement interne ni les onglets). Sinon, la hauteur maximale de tous les volets est utilisée.

source: Specifies the amount of extra space to add around the outside of the notebook. The padding is a list up to four length specifications left top right bottom. If fewer than four elements are specified, bottom defaults to top, right defaults to left, and top defaults to left.
fr: Spécifie la quantité d'espace supplémentaire à ajouter autour de l'extérieur du bloc-notes. L'ajustement est défini par une liste jusqu'à quatre spécifications de longueur à gauche en haut à droite en bas. Si moins de quatre éléments sont spécifiés, *bottom* vaut par défaut *top*, *right* vaut par défaut *left* et *top* vaut par défaut *left*.

source: If present and greater than zero, specified the desired width of the pane area (not including internal padding). Otherwise, the maximum width of all panes is used.
fr: S'il est présent et supérieur à zéro, spécifiez la largeur souhaitée de la zone du volet (hors ajustement interne). Sinon, la largeur maximale de tous les volets est utilisée.

source: Tab Options
fr: Options d'onglet

source: There are also specific options for tabs:
fr: Il existe également des options spécifiques pour les onglets :

source: Either "normal", "disabled" or "hidden". If "disabled", then the tab is not selectable. If "hidden", then the tab is not shown.
fr: Soit ``"normal"``, ``"disabled"`` ou ``"hidden"``. Si *disabled*, l'onglet n'est pas sélectionnable. S'il est *hidden*, l'onglet n'est pas affiché.

source: Specifies how the child window is positioned within the pane area. Value is a string containing zero or more of the characters "n", "s", "e" or "w". Each letter refers to a side (north, south, east or west) that the child window will stick to, as per the :meth:`grid` geometry manager.
fr: Spécifie comment la fenêtre enfant est positionnée dans la zone du volet. La valeur est une chaîne contenant zéro ou plusieurs des caractères "n", "s", "e" ou "w". Chaque lettre fait référence à un côté (nord, sud, est ou ouest) auquel la fenêtre enfant colle, selon le gestionnaire de géométrie :meth:`grid`.

source: Specifies the amount of extra space to add between the notebook and this pane. Syntax is the same as for the option padding used by this widget.
fr: Spécifie la quantité d'espace supplémentaire à ajouter entre le bloc-notes et ce volet. La syntaxe est la même que pour l'option d'ajustement utilisée par ce widget.

source: Specifies a text to be displayed in the tab.
fr: Spécifie un texte à afficher dans l'onglet.

source: Specifies an image to display in the tab. See the option image described in :class:`Widget`.
fr: Spécifie une image à afficher dans l'onglet. Voir l'option *image* décrite dans :class:`Widget`.

source: Specifies how to display the image relative to the text, in the case both options text and image are present. See `Label Options`_ for legal values.
fr: Spécifie comment afficher l'image par rapport au texte, dans le cas où les deux options texte et image sont présentes. Voir `Label Options`_ pour les valeurs autorisées.

source: Specifies the index (0-based) of a character to underline in the text string. The underlined character is used for mnemonic activation if :meth:`Notebook.enable_traversal` is called.
fr: Spécifie l'indice (en commençant à 0) d'un caractère à souligner dans la chaîne de texte. Le caractère souligné est utilisé pour l'activation mnémonique si :meth:`Notebook.enable_traversal` est appelé.

source: Tab Identifiers
fr: Identifiants d'onglet

source: The tab_id present in several methods of :class:`ttk.Notebook` may take any of the following forms:
fr: Le *tab_id* présent dans plusieurs méthodes de :class:`ttk.Notebook` peut prendre l'une des formes suivantes :

source: An integer between zero and the number of tabs
fr: Un entier compris entre zéro et le nombre d'onglets

source: The name of a child window
fr: Le nom d'une fenêtre fille

source: A positional specification of the form "@x,y", which identifies the tab
fr: Une spécification de position de la forme "@x,y", qui identifie l'onglet

source: The literal string "current", which identifies the currently selected tab
fr: La chaîne littérale ``"current"``, qui identifie l'onglet actuellement sélectionné

source: The literal string "end", which returns the number of tabs (only valid for :meth:`Notebook.index`)
fr: La chaîne littérale ``"end"``, qui renvoie le nombre d'onglets (valable uniquement pour :meth:`Notebook.index`)

source: Virtual Events
fr: Événements virtuels

source: This widget generates a **<<NotebookTabChanged>>** virtual event after a new tab is selected.
fr: Ce widget génère un événement virtuel **<<NotebookTabChanged>>** après la sélection d'un nouvel onglet.

source: Adds a new tab to the notebook.
fr: Ajoute un nouvel onglet au bloc-notes.

source: If window is currently managed by the notebook but hidden, it is restored to its previous position.
fr: Si la fenêtre est actuellement gérée par le *notebook* mais masquée, elle est restaurée à sa position précédente.

source: See `Tab Options`_ for the list of available options.
fr: Voir `Options d'onglet`_ pour la liste des options disponibles.

source: Removes the tab specified by *tab_id*, unmaps and unmanages the associated window.
fr: Supprime l'onglet spécifié par *tab_id*, et ne gère plus la fenêtre associée.

source: Hides the tab specified by *tab_id*.
fr: Masque l'onglet spécifié par *tab_id*.

source: The tab will not be displayed, but the associated window remains managed by the notebook and its configuration remembered. Hidden tabs may be restored with the :meth:`add` command.
fr: L'onglet ne s'affiche pas, mais la fenêtre associée reste gérée par le *notebook* et sa configuration mémorisée. Les onglets cachés peuvent être restaurés avec la commande :meth:`add`.

source: Returns the name of the tab element at position *x*, *y*, or the empty string if none.
fr: Renvoie le nom de l'élément *tab* à la position *x*, *y*, ou la chaîne vide s'il n'y en a pas.

source: Returns the numeric index of the tab specified by *tab_id*, or the total number of tabs if *tab_id* is the string "end".
fr: Renvoie l'indice de l'onglet spécifié par *tab_id*, ou le nombre total d'onglets si *tab_id* est la chaîne ``"end"``.

source: Inserts a pane at the specified position.
fr: Insère un volet à la position spécifiée.

source: *pos* is either the string "end", an integer index, or the name of a managed child. If *child* is already managed by the notebook, moves it to the specified position.
fr: *pos* est soit la chaîne ``"end"``, un indice entier ou le nom d'un enfant géré. Si *child* est déjà géré par le *notebook*, le déplace vers la position spécifiée.

source: Selects the specified *tab_id*.
fr: Sélectionne le *tab_id* spécifié.

source: The associated child window will be displayed, and the previously selected window (if different) is unmapped. If *tab_id* is omitted, returns the widget name of the currently selected pane.
fr: La fenêtre enfant associée est affichée, et la fenêtre précédemment sélectionnée (si différente) est masquée. Si *tab_id* est omis, renvoie le nom du widget du volet actuellement sélectionné.

source: Query or modify the options of the specific *tab_id*.
fr: Interroge ou modifie les options du *tab_id* spécifique.

source: If *kw* is not given, returns a dictionary of the tab option values. If *option* is specified, returns the value of that *option*. Otherwise, sets the options to the corresponding values.
fr: Si *kw* n'est pas donné, renvoie un dictionnaire des valeurs des options de l'onglet. Si *option* est spécifié, renvoie la valeur de cette *option*. Sinon, définit les options sur les valeurs correspondantes.

source: Returns a list of windows managed by the notebook.
fr: Renvoie une liste des fenêtres gérées par le *notebook*.

source: Enable keyboard traversal for a toplevel window containing this notebook.
fr: Active la traversée du clavier pour une fenêtre de niveau supérieur contenant ce bloc-notes.

source: This will extend the bindings for the toplevel window containing the notebook as follows:
fr: Cela étend les liaisons pour la fenêtre de niveau supérieur contenant le bloc-notes comme suit :

source: :kbd:`Control-Tab`: selects the tab following the currently selected one.
fr: :kbd:`Control-Tab` : sélectionne l'onglet suivant celui actuellement sélectionné.

source: :kbd:`Shift-Control-Tab`: selects the tab preceding the currently selected one.
fr: :kbd:`Shift-Control-Tab` : sélectionne l'onglet précédant celui actuellement sélectionné.

source: :kbd:`Alt-K`: where *K* is the mnemonic (underlined) character of any tab, will select that tab.
fr: :kbd:`Alt-K` : où *K* est le caractère mnémonique (souligné) de n'importe quel onglet, sélectionne cet onglet.

source: Multiple notebooks in a single toplevel may be enabled for traversal, including nested notebooks. However, notebook traversal only works properly if all panes have the notebook they are in as master.
fr: Plusieurs blocs-notes dans un seul niveau supérieur peuvent être activés pour la traversée, y compris les blocs-notes imbriqués. Cependant, la traversée du bloc-notes ne fonctionne correctement que si tous les volets ont le bloc-notes dans lequel ils se trouvent en tant que maître.

source: Progressbar
fr: Barre de progression

source: The :class:`ttk.Progressbar` widget shows the status of a long-running operation. It can operate in two modes: 1) the determinate mode which shows the amount completed relative to the total amount of work to be done and 2) the indeterminate mode which provides an animated display to let the user know that work is progressing.
fr: Le widget :class:`ttk.Progressbar` affiche l'état d'une opération de longue durée. Il peut fonctionner en deux modes : 1) le mode déterminé qui indique la quantité achevée par rapport à la quantité totale de travail à effectuer et 2) le mode indéterminé qui fournit un affichage animé pour informer l'utilisateur que le travail progresse.

source: One of "horizontal" or "vertical". Specifies the orientation of the progress bar.
fr: ``"horizontal"`` ou ``"vertical"``. Spécifie l'orientation de la barre de progression.

source: Specifies the length of the long axis of the progress bar (width if horizontal, height if vertical).
fr: Spécifie la longueur de l'axe long de la barre de progression (largeur si horizontale, hauteur si verticale).

source: One of "determinate" or "indeterminate".
fr: ``"determinate"`` ou ``"indeterminate"``.

source: A number specifying the maximum value. Defaults to 100.
fr: Nombre spécifiant la valeur maximale. La valeur par défaut est 100.

source: The current value of the progress bar. In "determinate" mode, this represents the amount of work completed. In "indeterminate" mode, it is interpreted as modulo *maximum*; that is, the progress bar completes one "cycle" when its value increases by *maximum*.
fr: La valeur actuelle de la barre de progression. En mode *determinate*, cela représente la quantité de travail accompli. En mode *indeterminate*, il est interprété comme modulo *maximum* ; c'est-à-dire que la barre de progression effectue un « cycle » lorsque sa valeur augmente de *maximum*.

source: A name which is linked to the option value. If specified, the value of the progress bar is automatically set to the value of this name whenever the latter is modified.
fr: Nom lié à la valeur de l'option. Si spécifié, la valeur de la barre de progression est automatiquement fixée à la valeur de ce nom à chaque modification de ce dernier.

source: Read-only option. The widget periodically increments the value of this option whenever its value is greater than 0 and, in determinate mode, less than maximum. This option may be used by the current theme to provide additional animation effects.
fr: Option en lecture seule. Le widget incrémente périodiquement la valeur de cette option chaque fois que sa valeur est supérieure à 0 et, en mode *déterminate*, inférieure au maximum. Cette option peut être utilisée par le thème actuel pour fournir des effets d'animation supplémentaires.

source: Begin autoincrement mode: schedules a recurring timer event that calls :meth:`Progressbar.step` every *interval* milliseconds. If omitted, *interval* defaults to 50 milliseconds.
fr: Commence le mode d'auto-incrémentation : planifie un événement de minuterie récurrent qui appelle :meth:`Progressbar.step` toutes les *interval* millisecondes. S'il est omis, *interval* est par défaut de 50 millisecondes.

source: Increments the progress bar's value by *amount*.
fr: Incrémente la valeur de la barre de progression de *amount*.

source: *amount* defaults to 1.0 if omitted.
fr: *amount* est par défaut égal à ``1.0`` s'il est omis.

source: Stop autoincrement mode: cancels any recurring timer event initiated by :meth:`Progressbar.start` for this progress bar.
fr: Arrête le mode d'auto-incrémentation : annule tout événement de minuterie récurrent initié par :meth:`Progressbar.start` pour cette barre de progression.

source: Separator
fr: Séparateur

source: The :class:`ttk.Separator` widget displays a horizontal or vertical separator bar.
fr: Le widget :class:`ttk.Separator` affiche une barre de séparation horizontale ou verticale.

source: It has no other methods besides the ones inherited from :class:`ttk.Widget`.
fr: Il n'a pas d'autres méthodes que celles héritées de :class:`ttk.Widget`.

source: This widget accepts the following specific option:
fr: Ce widget accepte l'option spécifique suivante :

source: One of "horizontal" or "vertical". Specifies the orientation of the separator.
fr: ``"horizontal"`` ou ``"vertical"``. Spécifie l'orientation du séparateur.

source: Sizegrip
fr: Poignée de redimensionnement

source: The :class:`ttk.Sizegrip` widget (also known as a grow box) allows the user to resize the containing toplevel window by pressing and dragging the grip.
fr: Le widget :class:`ttk.Sizegrip` (également connu sous le nom de *grow box*) permet à l'utilisateur de redimensionner la fenêtre de niveau supérieur en appuyant et en faisant glisser la poignée.

source: This widget has neither specific options nor specific methods, besides the ones inherited from :class:`ttk.Widget`.
fr: Ce widget n'a ni options spécifiques ni méthodes spécifiques, à part celles héritées de :class:`ttk.Widget`.

source: Platform-specific notes
fr: Notes spécifiques à une plateforme

source: On macOS, toplevel windows automatically include a built-in size grip by default. Adding a :class:`Sizegrip` is harmless, since the built-in grip will just mask the widget.
fr: Sur macOS, les fenêtres de niveau supérieur incluent automatiquement une poignée de redimensionnement intégrée par défaut. L'ajout d'un :class:`Sizegrip` est sans danger, car la poignée intégrée masquera simplement le widget.

source: Bugs
fr: Bogues

source: If the containing toplevel's position was specified relative to the right or bottom of the screen (e.g. ....), the :class:`Sizegrip` widget will not resize the window.
fr: Si la position du contenant de niveau supérieur a été spécifiée par rapport à la droite ou au bas de l'écran (par exemple…), le widget :class:`Sizegrip` ne redimensionne pas la fenêtre.

source: This widget supports only "southeast" resizing.
fr: Ce widget ne prend en charge que le redimensionnement ``"southeast"``.

source: Treeview
fr: Arborescence

source: The :class:`ttk.Treeview` widget displays a hierarchical collection of items. Each item has a textual label, an optional image, and an optional list of data values. The data values are displayed in successive columns after the tree label.
fr: Le widget :class:`ttk.Treeview` affiche une collection hiérarchique d'éléments. Chaque élément possède une étiquette textuelle, une image facultative et une liste facultative de valeurs de données. Les valeurs des données sont affichées dans des colonnes successives après l'étiquette de l'arbre.

source: The order in which data values are displayed may be controlled by setting the widget option ``displaycolumns``. The tree widget can also display column headings. Columns may be accessed by number or symbolic names listed in the widget option columns. See `Column Identifiers`_.
fr: L'ordre dans lequel les valeurs de données sont affichées peut être contrôlé en définissant l'option de widget ``displaycolumns``. Le widget d'arborescence peut également afficher les en-têtes de colonne. Les colonnes sont accessibles par des numéros ou des noms symboliques indiqués dans l'option *columns* du widget. Voir `Identifiants de colonnes`_.

source: Each item is identified by a unique name. The widget will generate item IDs if they are not supplied by the caller. There is a distinguished root item, named ``{}``. The root item itself is not displayed; its children appear at the top level of the hierarchy.
fr: Chaque élément est identifié par un nom unique. Le widget génère des identifiants d'éléments s'ils ne sont pas fournis par l'appelant. Il existe un élément racine distinct, nommé ``{}``. L'élément racine lui-même n'est pas affiché ; ses enfants apparaissent au niveau supérieur de la hiérarchie.

source: Each item also has a list of tags, which can be used to associate event bindings with individual items and control the appearance of the item.
fr: Chaque élément possède également une liste de balises, qui peuvent être utilisées pour associer des liaisons d'événements à des éléments individuels et contrôler l'apparence de l'élément.

source: The Treeview widget supports horizontal and vertical scrolling, according to the options described in `Scrollable Widget Options`_ and the methods :meth:`Treeview.xview` and :meth:`Treeview.yview`.
fr: Le widget *Treeview* prend en charge le défilement horizontal et vertical, selon les options décrites dans `Scrollable Widget Options`_ et les méthodes :meth:`Treeview.xview` et :meth:`Treeview.yview`.

source: A list of column identifiers, specifying the number of columns and their names.
fr: Une liste d'identificateurs de colonne, spécifiant le nombre de colonnes et leurs noms.

source: A list of column identifiers (either symbolic or integer indices) specifying which data columns are displayed and the order in which they appear, or the string "#all".
fr: Une liste d'identificateurs de colonne (indices symboliques ou entiers) spécifiant quelles colonnes de données sont affichées et l'ordre dans lequel elles apparaissent, ou la chaîne ``"#all"``.

source: Specifies the number of rows which should be visible. Note: the requested width is determined from the sum of the column widths.
fr: Spécifie le nombre de lignes qui doivent être visibles. Remarque : la largeur demandée est déterminée à partir de la somme des largeurs de colonne.

source: Specifies the internal padding for the widget. The padding is a list of up to four length specifications.
fr: Spécifie le remplissage interne du widget. L'ajustement est décrit par une liste jusqu'à quatre spécifications de longueur.

source: Controls how the built-in class bindings manage the selection. One of "extended", "browse" or "none". If set to "extended" (the default), multiple items may be selected. If "browse", only a single item will be selected at a time. If "none", the selection will not be changed.
fr: Contrôle la façon dont les liaisons de classe intégrées gèrent la sélection. Les valeurs possibles sont ``"extended"``, ``"browse"`` ou ``"none"``. S'il est défini sur *extended* (valeur par défaut), plusieurs éléments peuvent être sélectionnés. Si c'est *browse* un seul élément ne peut être sélectionné à la fois. Si c'est *none*, la sélection ne peut pas être modifiée.

source: Note that the application code and tag bindings can set the selection however they wish, regardless of the value of this option.
fr: Notez que le code d'application et les liaisons de balises peuvent définir la sélection comme ils le souhaitent, quelle que soit la valeur de cette option.

source: A list containing zero or more of the following values, specifying which elements of the tree to display.
fr: Une liste contenant zéro ou plusieurs des valeurs suivantes, spécifiant les éléments de l'arborescence à afficher.

source: tree: display tree labels in column #0.
fr: *tree* : affiche les étiquettes de l'arbre dans la colonne 0.

source: headings: display the heading row.
fr: *headings* : affiche la ligne d'en-tête.

source: The default is "tree headings", i.e., show all elements.
fr: La valeur par défaut est ``"tree headings"``, c'est-à-dire afficher tous les éléments.

source: **Note**: Column #0 always refers to the tree column, even if show="tree" is not specified.
fr: **Remarque** : la colonne 0 fait toujours référence à la colonne de l'arborescence, même si ``show="tree"`` n'est pas spécifié.

source: Item Options
fr: Options d'éléments

source: The following item options may be specified for items in the insert and item widget commands.
fr: Les options d'éléments suivantes peuvent être spécifiées pour les éléments dans les commandes *insert* et les widgets de type élément.

source: The textual label to display for the item.
fr: Libellé textuel à afficher pour l'élément.

source: A Tk Image, displayed to the left of the label.
fr: Image *Tk*, affichée à gauche de l'étiquette.

source: The list of values associated with the item.
fr: Liste des valeurs associées à l'élément.
