Repository: python/python-docs-fr
Catalog: library/tkinter.ttk.po
Languages: fr

source: :mod:`tkinter.ttk` --- Tk themed widgets
fr: :mod:`tkinter.ttk` — Widgets sur le thème *Tk*

source: **Source code:** :source:`Lib/tkinter/ttk.py`
fr: **Code source :** :source:`Lib/tkinter/ttk.py`

source: The :mod:`tkinter.ttk` module provides access to the Tk themed widget set, introduced in Tk 8.5. It provides additional benefits including anti-aliased font rendering under X11 and window transparency (requiring a composition window manager on X11).
fr: Le module :mod:`tkinter.ttk` donne accès à l'ensemble de widgets sur le thème *Tk*, introduit dans *Tk* 8.5. Il offre des avantages supplémentaires, notamment le rendu des polices avec anticrénelage sous *X11* et la transparence des fenêtres (nécessitant un gestionnaire de fenêtres de composition sur *X11*).

source: The basic idea for :mod:`tkinter.ttk` is to separate, to the extent possible, the code implementing a widget's behavior from the code implementing its appearance.
fr: L'idée de base de :mod:`tkinter.ttk` est de séparer, dans la mesure du possible, le code implémentant le comportement d'un widget du code implémentant son apparence.

source: A document introducing theming support for Tk
fr: Document présentant la prise en charge des thèmes pour *Tk*

source: Using Ttk
fr: Utilisation de *Ttk*

source: To start using Ttk, import its module::
fr: Pour commencer à utiliser *Ttk*, importez son module ::

source: To override the basic Tk widgets, the import should follow the Tk import::
fr: Pour remplacer les widgets *Tk* de base, l'importation doit suivre l'importation *Tk* ::

source: That code causes several :mod:`tkinter.ttk` widgets (:class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale` and :class:`Scrollbar`) to automatically replace the Tk widgets.
fr: Ce code implique que plusieurs widgets :mod:`tkinter.ttk` (:class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale` et :class:`Scrollbar`) remplacent automatiquement les widgets *Tk*.

source: This has the direct benefit of using the new widgets which gives a better look and feel across platforms; however, the replacement widgets are not completely compatible. The main difference is that widget options such as "fg", "bg" and others related to widget styling are no longer present in Ttk widgets. Instead, use the :class:`ttk.Style` class for improved styling effects.
fr: L'avantage immédiat est d'utiliser les nouveaux widgets qui donnent une meilleure apparence sur toutes les plateformes ; cependant, les widgets de remplacement ne sont pas complètement compatibles. La principale différence est que les options de widget telles que ``"fg"``, ``"bg"`` et d'autres liées au style des widgets ne sont plus présentes dans les widgets *Ttk*. Utilisez plutôt la classe :class:`ttk.Style` pour des effets de style améliorés.

source: A monograph (using Tcl terminology) about differences typically encountered when moving applications to use the new widgets.
fr: Monographie (utilisant la terminologie *Tcl*) sur les différences généralement rencontrées lors de la modification d'applications pour utiliser les nouveaux widgets.

source: Ttk Widgets
fr: Widgets *Ttk*

source: Ttk comes with 18 widgets, twelve of which already existed in tkinter: :class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale`, :class:`Scrollbar`, and :class:`Spinbox`. The other six are new: :class:`Combobox`, :class:`Notebook`, :class:`Progressbar`, :class:`Separator`, :class:`Sizegrip` and :class:`Treeview`. And all them are subclasses of :class:`Widget`.
fr: *Ttk* est livré avec 18 widgets, dont douze existaient déjà dans *tkinter* : :class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale`, :class:`Scrollbar` et :class:`Spinbox`. Les six autres sont nouveaux : :class:`Combobox`, :class:`Notebook`, :class:`Progressbar`, :class:`Separator`, :class:`Sizegrip` et :class:`Treeview`. Et tous sont des sous-classes de :class:`Widget`.

source: Using the Ttk widgets gives the application an improved look and feel. As discussed above, there are differences in how the styling is coded.
fr: L'utilisation des widgets *Ttk* donne à l'application une apparence et une convivialité améliorées. Comme indiqué ci-dessus, il existe des différences dans la façon dont le style est codé.

source: Tk code::
fr: Code *Tk* ::

source: Ttk code::
fr: Code *Ttk* ::

source: For more information about TtkStyling_, see the :class:`Style` class documentation.
fr: Pour plus d'informations sur TtkStyling_, consultez la documentation de la classe :class:`Style`.

source: :class:`ttk.Widget` defines standard options and methods supported by Tk themed widgets and is not supposed to be directly instantiated.
fr: :class:`ttk.Widget` définit les options et méthodes standard prises en charge par les widgets à thème *Tk* et n'est pas censé être directement instancié.

source: Standard Options
fr: Options standards

source: Specifies the window class. The class is used when querying the option database for the window's other options, to determine the default bindtags for the window, and to select the widget's default layout and style. This option is read-only, and may only be specified when the window is created.
fr: Spécifie la classe de fenêtre. La classe est utilisée lors de l'interrogation de la base de données d'options pour les autres options de la fenêtre, pour déterminer les balises de liaison par défaut pour la fenêtre et pour sélectionner la disposition et le style par défaut du widget. Cette option est en lecture seule et ne peut être spécifiée qu'à la création de la fenêtre.

source: Specifies the mouse cursor to be used for the widget. If set to the empty string (the default), the cursor is inherited for the parent widget.
fr: Spécifie le curseur de la souris à utiliser pour le widget. S'il est défini sur la chaîne vide (valeur par défaut), le curseur est hérité du widget parent.

source: Determines whether the window accepts the focus during keyboard traversal. 0, 1 or an empty string is returned. If 0 is returned, it means that the window should be skipped entirely during keyboard traversal. If 1, it means that the window should receive the input focus as long as it is viewable. And an empty string means that the traversal scripts make the decision about whether or not to focus on the window.
fr: Détermine si la fenêtre accepte le focus pendant le parcours du clavier. 0, 1 ou une chaîne vide est renvoyée. Si 0 est renvoyé, cela signifie que la fenêtre doit être entièrement ignorée lors du parcours au clavier. Si 1, cela signifie que la fenêtre doit recevoir le focus d'entrée tant qu'elle est visible. Et une chaîne vide signifie que les scripts de parcours prennent la décision de donner ou non le focus à la fenêtre.

source: May be used to specify a custom widget style.
fr: Peut être utilisé pour spécifier un style de widget personnalisé.

source: Scrollable Widget Options
fr: Options de widget avec barre de défilement

source: The following options are supported by widgets that are controlled by a scrollbar.
fr: Les options suivantes sont prises en charge par les widgets contrôlés par une barre de défilement.

source: Used to communicate with horizontal scrollbars.
fr: Utilisé pour communiquer avec les barres de défilement horizontal.

source: When the view in the widget's window change, the widget will generate a Tcl command based on the scrollcommand.
fr: Lorsque la vue dans la fenêtre du widget change, le widget génère une commande *Tcl* basée sur *scrollcommand*.

source: Usually this option consists of the method :meth:`Scrollbar.set` of some scrollbar. This will cause the scrollbar to be updated whenever the view in the window changes.
fr: Habituellement, cette option consiste en la méthode :meth:`Scrollbar.set` d'une barre de défilement. Cela entraîne la mise à jour de la barre de défilement chaque fois que la vue dans la fenêtre change.

source: Used to communicate with vertical scrollbars. For some more information, see above.
fr: Utilisé pour communiquer avec les barres de défilement vertical. Pour plus d'informations, voir ci-dessus.

source: Label Options
fr: Options d'étiquette (*label*)

source: The following options are supported by labels, buttons and other button-like widgets.
fr: Les options suivantes sont prises en charge par les étiquettes (*labels*), les boutons et autres widgets de type bouton.

source: Specifies a text string to be displayed inside the widget.
fr: Spécifie une chaîne de texte à afficher dans le widget.

source: Specifies a name whose value will be used in place of the text option resource.
fr: Spécifie un nom dont la valeur est utilisée à la place de la ressource d'option de texte.

source: If set, specifies the index (0-based) of a character to underline in the text string. The underline character is used for mnemonic activation.
fr: S'il est défini, spécifie l'indice (commençant à 0) d'un caractère à souligner dans la chaîne de texte. Le caractère de soulignement est utilisé pour l'activation mnémonique.

source: Specifies an image to display. This is a list of 1 or more elements. The first element is the default image name. The rest of the list if a sequence of statespec/value pairs as defined by :meth:`Style.map`, specifying different images to use when the widget is in a particular state or a combination of states. All images in the list should have the same size.
fr: Spécifie une image à afficher. C'est une liste de un ou plusieurs éléments. Le premier élément est le nom de l'image par défaut. Le reste de la liste est une séquence de paires *statespec*-*valeur* telles que définies par :meth:`Style.map`, spécifiant différentes images à utiliser lorsque le widget est dans un état particulier ou une combinaison d'états. Toutes les images de la liste doivent avoir la même taille.

source: Specifies how to display the image relative to the text, in the case both text and images options are present. Valid values are:
fr: Spécifie comment afficher l'image par rapport au texte, dans le cas où les options de texte et d'images sont présentes. Les valeurs valides sont :

source: text: display text only
fr: *text* : afficher uniquement le texte

source: image: display image only
fr: *image* : afficher uniquement l'image

source: top, bottom, left, right: display image above, below, left of, or right of the text, respectively.
fr: *top*, *bottom*, *left*, *right* : afficher l'image au-dessus, en dessous, à gauche ou à droite du texte, respectivement.

source: none: the default. display the image if present, otherwise the text.
fr: *none* : la valeur par défaut. Afficher l'image si présente, sinon le texte.

source: If greater than zero, specifies how much space, in character widths, to allocate for the text label, if less than zero, specifies a minimum width. If zero or unspecified, the natural width of the text label is used.
fr: Si supérieur à zéro, spécifie la quantité d'espace, en largeurs de caractères, à allouer à l'étiquette de texte, si inférieur à zéro, spécifie une largeur minimale. Si zéro ou non spécifié, la largeur naturelle de l'étiquette de texte est utilisée.

source: Compatibility Options
fr: Options de compatibilité

source: May be set to "normal" or "disabled" to control the "disabled" state bit. This is a write-only option: setting it changes the widget state, but the :meth:`Widget.state` method does not affect this option.
fr: Peut être défini sur ``"normal"`` ou ``"disabled"`` pour contrôler le bit d'état d'activation. Il s'agit d'une option en écriture seule : sa définition modifie l'état du widget, mais la méthode :meth:`Widget.state` n'affecte pas cette option.

source: Widget States
fr: États des widgets

source: The widget state is a bitmap of independent state flags.
fr: L'état du widget est une combinaison d'indicateurs d'état indépendants.

source: Flag
fr: Option

source: The mouse cursor is over the widget and pressing a mouse button will cause some action to occur
fr: Le curseur de la souris est sur le widget et appuyer sur un bouton de la souris provoquera une action

source: Widget is disabled under program control
fr: Le widget est désactivé sous le contrôle du programme

source: Widget has keyboard focus
fr: Le widget a le focus du clavier

source: Widget is being pressed
fr: Le widget est en train d'être pressé

source: "On", "true", or "current" for things like Checkbuttons and radiobuttons
fr: ``"On"``, ``"true"`` ou ``"current"`` pour des choses comme les boutons de contrôle et les boutons radio

source: Windows and Mac have a notion of an "active" or foreground window. The *background* state is set for widgets in a background window, and cleared for those in the foreground window
fr: Windows et Mac ont une notion de fenêtre « active » ou de premier plan. L'état *background* est défini pour les widgets dans une fenêtre en arrière-plan et effacé pour ceux de la fenêtre au premier plan

source: Widget should not allow user modification
fr: Le widget ne doit pas permettre la modification par l'utilisateur

source: A widget-specific alternate display format
fr: Un format d'affichage alternatif spécifique au widget

source: The widget's value is invalid
fr: La valeur du widget est invalide

source: A state specification is a sequence of state names, optionally prefixed with an exclamation point indicating that the bit is off.
fr: Une spécification d'état est une séquence de noms d'état, éventuellement précédée d'un point d'exclamation indiquant que le bit est désactivé.

source: Besides the methods described below, the :class:`ttk.Widget` supports the methods :meth:`tkinter.Widget.cget` and :meth:`tkinter.Widget.configure`.
fr: Outre les méthodes décrites ci-dessous, la :class:`ttk.Widget` prend en charge les méthodes :meth:`tkinter.Widget.cget` et :meth:`tkinter.Widget.configure`.

source: Returns the name of the element at position *x* *y*, or the empty string if the point does not lie within any element.
fr: Renvoie le nom de l'élément à la position *x* *y*, ou la chaîne vide si le point ne se trouve dans aucun élément.

source: *x* and *y* are pixel coordinates relative to the widget.
fr: *x* et *y* sont des coordonnées en pixels relatives au widget.

source: Test the widget's state. If a callback is not specified, returns ``True`` if the widget state matches *statespec* and ``False`` otherwise. If callback is specified then it is called with args if widget state matches *statespec*.
fr: Teste l'état du widget. Si un rappel n'est pas spécifié, renvoie ``True`` si l'état du widget correspond à *statespec* et ``False`` sinon. Si le rappel est spécifié, il est appelé avec des arguments si l'état du widget correspond à *statespec*.

source: Modify or inquire widget state. If *statespec* is specified, sets the widget state according to it and return a new *statespec* indicating which flags were changed. If *statespec* is not specified, returns the currently enabled state flags.
fr: Modifie ou demande l'état du widget. Si *statespec* est spécifié, définit l'état du widget en fonction de celui-ci et renvoie un nouveau *statespec* indiquant quels drapeaux ont été modifiés. Si *statespec* n'est pas spécifié, renvoie les indicateurs d'état actuellement activés.

source: *statespec* will usually be a list or a tuple.
fr: *statespec* est généralement une liste ou un *n*-uplet.

source: The :class:`ttk.Combobox` widget combines a text field with a pop-down list of values. This widget is a subclass of :class:`Entry`.
fr: Le widget :class:`ttk.Combobox` combine un champ de texte avec une liste déroulante de valeurs. Ce widget est une sous-classe de :class:`Entry`.

source: Besides the methods inherited from :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` and :meth:`Widget.state`, and the following inherited from :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.selection`, :meth:`Entry.xview`, it has some other methods, described at :class:`ttk.Combobox`.
fr: En plus des méthodes héritées de :class:`Widget` : :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` et :meth:`Widget.state`, et les suivants hérités de :class:`Entry` : :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.selection`, :meth:`Entry.xview`, il a quelques autres méthodes, décrites dans :class:`ttk.Combobox`.

source: This widget accepts the following specific options:
fr: Ce widget accepte les options spécifiques suivantes :

source: exportselection
fr: *exportationsselection*

source: Boolean value. If set, the widget selection is linked to the Window Manager selection (which can be returned by invoking Misc.selection_get, for example).
fr: Valeur booléenne. Si elle est définie, la sélection du widget est liée à la sélection du gestionnaire de fenêtres (qui peut être renvoyée en appelant *Misc.selection_get*, par exemple).

source: Specifies how the text is aligned within the widget. One of "left", "center", or "right".
fr: Spécifie comment le texte est aligné dans le widget. Les valeurs possibles sont ``"left"``, ``"center"`` ou ``"right"``.

source: Specifies the height of the pop-down listbox, in rows.
fr: Spécifie la hauteur de la liste déroulante, en lignes.

source: A script (possibly registered with Misc.register) that is called immediately before displaying the values. It may specify which values to display.
fr: Script (éventuellement enregistré avec *Misc.register*) qui est appelé immédiatement avant d'afficher les valeurs. Il peut spécifier les valeurs à afficher.

source: One of "normal", "readonly", or "disabled". In the "readonly" state, the value may not be edited directly, and the user can only selection of the values from the dropdown list. In the "normal" state, the text field is directly editable. In the "disabled" state, no interaction is possible.
fr: Les valeurs sont ``"normal"``, ``"readonly"`` ou ``"disabled"``. Dans l'état *readonly*, la valeur ne peut pas être modifiée directement et l'utilisateur ne peut que sélectionner les valeurs dans la liste déroulante. Dans l'état *normal*, le champ texte est directement éditable. Dans l'état *disabled*, aucune interaction n'est possible.

source: Specifies a name whose value is linked to the widget value. Whenever the value associated with that name changes, the widget value is updated, and vice versa. See :class:`tkinter.StringVar`.
fr: Spécifie un nom dont la valeur est liée à la valeur du widget. Chaque fois que la valeur associée à ce nom change, la valeur du widget est mise à jour, et vice versa. Voir :class:`tkinter.StringVar`.

source: Specifies the list of values to display in the drop-down listbox.
fr: Spécifie la liste de valeurs à afficher dans la liste déroulante.

source: Specifies an integer value indicating the desired width of the entry window, in average-size characters of the widget's font.
fr: Spécifie une valeur entière indiquant la largeur souhaitée de la fenêtre d'entrée, en caractères de taille moyenne de la police du widget.

source: Virtual events
fr: Événements virtuels

source: The combobox widgets generates a **<<ComboboxSelected>>** virtual event when the user selects an element from the list of values.
fr: Les widgets *combobox* génèrent un événement virtuel **<<ComboboxSelected>>** lorsque l'utilisateur sélectionne un élément dans la liste de valeurs.

source: If *newindex* is specified, sets the combobox value to the element position *newindex*. Otherwise, returns the index of the current value or -1 if the current value is not in the values list.
fr: Si *newindex* est spécifié, définit la valeur de la *combobox* à la position de l'élément *newindex*. Sinon, renvoie l'indice de la valeur courante ou −1 si la valeur courante n'est pas dans la liste des valeurs.

source: Returns the current value of the combobox.
fr: Renvoie la valeur actuelle de la *combobox*.

source: Sets the value of the combobox to *value*.
fr: Définit la valeur de la *combobox* sur *value*.

source: The :class:`ttk.Spinbox` widget is a :class:`ttk.Entry` enhanced with increment and decrement arrows. It can be used for numbers or lists of string values. This widget is a subclass of :class:`Entry`.
fr: Le widget :class:`ttk.Spinbox` est un :class:`ttk.Entry` amélioré avec des flèches d'incrémentation et de décrémentation. Il peut être utilisé pour des nombres ou des listes de valeurs de chaîne. Ce widget est une sous-classe de :class:`Entry`.

source: Besides the methods inherited from :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` and :meth:`Widget.state`, and the following inherited from :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.xview`, it has some other methods, described at :class:`ttk.Spinbox`.
fr: En plus des méthodes héritées de :class:`Widget` : :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` et :meth:`Widget.state`, et les suivantes héritées de :class:`Entry` : :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.xview`, il a quelques autres méthodes, décrites dans :class:`ttk.Spinbox`.

source: Float value. If set, this is the minimum value to which the decrement button will decrement. Must be spelled as ``from_`` when used as an argument, since ``from`` is a Python keyword.
fr: Valeur flottante. Si elle est définie, il s'agit de la valeur minimale à laquelle le bouton de décrémentation décrémentera. Doit être orthographié comme ``from_`` lorsqu'il est utilisé comme argument, car ``from`` est un mot-clé Python.

source: Float value. If set, this is the maximum value to which the increment button will increment.
fr: Valeur flottante. Si elle est définie, il s'agit de la valeur maximale du bouton d'incrémentation.

source: Float value. Specifies the amount which the increment/decrement buttons change the value. Defaults to 1.0.
fr: Valeur flottante. Spécifie la quantité dont les boutons d'incrémentation/décrémentation modifient la valeur. La valeur par défaut est 1.0.

source: Sequence of string or float values. If specified, the increment/decrement buttons will cycle through the items in this sequence rather than incrementing or decrementing numbers.
fr: Séquence de valeurs de chaîne ou flottantes. S'ils sont spécifiés, les boutons d'incrémentation/décrémentation font défiler les éléments dans cette séquence plutôt que d'incrémenter ou de décrémenter les nombres.

source: Boolean value. If ``True``, increment and decrement buttons will cycle from the ``to`` value to the ``from`` value or the ``from`` value to the ``to`` value, respectively.
fr: Valeur booléenne. Si ``True``, les boutons d'incrémentation et de décrémentation passent de la valeur ``to`` à la valeur ``from`` ou de la valeur ``from`` à la valeur ``to``, respectivement.
