Repository: python/python-docs-fr
Catalog: library/tkinter.font.po
Languages: fr

source: :mod:`tkinter.font` --- Tkinter font wrapper
fr: :mod:`tkinter.font` — enveloppe pour les polices *Tkinter*

source: **Source code:** :source:`Lib/tkinter/font.py`
fr: **Code source :** :source:`Lib/tkinter/font.py`

source: The :mod:`tkinter.font` module provides the :class:`Font` class for creating and using named fonts.
fr: Le module :mod:`tkinter.font` fournit la classe :class:`Font` pour créer et utiliser des polices nommées.

source: The different font weights and slants are:
fr: Les différentes épaisseurs et inclinaisons des polices sont :

source: The :class:`Font` class represents a named font. *Font* instances are given unique names and can be specified by their family, size, and style configuration. Named fonts are Tk's method of creating and identifying fonts as a single object, rather than specifying a font by its attributes with each occurrence.
fr: La classe :class:`Font` représente une police nommée. Les instances *Font* reçoivent des noms uniques et peuvent être spécifiées par leur configuration de famille, de taille et de style. Les polices nommées sont la méthode de *Tk* pour créer et identifier les polices comme un seul objet, plutôt que de spécifier une police par ses attributs à chaque occurrence.

source: *font* - font specifier tuple (family, size, options)
fr: *font* – *n*-uplet spécificateur de police (famille, taille, options)

source: *name* - unique font name
fr: *name* – nom de police unique

source: *exists* - self points to existing named font if true
fr: *exists* – s'il est vrai, *self* pointe vers la police nommée existante

source: additional keyword options (ignored if *font* is specified):
fr: options nommées supplémentaires (ignorées si *font* est spécifié) :

source: *family* - font family i.e. Courier, Times
fr: *family* – famille de polices, c'est-à-dire *Courier*, *Times*

source: *size* - font size
fr: *size* – taille de la police

source: If *size* is positive it is interpreted as size in points.
fr: Si *size* est positif, il est interprété comme une taille en points.

source: If *size* is a negative number its absolute value is treated
fr: Si *size* est un nombre négatif sa valeur absolue est traitée

source: as size in pixels.
fr: comme taille en pixels.

source: *weight* - font emphasis (NORMAL, BOLD)
fr: *weight* – accentuation de la police (*NORMAL*, *BOLD* pour gras)

source: *slant* - ROMAN, ITALIC
fr: *slant* – *ROMAN* pour romain, *ITALIC* pour italique

source: *underline* - font underlining (0 - none, 1 - underline)
fr: *underline* – soulignement de la police (0 – aucun, 1 – souligné)

source: *overstrike* - font strikeout (0 - none, 1 - strikeout)
fr: *overstrike* – police barrée (0 – aucune, 1 – barré)

source: Return the attributes of the font.
fr: Renvoie les attributs de la police.

source: Retrieve an attribute of the font.
fr: Récupère un attribut de la police.

source: Modify attributes of the font.
fr: Modifie les attributs de la police.

source: Return new instance of the current font.
fr: Renvoie une nouvelle instance de la police actuelle.

source: Return amount of space the text would occupy on the specified display when formatted in the current font. If no display is specified then the main application window is assumed.
fr: Renvoie la quantité d'espace que le texte occuperait sur l'affichage spécifié s'il était formaté dans la police actuelle. Si *displayof* n'est pas spécifié, *tk* suppose que c'est la fenêtre principale de l'application.

source: Return font-specific data. Options include:
fr: Renvoie des données spécifiques à la police. Les options incluent :

source: *ascent* - distance between baseline and highest point that a
fr: *ascent* – distance entre la ligne de base et le point le plus haut qu'un

source: character of the font can occupy
fr: caractère de la police peut occuper

source: *descent* - distance between baseline and lowest point that a
fr: *descent* – distance entre la ligne de base et le point le plus bas qu'un

source: *linespace* - minimum vertical separation necessary between any two
fr: *linespace* – séparation verticale minimale nécessaire entre deux

source: characters of the font that ensures no vertical overlap between lines.
fr: caractères de la police qui assure l'absence de chevauchement vertical entre les lignes.

source: *fixed* - 1 if font is fixed-width else 0
fr: *fixed* – 1 si la police est à largeur fixe sinon 0

source: Return the different font families.
fr: Renvoie les différentes familles de polices.

source: Return the names of defined fonts.
fr: Renvoie les noms des polices définies.

source: Return a :class:`Font` representation of a tk named font.
fr: Renvoie une représentation :class:`Font` d'une police *tk* nommée.

source: The *root* parameter was added.
fr: le paramètre *root* a été ajouté.
