Repository: python/python-docs-fr
Catalog: library/tkinter.ttk.po
Languages: fr

source: Create a new element in the current theme, of the given *etype* which is expected to be either "image", "from" or "vsapi". The latter is only available in Tk 8.6a for Windows XP and Vista and is not described here.
fr: Crée un nouvel élément dans le thème actuel, du *etype* donné qui doit être ``"image"``, ``"from"`` ou ``"vsapi"``. Ce dernier n'est disponible que dans *Tk* 8.6a pour Windows XP et Vista et n'est pas décrit ici.

source: If "image" is used, *args* should contain the default image name followed by statespec/value pairs (this is the imagespec), and *kw* may have the following options:
fr: Si *image* est utilisé, *args* doit contenir le nom de l'image par défaut suivi de paires *statespec* / *value* (il s'agit de l'*imagespec*), et *kw* peut avoir les options suivantes :

source: border=padding
fr: *border*\=remplissage

source: padding is a list of up to four integers, specifying the left, top, right, and bottom borders, respectively.
fr: *padding* est une liste de quatre entiers maximum, spécifiant respectivement les bordures gauche, supérieure, droite et inférieure.

source: height=height
fr: *height*\=hauteur

source: Specifies a minimum height for the element. If less than zero, the base image's height is used as a default.
fr: Spécifie une hauteur minimale pour l'élément. Si elle est inférieure à zéro, la hauteur de l'image de base est utilisée par défaut.

source: padding=padding
fr: *padding*\= ajustement

source: Specifies the element's interior padding. Defaults to border's value if not specified.
fr: Spécifie l'ajustement intérieur de l'élément. La valeur par défaut est la valeur de *border* si elle n'est pas spécifiée.

source: Specifies how the image is placed within the final parcel. spec contains zero or more characters "n", "s", "w", or "e".
fr: Spécifie comment l'image est placée dans la partie de l'espace attribué finale. *spec* contient zéro ou plusieurs caractères "n", "s", "w" ou "e".

source: width=width
fr: *width*\=largeur

source: Specifies a minimum width for the element. If less than zero, the base image's width is used as a default.
fr: Spécifie une largeur minimale pour l'élément. Si inférieur à zéro, la largeur de l'image de base est utilisée par défaut.

source: If "from" is used as the value of *etype*, :meth:`element_create` will clone an existing element. *args* is expected to contain a themename, from which the element will be cloned, and optionally an element to clone from. If this element to clone from is not specified, an empty element will be used. *kw* is discarded.
fr: Si *from* est utilisé comme valeur de *etype*, :meth:`element_create` clone un élément existant. *args* doit contenir un nom de thème, à partir duquel l'élément est cloné, et éventuellement un élément à cloner. Si cet élément qu'il faut cloner n'est pas spécifié, un élément vide est utilisé. *kw* est ignoré.

source: Returns the list of elements defined in the current theme.
fr: Renvoie la liste des éléments définis dans le thème courant.

source: Returns the list of *elementname*'s options.
fr: Renvoie la liste des options de *elementname*.

source: Create a new theme.
fr: Crée un nouveau thème.

source: It is an error if *themename* already exists. If *parent* is specified, the new theme will inherit styles, elements and layouts from the parent theme. If *settings* are present they are expected to have the same syntax used for :meth:`theme_settings`.
fr: C'est une erreur si *themename* existe déjà. Si *parent* est spécifié, le nouveau thème hérite des styles, des éléments et des mises en page du thème parent. Si *settings* est présent, il doit avoir la même syntaxe que celle utilisée pour :meth:`theme_settings`.

source: Temporarily sets the current theme to *themename*, apply specified *settings* and then restore the previous theme.
fr: Définit temporairement le thème actuel sur *themename*, applique les *settings* spécifiés, puis restaure le thème précédent.

source: Each key in *settings* is a style and each value may contain the keys 'configure', 'map', 'layout' and 'element create' and they are expected to have the same format as specified by the methods :meth:`Style.configure`, :meth:`Style.map`, :meth:`Style.layout` and :meth:`Style.element_create` respectively.
fr: Chaque clé dans *settings* est un style et chaque valeur peut contenir les clés ``'configure'``, ``'map'``, ``'layout'`` et ``'element create'`` et elles doivent avoir le même format que celui spécifié par les méthodes :meth:`Style.configure`, :meth:`Style.map`, :meth:`Style.layout` et :meth:`Style.element_create` respectivement.

source: As an example, let's change the Combobox for the default theme a bit::
fr: À titre d'exemple, changeons un peu la *Combobox* pour le thème par défaut ::

source: Returns a list of all known themes.
fr: Renvoie une liste de tous les thèmes connus.

source: If *themename* is not given, returns the theme in use. Otherwise, sets the current theme to *themename*, refreshes all widgets and emits a <<ThemeChanged>> event.
fr: Si *themename* n'est pas donné, renvoie le thème utilisé. Sinon, définit le thème actuel sur *themename*, actualise tous les widgets et lève un événement <<ThemeChanged>>.

source: Layouts
fr: Dispositions de mise en page

source: A layout can be just ``None``, if it takes no options, or a dict of options specifying how to arrange the element. The layout mechanism uses a simplified version of the pack geometry manager: given an initial cavity, each element is allocated a parcel. Valid options/values are:
fr: Une mise en page peut être juste ``None``, si elle ne prend aucune option, ou un dictionnaire d'options spécifiant comment organiser l'élément. Le mécanisme de mise en page utilise une version simplifiée du gestionnaire de disposition *pack* : étant donné un espace initial vide, chaque élément se voit attribuer une partie de cet espace. Les options/valeurs valides sont :

source: side: whichside
fr: *side* : de quel côté

source: Specifies which side of the cavity to place the element; one of top, right, bottom or left. If omitted, the element occupies the entire cavity.
fr: Spécifie de quel côté de l'espace vide placer l'élément ; *top* (en haut), *right* (à droite), *bottom* (en bas) ou *left* (à gauche). S'il est omis, l'élément occupe toute l'espace.

source: Specifies where the element is placed inside its allocated parcel.
fr: Spécifie où l'élément est placé à l'intérieur de sa partie d'espace alloué.

source: unit: 0 or 1
fr: *unit* : 0 ou 1

source: If set to 1, causes the element and all of its descendants to be treated as a single element for the purposes of :meth:`Widget.identify` et al. It's used for things like scrollbar thumbs with grips.
fr: Si défini sur 1, l'élément et tous ses descendants sont traités comme un seul élément aux fins de :meth:`Widget.identify` et consœurs. Il est utilisé pour des choses comme la barre de défilement ou les agrandissements.

source: children: [sublayout... ]
fr: *children* : [sous-disposition… ]

source: Specifies a list of elements to place inside the element. Each element is a tuple (or other sequence type) where the first item is the layout name, and the other is a `Layout`_.
fr: Spécifie une liste d'éléments à placer à l'intérieur de l'élément. Chaque élément est un *n*-uplet (ou un autre type de séquence) où le premier élément est le nom de la mise en page et l'autre est un `Layout`_.
