Repository: python/python-docs-fr
Catalog: library/tkinter.tix.po
Languages: fr

source: :mod:`tkinter.tix` --- Extension widgets for Tk
fr: :mod:`tkinter.tix` — Widgets d'extension pour *Tk*

source: **Source code:** :source:`Lib/tkinter/tix.py`
fr: **Code source :** :source:`Lib/tkinter/tix.py`

source: This Tk extension is unmaintained and should not be used in new code. Use :mod:`tkinter.ttk` instead.
fr: cette extension *Tk* n'est pas maintenue et ne doit pas être utilisée dans le nouveau code. Utilisez :mod:`tkinter.ttk` à la place.

source: The :mod:`tkinter.tix` (Tk Interface Extension) module provides an additional rich set of widgets. Although the standard Tk library has many useful widgets, they are far from complete. The :mod:`tkinter.tix` library provides most of the commonly needed widgets that are missing from standard Tk: :class:`HList`, :class:`ComboBox`, :class:`Control` (a.k.a. SpinBox) and an assortment of scrollable widgets. :mod:`tkinter.tix` also includes many more widgets that are generally useful in a wide range of applications: :class:`NoteBook`, :class:`FileEntry`, :class:`PanedWindow`, etc; there are more than 40 of them.
fr: Le module :mod:`tkinter.tix` (*Tk* Interface Extension) fournit un riche ensemble supplémentaire de widgets. Bien que la bibliothèque *Tk* standard contienne de nombreux widgets utiles, ils sont loin d'être complets. La bibliothèque :mod:`tkinter.tix` fournit la plupart des widgets couramment nécessaires qui manquent dans *Tk* standard : :class:`HList`, :class:`ComboBox`, :class:`Control` (alias SpinBox) et un assortiment de widgets déroulants. :mod:`tkinter.tix` comprend également de nombreux autres widgets qui sont généralement utiles dans un large éventail d'applications : :class:`NoteBook`, :class:`FileEntry`, :class:`PanedWindow`, etc. il y en a plus de 40.

source: With all these new widgets, you can introduce new interaction techniques into applications, creating more useful and more intuitive user interfaces. You can design your application by choosing the most appropriate widgets to match the special needs of your application and users.
fr: Avec tous ces nouveaux widgets, vous pouvez introduire de nouvelles techniques d'interaction dans les applications, créant ainsi des interfaces utilisateur plus utiles et plus intuitives. Vous pouvez concevoir votre application en choisissant les widgets les plus appropriés pour répondre aux besoins particuliers de votre application et des utilisateurs.

source: `Tix Homepage <https://tix.sourceforge.net/>`_
fr: `Page d'accueil de Tix <https://tix.sourceforge.net/>`_

source: The home page for :mod:`Tix`. This includes links to additional documentation and downloads.
fr: La page d'accueil de :mod:`Tix` (en anglais). Cela inclut des liens vers de la documentation supplémentaire et des téléchargements.

source: On-line version of the man pages and reference material.
fr: Version en ligne des pages de manuel et du manuel de référence (en anglais).

source: `Tix Programming Guide <https://tix.sourceforge.net/dist/current/docs/tix-book/tix.book.html>`_
fr: `Guide de programmation Tix <https://tix.sourceforge.net/dist/current/docs/tix-book/tix.book.html>`_

source: On-line version of the programmer's reference material.
fr: Version en ligne du manuel de référence du programmeur (en anglais).

source: `Tix Development Applications <https://tix.sourceforge.net/Tixapps/src/Tide.html>`_
fr: `Applications pour le développement Tix <https://tix.sourceforge.net/Tixapps/src/Tide.html>`_

source: Tix applications for development of Tix and Tkinter programs. Tide applications work under Tk or Tkinter, and include :program:`TixInspect`, an inspector to remotely modify and debug Tix/Tk/Tkinter applications.
fr: Applications *Tix* pour le développement de programmes *Tix* et *Tkinter*. Les applications *Tide* fonctionnent sous *Tk* ou *Tkinter*, et incluent :program:`TixInspect`, un inspecteur pour modifier et déboguer à distance les applications *Tix/Tk/Tkinter*.

source: Using Tix
fr: Utilisation de *Tix*

source: Toplevel widget of Tix which represents mostly the main window of an application. It has an associated Tcl interpreter.
fr: Widget de niveau supérieur de *Tix* qui représente principalement la fenêtre principale d'une application. Il a un interpréteur *Tcl* associé.

source: Classes in the :mod:`tkinter.tix` module subclasses the classes in the :mod:`tkinter`. The former imports the latter, so to use :mod:`tkinter.tix` with Tkinter, all you need to do is to import one module. In general, you can just import :mod:`tkinter.tix`, and replace the toplevel call to :class:`tkinter.Tk` with :class:`tix.Tk`::
fr: Les classes du module :mod:`tkinter.tix` sous-classent les classes du module :mod:`tkinter`. Le premier importe le second, donc pour utiliser :mod:`tkinter.tix` avec Tkinter, il vous suffit d'importer un module. En général, vous pouvez simplement importer :mod:`tkinter.tix` et remplacer l'appel de niveau supérieur à :class:`tkinter.Tk` par :class:`tix.Tk` ::

source: To use :mod:`tkinter.tix`, you must have the Tix widgets installed, usually alongside your installation of the Tk widgets. To test your installation, try the following::
fr: Pour utiliser :mod:`tkinter.tix`, vous devez avoir installé les widgets *Tix*, généralement en même temps que votre installation des widgets *Tk*. Pour tester votre installation, essayez ce qui suit : :

source: Tix Widgets
fr: Widgets *Tix*

source: `Tix <https://tix.sourceforge.net/dist/current/man/html/TixCmd/TixIntro.htm>`_ introduces over 40 widget classes to the :mod:`tkinter` repertoire.
fr: `Tix <https://tix.sourceforge.net/dist/current/man/html/TixCmd/TixIntro.htm>`_ introduit plus de 40 classes de widgets dans le répertoire :mod:`tkinter`.

source: Basic Widgets
fr: Widgets de base

source: A `Balloon <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixBalloon.htm>`_ that pops up over a widget to provide help. When the user moves the cursor inside a widget to which a Balloon widget has been bound, a small pop-up window with a descriptive message will be shown on the screen.
fr: Une `bulle <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixBalloon.htm>`_ qui apparaît sur un widget pour fournir de l'aide. Lorsque l'utilisateur déplace le curseur à l'intérieur d'un widget auquel un widget *Ballon* a été lié, une petite fenêtre contextuelle avec un message descriptif s'affiche à l'écran.

source: The `ButtonBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixButtonBox.htm>`_ widget creates a box of buttons, such as is commonly used for ``Ok Cancel``.
fr: Le widget `ButtonBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixButtonBox.htm>`_ crée une boîte de boutons, telle qu'elle est couramment utilisée pour ``Ok Cancel``.

source: The `ComboBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixComboBox.htm>`_ widget is similar to the combo box control in MS Windows. The user can select a choice by either typing in the entry subwidget or selecting from the listbox subwidget.
fr: Le widget `ComboBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixComboBox.htm>`_ est similaire au contrôle de zone de liste déroulante dans Windows. L'utilisateur peut sélectionner un choix en tapant dans le sous-widget d'entrée ou en sélectionnant dans le sous-widget de la liste déroulante.

source: The `Control <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixControl.htm>`_ widget is also known as the :class:`SpinBox` widget. The user can adjust the value by pressing the two arrow buttons or by entering the value directly into the entry. The new value will be checked against the user-defined upper and lower limits.
fr: Le widget `Control <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixControl.htm>`_ est également connu sous le nom de widget :class:`SpinBox`. L'utilisateur peut ajuster la valeur en appuyant sur les deux boutons fléchés ou en saisissant la valeur directement dans l'entrée. La nouvelle valeur sera comparée aux limites supérieures et inférieures définies par l'utilisateur.

source: The `LabelEntry <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixLabelEntry.htm>`_ widget packages an entry widget and a label into one mega widget. It can be used to simplify the creation of "entry-form" type of interface.
fr: Le widget `LabelEntry <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixLabelEntry.htm>`_ regroupe un widget d'entrée et une étiquette dans un méga widget. Il peut être utilisé pour simplifier la création d'interfaces de type "formulaire de saisie".

source: The `LabelFrame <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixLabelFrame.htm>`_ widget packages a frame widget and a label into one mega widget. To create widgets inside a LabelFrame widget, one creates the new widgets relative to the :attr:`frame` subwidget and manage them inside the :attr:`frame` subwidget.
fr: Le widget `LabelFrame <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixLabelFrame.htm>`_ regroupe un widget cadre et une étiquette dans un méga widget. Pour créer des widgets à l'intérieur d'un widget LabelFrame, on crée les nouveaux widgets relatifs au sous-widget :attr:`frame` et on les gère à l'intérieur du sous-widget :attr:`frame`.

source: The `Meter <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixMeter.htm>`_ widget can be used to show the progress of a background job which may take a long time to execute.
fr: Le widget `Meter <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixMeter.htm>`_ peut être utilisé pour afficher la progression d'une tâche en arrière-plan qui peut prendre beaucoup de temps à s'exécuter .

source: The `OptionMenu <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixOptionMenu.htm>`_ creates a menu button of options.
fr: Le widget `OptionMenu <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixOptionMenu.htm>`_ crée un bouton de menu d'options.

source: The `PopupMenu <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixPopupMenu.htm>`_ widget can be used as a replacement of the ``tk_popup`` command. The advantage of the :mod:`Tix` :class:`PopupMenu` widget is it requires less application code to manipulate.
fr: Le widget `PopupMenu <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixPopupMenu.htm>`_ peut être utilisé en remplacement de la commande ``tk_popup``. L'avantage du widget :mod:`Tix` :class:`PopupMenu` est qu'il nécessite moins de manipulation de code dans l'application.

source: The `Select <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixSelect.htm>`_ widget is a container of button subwidgets. It can be used to provide radio-box or check-box style of selection options for the user.
fr: Le widget `Select <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixSelect.htm>`_ est un conteneur de sous-widgets de bouton. Il peut être utilisé pour afficher des boutons radio ou des cases à cocher.

source: The `StdButtonBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixStdButtonBox.htm>`_ widget is a group of standard buttons for Motif-like dialog boxes.
fr: Le widget `StdButtonBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixStdButtonBox.htm>`_ est un groupe de boutons standard pour afficher des boîtes de dialogue similaires à celle de la bibliothèque graphique *Motif*.

source: File Selectors
fr: Sélecteurs de fichiers

source: The `DirList <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirList.htm>`_ widget displays a list view of a directory, its previous directories and its sub-directories. The user can choose one of the directories displayed in the list or change to another directory.
fr: Le widget `DirList <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirList.htm>`_ affiche une liste d'un répertoire, de ses répertoires précédents et de ses sous-répertoires. L'utilisateur peut choisir l'un des répertoires affichés dans la liste ou passer à un autre répertoire.

source: The `DirTree <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirTree.htm>`_ widget displays a tree view of a directory, its previous directories and its sub-directories. The user can choose one of the directories displayed in the list or change to another directory.
fr: Le widget `DirTree <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirTree.htm>`_ affiche une arborescence d'un répertoire, de ses répertoires précédents et de ses sous-répertoires. L'utilisateur peut choisir l'un des répertoires affichés dans la liste ou passer à un autre répertoire.

source: The `DirSelectDialog <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirSelectDialog.htm>`_ widget presents the directories in the file system in a dialog window. The user can use this dialog window to navigate through the file system to select the desired directory.
fr: Le widget `DirSelectDialog <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirSelectDialog.htm>`_ présente les répertoires du système de fichiers dans une fenêtre de dialogue. L'utilisateur peut utiliser cette fenêtre de dialogue pour naviguer dans le système de fichiers afin de sélectionner le répertoire souhaité.

source: The :class:`DirSelectBox` is similar to the standard Motif(TM) directory-selection box. It is generally used for the user to choose a directory. DirSelectBox stores the directories mostly recently selected into a ComboBox widget so that they can be quickly selected again.
fr: Le widget :class:`DirSelectBox` est similaire à la boîte de sélection de répertoire *Motif*\ :sup:`(TM)` standard. Il est généralement utilisé pour que l'utilisateur choisisse un répertoire. *DirSelectBox* stocke les répertoires les plus récemment sélectionnés dans un widget *ComboBox* afin qu'ils puissent être rapidement sélectionnés à nouveau.

source: The `ExFileSelectBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixExFileSelectBox.htm>`_ widget is usually embedded in a tixExFileSelectDialog widget. It provides a convenient method for the user to select files. The style of the :class:`ExFileSelectBox` widget is very similar to the standard file dialog on MS Windows 3.1.
fr: Le widget `ExFileSelectBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixExFileSelectBox.htm>`_ est généralement intégré dans un widget *tixExFileSelectDialog*. Il fournit à l'utilisateur une méthode pratique pour sélectionner des fichiers. Le style du widget :class:`ExFileSelectBox` est très similaire à la boîte de dialogue de fichier standard sur MS Windows 3.1.

source: The `FileSelectBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixFileSelectBox.htm>`_ is similar to the standard Motif(TM) file-selection box. It is generally used for the user to choose a file. FileSelectBox stores the files mostly recently selected into a :class:`ComboBox` widget so that they can be quickly selected again.
fr: Le widget `FileSelectBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixFileSelectBox.htm>`_ est similaire à la boîte de sélection de fichiers *Motif*\ :sup:`(TM)` standard. Il est généralement utilisé pour que l'utilisateur choisisse un fichier. *FileSelectBox* stocke les fichiers les plus récemment sélectionnés dans un widget :class:`ComboBox` afin qu'ils puissent être rapidement sélectionnés à nouveau.

source: The `FileEntry <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixFileEntry.htm>`_ widget can be used to input a filename. The user can type in the filename manually. Alternatively, the user can press the button widget that sits next to the entry, which will bring up a file selection dialog.
fr: Le widget `FileEntry <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixFileEntry.htm>`_ peut être utilisé pour saisir un nom de fichier. L'utilisateur peut saisir manuellement le nom du fichier. Alternativement, l'utilisateur peut appuyer sur le widget de bouton qui se trouve à côté de l'entrée, ce qui fera apparaître une boîte de dialogue de sélection de fichier.

source: Hierarchical ListBox
fr: *ListBox* hiérarchique

source: The `HList <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixHList.htm>`_ widget can be used to display any data that have a hierarchical structure, for example, file system directory trees. The list entries are indented and connected by branch lines according to their places in the hierarchy.
fr: Le widget `HList <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixHList.htm>`_ peut être utilisé pour afficher toutes les données qui ont une structure hiérarchique, par exemple, l'arborescence du système de fichiers. Les entrées de la liste sont mises en retrait et reliées par des lignes secondaires en fonction de leur place dans la hiérarchie.

source: The `CheckList <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixCheckList.htm>`_ widget displays a list of items to be selected by the user. CheckList acts similarly to the Tk checkbutton or radiobutton widgets, except it is capable of handling many more items than checkbuttons or radiobuttons.
fr: Le widget `CheckList <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixCheckList.htm>`_ affiche une liste d'éléments à sélectionner par l'utilisateur. CheckList agit de la même manière que les widgets *checkbutton* ou *radiobutton* de *Tk*, sauf qu'il est capable de gérer beaucoup plus d'éléments que les *checkbuttons* ou les *radiobuttons*.

source: The `Tree <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixTree.htm>`_ widget can be used to display hierarchical data in a tree form. The user can adjust the view of the tree by opening or closing parts of the tree.
fr: Le widget `Tree <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixTree.htm>`_ peut être utilisé pour afficher des données hiérarchiques sous forme d'arborescence. L'utilisateur peut ajuster la vue de l'arborescence en ouvrant ou en fermant des parties de l'arborescence.

source: Tabular ListBox
fr: *ListBox* tabulaire

source: The `TList <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixTList.htm>`_ widget can be used to display data in a tabular format. The list entries of a :class:`TList` widget are similar to the entries in the Tk listbox widget. The main differences are (1) the :class:`TList` widget can display the list entries in a two dimensional format and (2) you can use graphical images as well as multiple colors and fonts for the list entries.
fr: Le widget `TList <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixTList.htm>`_ peut être utilisé pour afficher des données sous forme de tableau. Les entrées de liste d'un widget :class:`TList` sont similaires aux entrées du widget *listbox* *Tk*. Les principales différences sont (1) le widget :class:`TList` peut afficher les entrées de la liste dans un format bidimensionnel et (2) vous pouvez utiliser des images graphiques ainsi que plusieurs couleurs et polices pour les entrées de la liste.

source: Manager Widgets
fr: Gestionnaire de widgets

source: The `PanedWindow <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixPanedWindow.htm>`_ widget allows the user to interactively manipulate the sizes of several panes. The panes can be arranged either vertically or horizontally. The user changes the sizes of the panes by dragging the resize handle between two panes.
fr: Le widget `PanedWindow <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixPanedWindow.htm>`_ permet à l'utilisateur de manipuler de manière interactive la taille de plusieurs volets. Les volets peuvent être disposés verticalement ou horizontalement. L'utilisateur modifie la taille des volets en faisant glisser la poignée de redimensionnement entre deux volets.

source: The `ListNoteBook <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixListNoteBook.htm>`_ widget is very similar to the :class:`TixNoteBook` widget: it can be used to display many windows in a limited space using a notebook metaphor. The notebook is divided into a stack of pages (windows). At one time only one of these pages can be shown. The user can navigate through these pages by choosing the name of the desired page in the :attr:`hlist` subwidget.
fr: Le widget `ListNoteBook <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixListNoteBook.htm>`_ est très similaire au widget :class:`TixNoteBook` : il peut être utilisé pour afficher de nombreuses fenêtres dans un espace limité en utilisant une métaphore de bloc-notes. Le bloc-notes est divisé en une pile de pages (fenêtres). Une seule de ces pages peut être affichée à la fois. L'utilisateur peut naviguer dans ces pages en choisissant le nom de la page souhaitée dans le sous-widget :attr:`hlist`.

source: The `NoteBook <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixNoteBook.htm>`_ widget can be used to display many windows in a limited space using a notebook metaphor. The notebook is divided into a stack of pages. At one time only one of these pages can be shown. The user can navigate through these pages by choosing the visual "tabs" at the top of the NoteBook widget.
fr: Le widget `NoteBook <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixNoteBook.htm>`_ peut être utilisé pour afficher de nombreuses fenêtres dans un espace limité en utilisant une métaphore de bloc-notes. Le bloc-notes est divisé en une pile de pages. Une seule de ces pages peut être affichée à la fois. L'utilisateur peut naviguer dans ces pages en choisissant les « onglets » visuels en haut du widget NoteBook.

source: Image Types
fr: Types d'images

source: The :mod:`tkinter.tix` module adds:
fr: Le module :mod:`tkinter.tix` ajoute :

source: `pixmap <https://tix.sourceforge.net/dist/current/man/html/TixCmd/pixmap.htm>`_ capabilities to all :mod:`tkinter.tix` and :mod:`tkinter` widgets to create color images from XPM files.
fr: les capacités `pixmap <https://tix.sourceforge.net/dist/current/man/html/TixCmd/pixmap.htm>`_ pour tous les widgets :mod:`tkinter.tix` et :mod:`tkinter` afin de créer des images couleurs à partir de fichiers XPM ;

source: `Compound <https://tix.sourceforge.net/dist/current/man/html/TixCmd/compound.htm>`_ image types can be used to create images that consists of multiple horizontal lines; each line is composed of a series of items (texts, bitmaps, images or spaces) arranged from left to right. For example, a compound image can be used to display a bitmap and a text string simultaneously in a Tk :class:`Button` widget.
fr: les types d'images `Compound <https://tix.sourceforge.net/dist/current/man/html/TixCmd/compound.htm>`_ peuvent être utilisés pour créer des images composées de plusieurs lignes horizontales ; chaque ligne est composée d'une suite d'éléments (textes, bitmaps, images ou espaces) disposés de gauche à droite. Par exemple, une image composée peut être utilisée pour afficher simultanément un bitmap et une chaîne de texte dans un widget *Tk* :class:`Button`.

source: Miscellaneous Widgets
fr: Widgets divers

source: The `InputOnly <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixInputOnly.htm>`_ widgets are to accept inputs from the user, which can be done with the ``bind`` command (Unix only).
fr: Les widgets `InputOnly <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixInputOnly.htm>`_ acceptent les entrées de l'utilisateur, ce qui peut être fait avec la commande ``bind`` (Unix uniquement).

source: Form Geometry Manager
fr: Gestionnaire de forme de formulaire

source: In addition, :mod:`tkinter.tix` augments :mod:`tkinter` by providing:
fr: De plus, :mod:`tkinter.tix` étend :mod:`tkinter` en fournissant :
