Repository: python/python-docs-fr
Catalog: library/tkinter.po
Languages: fr

source: :mod:`tkinter` --- Python interface to Tcl/Tk
fr: :mod:`tkinter` — Interface Python pour Tcl/Tk

source: **Source code:** :source:`Lib/tkinter/__init__.py`
fr: **Code source :** :source:`Lib/tkinter/__init__.py`

source: The :mod:`tkinter` package ("Tk interface") is the standard Python interface to the Tk GUI toolkit. Both Tk and :mod:`tkinter` are available on most Unix platforms, as well as on Windows systems. (Tk itself is not part of Python; it is maintained at ActiveState.)
fr: Le paquet :mod:`tkinter` (« interface Tk ») est l'interface Python standard de la boîte à outils d'IUG Tk. Tk et :mod:`tkinter` sont disponibles sur la plupart des plates-formes Unix, ainsi que sur les systèmes Windows (Tk lui-même ne fait pas partie de Python ; il est maintenu par ActiveState).

source: Running ``python -m tkinter`` from the command line should open a window demonstrating a simple Tk interface, letting you know that :mod:`tkinter` is properly installed on your system, and also showing what version of Tcl/Tk is installed, so you can read the Tcl/Tk documentation specific to that version.
fr: Exécuter ``python -m tkinter`` depuis la ligne de commande ouvre une fenêtre de démonstration d'une interface Tk simple, vous indiquant que :mod:`tkinter` est correctement installé sur votre système et indiquant également quelle version de Tcl/Tk est installée ; vous pouvez donc lire la documentation Tcl/Tk spécifique à cette version.

source: Tkinter documentation:
fr: Documentation de Tkinter :

source: The Python Tkinter Topic Guide provides a great deal of information on using Tk from Python and links to other sources of information on Tk.
fr: Le *Python Tkinter Topic Guide* fournit beaucoup d'informations sur l'utilisation de Tk à partir de Python et des liens vers d'autres sources d'information sur Tk.

source: Extensive tutorial plus friendlier widget pages for some of the widgets.
fr: Tutoriel complet plus convivial pour certains des objets graphiques.

source: `Tkinter 8.5 reference: a GUI for Python <https://web.archive.org/web/20190524140835/https://infohost.nmt.edu/tcc/help/pubs/tkinter/web/index.html>`_
fr: `Référence Tkinter 8.5 : un GUI pour Python <https://web.archive.org/web/20190524140835/https://infohost.nmt.edu/tcc/help/pubs/tkinter/web/index.html>`_

source: On-line reference material.
fr: Documents de référence en ligne.

source: `Tkinter docs from effbot <http://effbot.org/tkinterbook/>`_
fr: `Documents Tkinter sur effbot <http://effbot.org/tkinterbook/>`_

source: Online reference for tkinter supported by effbot.org.
fr: Référence en ligne pour *tkinter* réalisée par *effbot.org*.

source: Book by Mark Lutz, has excellent coverage of Tkinter.
fr: Livre de Mark Lutz, qui couvre excellemment bien Tkinter.

source: Book by Mark Roseman about building attractive and modern graphical user interfaces with Python and Tkinter.
fr: Livre de Mark Roseman sur la construction d'interfaces graphiques esthétiques et modernes avec Python et Tkinter.

source: Book by John Grayson (ISBN 1-884777-81-3).
fr: Livre de John Grayson (ISBN 1-884777-81-3).

source: Tcl/Tk documentation:
fr: Documentation de Tcl/Tk :

source: `Tk commands <https://www.tcl.tk/man/tcl8.6/TkCmd/contents.htm>`_
fr: `Commandes Tk <https://www.tcl.tk/man/tcl8.6/TkCmd/contents.htm>`_

source: Most commands are available as :mod:`tkinter` or :mod:`tkinter.ttk` classes. Change '8.6' to match the version of your Tcl/Tk installation.
fr: La plupart des commandes sont disponibles sous forme de classes :mod:`tkinter` ou :mod:`tkinter.ttk`. Modifiez '8.6' pour correspondre à votre version installée de Tcl/Tk.

source: `Tcl/Tk recent man pages <https://www.tcl.tk/doc/>`_
fr: `Pages de manuel récentes de Tcl/Tk <https://www.tcl.tk/doc/>`_

source: Recent Tcl/Tk manuals on www.tcl.tk.
fr: Manuels récents de Tcl/Tk sur *www.tcl.tk*.

source: `ActiveState Tcl Home Page <https://tcl.tk>`_
fr: `Page d'accueil Tcl <https://tcl.tk>`_ chez ActiveState

source: The Tk/Tcl development is largely taking place at ActiveState.
fr: Le développement de Tk/Tcl se déroule en grande partie au sein d'ActiveState.

source: Book by John Ousterhout, the inventor of Tcl.
fr: Livre de John Ousterhout, l'inventeur de Tcl.

source: Brent Welch's encyclopedic book.
fr: Le livre encyclopédique de Brent Welch.

source: Tkinter Modules
fr: Modules Tkinter

source: Most of the time, :mod:`tkinter` is all you really need, but a number of additional modules are available as well. The Tk interface is located in a binary module named :mod:`_tkinter`. This module contains the low-level interface to Tk, and should never be used directly by application programmers. It is usually a shared library (or DLL), but might in some cases be statically linked with the Python interpreter.
fr: La plupart du temps, :mod:`tkinter` est tout ce dont vous avez vraiment besoin mais un certain nombre de modules supplémentaires sont également disponibles. L'interface Tk est située dans un module binaire nommé :mod:`_tkinter`. Ce module contient l'interface de bas niveau vers Tk et ne doit jamais être utilisé directement par les développeurs. Il s'agit généralement d'une bibliothèque partagée (ou DLL) mais elle peut, dans certains cas, être liée statiquement à l'interpréteur Python.

source: In addition to the Tk interface module, :mod:`tkinter` includes a number of Python modules, :mod:`tkinter.constants` being one of the most important. Importing :mod:`tkinter` will automatically import :mod:`tkinter.constants`, so, usually, to use Tkinter all you need is a simple import statement::
fr: En plus du module d'interface Tk, :mod:`tkinter` inclut un certain nombre de modules Python, :mod:`tkinter.constants` étant l'un des plus importants. Importer :mod:`tkinter` charge automatiquement :mod:`tkinter.constants` donc, habituellement, pour utiliser Tkinter, tout ce dont vous avez besoin est une simple commande d'importation ::

source: Or, more often::
fr: Ou, plus souvent ::

source: The :class:`Tk` class is instantiated without arguments. This creates a toplevel widget of Tk which usually is the main window of an application. Each instance has its own associated Tcl interpreter.
fr: La classe :class:`Tk` est instanciée sans argument. Cela crée un widget de haut niveau de Tk qui est généralement la fenêtre principale d'une application. Chaque instance a son propre interpréteur Tcl associé.

source: The :func:`Tcl` function is a factory function which creates an object much like that created by the :class:`Tk` class, except that it does not initialize the Tk subsystem. This is most often useful when driving the Tcl interpreter in an environment where one doesn't want to create extraneous toplevel windows, or where one cannot (such as Unix/Linux systems without an X server). An object created by the :func:`Tcl` object can have a Toplevel window created (and the Tk subsystem initialized) by calling its :meth:`loadtk` method.
fr: La fonction :func:`Tcl` est une fonction fabrique qui crée un objet similaire à celui créé par la classe :class:`Tk`, sauf qu'elle n'initialise pas le sous-système Tk. Ceci est le plus souvent utile lorsque vous pilotez l'interpréteur Tcl dans un environnement où vous ne voulez pas créer des fenêtres de haut niveau supplémentaires, ou alors si c'est impossible (comme les systèmes Unix/Linux sans un serveur X). Un objet créé par :func:`Tcl` peut avoir une fenêtre de haut niveau créée (et le sous-système Tk initialisé) en appelant sa méthode :meth:`loadtk`.

source: Other modules that provide Tk support include:
fr: Parmi les modules qui savent gérer Tk, nous pouvons citer :

source: Text widget with a vertical scroll bar built in.
fr: Outil d'affichage de texte avec une barre de défilement verticale intégrée.

source: Dialog to let the user choose a color.
fr: Boîte de dialogue permettant à l'utilisateur de choisir une couleur.

source: Base class for the dialogs defined in the other modules listed here.
fr: Classe de base pour les boîtes de dialogue définies dans les autres modules listés ici.

source: Common dialogs to allow the user to specify a file to open or save.
fr: Boîtes de dialogue standard permettant à l'utilisateur de spécifier un fichier à ouvrir ou à enregistrer.

source: Utilities to help work with fonts.
fr: Utilitaires pour gérer les polices de caractères.

source: Access to standard Tk dialog boxes.
fr: Accès aux boîtes de dialogue Tk standard.

source: Basic dialogs and convenience functions.
fr: Boîtes de dialogue simples et fonctions utilitaires.

source: Drag-and-drop support for :mod:`tkinter`. This is experimental and should become deprecated when it is replaced with the Tk DND.
fr: Support du glisser-déposer pour :mod:`tkinter`. Il s'agit d'une méthode expérimentale qui ne sera plus maintenue lorsqu'elle sera remplacée par Tk DND.

source: Turtle graphics in a Tk window.
fr: Tortue graphique dans une fenêtre Tk.

source: Tkinter Life Preserver
fr: Guide de survie Tkinter

source: This section is not designed to be an exhaustive tutorial on either Tk or Tkinter. Rather, it is intended as a stop gap, providing some introductory orientation on the system.
fr: Cette section n'est pas conçue pour être un tutoriel exhaustif de Tk ou Tkinter. Il s'agit plutôt d'un guide d'introduction au système.

source: Credits:
fr: Crédits :

source: Tk was written by John Ousterhout while at Berkeley.
fr: *Tk* a été écrit par John Ousterhout de Berkeley.

source: Tkinter was written by Steen Lumholt and Guido van Rossum.
fr: *Tkinter* a été écrit par Steen Lumholt et Guido van Rossum.

source: This Life Preserver was written by Matt Conway at the University of Virginia.
fr: Ce guide de survie a été écrit par Matt Conway de l'Université de Virginie.

source: The HTML rendering, and some liberal editing, was produced from a FrameMaker version by Ken Manheimer.
fr: Le rendu HTML, avec quelques modifications, a été réalisé à partir d'une version FrameMaker par Ken Manheimer.

source: Fredrik Lundh elaborated and revised the class interface descriptions, to get them current with Tk 4.2.
fr: Fredrik Lundh a élaboré et mis à jour les descriptions de l'interface des classes, en cohérence avec Tk 4.2.

source: Mike Clarkson converted the documentation to LaTeX, and compiled the User Interface chapter of the reference manual.
fr: Mike Clarkson a converti la documentation en LaTeX et a compilé le chapitre *Interface utilisateur* du manuel de référence.

source: How To Use This Section
fr: Mode d'emploi

source: This section is designed in two parts: the first half (roughly) covers background material, while the second half can be taken to the keyboard as a handy reference.
fr: Cette section est divisée en deux parties : la première moitié (à peu près) couvre la partie théorique, tandis que la seconde moitié peut être utilisée comme guide pratique.

source: When trying to answer questions of the form "how do I do blah", it is often best to find out how to do "blah" in straight Tk, and then convert this back into the corresponding :mod:`tkinter` call. Python programmers can often guess at the correct Python command by looking at the Tk documentation. This means that in order to use Tkinter, you will have to know a little bit about Tk. This document can't fulfill that role, so the best we can do is point you to the best documentation that exists. Here are some hints:
fr: Lorsque l'on essaie de répondre à des questions sur la manière de faire « ceci ou cela », il est souvent préférable de trouver comment le faire en Tk, puis de le convertir en fonction correspondante :mod:`tkinter`. Les programmeurs Python peuvent souvent deviner la commande Python correcte en consultant la documentation Tk. Cela signifie que pour utiliser Tkinter, vous devez en savoir un peu plus sur Tk. Ce document ne peut pas remplir ce rôle, alors le mieux que nous puissions faire est de vous indiquer la meilleure documentation qui existe. Voici quelques conseils :

source: The authors strongly suggest getting a copy of the Tk man pages. Specifically, the man pages in the ``manN`` directory are most useful. The ``man3`` man pages describe the C interface to the Tk library and thus are not especially helpful for script writers.
fr: Les auteurs conseillent fortement d'obtenir une copie des pages de manuel de Tk. En particulier, les pages de manuel dans le répertoire ``manN`` sont les plus utiles. Les pages de manuel ``man3`` décrivent l'interface C de la bibliothèque Tk et ne sont donc pas particulièrement utiles aux développeurs de scripts.

source: Addison-Wesley publishes a book called Tcl and the Tk Toolkit by John Ousterhout (ISBN 0-201-63337-X) which is a good introduction to Tcl and Tk for the novice. The book is not exhaustive, and for many details it defers to the man pages.
fr: Addison-Wesley a publié un livre intitulé *Tcl and the Tk Toolkit* de John Ousterhout (ISBN 0-201-63337-X) qui est une bonne introduction à Tcl et Tk pour débutants. Le livre n'est pas exhaustif et, pour beaucoup de détails, il renvoie aux pages du manuel.

source: :file:`tkinter/__init__.py` is a last resort for most, but can be a good place to go when nothing else makes sense.
fr: :file:`tkinter/__init__.py` est souvent un dernier recours, mais peut être un bon endroit où aller quand rien d'autre ne fait sens.

source: A Simple Hello World Program
fr: Un simple programme *Hello World*

source: A (Very) Quick Look at Tcl/Tk
fr: Un (très) rapide aperçu de Tcl/Tk

source: The class hierarchy looks complicated, but in actual practice, application programmers almost always refer to the classes at the very bottom of the hierarchy.
fr: La hiérarchie de classes semble compliquée mais, dans la pratique, les développeurs d'applications se réfèrent presque toujours aux classes situées tout en bas de la hiérarchie.

source: These classes are provided for the purposes of organizing certain functions under one namespace. They aren't meant to be instantiated independently.
fr: Ces classes sont fournies dans le but d'organiser certaines fonctions sous un seul espace de nommage. Elles n'ont pas vocation à être instanciées indépendamment.

source: The :class:`Tk` class is meant to be instantiated only once in an application. Application programmers need not instantiate one explicitly, the system creates one whenever any of the other classes are instantiated.
fr: La classe :class:`Tk` est destinée à être instanciée une seule fois dans une application. Les développeurs d'applications n'ont pas besoin d'en instancier une explicitement, Le système en crée une au besoin quand une des autres classes est instanciée.

source: The :class:`Widget` class is not meant to be instantiated, it is meant only for subclassing to make "real" widgets (in C++, this is called an 'abstract class').
fr: La classe :class:`Widget` n'est pas destinée à être instanciée, elle est destinée uniquement au sous-classement pour faire de « vrais » objets graphiques (en C++, on appelle cela une « classe abstraite »).

source: To make use of this reference material, there will be times when you will need to know how to read short passages of Tk and how to identify the various parts of a Tk command. (See section :ref:`tkinter-basic-mapping` for the :mod:`tkinter` equivalents of what's below.)
fr: Pour comprendre cette documentation, il y aura des moments où vous aurez besoin de savoir comment lire de courts passages de Tk et comment identifier les différentes parties d'une commande Tk. (Voir la section :ref:`tkinter-basic-mapping` pour les équivalents :mod:`tkinter` de ce qui suit).

source: Tk scripts are Tcl programs. Like all Tcl programs, Tk scripts are just lists of tokens separated by spaces. A Tk widget is just its *class*, the *options* that help configure it, and the *actions* that make it do useful things.
fr: Les scripts Tk sont des programmes Tcl. Comme tous les programmes Tcl, les scripts Tk ne sont que des listes de commandes séparées par des espaces. Un objet graphique Tk n'est constitué que de sa *classe*, des *options* qui l'aident à se configurer et des *actions* qui lui font faire des choses utiles.

source: To make a widget in Tk, the command is always of the form::
fr: Pour créer un objet graphique en Tk, la commande est toujours de la forme ::

source: denotes which kind of widget to make (a button, a label, a menu...)
fr: indique le type d'objet graphique à réaliser (un bouton, une étiquette, un menu…)

source: is the new name for this widget. All names in Tk must be unique. To help enforce this, widgets in Tk are named with *pathnames*, just like files in a file system. The top level widget, the *root*, is called ``.`` (period) and children are delimited by more periods. For example, ``.myApp.controlPanel.okButton`` might be the name of a widget.
fr: est le nouveau nom pour cet objet graphique. Tous les noms dans Tk doivent être uniques. Pour vous aider à respecter cette règle, les objets graphiques dans Tk sont nommés avec des *noms d'accès*, tout comme les fichiers dans le système de fichiers. L'objet graphique de niveau supérieur, la racine (*root* en anglais), s'appelle ``.`` (point) et les enfants sont délimités par plusieurs points. Par exemple, ``.myApp.controlPanel.okButton`` pourrait être le nom d'un objet graphique.

source: configure the widget's appearance and in some cases, its behavior. The options come in the form of a list of flags and values. Flags are preceded by a '-', like Unix shell command flags, and values are put in quotes if they are more than one word.
fr: configure l'apparence de l'objet graphique et, dans certains cas, son comportement. Les options se présentent sous la forme d'une liste de paramètres et de valeurs. Les paramètres sont précédés d'un « - », comme les paramètres d'une ligne de commande du shell Unix, et les valeurs sont mises entre guillemets si elles font plus d'un mot.

source: For example::
fr: Par exemple ::

source: Once created, the pathname to the widget becomes a new command. This new *widget command* is the programmer's handle for getting the new widget to perform some *action*. In C, you'd express this as someAction(fred, someOptions), in C++, you would express this as fred.someAction(someOptions), and in Tk, you say::
fr: Une fois créé, le chemin d'accès à l'objet graphique devient une nouvelle commande. Cette nouvelle *commande d'objet graphique* est l'interface du programmeur pour que le nouvel objet graphique effectue une *action*. En C, cela prend la forme ``someAction(fred, someOptions)``, en C++, cela prend la forme `fred.someAction(someOptions)` et, en Tk, vous dites ::

source: Note that the object name, ``.fred``, starts with a dot.
fr: Notez que le nom de l'objet, ``.fred``, commence par un point.

source: As you'd expect, the legal values for *someAction* will depend on the widget's class: ``.fred disable`` works if fred is a button (fred gets greyed out), but does not work if fred is a label (disabling of labels is not supported in Tk).
fr: Comme vous pouvez vous y attendre, les valeurs autorisées pour *someAction* dépendent de la classe de l'objet graphique : ``.fred disable`` fonctionne si ``fred`` est un bouton (``fred`` devient grisé), mais ne fonctionne pas si ``fred`` est une étiquette (la désactivation des étiquettes n'existe pas dans Tk).

source: The legal values of *someOptions* is action dependent. Some actions, like ``disable``, require no arguments, others, like a text-entry box's ``delete`` command, would need arguments to specify what range of text to delete.
fr: Les valeurs possibles de *someOptions* dépendent de l'action. Certaines actions, comme ``disable``, ne nécessitent aucun argument ; d'autres, comme la commande ``delete`` d'une zone de saisie, nécessitent des arguments pour spécifier l'étendue du texte à supprimer.

source: Mapping Basic Tk into Tkinter
fr: Correspondance entre *Basic Tk* et *Tkinter*

source: Class commands in Tk correspond to class constructors in Tkinter. ::
fr: Les commandes de classes dans Tk correspondent aux constructeurs de classes dans Tkinter. ::

source: The master of an object is implicit in the new name given to it at creation time. In Tkinter, masters are specified explicitly. ::
fr: Le constructeur d'un objet est implicite dans le nouveau nom qui lui est donné lors de la création. Dans Tkinter, les constructeurs sont spécifiés explicitement. ::

source: The configuration options in Tk are given in lists of hyphened tags followed by values. In Tkinter, options are specified as keyword-arguments in the instance constructor, and keyword-args for configure calls or as instance indices, in dictionary style, for established instances. See section :ref:`tkinter-setting-options` on setting options. ::
fr: Les options de configuration dans Tk sont données dans des listes de paramètres séparés par des traits d'union suivies de leurs valeurs. Dans Tkinter, les options sont spécifiées sous forme d'arguments par mots-clés dans le constructeur d'instance, et d'arguments par mots-clés pour configurer les appels ou sous forme d'une entrée, dans le style dictionnaire, d'instance pour les instances établies. Voir la section :ref:`tkinter-setting-options` pour la façon de définir les options. ::

source: In Tk, to perform an action on a widget, use the widget name as a command, and follow it with an action name, possibly with arguments (options). In Tkinter, you call methods on the class instance to invoke actions on the widget. The actions (methods) that a given widget can perform are listed in :file:`tkinter/__init__.py`. ::
fr: Dans Tk, pour effectuer une action sur un objet graphique, utilisez le nom de l'objet graphique comme une commande et faites-le suivre d'un nom d'action, éventuellement avec des arguments (options). Dans Tkinter, vous appelez des méthodes sur l'instance de classe pour invoquer des actions sur l'objet graphique. Les actions (méthodes) qu'un objet graphique donné peut effectuer sont listées dans :file:`tkinter/__init__.py`. ::

source: To give a widget to the packer (geometry manager), you call pack with optional arguments. In Tkinter, the Pack class holds all this functionality, and the various forms of the pack command are implemented as methods. All widgets in :mod:`tkinter` are subclassed from the Packer, and so inherit all the packing methods. See the :mod:`tkinter.tix` module documentation for additional information on the Form geometry manager. ::
fr: Pour donner un objet graphique à l'empaqueteur (ce qui gère la disposition à l'écran), appelez ``pack`` avec des arguments optionnels. Dans Tkinter, la classe ``Pack`` contient toutes ces fonctionnalités et les différentes formes de la commande ``pack`` sont implémentées comme méthodes. Tous les objets graphiques de :mod:`tkinter` sont sous-classés depuis l'empaqueteur et donc héritent de toutes les méthodes d'empaquetage. Voir la documentation du module :mod:`tkinter.tix` pour plus d'informations sur le gestionnaire de disposition des formulaires. ::

source: How Tk and Tkinter are Related
fr: Relations entre Tk et Tkinter

source: From the top down:
fr: De haut en bas :

source: Your App Here (Python)
fr: Votre application (Python)

source: A Python application makes a :mod:`tkinter` call.
fr: Une application Python fait un appel :mod:`tkinter`.

source: tkinter (Python Package)
fr: *tkinter* (paquet Python)
