Repository: python/python-docs-fr
Catalog: library/tokenize.po
Languages: fr

source: :mod:`tokenize` --- Tokenizer for Python source
fr: :mod:`tokenize` — Analyseur lexical de Python

source: **Source code:** :source:`Lib/tokenize.py`
fr: **Code source :** :source:`Lib/tokenize.py`

source: The :mod:`tokenize` module provides a lexical scanner for Python source code, implemented in Python. The scanner in this module returns comments as tokens as well, making it useful for implementing "pretty-printers," including colorizers for on-screen displays.
fr: Le module :mod:`tokenize` fournit un analyseur lexical pour Python, implémenté en Python. L'analyseur de ce module renvoie les commentaire sous forme de *token*, se qui le rend intéressant pour implémenter des *pretty-printers*, typiquement pour faire de la coloration syntaxique.

source: To simplify token stream handling, all :ref:`operator <operators>` and :ref:`delimiter <delimiters>` tokens and :data:`Ellipsis` are returned using the generic :data:`~token.OP` token type. The exact type can be determined by checking the ``exact_type`` property on the :term:`named tuple` returned from :func:`tokenize.tokenize`.
fr: Pour simplifier la gestion de flux de *tokens*, tous les *tokens* :ref:`operator <operators>` et :ref:`delimiter <delimiters>`, ainsi que les :data:`Ellipsis*` sont renvoyés en utilisant le *token* générique :data:`~token.OP`. Le type exact peut être déterminé en vérifiant la propriété ``exact_type`` du :term:`named tuple` renvoyé par :func:`tokenize.tokenize`.

source: Tokenizing Input
fr: Analyse Lexicale

source: The primary entry point is a :term:`generator`:
fr: Le point d'entrée principal est un :term:`générateur <generator>` :

source: The :func:`.tokenize` generator requires one argument, *readline*, which must be a callable object which provides the same interface as the :meth:`io.IOBase.readline` method of file objects. Each call to the function should return one line of input as bytes.
fr: Le générateur :func:`.tokenize` prend un argument *readline* qui doit être un objet appelable exposant la même interface que la méthode :meth:`io.IOBase.readline` des objets fichiers. Chaque appel a la fonction doit renvoyer une ligne sous forme de *bytes*.

source: The returned :term:`named tuple` has an additional property named ``exact_type`` that contains the exact operator type for :data:`~token.OP` tokens. For all other token types ``exact_type`` equals the named tuple ``type`` field.
fr: Le :term:`named tuple` a une propriété additionnelle appelée ``exact_type`` qui contient le type exact de l'opérateur pour les jetons :data:`~token.OP` . Pour tous les autres types de jetons, ``exact_type`` est égal au champ ``type`` du tuple nommé.

source: Added support for named tuples.
fr: Soutien ajouté pour *tuples* nommé.

source: Added support for ``exact_type``.
fr: Soutien ajouté pour ``exact_type``.

source: :func:`.tokenize` determines the source encoding of the file by looking for a UTF-8 BOM or encoding cookie, according to :pep:`263`.
fr: :func:`.tokenize` détermine le codage source du fichier en recherchant une nomenclature UTF-8 ou un cookie d'encodage, selon la :pep:`263`.

source: All constants from the :mod:`token` module are also exported from :mod:`tokenize`.
fr: Toutes les constantes du module :mod:`token` sont également exportées depuis module :mod:`tokenize`.

source: Another function is provided to reverse the tokenization process. This is useful for creating tools that tokenize a script, modify the token stream, and write back the modified script.
fr: Une autre fonction est fournie pour inverser le processus de tokenisation. Ceci est utile pour créer des outils permettant de codifier un script, de modifier le flux de jetons et de réécrire le script modifié.

source: Converts tokens back into Python source code. The *iterable* must return sequences with at least two elements, the token type and the token string. Any additional sequence elements are ignored.
fr: Convertit les jetons en code source Python. L'*iterable* doit renvoyer des séquences avec au moins deux éléments, le type de jeton et la chaîne de caractères associée. Tout élément de séquence supplémentaire est ignoré.

source: The reconstructed script is returned as a single string. The result is guaranteed to tokenize back to match the input so that the conversion is lossless and round-trips are assured. The guarantee applies only to the token type and token string as the spacing between tokens (column positions) may change.
fr: Le script reconstruit est renvoyé sous la forme d'une chaîne unique. Le résultat est garanti pour que le jeton corresponde à l'entrée afin que la conversion soit sans perte et que les allers et retours soient assurés. La garantie ne s'applique qu'au type de jeton et à la chaîne de jetons car l'espacement entre les jetons (positions des colonnes) peut changer.

source: :func:`.tokenize` needs to detect the encoding of source files it tokenizes. The function it uses to do this is available:
fr: :func:`.tokenize` a besoin de détecter le codage des fichiers sources qu'il code. La fonction utilisée pour cela est disponible :

source: The :func:`detect_encoding` function is used to detect the encoding that should be used to decode a Python source file. It requires one argument, readline, in the same way as the :func:`.tokenize` generator.
fr: La fonction :func:`detect_encoding` est utilisée pour détecter l'encodage à utiliser pour décoder un fichier source Python. Il nécessite un seul argument, *readline*, de la même manière que le générateur :func:`.tokenize`.

source: It will call readline a maximum of twice, and return the encoding used (as a string) and a list of any lines (not decoded from bytes) it has read in.
fr: Il appelle *readline* au maximum deux fois et renvoie le codage utilisé (sous forme de chaîne) et une liste de toutes les lignes (non décodées à partir des octets) dans lesquelles il a été lu.

source: It detects the encoding from the presence of a UTF-8 BOM or an encoding cookie as specified in :pep:`263`. If both a BOM and a cookie are present, but disagree, a :exc:`SyntaxError` will be raised. Note that if the BOM is found, ``'utf-8-sig'`` will be returned as an encoding.
fr: Il détecte l'encodage par la présence d'une marqueur UTF-8 (*BOM*) ou d'un cookie de codage, comme spécifié dans la :pep:`263`. Si un *BOM* et un cookie sont présents, mais en désaccord, un :exc:`SyntaxError` sera levée. Notez que si le *BOM* est trouvé, ``'utf-8-sig'`` sera renvoyé comme encodage.

source: If no encoding is specified, then the default of ``'utf-8'`` will be returned.
fr: Si aucun codage n'est spécifié, la valeur par défaut, ``'utf-8'``, sera renvoyée.

source: Use :func:`.open` to open Python source files: it uses :func:`detect_encoding` to detect the file encoding.
fr: Utilisez :func:`.open` pour ouvrir les fichiers source Python : ça utilise :func:`detect_encoding` pour détecter le codage du fichier.

source: Open a file in read only mode using the encoding detected by :func:`detect_encoding`.
fr: Ouvre un fichier en mode lecture seule en utilisant l'encodage détecté par :func:`dectect_encoding`.

source: Raised when either a docstring or expression that may be split over several lines is not completed anywhere in the file, for example::
fr: Déclenché lorsque soit une *docstring* soit une expression qui pourrait être divisée sur plusieurs lignes n'est pas complété dans le fichier, par exemple ::

source: or::
fr: ou ::

source: Note that unclosed single-quoted strings do not cause an error to be raised. They are tokenized as :data:`~token.ERRORTOKEN`, followed by the tokenization of their contents.
fr: Notez que les chaînes à simple guillemet non fermés ne provoquent pas le déclenchement d'une erreur. Ils sont tokenisés comme :data:`~token.ERRORTOKEN`, suivi de la tokenisation de leur contenu.

source: Command-Line Usage
fr: Utilisation en ligne de commande.

source: The :mod:`tokenize` module can be executed as a script from the command line. It is as simple as:
fr: Le module :mod:`tokenize` peut être exécuté en tant que script à partir de la ligne de commande. C'est aussi simple que :

source: The following options are accepted:
fr: Les options suivantes sont acceptées :

source: show this help message and exit
fr: Montre ce message d'aide et quitte

source: display token names using the exact type
fr: Affiche les noms de jetons en utilisant le même type.

source: If :file:`filename.py` is specified its contents are tokenized to stdout. Otherwise, tokenization is performed on stdin.
fr: Si :file:`filename.py` est spécifié, son contenu est tokenisé vers *stdout*. Sinon, la tokenisation est effectuée sur ce qui est fourni sur *stdin*.

source: Examples
fr: Exemples

source: Example of a script rewriter that transforms float literals into Decimal objects::
fr: Exemple d'un script qui transforme les littéraux de type *float* en type *Decimal* ::

source: Example of tokenizing from the command line. The script::
fr: Exemple de tokenisation à partir de la ligne de commande. Le script ::

source: will be tokenized to the following output where the first column is the range of the line/column coordinates where the token is found, the second column is the name of the token, and the final column is the value of the token (if any)
fr: sera tokenisé à la sortie suivante où la première colonne est la plage des coordonnées de la ligne/colonne où se trouve le jeton, la deuxième colonne est le nom du jeton, et la dernière colonne est la valeur du jeton (le cas échéant)

source: The exact token type names can be displayed using the :option:`-e` option:
fr: Les noms exacts des types de jeton peuvent être affichés en utilisant l’option : :option:`-e`
