Repository: python/python-docs-fr
Catalog: library/token.po
Languages: fr

source: :mod:`token` --- Constants used with Python parse trees
fr: :mod:`token` --- Constantes utilisées avec les arbres d'analyse Python (*parse trees*)

source: **Source code:** :source:`Lib/token.py`
fr: **Code source :** :source:`Lib/token.py`

source: This module provides constants which represent the numeric values of leaf nodes of the parse tree (terminal tokens). Refer to the file :file:`Grammar/Grammar` in the Python distribution for the definitions of the names in the context of the language grammar. The specific numeric values which the names map to may change between Python versions.
fr: Ce module fournit des constantes qui représentent les valeurs numériques des nœuds enfants du *parse tree* (les jetons "terminaux"). Voir le fichier :file:`Grammar/Grammar` dans la distribution Python pour la définitions des noms dans le contexte de la grammaire. Les valeurs numériques correspondant aux noms sont susceptibles de changer entre deux versions de Python.

source: The module also provides a mapping from numeric codes to names and some functions. The functions mirror definitions in the Python C header files.
fr: Le module fournit également une correspondance entre les codes numériques et les noms et certaines fonctions. Les fonctions reflètent les définitions des fichiers d'en-tête C de Python.

source: Dictionary mapping the numeric values of the constants defined in this module back to name strings, allowing more human-readable representation of parse trees to be generated.
fr: Dictionnaire faisant correspondre les valeurs numériques des constantes définies dans ce module à leurs noms, permettant de générer une représentation plus humaine des *parse trees*.

source: Return true for terminal token values.
fr: Renvoie ``True`` pour les valeurs des jetons terminaux.

source: Return true for non-terminal token values.
fr: Renvoie ``True`` pour les valeurs des jetons non terminaux.

source: Return true if *x* is the marker indicating the end of input.
fr: Renvoie ``True`` si *x* est le marqueur indiquant la fin de de la source.

source: The token constants are:
fr: Les constantes associées aux jetons sont:

source: The following token type values aren't used by the C tokenizer but are needed for the :mod:`tokenize` module.
fr: Les types de jetons suivants ne sont pas utilisés par le l'analyseur lexical C mais sont requis par le module :mod:`tokenize`.

source: Token value used to indicate a comment.
fr: Valeur du jeton utilisée pour indiquer un commentaire.

source: Token value used to indicate a non-terminating newline. The :data:`NEWLINE` token indicates the end of a logical line of Python code; ``NL`` tokens are generated when a logical line of code is continued over multiple physical lines.
fr: Valeur du jeton utilisée pour indiquer un retour à la ligne non terminal. Le jeton :data:`NEWLINE` indique la fin d'une ligne logique de code Python; les jetons ``NL`` sont générés quand une ligne logique de code s'étend sur plusieurs lignes.

source: Token value that indicates the encoding used to decode the source bytes into text. The first token returned by :func:`tokenize.tokenize` will always be an ``ENCODING`` token.
fr: Valeur de jeton qui indique l'encodage utilisé pour décoder le fichier initial. Le premier jeton renvoyé par :func:`tokenize.tokenize` sera toujours un jeton ``ENCODING``.

source: Added :data:`AWAIT` and :data:`ASYNC` tokens.
fr: Ajout des jetons :data:`AWAIT` et :data:`ASYNC`.

source: Added :data:`COMMENT`, :data:`NL` and :data:`ENCODING` tokens.
fr: Ajout des jetons :data:`COMMENT`, :data:`NL` et :data:`ENCODING`.

source: Removed :data:`AWAIT` and :data:`ASYNC` tokens. "async" and "await" are now tokenized as :data:`NAME` tokens.
fr: Suppression des jetons :data:`AWAIT` et :data:`ASYNC`. "async" et "await" sont maintenant transformés en jetons :data:`NAME`.
