Repository: python/python-docs-fr
Catalog: library/turtle.po
Languages: fr

source: :mod:`turtle` --- Turtle graphics
fr: :mod:`turtle` — Tortue graphique

source: **Source code:** :source:`Lib/turtle.py`
fr: **Code Source :** :source:`Lib/turtle.py`

source: Imagine a robotic turtle starting at (0, 0) in the x-y plane. After an ``import turtle``, give it the command ``turtle.forward(15)``, and it moves (on-screen!) 15 pixels in the direction it is facing, drawing a line as it moves. Give it the command ``turtle.right(25)``, and it rotates in-place 25 degrees clockwise.
fr: Imaginez un robot sous forme de tortue partant au centre (0, 0) d'un plan cartésien x-y. Après un ``import turtle``, exécutez la commande ``turtle.forward(15)`` et la tortue se déplace (sur l'écran) de 15 pixels en face d'elle, en dessinant une ligne.

source: Turtle can draw intricate shapes using programs that repeat simple moves.
fr: La tortue permet de dessiner des formes complexes en utilisant un programme qui répète des actions élémentaires.

source: Tutorial
fr: Tutoriel

source: Pen control
fr: Réglage des stylos

source: In the following documentation the argument list for functions is given. Methods, of course, have the additional first argument *self* which is omitted here.
fr: La liste des paramètres des fonctions est donnée dans cette documentation. Les méthodes ont, évidemment, le paramètre *self* comme premier argument, mais ce dernier n'est pas indiqué ici.

source: Turtle methods
fr: Les méthodes du module *Turtle*

source: Turtle motion
fr: Les mouvements dans le module *Turtle*

source: Move and draw
fr: Bouger et dessiner

source: Tell Turtle's state
fr: Connaître l'état de la tortue

source: Setting and measurement
fr: Paramétrage et mesure

source: Drawing state
fr: État des stylos

source: Color control
fr: Réglage des couleurs

source: Filling
fr: Remplissage

source: More drawing control
fr: Plus des réglages pour le dessin

source: Turtle state
fr: État de la tortue

source: Visibility
fr: Visibilité

source: Appearance
fr: Apparence

source: Using events
fr: Utilisation des événements

source: Special Turtle methods
fr: Méthodes spéciales de la tortue

source: Methods of TurtleScreen/Screen
fr: Méthodes de *TurtleScreen*/*Screen*

source: Window control
fr: Réglage de la fenêtre

source: Animation control
fr: Réglage de l'animation

source: Using screen events
fr: Utilisation des événements concernant l'écran

source: Settings and special methods
fr: Paramétrages et méthodes spéciales

source: Input methods
fr: Méthodes de saisie

source: Methods specific to Screen
fr: Méthodes spécifiques de *Screen*

source: Methods of RawTurtle/Turtle and corresponding functions
fr: Méthodes de *RawTurtle*/*Turtle* et leurs fonctions correspondantes

source: Most of the examples in this section refer to a Turtle instance called ``turtle``.
fr: La plupart des exemples de cette section se réfèrent à une instance de *Turtle* appelée ``turtle``.

source: Parameters
fr: Paramètres

source: a number (integer or float)
fr: un nombre (entier ou flottant)

source: Move the turtle forward by the specified *distance*, in the direction the turtle is headed.
fr: Avance la tortue de la *distance* spécifiée, dans la direction où elle se dirige.

source: a number
fr: un nombre

source: Move the turtle backward by *distance*, opposite to the direction the turtle is headed. Do not change the turtle's heading.
fr: Déplace la tortue de *distance* vers l'arrière (dans le sens opposé à celui vers lequel elle pointe). Ne change pas le cap de la tortue.

source: Turn turtle right by *angle* units. (Units are by default degrees, but can be set via the :func:`degrees` and :func:`radians` functions.) Angle orientation depends on the turtle mode, see :func:`mode`.
fr: Tourne la tortue à droite de *angle* unités (les unités sont par défaut des degrés, mais peuvent être définies via les fonctions :func:`degrees` et :func:`radians`). L'orientation de l'angle dépend du mode de la tortue, voir :func:`mode`.

source: Turn turtle left by *angle* units. (Units are by default degrees, but can be set via the :func:`degrees` and :func:`radians` functions.) Angle orientation depends on the turtle mode, see :func:`mode`.
fr: Tourne la tortue à gauche d'une valeur de *angle* unités (les unités sont par défaut des degrés, mais peuvent être définies via les fonctions :func:`degrees` et :func:`radians`). L'orientation de l'angle dépend du mode de la tortue, voir :func:`mode`.

source: a number or a pair/vector of numbers
fr: un nombre ou une paire / un vecteur de nombres

source: a number or ``None``
fr: un nombre ou ``None``

source: If *y* is ``None``, *x* must be a pair of coordinates or a :class:`Vec2D` (e.g. as returned by :func:`pos`).
fr: Si *y* est ``None``, *x* doit être une paire de coordonnées, ou bien une instance de :class:`Vec2D` (par exemple, tel que renvoyé par :func:`pos`).

source: Move turtle to an absolute position. If the pen is down, draw line. Do not change the turtle's orientation.
fr: Déplace la tortue vers une position absolue. Si le stylo est en bas, trace une ligne. Ne change pas l'orientation de la tortue.

source: Set the turtle's first coordinate to *x*, leave second coordinate unchanged.
fr: Définit la première coordonnée de la tortue à *x*, en laissant la deuxième coordonnée inchangée.

source: Set the turtle's second coordinate to *y*, leave first coordinate unchanged.
fr: Définit la deuxième coordonnée de la tortue à *y*, en laissant la première coordonnée inchangée.

source: Set the orientation of the turtle to *to_angle*. Here are some common directions in degrees:
fr: Règle l'orientation de la tortue à la valeur ``to_angle``. Voici quelques orientations courantes en degrés :

source: standard mode
fr: mode standard

source: logo mode
fr: mode logo

source: 0 - east
fr: 0 – Est

source: 0 - north
fr: 0 – Nord

source: 90 - north
fr: 90 – Nord

source: 90 - east
fr: 90 – Est

source: 180 - west
fr: 180 – Ouest

source: 180 - south
fr: 180 – Sud

source: 270 - south
fr: 270 – Sud

source: 270 - west
fr: 270 – Ouest

source: Move turtle to the origin -- coordinates (0,0) -- and set its heading to its start-orientation (which depends on the mode, see :func:`mode`).
fr: Déplace la tortue à l'origine — coordonnées (0,0) — et l'oriente à son cap initial (qui dépend du mode, voir :func:`mode`).

source: a number (or ``None``)
fr: un nombre (ou ``None``)

source: an integer (or ``None``)
fr: un entier (ou ``None``)

source: Draw a circle with given *radius*. The center is *radius* units left of the turtle; *extent* -- an angle -- determines which part of the circle is drawn. If *extent* is not given, draw the entire circle. If *extent* is not a full circle, one endpoint of the arc is the current pen position. Draw the arc in counterclockwise direction if *radius* is positive, otherwise in clockwise direction. Finally the direction of the turtle is changed by the amount of *extent*.
fr: Dessine un cercle de rayon *radius*. Le centre se trouve à une distance de *radius* à gauche de la tortue ; l'angle *extent* détermine quelle partie du cercle est dessinée. Si *extent* n'est pas fourni, dessine le cercle en entier. Si *extent* ne correspond pas à un cercle entier, la position actuelle du stylo est donnée par l'un des points d'extrémité de l'arc de cercle. Si la valeur de *radius* est positive, dessine l'arc de cercle dans le sens inverse des aiguilles d'une montre, sinon le dessine dans le sens des aiguilles d'une montre. Enfin, la direction de la tortue peut être modifiée en réglant la valeur de *extent*.

source: As the circle is approximated by an inscribed regular polygon, *steps* determines the number of steps to use. If not given, it will be calculated automatically. May be used to draw regular polygons.
fr: Comme le cercle est approximé par un polygone régulier inscrit, *steps* détermine le nombre de pas à utiliser. Si cette valeur n'est pas donnée, elle sera calculée automatiquement. Elle peut être utilisée pour dessiner des polygones réguliers.

source: an integer >= 1 (if given)
fr: un entier supérieur ou égal à 1 (si fourni)

source: a colorstring or a numeric color tuple
fr: une chaîne qui désigne une couleur ou un triplet de couleur numérique

source: Draw a circular dot with diameter *size*, using *color*. If *size* is not given, the maximum of pensize+4 and 2*pensize is used.
fr: Dessine un point circulaire de diamètre *size*, de la couleur *color*. Si le paramètre *size* n'est pas indiqué, utilise la valeur maximum de la taille du stylo plus 4 et de la taille du stylo multiplié par 2.

source: Stamp a copy of the turtle shape onto the canvas at the current turtle position. Return a stamp_id for that stamp, which can be used to delete it by calling ``clearstamp(stamp_id)``.
fr: Tamponne une copie de la forme de la tortue sur le canevas à la position actuelle de la tortue. Renvoie un *stamp_id* pour ce tampon, qui peut être utilisé pour le supprimer en appelant ``clearstamp(stamp_id)``.

source: an integer, must be return value of previous :func:`stamp` call
fr: un entier, doit être la valeur renvoyée par l'appel précédent de :func:`stamp`

source: Delete stamp with given *stampid*.
fr: Supprime le tampon dont le *stampid* est donné.

source: Delete all or first/last *n* of turtle's stamps. If *n* is ``None``, delete all stamps, if *n* > 0 delete first *n* stamps, else if *n* < 0 delete last *n* stamps.
fr: Supprime tous, les *n* premiers ou les *n* derniers tampons de la tortue. Si *n* est ``None``, supprime tous les tampons, si *n* > 0, supprime les *n* premiers tampons et si n < 0, supprime les *n* derniers tampons.

source: Undo (repeatedly) the last turtle action(s). Number of available undo actions is determined by the size of the undobuffer.
fr: Annule la ou les dernières (si répété) actions de la tortue. Le nombre d'annulations disponible est déterminé par la taille de la mémoire tampon d'annulations.

source: an integer in the range 0..10 or a speedstring (see below)
fr: un nombre entier compris dans l’intervalle entre 0 et 10 inclus, ou une chaîne de vitesse (voir ci-dessous)

source: Set the turtle's speed to an integer value in the range 0..10. If no argument is given, return current speed.
fr: Règle la vitesse de la tortue à une valeur entière comprise entre 0 et 10 inclus. Si aucun argument n'est donné, renvoie la vitesse actuelle.

source: If input is a number greater than 10 or smaller than 0.5, speed is set to 0. Speedstrings are mapped to speedvalues as follows:
fr: Si l'entrée est un nombre supérieur à 10 ou inférieur à 0,5, la vitesse est fixée à 0. Les chaînes de vitesse sont mises en correspondance avec les valeurs de vitesse comme suit :

source: Speeds from 1 to 10 enforce increasingly faster animation of line drawing and turtle turning.
fr: Les vitesses de 1 à 10 permettent une animation de plus en plus rapide du trait du dessin et de la rotation des tortues.

source: Attention: *speed* = 0 means that *no* animation takes place. forward/back makes turtle jump and likewise left/right make the turtle turn instantly.
fr: Attention : *speed* = 0 signifie qu'il n'y a *aucune* animation. *forward*/*back* font sauter la tortue et, de même, *left*/*right* font tourner la tortue instantanément.

source: Return the turtle's current location (x,y) (as a :class:`Vec2D` vector).
fr: Renvoie la position actuelle de la tortue (x,y) (en tant qu'un vecteur :class:`Vec2d`).

source: a number or a pair/vector of numbers or a turtle instance
fr: un nombre, ou une paire / un vecteur de nombres, ou une instance de tortue

source: a number if *x* is a number, else ``None``
fr: un nombre si *x* est un nombre, sinon ``None``

source: Return the angle between the line from turtle position to position specified by (x,y), the vector or the other turtle. This depends on the turtle's start orientation which depends on the mode - "standard"/"world" or "logo".
fr: Renvoie l'angle entre l'orientation d'origine et la ligne formée de la position de la tortue à la position spécifiée par (x,y), le vecteur ou l'autre tortue. L'orientation d'origine dépend du mode — "standard"/"world" ou "logo".

source: Return the turtle's x coordinate.
fr: Renvoie la coordonnée x de la tortue.

source: Return the turtle's y coordinate.
fr: Renvoie la coordonnée y de la tortue.

source: Return the turtle's current heading (value depends on the turtle mode, see :func:`mode`).
fr: Renvoie le cap de la tortue (la valeur dépend du mode de la tortue, voir :func:`mode`).

source: Return the distance from the turtle to (x,y), the given vector, or the given other turtle, in turtle step units.
fr: Renvoie la distance entre la tortue et (x,y), le vecteur donné ou l'autre tortue donnée. La valeur est exprimée en unités de pas de tortue.

source: Settings for measurement
fr: Paramètres de mesure

source: Set angle measurement units, i.e. set number of "degrees" for a full circle. Default value is 360 degrees.
fr: Définit les unités de mesure des angles, c.-à-d. fixe le nombre de « degrés » pour un cercle complet. La valeur par défaut est de 360 degrés.

source: Set the angle measurement units to radians. Equivalent to ``degrees(2*math.pi)``.
fr: Règle l'unité de mesure des angles sur radians. Équivalent à ``degrees(2*math.pi)``.

source: Pull the pen down -- drawing when moving.
fr: Baisse la pointe du stylo — dessine quand il se déplace.

source: Pull the pen up -- no drawing when moving.
fr: Lève la pointe du stylo — pas de dessin quand il se déplace.

source: a positive number
fr: un nombre positif

source: Set the line thickness to *width* or return it. If resizemode is set to "auto" and turtleshape is a polygon, that polygon is drawn with the same line thickness. If no argument is given, the current pensize is returned.
fr: Règle l'épaisseur de la ligne à *width* ou la renvoie. Si *resizemode* est défini à "auto" et que *turtleshape* (la forme de la tortue) est un polygone, le polygone est dessiné avec cette épaisseur. Si aucun argument n'est passé, la taille actuelle du stylo (*pensize*) est renvoyée.

source: a dictionary with some or all of the below listed keys
fr: un dictionnaire avec certaines ou toutes les clés énumérées ci-dessous

source: one or more keyword-arguments with the below listed keys as keywords
fr: un ou plusieurs arguments par mots-clés avec les clés suivantes comme mots-clés

source: Return or set the pen's attributes in a "pen-dictionary" with the following key/value pairs:
fr: Renvoie ou définit les attributs du stylo dans un ``"pen-dictionary"`` avec les paires clés / valeurs suivantes :

source: "pencolor": color-string or color-tuple
fr: ``"pencolor"`` : chaîne de caractères ou triplet désignant la couleur du stylo

source: "fillcolor": color-string or color-tuple
fr: ``"fillcolor"`` : chaîne de caractères ou triplet pour la couleur de remplissage

source: "pensize": positive number
fr: ``"pensize"`` : nombre positif

source: "speed": number in range 0..10
fr: ``"speed"`` : nombre compris dans intervalle 0 et 10

source: "resizemode": "auto" or "user" or "noresize"
fr: ``"resizemode"`` : ``"auto"``, ``"user"`` ou ``"noresize"``

source: "stretchfactor": (positive number, positive number)
fr: ``"stretchfactor"`` : (nombre positif, nombre positif)

source: "outline": positive number
fr: ``"outline"`` : nombre positif

source: "tilt": number
fr: ``"tilt"`` : nombre

source: This dictionary can be used as argument for a subsequent call to :func:`pen` to restore the former pen-state. Moreover one or more of these attributes can be provided as keyword-arguments. This can be used to set several pen attributes in one statement.
fr: Ce dictionnaire peut être utilisé comme argument pour un appel ultérieur à :func:`pen` pour restaurer l'ancien état du stylo. En outre, un ou plus de ces attributs peuvent est passés en tant qu'arguments nommés. Cela peut être utilisé pour définir plusieurs attributs du stylo en une instruction.

source: Return ``True`` if pen is down, ``False`` if it's up.
fr: Renvoie ``True`` si la pointe du stylo est en bas et ``False`` si elle est en haut.

source: Return or set the pencolor.
fr: Renvoie ou règle la couleur du stylo.

source: Four input formats are allowed:
fr: Quatre formats d'entrée sont autorisés :

source: Return the current pencolor as color specification string or as a tuple (see example). May be used as input to another color/pencolor/fillcolor call.
fr: Renvoie la couleur du stylo actuelle en tant que chaine de spécification de couleurs ou en tant qu'un *n*-uplet (voir l'exemple). Peut être utilisée comme entrée à un autre appel de *color*/*pencolor*/*fillcolor*.

source: Set pencolor to *colorstring*, which is a Tk color specification string, such as ``"red"``, ``"yellow"``, or ``"#33cc8c"``.
fr: Définit la couleur du stylo à ``colorstring``, qui est une chaîne de spécification de couleur *Tk*, telle que ``"red"``, ``"yellow"``, ou ``"#33cc8c"``.

source: Set pencolor to the RGB color represented by the tuple of *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode, where colormode is either 1.0 or 255 (see :func:`colormode`).
fr: Définit la couleur du stylo à la couleur RGB représentée par le *n*-uplet de *r*, *g* et *b*. Chacun des *r*, *g* et *b* doit être dans l'intervalle ``0..colormode``, où *colormode* est vaut 1.0 ou 255 (voir :func:`colormode`).

source: Set pencolor to the RGB color represented by *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode.
fr: Définit la couleur du stylo à la couleur RGB représentée par *r*, *g* et *b*. Chacun des *r*, *g* et *b* doit être dans l'intervalle ``0..colormode``.

source: If turtleshape is a polygon, the outline of that polygon is drawn with the newly set pencolor.
fr: Si la forme de la tortue est un polygone, le contour de ce polygone est dessiné avec la nouvelle couleur du stylo.

source: Return or set the fillcolor.
fr: Renvoie ou règle la couleur de remplissage.

source: Return the current fillcolor as color specification string, possibly in tuple format (see example). May be used as input to another color/pencolor/fillcolor call.
fr: Renvoie la couleur de remplissage actuelle (*fillcolor*) en tant que chaine de spécification, possiblement en format *n*-uplet (voir l'exemple). Peut être utilisée en entrée pour un autre appel de *color*/*pencolor*/*fillcolor*.

source: Set fillcolor to *colorstring*, which is a Tk color specification string, such as ``"red"``, ``"yellow"``, or ``"#33cc8c"``.
fr: Définit la couleur de remplissage (*fillcolor*) à *colorstring*, qui est une chaine de spécification de couleur *Tk* comme par exemple ``"red"``, ``"yellow"`` ou ``"#33cc8c"``.

source: Set fillcolor to the RGB color represented by the tuple of *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode, where colormode is either 1.0 or 255 (see :func:`colormode`).
fr: Définit la couleur du remplissage (*fillcolor*) à la couleur RGB représentée par le *n*-uplet *r*, *g*, *b*. Chacun des *r*, *g* et *b* doit être dans l'intervalle ``0..colormode`` où *colormode* vaut 1.0 ou 255 (voir :func:`colormode`).

source: Set fillcolor to the RGB color represented by *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode.
fr: Définit la couleur du remplissage(*fillcolor*) à la couleur RGB représentée par *r*, *g* et *b*. Chacun des *r*, *g* et *b* doit être dans l'intervalle ``0..colormode``.

source: If turtleshape is a polygon, the interior of that polygon is drawn with the newly set fillcolor.
fr: Si la forme de la tortue est un polygone, l'intérieur de ce polygone sera dessiné avec la nouvelle couleur de remplissage.

source: Return or set pencolor and fillcolor.
fr: Renvoie ou règle la couleur du stylo et la couleur de remplissage.

source: Several input formats are allowed. They use 0 to 3 arguments as follows:
fr: Plusieurs formats d'entrée sont autorisés. Ils peuvent avoir de zéro jusqu'à trois arguments, employés comme suit :

source: Return the current pencolor and the current fillcolor as a pair of color specification strings or tuples as returned by :func:`pencolor` and :func:`fillcolor`.
fr: Renvoie la couleur du stylo actuelle et la couleur de remplissage actuelle sous forme de paire, soit de chaines de spécification de couleur, soit de *n*-uplets comme renvoyés par :func:`pencolor` et :func:`fillcolor`.

source: Inputs as in :func:`pencolor`, set both, fillcolor and pencolor, to the given value.
fr: Les formats d'entrée sont comme dans :func:`pencolor`. Définit à la fois la couleur de remplissage et la couleur du stylo à la valeur passée.

source: Equivalent to ``pencolor(colorstring1)`` and ``fillcolor(colorstring2)`` and analogously if the other input format is used.
fr: Équivalent à ``pencolor(colorstring1)`` et ``fillcolor(colorstring2)`` et de manière analogue si un autre format d'entrée est utilisé.

source: If turtleshape is a polygon, outline and interior of that polygon is drawn with the newly set colors.
fr: Si la forme de la tortue est un polygone, le contour et l'intérieur de ce polygone sont dessinés avec les nouvelles couleurs.

source: See also: Screen method :func:`colormode`.
fr: Voir aussi : la méthode :func:`colormode` de *Screen*.

source: Return fillstate (``True`` if filling, ``False`` else).
fr: Renvoie l'état de remplissage (``True`` signifie en train de faire un remplissage, ``False`` sinon).

source: To be called just before drawing a shape to be filled.
fr: À appeler juste avant de dessiner une forme à remplir.

source: Fill the shape drawn after the last call to :func:`begin_fill`.
fr: Remplit la forme dessinée après le dernier appel à :func:`begin_fill`.

source: Whether or not overlap regions for self-intersecting polygons or multiple shapes are filled depends on the operating system graphics, type of overlap, and number of overlaps. For example, the Turtle star above may be either all yellow or have some white regions.
fr: Le remplissage correct des formes complexes (polygones qui se recoupent, plusieurs formes) dépend des primitives graphiques du système d’exploitation, du type et du nombre des chevauchements. Par exemple, l'étoile (*Turtle star* en anglais) ci-dessus peut être entièrement jaune ou comporter quelques régions blanches.

source: Delete the turtle's drawings from the screen, re-center the turtle and set variables to the default values.
fr: Supprime les dessins de la tortue de l'écran, recentre la tortue et assigne les variables aux valeurs par défaut.

source: Delete the turtle's drawings from the screen. Do not move turtle. State and position of the turtle as well as drawings of other turtles are not affected.
fr: Supprime les dessins de la tortue de l'écran. Ne déplace pas la tortue. L'état et la position de la tortue ainsi que les dessins des autres tortues ne sont pas affectés.

source: object to be written to the TurtleScreen
fr: objet à écrire sur le *TurtleScreen*

source: one of the strings "left", "center" or right"
fr: l'une des chaînes de caractères suivantes : ``"left"``, ``"center"`` ou ``"right"``

source: a triple (fontname, fontsize, fonttype)
fr: triplet (nom de police, taille de police, type de police)

source: Write text - the string representation of *arg* - at the current turtle position according to *align* ("left", "center" or "right") and with the given font. If *move* is true, the pen is moved to the bottom-right corner of the text. By default, *move* is ``False``.
fr: Écrit du texte - La représentation de la chaîne *arg* - à la position actuelle de la tortue conformément à *align* ("*left*", "*center*" ou "*right*") et en police donnée. Si *move* est ``True``, le stylo est déplacé vers le coin inférieur droit du texte. Par défaut, *move* est ``False``.
