Repository: python/python-docs-fr
Catalog: library/turtle.po
Languages: fr

source: Return the colormode or set it to 1.0 or 255. Subsequently *r*, *g*, *b* values of color triples have to be in the range 0..*cmode*.
fr: Renvoie le mode de couleur (*colormode*) ou le définit à 1.0 ou 255. Les valeurs *r*, *g* et *b* doivent aussi être dans la gamme ``0``\ ..\ *cmode*.

source: Return the Canvas of this TurtleScreen. Useful for insiders who know what to do with a Tkinter Canvas.
fr: Renvoie le canevas de ce TurtleScreen. Utile pour les initiés qui savent quoi faire avec un canevas Tkinter.

source: Return a list of names of all currently available turtle shapes.
fr: Renvoie une liste de noms de toutes les formes actuellement disponibles pour les tortues.

source: There are three different ways to call this function:
fr: Il existe trois façons différentes d’appeler cette fonction :

source: *name* is the name of a gif-file and *shape* is ``None``: Install the corresponding image shape. ::
fr: *name* est le nom d'un fichier *gif* et *shape* est ``None`` : Installe la forme d'image correspondante. ::

source: Image shapes *do not* rotate when turning the turtle, so they do not display the heading of the turtle!
fr: Les formes d'images *ne tournent pas* lorsque la tortue tourne, donc elles n'indiquent pas le cap de la tortue !

source: *name* is an arbitrary string and *shape* is a tuple of pairs of coordinates: Install the corresponding polygon shape.
fr: *name* est une chaîne de caractères arbitraire et *shape* est un *n*-uplet de paires de coordonnées : Installe le polygone correspondant.

source: Add a turtle shape to TurtleScreen's shapelist. Only thusly registered shapes can be used by issuing the command ``shape(shapename)``.
fr: Ajoute une forme de tortue a la liste des formes du TurtleScreen. Seulement les formes enregistrées de cette façon peuvent être utilisée avec la commande ``shape(shapename)``.

source: Return the list of turtles on the screen.
fr: Renvoie la liste des tortues présentes sur l'écran.

source: Return the height of the turtle window. ::
fr: Renvoie la hauteur de la fenêtre de la tortue. ::

source: Return the width of the turtle window. ::
fr: Renvoie la largeur de la fenêtre de la tortue. ::

source: Methods specific to Screen, not inherited from TurtleScreen
fr: Méthodes spécifiques à Screen, non héritées de TurtleScreen

source: Shut the turtlegraphics window.
fr: Éteins la fenêtre *turtlegraphics*.

source: Bind ``bye()`` method to mouse clicks on the Screen.
fr: Lie la méthode ``bye()`` à un clique de souris sur l'écran (*Screen*).

source: If the value "using_IDLE" in the configuration dictionary is ``False`` (default value), also enter mainloop. Remark: If IDLE with the ``-n`` switch (no subprocess) is used, this value should be set to ``True`` in :file:`turtle.cfg`. In this case IDLE's own mainloop is active also for the client script.
fr: Si la valeur de "*using_IDLE*" dans le dictionnaire de configuration est ``False`` (valeur par défaut), démarre aussi la boucle principale. Remarque : Si IDLE est lancé avec l'option ``-n`` (Pas de sous processus), Cette valeur devrait être définie à ``True`` dans :file:`turtle.cfg`. Dans ce cas, la boucle principale d'IDLE est active aussi pour le script du client.

source: Set the size and position of the main window. Default values of arguments are stored in the configuration dictionary and can be changed via a :file:`turtle.cfg` file.
fr: Définit la taille et la position de la fenêtre principale. Les valeurs par défaut des arguments sont stockées dans le dictionnaire de configuration et peuvent être modifiées via un fichier :file:`turtle.cfg`.

source: if an integer, a size in pixels, if a float, a fraction of the screen; default is 50% of screen
fr: s'il s'agit d'un nombre entier, une taille en pixels, s'il s'agit d'un nombre flottant, une fraction de l'écran ; la valeur par défaut est de 50 % de l'écran

source: if an integer, the height in pixels, if a float, a fraction of the screen; default is 75% of screen
fr: s'il s'agit d'un nombre entier, la hauteur en pixels, s'il s'agit d'un nombre flottant, une fraction de l'écran ; la valeur par défaut est 75 % de l'écran

source: if positive, starting position in pixels from the left edge of the screen, if negative from the right edge, if ``None``, center window horizontally
fr: s'il s'agit d'un nombre positif, position de départ en pixels à partir du bord gauche de l'écran, s'il s'agit d'un nombre négatif, position de départ en pixels à partir du bord droit, si c'est ``None``, centre la fenêtre horizontalement

source: if positive, starting position in pixels from the top edge of the screen, if negative from the bottom edge, if ``None``, center window vertically
fr: si positif, la position de départ en pixels depuis le haut de l'écran. Si négatif, depuis de bas de l'écran. Si ``None``, Le centre de la fenêtre verticalement

source: a string that is shown in the titlebar of the turtle graphics window
fr: chaîne de caractères affichée dans la barre de titre de la fenêtre graphique de la tortue

source: Set title of turtle window to *titlestring*.
fr: Définit le titre de la fenêtre de la tortue comme *titlestring*.

source: Public classes
fr: Classes publiques

source: Create a turtle. The turtle has all methods described above as "methods of Turtle/RawTurtle".
fr: Crée une tortue. Cette tortue à toutes les méthodes décrites ci-dessus comme "Méthode de Turtle/RawTurtle".

source: Subclass of RawTurtle, has the same interface but draws on a default :class:`Screen` object created automatically when needed for the first time.
fr: Sous-classe de RawTurtle, à la même interface mais dessine sur un objet :class:`screen` par défaut créé automatiquement lorsque nécessaire pour la première fois.

source: Subclass of TurtleScreen, with :ref:`four methods added <screenspecific>`.
fr: Sous-classess de TurtleScreen, avec :ref:`quatre nouvelles méthodes <screenspecific>`.

source: some Tkinter widget to contain the ScrolledCanvas, i.e. a Tkinter-canvas with scrollbars added
fr: certain modules Tkinter pour contenir le ScrolledCanvas, c'est à dire, un canevas Tkinter avec des barres de défilement ajoutées

source: Used by class Screen, which thus automatically provides a ScrolledCanvas as playground for the turtles.
fr: Utilisé par la classe Screen, qui fournit donc automatiquement un ScrolledCanvas comme terrain de jeu pour les tortues.

source: one of the strings "polygon", "image", "compound"
fr: l'une des chaînes suivantes : ``"polygon"``, ``"image"`` ou ``"compound"``

source: Data structure modeling shapes. The pair ``(type_, data)`` must follow this specification:
fr: Formes de modélisation de la structure des données. La paire ``(type_, data)`` doit suivre cette spécification :

source: *data*
fr: *données*

source: a polygon-tuple, i.e. a tuple of pairs of coordinates
fr: un polygone *n*-uplet, c'est-à-dire un *n*-uplet constitué de paires (chaque paire définissant des coordonnées)

source: an image (in this form only used internally!)
fr: une image (utilisée uniquement en interne sous ce format !)

source: ``None`` (a compound shape has to be constructed using the :meth:`addcomponent` method)
fr: ``None`` (une forme composée doit être construite en utilisant la méthode :meth:`addcomponent`)

source: a polygon, i.e. a tuple of pairs of numbers
fr: un polygone, c.-à-d. un *n*-uplet de paires de nombres

source: a color the *poly* will be filled with
fr: une couleur de remplissage pour *poly*

source: a color for the poly's outline (if given)
fr: une couleur pour le contour du polygone (si elle est donnée)

source: Example:
fr: Exemple :

source: See :ref:`compoundshapes`.
fr: Voir :ref:`compoundshapes`.

source: A two-dimensional vector class, used as a helper class for implementing turtle graphics. May be useful for turtle graphics programs too. Derived from tuple, so a vector is a tuple!
fr: Une classe de vecteur bidimensionnel, utilisée en tant que classe auxiliaire pour implémenter les graphiques *turtle*. Peut être utile pour les programmes graphiques faits avec *turtle*. Dérivé des *n*-uplets, donc un vecteur est un *n*-uplet !

source: Provides (for *a*, *b* vectors, *k* number):
fr: Permet (pour les vecteurs *a*, *b* et le nombre *k*) :

source: ``a + b`` vector addition
fr: ``a + b`` addition de vecteurs

source: ``a - b`` vector subtraction
fr: ``a - b`` soustraction de deux vecteurs

source: ``a * b`` inner product
fr: ``a * b`` produit scalaire

source: ``k * a`` and ``a * k`` multiplication with scalar
fr: ``k * a`` et ``a * k`` multiplication avec un scalaire

source: ``abs(a)`` absolute value of a
fr: ``abs(a)`` valeur absolue de a

source: Explanation
fr: Explication

source: Help and configuration
fr: Aide et configuration

source: How to use help
fr: Utilisation de l'aide

source: The public methods of the Screen and Turtle classes are documented extensively via docstrings. So these can be used as online-help via the Python help facilities:
fr: Les méthodes publiques des classes *Screen* et *Turtle* sont largement documentées dans les *docstrings*. Elles peuvent donc être utilisées comme aide en ligne via les fonctions d'aide de Python :

source: When using IDLE, tooltips show the signatures and first lines of the docstrings of typed in function-/method calls.
fr: Lors de l'utilisation d'IDLE, des info-bulles apparaissent avec la signature et les premières lignes de *docstring* de la fonction/méthode appelée.

source: Calling :func:`help` on methods or functions displays the docstrings::
fr: L'appel de :func:`help` sur les méthodes ou fonctions affichera les *docstrings* ::

source: The docstrings of the functions which are derived from methods have a modified form::
fr: Les *docstrings* des fonctions qui sont dérivées des méthodes ont une forme modifiée ::

source: These modified docstrings are created automatically together with the function definitions that are derived from the methods at import time.
fr: Ces chaînes de documents modifiées sont créées automatiquement avec les définitions de fonctions qui sont dérivées des méthodes au moment de l'importation.

source: Translation of docstrings into different languages
fr: Traduction de chaînes de documents en différentes langues

source: There is a utility to create a dictionary the keys of which are the method names and the values of which are the docstrings of the public methods of the classes Screen and Turtle.
fr: Il est utile de créer un dictionnaire dont les clés sont les noms des méthodes et les valeurs sont les *docstrings* de méthodes publiques des classes Screen et Turtle.

source: a string, used as filename
fr: une chaîne de caractères, utilisée en tant que nom de fichier

source: Create and write docstring-dictionary to a Python script with the given filename. This function has to be called explicitly (it is not used by the turtle graphics classes). The docstring dictionary will be written to the Python script :file:`{filename}.py`. It is intended to serve as a template for translation of the docstrings into different languages.
fr: Crée et écrit un dictionnaire de *docstrings* dans un script Python avec le nom donné. Cette fonction doit être appelée explicitement (elle n'est pas utilisée par les classes graphiques de *turtle*). Ce dictionnaire de *doctrings* sera écrit dans le script Python :file:`{filename}.py`. Il sert de modèle pour la traduction des *docstrings* dans différentes langues.

source: If you (or your students) want to use :mod:`turtle` with online help in your native language, you have to translate the docstrings and save the resulting file as e.g. :file:`turtle_docstringdict_german.py`.
fr: Si vous (ou vos étudiants) veulent utiliser :mod:`turtle` avec de l'aide en ligne dans votre langue natale, vous devez traduire les *docstrings* et sauvegarder les fichiers résultants en, par exemple, :file:`turtle_docstringdict_german.py`.

source: If you have an appropriate entry in your :file:`turtle.cfg` file this dictionary will be read in at import time and will replace the original English docstrings.
fr: Si vous avez une entrée appropriée dans votre fichier :file:`turtle.cfg`, ce dictionnaire est lu au moment de l'importation et remplace la *docstrings* originale en anglais par cette entrée.

source: At the time of this writing there are docstring dictionaries in German and in Italian. (Requests please to glingl@aon.at.)
fr: Au moment de l'écriture de cette documentation, il n'existe seulement que des *docstrings* en Allemand et Italien. (Merci de faire vos demandes à glingl@aon.at.)

source: How to configure Screen and Turtles
fr: Comment configurer *Screen* et *Turtle*

source: The built-in default configuration mimics the appearance and behaviour of the old turtle module in order to retain best possible compatibility with it.
fr: La configuration par défaut imite l'apparence et le comportement de l'ancien module *turtle* pour pouvoir maintenir la meilleure compatibilité avec celui-ci.

source: If you want to use a different configuration which better reflects the features of this module or which better fits to your needs, e.g. for use in a classroom, you can prepare a configuration file ``turtle.cfg`` which will be read at import time and modify the configuration according to its settings.
fr: Si vous voulez utiliser une configuration différente qui reflète mieux les fonctionnalités de ce module ou qui correspond mieux à vos besoins, par exemple pour un cours, vous pouvez préparer un ficher de configuration ``turtle.cfg`` qui sera lu au moment de l'importation et qui modifiera la configuration en utilisant les paramètres du fichier.

source: Short explanation of selected entries:
fr: Brève explication des entrées sélectionnées :

source: *shape* can be any of the built-in shapes, e.g: arrow, turtle, etc. For more info try ``help(shape)``.
fr: *shape* peut être n'importe quelle forme native, par exemple *arrow*, *turtle* etc. Pour plus d'informations, essayez ``help(shape)``.

source: If you want to reflect the turtle its state, you have to use ``resizemode = auto``.
fr: Si vous voulez refléter l'état de la tortue, vous devez utiliser ``resizemode = auto``.

source: The entries *exampleturtle* and *examplescreen* define the names of these objects as they occur in the docstrings. The transformation of method-docstrings to function-docstrings will delete these names from the docstrings.
fr: Les entrées *exampleturtle* et *examplescreen* définissent les noms de ces objets tels qu'ils apparaissent dans les *docstrings*. La transformation des méthodes-*docstrings* vers fonction-*docstrings* supprimera ces noms des *docstrings*.

source: There can be a :file:`turtle.cfg` file in the directory where :mod:`turtle` is stored and an additional one in the current working directory. The latter will override the settings of the first one.
fr: Il peut y avoir un :file:`turtle.cfg` dans le dossier où se situe :mod:`turtle` et un autre dans le dossier de travail courant. Ce dernier prendra le dessus.

source: The :file:`Lib/turtledemo` directory contains a :file:`turtle.cfg` file. You can study it as an example and see its effects when running the demos (preferably not from within the demo-viewer).
fr: Le dossier :file:`Lib/turtledemo` contient un fichier :file:`turtle.cfg`. Vous pouvez le prendre comme exemple et voir ses effets lorsque vous lancez les démos (il est préférable de ne pas le faire depuis la visionneuse de démos).

source: :mod:`turtledemo` --- Demo scripts
fr: :mod:`turtledemo` — Scripts de démonstration

source: The :mod:`turtledemo` package includes a set of demo scripts. These scripts can be run and viewed using the supplied demo viewer as follows::
fr: Le paquet :mod:`turtledemo` inclut un ensemble de scripts de démonstration. Ces scripts peuvent être lancés et observés en utilisant la visionneuse de démos comme suit ::

source: Alternatively, you can run the demo scripts individually. For example, ::
fr: Alternativement, vous pouvez lancer les scripts de démo individuellement. Par exemple ::

source: The :mod:`turtledemo` package directory contains:
fr: Le paquet :mod:`turtledemo` contient :

source: A demo viewer :file:`__main__.py` which can be used to view the sourcecode of the scripts and run them at the same time.
fr: Une visionneuse :file:`__main__.py` qui peut être utilisée pour lire le code source de ces scripts et pour les faire tourner en même temps.

source: Multiple scripts demonstrating different features of the :mod:`turtle` module. Examples can be accessed via the Examples menu. They can also be run standalone.
fr: Plusieurs script présentent les différentes fonctionnalités du module :mod:`turtle`. Les exemples peuvent être consultés via le menu *Examples*. Ils peuvent aussi être lancés de manière autonome.

source: A :file:`turtle.cfg` file which serves as an example of how to write and use such files.
fr: Un fichier exemple :file:`turtle.cfg` montrant comment rédiger de tels fichiers.

source: The demo scripts are:
fr: Les scripts de démonstration sont :

source: Name
fr: Nom

source: Features
fr: Caractéristiques

source: complex classical turtle graphics pattern
fr: motif complexe de la tortue graphique classique

source: :func:`tracer`, delay, :func:`update`
fr: :func:`tracer`, temps mort, :func:`update`

source: graphs Verhulst dynamics, shows that computer's computations can generate results sometimes against the common sense expectations
fr: graphiques dynamiques de Verhulst, cela démontre que les calculs de l'ordinateur peuvent générer des résultats qui vont parfois à l'encontre du bon sens

source: analog clock showing time of your computer
fr: horloge analogique indiquant l'heure de votre ordinateur

source: turtles as clock's hands, ontimer
fr: tortues sous forme des aiguilles d'horloge, sur minuterie

source: colormixer
fr: *colormixer* (mélangeur de couleurs)

source: experiment with r, g, b
fr: des expériences en rouge, vert, bleu

source: forest
fr: *forest* (forêt)

source: 3 breadth-first trees
fr: 3 arbres tracés par un parcours en largeur

source: randomization
fr: *randomization* (répartition aléatoire)

source: Hilbert & Koch curves
fr: Courbes de Hilbert et de Koch

source: recursion
fr: récursivité

source: ethnomathematics (indian kolams)
fr: ethnomathématiques (kolams indiens)

source: L-System
fr: *L-Système*

source: Towers of Hanoi
fr: Tours de Hanoï

source: Rectangular Turtles as Hanoi discs (shape, shapesize)
fr: Des tortues rectangulaires à la place des disques (*shape*, *shapesize*)

source: play the classical nim game with three heaps of sticks against the computer.
fr: jouez au classique jeu de *nim* avec trois piles de bâtons contre l'ordinateur.

source: turtles as nimsticks, event driven (mouse, keyboard)
fr: tortues en tant que bâtons de *nim*, géré par des événements (clavier et souris)

source: paint
fr: *paint* (peinture)

source: super minimalistic drawing program
fr: programme de dessin extra minimaliste

source: peace
fr: *peace* (paix)

source: elementary
fr: basique

source: turtle: appearance and animation
fr: tortue : apparence et animation

source: aperiodic tiling with kites and darts
fr: tuiles apériodiques avec cerfs-volants et fléchettes

source: planet_and_moon
fr: *planet_and_moon* (planète et lune)

source: simulation of gravitational system
fr: simulation d'un système gravitationnel

source: compound shapes, :class:`Vec2D`
fr: formes composées, :class:`Vec2D`

source: a pattern from the wikipedia article on turtle graphics
fr: un motif issu de l'article de *wikipedia* sur la tortue graphique

source: dancing turtles rotating pairwise in opposite direction
fr: tortues dansantes tournant par paires en sens inverse

source: compound shapes, clone shapesize, tilt, get_shapepoly, update
fr: formes composées, clones de la forme (*shapesize*), rotation, *get_shapepoly*, *update*

source: visual demonstration of different sorting methods
fr: démonstration visuelle des différentes méthodes de classement

source: simple alignment, randomization
fr: alignement simple, répartition aléatoire

source: tree
fr: *tree* (arbre)

source: a (graphical) breadth first tree (using generators)
fr: un arbre (tracé) par un parcours en largeur (à l’aide de générateurs)

source: two_canvases
fr: *two_canvases* (deux toiles)

source: simple design
fr: design simple

source: turtles on two canvases
fr: tortues sur deux canevas

source: another elementary example
fr: un autre exemple élémentaire

source: Have fun!
fr: Amusez-vous !

source: Changes since Python 2.6
fr: Modifications depuis Python 2.6

source: Changes since Python 3.0
fr: Modifications depuis Python 3.0

source: Two example scripts :file:`tdemo_nim.py` and :file:`tdemo_round_dance.py` have been added to the :file:`Lib/turtledemo` directory.
fr: Deux exemples de scripts :file:`tdemo_nim.py` et :file:`tdemo_round_dance.py` ont été ajoutés au répertoire :file:`Lib/turtledemo`.
