Repository: python/python-docs-fr
Catalog: library/turtle.po
Languages: fr

source: Make the turtle invisible. It's a good idea to do this while you're in the middle of doing some complex drawing, because hiding the turtle speeds up the drawing observably.
fr: Rend la tortue invisible. C'est recommandé lorsque vous êtes en train de faire un dessin complexe, vous observerez alors une accélération notable.

source: Make the turtle visible.
fr: Rend la tortue visible.

source: Return ``True`` if the Turtle is shown, ``False`` if it's hidden.
fr: Renvoie ``True`` si la tortue est visible, et ``False`` si elle est cachée.

source: a string which is a valid shapename
fr: une chaîne de caractères qui correspond à un nom de forme valide

source: Set turtle shape to shape with given *name* or, if name is not given, return name of current shape. Shape with *name* must exist in the TurtleScreen's shape dictionary. Initially there are the following polygon shapes: "arrow", "turtle", "circle", "square", "triangle", "classic". To learn about how to deal with shapes see Screen method :func:`register_shape`.
fr: La tortue prend la forme *name* donnée, ou, si *name* n'est pas donné, renvoie le nom de la forme actuelle. Le nom *name* donné doit exister dans le dictionnaire de formes de *TurtleScreen*. Initialement, il y a les polygones suivants : "*arrow*", "*turtle*", "*circle*", "*square*", "*triangle*", "*classic*". Pour en apprendre plus sur comment gérer les formes, voir la méthode de *Screen* :func:`register_shape`.

source: one of the strings "auto", "user", "noresize"
fr: l'une des chaînes suivantes : ``"auto"``, ``"user"``, ``"noresize"``

source: Set resizemode to one of the values: "auto", "user", "noresize". If *rmode* is not given, return current resizemode. Different resizemodes have the following effects:
fr: Définit *resizemode* à l'une des valeurs suivantes : "*auto*", "*user*", "*noresize*". Si "*rmode*" n'est pas donné, renvoie le *resizemode* actuel. Les différents *resizemode* ont les effets suivants :

source: "auto": adapts the appearance of the turtle corresponding to the value of pensize.
fr: *"auto"* : adapte l'apparence de la tortue en fonction de la largeur du stylo (*value of pensize* en anglais).

source: "user": adapts the appearance of the turtle according to the values of stretchfactor and outlinewidth (outline), which are set by :func:`shapesize`.
fr: *"user"* : adapte l'apparence de la tortue en fonction des valeurs du paramètre d'étirement et de la largeur des contours, déterminés par :func:`shapesize`.

source: "noresize": no adaption of the turtle's appearance takes place.
fr: *"noresize"* : il n'y a pas de modification de l'apparence de la tortue.

source: ``resizemode("user")`` is called by :func:`shapesize` when used with arguments.
fr: ``resizemode("user")`` est appelé par :func:`shapesize` quand utilisé sans arguments.

source: positive number
fr: nombre positif

source: number (optional)
fr: un nombre (facultatif)

source: Set or return the current shearfactor. Shear the turtleshape according to the given shearfactor shear, which is the tangent of the shear angle. Do *not* change the turtle's heading (direction of movement). If shear is not given: return the current shearfactor, i. e. the tangent of the shear angle, by which lines parallel to the heading of the turtle are sheared.
fr: Définit ou renvoie le paramétrage de cisaillement actuel. Déforme la tortue en fonction du paramètre *shear* donné, qui est la tangente de l'angle de cisaillement. Ne change pas le sens de déplacement de la tortue. Si le paramètre *shear* n'est pas indiqué, renvoie la valeur actuelle du cisaillement, c.-à-d. la valeur de la tangente de l'angle de cisaillement, celui par rapport auquel les lignes parallèles à la direction de la tortue sont cisaillées.

source: Rotate the turtleshape by *angle* from its current tilt-angle, but do *not* change the turtle's heading (direction of movement).
fr: Tourne la forme de la tortue de *angle* depuis son angle d'inclinaison actuel, mais *ne change pas* le cap de la tortue (direction du mouvement).

source: a number (optional)
fr: un nombre (facultatif)

source: Set or return the current tilt-angle. If angle is given, rotate the turtleshape to point in the direction specified by angle, regardless of its current tilt-angle. Do *not* change the turtle's heading (direction of movement). If angle is not given: return the current tilt-angle, i. e. the angle between the orientation of the turtleshape and the heading of the turtle (its direction of movement).
fr: Définit ou renvoie l'angle d'inclinaison actuel. Si l'angle est donné, la forme de la tortue est tournée pour pointer dans direction spécifiée par l'angle, indépendamment de son angle d'inclinaison actuel. *Ne change pas* le cap de la tortue (direction du mouvement). Si l'angle n'est pas donné, renvoie l'angle d'inclinaison actuel (L'angle entre l'orientation de la forme de la tortue et le cap de la tortue (sa direction de mouvement)).

source: Set or return the current transformation matrix of the turtle shape.
fr: Définit ou renvoie la matrice de transformation actuelle de la forme de la tortue.

source: If none of the matrix elements are given, return the transformation matrix as a tuple of 4 elements. Otherwise set the given elements and transform the turtleshape according to the matrix consisting of first row t11, t12 and second row t21, t22. The determinant t11 * t22 - t12 * t21 must not be zero, otherwise an error is raised. Modify stretchfactor, shearfactor and tiltangle according to the given matrix.
fr: Si aucun élément de la matrice n'est fourni, renvoie la matrice de transformation sous la forme d'un *n*-uplet à 4 éléments. Autrement, définit les éléments donnés et transforme la forme de la tortue conformément à la matrice dont la première ligne est t11, t12 et la deuxième ligne t21, t22. Le déterminant t11 * t22 - t12 * t21 ne doit pas être nul, sinon une erreur est levée. Cela modifie le facteur d'étirement, le facteur de cisaillement et l'angle d'inclinaison en fonction de la matrice donnée.

source: Return the current shape polygon as tuple of coordinate pairs. This can be used to define a new shape or components of a compound shape.
fr: Renvoie la forme actuelle du polygone en *n*-uplet de paires de coordonnées. Vous pouvez l'utiliser afin de définir une nouvelle forme ou en tant que composant pour une forme plus complexe.

source: a function with two arguments which will be called with the coordinates of the clicked point on the canvas
fr: une fonction à deux arguments qui sera appelée avec les coordonnées du point cliqué sur le canevas

source: number of the mouse-button, defaults to 1 (left mouse button)
fr: numéro du bouton de la souris, par défaut 1 (bouton de gauche)

source: ``True`` or ``False`` -- if ``True``, a new binding will be added, otherwise it will replace a former binding
fr: ``True`` ou ``False`` — si ``True``, un nouveau lien est ajouté, sinon il remplace un ancien lien

source: Bind *fun* to mouse-click events on this turtle. If *fun* is ``None``, existing bindings are removed. Example for the anonymous turtle, i.e. the procedural way:
fr: Crée un lien vers *fun* pour les événements de clics de la souris sur cette tortue. Si *fun* est ``None``, les liens existants sont supprimés. Exemple pour la tortue anonyme, c'est-à-dire la manière procédurale :

source: Bind *fun* to mouse-button-release events on this turtle. If *fun* is ``None``, existing bindings are removed.
fr: Crée un lien vers *fun* pour les événements de relâchement d'un clic de la souris sur cette tortue. Si *fun* est ``None``, les liens existants sont supprimés.

source: Bind *fun* to mouse-move events on this turtle. If *fun* is ``None``, existing bindings are removed.
fr: Crée un lien vers *fun* pour les événements de mouvement de la souris sur cette tortue. Si *fun* est ``None``, les liens existants sont supprimés.

source: Remark: Every sequence of mouse-move-events on a turtle is preceded by a mouse-click event on that turtle.
fr: Remarque : toutes les séquences d'événements de mouvement de la souris sur une tortue sont précédées par un événement de clic de la souris sur cette tortue.

source: Subsequently, clicking and dragging the Turtle will move it across the screen thereby producing handdrawings (if pen is down).
fr: Par la suite, un cliquer-glisser sur la tortue la fait se déplacer au travers de l'écran, produisant ainsi des dessins « à la main » (si le stylo est posé).

source: Start recording the vertices of a polygon. Current turtle position is first vertex of polygon.
fr: Démarre l'enregistrement des sommets d'un polygone. La position actuelle de la tortue est le premier sommet du polygone.

source: Stop recording the vertices of a polygon. Current turtle position is last vertex of polygon. This will be connected with the first vertex.
fr: Arrête l'enregistrement des sommets d'un polygone. La position actuelle de la tortue sera le dernier sommet du polygone. Il sera connecté au premier sommet.

source: Return the last recorded polygon.
fr: Renvoie le dernier polygone sauvegardé.

source: Create and return a clone of the turtle with same position, heading and turtle properties.
fr: Crée et renvoie un clone de la tortue avec les mêmes position, cap et propriétés.

source: Return the Turtle object itself. Only reasonable use: as a function to return the "anonymous turtle":
fr: Renvoie l'objet *Turtle* lui-même. Sa seule utilisation : comme fonction pour renvoyer la "tortue anonyme" :

source: Return the :class:`TurtleScreen` object the turtle is drawing on. TurtleScreen methods can then be called for that object.
fr: Renvoie l'objet :class:`TurtleScreen` sur lequel la tortue dessine. Les méthodes de TurtleScreen peuvent être appelées pour cet objet.

source: an integer or ``None``
fr: un entier ou ``None``

source: Set or disable undobuffer. If *size* is an integer, an empty undobuffer of given size is installed. *size* gives the maximum number of turtle actions that can be undone by the :func:`undo` method/function. If *size* is ``None``, the undobuffer is disabled.
fr: Définit ou désactive la mémoire d'annulation. Si *size* est un entier, une mémoire d'annulation de la taille donnée est installée. *size* donne le nombre maximum d'actions de la tortue qui peuvent être annulées par la fonction/méthode :func:`undo`. Si *size* est ``None``, la mémoire d'annulation est désactivée.

source: Return number of entries in the undobuffer.
fr: Renvoie le nombre d'entrées dans la mémoire d'annulation.

source: Compound shapes
fr: Formes composées

source: To use compound turtle shapes, which consist of several polygons of different color, you must use the helper class :class:`Shape` explicitly as described below:
fr: Pour utiliser des formes de tortues combinées, qui sont composées de polygones de différentes couleurs, vous devez utiliser la classe utilitaire :class:`Shape` explicitement comme décrit ci-dessous :

source: Create an empty Shape object of type "compound".
fr: Créez un objet Shape vide de type "compound".

source: For example:
fr: Par exemple :

source: Now add the Shape to the Screen's shapelist and use it:
fr: Maintenant ajoutez la *Shape* à la liste des formes de *Screen* et utilisez la :

source: The :class:`Shape` class is used internally by the :func:`register_shape` method in different ways. The application programmer has to deal with the Shape class *only* when using compound shapes like shown above!
fr: La classe :class:`Shape` est utilisée en interne par la méthode :func:`register_shape` de différentes façons. Le développeur n'interagit avec la classe Shape *que* lorsqu'il utilise des formes composées comme montré ci-dessus !

source: Methods of TurtleScreen/Screen and corresponding functions
fr: Méthodes de TurtleScreen/Screen et leurs fonctions correspondantes

source: Most of the examples in this section refer to a TurtleScreen instance called ``screen``.
fr: La plupart des exemples dans cette section font référence à une instance de TurtleScreen appelée ``screen``.

source: a color string or three numbers in the range 0..colormode or a 3-tuple of such numbers
fr: chaîne spécifiant une couleur ou trois nombres dans l'intervalle *0..colormode* ou *n*-uplet de ces trois nombres

source: Set or return background color of the TurtleScreen.
fr: Définit ou renvoie la couleur de fond de l'écran de la tortue (*TurtleScreen* en anglais).

source: a string, name of a gif-file or ``"nopic"``, or ``None``
fr: une chaîne de caractères, le nom d'un fichier *gif*, ou ``"nopic"``, ou ``None``

source: Set background image or return name of current backgroundimage. If *picname* is a filename, set the corresponding image as background. If *picname* is ``"nopic"``, delete background image, if present. If *picname* is ``None``, return the filename of the current backgroundimage. ::
fr: Définit l'image de fond ou renvoie l'image de fond actuelle. Si *picname* est un nom de fichier, cette image et mis en image de fond. Si *picname* est ``"nopic"``, l'image de fond sera supprimée si présente. SI *picname* est ``None``, le nom du fichier de l'image de fond actuelle est renvoyé. ::

source: This TurtleScreen method is available as a global function only under the name ``clearscreen``. The global function ``clear`` is a different one derived from the Turtle method ``clear``.
fr: Cette méthode TurtleScreen est disponible en tant que fonction globale seulement sous le nom ``clearscreen``. La fonction globale ``clear`` est une fonction différente dérivée de la méthode Turtle ``clear``.

source: Delete all drawings and all turtles from the TurtleScreen. Reset the now empty TurtleScreen to its initial state: white background, no background image, no event bindings and tracing on.
fr: Supprime tous les dessins et toutes les tortues du TurtleScreen. Réinitialise le TurtleScreen maintenant vide à son état initial : fond blanc, pas d'image de fond, pas d'événement liés, et traçage activé.

source: This TurtleScreen method is available as a global function only under the name ``resetscreen``. The global function ``reset`` is another one derived from the Turtle method ``reset``.
fr: Cette méthode TurtleScreen est disponible en tant que fonction globale seulement sous le nom ``resetscreen``. La fonction globale ``reset`` est une fonction différente dérivée de la méthode Turtle ``reset``.

source: Reset all Turtles on the Screen to their initial state.
fr: Remet toutes les tortues à l'écran dans leur état initial.

source: positive integer, new width of canvas in pixels
fr: nombre entier positif, nouvelle largeur du canevas (zone sur laquelle se déplace la tortue), en pixels

source: positive integer, new height of canvas in pixels
fr: nombre entier positif, nouvelle hauteur du canevas, en pixels

source: colorstring or color-tuple, new background color
fr: chaîne de caractères indiquant la couleur ou triplet de couleurs, nouvelle couleur de fond

source: If no arguments are given, return current (canvaswidth, canvasheight). Else resize the canvas the turtles are drawing on. Do not alter the drawing window. To observe hidden parts of the canvas, use the scrollbars. With this method, one can make visible those parts of a drawing which were outside the canvas before.
fr: Si aucun arguments ne sont passés, renvoie l'actuel *(canvaswidth, canvasheight)*. Sinon, redimensionne le canevas sur lequel les tortues dessinent. Ne modifiez pas la fenêtre de dessin. Pour observer les parties cachées du canevas, utilisez les barres de défilement. Avec cette méthode, on peut rendre visible les parties d'un dessin qui étaient en dehors du canevas précédemment.

source: e.g. to search for an erroneously escaped turtle ;-)
fr: par exemple, chercher une tortue échappée de manière erronée

source: a number, x-coordinate of lower left corner of canvas
fr: un nombre, coordonnée x du coin inférieur gauche du canevas

source: a number, y-coordinate of lower left corner of canvas
fr: un nombre, la coordonnée y du coin inférieur gauche du canevas

source: a number, x-coordinate of upper right corner of canvas
fr: un nombre, la coordonnée x du coin supérieur droit du canevas

source: a number, y-coordinate of upper right corner of canvas
fr: un nombre, la coordonnée y du coin supérieur droit du canevas

source: Set up user-defined coordinate system and switch to mode "world" if necessary. This performs a ``screen.reset()``. If mode "world" is already active, all drawings are redrawn according to the new coordinates.
fr: Configure un système de coordonnées défini par l'utilisateur et bascule vers le mode "world" si nécessaire. Cela effectuera un ``screen.reset()``. Si le mode "world" est déjà actif, tous les dessins sont re-déssinés par rapport aux nouveaux coordonnées.

source: **ATTENTION**: in user-defined coordinate systems angles may appear distorted.
fr: **ATTENTION** : dans les systèmes de coordonnées définis par l'utilisateur, les angles peuvent apparaître déformés.

source: positive integer
fr: entier positif

source: Set or return the drawing *delay* in milliseconds. (This is approximately the time interval between two consecutive canvas updates.) The longer the drawing delay, the slower the animation.
fr: Définit ou renvoie le délai (*delay*) de dessin en millisecondes. (Cet approximativement le temps passé entre deux mises à jour du canevas.) Plus le délai est long, plus l'animation sera lente.

source: Optional argument:
fr: Argument facultatif :

source: nonnegative integer
fr: entier non-négatif

source: Turn turtle animation on/off and set delay for update drawings. If *n* is given, only each n-th regular screen update is really performed. (Can be used to accelerate the drawing of complex graphics.) When called without arguments, returns the currently stored value of n. Second argument sets delay value (see :func:`delay`).
fr: Active/désactive les animations des tortues et définit le délai pour mettre à jour les dessins.Si *n* est passé, seulement les n-ièmes mises à jours régulières de l'écran seront vraiment effectuées. (Peut être utilisé pour accélérer le dessin de graphiques complexes.) Lorsqu'appelé sans arguments, renvoie la valeur actuelle de *n*. Le deuxième argument définit la valeur du délai (voir :func:`delay`).

source: Perform a TurtleScreen update. To be used when tracer is turned off.
fr: Effectue une mise à jour de *TurtleScreen*. À utiliser lorsque le traceur est désactivé.

source: See also the RawTurtle/Turtle method :func:`speed`.
fr: Voir aussi la méthode :func:`speed` de *RawTurtle*/*Turtle*.

source: Set focus on TurtleScreen (in order to collect key-events). Dummy arguments are provided in order to be able to pass :func:`listen` to the onclick method.
fr: Donne le focus à *TurtleScreen* (afin de collecter les événements clés). Des arguments factices sont fournis afin de pouvoir passer :func:`listen` à la méthode *onclick*.

source: a function with no arguments or ``None``
fr: une fonction sans arguments ou ``None``

source: a string: key (e.g. "a") or key-symbol (e.g. "space")
fr: une chaîne : clé (par exemple "*a*") ou clé symbole (Par exemple "*space*")

source: Bind *fun* to key-release event of key. If *fun* is ``None``, event bindings are removed. Remark: in order to be able to register key-events, TurtleScreen must have the focus. (See method :func:`listen`.)
fr: Lie *fun* à l'événement d'un relâchement d'une touche. Si *fun* est ``None``, les événements liés sont supprimés. Remarque : Pour pouvoir enregistrer les événements lié au touches, TurtleScreen doit avoir le *focus* (fenêtre en premier plan). (Voir la méthode :func:`listen`.)

source: Bind *fun* to key-press event of key if key is given, or to any key-press-event if no key is given. Remark: in order to be able to register key-events, TurtleScreen must have focus. (See method :func:`listen`.)
fr: Lie *fun* à l'événement d'un pressement de touche si *key* (touche) est donné, ou n'importe quelle touche si aucune touche n'est passée. Remarque : Pour pouvoir enregistrer des événements liés au touches, TurtleScreen doit être en premier plan. (voir la méthode :func:`listen`.)

source: Bind *fun* to mouse-click events on this screen. If *fun* is ``None``, existing bindings are removed.
fr: Crée un lien vers *fun* pour les événements de clique de la souris sur cet écran. Si *fun* est ``None``, les liens existants sont supprimés.

source: Example for a TurtleScreen instance named ``screen`` and a Turtle instance named ``turtle``:
fr: Exemple pour une instance de TurtleScreen nommée ``screen`` et une instance Turtle nommée ``turtle`` :

source: This TurtleScreen method is available as a global function only under the name ``onscreenclick``. The global function ``onclick`` is another one derived from the Turtle method ``onclick``.
fr: Cette méthode de TurtleScreen est disponible en tant que fonction globale seulement sous le nom de ``onscreenclick``. La fonction globale ``onclick`` est une autre fonction dérivée de la méthode Turtle ``onclick``.

source: a function with no arguments
fr: une fonction sans arguments

source: a number >= 0
fr: un nombre supérieur ou égal à 0

source: Install a timer that calls *fun* after *t* milliseconds.
fr: Installe un minuteur qui appelle *fun* après *t* millisecondes.

source: Starts event loop - calling Tkinter's mainloop function. Must be the last statement in a turtle graphics program. Must *not* be used if a script is run from within IDLE in -n mode (No subprocess) - for interactive use of turtle graphics. ::
fr: Démarre la boucle d'événements - appelle la boucle principale de Tkinter. Doit être la dernière opération dan un programme graphique *turtle*. **Ne dois pas** être utilisé si un script est lancé depuis IDLE avec le mode ``-n`` (pas de sous processus) - pour une utilisation interactive des graphiques *turtle* ::

source: string
fr: chaîne de caractères

source: Pop up a dialog window for input of a string. Parameter title is the title of the dialog window, prompt is a text mostly describing what information to input. Return the string input. If the dialog is canceled, return ``None``. ::
fr: Fait apparaitre une fenêtre pour entrer une chaine de caractères. Le paramètre *title* est le titre de la fenêtre, *prompt* est le texte expliquant quelle information écrire. Renvoie l'entrée utilisateur sous forme de chaîne. Si le dialogue est annulé, renvoie ``None``. ::

source: one of the strings "standard", "logo" or "world"
fr: l'une des chaînes de caractères : ``"standard"``, ``"logo"`` ou ``"world"``

source: Set turtle mode ("standard", "logo" or "world") and perform reset. If mode is not given, current mode is returned.
fr: Règle le mode de la tortue ("*standard*", "*logo*" ou "*world*") et la réinitialise. Si le mode n'est pas donné, le mode actuel est renvoyé.

source: Mode "standard" is compatible with old :mod:`turtle`. Mode "logo" is compatible with most Logo turtle graphics. Mode "world" uses user-defined "world coordinates". **Attention**: in this mode angles appear distorted if ``x/y`` unit-ratio doesn't equal 1.
fr: Le mode "*standard*" est compatible avec l'ancien :mod:`turtle`. Le mode "*logo*" est compatible avec la plupart des graphiques *turtle* Logo. Le mode "*world*" utilise des "coordonnées monde" (*world coordinates*) définis par l'utilisateur. **Attention** : Dans ce mode, les angles apparaissent déformés si le ratio unitaire de ``x/y`` n'est pas 1.

source: Initial turtle heading
fr: Orientation initiale de la tortue

source: positive angles
fr: angles positifs

source: to the right (east)
fr: vers la droite (vers l'Est)

source: counterclockwise
fr: dans le sens inverse des aiguilles d'une montre

source: upward (north)
fr: vers le haut (vers le Nord)

source: clockwise
fr: dans le sens des aiguilles d'une montre

source: one of the values 1.0 or 255
fr: l'une des valeurs suivantes : 1.0 ou 255
