Repository: python/python-docs-fr
Catalog: library/typing.po
Languages: fr

source: ``Type[Any]`` is equivalent to ``Type`` which in turn is equivalent to ``type``, which is the root of Python's metaclass hierarchy.
fr: ``Type[Any]`` est équivalent à ``Type`` qui à son tour est équivalent à ``type``, qui est la racine de la hiérarchie des métaclasses de Python.

source: A type that can be used to indicate to type checkers that the corresponding variable or function parameter has a value equivalent to the provided literal (or one of several literals). For example::
fr: Type pour indiquer aux vérificateurs de type que la variable ou le paramètre de fonction correspondant a une valeur équivalente au littéral fourni (ou un parmi plusieurs littéraux). Par exemple ::

source: ``Literal[...]`` cannot be subclassed. At runtime, an arbitrary value is allowed as type argument to ``Literal[...]``, but type checkers may impose restrictions. See :pep:`586` for more details about literal types.
fr: ``Literal[...]`` ne peut être sous-classé. Lors de l'exécution, une valeur arbitraire est autorisée comme argument de type pour ``Literal[...]``, mais les vérificateurs de type peuvent imposer des restrictions. Voir la :pep:`586` pour plus de détails sur les types littéraux.

source: Special type construct to mark class variables.
fr: Construction de type particulière pour indiquer les variables de classe.

source: As introduced in :pep:`526`, a variable annotation wrapped in ClassVar indicates that a given attribute is intended to be used as a class variable and should not be set on instances of that class. Usage::
fr: Telle qu'introduite dans la :pep:`526`, une annotation de variable enveloppée dans ClassVar indique qu'un attribut donné est destiné à être utilisé comme une variable de classe et ne doit pas être défini sur des instances de cette classe. Utilisation ::

source: :data:`ClassVar` accepts only types and cannot be further subscribed.
fr: :data:`ClassVar` n'accepte que les types et ne peut plus être dérivé.

source: :data:`ClassVar` is not a class itself, and should not be used with :func:`isinstance` or :func:`issubclass`. :data:`ClassVar` does not change Python runtime behavior, but it can be used by third-party type checkers. For example, a type checker might flag the following code as an error::
fr: :data:`ClassVar` n'est pas une classe en soi, et ne devrait pas être utilisée avec :func:`isinstance` ou :func:`issubclass`. :data:`ClassVar` ne modifie pas le comportement d'exécution Python, mais il peut être utilisé par des vérificateurs tiers. Par exemple, un vérificateur de type peut marquer le code suivant comme une erreur ::

source: A special typing construct to indicate to type checkers that a name cannot be re-assigned or overridden in a subclass. For example::
fr: Construction de type particulière pour indiquer aux vérificateurs de type qu'un nom ne peut pas être réassigné ou remplacé dans une sous-classe. Par exemple ::

source: There is no runtime checking of these properties. See :pep:`591` for more details.
fr: Ces propriétés ne sont pas vérifiées à l'exécution. Voir la :pep:`591` pour plus de détails.

source: Abstract base class for generic types.
fr: Classe de base abstraite pour les types génériques.

source: A generic type is typically declared by inheriting from an instantiation of this class with one or more type variables. For example, a generic mapping type might be defined as::
fr: Un type générique est généralement déclaré en héritant d'une instanciation de cette classe avec une ou plusieurs variables de type. Par exemple, un type de correspondance générique peut être défini comme suit ::

source: This class can then be used as follows::
fr: Cette classe peut alors être utilisée comme suit ::

source: Type variable.
fr: Variables de type.

source: Usage::
fr: Utilisation ::

source: The latter example's signature is essentially the overloading of ``(str, str) -> str`` and ``(bytes, bytes) -> bytes``. Also note that if the arguments are instances of some subclass of :class:`str`, the return type is still plain :class:`str`.
fr: La signature de ce dernier exemple est essentiellement la surcharge de ``(str, str) -> str`` et ``(bytes, bytes) -> bytes``. Notez également que si les arguments sont des instances d'une sous-classe de la classe :class:`str`, le type de retour est toujours la classe :class:`str`.

source: At runtime, ``isinstance(x, T)`` will raise :exc:`TypeError`. In general, :func:`isinstance` and :func:`issubclass` should not be used with types.
fr: Au moment de l'exécution, ``isinstance(x, T)`` va lever :exc:`TypeError`. En général, :func:`isinstance` et :func:`issubclass` ne devraient pas être utilisés avec les types.

source: Type variables may be marked covariant or contravariant by passing ``covariant=True`` or ``contravariant=True``. See :pep:`484` for more details. By default type variables are invariant. Alternatively, a type variable may specify an upper bound using ``bound=<type>``. This means that an actual type substituted (explicitly or implicitly) for the type variable must be a subclass of the boundary type, see :pep:`484`.
fr: Les variables de type peuvent être marquées covariantes ou contravariantes en passant ``covariant=True`` ou ``contravariant=True``. Voir la :pep:`484` pour plus de détails. Par défaut, les variables de type sont invariantes. Sinon, une variable de type peut spécifier une limite supérieure en utilisant ``bound=<type>``. Cela signifie qu'un type réel substitué (explicitement ou implicitement) à la variable type doit être une sous-classe du type frontière (*boundary* en anglais), voir la :pep:`484`.

source: ``AnyStr`` is a type variable defined as ``AnyStr = TypeVar('AnyStr', str, bytes)``.
fr: ``AnyStr`` est une variable de type définie comme ``AnyStr = TypeVar('AnyStr', str, bytes)``.

source: It is meant to be used for functions that may accept any kind of string without allowing different kinds of strings to mix. For example::
fr: Cela est destiné à être utilisé pour des fonctions qui peuvent accepter n'importe quel type de chaîne de caractères sans permettre à différents types de chaînes de caractères de se mélanger. Par exemple ::

source: Base class for protocol classes. Protocol classes are defined like this::
fr: Classe de base pour les classes de protocole. Les classes de protocole sont définies comme suit ::

source: Such classes are primarily used with static type checkers that recognize structural subtyping (static duck-typing), for example::
fr: Ces classes sont principalement utilisées avec les vérificateurs statiques de type qui reconnaissent les sous-types structurels (typage canard statique), par exemple ::

source: See :pep:`544` for details. Protocol classes decorated with :func:`runtime_checkable` (described later) act as simple-minded runtime protocols that check only the presence of given attributes, ignoring their type signatures.
fr: Voir la :pep:`544` pour plus de détails. Les classes de protocole décorées avec :func:`runtime_checkable` (décrite plus loin) agissent comme des protocoles d'exécution simples qui ne vérifient que la présence d'attributs donnés, ignorant leurs signatures de type.

source: Protocol classes can be generic, for example::
fr: Les classes de protocole peuvent être génériques, par exemple ::

source: Mark a protocol class as a runtime protocol.
fr: Marquez une classe de protocole comme protocole d'exécution.

source: Typed version of :func:`collections.namedtuple`.
fr: Version typée de :func:`collections.namedtuple`.

source: This is equivalent to::
fr: Ce qui est équivalent à ::

source: To give a field a default value, you can assign to it in the class body::
fr: Pour assigner une valeur par défaut à un champ, vous pouvez lui donner dans le corps de classe ::

source: Fields with a default value must come after any fields without a default.
fr: Les champs avec une valeur par défaut doivent venir après tous les champs sans valeur par défaut.

source: The resulting class has an extra attribute ``__annotations__`` giving a dict that maps the field names to the field types. (The field names are in the ``_fields`` attribute and the default values are in the ``_field_defaults`` attribute both of which are part of the namedtuple API.)
fr: La classe résultante a un attribut supplémentaire ``__annotations__`` donnant un dictionnaire qui associe les noms des champs aux types de champs. (Les noms des champs sont dans l'attribut ``_fields`` et les valeurs par défaut sont dans l'attribut ``_field_defaults`` qui font partie de l'API *namedtuple*.)

source: ``NamedTuple`` subclasses can also have docstrings and methods::
fr: Les sous-classes de ``NamedTuple`` peuvent aussi avoir des *docstrings* et des méthodes ::

source: Backward-compatible usage::
fr: Utilisation rétrocompatible ::

source: Added support for :pep:`526` variable annotation syntax.
fr: Ajout de la gestion de la syntaxe d'annotation variable de la :pep:`526`.

source: Added support for default values, methods, and docstrings.
fr: Ajout de la prise en charge des valeurs par défaut, des méthodes et des chaînes de caractères *docstrings*.

source: The ``_field_types`` and ``__annotations__`` attributes are now regular dictionaries instead of instances of ``OrderedDict``.
fr: Les attributs ``_field_types`` et ``__annotations__`` sont maintenant des dictionnaires standards au lieu d'instances de ``OrderedDict``.

source: The type info for introspection can be accessed via ``Point2D.__annotations__`` and ``Point2D.__total__``. To allow using this feature with older versions of Python that do not support :pep:`526`, ``TypedDict`` supports two additional equivalent syntactic forms::
fr: Les informations de type pour l'introspection sont accessibles via ``Point2D.__annotations__`` et ``Point2D.__total__``. Pour permettre l'utilisation de cette fonctionnalité avec les anciennes versions de Python qui ne prennent pas en compte la :pep:`526`, ``TypedDict`` gère deux formes syntaxiques équivalentes supplémentaires ::

source: A generic version of :class:`dict`. Useful for annotating return types. To annotate arguments it is preferred to use an abstract collection type such as :class:`Mapping`.
fr: Une version générique de :class:`dict`. Utile pour annoter les types de retour. Pour annoter les arguments, il est préférable d'utiliser un type de collection abstraite tel que :class:`Mapping`.

source: This type can be used as follows::
fr: Ce type peut être utilisé comme suit ::

source: Generic version of :class:`list`. Useful for annotating return types. To annotate arguments it is preferred to use an abstract collection type such as :class:`Sequence` or :class:`Iterable`.
fr: Version générique de :class:`list`. Utile pour annoter les types de retour. Pour annoter les arguments, il est préférable d'utiliser un type de collection abstraite tel que :class:`Sequence` ou :class:`Iterable`.

source: This type may be used as follows::
fr: Ce type peut être utilisé comme suit ::

source: A generic version of :class:`builtins.set <set>`. Useful for annotating return types. To annotate arguments it is preferred to use an abstract collection type such as :class:`AbstractSet`.
fr: Une version générique de :class:`builtins.set <set>`. Utile pour annoter les types de retour. Pour annoter les arguments, il est préférable d'utiliser un type de collection abstraite tel que :class:`AbstractSet`.

source: A generic version of :class:`builtins.frozenset <frozenset>`.
fr: Une version générique de :class:`builtins.frozenset <frozenset>`.

source: A generic version of :class:`collections.defaultdict`.
fr: Une version générique de :class:`collections.defaultdict`.

source: A generic version of :class:`collections.OrderedDict`.
fr: Une version générique de :class:`collections.OrderedDict`.

source: A generic version of :class:`collections.ChainMap`.
fr: Une version générique de :class:`collections.ChainMap`.

source: A generic version of :class:`collections.Counter`.
fr: Une version générique de :class:`collections.Counter`.

source: A generic version of :class:`collections.deque`.
fr: Une version générique de :class:`collections.deque`.

source: ``Text`` is an alias for ``str``. It is provided to supply a forward compatible path for Python 2 code: in Python 2, ``Text`` is an alias for ``unicode``.
fr: ``Text`` est un alias pour ``str``. Il est fourni pour obtenir une compatibilité ascendante du code Python 2 : en Python 2, ``Text`` est un alias pour ``unicode``.

source: Use ``Text`` to indicate that a value must contain a unicode string in a manner that is compatible with both Python 2 and Python 3::
fr: Utilisez ``Text`` pour indiquer qu'une valeur doit contenir une chaîne Unicode d'une manière compatible avec Python 2 et Python 3 ::

source: A generic version of :class:`collections.abc.Set`.
fr: Une version générique de :class:`collections.abc.Set`.

source: A generic version of :class:`collections.abc.ByteString`.
fr: Une version générique de :class:`collections.abc.ByteString`.

source: As a shorthand for this type, :class:`bytes` can be used to annotate arguments of any of the types mentioned above.
fr: Comme abréviation pour ce type, :class:`bytes` peut être utilisé pour annoter des arguments de n'importe quel type mentionné ci-dessus.

source: A generic version of :class:`collections.abc.Collection`
fr: Une version générique de :class:`collections.abc.Collection`

source: A generic version of :class:`collections.abc.Container`.
fr: Une version générique de :class:`collections.abc.Container`.

source: A generic version of :class:`collections.abc.ItemsView`.
fr: Une version générique de :class:`collections.abc.ItemsView`.

source: A generic version of :class:`collections.abc.KeysView`.
fr: Une version générique de :class:`collections.abc.KeysView`.

source: A generic version of :class:`collections.abc.Mapping`. This type can be used as follows::
fr: Une version générique de :class:`collections.abc.Mapping`. Ce type peut être utilisé comme suit ::

source: A generic version of :class:`collections.abc.MappingView`.
fr: Une version générique de :class:`collections.abc.MappingView`.

source: A generic version of :class:`collections.abc.MutableMapping`.
fr: Une version générique de :class:`collections.abc.MutableMapping`.

source: A generic version of :class:`collections.abc.MutableSequence`.
fr: Une version générique de :class:`collections.abc.MutableSequence`.

source: A generic version of :class:`collections.abc.MutableSet`.
fr: Une version générique de :class:`collections.abc.MutableSet`.

source: A generic version of :class:`collections.abc.Sequence`.
fr: Une version générique de :class:`collections.abc.Sequence`.

source: A generic version of :class:`collections.abc.ValuesView`.
fr: Une version générique de :class:`collections.abc.ValuesView`.

source: A generic version of :class:`collections.abc.Iterable`.
fr: Une version générique de :class:`collections.abc.Iterable`.

source: A generic version of :class:`collections.abc.Iterator`.
fr: Une version générique de :class:`collections.abc.Iterator`.

source: A generator can be annotated by the generic type ``Generator[YieldType, SendType, ReturnType]``. For example::
fr: Un générateur peut être annoté par le type générique ``Generator[YieldType, SendType, ReturnType]``. Par exemple ::

source: Note that unlike many other generics in the typing module, the ``SendType`` of :class:`Generator` behaves contravariantly, not covariantly or invariantly.
fr: Notez que contrairement à beaucoup d'autres génériques dans le module *typing*, le ``SendType`` de :class:`Generator` se comporte de manière contravariante, pas de manière covariante ou invariante.

source: If your generator will only yield values, set the ``SendType`` and ``ReturnType`` to ``None``::
fr: Si votre générateur ne donne que des valeurs, réglez les paramètres ``SendType`` et ``ReturnType`` sur ``None`` ::

source: Alternatively, annotate your generator as having a return type of either ``Iterable[YieldType]`` or ``Iterator[YieldType]``::
fr: Alternativement, annotez votre générateur comme ayant un type de retour soit ``Iterable[YieldType]`` ou ``Iterator[YieldType]`` ::

source: An alias to :class:`collections.abc.Hashable`
fr: Un alias pour :class:`collections.abc.Hashable`

source: A generic version of :class:`collections.abc.Reversible`.
fr: Une version générique de :class:`collections.abc.Reversible`.

source: An alias to :class:`collections.abc.Sized`
fr: Un alias pour :class:`collections.abc.Sized`

source: A generic version of :class:`collections.abc.Coroutine`. The variance and order of type variables correspond to those of :class:`Generator`, for example::
fr: Une version générique de :class:`collections.abc.Coroutine`. La variance et l'ordre des variables de type correspondent à ceux de la classe :class:`Generator`, par exemple ::

source: An async generator can be annotated by the generic type ``AsyncGenerator[YieldType, SendType]``. For example::
fr: Un générateur asynchrone peut être annoté par le type générique ``AsyncGenerator[YieldType, SendType]``. Par exemple ::

source: Unlike normal generators, async generators cannot return a value, so there is no ``ReturnType`` type parameter. As with :class:`Generator`, the ``SendType`` behaves contravariantly.
fr: Contrairement aux générateurs normaux, les générateurs asynchrones ne peuvent pas renvoyer une valeur, il n'y a donc pas de paramètre de type ``ReturnType``. Comme avec :class:`Generator`, le ``SendType`` se comporte de manière contravariante.

source: If your generator will only yield values, set the ``SendType`` to ``None``::
fr: Si votre générateur ne donne que des valeurs, réglez le paramètre ``SendType`` sur ``None`` ::

source: Alternatively, annotate your generator as having a return type of either ``AsyncIterable[YieldType]`` or ``AsyncIterator[YieldType]``::
fr: Alternativement, annotez votre générateur comme ayant un type de retour soit ``AsyncIterable[YieldType]`` ou ``AsyncIterator[YieldType]`` ::

source: A generic version of :class:`collections.abc.AsyncIterable`.
fr: Une version générique de :class:`collections.abc.AsyncIterable`.

source: A generic version of :class:`collections.abc.AsyncIterator`.
fr: Une version générique de :class:`collections.abc.AsyncIterator`.

source: A generic version of :class:`collections.abc.Awaitable`.
fr: Une version générique de :class:`collections.abc.Awaitable`.

source: A generic version of :class:`contextlib.AbstractContextManager`.
fr: Une version générique de :class:`contextlib.AbstractContextManager`.

source: A generic version of :class:`contextlib.AbstractAsyncContextManager`.
fr: Une version générique de :class:`contextlib.AbstractAsyncContextManager`.

source: An ABC with one abstract method ``__abs__`` that is covariant in its return type.
fr: Une ABC avec une méthode abstraite ``__abs__`` qui est covariante dans son type de retour.

source: An ABC with one abstract method ``__bytes__``.
fr: Une ABC avec une méthode abstraite ``__bytes__``.

source: An ABC with one abstract method ``__complex__``.
fr: Une ABC avec une méthode abstraite ``__complex__``.

source: An ABC with one abstract method ``__float__``.
fr: Une ABC avec une méthode abstraite ``__float__``.

source: An ABC with one abstract method ``__index__``.
fr: Une ABC avec une méthode abstraite ``__index__``.

source: An ABC with one abstract method ``__int__``.
fr: Une ABC avec une méthode abstraite ``__int__``.

source: An ABC with one abstract method ``__round__`` that is covariant in its return type.
fr: Une ABC avec une méthode abstraite ``__round__`` qui est covariante dans son type de retour.

source: Cast a value to a type.
fr: Convertit une valeur en un type.

source: This returns the value unchanged. To the type checker this signals that the return value has the designated type, but at runtime we intentionally don't check anything (we want this to be as fast as possible).
fr: Ceci renvoie la valeur inchangée. Pour le vérificateur de type, cela signifie que la valeur de retour a le type désigné mais, à l'exécution, intentionnellement, rien n'est vérifié (afin que cela soit aussi rapide que possible).

source: The ``@overload`` decorator allows describing functions and methods that support multiple different combinations of argument types. A series of ``@overload``-decorated definitions must be followed by exactly one non-``@overload``-decorated definition (for the same function/method). The ``@overload``-decorated definitions are for the benefit of the type checker only, since they will be overwritten by the non-``@overload``-decorated definition, while the latter is used at runtime but should be ignored by a type checker. At runtime, calling a ``@overload``-decorated function directly will raise :exc:`NotImplementedError`. An example of overload that gives a more precise type than can be expressed using a union or a type variable::
fr: Le décorateur ``@overload``` permet de décrire des fonctions et des méthodes qui acceptent plusieurs combinaisons différentes de types d'arguments. Une série de définitions décorées avec ``overload`` doit être suivie d'une seule définition non décorée de ``overload`` (pour la même fonction/méthode). Les définitions décorées de ``@overload`` ne sont destinées qu'au vérificateur de type, puisqu'elles sont écrasées par la définition non décorée de ``@overload`` ; cette dernière, en revanche, est utilisée à l'exécution mais qu'il convient que le vérificateur de type l'ignore. Lors de l'exécution, l'appel direct d'une fonction décorée avec ``@overload`` lèvera :exc:`NotImplementedError`. Un exemple de surcharge qui donne un type plus précis que celui qui peut être exprimé à l'aide d'une variable union ou type ::

source: See :pep:`484` for details and comparison with other typing semantics.
fr: Voir la :pep:`484` pour plus de détails et la comparaison avec d'autres sémantiques de typage.

source: A decorator to indicate to type checkers that the decorated method cannot be overridden, and the decorated class cannot be subclassed. For example::
fr: Un décorateur pour indiquer aux vérificateurs de types que la méthode décorée ne peut pas être remplacée et que la classe décorée ne peut pas être sous-classée. Par exemple ::

source: Decorator to indicate that annotations are not type hints.
fr: Décorateur pour indiquer que les annotations ne sont pas des indications de type.

source: This works as class or function :term:`decorator`. With a class, it applies recursively to all methods defined in that class (but not to methods defined in its superclasses or subclasses).
fr: Cela fonctionne en tant que classe ou fonction :term:`décoratrice <decorator>`. Avec une classe, elle s'applique récursivement à toutes les méthodes définies dans cette classe (mais pas aux méthodes définies dans ses superclasses ou sous-classes).

source: This mutates the function(s) in place.
fr: Cela fait muter la ou les fonctions en place.

source: Decorator to give another decorator the :func:`no_type_check` effect.
fr: Décorateur pour donner à un autre décorateur l'effet :func:`no_type_check`.

source: This wraps the decorator with something that wraps the decorated function in :func:`no_type_check`.
fr: Ceci enveloppe le décorateur avec quelque chose qui enveloppe la fonction décorée dans :func:`no_type_check`.

source: Decorator to mark a class or function to be unavailable at runtime.
fr: Décorateur pour marquer une classe ou une fonction comme étant indisponible au moment de l'exécution.
