Repository: python/python-docs-fr
Catalog: library/typing.po
Languages: fr

source: :mod:`typing` --- Support for type hints
fr: :mod:`typing` — Prise en charge des annotations de type

source: **Source code:** :source:`Lib/typing.py`
fr: **Code source :** :source:`Lib/typing.py`

source: The Python runtime does not enforce function and variable type annotations. They can be used by third party tools such as type checkers, IDEs, linters, etc.
fr: Le moteur d'exécution Python n'applique pas les annotations de type pour les fonctions et les variables. Elles peuvent être utilisées par des outils tiers tels que les contrôleurs de type, les IDE, les analyseurs de code, etc.

source: This module provides runtime support for type hints as specified by :pep:`484`, :pep:`526`, :pep:`544`, :pep:`586`, :pep:`589`, and :pep:`591`. The most fundamental support consists of the types :data:`Any`, :data:`Union`, :data:`Tuple`, :data:`Callable`, :class:`TypeVar`, and :class:`Generic`. For full specification please see :pep:`484`. For a simplified introduction to type hints see :pep:`483`.
fr: Ce module fournit la gestion des annotations de type à l'exécution conformément à ce qui est spécifié dans les :pep:`484`, :pep:`526`, :pep:`544`, :pep:`586`, :pep:`589` et :pep:`591`. Le support le plus fondamental se compose des types :data:`Any`, :data:`Union`, :data:`Tuple`, :data:`Callable`, :class:`TypeVar` et :class:`Generic`. Pour les spécifications complètes, voir la :pep:`484`. Pour une introduction simplifiée aux annotations de type, voir la :pep:`483`.

source: The function below takes and returns a string and is annotated as follows::
fr: La fonction ci-dessous prend et renvoie une chaîne de caractères, et est annotée comme suit ::

source: In the function ``greeting``, the argument ``name`` is expected to be of type :class:`str` and the return type :class:`str`. Subtypes are accepted as arguments.
fr: La fonction ``greeting`` s'attend à ce que l'argument ``name`` soit de type :class:`str` et le type de retour :class:`str`. Les sous-types sont acceptés comme arguments.

source: Type aliases
fr: Alias de type

source: Type aliases are useful for simplifying complex type signatures. For example::
fr: Les alias de type sont utiles pour simplifier les signatures complexes. Par exemple ::

source: Note that ``None`` as a type hint is a special case and is replaced by ``type(None)``.
fr: Notez que ``None`` comme indication de type est un cas particulier et est remplacé par ``type(None)``.

source: Use the :func:`NewType` helper function to create distinct types::
fr: Aidez-vous de la fonction :func:`NewType` pour créer des types distincts ::

source: The static type checker will treat the new type as if it were a subclass of the original type. This is useful in helping catch logical errors::
fr: Le vérificateur de type statique traite le nouveau type comme s'il s'agissait d'une sous-classe du type original. C'est utile pour aider à détecter les erreurs logiques ::

source: You may still perform all ``int`` operations on a variable of type ``UserId``, but the result will always be of type ``int``. This lets you pass in a ``UserId`` wherever an ``int`` might be expected, but will prevent you from accidentally creating a ``UserId`` in an invalid way::
fr: Vous pouvez toujours effectuer toutes les opérations applicables à un entier (type ``int``) sur une variable de type ``UserId``, mais le résultat sera toujours de type ``int``. Ceci vous permet de passer un ``UserId`` partout où un ``int`` est attendu, mais vous empêche de créer accidentellement un ``UserId`` d'une manière invalide ::

source: Note that these checks are enforced only by the static type checker. At runtime, the statement ``Derived = NewType('Derived', Base)`` will make ``Derived`` a function that immediately returns whatever parameter you pass it. That means the expression ``Derived(some_value)`` does not create a new class or introduce any overhead beyond that of a regular function call.
fr: Notez que ces contrôles ne sont exécutés que par le vérificateur de type statique. À l'exécution, l'instruction ``Derived = NewType('Derived', Base)`` fait de ``Derived`` une fonction qui renvoie immédiatement le paramètre que vous lui passez. Cela signifie que l'expression ``Derived(some_value)`` ne crée pas une nouvelle classe ou n'introduit pas de surcharge au-delà de celle d'un appel de fonction normal.

source: More precisely, the expression ``some_value is Derived(some_value)`` is always true at runtime.
fr: Plus précisément, l'expression ``some_value is Derived(some_value)`` est toujours vraie au moment de l'exécution.

source: This also means that it is not possible to create a subtype of ``Derived`` since it is an identity function at runtime, not an actual type::
fr: Cela signifie également qu'il n'est pas possible de créer un sous-type de ``Derived`` puisqu'il s'agit d'une fonction d'identité au moment de l'exécution, pas d'un type réel ::

source: However, it is possible to create a :func:`NewType` based on a 'derived' ``NewType``::
fr: Cependant, il est possible de créer un :func:`NewType` basé sur un ``NewType`` « dérivé » ::

source: and typechecking for ``ProUserId`` will work as expected.
fr: et la vérification de type pour ``ProUserId`` fonctionne comme prévu.

source: See :pep:`484` for more details.
fr: Voir la :pep:`484` pour plus de détails.

source: Recall that the use of a type alias declares two types to be *equivalent* to one another. Doing ``Alias = Original`` will make the static type checker treat ``Alias`` as being *exactly equivalent* to ``Original`` in all cases. This is useful when you want to simplify complex type signatures.
fr: Rappelons que l'utilisation d'un alias de type déclare que deux types sont *équivalents* l'un à l'autre. Écrire ``Alias = Original`` fait que le vérificateur de type statique traite ``Alias`` comme étant *exactement équivalent* à ``Original`` dans tous les cas. C'est utile lorsque vous voulez simplifier des signatures complexes.

source: In contrast, ``NewType`` declares one type to be a *subtype* of another. Doing ``Derived = NewType('Derived', Original)`` will make the static type checker treat ``Derived`` as a *subclass* of ``Original``, which means a value of type ``Original`` cannot be used in places where a value of type ``Derived`` is expected. This is useful when you want to prevent logic errors with minimal runtime cost.
fr: En revanche, ``NewType`` déclare qu'un type est un *sous-type* d'un autre. Écrire ``Derived = NewType('Derived', Original)`` fait en sorte que le vérificateur de type statique traite ``Derived`` comme une *sous-classe* de ``Original``, ce qui signifie qu'une valeur de type ``Original`` ne peut être utilisée dans les endroits où une valeur de type ``Derived`` est prévue. C'est utile lorsque vous voulez éviter les erreurs logiques avec un coût d'exécution minimal.

source: Callable
fr: Appelable

source: Frameworks expecting callback functions of specific signatures might be type hinted using ``Callable[[Arg1Type, Arg2Type], ReturnType]``.
fr: Les cadriciels (*frameworks* en anglais) qui attendent des fonctions de rappel ayant des signatures spécifiques peuvent être typés en utilisant ``Callable[[Arg1Type, Arg2Type], ReturnType]``.

source: For example::
fr: Par exemple ::

source: It is possible to declare the return type of a callable without specifying the call signature by substituting a literal ellipsis for the list of arguments in the type hint: ``Callable[..., ReturnType]``.
fr: Il est possible de déclarer le type de retour d'un appelable sans spécifier la signature de l'appel en indiquant des points de suspension à la liste des arguments dans l'indice de type : ``Callable[..., ReturnType]``.

source: Generics
fr: Génériques

source: Since type information about objects kept in containers cannot be statically inferred in a generic way, abstract base classes have been extended to support subscription to denote expected types for container elements.
fr: Comme les informations de type sur les objets conservés dans des conteneurs ne peuvent pas être déduites statiquement de manière générique, les classes de base abstraites ont été étendues pour prendre en charge la sélection (*subscription* en anglais) et indiquer les types attendus pour les éléments de conteneur.

source: Generics can be parameterized by using a new factory available in typing called :class:`TypeVar`.
fr: Les génériques peuvent être paramétrés en utilisant une nouvelle fabrique (au sens des patrons de conception) disponible en tapant :class:`TypeVar`.

source: User-defined generic types
fr: Types génériques définis par l'utilisateur

source: A user-defined class can be defined as a generic class.
fr: Une classe définie par l'utilisateur peut être définie comme une classe générique.

source: ``Generic[T]`` as a base class defines that the class ``LoggedVar`` takes a single type parameter ``T`` . This also makes ``T`` valid as a type within the class body.
fr: ``Generic[T]`` en tant que classe de base définit que la classe ``LoggedVar`` prend un paramètre de type unique ``T``. Ceci rend également ``T`` valide en tant que type dans le corps de la classe.

source: The :class:`Generic` base class defines :meth:`__class_getitem__` so that ``LoggedVar[t]`` is valid as a type::
fr: La classe de base :class:`Generic` définit :meth:`__class_getitem__` de sorte que ``LoggedVar[t]`` est valide comme type ::

source: A generic type can have any number of type variables, and type variables may be constrained::
fr: Un type générique peut avoir un nombre quelconque de variables de type et vous pouvez fixer des contraintes sur les variables de type ::

source: Each type variable argument to :class:`Generic` must be distinct. This is thus invalid::
fr: Chaque argument de variable de type :class:`Generic` doit être distinct. Ceci n'est donc pas valable ::

source: You can use multiple inheritance with :class:`Generic`::
fr: Vous pouvez utiliser l'héritage multiple avec :class:`Generic` ::

source: When inheriting from generic classes, some type variables could be fixed::
fr: Lors de l'héritage de classes génériques, certaines variables de type peuvent être corrigées ::

source: In this case ``MyDict`` has a single parameter, ``T``.
fr: Dans ce cas, ``MyDict`` a un seul paramètre, ``T``.

source: Using a generic class without specifying type parameters assumes :data:`Any` for each position. In the following example, ``MyIterable`` is not generic but implicitly inherits from ``Iterable[Any]``::
fr: L'utilisation d'une classe générique sans spécifier de paramètres de type suppose :data:`Any` pour chaque position. Dans l'exemple suivant, ``MyIterable`` n'est pas générique mais hérite implicitement de ``Iterable[Any]`` ::

source: User defined generic type aliases are also supported. Examples::
fr: Les alias de type générique définis par l'utilisateur sont également pris en charge. Exemples ::

source: :class:`Generic` no longer has a custom metaclass.
fr: :class:`Generic` n'a plus de métaclasse personnalisée.

source: A user-defined generic class can have ABCs as base classes without a metaclass conflict. Generic metaclasses are not supported. The outcome of parameterizing generics is cached, and most types in the typing module are hashable and comparable for equality.
fr: Une classe générique définie par l'utilisateur peut avoir des CBA (*Classe de Base Abstraite*) comme classes de base sans conflit de métaclasses. Les métaclasses génériques ne sont pas prises en charge. Le résultat du paramétrage des génériques est mis en cache et la plupart des types dans le module ``typing`` sont hachables et comparables pour l'égalité.

source: The :data:`Any` type
fr: Le type :data:`Any`

source: A special kind of type is :data:`Any`. A static type checker will treat every type as being compatible with :data:`Any` and :data:`Any` as being compatible with every type.
fr: Un type particulier est :data:`Any`. Un vérificateur de type statique traite chaque type comme étant compatible avec :data:`Any` et :data:`Any` comme étant compatible avec chaque type.

source: Notice that no typechecking is performed when assigning a value of type :data:`Any` to a more precise type. For example, the static type checker did not report an error when assigning ``a`` to ``s`` even though ``s`` was declared to be of type :class:`str` and receives an :class:`int` value at runtime!
fr: Notez qu'aucun contrôle de typage n'est effectué lors de l'affectation d'une valeur de type :data:`Any` à un type plus précis. Par exemple, le vérificateur de type statique ne signale pas d'erreur lors de l'affectation de ``a`` à ``s`` même si ``s`` était déclaré être de type :class:`str` et reçoit une valeur :class:`int` au moment de son exécution !

source: Furthermore, all functions without a return type or parameter types will implicitly default to using :data:`Any`::
fr: De plus, toutes les fonctions sans type de retour ni type de paramètre sont considérées comme utilisant :data:`Any` implicitement par défaut ::

source: This behavior allows :data:`Any` to be used as an *escape hatch* when you need to mix dynamically and statically typed code.
fr: Ce comportement permet à :data:`Any` d'être utilisé comme succédané lorsque vous avez besoin de mélanger du code typé dynamiquement et statiquement.

source: Contrast the behavior of :data:`Any` with the behavior of :class:`object`. Similar to :data:`Any`, every type is a subtype of :class:`object`. However, unlike :data:`Any`, the reverse is not true: :class:`object` is *not* a subtype of every other type.
fr: Comparons le comportement de :data:`Any` avec celui de :class:`object`. De la même manière que pour :data:`Any`, chaque type est un sous-type de :class:`object`. Cependant, contrairement à :data:`Any`, l'inverse n'est pas vrai : :class:`object` n'est *pas* un sous-type de chaque autre type.

source: That means when the type of a value is :class:`object`, a type checker will reject almost all operations on it, and assigning it to a variable (or using it as a return value) of a more specialized type is a type error. For example::
fr: Cela signifie que lorsque le type d'une valeur est :class:`object`, un vérificateur de type rejette presque toutes les opérations sur celle-ci, et l'affecter à une variable (ou l'utiliser comme une valeur de retour) d'un type plus spécialisé est une erreur de typage. Par exemple ::

source: Use :class:`object` to indicate that a value could be any type in a typesafe manner. Use :data:`Any` to indicate that a value is dynamically typed.
fr: Utilisez :class:`object` pour indiquer qu'une valeur peut être de n'importe quel type de manière sûre. Utiliser :data:`Any` pour indiquer qu'une valeur est typée dynamiquement.

source: Nominal vs structural subtyping
fr: Sous-typage nominal et sous-typage structurel

source: Initially :pep:`484` defined Python static type system as using *nominal subtyping*. This means that a class ``A`` is allowed where a class ``B`` is expected if and only if ``A`` is a subclass of ``B``.
fr: Initialement la :pep:`484` définissait le système de type statique Python comme utilisant *le sous-type nominal*. Cela signifie qu'une classe ``A`` est permise lorsqu'une classe ``B`` est prévue si et seulement si ``A`` est une sous-classe de ``B``.

source: :pep:`544` allows to solve this problem by allowing users to write the above code without explicit base classes in the class definition, allowing ``Bucket`` to be implicitly considered a subtype of both ``Sized`` and ``Iterable[int]`` by static type checkers. This is known as *structural subtyping* (or static duck-typing)::
fr: La :pep:`544` permet de résoudre ce problème en permettant aux utilisateurs d'écrire le code ci-dessus sans classes de base explicites dans la définition de classe, permettant à ``Bucket`` d'être implicitement considéré comme un sous-type de ``Sized`` et ``Iterable[int]`` par des vérificateurs de type statique. C'est ce qu'on appelle le *sous-typage structurel* (ou typage canard) ::

source: Moreover, by subclassing a special class :class:`Protocol`, a user can define new custom protocols to fully enjoy structural subtyping (see examples below).
fr: De plus, en sous-classant une classe spéciale :class:`Protocol`, un utilisateur peut définir de nouveaux protocoles personnalisés pour profiter pleinement du sous-typage structurel (voir exemples ci-dessous).

source: Special type indicating an unconstrained type.
fr: Type spécial indiquant un type non contraint.

source: Every type is compatible with :data:`Any`.
fr: Chaque type est compatible avec :data:`Any`.

source: :data:`Any` is compatible with every type.
fr: :data:`Any` est compatible avec tous les types.

source: Special type indicating that a function never returns. For example::
fr: Type spécial indiquant qu'une fonction ne renvoie rien. Par exemple ::

source: Tuple type; ``Tuple[X, Y]`` is the type of a tuple of two items with the first item of type X and the second of type Y. The type of the empty tuple can be written as ``Tuple[()]``.
fr: Type « *n*-uplet » ; ``Tuple[X, Y]`` est le type d'un *n*-uplet à deux éléments avec le premier élément de type X et le second de type Y. Le type du *n*-uplet vide peut être écrit comme ``Tuple[()]``.

source: Example: ``Tuple[T1, T2]`` is a tuple of two elements corresponding to type variables T1 and T2. ``Tuple[int, float, str]`` is a tuple of an int, a float and a string.
fr: Exemple : ``Tuple[T1, T2]`` est une paire correspondant aux variables de type ``T1`` et ``T2``. ``Tuple[int, float, str]`` est un triplet composé d'un entier, d'un flottant et d'une chaîne de caractères.

source: To specify a variable-length tuple of homogeneous type, use literal ellipsis, e.g. ``Tuple[int, ...]``. A plain :data:`Tuple` is equivalent to ``Tuple[Any, ...]``, and in turn to :class:`tuple`.
fr: Pour spécifier un *n*-uplet de longueur variable et de type homogène, utilisez une ellipse, par exemple ``Tuple[int, ....]``. Un *n*-uplet :data:`Tuple` est équivalent à ``Tuple[Any, ....]`` et, à son tour, à :class:`tuple`.

source: Union type; ``Union[X, Y]`` means either X or Y.
fr: Type « union » ; ``Union[X, Y]`` signifie X ou Y.

source: To define a union, use e.g. ``Union[int, str]``. Details:
fr: Pour définir une union, utilisez par exemple ``Union[int, str]``. Détail :

source: The arguments must be types and there must be at least one.
fr: Les arguments doivent être des types et il doit y en avoir au moins un.

source: Unions of unions are flattened, e.g.::
fr: Les unions d'unions sont aplanies, par exemple ::

source: Unions of a single argument vanish, e.g.::
fr: Les unions d'un seul argument disparaissent, par exemple ::

source: Redundant arguments are skipped, e.g.::
fr: Les arguments redondants sont ignorés, par exemple ::

source: When comparing unions, the argument order is ignored, e.g.::
fr: Lors de la comparaison d'unions, l'ordre des arguments est ignoré, par exemple ::

source: You cannot subclass or instantiate a union.
fr: Vous ne pouvez pas sous-classer ou instancier une union.

source: You cannot write ``Union[X][Y]``.
fr: Vous ne pouvez pas écrire ``Union[X][Y]``.

source: You can use ``Optional[X]`` as a shorthand for ``Union[X, None]``.
fr: Vous pouvez utiliser l'abréviation ``Optional[X]`` pour ``Union[X, None]``.

source: Don't remove explicit subclasses from unions at runtime.
fr: Ne supprime pas les sous-classes explicites des unions à l'exécution.

source: Optional type.
fr: Type « optionnel ».

source: ``Optional[X]`` is equivalent to ``Union[X, None]``.
fr: ``Optional[X]`` équivaut à ``Union[X, None]``.

source: Note that this is not the same concept as an optional argument, which is one that has a default. An optional argument with a default does not require the ``Optional`` qualifier on its type annotation just because it is optional. For example::
fr: Notez que ce n'est pas le même concept qu'un argument optionnel, qui est un argument qui possède une valeur par défaut. Un argument optionnel (qui a une valeur par défaut) ne nécessite pas, à ce titre, le qualificatif ``Optional`` sur son annotation de type. Par exemple ::

source: On the other hand, if an explicit value of ``None`` is allowed, the use of ``Optional`` is appropriate, whether the argument is optional or not. For example::
fr: Par contre, si une valeur explicite de ``None`` est permise, l'utilisation de ``Optional`` est appropriée, que l'argument soit facultatif ou non. Par exemple ::

source: Callable type; ``Callable[[int], str]`` is a function of (int) -> str.
fr: Type Appelable. ``Callable[[int], str]`` est une fonction de type ``(int) -> str``.

source: The subscription syntax must always be used with exactly two values: the argument list and the return type. The argument list must be a list of types or an ellipsis; the return type must be a single type.
fr: La syntaxe de sélection (*subscription* en anglais) doit toujours être utilisée avec exactement deux valeurs : la liste d'arguments et le type de retour. La liste d'arguments doit être une liste de types ou une ellipse ; il doit y avoir un seul type de retour.

source: There is no syntax to indicate optional or keyword arguments; such function types are rarely used as callback types. ``Callable[..., ReturnType]`` (literal ellipsis) can be used to type hint a callable taking any number of arguments and returning ``ReturnType``. A plain :data:`Callable` is equivalent to ``Callable[..., Any]``, and in turn to :class:`collections.abc.Callable`.
fr: Il n'y a pas de syntaxe pour indiquer les arguments optionnels ou les arguments par mots-clés ; de tels types de fonctions sont rarement utilisés comme types de rappel. ``Callable[..., ReturnType]`` (ellipse) peut être utilisé pour annoter le type d'un appelable, prenant un nombre quelconque d'arguments et renvoyant ``ReturnType``. Un simple :data:`Callable` est équivalent à ``Callable[..., Any]`` et, à son tour, à :class:`collections.abc.Callable`.

source: A variable annotated with ``C`` may accept a value of type ``C``. In contrast, a variable annotated with ``Type[C]`` may accept values that are classes themselves -- specifically, it will accept the *class object* of ``C``. For example::
fr: Une variable annotée de ``C`` peut accepter une valeur de type ``C``. En revanche, une variable annotée avec ``Type[C]`` peut accepter des valeurs qui sont elles-mêmes des classes — plus précisément, elle accepte l'objet *class* de ``C``. Par exemple ::

source: Note that ``Type[C]`` is covariant::
fr: Notez que ``Type[C]`` est covariant ::

source: The fact that ``Type[C]`` is covariant implies that all subclasses of ``C`` should implement the same constructor signature and class method signatures as ``C``. The type checker should flag violations of this, but should also allow constructor calls in subclasses that match the constructor calls in the indicated base class. How the type checker is required to handle this particular case may change in future revisions of :pep:`484`.
fr: Le fait que ``Type[C]`` soit covariant implique que toutes les sous-classes de ``C`` doivent implémenter la même signature de constructeur et les signatures de méthode de classe que ``C``. Le vérificateur de type doit signaler les manquements à cette règle. Il doit également autoriser les appels du constructeur dans les sous-classes qui correspondent aux appels du constructeur dans la classe de base indiquée. La façon dont le vérificateur de type est tenu de traiter ce cas particulier peut changer dans les futures révisions de :pep:`484`.

source: The only legal parameters for :class:`Type` are classes, :data:`Any`, :ref:`type variables <generics>`, and unions of any of these types. For example::
fr: Les seuls paramètres légitimes pour :class:`Type` sont les classes, :data:`Any`, :ref:`type variables <generics>`, et les unions de ces types. Par exemple ::
