Repository: python/python-docs-fr
Catalog: library/typing.po
Languages: fr

source: This decorator is itself not available at runtime. It is mainly intended to mark classes that are defined in type stub files if an implementation returns an instance of a private class::
fr: Ce décorateur n'est pas disponible à l'exécution. Il est principalement destiné à marquer les classes qui sont définies dans des fichiers séparés d'annotations de type (*type stub file*, en anglais) si une implémentation renvoie une instance d'une classe privée ::

source: Note that returning instances of private classes is not recommended. It is usually preferable to make such classes public.
fr: Notez qu'il n'est pas recommandé de renvoyer les instances des classes privées. Il est généralement préférable de rendre ces classes publiques.

source: Return a dictionary containing type hints for a function, method, module or class object.
fr: renvoie un dictionnaire contenant des indications de type pour une fonction, une méthode, un module ou un objet de classe.

source: This is often the same as ``obj.__annotations__``. In addition, forward references encoded as string literals are handled by evaluating them in ``globals`` and ``locals`` namespaces. If necessary, ``Optional[t]`` is added for function and method annotations if a default value equal to ``None`` is set. For a class ``C``, return a dictionary constructed by merging all the ``__annotations__`` along ``C.__mro__`` in reverse order.
fr: C'est souvent équivalent à ``obj.__annotations__``. De plus, les références directes encodées sous forme de chaîne littérales sont traitées en les évaluant dans les espaces de nommage ``globals`` et ``locals``. Si nécessaire, ``Optional[t]`` est ajouté pour les annotations de fonction et de méthode si une valeur par défaut égale à ``None`` est définie. Pour une classe ``C``, renvoie un dictionnaire construit en fusionnant toutes les ``__annotations__`` en parcourant ``C.__mro__`` en ordre inverse.

source: Provide basic introspection for generic types and special typing forms.
fr: Fournit une introspection de base pour les types génériques et les formes spéciales de typage.

source: A special constant that is assumed to be ``True`` by 3rd party static type checkers. It is ``False`` at runtime. Usage::
fr: Constante spéciale qui vaut ``True`` pour les vérificateurs de type statiques tiers et ``False`` à l'exécution. Utilisation ::
