Repository: python/python-docs-fr
Catalog: library/unicodedata.po
Languages: fr

source: :mod:`unicodedata` --- Unicode Database
fr: :mod:`unicodedata` — Base de données Unicode

source: Look up character by name. If a character with the given name is found, return the corresponding character. If not found, :exc:`KeyError` is raised.
fr: Retrouver un caractère par nom. Si un caractère avec le nom donné est trouvé, renvoyer le caractère correspondant. S'il n'est pas trouvé, :exc:`KeyError` est levée.

source: Support for name aliases [#]_ and named sequences [#]_ has been added.
fr: La gestion des alias [#]_ et des séquences nommées [#]_ a été ajouté.

source: Returns the name assigned to the character *chr* as a string. If no name is defined, *default* is returned, or, if not given, :exc:`ValueError` is raised.
fr: Renvoie le nom assigné au caractère *chr* comme une chaîne de caractères. Si aucun nom n'est défini, *default* est renvoyé, ou, si ce dernier n'est pas renseigné :exc:`ValueError` est levée.

source: Returns the decimal value assigned to the character *chr* as integer. If no such value is defined, *default* is returned, or, if not given, :exc:`ValueError` is raised.
fr: Renvoie la valeur décimale assignée au caractère *chr* comme un entier. Si aucune valeur de ce type n'est définie, *default* est renvoyé, ou, si ce dernier n'est pas renseigné, :exc:`ValueError` est levée.

source: Returns the digit value assigned to the character *chr* as integer. If no such value is defined, *default* is returned, or, if not given, :exc:`ValueError` is raised.
fr: Renvoie le chiffre assigné au caractère *chr* comme un entier. Si aucune valeur de ce type n'est définie, *default* est renvoyé, ou, si ce dernier n'est pas renseigné, :exc:`ValueError` est levée.

source: Returns the numeric value assigned to the character *chr* as float. If no such value is defined, *default* is returned, or, if not given, :exc:`ValueError` is raised.
fr: Renvoie la valeur numérique assignée au caractère *chr* comme un entier. Si aucune valeur de ce type n'est définie, *default* est renvoyé, ou, si ce dernier n'est pas renseigné, :exc:`ValueError` est levée.

source: Returns the general category assigned to the character *chr* as string.
fr: Renvoie la catégorie générale assignée au caractère *chr* comme une chaîne de caractères.

source: Returns the bidirectional class assigned to the character *chr* as string. If no such value is defined, an empty string is returned.
fr: Renvoie la classe bidirectionnelle assignée au caractère *chr* comme une chaîne de caractères. Si aucune valeur de ce type n'est définie, une chaîne de caractères vide est renvoyée.

source: Returns the canonical combining class assigned to the character *chr* as integer. Returns ``0`` if no combining class is defined.
fr: Renvoie la classe de combinaison canonique assignée au caractère *chr* comme un entier. Envoie ``0`` si aucune classe de combinaison n'est définie.

source: Returns the east asian width assigned to the character *chr* as string.
fr: Renvoie la largeur est-asiatique assignée à un caractère *chr* comme une chaîne de caractères.

source: Returns the mirrored property assigned to the character *chr* as integer. Returns ``1`` if the character has been identified as a "mirrored" character in bidirectional text, ``0`` otherwise.
fr: Renvoie la propriété miroir assignée au caractère *chr* comme un entier. Renvoie ``1`` si le caractère a été identifié comme un caractère "réfléchi" dans du texte bidirectionnel, sinon ``0``.

source: Returns the character decomposition mapping assigned to the character *chr* as string. An empty string is returned in case no such mapping is defined.
fr: Renvoie le tableau associatif de décomposition de caractère assigné au caractère *chr* comme une chaîne de caractères. Une chaîne de caractère vide est renvoyée dans le cas où aucun tableau associatif de ce type n'est défini.

source: Return the normal form *form* for the Unicode string *unistr*. Valid values for *form* are 'NFC', 'NFKC', 'NFD', and 'NFKD'.
fr: Renvoie la forme normale *form* de la chaîne de caractère Unicode *unistr*. Les valeurs valides de *form* sont *NFC*, *NFKC*, *NFD*, et *NFKD*.

source: The Unicode standard defines various normalization forms of a Unicode string, based on the definition of canonical equivalence and compatibility equivalence. In Unicode, several characters can be expressed in various way. For example, the character U+00C7 (LATIN CAPITAL LETTER C WITH CEDILLA) can also be expressed as the sequence U+0043 (LATIN CAPITAL LETTER C) U+0327 (COMBINING CEDILLA).
fr: Le standard Unicode définit les différentes variantes de normalisation d'une chaîne de caractères Unicode en se basant sur les définitions d'équivalence canonique et d'équivalence de compatibilité. En Unicode, plusieurs caractères peuvent être exprimés de différentes façons. Par exemple, le caractère *U+00C7* (*LATIN CAPITAL LETTER C WITH CEDILLA*) peut aussi être exprimé comme la séquence *U+0043* (*LATIN CAPITAL LETTER C*) *U+0327* (*COMBINING CEDILLA*).

source: For each character, there are two normal forms: normal form C and normal form D. Normal form D (NFD) is also known as canonical decomposition, and translates each character into its decomposed form. Normal form C (NFC) first applies a canonical decomposition, then composes pre-combined characters again.
fr: Pour chaque caractère, il existe deux formes normales: la forme normale C et la forme normale D. La forme normale D (NFD) est aussi appelée décomposition canonique, et traduit chaque caractère dans sa forme décomposée. La forme normale C (NFC) applique d'abord la décomposition canonique, puis compose à nouveau les caractères pré-combinés.

source: In addition to these two forms, there are two additional normal forms based on compatibility equivalence. In Unicode, certain characters are supported which normally would be unified with other characters. For example, U+2160 (ROMAN NUMERAL ONE) is really the same thing as U+0049 (LATIN CAPITAL LETTER I). However, it is supported in Unicode for compatibility with existing character sets (e.g. gb2312).
fr: En plus de ces deux formes, il existe deux formes nominales basées sur l'équivalence de compatibilité. En Unicode, certains caractères sont gérés alors qu'ils sont normalement unifiés avec d'autres caractères. Par exemple, U+2160 (ROMAN NUMERAL ONE) est vraiment la même chose que U+0049 (LATIN CAPITAL LETTER I). Cependant, ce caractère est supporté par souci de compatibilité avec les jeux de caractères existants (par exemple *gb2312*).

source: The normal form KD (NFKD) will apply the compatibility decomposition, i.e. replace all compatibility characters with their equivalents. The normal form KC (NFKC) first applies the compatibility decomposition, followed by the canonical composition.
fr: La forme normale KD (NFKD) applique la décomposition de compatibilité, c'est-à-dire remplacer les caractères de compatibilités avec leurs équivalents. La forme normale KC (NFKC) applique d'abord la décomposition de compatibilité, puis applique la composition canonique.

source: Even if two unicode strings are normalized and look the same to a human reader, if one has combining characters and the other doesn't, they may not compare equal.
fr: Même si deux chaînes de caractères Unicode sont normalisées et ont la même apparence pour un lecteur humain , si un a des caractères combinés et l'autre n'en a pas, elles peuvent ne pas être égales lors d'une comparaison.

source: In addition, the module exposes the following constant:
fr: De plus, ce module expose la constante suivante:

source: The version of the Unicode database used in this module.
fr: La version de la base de données Unicode utilisée dans ce module.

source: This is an object that has the same methods as the entire module, but uses the Unicode database version 3.2 instead, for applications that require this specific version of the Unicode database (such as IDNA).
fr: Ceci est un objet qui a les mêmes méthodes que le module, mais qui utilise la version 3.2 de la base de données Unicode, pour les applications qui nécessitent cette version spécifique de la base de données Unicode (comme l'IDNA).

source: Examples:
fr: Exemples :

source: Footnotes
fr: Notes
