Repository: python/python-docs-fr
Catalog: library/unittest.po
Languages: fr

source: The specifier *name* is a "dotted name" that may resolve either to a module, a test case class, a test method within a test case class, a :class:`TestSuite` instance, or a callable object which returns a :class:`TestCase` or :class:`TestSuite` instance. These checks are applied in the order listed here; that is, a method on a possible test case class will be picked up as "a test method within a test case class", rather than "a callable object".
fr: Le spécificateur *name* est un "nom pointillé" qui peut être résolu soit par un module, une classe de cas de test, une méthode de test dans une classe de cas de test, une instance de :class:`TestSuite`, ou un objet appelable qui retourne une instance de classe :class:`TestCase` ou de classe :class:`TestSuite`. Ces contrôles sont appliqués dans l'ordre indiqué ici, c'est-à-dire qu'une méthode sur une classe de cas de test possible sera choisie comme "méthode de test dans une classe de cas de test", plutôt que comme "un objet appelable".

source: For example, if you have a module :mod:`SampleTests` containing a :class:`TestCase`\ -derived class :class:`SampleTestCase` with three test methods (:meth:`test_one`, :meth:`test_two`, and :meth:`test_three`), the specifier ``'SampleTests.SampleTestCase'`` would cause this method to return a suite which will run all three test methods. Using the specifier ``'SampleTests.SampleTestCase.test_two'`` would cause it to return a test suite which will run only the :meth:`test_two` test method. The specifier can refer to modules and packages which have not been imported; they will be imported as a side-effect.
fr: Par exemple, si vous avez un module :mod:`SampleTests` contenant une classe :class:`TestCase` (classe dérivée de la classe :class:`SampleTestCase`) avec trois méthodes de test (:meth:`test_one`, :meth:`test_two` et :meth:`test_three`), l'élément spécificateur `SampleTests.sampleTestCase` renvoie une suite qui va exécuter les trois méthodes de tests. L'utilisation du spécificateur `SampleTests.SampleTestCase.test_two` permettrait de retourner une suite de tests qui ne lancerait que la méthode test :meth:`test_two`. Le spécificateur peut se référer à des modules et packages qui n'ont pas été importés. Ils seront importés par un effet de bord.

source: The method optionally resolves *name* relative to the given *module*.
fr: La méthode résout facultativement *name* relatif au *module* donné.

source: If an :exc:`ImportError` or :exc:`AttributeError` occurs while traversing *name* then a synthetic test that raises that error when run will be returned. These errors are included in the errors accumulated by self.errors.
fr: Si une :exc:`ImportError` ou :exc:`AttributeError` se produit pendant la traversée de *name*, un test synthétique qui enrichie l'erreur produite lors de l'exécution est renvoyé. Ces erreurs sont incluses dans les erreurs accumulées par *self.errors*.

source: Similar to :meth:`loadTestsFromName`, but takes a sequence of names rather than a single name. The return value is a test suite which supports all the tests defined for each name.
fr: Similaire à :meth:`loadTestsFromName`, mais prend une séquence de noms plutôt qu'un seul nom. La valeur renvoyée est une suite de tests qui gère tous les tests définis pour chaque nom.

source: Return a sorted sequence of method names found within *testCaseClass*; this should be a subclass of :class:`TestCase`.
fr: Renvoie une séquence triée de noms de méthodes trouvés dans *testCaseClass* ; ceci doit être une sous-classe de :class:`TestCase`.

source: Find all the test modules by recursing into subdirectories from the specified start directory, and return a TestSuite object containing them. Only test files that match *pattern* will be loaded. (Using shell style pattern matching.) Only module names that are importable (i.e. are valid Python identifiers) will be loaded.
fr: Trouve tous les modules de test en parcourant les sous-répertoires du répertoire de démarrage spécifié, et renvoie un objet *TestSuite* qui les contient. Seuls les fichiers de test qui correspondent à *pattern* sont chargés. Seuls les noms de modules qui sont importables (c'est-à-dire qui sont des identifiants Python valides) sont chargés.

source: All test modules must be importable from the top level of the project. If the start directory is not the top level directory then the top level directory must be specified separately.
fr: Tous les modules de test doivent être importables depuis la racine du projet. Si le répertoire de démarrage n'est pas la racine, le répertoire racine doit être spécifié séparément.

source: If importing a module fails, for example due to a syntax error, then this will be recorded as a single error and discovery will continue. If the import failure is due to :exc:`SkipTest` being raised, it will be recorded as a skip instead of an error.
fr: Si l'importation d'un module échoue, par exemple en raison d'une erreur de syntaxe, celle-ci est alors enregistrée comme une erreur unique et la découverte se poursuit. Si l'échec de l'importation est dû au fait que :exc:`SkipTest` est levé, il est enregistré comme un saut plutôt que comme un message d'erreur.

source: If a package (a directory containing a file named :file:`__init__.py`) is found, the package will be checked for a ``load_tests`` function. If this exists then it will be called ``package.load_tests(loader, tests, pattern)``. Test discovery takes care to ensure that a package is only checked for tests once during an invocation, even if the load_tests function itself calls ``loader.discover``.
fr: Si un paquet (un répertoire contenant un fichier nommé :file:`__init__.py`) est trouvé, le paquet est alors vérifié pour une fonction ``load_tests``. Si elle existe, elle s'appellera ``package.load_tests(loader, tests, pattern)``. Le mécanisme de découverte de test prend soin de s'assurer qu'un paquet n'est vérifié qu'une seule fois au cours d'une invocation, même si la fonction *load_tests* appelle elle-même ``loader.discover``.

source: If ``load_tests`` exists then discovery does *not* recurse into the package, ``load_tests`` is responsible for loading all tests in the package.
fr: Si ``load_tests`` existe alors la découverte ne poursuit pas la récursion dans le paquet, ``load_tests`` a la responsabilité de charger tous les tests dans le paquet.

source: The pattern is deliberately not stored as a loader attribute so that packages can continue discovery themselves. *top_level_dir* is stored so ``load_tests`` does not need to pass this argument in to ``loader.discover()``.
fr: Le motif n'est délibérément pas stocké en tant qu'attribut du chargeur afin que les paquets puissent continuer à être découverts eux-mêmes. *top_level_dir* est stocké de sorte que ``load_tests`` n'a pas besoin de passer cet argument a ``loader. discover()``.

source: *start_dir* can be a dotted module name as well as a directory.
fr: *start_dir* peut être un nom de module ainsi qu'un répertoire.

source: Modules that raise :exc:`SkipTest` on import are recorded as skips, not errors. Discovery works for :term:`namespace packages <namespace package>`. Paths are sorted before being imported so that execution order is the same even if the underlying file system's ordering is not dependent on file name.
fr: Les modules qui lèvent :exc:`SkipTest` lors de l'importation sont enregistrés comme des sauts et non des erreurs. Le mécanisme de découverte fonctionne pour les :term:`paquets-espaces de nommage <namespace package>`. Les chemins sont triés avant d'être importés pour que l'ordre d'exécution soit le même, même si l'ordre du système de fichiers sous-jacent ne dépend pas du nom du fichier.

source: Found packages are now checked for ``load_tests`` regardless of whether their path matches *pattern*, because it is impossible for a package name to match the default pattern.
fr: Les paquets trouvés sont maintenant vérifiés pour ``load_tests`` indépendamment du fait que leur chemin d'accès corresponde ou non à *pattern*, car il est impossible pour un nom de paquet de correspondre au motif par défaut.

source: The following attributes of a :class:`TestLoader` can be configured either by subclassing or assignment on an instance:
fr: Les attributs suivants d'une classe :class:`TestLoader` peuvent être configurés soit par héritage, soit par affectation sur une instance ::

source: String giving the prefix of method names which will be interpreted as test methods. The default value is ``'test'``.
fr: Chaîne donnant le préfixe des noms de méthodes qui seront interprétés comme méthodes de test. La valeur par défaut est ``'test'``.

source: This affects :meth:`getTestCaseNames` and all the :meth:`loadTestsFrom\*` methods.
fr: Ceci affecte les méthodes :meth:`getTestCaseNames` et toutes les méthodes :meth:`loadTestsFrom\*`.

source: Function to be used to compare method names when sorting them in :meth:`getTestCaseNames` and all the :meth:`loadTestsFrom\*` methods.
fr: Fonction à utiliser pour comparer les noms de méthodes lors de leur tri dans les méthodes :meth:`getTestCaseNames` et toutes les méthodes :meth:`loadTestsFrom\*`.

source: Callable object that constructs a test suite from a list of tests. No methods on the resulting object are needed. The default value is the :class:`TestSuite` class.
fr: Objet appelable qui construit une suite de tests à partir d'une liste de tests. Aucune méthode sur l'objet résultant n'est nécessaire. La valeur par défaut est la classe :class:`TestSuite`.

source: This affects all the :meth:`loadTestsFrom\*` methods.
fr: Cela affecte toutes les méthodes :meth:`loadTestsFrom\*`.

source: List of Unix shell-style wildcard test name patterns that test methods have to match to be included in test suites (see ``-v`` option).
fr: Liste des motifs de noms de test de type joker de style *Unix* que les méthodes de test doivent valider pour être incluses dans les suites de test (voir l'option ``-v``).

source: If this attribute is not ``None`` (the default), all test methods to be included in test suites must match one of the patterns in this list. Note that matches are always performed using :meth:`fnmatch.fnmatchcase`, so unlike patterns passed to the ``-v`` option, simple substring patterns will have to be converted using ``*`` wildcards.
fr: Si cet attribut n'est pas ``None`` (par défaut), toutes les méthodes de test à inclure dans les suites de test doivent correspondre à l'un des modèles de cette liste. Remarquez que les correspondances sont toujours effectuées en utilisant :meth:`fnmatch.fnmatchcase`, donc contrairement aux modèles passés à l'option ``-v``, les motifs de sous-chaînes simples doivent être convertis avec le joker ``*``.

source: This class is used to compile information about which tests have succeeded and which have failed.
fr: Cette classe est utilisée pour compiler des informations sur les tests qui ont réussi et ceux qui ont échoué.

source: A :class:`TestResult` object stores the results of a set of tests. The :class:`TestCase` and :class:`TestSuite` classes ensure that results are properly recorded; test authors do not need to worry about recording the outcome of tests.
fr: Un objet :class:`TestResult` stocke les résultats d'un ensemble de tests. Les classes :class:`TestCase` et :class:`TestSuite` s'assurent que les résultats sont correctement enregistrés. Les auteurs du test n'ont pas à se soucier de l'enregistrement des résultats des tests.

source: Testing frameworks built on top of :mod:`unittest` may want access to the :class:`TestResult` object generated by running a set of tests for reporting purposes; a :class:`TestResult` instance is returned by the :meth:`TestRunner.run` method for this purpose.
fr: Les cadriciels de test construits sur :mod:`unittest` peuvent nécessiter l'accès à l'objet :class:`TestResult` généré en exécutant un ensemble de tests à des fins de génération de comptes-rendu. Une instance de :class:`TestResult` est alors renvoyée par la méthode :meth:`TestRunner.run` à cette fin.

source: :class:`TestResult` instances have the following attributes that will be of interest when inspecting the results of running a set of tests:
fr: Les instance de :class:`TestResult` ont les attributs suivants qui sont intéressant pour l'inspection des résultats de l'exécution d'un ensemble de tests ::

source: A list containing 2-tuples of :class:`TestCase` instances and strings holding formatted tracebacks. Each tuple represents a test which raised an unexpected exception.
fr: Une liste contenant un couple d'instances de :class:`TestCase` et une chaînes de caractères contenant des traces formatées. Chaque couple représente un test qui a levé une exception inattendue.

source: A list containing 2-tuples of :class:`TestCase` instances and strings holding formatted tracebacks. Each tuple represents a test where a failure was explicitly signalled using the :meth:`TestCase.assert\*` methods.
fr: Une liste contenant un couple d'instances de :class:`TestCase` et une chaînes de caractères contenant des traces formatées. Chaque tuple représente un test où un échec a été explicitement signalé en utilisant les méthodes :meth:`TestCase.assert\*`.

source: A list containing 2-tuples of :class:`TestCase` instances and strings holding the reason for skipping the test.
fr: Une liste contenant un couple d'instances de :class:`TestCase` et une chaînes de caractères contenant la raison de l'omission du test.

source: A list containing 2-tuples of :class:`TestCase` instances and strings holding formatted tracebacks. Each tuple represents an expected failure of the test case.
fr: Une liste contenant un couple d'instance :class:`TestCase` et une chaînes de caractères contenant des traces formatées. Chaque coulpe représente un échec attendu du scénario de test.

source: A list containing :class:`TestCase` instances that were marked as expected failures, but succeeded.
fr: Une liste contenant les instances :class:`TestCase` qui ont été marquées comme des échecs attendus, mais qui ont réussi.

source: Set to ``True`` when the execution of tests should stop by :meth:`stop`.
fr: A positionner sur ``True`` quand l'exécution des tests doit être arrêter par :meth:`stop`.

source: The total number of tests run so far.
fr: Le nombre total de tests effectués jusqu'à présent.

source: If set to true, ``sys.stdout`` and ``sys.stderr`` will be buffered in between :meth:`startTest` and :meth:`stopTest` being called. Collected output will only be echoed onto the real ``sys.stdout`` and ``sys.stderr`` if the test fails or errors. Any output is also attached to the failure / error message.
fr: S'il est défini sur *true*, ``sys.stdout`` et ``sys.stderr`` sont mis dans un tampon entre les appels de :meth:`startTest` et :meth:`stopTest`. La sortie collectée est répercutée sur les sorties ``sys.stdout`` et ``sys.stderr`` réels uniquement en cas d'échec ou d'erreur du test. Toute sortie est également attachée au message d'erreur.

source: If set to true :meth:`stop` will be called on the first failure or error, halting the test run.
fr: Si la valeur est *true* :meth:`stop` est appelée lors de la première défaillance ou erreur, ce qui interrompt le test en cours d'exécution.

source: If set to true then local variables will be shown in tracebacks.
fr: Si la valeur est *true*, les variables locales sont affichées dans les traces d'appels.

source: Return ``True`` if all tests run so far have passed, otherwise returns ``False``.
fr: Renvoie ``True`` si tous les tests effectués jusqu'à présent ont réussi, sinon renvoie ``False``.

source: Returns ``False`` if there were any :attr:`unexpectedSuccesses` from tests marked with the :func:`expectedFailure` decorator.
fr: Renvoie ``False`` s'il y a eu des :attr:`unexpectedSuccesses` dans les tests annotés avec le décorateur :func:`expectedFailure`.

source: This method can be called to signal that the set of tests being run should be aborted by setting the :attr:`shouldStop` attribute to ``True``. :class:`TestRunner` objects should respect this flag and return without running any additional tests.
fr: Cette méthode peut être appelée pour signaler que l'ensemble des tests en cours d'exécution doit être annulé en définissant l'attribut :attr:`shouldStop` sur ``True``. Les instances de :class:`TestRunner` doivent respecter ce signal et se terminer sans exécuter de tests supplémentaires.

source: For example, this feature is used by the :class:`TextTestRunner` class to stop the test framework when the user signals an interrupt from the keyboard. Interactive tools which provide :class:`TestRunner` implementations can use this in a similar manner.
fr: Par exemple, cette fonctionnalité est utilisée par la classe :class:`TextTestRunner` pour arrêter le cadriciel de test lorsque l'utilisateur lance une interruption clavier. Les outils interactifs qui fournissent des implémentations de :class:`TestRunner` peuvent l'utiliser de la même manière.

source: The following methods of the :class:`TestResult` class are used to maintain the internal data structures, and may be extended in subclasses to support additional reporting requirements. This is particularly useful in building tools which support interactive reporting while tests are being run.
fr: Les méthodes suivantes de la classe :class:`TestResult` sont utilisées pour maintenir les structures de données internes, et peuvent être étendues dans des sous-classes pour gérer des exigences supplémentaires en termes de compte-rendu. Cette fonction est particulièrement utile pour créer des outils qui prennent en charge la génération de rapports interactifs pendant l'exécution des tests.

source: Called when the test case *test* is about to be run.
fr: Appelé lorsque le scénario de test *test* est sur le point d'être exécuté.

source: Called after the test case *test* has been executed, regardless of the outcome.
fr: Appelé après l'exécution du cas de test *test*, quel qu'en soit le résultat.

source: Called once before any tests are executed.
fr: Appelé une fois avant l'exécution des tests.

source: Called once after all tests are executed.
fr: Appelé une fois après l'exécution des tests.

source: Called when the test case *test* raises an unexpected exception. *err* is a tuple of the form returned by :func:`sys.exc_info`: ``(type, value, traceback)``.
fr: Appelé lorsque le cas de test *test* soulève une exception inattendue. *err* est un couple du formulaire renvoyé par :func:`sys.exc_info` : ``(type, valeur, traceback)``.

source: The default implementation appends a tuple ``(test, formatted_err)`` to the instance's :attr:`errors` attribute, where *formatted_err* is a formatted traceback derived from *err*.
fr: L'implémentation par défaut ajoute un couple ``(test, formatted_err)`` à l'attribut :attr:`errors` de l'instance, où *formatted_err* est une trace formatée à partir de *err*.

source: Called when the test case *test* signals a failure. *err* is a tuple of the form returned by :func:`sys.exc_info`: ``(type, value, traceback)``.
fr: Appelé lorsque le cas de test *test* soulève une exception inattendue. *err* est un triplet de la même forme que celui renvoyé par :func:`sys.exc_info` : ``(type, valeur, traceback)``.

source: The default implementation appends a tuple ``(test, formatted_err)`` to the instance's :attr:`failures` attribute, where *formatted_err* is a formatted traceback derived from *err*.
fr: L'implémentation par défaut ajoute un couple ``(test, formatted_err)`` à l'attribut :attr:`errors` de l'instance, où *formatted_err* est une trace formatée à partir de *err*.

source: Called when the test case *test* succeeds.
fr: Appelé lorsque le scénario de test *test* réussit.

source: The default implementation does nothing.
fr: L'implémentation par défaut ne fait rien.

source: Called when the test case *test* is skipped. *reason* is the reason the test gave for skipping.
fr: Appelé lorsque le scénario de test *test* est ignoré. *raison* est la raison pour laquelle le test donné à été ignoré.

source: The default implementation appends a tuple ``(test, reason)`` to the instance's :attr:`skipped` attribute.
fr: L'implémentation par défaut ajoute un couple ``(test, raison)`` à l'attribut :attr:`skipped` de l'instance.

source: Called when the test case *test* fails, but was marked with the :func:`expectedFailure` decorator.
fr: Appelé lorsque le scénario de test *test* échoue, mais qui a été marqué avec le décorateur :func:`expectedFailure`.

source: The default implementation appends a tuple ``(test, formatted_err)`` to the instance's :attr:`expectedFailures` attribute, where *formatted_err* is a formatted traceback derived from *err*.
fr: L'implémentation par défaut ajoute un couple ``(test, formatted_err)`` à l'attribut :attr:`errors` de l'instance, où *formatted_err* est une trace formatée à partir de *err*.

source: Called when the test case *test* was marked with the :func:`expectedFailure` decorator, but succeeded.
fr: Appelé lorsque le scénario de test *test* réussit, mais que ce scénario a été marqué avec le décorateur :func:`expectedFailure`.

source: The default implementation appends the test to the instance's :attr:`unexpectedSuccesses` attribute.
fr: L'implémentation par défaut ajoute le test à l'attribut :attr:`unexpectedSuccesses` de l'instance.

source: Called when a subtest finishes. *test* is the test case corresponding to the test method. *subtest* is a custom :class:`TestCase` instance describing the subtest.
fr: Appelé à la fin d'un sous-test. *test* est le cas de test correspondant à la méthode de test. *subtest* est une instance dérivée de :class:`TestCase` décrivant le sous-test.

source: If *outcome* is :const:`None`, the subtest succeeded. Otherwise, it failed with an exception where *outcome* is a tuple of the form returned by :func:`sys.exc_info`: ``(type, value, traceback)``.
fr: Si *outcome* est :const:`None`, le sous-test a réussi. Sinon, il a échoué avec une exception où *outcome* est un triplet du formulaire renvoyé par :func:`sys.exc_info` : ``(type, valeur, traceback)``.

source: The default implementation does nothing when the outcome is a success, and records subtest failures as normal failures.
fr: L'implémentation par défaut ne fait rien lorsque le résultat est un succès, et enregistre les échecs de sous-test comme des échecs normaux.

source: A concrete implementation of :class:`TestResult` used by the :class:`TextTestRunner`.
fr: Une implémentation concrète de :class:`TestResult` utilisé par la classe :class:`TextTestRunner`.

source: This class was previously named ``_TextTestResult``. The old name still exists as an alias but is deprecated.
fr: Cette classe s'appelait auparavant ``_TextTestResult``. L'ancien nom existe toujours en tant qu'alias, mais il est obsolète.

source: Instance of the :class:`TestLoader` class intended to be shared. If no customization of the :class:`TestLoader` is needed, this instance can be used instead of repeatedly creating new instances.
fr: Instance de la classe :class:`TestLoader` destinée à être partagée. Si aucune personnalisation de la classe :class:`TestLoader` n'est nécessaire, cette instance peut être utilisée au lieu de créer plusieurs fois de nouvelles instances.
