Repository: python/python-docs-fr
Catalog: library/unittest.po
Languages: fr

source: :mod:`unittest` --- Unit testing framework
fr: :mod:`unittest` — *Framework* de tests unitaires

source: **Source code:** :source:`Lib/unittest/__init__.py`
fr: **Code source :** :source:`Lib/unittest/__init__.py`

source: (If you are already familiar with the basic concepts of testing, you might want to skip to :ref:`the list of assert methods <assert-methods>`.)
fr: (Si vous êtes déjà familier des concepts de base concernant les tests, vous pouvez souhaiter passer à :ref:`la liste des méthodes <assert-methods>`.)

source: The :mod:`unittest` unit testing framework was originally inspired by JUnit and has a similar flavor as major unit testing frameworks in other languages. It supports test automation, sharing of setup and shutdown code for tests, aggregation of tests into collections, and independence of the tests from the reporting framework.
fr: Le cadre applicatif de tests unitaires :mod:`unittest` était au départ inspiré par *JUnit* et ressemble aux principaux *frameworks* de tests unitaires des autres langages. Il gère l'automatisation des tests, le partage de code pour la mise en place et la finalisation des tests, l'agrégation de tests en collections, et l'indépendance des tests par rapport au *framework* utilisé.

source: To achieve this, :mod:`unittest` supports some important concepts in an object-oriented way:
fr: Pour y parvenir, :mod:`unittest` gère quelques concepts importants avec une approche orientée objet :

source: test fixture
fr: aménagement de test (*fixture*)

source: A :dfn:`test fixture` represents the preparation needed to perform one or more tests, and any associated cleanup actions. This may involve, for example, creating temporary or proxy databases, directories, or starting a server process.
fr: Un :dfn:`aménagement de test <test fixture>` (*fixture* en anglais) désigne la préparation nécessaire au déroulement d'un ou plusieurs tests, et toutes les actions de nettoyage associées. Cela peut concerner, par exemple, la création de bases de données temporaires ou mandataires, de répertoires, ou le démarrage d'un processus serveur.

source: test case
fr: scénario de test

source: A :dfn:`test case` is the individual unit of testing. It checks for a specific response to a particular set of inputs. :mod:`unittest` provides a base class, :class:`TestCase`, which may be used to create new test cases.
fr: Un :dfn:`scénario de test` est l'élément de base des tests. Il attend une réponse spécifique pour un ensemble particulier d'entrées. :mod:`unittest` fournit une classe de base, :class:`TestCase`, qui peut être utilisée pour créer de nouveaux scénarios de test.

source: test suite
fr: suite de tests

source: A :dfn:`test suite` is a collection of test cases, test suites, or both. It is used to aggregate tests that should be executed together.
fr: Une :dfn:`suite de tests` est une collection de scénarios de test, de suites de tests ou les deux. Cela sert à regrouper les tests qui devraient être exécutés ensemble.

source: test runner
fr: lanceur de tests

source: A :dfn:`test runner` is a component which orchestrates the execution of tests and provides the outcome to the user. The runner may use a graphical interface, a textual interface, or return a special value to indicate the results of executing the tests.
fr: Un :dfn:`lanceur de tests` est un composant qui orchestre l'exécution des tests et fournit le résultat pour l'utilisateur. Le lanceur peut utiliser une interface graphique, une interface textuelle, ou renvoie une valeur spéciale pour indiquer les résultats de l'exécution des tests.

source: Another test-support module with a very different flavor.
fr: Un autre module de test adoptant une approche très différente.

source: Kent Beck's original paper on testing frameworks using the pattern shared by :mod:`unittest`.
fr: Le papier originel de Kent Beck sur les *frameworks* de test utilisant le modèle sur lequel s'appuie :mod:`unittest`.

source: Third-party unittest framework with a lighter-weight syntax for writing tests. For example, ``assert func(10) == 42``.
fr: Des cadres applicatifs tiers de tests unitaires avec une syntaxe allégée pour l'écriture des tests. Par exemple, ``assert func(10) == 42``.

source: An extensive list of Python testing tools including functional testing frameworks and mock object libraries.
fr: Une liste étendue des outils de test pour Python comprenant des *frameworks* de tests fonctionnels et des bibliothèques d'objets simulés (*mocks*).

source: A special-interest-group for discussion of testing, and testing tools, in Python.
fr: Un groupe de discussion dédié aux tests, et outils de test, en Python.

source: The script :file:`Tools/unittestgui/unittestgui.py` in the Python source distribution is a GUI tool for test discovery and execution. This is intended largely for ease of use for those new to unit testing. For production environments it is recommended that tests be driven by a continuous integration system such as `Buildbot <https://buildbot.net/>`_, `Jenkins <https://jenkins.io/>`_ or `Hudson <http://hudson-ci.org/>`_.
fr: Le script :file:`Tools/unittestgui/unittestgui.py` dans la distribution source de Python est un outil avec une interface graphique pour découvrir et exécuter des tests. Il est principalement conçu pour être facile d'emploi pour les débutants en matière de tests unitaires. Pour les environnements de production il est recommandé que les tests soient pilotés par un système d'intégration continue comme `Buildbot <https://buildbot.net/>`_, `Jenkins <https://jenkins.io/>`_ ou `Hudson <http://hudson-ci.org/>`_.

source: Basic example
fr: Exemple basique

source: The :mod:`unittest` module provides a rich set of tools for constructing and running tests. This section demonstrates that a small subset of the tools suffice to meet the needs of most users.
fr: Le module :mod:`unittest` fournit un riche ensemble d'outils pour construire et lancer des tests. Cette section montre qu'une petite partie des outils suffit pour satisfaire les besoins de la plupart des utilisateurs.

source: Here is a short script to test three string methods::
fr: Voici un court script pour tester trois méthodes de *string* ::

source: A testcase is created by subclassing :class:`unittest.TestCase`. The three individual tests are defined with methods whose names start with the letters ``test``. This naming convention informs the test runner about which methods represent tests.
fr: Un scénario de test est créé comme classe-fille de :class:`unittest.TestCase`. Les trois tests individuels sont définis par des méthodes dont les noms commencent par les lettres ``test``. Cette convention de nommage signale au lanceur de tests quelles méthodes sont des tests.

source: The crux of each test is a call to :meth:`~TestCase.assertEqual` to check for an expected result; :meth:`~TestCase.assertTrue` or :meth:`~TestCase.assertFalse` to verify a condition; or :meth:`~TestCase.assertRaises` to verify that a specific exception gets raised. These methods are used instead of the :keyword:`assert` statement so the test runner can accumulate all test results and produce a report.
fr: Le cœur de chaque test est un appel à :meth:`~TestCase.assertEqual` pour vérifier un résultat attendu ; :meth:`~TestCase.assertTrue` ou :meth:`~TestCase.assertFalse` pour vérifier une condition ; ou :meth:`~TestCase.assertRaises` pour vérifier qu'une exception particulière est levée. Ces méthodes sont utilisées à la place du mot-clé :keyword:`assert` pour que le lanceur de tests puisse récupérer les résultats de tous les tests et produire un rapport.

source: The :meth:`~TestCase.setUp` and :meth:`~TestCase.tearDown` methods allow you to define instructions that will be executed before and after each test method. They are covered in more detail in the section :ref:`organizing-tests`.
fr: Les méthodes :meth:`~TestCase.setUp` et :meth:`~TestCase.tearDown` vous autorisent à définir des instructions qui seront exécutées avant et après chaque méthode test. Elles sont davantage détaillées dans la section :ref:`organizing-tests`.

source: The final block shows a simple way to run the tests. :func:`unittest.main` provides a command-line interface to the test script. When run from the command line, the above script produces an output that looks like this::
fr: Le bloc final montre une manière simple de lancer les tests. :func:`unittest.main` fournit une interface en ligne de commande pour le script de test. Lorsqu'il est lancé en ligne de commande, le script ci-dessus produit une sortie qui ressemble à ceci ::

source: Passing the ``-v`` option to your test script will instruct :func:`unittest.main` to enable a higher level of verbosity, and produce the following output::
fr: Passer l'option ``-v`` à votre script de test informera :func:`unittest.main` qu'il doit fournir un niveau plus important de détails, et produit la sortie suivante ::

source: The above examples show the most commonly used :mod:`unittest` features which are sufficient to meet many everyday testing needs. The remainder of the documentation explores the full feature set from first principles.
fr: Les exemples ci-dessus montrent les fonctionnalités d':mod:`unittest` les plus communément utilisées et qui sont suffisantes pour couvrir les besoins courants en matière de test. Le reste de la documentation explore l'ensemble complet des fonctionnalités depuis les premiers principes.

source: Command-Line Interface
fr: Interface en ligne de commande

source: The unittest module can be used from the command line to run tests from modules, classes or even individual test methods::
fr: Le module *unittest* est utilisable depuis la ligne de commande pour exécuter des tests à partir de modules, de classes ou même de méthodes de test individuelles ::

source: You can pass in a list with any combination of module names, and fully qualified class or method names.
fr: La commande accepte en argument une liste de n'importe quelle combinaison de noms de modules et de noms de classes ou de méthodes entièrement qualifiés.

source: Test modules can be specified by file path as well::
fr: Les modules de test peuvent également être spécifiés par un chemin de fichier ::

source: This allows you to use the shell filename completion to specify the test module. The file specified must still be importable as a module. The path is converted to a module name by removing the '.py' and converting path separators into '.'. If you want to execute a test file that isn't importable as a module you should execute the file directly instead.
fr: Cette fonctionnalité permet d'utiliser la complétion de l'interpréteur de commandes système (*le shell*) pour spécifier le module de test. Le chemin est converti en nom de module en supprimant le ``.py`` et en convertissant les séparateurs de chemin en '.'. Si vous voulez exécuter un fichier test qui n'est pas importable en tant que module, exécutez directement le fichier.

source: You can run tests with more detail (higher verbosity) by passing in the -v flag::
fr: Pour obtenir plus de détails lors de l'exécution utilisez l'option `-v` (plus de verbosité) ::

source: When executed without arguments :ref:`unittest-test-discovery` is started::
fr: Quand la commande est exécutée sans arguments :ref:`unittest-test-discovery` est lancée ::

source: For a list of all the command-line options::
fr: Pour afficher la liste de toutes les options de la commande utilisez l'option `-h` ::

source: In earlier versions it was only possible to run individual test methods and not modules or classes.
fr: Dans les versions antérieures, il était seulement possible d'exécuter des méthodes de test individuelles et non des modules ou des classes.

source: Command-line options
fr: Options de la ligne de commande

source: :program:`unittest` supports these command-line options:
fr: Le programme : `unittest` gère ces options de la ligne de commande :

source: The standard output and standard error streams are buffered during the test run. Output during a passing test is discarded. Output is echoed normally on test fail or error and is added to the failure messages.
fr: Les flux de sortie et d'erreur standards sont mis en mémoire tampon pendant l'exécution des tests. L'affichage produit par un test réussi n'est pas pris en compte. Les sorties d'affichages d'un test en échec ou en erreur sont conservés et ajoutés aux messages d'erreur.

source: :kbd:`Control-C` during the test run waits for the current test to end and then reports all the results so far. A second :kbd:`Control-C` raises the normal :exc:`KeyboardInterrupt` exception.
fr: Utiliser :kbd:`Control-C` pendant l'exécution des tests attend que le test en cours se termine, puis affiche tous les résultats obtenus jusqu'ici. Une seconde utilisation de :kbd:`Control-C` provoque l'exception normale :exc:`KeyboardInterrupt`.

source: See `Signal Handling`_ for the functions that provide this functionality.
fr: Voir `Signal Handling`_ pour les fonctions qui utilisent cette fonctionnalité.

source: Stop the test run on the first error or failure.
fr: Arrête l'exécution des tests lors du premier cas d'erreur ou d'échec.

source: Only run test methods and classes that match the pattern or substring. This option may be used multiple times, in which case all test cases that match of the given patterns are included.
fr: Exécute uniquement les méthodes de test et les classes qui correspondent au motif ou à la chaîne de caractères. Cette option peut être utilisée plusieurs fois ; dans ce cas, tous les tests qui correspondent aux motifs donnés sont inclus.

source: Patterns that contain a wildcard character (``*``) are matched against the test name using :meth:`fnmatch.fnmatchcase`; otherwise simple case-sensitive substring matching is used.
fr: Les motifs qui contiennent un caractère de remplacement (``*``) sont comparés au nom du test en utilisant :meth:`fnmatch.fnmatchcase` ; sinon, une recherche simple de sous chaîne respectant la casse est faite.

source: Patterns are matched against the fully qualified test method name as imported by the test loader.
fr: Les motifs sont comparés au nom de la méthode de test complètement qualifiée tel qu'importé par le chargeur de test.

source: For example, ``-k foo`` matches ``foo_tests.SomeTest.test_something``, ``bar_tests.SomeTest.test_foo``, but not ``bar_tests.FooTest.test_something``.
fr: Par exemple, ``-k machin`` retient les tests ``machin_tests.UnTest.test_untruc``, ``truc_tests.UnTest.test_machin``, mais pas ``truc_tests.MachinTest.test_untruc``.

source: Show local variables in tracebacks.
fr: Affiche les variables locales dans les traces d'appels.

source: The command-line options ``-b``, ``-c`` and ``-f`` were added.
fr: Les options de ligne de commande ``-b``, ``-c`` et ``-f`` ont été ajoutées.

source: The command-line option ``--locals``.
fr: Ajout de l'option de ligne de commande ``--locals``.

source: The command-line option ``-k``.
fr: Ajout de l'option de ligne de commande ``-k``.

source: The command line can also be used for test discovery, for running all of the tests in a project or just a subset.
fr: La ligne de commande peut également être utilisée pour découvrir les tests, pour exécuter tous les tests dans un projet ou juste un sous-ensemble.

source: Test Discovery
fr: Découverte des tests

source: Unittest supports simple test discovery. In order to be compatible with test discovery, all of the test files must be :ref:`modules <tut-modules>` or :ref:`packages <tut-packages>` (including :term:`namespace packages <namespace package>`) importable from the top-level directory of the project (this means that their filenames must be valid :ref:`identifiers <identifiers>`).
fr: *Unittest* prend en charge une découverte simple des tests. Afin d'être compatible avec le système de découverte de tests, tous les fichiers de test doivent être des :ref:`modules <tut-modules>` ou des :ref:`paquets <tut-packages>` (incluant des :term:`paquets-espaces de nommage <namespace package>`) importables du répertoire du projet (cela signifie que leurs noms doivent être des :ref:`identifiants <identifiers>` valables).

source: Test discovery is implemented in :meth:`TestLoader.discover`, but can also be used from the command line. The basic command-line usage is::
fr: La découverte de tests est implémentée dans :meth:`TestLoader.discover`, mais peut également être utilisée depuis la ligne de commande. Par exemple ::

source: As a shortcut, ``python -m unittest`` is the equivalent of ``python -m unittest discover``. If you want to pass arguments to test discovery the ``discover`` sub-command must be used explicitly.
fr: Comme raccourci, ``python -m unittest`` est l'équivalent de ``python -m unittest discover``. Pour passer des arguments au système de découverte des tests, la sous-commande ``discover`` doit être utilisée explicitement.

source: The ``discover`` sub-command has the following options:
fr: La sous-commande ``discover`` a les options suivantes ::

source: Verbose output
fr: Affichage plus détaillé

source: Directory to start discovery (``.`` default)
fr: Répertoire racine pour démarrer la découverte (``.`` par défaut).

source: Pattern to match test files (``test*.py`` default)
fr: Motif de détection des fichiers de test (``test*.py`` par défaut)

source: Top level directory of project (defaults to start directory)
fr: Dossier du premier niveau du projet (Par défaut le dossier de départ)

source: The :option:`-s`, :option:`-p`, and :option:`-t` options can be passed in as positional arguments in that order. The following two command lines are equivalent::
fr: Les options :option:`-s`, :option:`-p` et :option:`-t` peuvent être passées en arguments positionnels dans cet ordre. Les deux lignes de commande suivantes sont équivalentes ::

source: As well as being a path it is possible to pass a package name, for example ``myproject.subpackage.test``, as the start directory. The package name you supply will then be imported and its location on the filesystem will be used as the start directory.
fr: Il est aussi possible de passer un nom de paquet plutôt qu'un chemin, par exemple ``monprojet.souspaquet.test``, comme répertoire racine. Le nom du paquet fourni est alors importé et son emplacement sur le système de fichiers est utilisé comme répertoire racine.

source: Test discovery loads tests by importing them. Once test discovery has found all the test files from the start directory you specify it turns the paths into package names to import. For example :file:`foo/bar/baz.py` will be imported as ``foo.bar.baz``.
fr: Le mécanisme de découverte charge les tests en les important. Une fois que le système a trouvé tous les fichiers de tests du répertoire de démarrage spécifié, il transforme les chemins en noms de paquets à importer. Par exemple :file:`truc/bidule/machin.py` est importé sous ``truc.bidule.machin``.

source: If you have a package installed globally and attempt test discovery on a different copy of the package then the import *could* happen from the wrong place. If this happens test discovery will warn you and exit.
fr: Si un paquet est installé globalement et que le mécanisme de découverte de tests est effectué sur une copie différente du paquet, l'importation *peut* se produire à partir du mauvais endroit. Si cela arrive, le système émet un avertissement et se termine.

source: If you supply the start directory as a package name rather than a path to a directory then discover assumes that whichever location it imports from is the location you intended, so you will not get the warning.
fr: Si vous donnez le répertoire racine sous la forme d'un nom de paquet plutôt que d'un chemin d'accès à un répertoire, alors Python suppose que l'emplacement à partir duquel il importe est l'emplacement que vous voulez, vous ne verrez donc pas l'avertissement.

source: Test modules and packages can customize test loading and discovery by through the `load_tests protocol`_.
fr: Les modules de test et les paquets peuvent adapter le chargement et la découverte des tests en utilisant le protocole `load_tests protocol`_.

source: Test discovery supports :term:`namespace packages <namespace package>`.
fr: La découverte de tests prend en charge :term:`les paquets-espaces de nommage <namespace package>`.

source: Organizing test code
fr: Organiser le code de test

source: The basic building blocks of unit testing are :dfn:`test cases` --- single scenarios that must be set up and checked for correctness. In :mod:`unittest`, test cases are represented by :class:`unittest.TestCase` instances. To make your own test cases you must write subclasses of :class:`TestCase` or use :class:`FunctionTestCase`.
fr: Les éléments de base des tests unitaires sont les :dfn:`scénarios de tests` (*test cases* en anglais) --- Des scénarios uniques qui sont mis en place et exécutés pour vérifier qu'ils sont corrects. Dans :mod:`unittest`, les scénarios de test sont représentés par des instances de :class:`unittest.TestCase`. Pour créer vos propres scénarios de test, vous devez écrire des sous-classes de :class:`TestCase` ou utiliser :class:`FunctionTestCase`.

source: The testing code of a :class:`TestCase` instance should be entirely self contained, such that it can be run either in isolation or in arbitrary combination with any number of other test cases.
fr: Le code de test d'une instance de :class:`TestCase` doit être entièrement autonome, de sorte qu'il puisse être exécuté soit de manière isolée, soit en combinaison arbitraire avec un nombre quelconque d'autres scénarios de test.

source: The simplest :class:`TestCase` subclass will simply implement a test method (i.e. a method whose name starts with ``test``) in order to perform specific testing code::
fr: La sous-classe :class:`TestCase` la plus simple va tout simplement implémenter une méthode de test (c'est-à-dire une méthode dont le nom commence par ``test``) afin d'exécuter un code de test spécifique ::

source: Note that in order to test something, we use one of the :meth:`assert\*` methods provided by the :class:`TestCase` base class. If the test fails, an exception will be raised with an explanatory message, and :mod:`unittest` will identify the test case as a :dfn:`failure`. Any other exceptions will be treated as :dfn:`errors`.
fr: Notez que pour tester quelque chose, on utilise l'une des méthodes :meth:`assert\*` fournies par la classe de base :class:`TestCase`. Si le test échoue, une exception est levée avec un message explicatif, et :mod:`unittest` identifie ce scénario de test comme un :dfn:`échec`. Toute autre exception est traitée comme une :dfn:`erreur`.

source: Tests can be numerous, and their set-up can be repetitive. Luckily, we can factor out set-up code by implementing a method called :meth:`~TestCase.setUp`, which the testing framework will automatically call for every single test we run::
fr: Les tests peuvent être nombreux et leur mise en place peut être répétitive. Heureusement, on peut factoriser le code de mise en place en implémentant une méthode appelée :meth:`~TestCase.setUp`, que le système de test appelle automatiquement pour chaque test exécuté ::

source: The order in which the various tests will be run is determined by sorting the test method names with respect to the built-in ordering for strings.
fr: L'ordre dans lequel les différents tests sont exécutés est déterminé en classant les noms des méthodes de test en fonction de la relation d'ordre des chaines de caractères .

source: If the :meth:`~TestCase.setUp` method raises an exception while the test is running, the framework will consider the test to have suffered an error, and the test method will not be executed.
fr: Si la méthode :meth:`~TestCase.setUp` lève une exception pendant l'exécution du test, le système considère que le test a subi une erreur, et la méthode test n'est pas exécutée.
