Repository: python/python-docs-fr
Catalog: library/unittest.po
Languages: fr

source: Test that *expr* is (or is not) ``None``.
fr: Vérifie que *expr* est (ou n'est pas) la valeur ``None``.

source: Test that *first* is (or is not) in *second*.
fr: Vérifie que *first* est (ou n'est pas) dans *second*.

source: Test that *obj* is (or is not) an instance of *cls* (which can be a class or a tuple of classes, as supported by :func:`isinstance`). To check for the exact type, use :func:`assertIs(type(obj), cls) <assertIs>`.
fr: Vérifie que *obj* est (ou n'est pas) une instance de *cls* (Ce qui peut être une classe ou un tuple de classes, comme utilisée par :func:`isinstance`). Pour vérifier le type exact, utilisez :func:`assertIs(type(obj), cls) <assertIs>`.

source: It is also possible to check the production of exceptions, warnings, and log messages using the following methods:
fr: Il est également possible de vérifier la production des exceptions, des avertissements et des messages de journaux à l'aide des méthodes suivantes :

source: ``fun(*args, **kwds)`` raises *exc*
fr: ``fun(*args, **kwds)`` lève bien l'exception *exc*

source: ``fun(*args, **kwds)`` raises *exc* and the message matches regex *r*
fr: ``fun(*args, **kwds)`` lève bien l'exception *exc* et que le message correspond au motif de l'expression régulière *r*

source: ``fun(*args, **kwds)`` raises *warn*
fr: ``fun(*args, **kwds)`` lève bien l'avertissement *warn*

source: ``fun(*args, **kwds)`` raises *warn* and the message matches regex *r*
fr: ``fun(*args, **kwds)`` lève bien l'avertissement *warn* et que le message correspond au motif de l'expression régulière *r*

source: The ``with`` block logs on *logger* with minimum *level*
fr: Le bloc ``with`` écrit dans le *logger* avec un niveau minimum égal à *level*

source: Test that an exception is raised when *callable* is called with any positional or keyword arguments that are also passed to :meth:`assertRaises`. The test passes if *exception* is raised, is an error if another exception is raised, or fails if no exception is raised. To catch any of a group of exceptions, a tuple containing the exception classes may be passed as *exception*.
fr: Vérifie qu'une exception est levée lorsque *callable* est appelé avec n'importe quel argument positionnel ou mot-clé qui est également passé à :meth:`assertRaises`. Le test réussit si *exception* est levée, est en erreur si une autre exception est levée, ou en échec si aucune exception n'est levée. Pour capturer une exception d'un groupe d'exceptions, un couple contenant les classes d'exceptions peut être passé à *exception*.

source: If only the *exception* and possibly the *msg* arguments are given, return a context manager so that the code under test can be written inline rather than as a function::
fr: Si seuls les arguments *exception* et éventuellement *msg* sont donnés, renvoie un gestionnaire de contexte pour que le code sous test puisse être écrit en ligne plutôt que comme une fonction ::

source: When used as a context manager, :meth:`assertRaises` accepts the additional keyword argument *msg*.
fr: Lorsqu'il est utilisé comme gestionnaire de contexte, :meth:`assertRaises` accepte l'argument de mot-clé supplémentaire *msg*.

source: The context manager will store the caught exception object in its :attr:`exception` attribute. This can be useful if the intention is to perform additional checks on the exception raised::
fr: Le gestionnaire de contexte enregistre l'exception capturée dans son attribut :attr:`exception`. Ceci est particulièrement utile si l'intention est d'effectuer des contrôles supplémentaires sur l'exception levée ::

source: Added the ability to use :meth:`assertRaises` as a context manager.
fr: Ajout de la possibilité d'utiliser :meth:`assertRaises` comme gestionnaire de contexte.

source: Added the :attr:`exception` attribute.
fr: Ajout de l'attribut :attr:`exception`.

source: Added the *msg* keyword argument when used as a context manager.
fr: Ajout de l'argument *msg* comme mot-clé lorsqu'il est utilisé comme gestionnaire de contexte.

source: Like :meth:`assertRaises` but also tests that *regex* matches on the string representation of the raised exception. *regex* may be a regular expression object or a string containing a regular expression suitable for use by :func:`re.search`. Examples::
fr: Comme :meth:`assertRaises` mais vérifie aussi que *regex* correspond à la représentation de la chaîne de caractères de l'exception levée. *regex* peut être un objet d'expression rationnelle ou une chaîne contenant une expression rationnelle appropriée pour être utilisée par :func:`re.search`. Exemples ::

source: or::
fr: ou ::

source: Added under the name ``assertRaisesRegexp``.
fr: Sous le nom ``assertRaisesRegexp``.

source: Renamed to :meth:`assertRaisesRegex`.
fr: Renommé en :meth:`assertRaisesRegex`.

source: Test that a warning is triggered when *callable* is called with any positional or keyword arguments that are also passed to :meth:`assertWarns`. The test passes if *warning* is triggered and fails if it isn't. Any exception is an error. To catch any of a group of warnings, a tuple containing the warning classes may be passed as *warnings*.
fr: Test qu'un avertissement est déclenché lorsque *callable* est appelé avec n'importe quel argument positionnel ou mot-clé qui est également passé à :meth:`assertWarns`. Le test passe si *warning* est déclenché et échoue s'il ne l'est pas. Toute exception est une erreur. Pour capturer un avertissement dans un ensemble d'avertissements, un couple contenant les classes d'avertissement peut être passé à *warnings*.

source: If only the *warning* and possibly the *msg* arguments are given, return a context manager so that the code under test can be written inline rather than as a function::
fr: Si seuls les arguments * warning* et éventuellement *msg* sont donnés, renvoie un gestionnaire de contexte pour que le code testé puisse être écrit en ligne plutôt que comme une fonction ::

source: When used as a context manager, :meth:`assertWarns` accepts the additional keyword argument *msg*.
fr: Lorsqu'il est utilisé comme gestionnaire de contexte, :meth:`assertWarns` accepte l'argument de mot-clé supplémentaire *msg*.

source: The context manager will store the caught warning object in its :attr:`warning` attribute, and the source line which triggered the warnings in the :attr:`filename` and :attr:`lineno` attributes. This can be useful if the intention is to perform additional checks on the warning caught::
fr: Le gestionnaire de contexte stocke l'avertissement capturé dans son attribut :attr:`warning`, et la ligne source qui a déclenché les avertissements dans les attributs :attr:`filename` et :attr:`lineno`. Cette fonction peut être utile si l'intention est d'effectuer des contrôles supplémentaires sur l'avertissement capturé ::

source: This method works regardless of the warning filters in place when it is called.
fr: Cette méthode fonctionne indépendamment des filtres d'avertissement en place lorsqu'elle est appelée.

source: Like :meth:`assertWarns` but also tests that *regex* matches on the message of the triggered warning. *regex* may be a regular expression object or a string containing a regular expression suitable for use by :func:`re.search`. Example::
fr: Comme :meth:`assertWarns` mais vérifie aussi qu'une *regex* corresponde au message de l'avertissement. *regex* peut être un objet d'expression régulière ou une chaîne contenant une expression régulière appropriée pour être utilisée par :func:`re.search`. Exemple ::

source: A context manager to test that at least one message is logged on the *logger* or one of its children, with at least the given *level*.
fr: Un gestionnaire de contexte pour tester qu'au moins un message est enregistré sur le *logger* ou un de ses enfants, avec au moins le *niveau* donné.

source: If given, *logger* should be a :class:`logging.Logger` object or a :class:`str` giving the name of a logger. The default is the root logger, which will catch all messages.
fr: Si donné, *logger* doit être une classe :class:`logging.logger` objet ou une classe :class:`str` donnant le nom d'un journal. La valeur par défaut est le journal racine *root*, qui capture tous les messages.

source: If given, *level* should be either a numeric logging level or its string equivalent (for example either ``"ERROR"`` or :attr:`logging.ERROR`). The default is :attr:`logging.INFO`.
fr: S'il est donné, *level* doit être soit un entier, soit son équivalent sous forme de chaîne (par exemple ``"ERROR"`` ou :attr:`logging.ERROR`). La valeur par défaut est :attr:`logging.INFO`.

source: The test passes if at least one message emitted inside the ``with`` block matches the *logger* and *level* conditions, otherwise it fails.
fr: Le test passe si au moins un message émis à l'intérieur du bloc ``with`` correspond aux conditions *logger* et *level*, sinon il échoue.

source: The object returned by the context manager is a recording helper which keeps tracks of the matching log messages. It has two attributes:
fr: L'objet retourné par le gestionnaire de contexte est une aide à l'enregistrement qui garde la trace des messages de journal correspondants. Il a deux attributs ::

source: A list of :class:`logging.LogRecord` objects of the matching log messages.
fr: Une liste d'objets :class:`logging.LogRecord` de messages de log correspondants.

source: A list of :class:`str` objects with the formatted output of matching messages.
fr: Une liste d'objets :class:`str` avec la sortie formatée des messages correspondants.

source: Example::
fr: Exemple ::

source: There are also other methods used to perform more specific checks, such as:
fr: Il existe également d'autres méthodes utilisées pour effectuer des contrôles plus spécifiques, telles que ::

source: *a* and *b* have the same elements in the same number, regardless of their order.
fr: *a* et *b* ont les mêmes éléments dans le même nombre, quel que soit leur ordre.

source: Test that *first* and *second* are approximately (or not approximately) equal by computing the difference, rounding to the given number of decimal *places* (default 7), and comparing to zero. Note that these methods round the values to the given number of *decimal places* (i.e. like the :func:`round` function) and not *significant digits*.
fr: Vérifie que *first* et *second* sont approximativement (ou pas approximativement) égaux en calculant la différence, en arrondissant au nombre donné de décimales *places* (par défaut 7), et en comparant à zéro. Notez que ces méthodes arrondissent les valeurs au nombre donné de *décimales* (par exemple comme la fonction :func:`round`) et non aux *chiffres significatifs*.

source: If *delta* is supplied instead of *places* then the difference between *first* and *second* must be less or equal to (or greater than) *delta*.
fr: Si *delta* est fourni au lieu de *places*, la différence entre *first* et *second* doit être inférieure ou égale (ou supérieure) à *delta*.

source: Supplying both *delta* and *places* raises a :exc:`TypeError`.
fr: Fournir à la fois *delta* et *places* lève une :exc:`TypeError`.

source: :meth:`assertAlmostEqual` automatically considers almost equal objects that compare equal. :meth:`assertNotAlmostEqual` automatically fails if the objects compare equal. Added the *delta* keyword argument.
fr: :meth:`assertAlmostEqual` considère automatiquement des objets presque égaux qui se comparent égaux. :meth:`assertNotNotAlmostEqual` échoue automatiquement si les objets qui se comparent sont égaux. Ajout de l'argument mot-clé *delta*.

source: Test that *first* is respectively >, >=, < or <= than *second* depending on the method name. If not, the test will fail::
fr: Vérifie que *first* est respectivement >, >=, >=, < ou <= à *second* selon le nom de la méthode. Sinon, le test échouera ::

source: Test that a *regex* search matches (or does not match) *text*. In case of failure, the error message will include the pattern and the *text* (or the pattern and the part of *text* that unexpectedly matched). *regex* may be a regular expression object or a string containing a regular expression suitable for use by :func:`re.search`.
fr: Vérifie qu'une recherche par motif *regex* correspond (ou ne correspond pas) à *text*. En cas d'échec, le message d'erreur inclura le motif et le *texte* (ou le motif et la partie du *texte* qui correspond de manière inattendue). *regex* peut être un objet d'expression régulière ou une chaîne contenant une expression régulière appropriée pour être utilisée par :func:`re.search`.

source: Added under the name ``assertRegexpMatches``.
fr: Ajouté sous le nom ``assertRegexpMatches``.

source: The method ``assertRegexpMatches()`` has been renamed to :meth:`.assertRegex`.
fr: La méthode ``assertRegexpMatches()`` a été renommé en :meth:`.assertRegex`.

source: The name ``assertNotRegexpMatches`` is a deprecated alias for :meth:`.assertNotRegex`.
fr: Le nom ``assertNotRegexpMatches``` est un alias obsolète pour :meth:`.assertNotRegex`.

source: Test that sequence *first* contains the same elements as *second*, regardless of their order. When they don't, an error message listing the differences between the sequences will be generated.
fr: Vérifie que la séquence *first* contient les mêmes éléments que *second*, quel que soit leur ordre. Si ce n'est pas le cas, un message d'erreur indiquant les différences entre les séquences est généré.

source: Duplicate elements are *not* ignored when comparing *first* and *second*. It verifies whether each element has the same count in both sequences. Equivalent to: ``assertEqual(Counter(list(first)), Counter(list(second)))`` but works with sequences of unhashable objects as well.
fr: Les éléments en double ne sont *pas* ignorés lors de la comparaison entre *first* et *second*. Il vérifie si chaque élément a le même nombre dans les deux séquences. Équivalent à : ``assertEqual(Counter(list(first))), Counter(list(second)))`` mais fonctionne aussi avec des séquences d'objets non *hachables*.

source: The :meth:`assertEqual` method dispatches the equality check for objects of the same type to different type-specific methods. These methods are already implemented for most of the built-in types, but it's also possible to register new methods using :meth:`addTypeEqualityFunc`:
fr: La méthode :meth:`assertEqual` envoie le contrôle d'égalité pour les objets du même type à différentes méthodes spécifiques au type. Ces méthodes sont déjà implémentées pour la plupart des types intégrés, mais il est également possible d'enregistrer de nouvelles méthodes en utilisant :meth:`addTypeEqualityFunc` ::

source: Registers a type-specific method called by :meth:`assertEqual` to check if two objects of exactly the same *typeobj* (not subclasses) compare equal. *function* must take two positional arguments and a third msg=None keyword argument just as :meth:`assertEqual` does. It must raise :data:`self.failureException(msg) <failureException>` when inequality between the first two parameters is detected -- possibly providing useful information and explaining the inequalities in details in the error message.
fr: Enregistre une méthode spécifique appelée par :meth:`assertEqual` pour vérifier si deux objets exactement du même *typeobj* (et non leurs sous-classes) sont égaux. *function* doit prendre deux arguments positionnels et un troisième argument mot-clé *msg=None* tout comme :meth:`assertEqual` le fait. Il doit lever :data:`self.failureException(msg) <failureException>` lorsqu'une inégalité entre les deux premiers paramètres est détectée en fournissant éventuellement des informations utiles et expliquant l'inégalité en détail dans le message d'erreur.

source: The list of type-specific methods automatically used by :meth:`~TestCase.assertEqual` are summarized in the following table. Note that it's usually not necessary to invoke these methods directly.
fr: La liste des méthodes spécifiques utilisées automatiquement par :meth:`~TestCase.assertEqual` est résumée dans le tableau suivant. Notez qu'il n'est généralement pas nécessaire d'invoquer ces méthodes directement.

source: Used to compare
fr: Utilisé pour comparer

source: strings
fr: chaînes

source: sequences
fr: séquences

source: lists
fr: listes

source: tuples
fr: n-uplets

source: sets or frozensets
fr: *sets* ou *frozensets*

source: dicts
fr: dictionnaires

source: Test that the multiline string *first* is equal to the string *second*. When not equal a diff of the two strings highlighting the differences will be included in the error message. This method is used by default when comparing strings with :meth:`assertEqual`.
fr: Vérifie que la chaîne sur plusieurs lignes *first* est égale à la chaîne *second*. Si les deux chaînes de caractères ne sont pas égales, un *diff* mettant en évidence les différences est inclus dans le message d'erreur. Cette méthode est utilisée par défaut pour comparer les chaînes avec :meth:`assertEqual`.

source: Tests that two sequences are equal. If a *seq_type* is supplied, both *first* and *second* must be instances of *seq_type* or a failure will be raised. If the sequences are different an error message is constructed that shows the difference between the two.
fr: Vérifie que deux séquences sont égales. Si un *seq_type* est fourni, *first* et *second* doivent tous deux être des instances de *seq_type* ou un échec est levé. Si les séquences sont différentes, un message d'erreur indiquant la différence entre les deux est généré.

source: This method is not called directly by :meth:`assertEqual`, but it's used to implement :meth:`assertListEqual` and :meth:`assertTupleEqual`.
fr: Cette méthode n'est pas appelée directement par :meth:`assertEqual`, mais sert à implémenter :meth:`assertListEqual` et :meth:`assertTupleEqual`.

source: Tests that two lists or tuples are equal. If not, an error message is constructed that shows only the differences between the two. An error is also raised if either of the parameters are of the wrong type. These methods are used by default when comparing lists or tuples with :meth:`assertEqual`.
fr: Vérifie que deux listes ou deux n-uplets sont égaux. Si ce n'est pas le cas, un message d'erreur qui ne montre que les différences entre les deux est généré. Une erreur est également signalée si l'un ou l'autre des paramètres n'est pas du bon type. Ces méthodes sont utilisées par défaut pour comparer des listes ou des couples avec :meth:`assertEqual`.

source: Tests that two sets are equal. If not, an error message is constructed that lists the differences between the sets. This method is used by default when comparing sets or frozensets with :meth:`assertEqual`.
fr: Vérifie que deux ensembles sont égaux. Si ce n'est pas le cas, un message d'erreur s'affiche et indique les différences entre les *sets*. Cette méthode est utilisée par défaut lors de la comparaison de *sets* ou de *frozensets* avec :meth:`assertEqual`.

source: Fails if either of *first* or *second* does not have a :meth:`set.difference` method.
fr: Échoue si l'un des objets *first* ou *second* n'a pas de méthode :meth:`set.difference`.

source: Test that two dictionaries are equal. If not, an error message is constructed that shows the differences in the dictionaries. This method will be used by default to compare dictionaries in calls to :meth:`assertEqual`.
fr: Vérifie que deux dictionnaires sont égaux. Si ce n'est pas le cas, un message d'erreur qui montre les différences dans les dictionnaires est généré. Cette méthode est utilisée par défaut pour comparer les dictionnaires dans les appels à :meth:`assertEqual`.

source: Finally the :class:`TestCase` provides the following methods and attributes:
fr: Enfin, la classe :class:`TestCase` fournit les méthodes et attributs suivants :

source: Signals a test failure unconditionally, with *msg* or ``None`` for the error message.
fr: Indique un échec du test sans condition, avec *msg* ou ``None`` pour le message d'erreur.

source: This class attribute gives the exception raised by the test method. If a test framework needs to use a specialized exception, possibly to carry additional information, it must subclass this exception in order to "play fair" with the framework. The initial value of this attribute is :exc:`AssertionError`.
fr: Cet attribut de classe donne l'exception levée par la méthode de test. Si un *framework* de tests doit utiliser une exception spécialisée, probablement pour enrichir l'exception d'informations additionnels., il doit hériter de cette classe d'exception pour *bien fonctionner* avec le *framework*. La valeur initiale de cet attribut est :exc:`AssertionError`.

source: This class attribute determines what happens when a custom failure message is passed as the msg argument to an assertXYY call that fails. ``True`` is the default value. In this case, the custom message is appended to the end of the standard failure message. When set to ``False``, the custom message replaces the standard message.
fr: Cet attribut de classe détermine ce qui se passe lorsqu'un message d'échec personnalisé est passé en argument au paramètre *msg* à un appel *assertXYYY* qui échoue. ``True`` est la valeur par défaut. Dans ce cas, le message personnalisé est ajouté à la fin du message d'erreur standard. Lorsqu'il est réglé sur ``False``, le message personnalisé remplace le message standard.

source: The class setting can be overridden in individual test methods by assigning an instance attribute, self.longMessage, to ``True`` or ``False`` before calling the assert methods.
fr: Le paramétrage de la classe peut être écrasé dans les méthodes de test individuelles en assignant un attribut d'instance, *self.longMessage*, à ``True`` ou ``False`` avant d'appeler les méthodes d'assertion.

source: The class setting gets reset before each test call.
fr: Le réglage de la classe est réinitialisé avant chaque appel de test.

source: This attribute controls the maximum length of diffs output by assert methods that report diffs on failure. It defaults to 80*8 characters. Assert methods affected by this attribute are :meth:`assertSequenceEqual` (including all the sequence comparison methods that delegate to it), :meth:`assertDictEqual` and :meth:`assertMultiLineEqual`.
fr: Cet attribut contrôle la longueur maximale des *diffs* en sortie des méthodes qui génèrent des *diffs* en cas d'échec. La valeur par défaut est 80*8 caractères. Les méthodes d'assertions affectées par cet attribut sont :meth:`assertSequenceEqual` (y compris toutes les méthodes de comparaison de séquences qui lui sont déléguées), :meth:`assertDictEqual` et :meth:`assertMultiLineEqual`.

source: Setting ``maxDiff`` to ``None`` means that there is no maximum length of diffs.
fr: Régler ``maxDiff`` sur ``None``` signifie qu'il n'y a pas de longueur maximale pour les *diffs*.

source: Testing frameworks can use the following methods to collect information on the test:
fr: Les *frameworks* de test peuvent utiliser les méthodes suivantes pour recueillir des informations sur le test :

source: Return the number of tests represented by this test object. For :class:`TestCase` instances, this will always be ``1``.
fr: Renvoie le nombre de tests représentés par cet objet test. Pour les instances de :class:`TestCase`, c'est toujours ``1``.

source: Return an instance of the test result class that should be used for this test case class (if no other result instance is provided to the :meth:`run` method).
fr: Retourne une instance de la classe de résultat de test qui doit être utilisée pour cette classe de cas de test (si aucune autre instance de résultat n'est fournie à la méthode :meth:`run`).
