Repository: python/python-docs-fr
Catalog: library/unittest.po
Languages: fr

source: A basic test runner implementation that outputs results to a stream. If *stream* is ``None``, the default, :data:`sys.stderr` is used as the output stream. This class has a few configurable parameters, but is essentially very simple. Graphical applications which run test suites should provide alternate implementations. Such implementations should accept ``**kwargs`` as the interface to construct runners changes when features are added to unittest.
fr: Une implémentation de base d'un lanceur de test qui fournit les résultats dans un flux. Si *stream* est ``None``, par défaut, :data:`sys.stderr` est utilisé comme flux de sortie. Cette classe a quelques paramètres configurables, mais est essentiellement très simple. Les applications graphiques qui exécutent des suites de tests doivent fournir des implémentations alternatives. De telles implémentations doivent accepter ``**kwargs`` car l'interface pour construire les lanceurs change lorsque des fonctionnalités sont ajoutées à *unittest*.

source: By default this runner shows :exc:`DeprecationWarning`, :exc:`PendingDeprecationWarning`, :exc:`ResourceWarning` and :exc:`ImportWarning` even if they are :ref:`ignored by default <warning-ignored>`. Deprecation warnings caused by :ref:`deprecated unittest methods <deprecated-aliases>` are also special-cased and, when the warning filters are ``'default'`` or ``'always'``, they will appear only once per-module, in order to avoid too many warning messages. This behavior can be overridden using Python's :option:`!-Wd` or :option:`!-Wa` options (see :ref:`Warning control <using-on-warnings>`) and leaving *warnings* to ``None``.
fr: Par défaut, ce lanceur affiche :exc:`DeprecationWarning`, :exc:`PendingDeprecationWarning`, :exc:`ResourceWarning` et :exc:`ImportWarning` même si elles sont :ref:`ignorées par défaut <warning-ignored>`. Les avertissements causés par :ref:`des méthodes *unittest* dépréciées <deprecated-aliases>` sont également spéciaux et, lorsque les filtres d'avertissement sont ``default`` ou ``always``, ils n'apparaissent qu'une fois par module, afin d'éviter trop de messages d'alerte. Ce comportement peut être annulé en utilisant les options :option:`!-Wd` ou :option:`!-Wa` de Python (voir :ref:`Gestion des avertissements <using-on-warnings>`) et en laissant *warnings* à ``None``.

source: Added the ``warnings`` argument.
fr: Ajout du paramètre ``warnings``.

source: The default stream is set to :data:`sys.stderr` at instantiation time rather than import time.
fr: Le flux par défaut est défini sur :data:`sys.stderr` au moment de l'instanciation plutôt qu'à l'importation.

source: Added the tb_locals parameter.
fr: Ajout du paramètre *tb_locals*.

source: This method returns the instance of ``TestResult`` used by :meth:`run`. It is not intended to be called directly, but can be overridden in subclasses to provide a custom ``TestResult``.
fr: Cette méthode renvoie l'instance de ``TestResult`` utilisée par :meth:`run`. Il n'est pas destiné à être appelé directement, mais peut être surchargée dans des sous-classes pour fournir un ``TestResult`` personnalisé.

source: ``_makeResult()`` instantiates the class or callable passed in the ``TextTestRunner`` constructor as the ``resultclass`` argument. It defaults to :class:`TextTestResult` if no ``resultclass`` is provided. The result class is instantiated with the following arguments::
fr: ``_makeResult()`` instancie la classe ou l'appelable passé dans le constructeur ``TextTestRunner`` comme argument ``resultclass``. Il vaut par défaut :class:`TextTestResult` si aucune ``resultclass`` n'est fournie. La classe de résultat est instanciée avec les arguments suivants ::

source: This method is the main public interface to the ``TextTestRunner``. This method takes a :class:`TestSuite` or :class:`TestCase` instance. A :class:`TestResult` is created by calling :func:`_makeResult` and the test(s) are run and the results printed to stdout.
fr: Cette méthode est l'interface publique principale du ``TextTestRunner``. Cette méthode prend une instance :class:`TestSuite` ou :class:`TestCase`. Un :class:`TestResult` est créé en appelant :func:`_makeResult` et le ou les tests sont exécutés et les résultats affichés sur la sortie standard.

source: A command-line program that loads a set of tests from *module* and runs them; this is primarily for making test modules conveniently executable. The simplest use for this function is to include the following line at the end of a test script::
fr: Un programme en ligne de commande qui charge un ensemble de tests à partir du *module* et les exécute. L'utilisation principale est de rendre les modules de test facilement exécutables. L'utilisation la plus simple pour cette fonction est d'inclure la ligne suivante à la fin d'un script de test ::

source: You can run tests with more detailed information by passing in the verbosity argument::
fr: Vous pouvez exécuter des tests avec des informations plus détaillées en utilisant l'option de verbosité ::

source: The *defaultTest* argument is either the name of a single test or an iterable of test names to run if no test names are specified via *argv*. If not specified or ``None`` and no test names are provided via *argv*, all tests found in *module* are run.
fr: L'argument *defaultTest* est soit le nom d'un seul test, soit un itérable de noms de test à exécuter si aucun nom de test n'est spécifié via *argv*. Si aucun nom de test n'est fourni via *argv*, tous les tests trouvés dans *module* sont exécutés.

source: The *argv* argument can be a list of options passed to the program, with the first element being the program name. If not specified or ``None``, the values of :data:`sys.argv` are used.
fr: L'argument *argv* peut être une liste d'options passées au programme, le premier élément étant le nom du programme. S'il n'est pas spécifié ou vaut ``None``, les valeurs de :data:`sys.argv` sont utilisées.

source: The *testRunner* argument can either be a test runner class or an already created instance of it. By default ``main`` calls :func:`sys.exit` with an exit code indicating success or failure of the tests run.
fr: L'argument *testRunner* peut être soit une classe de lanceur de test, soit une instance déjà créée de celle-ci. Par défaut, ``main`` appelle :func:`sys.exit` avec un code de sortie indiquant le succès ou l'échec des tests exécutés.

source: The *testLoader* argument has to be a :class:`TestLoader` instance, and defaults to :data:`defaultTestLoader`.
fr: L'argument *testLoader* doit être une instance de :class:`TestLoader`, et par défaut de :data:`defaultTestLoader`.

source: ``main`` supports being used from the interactive interpreter by passing in the argument ``exit=False``. This displays the result on standard output without calling :func:`sys.exit`::
fr: Les ``main`` sont utilisés à partir de l'interpréteur interactif en passant dans l'argument ``exit=False``. Ceci affiche le résultat sur la sortie standard sans appeler :func:`sys.exit` ::

source: The *failfast*, *catchbreak* and *buffer* parameters have the same effect as the same-name `command-line options`_.
fr: Les paramètres *failfast*, *catchbreak* et *buffer* ont le même effet que la même option en ligne de commande `command-line options`_.

source: The *warnings* argument specifies the :ref:`warning filter <warning-filter>` that should be used while running the tests. If it's not specified, it will remain ``None`` if a :option:`!-W` option is passed to :program:`python` (see :ref:`Warning control <using-on-warnings>`), otherwise it will be set to ``'default'``.
fr: L'argument *warnings* spécifie l'argument :ref:`filtre d'avertissement <warning-filter>` qui doit être utilisé lors de l'exécution des tests. Si elle n'est pas spécifiée, elle reste réglée sur ``None`` si une option :option:`!-W'` est passée à :program:`python` (voir :ref:`Utilisation des avertissements <using-on-warnings>`), sinon elle sera réglée sur ``'default'``.

source: Calling ``main`` actually returns an instance of the ``TestProgram`` class. This stores the result of the tests run as the ``result`` attribute.
fr: L'appel de ``main`` renvoie en fait une instance de la classe ``TestProgram``. Le résultat des tests effectués est enregistré sous l'attribut ``result``.

source: The *exit* parameter was added.
fr: Ajout du paramètre *exit*.

source: The *verbosity*, *failfast*, *catchbreak*, *buffer* and *warnings* parameters were added.
fr: Ajout des paramètres *verbosity*, *failfast*, *catchbreak*, *buffer* et *warnings*.

source: The *defaultTest* parameter was changed to also accept an iterable of test names.
fr: Le paramètre *defaultTest* a été modifié pour accepter également un itérable de noms de test.

source: load_tests Protocol
fr: Protocole de chargement des tests (*load_tests Protocol*)

source: Modules or packages can customize how tests are loaded from them during normal test runs or test discovery by implementing a function called ``load_tests``.
fr: Les modules ou paquets peuvent personnaliser la façon dont les tests sont chargés à partir de ceux-ci pendant l'exécution des tests ou pendant la découverte de tests en implémentant une fonction appelée ``load_tests``.

source: If a test module defines ``load_tests`` it will be called by :meth:`TestLoader.loadTestsFromModule` with the following arguments::
fr: Si un module de test définit ``load_tests`` il est appelé par :meth:`TestLoader.loadTestsFromModule` avec les arguments suivants ::

source: where *pattern* is passed straight through from ``loadTestsFromModule``. It defaults to ``None``.
fr: où *pattern* est passé directement depuis ``loadTestsFromModule``. La valeur par défaut est ``None``.

source: It should return a :class:`TestSuite`.
fr: Elle doit renvoyer une classe :class:`TestSuite`.

source: *loader* is the instance of :class:`TestLoader` doing the loading. *standard_tests* are the tests that would be loaded by default from the module. It is common for test modules to only want to add or remove tests from the standard set of tests. The third argument is used when loading packages as part of test discovery.
fr: *loader* est l'instance de :class:`TestLoader` qui effectue le chargement. *standard_tests* sont les tests qui sont chargés par défaut depuis le module. Il est courant que les modules de test veuillent seulement ajouter ou supprimer des tests de l'ensemble standard de tests. Le troisième argument est utilisé lors du chargement de paquets dans le cadre de la découverte de tests.

source: A typical ``load_tests`` function that loads tests from a specific set of :class:`TestCase` classes may look like::
fr: Une fonction typique de ``load_tests`` qui charge les tests d'un ensemble spécifique de classes :class:`TestCase` peut ressembler à ::

source: If discovery is started in a directory containing a package, either from the command line or by calling :meth:`TestLoader.discover`, then the package :file:`__init__.py` will be checked for ``load_tests``. If that function does not exist, discovery will recurse into the package as though it were just another directory. Otherwise, discovery of the package's tests will be left up to ``load_tests`` which is called with the following arguments::
fr: Si la découverte est lancée dans un répertoire contenant un paquet, soit à partir de la ligne de commande, soit en appelant :meth:`TestLoader.discover`, alors le système recherche dans le fichier du paquet :file:`__init__.py` la fonction ``load_tests``. Si cette fonction n'existe pas, la découverte se poursuit dans le paquet comme si c'était juste un autre répertoire. Sinon, la découverte des tests du paquet est effectuée par ``load_tests`` qui est appelé avec les arguments suivants ::

source: This should return a :class:`TestSuite` representing all the tests from the package. (``standard_tests`` will only contain tests collected from :file:`__init__.py`.)
fr: Doit renvoyer une classe :class:`TestSuite` représentant tous les tests du paquet. (``standard_tests`` ne contient que les tests collectés dans le fichier :file:`__init__.py`).

source: Because the pattern is passed into ``load_tests`` the package is free to continue (and potentially modify) test discovery. A 'do nothing' ``load_tests`` function for a test package would look like::
fr: Comme le motif est passé à ``load_tests``, le paquet est libre de continuer (et potentiellement de modifier) la découverte des tests. Une fonction « ne rien faire » ``load_tests`` pour un paquet de test ressemblerait à ::

source: Discovery no longer checks package names for matching *pattern* due to the impossibility of package names matching the default pattern.
fr: La découverte de test ne vérifie plus que les noms de paquets correspondent à *pattern* en raison de l'impossibilité de trouver des noms de paquets correspondant au motif par défaut.

source: Class and Module Fixtures
fr: Classes et modules d'aménagements des tests

source: Class and module level fixtures are implemented in :class:`TestSuite`. When the test suite encounters a test from a new class then :meth:`tearDownClass` from the previous class (if there is one) is called, followed by :meth:`setUpClass` from the new class.
fr: Les classes et modules d'aménagements des tests sont implémentés dans :class:`TestSuite`. Lorsque la suite de tests rencontre un test d'une nouvelle classe, alors :meth:`tearDownClass` de la classe précédente (s'il y en a une) est appelé, suivi de :meth:`setUpClass` de la nouvelle classe.

source: Similarly if a test is from a different module from the previous test then ``tearDownModule`` from the previous module is run, followed by ``setUpModule`` from the new module.
fr: De même, si un test provient d'un module différent du test précédent, alors ``tearDownModule`` du module précédent est exécuté, suivi par ``setUpModule`` du nouveau module.

source: After all the tests have run the final ``tearDownClass`` and ``tearDownModule`` are run.
fr: Après que tous les tests ont été exécutés, les ``tearDownClass`` et ``tearDownModule`` finaux sont exécutés.

source: Note that shared fixtures do not play well with [potential] features like test parallelization and they break test isolation. They should be used with care.
fr: Notez que les aménagements de tests partagés ne fonctionnent pas bien avec de « potentielles » fonctions comme la parallélisation de test et qu'ils brisent l'isolation des tests. Ils doivent être utilisés avec parcimonie.

source: The default ordering of tests created by the unittest test loaders is to group all tests from the same modules and classes together. This will lead to ``setUpClass`` / ``setUpModule`` (etc) being called exactly once per class and module. If you randomize the order, so that tests from different modules and classes are adjacent to each other, then these shared fixture functions may be called multiple times in a single test run.
fr: L'ordre par défaut des tests créés par les chargeurs de tests unitaires est de regrouper tous les tests des mêmes modules et classes. Cela à pour conséquence que ``setUpClass`` / ``setUpModule`` (etc) sont appelé exactement une fois par classe et module. Si vous rendez l'ordre aléatoire, de sorte que les tests de différents modules et classes soient adjacents les uns aux autres, alors ces fonctions d'aménagements partagées peuvent être appelées plusieurs fois dans un même test.

source: Shared fixtures are not intended to work with suites with non-standard ordering. A ``BaseTestSuite`` still exists for frameworks that don't want to support shared fixtures.
fr: Les aménagements de tests partagés ne sont pas conçus pour fonctionner avec des suites dont la commande n'est pas standard. Une ``BaseTestSuite`` existe toujours pour les cadriciels qui ne veulent pas gérer les aménagements de tests partagés.

source: If there are any exceptions raised during one of the shared fixture functions the test is reported as an error. Because there is no corresponding test instance an ``_ErrorHolder`` object (that has the same interface as a :class:`TestCase`) is created to represent the error. If you are just using the standard unittest test runner then this detail doesn't matter, but if you are a framework author it may be relevant.
fr: S'il y a des exceptions levées pendant l'une des fonctions d'aménagement de tests partagés, le test est signalé comme étant en erreur. Parce qu'il n'y a pas d'instance de test correspondante, un objet ``_ErrorHolder`` (qui a la même interface qu'une classe :class:`TestCase`) est créé pour représenter l'erreur. Si vous n'utilisez que le lanceur de test unitaire standard, ce détail n'a pas d'importance, mais si vous êtes un auteur de cadriciel de test, il peut être pertinent.

source: setUpClass and tearDownClass
fr: Classes de mise en place (*setUpClass*) et de démantèlement des tests (*tearDownClass*)

source: These must be implemented as class methods::
fr: Elles doivent être implémentées en tant que méthodes de classe ::

source: If you want the ``setUpClass`` and ``tearDownClass`` on base classes called then you must call up to them yourself. The implementations in :class:`TestCase` are empty.
fr: Si vous voulez que les classes de base ``setUpClass`` et ``tearDownClass`` soient appelées, vous devez les appeler vous-même. Les implémentations dans :class:`TestCase` sont vides.

source: If an exception is raised during a ``setUpClass`` then the tests in the class are not run and the ``tearDownClass`` is not run. Skipped classes will not have ``setUpClass`` or ``tearDownClass`` run. If the exception is a :exc:`SkipTest` exception then the class will be reported as having been skipped instead of as an error.
fr: Si une exception est levée pendant l'exécution de ``setUpClass`` alors les tests dans la classe ne sont pas exécutés et la classe ``tearDownClass`` n'est pas exécutée. Les classes ignorées n'auront pas d'exécution de ``setUpClass`` ou ``tearDownClass``. Si l'exception est une exception :exc:`SkipTest` alors la classe est signalée comme ayant été ignorée au lieu d'être en échec.

source: setUpModule and tearDownModule
fr: Module de mise en place (*setUpModule*) et de démantèlement des tests (*tearDownModule*)

source: These should be implemented as functions::
fr: Elles doivent être implémentées en tant que fonctions ::

source: If an exception is raised in a ``setUpModule`` then none of the tests in the module will be run and the ``tearDownModule`` will not be run. If the exception is a :exc:`SkipTest` exception then the module will be reported as having been skipped instead of as an error.
fr: Si une exception est levée pendant l'exécution de la fonction ``setUpModule`` alors aucun des tests du module ne sera exécuté et la fonction ``tearDownModule`` ne sera pas exécutée. Si l'exception est une exception :exc:`SkipTest` alors le module est signalé comme ayant été ignoré au lieu d'être en échec.

source: To add cleanup code that must be run even in the case of an exception, use ``addModuleCleanup``:
fr: Pour ajouter du code de nettoyage qui doit être exécuté même en cas d'exception, utilisez ``addModuleCleanup`` :

source: Add a function to be called after :func:`tearDownModule` to cleanup resources used during the test class. Functions will be called in reverse order to the order they are added (:abbr:`LIFO (last-in, first-out)`). They are called with any arguments and keyword arguments passed into :meth:`addModuleCleanup` when they are added.
fr: Ajout d'une fonction à appeler après :meth:`tearDownModule` pour nettoyer les ressources utilisées pendant le test. Les fonctions seront appelées dans l'ordre inverse de l'ordre dans lequel elles ont été ajoutées (:abbr:`LIFO (dernier entré, premier sorti)`). Elles sont appelées avec tous les arguments et arguments par mots-clés passés à :meth:`addModuleCleanup` quand elles sont ajoutées.

source: If :meth:`setUpModule` fails, meaning that :func:`tearDownModule` is not called, then any cleanup functions added will still be called.
fr: Si :meth:`setUpModule` échoue, impliquant que :meth:`tearDownModule` n'est pas appelée, alors les fonctions de nettoyage ajoutées sont quand même toujours appelées.

source: This function is called unconditionally after :func:`tearDownModule`, or after :func:`setUpModule` if :func:`setUpModule` raises an exception.
fr: Cette méthode est appelée sans conditions après :meth:`tearDownModule`, ou après :meth:`setUpModule` si :meth:`setUpModule` lève une exception.

source: It is responsible for calling all the cleanup functions added by :func:`addCleanupModule`. If you need cleanup functions to be called *prior* to :func:`tearDownModule` then you can call :func:`doModuleCleanups` yourself.
fr: Cette méthode est chargée d'appeler toutes les fonctions de nettoyage ajoutées par :meth:`addCleanupModule`. Si vous avez besoin de fonctions de nettoyage à appeler *avant* l'appel à :meth:`tearDownModule` alors vous pouvez appeler :meth:`doCleanupsModule` vous-même.

source: :func:`doModuleCleanups` pops methods off the stack of cleanup functions one at a time, so it can be called at any time.
fr: :meth:`doModuleCleanups` extrait les méthodes de la pile des fonctions de nettoyage une à la fois, de sorte qu'elles peuvent être appelées à tout moment.

source: Signal Handling
fr: Traitement des signaux

source: The :option:`-c/--catch <unittest -c>` command-line option to unittest, along with the ``catchbreak`` parameter to :func:`unittest.main()`, provide more friendly handling of control-C during a test run. With catch break behavior enabled control-C will allow the currently running test to complete, and the test run will then end and report all the results so far. A second control-c will raise a :exc:`KeyboardInterrupt` in the usual way.
fr: L'option :option:`-c/--catch <unittest -c>` en ligne de commande pour *unittest*, ainsi que le paramètre ``catchbreak`` vers :func:`unittest.main()`, permettent une utilisation simplifiée du contrôle-C pendant un test. Avec l'activation de ``catchbreak``, l'utilisation du contrôle-C permet de terminer le test en cours d'exécution, et le test se termine et rapporte tous les résultats obtenus jusqu'à présent. Un deuxième contrôle-C lève une exception classique :exc:`KeyboardInterrupt`.

source: The control-c handling signal handler attempts to remain compatible with code or tests that install their own :const:`signal.SIGINT` handler. If the ``unittest`` handler is called but *isn't* the installed :const:`signal.SIGINT` handler, i.e. it has been replaced by the system under test and delegated to, then it calls the default handler. This will normally be the expected behavior by code that replaces an installed handler and delegates to it. For individual tests that need ``unittest`` control-c handling disabled the :func:`removeHandler` decorator can be used.
fr: Le gestionnaire du signal *contrôle-C* tente de rester compatible avec le code ou les tests qui installent leur propre gestionnaire :const:`signal.SIGINT`. Si le gestionnaire ``unittest`` est appelé mais *n'est pas* le gestionnaire installé :const:`signal.SIGINT`, c'est-à-dire qu'il a été remplacé par le système sous test et délégué, alors il appelle le gestionnaire par défaut. C'est normalement le comportement attendu par un code qui remplace un gestionnaire installé et lui délègue. Pour les tests individuels qui ont besoin que le signal *contrôle-C* "*unittest*" soit désactivée, le décorateur :func:`removeHandler` peut être utilisé.

source: There are a few utility functions for framework authors to enable control-c handling functionality within test frameworks.
fr: Il existe quelques fonctions de support pour les auteurs de cadriciel afin d'activer la fonctionnalité de gestion des *contrôle-C* dans les cadriciels de test.
