Repository: python/python-docs-fr
Catalog: library/unittest.po
Languages: fr

source: Similarly, we can provide a :meth:`~TestCase.tearDown` method that tidies up after the test method has been run::
fr: De même, on peut fournir une méthode :meth:`~TestCase.tearDown` qui nettoie après l'exécution de la méthode de test ::

source: If :meth:`~TestCase.setUp` succeeded, :meth:`~TestCase.tearDown` will be run whether the test method succeeded or not.
fr: Si :meth:`~TestCase.setUp` a réussi, :meth:`~TestCase.tearDown` est exécutée, que la méthode de test ait réussi ou non.

source: Such a working environment for the testing code is called a :dfn:`test fixture`. A new TestCase instance is created as a unique test fixture used to execute each individual test method. Thus :meth:`~TestCase.setUp`, :meth:`~TestCase.tearDown`, and :meth:`~TestCase.__init__` will be called once per test.
fr: Un tel environnement de travail pour le code de test s'appelle un :dfn:`aménagement de test` (*fixture* en anglais). Une nouvelle instance de *TestCase* est créée sous la forme d'un dispositif de test unique utilisé pour exécuter chaque méthode de test individuelle. Ainsi :meth:`~TestCase.setUp`, :meth:`~TestCase.tearDown` et :meth:`~TestCase.__init__` ne sont appelées qu'une fois par test.

source: It is recommended that you use TestCase implementations to group tests together according to the features they test. :mod:`unittest` provides a mechanism for this: the :dfn:`test suite`, represented by :mod:`unittest`'s :class:`TestSuite` class. In most cases, calling :func:`unittest.main` will do the right thing and collect all the module's test cases for you and execute them.
fr: Il est recommandé d'utiliser *TestCase* pour regrouper les tests en fonction des fonctionnalités qu'ils testent. :mod:`unittest` fournit un mécanisme pour cela : la :dfn:`suite de tests`, représentée par :class:`TestSuite` du module :mod:`unittest`. Dans la plupart des cas, appeler :func:`unittest.main` fait correctement les choses et trouve tous les scénarios de test du module pour vous et les exécute.

source: However, should you want to customize the building of your test suite, you can do it yourself::
fr: Cependant, si vous voulez personnaliser la construction de votre suite de tests, vous pouvez le faire vous-même ::

source: You can place the definitions of test cases and test suites in the same modules as the code they are to test (such as :file:`widget.py`), but there are several advantages to placing the test code in a separate module, such as :file:`test_widget.py`:
fr: Vous pouvez placer les définitions des scénarios de test et des suites de test dans le même module que le code à tester (tel que :file:`composant.py`), mais il y a plusieurs avantages à placer le code de test dans un module séparé, tel que :file:`test_composant.py` :

source: The test module can be run standalone from the command line.
fr: Le module de test peut être exécuté indépendamment depuis la ligne de commande.

source: The test code can more easily be separated from shipped code.
fr: Le code de test est plus facilement séparable du code livré.

source: There is less temptation to change test code to fit the code it tests without a good reason.
fr: La tentation est moins grande de changer le code de test pour l'adapter au code qu'il teste sans avoir une bonne raison.

source: Test code should be modified much less frequently than the code it tests.
fr: Le code de test doit être modifié beaucoup moins souvent que le code qu'il teste.

source: Tested code can be refactored more easily.
fr: Le code testé peut être réusiné plus facilement.

source: Tests for modules written in C must be in separate modules anyway, so why not be consistent?
fr: Les tests pour les modules écrits en C doivent de toute façon être dans des modules séparés, alors pourquoi ne pas être cohérent ?

source: If the testing strategy changes, there is no need to change the source code.
fr: Si la stratégie de test change, il n'est pas nécessaire de changer le code source.

source: Re-using old test code
fr: Réutilisation d'ancien code de test

source: Some users will find that they have existing test code that they would like to run from :mod:`unittest`, without converting every old test function to a :class:`TestCase` subclass.
fr: Certains utilisateurs constatent qu'ils ont du code de test existant qu'ils souhaitent exécuter à partir de :mod:`unittest`, sans convertir chaque ancienne fonction de test en une sous-classe de :class:`TestCase`.

source: For this reason, :mod:`unittest` provides a :class:`FunctionTestCase` class. This subclass of :class:`TestCase` can be used to wrap an existing test function. Set-up and tear-down functions can also be provided.
fr: Pour cette raison, :mod:`unittest` fournit une classe :class:`FunctionTestCase`. Cette sous-classe de :class:`TestCase` peut être utilisée pour encapsuler une fonction de test existante. Des fonctions de mise en place (*setUp*) et de démantèlement (*tearDown*) peuvent également être fournies.

source: Given the following test function::
fr: Étant donnée la fonction de test suivante ::

source: one can create an equivalent test case instance as follows, with optional set-up and tear-down methods::
fr: on peut créer une instance de scénario de test équivalente, avec des méthodes optionnelles de mise en place et de démantèlement ::

source: Even though :class:`FunctionTestCase` can be used to quickly convert an existing test base over to a :mod:`unittest`\ -based system, this approach is not recommended. Taking the time to set up proper :class:`TestCase` subclasses will make future test refactorings infinitely easier.
fr: Même si la classe :class:`FunctionTestCase` peut être utilisée pour convertir rapidement une base de test existante vers un système basé sur :mod:`unittest`, cette approche n'est pas recommandée. Prendre le temps de bien configurer les sous-classes de :class:`TestCase` simplifiera considérablement les futurs réusinages des tests.

source: In some cases, the existing tests may have been written using the :mod:`doctest` module. If so, :mod:`doctest` provides a :class:`DocTestSuite` class that can automatically build :class:`unittest.TestSuite` instances from the existing :mod:`doctest`\ -based tests.
fr: Dans certains cas, les tests déjà existants ont pu être écrits avec le module :mod:`doctest`. Dans ce cas, :mod:`doctest` fournit une classe :class:`DocTestSuite` qui peut construire automatiquement des instances de la classe :class:`unittest.TestSuite` depuis des tests basés sur le module :mod:`doctest`.

source: Skipping tests and expected failures
fr: Ignorer des tests et des erreurs prévisibles

source: Unittest supports skipping individual test methods and even whole classes of tests. In addition, it supports marking a test as an "expected failure," a test that is broken and will fail, but shouldn't be counted as a failure on a :class:`TestResult`.
fr: *Unittest* permet d'ignorer des méthodes de test individuelles et même des classes entières de tests. De plus, il prend en charge le marquage d'un test comme étant une "erreur prévue". Un test qui est cassé et qui échoue, mais qui ne doit pas être considéré comme un échec dans la classe :class:`TestResult`.

source: Skipping a test is simply a matter of using the :func:`skip` :term:`decorator` or one of its conditional variants, calling :meth:`TestCase.skipTest` within a :meth:`~TestCase.setUp` or test method, or raising :exc:`SkipTest` directly.
fr: Ignorer un test consiste à soit utiliser le :term:`décorateur <decorator>` :func:`skip` ou une de ses variantes conditionnelles, soit appeler :meth:`TestCase.skipTest` à l'intérieur d'une méthode :meth:`~TestCase.setUp` ou de test, soit lever :exc:`SkipTest` directement.

source: Basic skipping looks like this::
fr: Un exemple de tests à ignorer ::

source: This is the output of running the example above in verbose mode::
fr: Ceci est le résultat de l'exécution de l'exemple ci-dessus en mode verbeux ::

source: Classes can be skipped just like methods::
fr: Les classes peuvent être ignorées tout comme les méthodes ::

source: :meth:`TestCase.setUp` can also skip the test. This is useful when a resource that needs to be set up is not available.
fr: La méthode :meth:`TestCase.setUp` permet également d'ignorer le test. Ceci est utile lorsqu'une ressource qui doit être configurée n'est pas disponible.

source: Expected failures use the :func:`expectedFailure` decorator. ::
fr: Les erreurs prévisibles utilisent le décorateur :func:`expectedFailure` ::

source: It's easy to roll your own skipping decorators by making a decorator that calls :func:`skip` on the test when it wants it to be skipped. This decorator skips the test unless the passed object has a certain attribute::
fr: Il est facile de faire ses propres décorateurs en créant un décorateur qui appelle :func:`skip` sur le test que vous voulez ignorer. Par exemple, ce décorateur ignore le test à moins que l'objet passé ne possède un certain attribut ::

source: The following decorators and exception implement test skipping and expected failures:
fr: Les décorateurs et exceptions suivants implémentent le système d'omission des tests et les erreurs prévisibles ::

source: Unconditionally skip the decorated test. *reason* should describe why the test is being skipped.
fr: Ignore sans condition le test décoré. *La raison* doit décrire la raison pour laquelle le test est omis.

source: Skip the decorated test if *condition* is true.
fr: Ignore le test décoré si la *condition* est vraie.

source: Skip the decorated test unless *condition* is true.
fr: Ignore le test décoré sauf si la *condition* est vraie.

source: Mark the test as an expected failure. If the test fails it will be considered a success. If the test passes, it will be considered a failure.
fr: Marque le test comme étant un erreur attendue. Si le test échoue il est considéré comme un succès. S'il passe, il est considéré comme étant en échec.

source: This exception is raised to skip a test.
fr: Cette exception est levée pour ignorer un test.

source: Usually you can use :meth:`TestCase.skipTest` or one of the skipping decorators instead of raising this directly.
fr: Habituellement, on utilise :meth:`TestCase.skipTest` ou l'un des décorateurs d'omission au lieu de le lever une exception directement.

source: Skipped tests will not have :meth:`~TestCase.setUp` or :meth:`~TestCase.tearDown` run around them. Skipped classes will not have :meth:`~TestCase.setUpClass` or :meth:`~TestCase.tearDownClass` run. Skipped modules will not have :func:`setUpModule` or :func:`tearDownModule` run.
fr: Les tests ignorés ne lancent ni :meth:`~TestCase.setUp` ni :meth:`~TestCase.tearDown`. Les classes ignorées ne lancent ni :meth:`~TestCase.setUpClass` ni :meth:`~TestCase.tearDownClass`. Les modules sautés n'ont pas :func:`setUpModule` ou :func:`tearDownModule` d'exécutés.

source: Distinguishing test iterations using subtests
fr: Distinguer les itérations de test à l'aide de sous-tests

source: When there are very small differences among your tests, for instance some parameters, unittest allows you to distinguish them inside the body of a test method using the :meth:`~TestCase.subTest` context manager.
fr: Lorsque certains de vos tests ne diffèrent que par de très petites différences, par exemple certains paramètres, *unittest* vous permet de les distinguer en utilisant le gestionnaire de contexte :meth:`~TestCase.subTest` dans le corps d'une méthode de test.

source: For example, the following test::
fr: Par exemple, le test suivant ::

source: will produce the following output::
fr: produit le résultat suivant ::

source: Without using a subtest, execution would stop after the first failure, and the error would be less easy to diagnose because the value of ``i`` wouldn't be displayed::
fr: Sans l'utilisation d'un sous-test, l'exécution se termine après le premier échec, et l'erreur est moins facile à diagnostiquer car la valeur de ``i`` ne s'affiche pas ::

source: Classes and functions
fr: Classes et fonctions

source: This section describes in depth the API of :mod:`unittest`.
fr: Cette section décrit en détail l'API de :mod:`unittest`.

source: Test cases
fr: Scénarios de tests

source: Instances of the :class:`TestCase` class represent the logical test units in the :mod:`unittest` universe. This class is intended to be used as a base class, with specific tests being implemented by concrete subclasses. This class implements the interface needed by the test runner to allow it to drive the tests, and methods that the test code can use to check for and report various kinds of failure.
fr: Les instances de la classe :class:`TestCase` représentent des tests logiques unitaires dans l'univers :mod:`unittest`. Cette classe est conçue pour être utilisée comme classe de base. Les scénarios de tests sont à implémenter en héritant de cette classe. La classe implémente l'interface nécessaire au lanceur de tests pour lui permettre de les exécuter ainsi que les méthodes que le code de test peut utiliser pour vérifier et signaler les différents types d'erreurs.

source: Each instance of :class:`TestCase` will run a single base method: the method named *methodName*. In most uses of :class:`TestCase`, you will neither change the *methodName* nor reimplement the default ``runTest()`` method.
fr: Chaque instance de la classe :class:`TestCase` n'exécute qu'une seule méthode de base : la méthode nommée *methodName* . Dans la plupart des utilisations de la classe :class:`TestCase`, vous n'avez pas à changer le nom de la méthode, ni à réimplémenter la méthode ``runTest()``.

source: :class:`TestCase` can be instantiated successfully without providing a *methodName*. This makes it easier to experiment with :class:`TestCase` from the interactive interpreter.
fr: La classe :class:`TestCase` peut désormais être utilisée sans passer de paramètre *methodName*. Cela facilite l'usage de :class:`TestCase` dans l'interpréteur interactif.

source: :class:`TestCase` instances provide three groups of methods: one group used to run the test, another used by the test implementation to check conditions and report failures, and some inquiry methods allowing information about the test itself to be gathered.
fr: Les instances de la classe :class:`TestCase` fournissent trois groupes de méthodes : un groupe utilisé pour exécuter le test, un autre utilisé par l'implémentation du test pour vérifier les conditions et signaler les échecs, et quelques méthodes de recherche permettant de recueillir des informations sur le test lui-même.

source: Methods in the first group (running the test) are:
fr: Les méthodes du premier groupe (exécution du test) sont :

source: Method called to prepare the test fixture. This is called immediately before calling the test method; other than :exc:`AssertionError` or :exc:`SkipTest`, any exception raised by this method will be considered an error rather than a test failure. The default implementation does nothing.
fr: Méthode appelée pour réaliser la mise en place du test. Elle est exécutée immédiatement avant l'appel de la méthode de test ; à l'exception de :exc:`AssertionError` ou :exc:`SkipTest`, toute exception levée par cette méthode est considérée comme une erreur et non pas comme un échec du test. L'implémentation par défaut ne fait rien.

source: Method called immediately after the test method has been called and the result recorded. This is called even if the test method raised an exception, so the implementation in subclasses may need to be particularly careful about checking internal state. Any exception, other than :exc:`AssertionError` or :exc:`SkipTest`, raised by this method will be considered an additional error rather than a test failure (thus increasing the total number of reported errors). This method will only be called if the :meth:`setUp` succeeds, regardless of the outcome of the test method. The default implementation does nothing.
fr: Méthode appelée immédiatement après l'appel de la méthode de test et l'enregistrement du résultat. Elle est appelée même si la méthode de test a levé une exception. De fait, l'implémentation d'un sous-classes doit être fait avec précaution si vous vérifiez l'état interne de la classe. Toute exception, autre que :exc:`AssertionError` ou :exc:`SkipTest`, levée par cette méthode est considérée comme une erreur supplémentaire plutôt que comme un échec du test (augmentant ainsi le nombre total des erreurs signalées). Cette méthode est appelée uniquement si l'exécution de :meth:`setUp` est réussie quel que soit le résultat de la méthode de test. L'implémentation par défaut ne fait rien.

source: A class method called before tests in an individual class are run. ``setUpClass`` is called with the class as the only argument and must be decorated as a :func:`classmethod`::
fr: Méthode de classe appelée avant l'exécution des tests dans la classe en question. ``setUpClass`` est appelée avec la classe comme seul argument et doit être décorée comme une :func:`classmethod` ::

source: See `Class and Module Fixtures`_ for more details.
fr: Voir `Class and Module Fixtures`_ pour plus de détails.

source: A class method called after tests in an individual class have run. ``tearDownClass`` is called with the class as the only argument and must be decorated as a :meth:`classmethod`::
fr: Méthode de classe appelée après l'exécution des tests de la classe en question. ``tearDownClass`` est appelée avec la classe comme seul argument et doit être décorée comme une :meth:`classmethod` ::

source: Run the test, collecting the result into the :class:`TestResult` object passed as *result*. If *result* is omitted or ``None``, a temporary result object is created (by calling the :meth:`defaultTestResult` method) and used. The result object is returned to :meth:`run`'s caller.
fr: Exécute le test, en collectant le résultat dans l'objet :class:`TestResult` passé comme *result*. Si *result* est omis ou vaut ``None``, un objet temporaire de résultat est créé (en appelant la méthode :meth:`defaultTestResult`) et utilisé. L'objet résultat est renvoyé à l'appelant de :meth:`run`.

source: The same effect may be had by simply calling the :class:`TestCase` instance.
fr: Le même effet peut être obtenu en appelant simplement l'instance :class:`TestCase`.

source: Previous versions of ``run`` did not return the result. Neither did calling an instance.
fr: Les versions précédentes de ``run`` ne renvoyaient pas le résultat. Pas plus que l'appel d'une instance.

source: Calling this during a test method or :meth:`setUp` skips the current test. See :ref:`unittest-skipping` for more information.
fr: Appeler cette fonction pendant l'exécution d'une méthode de test ou de :meth:`setUp` permet d'ignorer le test en cours. Voir :ref:`unittest-skipping` pour plus d'informations.

source: Return a context manager which executes the enclosed code block as a subtest. *msg* and *params* are optional, arbitrary values which are displayed whenever a subtest fails, allowing you to identify them clearly.
fr: Renvoie un gestionnaire de contexte qui exécute le bloc de code du contexte comme un sous-test. *msg* et *params* sont des valeurs optionnelles et arbitraires qui sont affichées chaque fois qu'un sous-test échoue, permettant de les identifier clairement.

source: A test case can contain any number of subtest declarations, and they can be arbitrarily nested.
fr: Un scénario de test peut contenir un nombre quelconque de déclarations de sous-test, et elles peuvent être imbriquées librement.

source: See :ref:`subtests` for more information.
fr: Voir :ref:`subtests` pour plus d'informations.

source: Run the test without collecting the result. This allows exceptions raised by the test to be propagated to the caller, and can be used to support running tests under a debugger.
fr: Lance le test sans collecter le résultat. Ceci permet aux exceptions levées par le test d'être propagées à l'appelant, et donc peut être utilisé pour exécuter des tests sous un débogueur.

source: The :class:`TestCase` class provides several assert methods to check for and report failures. The following table lists the most commonly used methods (see the tables below for more assert methods):
fr: La classe :class:`TestCase` fournit plusieurs méthodes d'assertion pour vérifier et signaler les échecs. Le tableau suivant énumère les méthodes les plus couramment utilisées (voir les tableaux ci-dessous pour plus de méthodes d'assertion) :

source: Method
fr: Méthode

source: Checks that
fr: Vérifie que

source: New in
fr: Disponible en

source: All the assert methods accept a *msg* argument that, if specified, is used as the error message on failure (see also :data:`longMessage`). Note that the *msg* keyword argument can be passed to :meth:`assertRaises`, :meth:`assertRaisesRegex`, :meth:`assertWarns`, :meth:`assertWarnsRegex` only when they are used as a context manager.
fr: Toutes les méthodes *assert* prennent en charge un argument *msg* qui, s'il est spécifié, est utilisé comme message d'erreur en cas d'échec (voir aussi :data:`longMessage`). Notez que l'argument mot-clé *msg* peut être passé à :meth:`assertRaises`, :meth:`assertRaisesRegex`, :meth:`assertWarns`, :meth:`assertWarnsRegex`, seulement quand elles sont utilisées comme gestionnaire de contexte.

source: Test that *first* and *second* are equal. If the values do not compare equal, the test will fail.
fr: Vérifie que *first* et *second* sont égaux. Si les valeurs ne sont pas égales, le test échouera.

source: In addition, if *first* and *second* are the exact same type and one of list, tuple, dict, set, frozenset or str or any type that a subclass registers with :meth:`addTypeEqualityFunc` the type-specific equality function will be called in order to generate a more useful default error message (see also the :ref:`list of type-specific methods <type-specific-methods>`).
fr: En outre, si *first* et *second* ont exactement le même type et sont de type *liste*, *tuple*, *dict*, *set*, *frozenset* ou *str* ou tout autre type de sous classe enregistrée dans :meth:`addTypeEqualityFunc`. La fonction égalité spécifique au type sera appelée pour générer une erreur plus utile (voir aussi :ref:`liste des méthodes spécifiques de type <type-specific-methods>`).

source: Added the automatic calling of type-specific equality function.
fr: Ajout de l'appel automatique de la fonction d'égalité spécifique au type.

source: :meth:`assertMultiLineEqual` added as the default type equality function for comparing strings.
fr: Ajout de :meth:`assertMultiLineEqual` comme fonction d'égalité de type par défaut pour comparer les chaînes.

source: Test that *first* and *second* are not equal. If the values do compare equal, the test will fail.
fr: Vérifie que *first* et *second* ne sont pas égaux. Si les valeurs sont égales, le test échouera.

source: Test that *expr* is true (or false).
fr: Vérifie que *expr* est vraie (ou fausse).

source: Note that this is equivalent to ``bool(expr) is True`` and not to ``expr is True`` (use ``assertIs(expr, True)`` for the latter). This method should also be avoided when more specific methods are available (e.g. ``assertEqual(a, b)`` instead of ``assertTrue(a == b)``), because they provide a better error message in case of failure.
fr: Notez que cela revient à utiliser ``bool(expr) is True`` et non à ``expr is True`` (utilisez ``assertIs(expr, True)`` pour cette dernière). Cette méthode doit également être évitée lorsque des méthodes plus spécifiques sont disponibles (par exemple ``assertEqual(a, b)`` au lieu de ``assertTrue(a == b)``), car elles fournissent un meilleur message d'erreur en cas d' échec.

source: Test that *first* and *second* evaluate (or don't evaluate) to the same object.
fr: Vérifie que *first* et *second* évaluent (ou n'évaluent pas) le même objet.
