Repository: python/python-docs-fr
Catalog: library/unittest.po
Languages: fr

source: Install the control-c handler. When a :const:`signal.SIGINT` is received (usually in response to the user pressing control-c) all registered results have :meth:`~TestResult.stop` called.
fr: Installe le gestionnaire *contrôle-c*. Quand un :const:`signal.SIGINT` est reçu (généralement en réponse à l'utilisateur appuyant sur *contrôle-c*) tous les résultats enregistrés vont appeler la méthode :meth:`~TestResult.stop`.

source: Register a :class:`TestResult` object for control-c handling. Registering a result stores a weak reference to it, so it doesn't prevent the result from being garbage collected.
fr: Enregistre un objet :class:`TestResult` pour la gestion du *contrôle-C*. L'enregistrement d'un résultat stocke une référence faible sur celui-ci, de sorte qu'il n'empêche pas que le résultat soit collecté par le ramasse-miette.

source: Registering a :class:`TestResult` object has no side-effects if control-c handling is not enabled, so test frameworks can unconditionally register all results they create independently of whether or not handling is enabled.
fr: L'enregistrement d'un objet :class:`TestResult` n'a pas d'effets de bord si la gestion du *contrôle-c* n'est pas activée, donc les cadriciels de test peuvent enregistrer sans condition tous les résultats qu'ils créent indépendamment du fait que la gestion soit activée ou non.

source: Remove a registered result. Once a result has been removed then :meth:`~TestResult.stop` will no longer be called on that result object in response to a control-c.
fr: Supprime un résultat enregistré. Une fois qu'un résultat a été supprimé, :meth:`~TestResult.stop` n'est plus appelé sur cet objet résultat en réponse à un *contrôle-c*.

source: When called without arguments this function removes the control-c handler if it has been installed. This function can also be used as a test decorator to temporarily remove the handler while the test is being executed::
fr: Lorsqu'elle est appelée sans arguments, cette fonction supprime le gestionnaire *contrôle-c* s'il a été installé. Cette fonction peut également être utilisée comme décorateur de test pour supprimer temporairement le gestionnaire pendant l'exécution du test ::
