Repository: python/python-docs-fr
Catalog: library/unittest.po
Languages: fr

source: For :class:`TestCase` instances, this will always be an instance of :class:`TestResult`; subclasses of :class:`TestCase` should override this as necessary.
fr: Pour les instances de :class:`TestCase`, c'est toujours une instance de :class:`TestResult` ; les sous-classes de :class:`TestCase` peuvent la remplacer au besoin.

source: Return a string identifying the specific test case. This is usually the full name of the test method, including the module and class name.
fr: Retourne une chaîne identifiant le cas de test spécifique. Il s'agit généralement du nom complet de la méthode de test, y compris le nom du module et de la classe.

source: Returns a description of the test, or ``None`` if no description has been provided. The default implementation of this method returns the first line of the test method's docstring, if available, or ``None``.
fr: Renvoie une description du test, ou ``None`` si aucune description n'a été fournie. L'implémentation par défaut de cette méthode renvoie la première ligne de la *docstring* de la méthode de test, si disponible, ou ``None``.

source: In 3.1 this was changed to add the test name to the short description even in the presence of a docstring. This caused compatibility issues with unittest extensions and adding the test name was moved to the :class:`TextTestResult` in Python 3.2.
fr: En 3.1, ceci a été modifié pour ajouter le nom du test à la description courte, même en présence d'une *docstring*. Cela a causé des problèmes de compatibilité avec les extensions *unittest* et l'ajout du nom du test a été déplacé dans la classe :class:`TextTestResult` dans Python 3.2.

source: Add a function to be called after :meth:`tearDown` to cleanup resources used during the test. Functions will be called in reverse order to the order they are added (:abbr:`LIFO (last-in, first-out)`). They are called with any arguments and keyword arguments passed into :meth:`addCleanup` when they are added.
fr: Ajout d'une fonction à appeler après :meth:`tearDown` pour nettoyer les ressources utilisées pendant le test. Les fonctions seront appelées dans l'ordre inverse de l'ordre dans lequel elles ont été ajoutées (:abbr:`LIFO (dernier entré, premier sorti)`). Elles sont appelées avec tous les arguments et arguments de mots-clés passés à :meth:`addCleanup` quand elles sont ajoutées.

source: If :meth:`setUp` fails, meaning that :meth:`tearDown` is not called, then any cleanup functions added will still be called.
fr: Si :meth:`setUp` échoue, cela signifie que :meth:`tearDown` n'est pas appelé, alors que les fonctions de nettoyage ajoutées seront toujours appelées.

source: This method is called unconditionally after :meth:`tearDown`, or after :meth:`setUp` if :meth:`setUp` raises an exception.
fr: Cette méthode est appelée sans conditions après :meth:`tearDown`, ou après :meth:`setUp` si :meth:`setUp` lève une exception.

source: It is responsible for calling all the cleanup functions added by :meth:`addCleanup`. If you need cleanup functions to be called *prior* to :meth:`tearDown` then you can call :meth:`doCleanups` yourself.
fr: Cette méthode est chargée d'appeler toutes les fonctions de nettoyage ajoutées par :meth:`addCleanup`. Si vous avez besoin de fonctions de nettoyage à appeler *avant* l'appel à :meth:`tearDown` alors vous pouvez appeler :meth:`doCleanups` vous-même.

source: :meth:`doCleanups` pops methods off the stack of cleanup functions one at a time, so it can be called at any time.
fr: :meth:`doCleanups` extrait les méthodes de la pile des fonctions de nettoyage une à la fois, de sorte qu'elles peuvent être appelées à tout moment.

source: Add a function to be called after :meth:`tearDownClass` to cleanup resources used during the test class. Functions will be called in reverse order to the order they are added (:abbr:`LIFO (last-in, first-out)`). They are called with any arguments and keyword arguments passed into :meth:`addClassCleanup` when they are added.
fr: Ajout d'une fonction à appeler après :meth:`tearDownClass` pour nettoyer les ressources utilisées par la classe test. Les fonctions sont appelées dans l'ordre inverse de l'ordre dans lequel elles ont été ajoutées (:abbr:`LIFO (dernier entré, premier sorti)`). Elles sont appelées avec tous les arguments et arguments de mots-clés passés à :meth:`addClassCleanup` quand elles sont ajoutées.

source: If :meth:`setUpClass` fails, meaning that :meth:`tearDownClass` is not called, then any cleanup functions added will still be called.
fr: Si :meth:`setUpClass` échoue, impliquant que :meth:`tearDownClass` n'est pas appelé, alors les fonctions de nettoyage ajoutées sont quand même appelées.

source: This method is called unconditionally after :meth:`tearDownClass`, or after :meth:`setUpClass` if :meth:`setUpClass` raises an exception.
fr: Cette méthode est appelée sans conditions après :meth:`tearDownClass`, ou après :meth:`setUpClass` si :meth:`setUpClass` lève une exception.

source: It is responsible for calling all the cleanup functions added by :meth:`addCleanupClass`. If you need cleanup functions to be called *prior* to :meth:`tearDownClass` then you can call :meth:`doCleanupsClass` yourself.
fr: Cette méthode est chargée d'appeler toutes les fonctions de nettoyage ajoutées par :meth:`addCleanupClass`. Si vous avez besoin de fonctions de nettoyage à appeler *avant* l'appel à :meth:`tearDownClass` alors vous pouvez appeler :meth:`doCleanupsClass` vous-même.

source: :meth:`doCleanupsClass` pops methods off the stack of cleanup functions one at a time, so it can be called at any time.
fr: :meth:`doCleanupsClass` extrait les méthodes de la pile des fonctions de nettoyage une à la fois, de sorte qu'elles peuvent être appelées à tout moment.

source: This class provides an API similar to :class:`TestCase` and also accepts coroutines as test functions.
fr: Cette classe fournit une API similaire à :class:`TestCase` et accepte aussi les coroutines en tant que fonctions de test.

source: Method called to prepare the test fixture. This is called after :meth:`setUp`. This is called immediately before calling the test method; other than :exc:`AssertionError` or :exc:`SkipTest`, any exception raised by this method will be considered an error rather than a test failure. The default implementation does nothing.
fr: Méthode appelée pour réaliser la mise en place du test. Celle-ci est exécutée après :meth:`setUp`. Elle est exécutée immédiatement avant l'appel de la méthode de test ; à l'exception de :exc:`AssertionError` ou :exc:`SkipTest`, toute exception levée par cette méthode est considérée comme une erreur et non pas comme un échec du test. L'implémentation par défaut ne fait rien.

source: Method called immediately after the test method has been called and the result recorded. This is called before :meth:`tearDown`. This is called even if the test method raised an exception, so the implementation in subclasses may need to be particularly careful about checking internal state. Any exception, other than :exc:`AssertionError` or :exc:`SkipTest`, raised by this method will be considered an additional error rather than a test failure (thus increasing the total number of reported errors). This method will only be called if the :meth:`asyncSetUp` succeeds, regardless of the outcome of the test method. The default implementation does nothing.
fr: Méthode appelée immédiatement après l'appel de la méthode de test et l'enregistrement du résultat. Elle est appelée avant :meth:`tearDown`. Elle est appelée même si la méthode de test a levé une exception. De fait, l'implémentation d'une sous-classe doit être faite avec précaution si vous vérifiez l'état interne de la classe. Toute exception, autre que :exc:`AssertionError` ou :exc:`SkipTest`, levée par cette méthode est considérée comme une erreur supplémentaire plutôt que comme un échec du test (augmentant ainsi le nombre total des erreurs signalées). Cette méthode est appelée uniquement si l'exécution de :meth:`asyncSetUp` est réussie quel que soit le résultat de la méthode de test. L'implémentation par défaut ne fait rien.

source: This method accepts a coroutine that can be used as a cleanup function.
fr: Cette méthode accepte une coroutine qui peut être utilisée comme fonction de nettoyage.

source: Sets up a new event loop to run the test, collecting the result into the :class:`TestResult` object passed as *result*. If *result* is omitted or ``None``, a temporary result object is created (by calling the :meth:`defaultTestResult` method) and used. The result object is returned to :meth:`run`'s caller. At the end of the test all the tasks in the event loop are cancelled.
fr: Configure une nouvelle boucle d'évènements pour exécuter le test, en collectant le résultat dans l'objet :class:`TestResult` passé comme *result*. Si *result* est omis ou vaut ``None``, un objet temporaire de résultat est créé (en appelant la méthode :meth:`defaultTestResult`) et utilisé. L'objet résultat est renvoyé à l'appelant de :meth:`run`. À la fin du test, toutes les taches de la boucle d’événements sont annulées.

source: An example illustrating the order::
fr: Exemple illustrant l'ordre ::

source: After running the test, ``events`` would contain ``["setUp", "asyncSetUp", "test_response", "asyncTearDown", "tearDown", "cleanup"]``.
fr: Après avoir lancé les tests, ``events`` contiendrait ``["setUp", "asyncSetUp", "test_response", "asyncTearDown", "tearDown", "cleanup"]``.

source: This class implements the portion of the :class:`TestCase` interface which allows the test runner to drive the test, but does not provide the methods which test code can use to check and report errors. This is used to create test cases using legacy test code, allowing it to be integrated into a :mod:`unittest`-based test framework.
fr: Cette classe implémente la partie de l'interface :class:`TestCase` qui permet au lanceur de test de piloter le scénario de test, mais ne fournit pas les méthodes que le code test peut utiliser pour vérifier et signaler les erreurs. Ceci est utilisé pour créer des scénario de test utilisant du code de test existant afin de faciliter l'intégration dans un *framework* de test basé sur :mod:`unittest`.

source: Deprecated aliases
fr: Alias obsolètes

source: For historical reasons, some of the :class:`TestCase` methods had one or more aliases that are now deprecated. The following table lists the correct names along with their deprecated aliases:
fr: Pour des raisons historiques, certaines méthodes de la classe :class:`TestCase` avaient un ou plusieurs alias qui sont maintenant obsolètes. Le tableau suivant énumère les noms corrects ainsi que leurs alias obsolètes ::

source: Method Name
fr: Nom de méthode

source: Deprecated alias
fr: Alias obsolètes

source: The fail* aliases listed in the second column have been deprecated.
fr: Les alias ``fail*`` sont énumérés dans la deuxième colonne.

source: The assert* aliases listed in the third column have been deprecated.
fr: Les alias ``assert*`` sont énumérés dans la troisième colonne.

source: ``assertRegexpMatches`` and ``assertRaisesRegexp`` have been renamed to :meth:`.assertRegex` and :meth:`.assertRaisesRegex`.
fr: Les expressions ``assertRegexpMatches`` et ``assertRaisesRegexp`` ont été renommées en :meth:`.assertRegex` et :meth:`.assertRaisesRegex`.

source: The ``assertNotRegexpMatches`` name is deprecated in favor of :meth:`.assertNotRegex`.
fr: Le nom ``assertNotRegexpMatches`` est obsolète en faveur de :meth:`.assertNotRegex`.

source: Grouping tests
fr: Regroupement des tests

source: This class represents an aggregation of individual test cases and test suites. The class presents the interface needed by the test runner to allow it to be run as any other test case. Running a :class:`TestSuite` instance is the same as iterating over the suite, running each test individually.
fr: Cette classe représente une agrégation de cas de test individuels et de suites de tests. La classe présente l'interface requise par le lanceur de test pour être exécutée comme tout autre cas de test. L'exécution d'une instance de :class:`TestSuite` est identique à l'itération sur la suite, en exécutant chaque test indépendamment.

source: If *tests* is given, it must be an iterable of individual test cases or other test suites that will be used to build the suite initially. Additional methods are provided to add test cases and suites to the collection later on.
fr: Si *tests* est fourni, il doit s'agir d'un itérable de cas de test individuels ou d'autres suites de test qui seront utilisés pour construire la suite initial. Des méthodes supplémentaires sont fournies pour ajouter ultérieurement des cas de test et des suites à la collection.

source: :class:`TestSuite` objects behave much like :class:`TestCase` objects, except they do not actually implement a test. Instead, they are used to aggregate tests into groups of tests that should be run together. Some additional methods are available to add tests to :class:`TestSuite` instances:
fr: Les objets :class:`TestSuite` se comportent comme les objets :class:`TestCase`, sauf qu'ils n'implémentent pas réellement un test. Au lieu de cela, ils sont utilisés pour regrouper les tests en groupes de tests qui doivent être exécutés ensemble. Des méthodes supplémentaires sont disponibles pour ajouter des tests aux instances de :class:`TestSuite` :

source: Add a :class:`TestCase` or :class:`TestSuite` to the suite.
fr: Ajouter un objet :class:`TestCase` ou :class:`TestSuite` à la suite de tests.

source: Add all the tests from an iterable of :class:`TestCase` and :class:`TestSuite` instances to this test suite.
fr: Ajouter tous les tests d'un itérable d'instances de :class:`TestCase` et de :class:`TestSuite` à cette suite de tests.

source: This is equivalent to iterating over *tests*, calling :meth:`addTest` for each element.
fr: C'est l'équivalent d'une itération sur *tests*, appelant :meth:`addTest` pour chaque élément.

source: :class:`TestSuite` shares the following methods with :class:`TestCase`:
fr: :class:`TestSuite` partage les méthodes suivantes avec :class:`TestCase` :

source: Run the tests associated with this suite, collecting the result into the test result object passed as *result*. Note that unlike :meth:`TestCase.run`, :meth:`TestSuite.run` requires the result object to be passed in.
fr: Exécute les tests associés à cette suite, en collectant le résultat dans l'objet de résultat de test passé par *result*. Remarquer que contrairement à :meth:`TestCase.run`, :meth:`TestSuite.run` nécessite que l'objet résultat soit passé.

source: Run the tests associated with this suite without collecting the result. This allows exceptions raised by the test to be propagated to the caller and can be used to support running tests under a debugger.
fr: Exécute les tests associés à cette suite sans collecter le résultat. Ceci permet aux exceptions levées par le test d'être propagées à l'appelant et peut être utilisé pour exécuter des tests sous un débogueur.

source: Return the number of tests represented by this test object, including all individual tests and sub-suites.
fr: Renvoie le nombre de tests représentés par cet objet de test, y compris tous les tests individuels et les sous-suites.

source: Tests grouped by a :class:`TestSuite` are always accessed by iteration. Subclasses can lazily provide tests by overriding :meth:`__iter__`. Note that this method may be called several times on a single suite (for example when counting tests or comparing for equality) so the tests returned by repeated iterations before :meth:`TestSuite.run` must be the same for each call iteration. After :meth:`TestSuite.run`, callers should not rely on the tests returned by this method unless the caller uses a subclass that overrides :meth:`TestSuite._removeTestAtIndex` to preserve test references.
fr: Les tests groupés par une classe :class:`TestSuite` sont toujours accessibles par itération. Les sous-classes peuvent fournir paresseusement des tests en surchargeant :meth:`__iter__`. Notez que cette méthode peut être appelée plusieurs fois sur une même suite (par exemple lors du comptage des tests ou de la comparaison pour l'égalité) et que les tests retournés par itérations répétées avant :meth:`TestSuite.run` doivent être les mêmes pour chaque itération. Après :meth:`TestSuite.run`, les appelants ne devraient pas se fier aux tests retournés par cette méthode à moins qu'ils n'utilisent une sous-classe qui remplace :meth:`TestSuite._removeTestAtIndex` pour préserver les références des tests.

source: In earlier versions the :class:`TestSuite` accessed tests directly rather than through iteration, so overriding :meth:`__iter__` wasn't sufficient for providing tests.
fr: Dans les versions précédentes, la classe :class:`TestSuite` accédait aux tests directement plutôt que par itération, donc surcharger la méthode :meth:`__iter__` n'était pas suffisante pour fournir les tests.

source: In earlier versions the :class:`TestSuite` held references to each :class:`TestCase` after :meth:`TestSuite.run`. Subclasses can restore that behavior by overriding :meth:`TestSuite._removeTestAtIndex`.
fr: Dans les versions précédentes, la classe :class:`TestSuite` contenait des références à chaque :class:`TestCase` après l'appel à :meth:`TestSuite.run`. Les sous-classes peuvent restaurer ce comportement en surchargeant :meth:`TestSuite._removeTestAtIndex`.

source: In the typical usage of a :class:`TestSuite` object, the :meth:`run` method is invoked by a :class:`TestRunner` rather than by the end-user test harness.
fr: Dans l'utilisation typique de l'objet :class:`TestSuite`, la méthode :meth:`run` est invoquée par une classe :class:`TestRunner` plutôt que par le système de test de l'utilisateur.

source: Loading and running tests
fr: Chargement et exécution des tests

source: The :class:`TestLoader` class is used to create test suites from classes and modules. Normally, there is no need to create an instance of this class; the :mod:`unittest` module provides an instance that can be shared as :data:`unittest.defaultTestLoader`. Using a subclass or instance, however, allows customization of some configurable properties.
fr: La classe :class:`TestLoader` est utilisée pour créer des suites de tests à partir de classes et de modules. Normalement, il n'est pas nécessaire de créer une instance de cette classe ; le module :mod:`unittest` fournit une instance qui peut être partagée comme :data:`unittest.defaultTestLoader`. L'utilisation d'une sous-classe ou d'une instance permet cependant de personnaliser certaines propriétés configurables.

source: :class:`TestLoader` objects have the following attributes:
fr: Les objets de la classe :class:`TestLoader` ont les attributs suivants :

source: A list of the non-fatal errors encountered while loading tests. Not reset by the loader at any point. Fatal errors are signalled by the relevant a method raising an exception to the caller. Non-fatal errors are also indicated by a synthetic test that will raise the original error when run.
fr: Une liste des erreurs non fatales rencontrées lors du chargement des tests. Il est impossible de faire une remise à zéro pendant le chargement. Les erreurs fatales sont signalées par la méthode correspondante qui lève une exception à l'appelant. Les erreurs non fatales sont également indiquées par un test synthétique qui lève l'erreur initiale lors de l'exécution.

source: :class:`TestLoader` objects have the following methods:
fr: Les objets de la classe :class:`TestLoader` ont les attributs suivants :

source: Return a suite of all test cases contained in the :class:`TestCase`\ -derived :class:`testCaseClass`.
fr: Renvoie une suite de tous les cas de test contenus dans la classe :class:`TestCaseClass`\ dérivée de :class:`testCase`.

source: A test case instance is created for each method named by :meth:`getTestCaseNames`. By default these are the method names beginning with ``test``. If :meth:`getTestCaseNames` returns no methods, but the :meth:`runTest` method is implemented, a single test case is created for that method instead.
fr: Une instance de cas de test est créée pour chaque méthode nommée par :meth:`getTestCaseNames`. Par défaut, ce sont les noms des méthodes commençant par "test". Si :meth:`getTestTestCaseNames` ne renvoie aucune méthode, mais que la méthode :meth:`runTest` est implémentée, un seul cas de test est créé pour cette méthode à la place.

source: Return a suite of all test cases contained in the given module. This method searches *module* for classes derived from :class:`TestCase` and creates an instance of the class for each test method defined for the class.
fr: Renvoie une suite de tous les cas de test contenus dans le module donné. Cette méthode recherche *module* pour les classes dérivées de :class:`TestCase` et crée une instance de la classe pour chaque méthode de test définie pour cette classe.

source: While using a hierarchy of :class:`TestCase`\ -derived classes can be convenient in sharing fixtures and helper functions, defining test methods on base classes that are not intended to be instantiated directly does not play well with this method. Doing so, however, can be useful when the fixtures are different and defined in subclasses.
fr: Bien que l'utilisation d'une hiérarchie de classes :class:`TestCase` (les classes dérivées de *TestCase*) peut être un moyen pratique de partager des *fixtures* et des fonctions utilitaires, définir une méthode de test pour des classes de base non destinées à être directement instanciée ne marche pas bien avec cette méthode. Cela peut toutefois s'avérer utile lorsque les *fixtures* sont différentes et définies dans des sous-classes.

source: If a module provides a ``load_tests`` function it will be called to load the tests. This allows modules to customize test loading. This is the `load_tests protocol`_. The *pattern* argument is passed as the third argument to ``load_tests``.
fr: Si un module fournit une fonction ``load_tests``, il est appelé pour charger les tests. Cela permet aux modules de personnaliser le chargement des tests. C'est le protocole `load_tests protocol`_. L'argument *pattern* est passé comme troisième argument à ``load_tests``.

source: Support for ``load_tests`` added.
fr: Ajout de la prise en charge de ``load_tests``.

source: The undocumented and unofficial *use_load_tests* default argument is deprecated and ignored, although it is still accepted for backward compatibility. The method also now accepts a keyword-only argument *pattern* which is passed to ``load_tests`` as the third argument.
fr: L'argument par défaut non documenté et non officiel *use_load_tests* est déprécié et ignoré, bien qu'il soit toujours accepté pour la compatibilité descendante. La méthode accepte aussi maintenant un argument *pattern* qui est passé à ``load_tests`` comme troisième argument.

source: Return a suite of all test cases given a string specifier.
fr: Renvoie une suite de tous les cas de test en fonction d'un spécificateur de chaîne de caractères.
