Repository: python/python-docs-fr
Catalog: library/urllib.error.po
Languages: fr

source: :mod:`urllib.error` --- Exception classes raised by urllib.request
fr: :mod:`urllib.error` --- Classes d'exceptions levées par *urllib.request*

source: **Source code:** :source:`Lib/urllib/error.py`
fr: **Code source :** :source:`Lib/urllib/error.py`

source: The :mod:`urllib.error` module defines the exception classes for exceptions raised by :mod:`urllib.request`. The base exception class is :exc:`URLError`.
fr: Le module :mod:`urllib.error` définit les classes des exceptions levées par :mod:`urllib.request`. La classe de base de ces exceptions est :exc:`URLError`.

source: The following exceptions are raised by :mod:`urllib.error` as appropriate:
fr: Les exceptions suivantes sont levées par :mod:`urllib.error` aux cas appropriés :

source: The handlers raise this exception (or derived exceptions) when they run into a problem. It is a subclass of :exc:`OSError`.
fr: Les gestionnaires lèvent cette exception (ou des exceptions dérivées) quand ils rencontrent un problème. Elle est une sous-classe de :exc:`OSError`.

source: The reason for this error. It can be a message string or another exception instance.
fr: La raison de cette erreur. Il peut s'agir d'un message textuel ou d'une autre instance d'exception.

source: :exc:`URLError` has been made a subclass of :exc:`OSError` instead of :exc:`IOError`.
fr: :exc:`URLError` est maintenant une sous-classe de :exc:`OSError` plutôt que :exc:`IOError`.

source: Though being an exception (a subclass of :exc:`URLError`), an :exc:`HTTPError` can also function as a non-exceptional file-like return value (the same thing that :func:`~urllib.request.urlopen` returns). This is useful when handling exotic HTTP errors, such as requests for authentication.
fr: Bien qu'étant une exception (une sous-classe de :exc:`URLError`), une :exc:`HTTPError` peut aussi fonctionner comme une valeur de retour normale et fichier-compatible (la même chose que renvoyé par :func:`~urllib.request.urlopen`). Cela est utile pour gérer les erreurs HTTP exotiques, comme les requêtes d'authentification.

source: An HTTP status code as defined in :rfc:`2616`. This numeric value corresponds to a value found in the dictionary of codes as found in :attr:`http.server.BaseHTTPRequestHandler.responses`.
fr: Un statut HTTP comme défini dans la :rfc:`2616`. Cette valeur numérique correspond à une valeur trouvée dans le dictionnaire des codes comme dans :attr:`http.server.BaseHTTPRequestHandler.responses`.

source: This is usually a string explaining the reason for this error.
fr: Il s'agit habituellement d'une chaîne de caractères expliquant la raison de l'erreur.

source: The HTTP response headers for the HTTP request that caused the :exc:`HTTPError`.
fr: Les en-têtes de la réponse HTTP correspondant à la requête HTTP qui a causé la :exc:`HTTPError`.

source: This exception is raised when the :func:`~urllib.request.urlretrieve` function detects that the amount of the downloaded data is less than the expected amount (given by the *Content-Length* header). The :attr:`content` attribute stores the downloaded (and supposedly truncated) data.
fr: Cette exception est levée quand la fonction :func:`~urllib.request.urlretrieve` détecte que le montant des données téléchargées est inférieur au montant attendu (donné par l'en-tête *Content-Length*). L'attribut :attr:`content` stocke les données téléchargées (et supposément tronquées).
