Repository: python/python-docs-fr
Catalog: library/urllib.robotparser.po
Languages: fr

source: :mod:`urllib.robotparser` --- Parser for robots.txt
fr: :mod:`urllib.robotparser` — Analyseur de fichiers *robots.txt*

source: **Source code:** :source:`Lib/urllib/robotparser.py`
fr: **Code source :** :source:`Lib/urllib/robotparser.py`

source: This module provides a single class, :class:`RobotFileParser`, which answers questions about whether or not a particular user agent can fetch a URL on the Web site that published the :file:`robots.txt` file. For more details on the structure of :file:`robots.txt` files, see http://www.robotstxt.org/orig.html.
fr: Ce module fournit une simple classe, :class:`RobotFileParser`, qui permet de savoir si un *user-agent* particulier peut accéder à une URL du site web qui a publié ce fichier :file:`robots.txt`. Pour plus de détails sur la structure des fichiers :file:`robots.txt`, voir http://www.robotstxt.org/orig.html.

source: This class provides methods to read, parse and answer questions about the :file:`robots.txt` file at *url*.
fr: Cette classe fournit des méthodes pour lire, analyser et répondre aux questions à propos du fichier :file:`robots.txt` disponible à l'adresse *url*.

source: Sets the URL referring to a :file:`robots.txt` file.
fr: Modifie l'URL référençant le fichier :file:`robots.txt`.

source: Reads the :file:`robots.txt` URL and feeds it to the parser.
fr: Lit le fichier :file:`robots.txt` depuis son URL et envoie le contenu à l'analyseur.

source: Parses the lines argument.
fr: Analyse les lignes données en argument.

source: Returns ``True`` if the *useragent* is allowed to fetch the *url* according to the rules contained in the parsed :file:`robots.txt` file.
fr: Renvoie ``True`` si *useragent* est autorisé à accéder à *url* selon les règles contenues dans le fichier :file:`robots.txt` analysé.

source: Returns the time the ``robots.txt`` file was last fetched. This is useful for long-running web spiders that need to check for new ``robots.txt`` files periodically.
fr: Renvoie le temps auquel le fichier ``robots.txt`` a été téléchargé pour la dernière fois. Cela est utile pour des *web spiders* de longue durée qui doivent vérifier périodiquement si le fichier est mis à jour.

source: Sets the time the ``robots.txt`` file was last fetched to the current time.
fr: Indique que le fichier ``robots.txt`` a été téléchargé pour la dernière fois au temps courant.

source: Returns the value of the ``Crawl-delay`` parameter from ``robots.txt`` for the *useragent* in question. If there is no such parameter or it doesn't apply to the *useragent* specified or the ``robots.txt`` entry for this parameter has invalid syntax, return ``None``.
fr: Renvoie la valeur du paramètre ``Crawl-delay`` du ``robots.txt`` pour le *useragent* en question. S'il n'y a pas de tel paramètre ou qu'il ne s'applique pas au *useragent* spécifié ou si l'entrée du ``robots.txt`` pour ce paramètre a une syntaxe invalide, renvoie ``None``.

source: Returns the contents of the ``Request-rate`` parameter from ``robots.txt`` as a :term:`named tuple` ``RequestRate(requests, seconds)``. If there is no such parameter or it doesn't apply to the *useragent* specified or the ``robots.txt`` entry for this parameter has invalid syntax, return ``None``.
fr: Renvoie le contenu du paramètre ``Request-rate`` du ``robots.txt`` sous la forme d'un :term:`named tuple` ``RequestRate(requests, seconds)``. S'il n'y a pas de tel paramètre ou qu'il ne s'applique pas au *useragent* spécifié ou si l'entrée du ``robots.txt`` pour ce paramètre a une syntaxe invalide, ``None`` est renvoyé.

source: Returns the contents of the ``Sitemap`` parameter from ``robots.txt`` in the form of a :func:`list`. If there is no such parameter or the ``robots.txt`` entry for this parameter has invalid syntax, return ``None``.
fr: Renvoie le contenu du paramètre de ``Sitemap`` depuis ``robots.txt`` dans la forme d'une :func:`list`. S'il n'y a pas de tel paramètre ou qu'il ne s'applique pas au *useragent* spécifié ou si l'entrée du ``robots.txt`` pour ce paramètre a une syntaxe invalide, renvoie ``None``.

source: The following example demonstrates basic use of the :class:`RobotFileParser` class::
fr: L'exemple suivant présente une utilisation basique de la classe :class:`RobotFileParser` ::
