Repository: python/python-docs-fr
Catalog: library/uu.po
Languages: fr

source: :mod:`uu` --- Encode and decode uuencode files
fr: :mod:`uu` — Encode et décode les fichiers *uuencode*

source: **Source code:** :source:`Lib/uu.py`
fr: **Code source :** :source:`Lib/uu.py`

source: This module encodes and decodes files in uuencode format, allowing arbitrary binary data to be transferred over ASCII-only connections. Wherever a file argument is expected, the methods accept a file-like object. For backwards compatibility, a string containing a pathname is also accepted, and the corresponding file will be opened for reading and writing; the pathname ``'-'`` is understood to mean the standard input or output. However, this interface is deprecated; it's better for the caller to open the file itself, and be sure that, when required, the mode is ``'rb'`` or ``'wb'`` on Windows.
fr: Ce module encode et décode les fichiers au format *uuencode*, permettant à des données binaires d'être transférées lors de connexion ASCII. Pour tous les arguments où un fichier est attendu, les fonctions acceptent un "objet fichier-compatible". Pour des raisons de compatibilité avec les anciennes versions de Python, une chaîne de caractères contenant un chemin est aussi acceptée, et le fichier correspondant sera ouvert en lecture et écriture ; le chemin ``'-'`` est considéré comme l'entrée ou la sortie standard. Cependant cette interface est obsolète ; il vaut mieux que l'appelant ouvre le fichier lui-même, en s'assurant si nécessaire que le mode d'ouverture soit ``'rb'`` ou ``'wb'`` sur Windows.

source: This code was contributed by Lance Ellinghouse, and modified by Jack Jansen.
fr: Ce code provient d'une contribution de Lance Ellinghouse et a été modifié par Jack Jansen.

source: The :mod:`uu` module defines the following functions:
fr: Le module :mod:`uu` définit les fonctions suivantes :

source: Uuencode file *in_file* into file *out_file*. The uuencoded file will have the header specifying *name* and *mode* as the defaults for the results of decoding the file. The default defaults are taken from *in_file*, or ``'-'`` and ``0o666`` respectively. If *backtick* is true, zeros are represented by ``'`'`` instead of spaces.
fr: *Uuencode* le fichier *in_file* dans le fichier *out_file*. Le fichier *uuencodé* contiendra une entête spécifiant les valeurs de *name* et *mode* par défaut pour le décodage du fichier. Par défaut ces valeurs sont prises de *in_file* ou valent respectivement ``'-'`` et ``0o666``. Si *backtick* est vrai, les zéros sont représentés par des ``'`'`` plutôt que des espaces.

source: Added the *backtick* parameter.
fr: Ajout du paramètre *backtick*.

source: This call decodes uuencoded file *in_file* placing the result on file *out_file*. If *out_file* is a pathname, *mode* is used to set the permission bits if the file must be created. Defaults for *out_file* and *mode* are taken from the uuencode header. However, if the file specified in the header already exists, a :exc:`uu.Error` is raised.
fr: Décode le fichier *in_file* et écrit le résultat dans *out_file*. Si *out_file* est un chemin, *mode* est utilisé pour les permissions du fichier lors de sa création. Les valeurs par défaut pour *out_file* et *mode* sont récupérées des entêtes *uuencode*. Cependant, si le fichier spécifié par les entêtes est déjà existant, une exception :exc:`uu.Error` est levée.

source: :func:`decode` may print a warning to standard error if the input was produced by an incorrect uuencoder and Python could recover from that error. Setting *quiet* to a true value silences this warning.
fr: La fonction :func:`decode` écrit un avertissement sur la sortie d'erreur si l'entrée contient des erreurs mais que Python a pu s'en sortir. Mettre *quiet* à *True* empêche l'écriture de cet avertissement.

source: Subclass of :exc:`Exception`, this can be raised by :func:`uu.decode` under various situations, such as described above, but also including a badly formatted header, or truncated input file.
fr: Classe fille d':exc:`Exception`, elle peut être levée par :func:`uu.decode` dans différentes situations, tel que décrit plus haut, mais aussi en cas d'entête mal formatée ou d'entrée tronquée.

source: Support module containing ASCII-to-binary and binary-to-ASCII conversions.
fr: Module secondaire contenant les conversions ASCII vers binaire et binaire vers ASCII.
