Repository: python/python-docs-fr
Catalog: library/uuid.po
Languages: fr

source: :mod:`uuid` --- UUID objects according to :rfc:`4122`
fr: :mod:`uuid` — Objets UUID d'après la :rfc:`4122`

source: **Source code:** :source:`Lib/uuid.py`
fr: **Code source :** :source:`Lib/uuid.py`

source: This module provides immutable :class:`UUID` objects (the :class:`UUID` class) and the functions :func:`uuid1`, :func:`uuid3`, :func:`uuid4`, :func:`uuid5` for generating version 1, 3, 4, and 5 UUIDs as specified in :rfc:`4122`.
fr: Ce module exporte des objets :class:`UUID` immuables (de la classe :class:`UUID`) et les fonctions :func:`uuid1`, :func:`uuid3`, :func:`uuid4`, :func:`uuid5` permettant de générer des UUID de version 1, 3, 4 et 5 tels que définis dans la :rfc:`4122`.

source: If all you want is a unique ID, you should probably call :func:`uuid1` or :func:`uuid4`. Note that :func:`uuid1` may compromise privacy since it creates a UUID containing the computer's network address. :func:`uuid4` creates a random UUID.
fr: Utilisez :func:`uuid1` ou :func:`uuid4` si votre but est de produire un identifiant unique. Notez que :func:`uuid1` peut dévoiler des informations personnelles car l'UUID produit contient l'adresse réseau de l'ordinateur. En revanche, :func:`uuid4` génère un UUID aléatoire.

source: Depending on support from the underlying platform, :func:`uuid1` may or may not return a "safe" UUID. A safe UUID is one which is generated using synchronization methods that ensure no two processes can obtain the same UUID. All instances of :class:`UUID` have an :attr:`is_safe` attribute which relays any information about the UUID's safety, using this enumeration:
fr: En fonction du système d'exploitation, les UUID :func:`uuid1` peuvent ne pas être « sûrs ». Un UUID est considéré sûr s'il est généré avec des techniques de synchronisation qui garantissent que deux processus ne peuvent obtenir le même UUID. Toutes les instances de :class:`UUID` possèdent un attribut :attr:`is_safe` qui indique le niveau de sûreté de l'UUID selon l'énumération suivante :

source: The UUID was generated by the platform in a multiprocessing-safe way.
fr: L'UUID a été généré par la plateforme en utilisant une méthode sûre dans un contexte de parallélisme par processus.

source: The UUID was not generated in a multiprocessing-safe way.
fr: L'UUID n'a pas été généré par une méthode sûre dans un contexte de parallélisme par processus.

source: The platform does not provide information on whether the UUID was generated safely or not.
fr: La plateforme ne précise pas si l'UUID a été généré de façon sûre ou non.

source: Create a UUID from either a string of 32 hexadecimal digits, a string of 16 bytes in big-endian order as the *bytes* argument, a string of 16 bytes in little-endian order as the *bytes_le* argument, a tuple of six integers (32-bit *time_low*, 16-bit *time_mid*, 16-bit *time_hi_version*, 8-bit *clock_seq_hi_variant*, 8-bit *clock_seq_low*, 48-bit *node*) as the *fields* argument, or a single 128-bit integer as the *int* argument. When a string of hex digits is given, curly braces, hyphens, and a URN prefix are all optional. For example, these expressions all yield the same UUID::
fr: Produit un UUID à partir soit d'une chaîne de 32 chiffres hexadécimaux, soit une chaîne de 16 octets gros-boutiste (argument *bytes*), soit une chaîne de 16 octets petit-boutiste (argument *bytes_le*), soit un n-uplet de six entiers (32-bit *time_low*, 16-bit *time_mid*, 16-bit *time_hi_version*, 8-bit *clock_seq_hi_variant*, 8-bit *clock_seq_low*, 48-bit *node*) (argument *fields*), soit un unique entier sur 128 bits (argument *int*). Lorsque la fonction reçoit une chaîne de chiffres hexadécimaux, les accolades, les tirets et le préfixe URN sont facultatifs. Par exemple, toutes les expressions ci-dessous génèrent le même UUID ::

source: Exactly one of *hex*, *bytes*, *bytes_le*, *fields*, or *int* must be given. The *version* argument is optional; if given, the resulting UUID will have its variant and version number set according to :rfc:`4122`, overriding bits in the given *hex*, *bytes*, *bytes_le*, *fields*, or *int*.
fr: Un seul des arguments *hex*, *bytes*, *bytes_le*, *fields* ou *int* doit être spécifié. L'argument *version* est optionnel : s'il est spécifié, l'UUID généré aura pour numéro de version et de variante la valeur indiquée dans la :rfc:`4122`, remplaçant les bits idoines de *hex*, *bytes*, *bytes_le*, *fields* ou *int*.

source: Comparison of UUID objects are made by way of comparing their :attr:`UUID.int` attributes. Comparison with a non-UUID object raises a :exc:`TypeError`.
fr: La comparaison de deux objets UUID se fait en comparant leurs attributs :attr:`UUID.int`. La comparaison avec un objet autre qu'un UUID lève une exception :exc:`TypeError`.

source: ``str(uuid)`` returns a string in the form ``12345678-1234-5678-1234-567812345678`` where the 32 hexadecimal digits represent the UUID.
fr: ``str(uuid)`` renvoie une chaîne de caractères de la forme ``12345678-1234-5678-1234-567812345678`` représentant l'UUID par une chaîne de 32 chiffres hexadécimaux.

source: :class:`UUID` instances have these read-only attributes:
fr: Les instances de :class:`UUID` possèdent les attributs suivants en lecture seule :

source: The UUID as a 16-byte string (containing the six integer fields in big-endian byte order).
fr: L'UUID représenté comme une chaîne de 16 octets (contenant les six champs entiers dans l'ordre gros-boutiste).

source: The UUID as a 16-byte string (with *time_low*, *time_mid*, and *time_hi_version* in little-endian byte order).
fr: L'UUID représenté comme une chaîne de 16 octets (avec *time_low*, *time_mid* et *time_hi_version* dans l'ordre petit-boutiste).

source: A tuple of the six integer fields of the UUID, which are also available as six individual attributes and two derived attributes:
fr: Un n-uplet contenant les six champs entiers de l'UUID, également accessibles en tant que six attributs individuels et deux attributs dérivés :

source: Field
fr: Champ

source: Meaning
fr: Signification

source: the first 32 bits of the UUID
fr: les 32 premiers bits de l'UUID

source: the next 16 bits of the UUID
fr: les 16 bits suivants de l'UUID

source: the next 8 bits of the UUID
fr: les 8 bits suivants de l'UUID

source: the last 48 bits of the UUID
fr: les derniers 48 bits de l'UUID

source: the 60-bit timestamp
fr: l'horodatage sur 60 bits

source: the 14-bit sequence number
fr: le numéro de séquence sur 14 bits

source: The UUID as a 32-character hexadecimal string.
fr: Représentation de l'UUID sous forme d'une chaîne de 32 chiffres hexadécimaux.

source: The UUID as a 128-bit integer.
fr: Représentation de l'UUId sous forme d'un entier de 128 bits.

source: The UUID as a URN as specified in :rfc:`4122`.
fr: Représentation de l'UUID sous forme d'URN tel que spécifié dans la :rfc:`4122`.

source: The UUID variant, which determines the internal layout of the UUID. This will be one of the constants :const:`RESERVED_NCS`, :const:`RFC_4122`, :const:`RESERVED_MICROSOFT`, or :const:`RESERVED_FUTURE`.
fr: Variante de l'UUID. Celle-ci détermine l'agencement interne de l'UUID. Les valeurs possibles sont les constantes suivantes : :const:`RESERVED_NCS`, :const:`RFC_4122`, :const:`RESERVED_MICROSOFT` ou :const:`RESERVED_FUTURE`.

source: The UUID version number (1 through 5, meaningful only when the variant is :const:`RFC_4122`).
fr: Numéro de version de l'UUID (de 1 à 5). Cette valeur n'a de sens que dans le cas de la variante :const:`RFC_4122`.

source: An enumeration of :class:`SafeUUID` which indicates whether the platform generated the UUID in a multiprocessing-safe way.
fr: Valeur de l'énumération :class:`SafeUUID` indiquant si la plateforme a généré l'UUID d'une façon sûre dans un contexte de parallélisme par processus.

source: The :mod:`uuid` module defines the following functions:
fr: Le module :mod:`uu` définit les fonctions suivantes :

source: Get the hardware address as a 48-bit positive integer. The first time this runs, it may launch a separate program, which could be quite slow. If all attempts to obtain the hardware address fail, we choose a random 48-bit number with the multicast bit (least significant bit of the first octet) set to 1 as recommended in :rfc:`4122`. "Hardware address" means the MAC address of a network interface. On a machine with multiple network interfaces, universally administered MAC addresses (i.e. where the second least significant bit of the first octet is *unset*) will be preferred over locally administered MAC addresses, but with no other ordering guarantees.
fr: Renvoie l'adresse réseau matérielle sous forme d'un entier positif sur 48 bits. Cette fonction peut faire appel à un programme externe relativement lent lors de sa première exécution. Si toutes les tentatives d'obtenir l'adresse matérielle échouent, un nombre aléatoire sur 48 bit avec le bit de *multicast* (bit de poids faible du premier octet) à 1 est généré, comme recommandé par la :rfc:`4122`. Ici, « adresse matérielle » correspond à l'adresse MAC d'une interface réseau. Sur une machine avec plusieurs interfaces réseau, les adresses MAC de type UUA (*universally administered address*, pour lesquelles le second bit de poids faible est à zéro) sont prioritaires par rapport aux autres adresses MAC. Aucune autre garantie n'est donnée sur l'ordre dans lequel les interfaces sont choisies.

source: Universally administered MAC addresses are preferred over locally administered MAC addresses, since the former are guaranteed to be globally unique, while the latter are not.
fr: Les adresses MAC de type UUA sont préférées par rapport aux adresses locales car ces dernières ne sont pas nécessairement uniques.

source: Generate a UUID from a host ID, sequence number, and the current time. If *node* is not given, :func:`getnode` is used to obtain the hardware address. If *clock_seq* is given, it is used as the sequence number; otherwise a random 14-bit sequence number is chosen.
fr: Génère un UUID à partir d'un identifiant hôte, d'un numéro de séquence et de l'heure actuelle. Si *node* n'est pas spécifié, la fonction :func:`getnode` est appelée pour obtenir l'adresse matérielle. *clock_seq* est utilisé comme numéro de séquence s'il est spécifié, sinon un numéro aléatoire sur 14 bits est utilisé à la place.

source: Generate a UUID based on the MD5 hash of a namespace identifier (which is a UUID) and a name (which is a string).
fr: Génère un UUID à partir de l'empreinte MD5 de l'identifiant d'un espace de nom (un UUID) et d'un nom (une chaîne de caractères).

source: Generate a random UUID.
fr: Génère un UUID aléatoire.

source: Generate a UUID based on the SHA-1 hash of a namespace identifier (which is a UUID) and a name (which is a string).
fr: Génère un UUID à partir de l'empreinte SHA-1 de l'identifiant d'un espace de nom (un UUID) et d'un nom (une chaîne de caractères).

source: The :mod:`uuid` module defines the following namespace identifiers for use with :func:`uuid3` or :func:`uuid5`.
fr: Le module :mod:`uuid` définit les identifiants d'espaces de noms suivants (pour :func:`uuid3` et :func:`uuid5`).

source: When this namespace is specified, the *name* string is a fully-qualified domain name.
fr: Lorsque cet espace de nom est spécifié, la chaîne *name* doit être un nom de domaine pleinement qualifié (souvent indiqué en anglais par *FQDN*).

source: When this namespace is specified, the *name* string is a URL.
fr: Lorsque cet espace de nom est spécifié, la chaîne *name* doit être une URL.

source: When this namespace is specified, the *name* string is an ISO OID.
fr: Lorsque cet espace de nom est spécifié, la chaîne *name* doit être un OID ISO.

source: When this namespace is specified, the *name* string is an X.500 DN in DER or a text output format.
fr: Lorsque cet espace de nom est spécifié, la chaîne *name* doit être un DN X.500 au format texte ou DER.

source: The :mod:`uuid` module defines the following constants for the possible values of the :attr:`variant` attribute:
fr: Le module :mod:`uuid` définit les constantes suivantes correspondant aux valeurs autorisées pour l'attribut :attr:`variant` :

source: Reserved for NCS compatibility.
fr: Réservé pour la compatibilité NCS.

source: Specifies the UUID layout given in :rfc:`4122`.
fr: Utilise l'agencement des UUID de la :rfc:`4122`.

source: Reserved for Microsoft compatibility.
fr: Réservé pour la compatibilité Microsoft.

source: Reserved for future definition.
fr: Réservé pour un usage futur.

source: This specification defines a Uniform Resource Name namespace for UUIDs, the internal format of UUIDs, and methods of generating UUIDs.
fr: Cette spécification (en anglais) définit un espace de noms *Uniform Resource Name* pour les UUID, leur format interne et les méthodes permettant de les générer.

source: Example
fr: Exemple

source: Here are some examples of typical usage of the :mod:`uuid` module::
fr: Voici quelques exemples classiques d'utilisation du module :mod:`uuid` ::
