Repository: python/python-docs-fr
Catalog: library/venv.po
Languages: fr

source: This script is also available for download `online <https://gist.github.com/vsajip/4673395>`_.
fr: Ce script est aussi disponible au téléchargement `en ligne <https://gist.github.com/vsajip/4673395>`_.
