Repository: python/python-docs-fr
Catalog: library/venv.po
Languages: fr

source: :mod:`venv` --- Creation of virtual environments
fr: :mod:`venv` --- Création d'environnements virtuels

source: **Source code:** :source:`Lib/venv/`
fr: **Code source :** :source:`Lib/venv/`

source: The :mod:`venv` module provides support for creating lightweight "virtual environments" with their own site directories, optionally isolated from system site directories. Each virtual environment has its own Python binary (which matches the version of the binary that was used to create this environment) and can have its own independent set of installed Python packages in its site directories.
fr: Le module :mod:`venv` permet de créer des "environnements virtuels" légers avec leurs propre dossiers `site`, optionnellement isolés des dossiers `site` système. Chaque environnement virtuel a son propre binaire Python (qui correspond à la version du binaire qui a été utilisée pour créer cet environnement) et peux avoir sa propre liste de paquets Python installés dans ses propres dossiers `site`.

source: See :pep:`405` for more information about Python virtual environments.
fr: Voir la :pep:`405` pour plus d'informations à propos des environnements virtuels Python.

source: `Python Packaging User Guide: Creating and using virtual environments <https://packaging.python.org/installing/#creating-virtual-environments>`__
fr: `Guide Utilisateur de l'Empaquetage Python : Créer et utiliser des environnements virtuels <https://packaging.python.org/installing/#creating-virtual-environments>`__

source: The ``pyvenv`` script has been deprecated as of Python 3.6 in favor of using ``python3 -m venv`` to help prevent any potential confusion as to which Python interpreter a virtual environment will be based on.
fr: Le script ``pyenv`` est obsolète depuis Python 3.6 et a été remplacé par ``python3 -m venv``.

source: Creating virtual environments
fr: Création d'environnements virtuels

source: Creation of :ref:`virtual environments <venv-def>` is done by executing the command ``venv``::
fr: La création d':ref:`environnements virtuels <venv-def>` est faite en exécutant la commande ``venv`` ::

source: Running this command creates the target directory (creating any parent directories that don't exist already) and places a ``pyvenv.cfg`` file in it with a ``home`` key pointing to the Python installation from which the command was run. It also creates a ``bin`` (or ``Scripts`` on Windows) subdirectory containing a copy of the ``python`` binary (or binaries, in the case of Windows). It also creates an (initially empty) ``lib/pythonX.Y/site-packages`` subdirectory (on Windows, this is ``Lib\site-packages``). If an existing directory is specified, it will be re-used.
fr: Lancer cette commande crée le dossier du **venv** (en créant tous les dossiers parents qui n'existent pas déjà) et crée un fichier ``pyenv.cfg`` à l’intérieur de ce dossier avec une clé ``home` qui pointe sur l'installation Python depuis laquelle cette commande a été lancée. Il crée aussi un sous-dossier ``bin`` (ou ``Scripts`` sur Windows) contenant une copie du binaire ``python`` (ou binaires, dans le cas de Windows). Il crée aussi un sous-dossier (initialement vide) ``lib/pythonX.Y/site-packages`` (Sur Windows, c'est ``Lib\site-packages``). Si un dossier existant est spécifié, il sera réutilisé.

source: ``pyvenv`` was the recommended tool for creating virtual environments for Python 3.3 and 3.4, and is `deprecated in Python 3.6 <https://docs.python.org/dev/whatsnew/3.6.html#deprecated-features>`_.
fr: ``pyvenv`` était l'outil recommandé pour créer des environnements sous Python 3.3 et 3.4, et est `obsolète depuis Python 3.6 <https://docs.python.org/dev/whatsnew/3.6.html#deprecated-features>`_.

source: The use of ``venv`` is now recommended for creating virtual environments.
fr: L'utilisation de ``venv`` est maintenant recommandée pour créer vos environnements virtuels.

source: On Windows, invoke the ``venv`` command as follows::
fr: Sur Windows, appelez la commande ``venv`` comme suit ::

source: Alternatively, if you configured the ``PATH`` and ``PATHEXT`` variables for your :ref:`Python installation <using-on-windows>`::
fr: Alternativement, si vous avez configuré les variables ``PATH`` et ``PATHEXT`` pour votre :ref:`installation Python <using-on-windows>` ::

source: The command, if run with ``-h``, will show the available options::
fr: La commande, si lancée avec ``-h``, montrera les options disponibles ::

source: Installs pip by default, added the ``--without-pip`` and ``--copies`` options
fr: Installe pip par défaut, ajout des options ``--without-pip`` et ``--copies``

source: In earlier versions, if the target directory already existed, an error was raised, unless the ``--clear`` or ``--upgrade`` option was provided.
fr: Dans les versions précédentes, si le dossier de destination existais déjà, une erreur était levée, sauf si l'option ``--clear`` ou ``--upgrade`` était incluse.

source: The created ``pyvenv.cfg`` file also includes the ``include-system-site-packages`` key, set to ``true`` if ``venv`` is run with the ``--system-site-packages`` option, ``false`` otherwise.
fr: Le fichier crée ``pyenv.cfg`` inclus aussi la clé ``include-system-site-packages``, dont la valeur est ``true`` si ``venv`` est lancé avec l'option ``--system-site-packages``, sinon sa valeur est ``false``.

source: Unless the ``--without-pip`` option is given, :mod:`ensurepip` will be invoked to bootstrap ``pip`` into the virtual environment.
fr: Sauf si l'option ``--without-pip`` est incluse, :mod:`ensurepip` sera invoqué pour amorcer ``pip`` dans l'environnement virtuel.

source: Multiple paths can be given to ``venv``, in which case an identical virtual environment will be created, according to the given options, at each provided path.
fr: Plusieurs chemins peuvent être donnés a ``venv``, et dans ce cas un environnement virtuel sera créé, en fonction des options incluses, à chaque chemin donné.

source: Once a virtual environment has been created, it can be "activated" using a script in the virtual environment's binary directory. The invocation of the script is platform-specific:
fr: Une fois qu'un environnement virtuel a été créé, il peut être "activé" en utilisant un script dans le dossier binaire de l'environnement virtuel. L'invocation de ce script est spécifique à chaque plateforme :

source: Platform
fr: Plateforme

source: Shell
fr: Invite de commande

source: Command to activate virtual environment
fr: Commande pour activer l'environnement virtuel

source: C:\\> <venv>\\Scripts\\activate.bat
fr: :file:`C:\\{venv}\\Scripts\\activate.bat`

source: You don't specifically *need* to activate an environment; activation just prepends the virtual environment's binary directory to your path, so that "python" invokes the virtual environment's Python interpreter and you can run installed scripts without having to use their full path. However, all scripts installed in a virtual environment should be runnable without activating it, and run with the virtual environment's Python automatically.
fr: Vous ne devez pas spécialement activer un environnement ; l'activation ajoute juste le chemin du dossier de binaires de votre environnement virtuel a votre PATH, pour que "python" invoque l’interpréteur Python de l'environnement virtuel et que vous puissiez lancer des scripts installés sans avoir a utiliser leur chemin complet. Cependant, tous les scripts installés dans un environnement virtuel devrait être exécutables sans l'activer, et se lancer avec l'environnement virtuel Python automatiquement.

source: You can deactivate a virtual environment by typing "deactivate" in your shell. The exact mechanism is platform-specific: for example, the Bash activation script defines a "deactivate" function, whereas on Windows there are separate scripts called ``deactivate.bat`` and ``Deactivate.ps1`` which are installed when the virtual environment is created.
fr: Vous pouvez désactiver un environnement virtuel en écrivant "**deactivate**" dans votre shell. Le mécanisme est spécifique à chaque plateforme : Par exemple, le script d'activation pour Bash défini une fonction "**deactivate**", alors que sur Windows il y a des scripts séparés appelés ``deactivate.bat`` et ``Deactivate.ps1`` qui sont installés quand l'environnement virtuel est créé.

source: ``fish`` and ``csh`` activation scripts.
fr: Les scripts d'activation pour ``fish`` et ``csh``.

source: A virtual environment is a Python environment such that the Python interpreter, libraries and scripts installed into it are isolated from those installed in other virtual environments, and (by default) any libraries installed in a "system" Python, i.e., one which is installed as part of your operating system.
fr: Un environnement virtuel est un environnement Python tel que l'interpréteur Python, les librairies et les scripts installés sont isolés de ceux installés dans d'autres environnements virtuels, et (par défaut) de toutes autres bibliothèque installées dans un Python "système", par exemple celui qui est installé avec votre système d'exploitation.

source: A virtual environment is a directory tree which contains Python executable files and other files which indicate that it is a virtual environment.
fr: Un environnement virtuel est une arborescence de dossiers qui contiens les fichiers exécutables Python et autres fichiers qui indique que c'est un environnement virtuel.

source: Common installation tools such as ``Setuptools`` and ``pip`` work as expected with virtual environments. In other words, when a virtual environment is active, they install Python packages into the virtual environment without needing to be told to do so explicitly.
fr: Les outils d'installations communs comme ``Setuptools`` et ``pip`` fonctionnent comme prévu avec des environnements virtuels. En d'autres termes, quand un environnement virtuel est actif, ils installent les paquets Python dans l'environnement virtuel sans avoir besoin de leur préciser explicitement.

source: When a virtual environment is active (i.e., the virtual environment's Python interpreter is running), the attributes :attr:`sys.prefix` and :attr:`sys.exec_prefix` point to the base directory of the virtual environment, whereas :attr:`sys.base_prefix` and :attr:`sys.base_exec_prefix` point to the non-virtual environment Python installation which was used to create the virtual environment. If a virtual environment is not active, then :attr:`sys.prefix` is the same as :attr:`sys.base_prefix` and :attr:`sys.exec_prefix` is the same as :attr:`sys.base_exec_prefix` (they all point to a non-virtual environment Python installation).
fr: Quand un environnement virtuel est actif (Par exemple quand l’interpréteur Python de l'environnement virtuel est lancé), les attributs :attr:`sys.prefix` et :attr:`sys.exec_prefix` pointent vers le dossier racine de l'environnement virtuel, alors que :attr:`sys.base_prefix` et :attr:`sys.base_exec_prefix` pointent vers l'installation de Python qui n'est pas celle de l'environnement virtuel et qui a été utilisée pour créer l'environnement virtuel. Si un environnement virtuel n'est pas actif, alors :attr:`sys.prefix` est égal a :attr:`sys.base_prefix` et :attr:`sys.exec_prefix` est égal a :attr:`sys.base_exec_prefix` (ils pointent tous sur une installation Python qui n'est pas un environnement virtuel).

source: When a virtual environment is active, any options that change the installation path will be ignored from all distutils configuration files to prevent projects being inadvertently installed outside of the virtual environment.
fr: Quand un environnement virtuel est actif, toute option qui change le chemin d'installation sera ignoré de tous les fichiers de configuration **distutils** pour éviter que des projets soient accidentellement installés en dehors de l'environnement virtuel.

source: When working in a command shell, users can make a virtual environment active by running an ``activate`` script in the virtual environment's executables directory (the precise filename is shell-dependent), which prepends the virtual environment's directory for executables to the ``PATH`` environment variable for the running shell. There should be no need in other circumstances to activate a virtual environment—scripts installed into virtual environments have a "shebang" line which points to the virtual environment's Python interpreter. This means that the script will run with that interpreter regardless of the value of ``PATH``. On Windows, "shebang" line processing is supported if you have the Python Launcher for Windows installed (this was added to Python in 3.3 - see :pep:`397` for more details). Thus, double-clicking an installed script in a Windows Explorer window should run the script with the correct interpreter without there needing to be any reference to its virtual environment in ``PATH``.
fr: Quand vous travaillez dans une invite de commande shell, les utilisateurs peuvent activer un environnement virtuel en lançant un script ``activate`` situé dans de dossier des exécutables de l'environnement virtuel (le nom de fichier précis dépends du shell utilisé), ce qui ajoute le dossier des exécutables de l'environnement virtuel dans la variable d'environnement ``PATH``. Il ne devrait jamais y avoir besoin dans d'autre circonstances d'activer un environnement virtuel—des scripts installés dans un environnement virtuel on une ligne **shebang** qui pointe vers l’interpréteur Python de l'environnement virtuel. Cela veux dire que le script sera lancé avec cet interpréteur peut importe la valeur de ``PATH``. Sur Windows, le **process** de la ligne **shebang** est supporté si vous avez le Lanceur Python pour Windows installé (Cela a été ajouté a Python en 3.3 -- Voir :pep:`397` pour plus de détails). De ce fait, double cliquer un script installé dans une fenêtre de l'Explorateur Windows devrai lancer le script avec le correct interpréteur sans avoir besoin de référencer son environnement virtuel dans ``PATH``.

source: The high-level method described above makes use of a simple API which provides mechanisms for third-party virtual environment creators to customize environment creation according to their needs, the :class:`EnvBuilder` class.
fr: Les méthodes haut niveau décrites au dessus utilisent une API simple qui permets a des créateurs d'environnements virtuels externes de customiser la création d'environnements virtuels basés sur leurs besoins, la classe :class:`EnvBuilder`.

source: The :class:`EnvBuilder` class accepts the following keyword arguments on instantiation:
fr: La classe :class:`EnvBuilder` acceptent les arguments suivants lors de l'instanciation:

source: ``system_site_packages`` -- a Boolean value indicating that the system Python site-packages should be available to the environment (defaults to ``False``).
fr: ``system_site_packages`` -- Une valeur Booléenne qui indique que les site-packages du système Python devraient être disponibles a l'environnement virtuel (par défaut a ``False``).

source: ``clear`` -- a Boolean value which, if true, will delete the contents of any existing target directory, before creating the environment.
fr: ``clear`` -- Une valeur Booléene qui, si vraie, supprimera le contenu de n'importe quel dossier existant cible, avant de créer l'environnement.

source: ``symlinks`` -- a Boolean value indicating whether to attempt to symlink the Python binary (and any necessary DLLs or other binaries, e.g. ``pythonw.exe``), rather than copying.
fr: ``symlinks`` -- Une valeur Booléenne qui indique si il faut créer un lien symbolique de la librairie (et tous les DLLs ou autres binaires nécessaires, par exemple ``pythonw.exe``), plutôt que de la copier.

source: ``upgrade`` -- a Boolean value which, if true, will upgrade an existing environment with the running Python - for use when that Python has been upgraded in-place (defaults to ``False``).
fr: ``upgrade`` -- Une valeur Booléenne qui, si vraie, mettra a jour un environnement existant avec le Python lancé -- utilisé quand Python a été mis a jour sur place (par défaut a ``False``).

source: ``with_pip`` -- a Boolean value which, if true, ensures pip is installed in the virtual environment. This uses :mod:`ensurepip` with the ``--default-pip`` option.
fr: ``with_pip`` -- Une valeur Booléenne qui, si vraie, assure que pip est installé dans l'environnement virtuel. Cela utilise :mod:`ensurepip` avec l'option ``--default-pip``.

source: ``prompt`` -- a String to be used after virtual environment is activated (defaults to ``None`` which means directory name of the environment would be used).
fr: ``prompt`` -- Une String utilisée après que l'environnement virtuel est activé (par défaut a ``None`` ce qui veux dire qu'il utilisera le nom du dossier de l'environnement).

source: Added the ``with_pip`` parameter
fr: Ajout du paramètre ``with_pip``

source: Added the ``prompt`` parameter
fr: Ajout du paramètre ``prompt``

source: Creators of third-party virtual environment tools will be free to use the provided ``EnvBuilder`` class as a base class.
fr: Les créateurs des outils de création d'environnement virtuel externes seront libres d'utiliser la classe ``EnvBuilder`` en tant que classe de base.

source: The returned env-builder is an object which has a method, ``create``:
fr: Le **env-builder** retourné est un objet qui a une méthode, ``create``:

source: This method takes as required argument the path (absolute or relative to the current directory) of the target directory which is to contain the virtual environment. The ``create`` method will either create the environment in the specified directory, or raise an appropriate exception.
fr: Cette méthode prends en argument obligatoire le chemin (absolu ou relatif par rapport au dossier courant) du dossier cible qui doit contenir l'environnement virtuel. La méthode ``create`` doit soit créer un environnement dans le dossier spécifie, soit lever une exception.

source: The ``create`` method of the ``EnvBuilder`` class illustrates the hooks available for subclass customization::
fr: La méthode ``create`` de la classe ``EnvBuilder`` illustre les points d'entrées disponibles pour la customisation de sous-classes ::

source: Each of the methods :meth:`ensure_directories`, :meth:`create_configuration`, :meth:`setup_python`, :meth:`setup_scripts` and :meth:`post_setup` can be overridden.
fr: Chacune des méthodes :meth:`ensure_directories`, :meth:`create_configuration`, :meth:`setup_python`, :meth:`setup_scripts` et :meth:`post_setup` peuvent être écrasés.

source: Creates the environment directory and all necessary directories, and returns a context object. This is just a holder for attributes (such as paths), for use by the other methods. The directories are allowed to exist already, as long as either ``clear`` or ``upgrade`` were specified to allow operating on an existing environment directory.
fr: Crée un dossier d'environnement et tous les dossiers nécessaires, et retourne un objet contexte. C'est juste un conteneur pour des attributs (comme des chemins), qui sera utilisé par d'autres méthodes. Ces dossiers peuvent déjà exister. tant que ``clear`` ou ``upgrade`` ont été spécifiés pour permettre de telles opérations dans un dossier d'environnement existant.

source: Creates the ``pyvenv.cfg`` configuration file in the environment.
fr: Crée le fichier de configuration ``pyenv.cfg`` dans l'environnement.

source: Creates a copy of the Python executable (and, under Windows, DLLs) in the environment. On a POSIX system, if a specific executable ``python3.x`` was used, symlinks to ``python`` and ``python3`` will be created pointing to that executable, unless files with those names already exist.
fr: Crée une copie de l’exécutable Python (et, sous Windows, les DLLs) dans l'environnement. Sur un système POSIX, si un exécutable ``python3.x`` a été utilisé, des liens symboliques vers ``python`` et ``python3`` seront crées pointant vers cet exécutable, sauf si des fichiers avec ces noms existent déjà.

source: Installs activation scripts appropriate to the platform into the virtual environment.
fr: Installe des scripts d'activation appropriés pour la plateforme dans l'environnement virtuel.

source: A placeholder method which can be overridden in third party implementations to pre-install packages in the virtual environment or perform other post-creation steps.
fr: Une méthode qui n'est la que pour se faire surcharger dans des implémentation externes pour pré installer des paquets dans l'environnement virtuel ou pour exécuter des étapes post-création.

source: In addition, :class:`EnvBuilder` provides this utility method that can be called from :meth:`setup_scripts` or :meth:`post_setup` in subclasses to assist in installing custom scripts into the virtual environment.
fr: De plus, :class:`EnvBuilder` propose cette méthode utilitaire qui peut être appelée de :meth:`setup_scripts` ou :meth:`post_setup` dans des sous classes pour assister dans l'installation de scripts customs dans l'environnement virtuel.

source: *path* is the path to a directory that should contain subdirectories "common", "posix", "nt", each containing scripts destined for the bin directory in the environment. The contents of "common" and the directory corresponding to :data:`os.name` are copied after some text replacement of placeholders:
fr: *path* corresponds au chemin vers le dossier qui contiens les sous dossiers "**common**", "**posix**", "**nt**", chacun contenant des scripts destinés pour le dossier "**bin**" dans l'environnement. Le contenu du dossier "**common**" et le dossier correspondant a :data:`os.name` sont copiés après quelque remplacement de texte temporaires :

source: ``__VENV_DIR__`` is replaced with the absolute path of the environment directory.
fr: ``__VENV_DIR__`` est remplacé avec le chemin absolu du dossier de l'environnement.

source: ``__VENV_NAME__`` is replaced with the environment name (final path segment of environment directory).
fr: ``__VENV_NAME__`` est remplacé avec le nom de l'environnement (le dernier segment du chemin vers le dossier de l'environnement).

source: ``__VENV_PROMPT__`` is replaced with the prompt (the environment name surrounded by parentheses and with a following space)
fr: ``__VENV_PROMPT__`` est remplacé par le prompt (nom de l'environnement entouré de parenthèses et avec un espace le suivant).

source: ``__VENV_BIN_NAME__`` is replaced with the name of the bin directory (either ``bin`` or ``Scripts``).
fr: ``__VENV_BIN_NAME__`` est remplacé par le nom du dossier **bin** (soit ``bin`` soit ``Scripts``).

source: ``__VENV_PYTHON__`` is replaced with the absolute path of the environment's executable.
fr: ``__VENV_PYTHON__`` est remplacé avec le chemin absolu de l’exécutable de l'environnement.

source: The directories are allowed to exist (for when an existing environment is being upgraded).
fr: Les dossiers peuvent exister (pour quand un environnement existant est mis a jour).

source: There is also a module-level convenience function:
fr: Il y a aussi une fonction pratique au niveau du module :

source: Create an :class:`EnvBuilder` with the given keyword arguments, and call its :meth:`~EnvBuilder.create` method with the *env_dir* argument.
fr: Crée une :class:`EnvBuilder` avec les arguments donnés, et appelle sa méthode :meth:`~EnvBuilder.create` avec l'argument *env_dir*.

source: An example of extending ``EnvBuilder``
fr: Un exemple d'extension de ``EnvBuilder``

source: The following script shows how to extend :class:`EnvBuilder` by implementing a subclass which installs setuptools and pip into a created virtual environment::
fr: Le script qui suis montre comment étendre :class:`EnvBuilder` en implémentant une sous-classe qui installe **setuptools** et **pip** dans un environnement créé ::
