Repository: python/python-docs-fr
Catalog: library/wave.po
Languages: fr

source: :mod:`wave` --- Read and write WAV files
fr: :mod:`wave` --- Lecture et écriture des fichiers WAV

source: **Source code:** :source:`Lib/wave.py`
fr: **Code source :** :source:`Lib/wave.py`

source: The :mod:`wave` module provides a convenient interface to the WAV sound format. It does not support compression/decompression, but it does support mono/stereo.
fr: Le module :mod:`wave` fournit une interface pratique pour le format de son WAV. Il ne gère pas la compression ni la décompression, mais gère le mono et le stéréo.

source: The :mod:`wave` module defines the following function and exception:
fr: Le module :mod:`wave` définit la fonction et l'exception suivante :

source: If *file* is a string, open the file by that name, otherwise treat it as a file-like object. *mode* can be:
fr: Si *file* est une chaîne de caractères, ouvre le fichier sous ce nom, sinon, il est traité comme un objet de type fichier. *mode* peut être :

source: Read only mode.
fr: Mode lecture seule.

source: Write only mode.
fr: Mode écriture seule.

source: Note that it does not allow read/write WAV files.
fr: Notez que ce module ne permet pas de manipuler des fichiers WAV en lecture/écriture.

source: A *mode* of ``'rb'`` returns a :class:`Wave_read` object, while a *mode* of ``'wb'`` returns a :class:`Wave_write` object. If *mode* is omitted and a file-like object is passed as *file*, ``file.mode`` is used as the default value for *mode*.
fr: Un *mode* ``'rb'`` renvoie un objet :class:`Wave_read`, alors qu'un *mode* ``'wb'`` renvoie un objet :class:`Wave_write`. Si *mode* est omis et qu'un objet de type fichier est donné au paramètre *file*, ``file.mode`` est utilisé comme valeur par défaut pour *mode*.

source: If you pass in a file-like object, the wave object will not close it when its :meth:`close` method is called; it is the caller's responsibility to close the file object.
fr: Si vous donnez un objet de type fichier, l'objet *wave* ne le ferme pas lorsque sa méthode :meth:`close` est appelée car c'est l'appelant qui est responsable de la fermeture.

source: The :func:`.open` function may be used in a :keyword:`with` statement. When the :keyword:`!with` block completes, the :meth:`Wave_read.close() <wave.Wave_read.close>` or :meth:`Wave_write.close() <wave.Wave_write.close()>` method is called.
fr: La fonction :func:`.open` peut être utilisée dans une instruction :keyword:`with`. Lorsque le :keyword:`!with` est terminé, la méthode :meth:`Wave_read.close() <wave.Wave_read.close>` ou la méthode :meth:`Wave_write.close() <wave.Wave_write.close()>` est appelée.

source: Added support for unseekable files.
fr: Ajout de la gestion des fichiers non navigables.

source: A synonym for :func:`.open`, maintained for backwards compatibility.
fr: Un synonyme de :func:`.open`, maintenu pour la rétrocompatibilité.

source: An error raised when something is impossible because it violates the WAV specification or hits an implementation deficiency.
fr: Une erreur est levée lorsque quelque chose est impossible car elle enfreint la spécification WAV ou rencontre un problème d'implémentation.

source: Wave_read Objects
fr: Objets Wave_read

source: Wave_read objects, as returned by :func:`.open`, have the following methods:
fr: Les objets Wave_read, tels qu'ils sont renvoyés par :func:`.open`, ont les méthodes suivantes :

source: Close the stream if it was opened by :mod:`wave`, and make the instance unusable. This is called automatically on object collection.
fr: Ferme le flux s'il a été ouvert par :mod:`wave` et rend l'instance inutilisable. Ceci est appelé automatiquement lorsque l'objet est détruit .

source: Returns number of audio channels (``1`` for mono, ``2`` for stereo).
fr: Renvoie le nombre de canaux audio (``1`` pour mono, ``2`` pour stéréo).

source: Returns sample width in bytes.
fr: Renvoie la largeur de l'échantillon en octets.

source: Returns sampling frequency.
fr: Renvoie la fréquence d'échantillonnage.

source: Returns number of audio frames.
fr: Renvoie le nombre de trames audio.

source: Returns compression type (``'NONE'`` is the only supported type).
fr: Renvoie le type de compression (``'NONE'`` est le seul type géré).

source: Human-readable version of :meth:`getcomptype`. Usually ``'not compressed'`` parallels ``'NONE'``.
fr: Version compréhensible de :meth:`getcomptype`. Généralement, ``'not compressed'`` équivaut à ``'NONE'``.

source: Returns a :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, equivalent to output of the :meth:`get\*` methods.
fr: Renvoie une :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, équivalent à la sortie des méthodes :meth:`get\*`.

source: Reads and returns at most *n* frames of audio, as a :class:`bytes` object.
fr: Lit et renvoie au plus *n* trames audio, sous forme d'objet :class:`bytes`.

source: Rewind the file pointer to the beginning of the audio stream.
fr: Remet le pointeur de fichier au début du flux audio.

source: The following two methods are defined for compatibility with the :mod:`aifc` module, and don't do anything interesting.
fr: Les deux méthodes suivantes sont définies pour la compatibilité avec le module :mod:`aifc` ; elles ne font rien d’intéressant.

source: Returns ``None``.
fr: Renvoie ``None``.

source: Raise an error.
fr: Lève une erreur.

source: The following two methods define a term "position" which is compatible between them, and is otherwise implementation dependent.
fr: Les deux fonctions suivante utilisent le vocabulaire "position". Ces positions sont compatible entre elles, la "position" de l'un est compatible avec la "position" de l'autre. Cette position est dépendante de l'implémentation.

source: Set the file pointer to the specified position.
fr: Place le pointeur du fichier sur la position spécifiée.

source: Return current file pointer position.
fr: Renvoie la position actuelle du pointeur du fichier.

source: Wave_write Objects
fr: Objets Wave_write

source: For seekable output streams, the ``wave`` header will automatically be updated to reflect the number of frames actually written. For unseekable streams, the *nframes* value must be accurate when the first frame data is written. An accurate *nframes* value can be achieved either by calling :meth:`~Wave_write.setnframes` or :meth:`~Wave_write.setparams` with the number of frames that will be written before :meth:`~Wave_write.close` is called and then using :meth:`~Wave_write.writeframesraw` to write the frame data, or by calling :meth:`~Wave_write.writeframes` with all of the frame data to be written. In the latter case :meth:`~Wave_write.writeframes` will calculate the number of frames in the data and set *nframes* accordingly before writing the frame data.
fr: Pour les flux de sortie navigables, l'en-tête ``wave`` est automatiquement mis à jour pour refléter le nombre de trames réellement écrites. Pour les flux non indexables, la valeur *nframes* doit être précise lorsque la première trame est écrite. Une valeur précise de *nframes* peut être obtenue en appelant les méthodes :meth:`~Wave_write.setnframes` ou :meth:`~Wave_write.setparams` en passant en paramètre le nombre de trames qui seront écrites avant que :meth:`~Wave_write.close` soit appelé puis en utilisant la méthode :meth:`~Wave_write.writeframesraw` pour écrire les trames audio, ou en appelant la méthode :meth:`~Wave_write.writeframes` avec toutes les trames audio. Dans ce dernier cas, la méthode :meth:`~Wave_write.writeframes` calcule le nombre de trames dans le flux audio et définit *nframes* en conséquence avant d'écrire les données des trames.

source: Wave_write objects, as returned by :func:`.open`, have the following methods:
fr: Les objets Wave_write, tels qu'ils sont renvoyés par :func:`.open`, ont les méthodes suivantes :

source: Make sure *nframes* is correct, and close the file if it was opened by :mod:`wave`. This method is called upon object collection. It will raise an exception if the output stream is not seekable and *nframes* does not match the number of frames actually written.
fr: Assurez-vous que *nframes* soit correct et fermez le fichier s'il a été ouvert par :mod:`wave`. Cette méthode est appelée à la destruction de l'objet. Il lève une erreur si le flux de sortie n'est pas navigable et si *nframes* ne correspond pas au nombre de trames réellement écrites.

source: Set the number of channels.
fr: Définit le nombre de canaux.

source: Set the sample width to *n* bytes.
fr: Définit la largeur de l'échantillon à *n* octets.

source: Set the frame rate to *n*.
fr: Définit la fréquence des trames à *n*.

source: A non-integral input to this method is rounded to the nearest integer.
fr: Un paramètre non-entier passé à cette méthode est arrondi à l'entier le plus proche.

source: Set the number of frames to *n*. This will be changed later if the number of frames actually written is different (this update attempt will raise an error if the output stream is not seekable).
fr: Définit le nombre de trames à *n*. Cela sera modifié ultérieurement si le nombre de trames réellement écrites est différent (la tentative de mise à jour générera une erreur si le flux de sortie n'est pas indexable).

source: Set the compression type and description. At the moment, only compression type ``NONE`` is supported, meaning no compression.
fr: Définit le type de compression et la description. Pour le moment, seul le type de compression ``NONE`` est géré, c'est-à-dire aucune compression.

source: The *tuple* should be ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, with values valid for the :meth:`set\*` methods. Sets all parameters.
fr: Le *tuple* doit être ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, avec des valeurs valides pour les méthodes :meth:`set\*`. Tous les paramètres sont obligatoires et doivent être définis.

source: Return current position in the file, with the same disclaimer for the :meth:`Wave_read.tell` and :meth:`Wave_read.setpos` methods.
fr: Renvoie la position actuelle dans le fichier, avec les mêmes réserves que pour les méthodes :meth:`Wave_read.tell` et :meth:`Wave_read.setpos`.

source: Write audio frames, without correcting *nframes*.
fr: Écrit les trames audio sans corriger *nframes*.

source: Any :term:`bytes-like object` is now accepted.
fr: N'importe quel :term:`bytes-like object` est maintenant accepté.

source: Write audio frames and make sure *nframes* is correct. It will raise an error if the output stream is not seekable and the total number of frames that have been written after *data* has been written does not match the previously set value for *nframes*.
fr: Écrit des trames audio et s'assure que *nframes* est correct. Une erreur est levée si le flux de sortie est non-navigable et si le nombre total de trames écrites après que *data* soit écrit ne correspond pas à la valeur précédemment définie pour *nframes*.

source: Note that it is invalid to set any parameters after calling :meth:`writeframes` or :meth:`writeframesraw`, and any attempt to do so will raise :exc:`wave.Error`.
fr: Notez qu'il est impossible de définir des paramètres après avoir appelé :meth:`writeframes` ou :meth:`writeframesraw`, et toute tentative en ce sens lève une :exc:`wave.Error`.
