Repository: python/python-docs-fr
Catalog: library/xml.sax.handler.po
Languages: fr

source: **Source code:** :source:`Lib/xml/sax/handler.py`
fr: **Code source :** :source:`Lib/xml/sax/handler.py`

source: The SAX API defines five kinds of handlers: content handlers, DTD handlers, error handlers, entity resolvers and lexical handlers. Applications normally only need to implement those interfaces whose events they are interested in; they can implement the interfaces in a single object or in multiple objects. Handler implementations should inherit from the base classes provided in the module :mod:`xml.sax.handler`, so that all methods get default implementations.
fr: L'API *SAX* définit cinq types de gestionnaires : les gestionnaires de contenu, les gestionnaires de *DTD*, les gestionnaires d'erreurs, les résolveurs d'entités et les gestionnaires lexicaux. Les applications n'ont normalement besoin d'implémenter que les interfaces dont les événements les intéressent ; elles peuvent implémenter les interfaces dans un seul objet ou dans plusieurs objets. Les implémentations de gestionnaires doivent hériter des classes mères fournies dans le module :mod:`xml.sax.handler`, afin que toutes les méthodes aient des implémentations par défaut.

source: This is the main callback interface in SAX, and the one most important to applications. The order of events in this interface mirrors the order of the information in the document.
fr: Il s'agit de l'interface de rappel principale de *SAX* et de la plus importante pour les applications. L'ordre des événements dans cette interface reflète l'ordre des informations dans le document.

source: Handle DTD events.
fr: Gestionnaires d'évènements *DTD*

source: This interface specifies only those DTD events required for basic parsing (unparsed entities and attributes).
fr: Cette interface concerne uniquement les événements *DTD* requis pour une analyse basique (entités et attributs non analysés).

source: Basic interface for resolving entities. If you create an object implementing this interface, then register the object with your Parser, the parser will call the method in your object to resolve all external entities.
fr: Interface de base pour résoudre les entités. Si vous créez un objet implémentant cette interface, puis enregistrez l'objet auprès de votre analyseur, l'analyseur appellera la méthode de votre objet pour résoudre toutes les entités externes.

source: Interface used by the parser to present error and warning messages to the application. The methods of this object control whether errors are immediately converted to exceptions or are handled in some other way.
fr: Interface utilisée par l'analyseur pour présenter des messages d'erreur et d'avertissement à l'application. Les méthodes de cet objet permettent de choisir si les erreurs doivent être immédiatement converties en exceptions ou si elles doivent être traitées d'une autre manière.

source: Interface used by the parser to represent low frequency events which may not be of interest to many applications.
fr: Interface utilisée par l'analyseur pour représenter des événements rares qui n'intéressent que peu d'applications.

source: In addition to these classes, :mod:`xml.sax.handler` provides symbolic constants for the feature and property names.
fr: En plus de ces classes, :mod:`xml.sax.handler` fournit des constantes symboliques pour les noms de fonctionnalités et de propriétés.

source: value: ``"http://xml.org/sax/features/namespaces"``
fr: valeur : ``"http://xml.org/sax/features/namespaces"``

source: true: Perform Namespace processing.
fr: vrai : effectue le traitement de l'espace de noms.

source: false: Optionally do not perform Namespace processing (implies namespace-prefixes; default).
fr: faux : n'effectue pas le traitement des espaces de noms (implique *namespace-prefixes* ; valeur par défaut).

source: access: (parsing) read-only; (not parsing) read/write
fr: accès : (lors de l'analyse) en lecture seule ; (hors de l'analyse) lecture-écriture

source: value: ``"http://xml.org/sax/features/namespace-prefixes"``
fr: valeur : ``"http://xml.org/sax/features/namespace-prefixes"``

source: true: Report the original prefixed names and attributes used for Namespace declarations.
fr: vrai : renvoie les noms et attributs avec les préfixes originaux utilisés dans les déclarations d'espaces de noms.

source: false: Do not report attributes used for Namespace declarations, and optionally do not report original prefixed names (default).
fr: faux : ne renvoie pas les attributs utilisés pour les déclarations d'espaces de noms et, éventuellement, ne signale pas les noms avec les préfixes originaux (par défaut).

source: value: ``"http://xml.org/sax/features/string-interning"``
fr: valeur : ``"http://xml.org/sax/features/string-interning"``

source: true: All element names, prefixes, attribute names, Namespace URIs, and local names are interned using the built-in intern function.
fr: vrai : tous les noms d'éléments, préfixes, noms d'attributs, URI d'espace de noms et noms locaux sont rendus internes à l'aide de la fonction native correspondante.

source: false: Names are not necessarily interned, although they may be (default).
fr: faux : les noms ne sont pas nécessairement rendus internes, bien qu'ils puissent l'être (par défaut).

source: value: ``"http://xml.org/sax/features/validation"``
fr: valeur : ``"http://xml.org/sax/features/validation"``

source: true: Report all validation errors (implies external-general-entities and external-parameter-entities).
fr: vrai : signale toutes les erreurs de validation (implique *external-general-entities* et *external-parameter-entities*).

source: false: Do not report validation errors.
fr: faux : ne signale pas les erreurs de validation.

source: value: ``"http://xml.org/sax/features/external-general-entities"``
fr: valeur : ``"http://xml.org/sax/features/external-general-entities"``

source: true: Include all external general (text) entities.
fr: vrai : Inclut toutes les entités générales (texte) externes.

source: false: Do not include external general entities.
fr: faux : n'inclut pas les entités générales externes.

source: value: ``"http://xml.org/sax/features/external-parameter-entities"``
fr: valeur : ``"http://xml.org/sax/features/external-parameter-entities"``

source: true: Include all external parameter entities, including the external DTD subset.
fr: vrai : Inclut toutes les entités de paramètres externes, y compris les sous-ensembles *DTD* externes.

source: false: Do not include any external parameter entities, even the external DTD subset.
fr: faux : n'inclue aucune entité de paramètre externe, même les sous-ensembles *DTD* externes.

source: List of all features.
fr: Liste de toutes les fonctionnalités.

source: value: ``"http://xml.org/sax/properties/lexical-handler"``
fr: valeur : ``"http://xml.org/sax/properties/lexical-handler"``

source: data type: xml.sax.handler.LexicalHandler (not supported in Python 2)
fr: type de données : ``xml.sax.handler.LexicalHandler`` (non pris en charge dans Python 2)

source: description: An optional extension handler for lexical events like comments.
fr: description : gestionnaire d'extension facultatif pour les événements lexicaux tels que les commentaires.

source: access: read/write
fr: accès : lecture-écriture

source: value: ``"http://xml.org/sax/properties/declaration-handler"``
fr: valeur : ``"http://xml.org/sax/properties/declaration-handler"``

source: data type: xml.sax.sax2lib.DeclHandler (not supported in Python 2)
fr: type de données : xml.sax.sax2lib.DeclHandler (non pris en charge dans Python 2)

source: description: An optional extension handler for DTD-related events other than notations and unparsed entities.
fr: description : gestionnaire d'extension facultatif pour les événements liés à la *DTD* autres que les notations et les entités non analysées.

source: value: ``"http://xml.org/sax/properties/dom-node"``
fr: valeur : ``"http://xml.org/sax/properties/dom-node"``

source: data type: org.w3c.dom.Node (not supported in Python 2)
fr: type de données : org.w3c.dom.Node (non pris en charge dans Python 2)

source: description: When parsing, the current DOM node being visited if this is a DOM iterator; when not parsing, the root DOM node for iteration.
fr: description : lors de l'analyse, le nœud DOM actuel visité s'il s'agit d'un itérateur DOM ; hors de l'analyse, le nœud racine du DOM pour l'itération.

source: value: ``"http://xml.org/sax/properties/xml-string"``
fr: valeur : ``"http://xml.org/sax/properties/xml-string"``

source: data type: Bytes
fr: type de données : octets

source: description: The literal string of characters that was the source for the current event.
fr: description : chaîne littérale de caractères qui était la source de l'événement en cours.

source: access: read-only
fr: accès : lecture seule

source: List of all known property names.
fr: Liste de tous les noms de propriétés connus.

source: ContentHandler Objects
fr: Objets *ContentHandler*

source: Users are expected to subclass :class:`ContentHandler` to support their application. The following methods are called by the parser on the appropriate events in the input document:
fr: Les utilisateurs doivent sous-classer :class:`ContentHandler` dans leur application. Les méthodes suivantes sont appelées par l'analyseur pour notifier les événements appropriés dans le document d'entrée :

source: Called by the parser to give the application a locator for locating the origin of document events.
fr: Appelé par l'analyseur pour donner à l'application un localisateur permettant de localiser l'origine des événements du document.

source: SAX parsers are strongly encouraged (though not absolutely required) to supply a locator: if it does so, it must supply the locator to the application by invoking this method before invoking any of the other methods in the DocumentHandler interface.
fr: Les analyseurs *SAX* sont fortement encouragés (bien que ce ne soit pas absolument obligatoire) à fournir un localisateur : s'ils le font, ils doivent fournir le localisateur à l'application en appelant cette méthode avant d'invoquer l'une des autres méthodes de l'interface *DocumentHandler*.

source: The locator allows the application to determine the end position of any document-related event, even if the parser is not reporting an error. Typically, the application will use this information for reporting its own errors (such as character content that does not match an application's business rules). The information returned by the locator is probably not sufficient for use with a search engine.
fr: Le localisateur permet à l'application de déterminer la position finale de tout événement lié au document, même si l'analyseur ne signale pas d'erreur. En règle générale, l'application utilise ces informations pour signaler ses propres erreurs (telles que le contenu d'un champ texte qui ne correspond pas aux règles métier d'une application). Les informations renvoyées par le localisateur ne sont probablement pas suffisantes pour être utilisées avec un moteur de recherche.

source: Note that the locator will return correct information only during the invocation of the events in this interface. The application should not attempt to use it at any other time.
fr: Notez que le localisateur renvoie des informations correctes pendant la durée de l'invocation des événements dans cette interface. L'application ne doit pas tenter de l'utiliser à un autre moment.

source: Receive notification of the beginning of a document.
fr: Reçoit la notification correspondant au début du document.

source: The SAX parser will invoke this method only once, before any other methods in this interface or in DTDHandler (except for :meth:`setDocumentLocator`).
fr: L'analyseur *SAX* invoque cette méthode une seule fois, avant toute autre méthode dans cette interface ou dans *DTDHandler* (sauf pour :meth:`setDocumentLocator`).

source: Receive notification of the end of a document.
fr: Reçoit la notification correspondant à la fin du document.

source: The SAX parser will invoke this method only once, and it will be the last method invoked during the parse. The parser shall not invoke this method until it has either abandoned parsing (because of an unrecoverable error) or reached the end of input.
fr: L'analyseur *SAX* n'invoque cette méthode qu'une seule fois et c'est la dernière méthode invoquée lors de l'analyse. L'analyseur ne doit pas invoquer cette méthode tant qu'il n'a pas abandonné l'analyse (en raison d'une erreur irrécupérable) ou atteint la fin de l'entrée.

source: Begin the scope of a prefix-URI Namespace mapping.
fr: Commence la portée d’une correspondance d’espace de noms préfixe-URI.

source: The information from this event is not necessary for normal Namespace processing: the SAX XML reader will automatically replace prefixes for element and attribute names when the ``feature_namespaces`` feature is enabled (the default).
fr: Les informations de cet événement ne sont pas nécessaires au traitement normal des espaces de noms : le lecteur XML *SAX* remplace automatiquement les préfixes des noms d'éléments et d'attributs lorsque la fonctionnalité ``feature_namespaces`` est activée (la valeur par défaut).

source: There are cases, however, when applications need to use prefixes in character data or in attribute values, where they cannot safely be expanded automatically; the :meth:`startPrefixMapping` and :meth:`endPrefixMapping` events supply the information to the application to expand prefixes in those contexts itself, if necessary.
fr: Il existe cependant des cas où les applications doivent utiliser des préfixes dans des champs textes ou dans les valeurs d'attribut, où ils ne peuvent pas être développés automatiquement en toute sécurité ; les événements :meth:`startPrefixMapping` et :meth:`endPrefixMapping` fournissent les informations à l'application pour développer elle-même les préfixes dans ces contextes, si nécessaire.

source: Note that :meth:`startPrefixMapping` and :meth:`endPrefixMapping` events are not guaranteed to be properly nested relative to each-other: all :meth:`startPrefixMapping` events will occur before the corresponding :meth:`startElement` event, and all :meth:`endPrefixMapping` events will occur after the corresponding :meth:`endElement` event, but their order is not guaranteed.
fr: Notez qu'il n'est pas garanti que les événements :meth:`startPrefixMapping` et :meth:`endPrefixMapping` soient correctement imbriqués les uns par rapport aux autres : tout événement :meth:`startPrefixMapping` se produit avant l'événement :meth:`startElement` correspondant, et tout événement :meth:`endPrefixMapping` se produit après l'événement :meth:`endElement` correspondant, mais leur ordre n'est pas garanti.

source: End the scope of a prefix-URI mapping.
fr: Termine la portée d’une correspondance préfixe-URI.

source: See :meth:`startPrefixMapping` for details. This event will always occur after the corresponding :meth:`endElement` event, but the order of :meth:`endPrefixMapping` events is not otherwise guaranteed.
fr: Voir :meth:`startPrefixMapping` pour plus de détails. Cet événement se produit toujours après l'événement :meth:`endElement` correspondant, mais l'ordre des événements :meth:`endPrefixMapping` n'est pas garanti entre eux.

source: Signals the start of an element in non-namespace mode.
fr: Signale le début d’un élément en mode sans espaces de noms.

source: The *name* parameter contains the raw XML 1.0 name of the element type as a string and the *attrs* parameter holds an object of the :class:`~xml.sax.xmlreader.Attributes` interface (see :ref:`attributes-objects`) containing the attributes of the element. The object passed as *attrs* may be re-used by the parser; holding on to a reference to it is not a reliable way to keep a copy of the attributes. To keep a copy of the attributes, use the :meth:`copy` method of the *attrs* object.
fr: Le paramètre *name* contient le nom brut XML 1.0 du type d'élément sous forme de chaîne et le paramètre *attrs* contient un objet de l'interface :class:`~xml.sax.xmlreader.Attributes` (voir :ref:`attributes-objects`) contenant les attributs de l'élément. L'objet passé comme *attrs* peut être réutilisé par l'analyseur ; conserver une référence à celui-ci n’est pas un moyen fiable de conserver une copie des attributs. Pour conserver une copie des attributs, utilisez la méthode :meth:`copy` de l'objet *attrs*.

source: Signals the end of an element in non-namespace mode.
fr: Signale la fin d'un élément en mode sans espaces de noms.

source: The *name* parameter contains the name of the element type, just as with the :meth:`startElement` event.
fr: Le paramètre *name* contient le nom du type d'élément, tout comme pour l'événement :meth:`startElement`.

source: Signals the start of an element in namespace mode.
fr: Signale le début d’un élément en mode avec espaces de noms.

source: The *name* parameter contains the name of the element type as a ``(uri, localname)`` tuple, the *qname* parameter contains the raw XML 1.0 name used in the source document, and the *attrs* parameter holds an instance of the :class:`~xml.sax.xmlreader.AttributesNS` interface (see :ref:`attributes-ns-objects`) containing the attributes of the element. If no namespace is associated with the element, the *uri* component of *name* will be ``None``. The object passed as *attrs* may be re-used by the parser; holding on to a reference to it is not a reliable way to keep a copy of the attributes. To keep a copy of the attributes, use the :meth:`copy` method of the *attrs* object.
fr: Le paramètre *name* contient le nom du type d'élément sous forme de *n*-uplet ``(uri, localname)``, le paramètre *qname* contient le nom XML 1.0 brut utilisé dans le document source et le paramètre *attrs* contient une instance de l'interface :class:`~xml.sax.xmlreader.AttributesNS` (voir :ref:`attributes-ns-objects`) contenant les attributs de l'élément. Si aucun espace de noms n'est associé à l'élément, le composant *uri* de *name* est ``None``. L'objet passé comme *attrs* peut être réutilisé par l'analyseur ; conserver une référence à celui-ci n’est pas un moyen fiable de conserver une copie des attributs. Pour conserver une copie des attributs, utilisez la méthode :meth:`copy` de l'objet *attrs*.

source: Parsers may set the *qname* parameter to ``None``, unless the ``feature_namespace_prefixes`` feature is activated.
fr: Les analyseurs peuvent définir le paramètre *qname* à ``None``, à moins que la fonctionnalité ``feature_namespace_prefixes`` ne soit activée.

source: Signals the end of an element in namespace mode.
fr: Signale la fin d'un élément en mode avec espaces de noms.

source: The *name* parameter contains the name of the element type, just as with the :meth:`startElementNS` method, likewise the *qname* parameter.
fr: Le paramètre *name* contient le nom du type d'élément, tout comme avec la méthode :meth:`startElementNS`, de même que le paramètre *qname*.

source: Receive notification of character data.
fr: Reçoit une notification correspondant à des données de type caractère.

source: The Parser will call this method to report each chunk of character data. SAX parsers may return all contiguous character data in a single chunk, or they may split it into several chunks; however, all of the characters in any single event must come from the same external entity so that the Locator provides useful information.
fr: L'analyseur appelle cette méthode pour signaler chaque morceau de données de caractères. Les analyseurs *SAX* peuvent renvoyer toutes les données de caractères contiguës en un seul morceau ou ils peuvent les diviser en plusieurs morceaux ; cependant, tous les caractères d'un événement doivent provenir de la même entité externe afin que le localisateur fournisse des informations utiles.

source: *content* may be a string or bytes instance; the ``expat`` reader module always produces strings.
fr: *content* peut être une instance de chaîne ou d'octets ; le module lecteur ``expat`` produit toujours des chaînes.

source: The earlier SAX 1 interface provided by the Python XML Special Interest Group used a more Java-like interface for this method. Since most parsers used from Python did not take advantage of the older interface, the simpler signature was chosen to replace it. To convert old code to the new interface, use *content* instead of slicing content with the old *offset* and *length* parameters.
fr: l'interface *SAX 1* précédente fournie par Python XML utilisait une interface plus proche de Java pour cette méthode. Étant donné que la plupart des analyseurs utilisés à partir de Python ne tiraient pas parti de l’ancienne interface, la signature la plus simple a été choisie pour la remplacer. Pour convertir l'ancien code vers la nouvelle interface, utilisez *content* au lieu de découper le contenu avec les anciens paramètres *offset* et *length*.

source: Receive notification of ignorable whitespace in element content.
fr: Reçoit une notification en cas d'espaces pouvant être ignorées dans le contenu de l'élément.

source: Validating Parsers must use this method to report each chunk of ignorable whitespace (see the W3C XML 1.0 recommendation, section 2.10): non-validating parsers may also use this method if they are capable of parsing and using content models.
fr: Les analyseurs validateurs doivent utiliser cette méthode pour signaler chaque morceau d'espaces pouvant être ignorées (voir la recommandation W3C XML 1.0, section 2.10) : les analyseurs non validateurs peuvent également utiliser cette méthode s'ils sont capables d'analyser et d'utiliser des modèles de contenu.

source: SAX parsers may return all contiguous whitespace in a single chunk, or they may split it into several chunks; however, all of the characters in any single event must come from the same external entity, so that the Locator provides useful information.
fr: Les analyseurs *SAX* peuvent renvoyer tous les espaces contigües en un seul morceau ou ils peuvent le diviser en plusieurs morceaux ; cependant, tous les caractères d'un événement doivent provenir de la même entité externe, afin que le localisateur fournisse des informations utiles.

source: Receive notification of a processing instruction.
fr: Reçoit une notification correspondant à une instruction de traitement.

source: The Parser will invoke this method once for each processing instruction found: note that processing instructions may occur before or after the main document element.
fr: L'analyseur invoque cette méthode une fois pour chaque instruction de traitement trouvée : notez que les instructions de traitement peuvent survenir avant ou après l'élément principal du document.

source: A SAX parser should never report an XML declaration (XML 1.0, section 2.8) or a text declaration (XML 1.0, section 4.3.1) using this method.
fr: Un analyseur *SAX* ne doit jamais rapporter une déclaration XML (XML 1.0, section 2.8) ou une déclaration texte (XML 1.0, section 4.3.1) en utilisant cette méthode.

source: Receive notification of a skipped entity.
fr: Reçoit une notification correspondant à une entité ignorée.
