Repository: python/python-docs-fr
Catalog: library/xml.etree.elementtree.po
Languages: fr

source: Return an iterator over the events which have been encountered in the data fed to the parser. The iterator yields ``(event, elem)`` pairs, where *event* is a string representing the type of event (e.g. ``"end"``) and *elem* is the encountered :class:`Element` object, or other context value as follows.
fr: Renvoie un itérateur sur les événements qui ont été rencontrés dans les données fournies à l'analyseur. L'itérateur génère des paires ``(event, elem)``, où *event* est une chaîne représentant le type d'événement (par exemple ``"end"``) et *elem* est l'objet :class:`Element` rencontré, ou une autre valeur de contexte comme suit.

source: ``start``, ``end``: the current Element.
fr: ``start``, ``end`` : l'élément actuel.

source: ``comment``, ``pi``: the current comment / processing instruction
fr: ``comment``, ``pi`` : le commentaire ou l'instruction de traitement actuel

source: ``start-ns``: a tuple ``(prefix, uri)`` naming the declared namespace mapping.
fr: ``start-ns`` : couple ``(prefix, uri)`` nommant la correspondance d'espace de noms déclarée.

source: ``end-ns``: :const:`None` (this may change in a future version)
fr: ``end-ns`` : :const:`None` (cela peut changer dans une version future)

source: Events provided in a previous call to :meth:`read_events` will not be yielded again. Events are consumed from the internal queue only when they are retrieved from the iterator, so multiple readers iterating in parallel over iterators obtained from :meth:`read_events` will have unpredictable results.
fr: Les événements fournis lors d'un appel précédent à :meth:`read_events` ne seront plus renvoyés. Les événements sont consommés à partir de la file d'attente interne uniquement lorsqu'ils sont récupérés de l'itérateur, donc plusieurs lecteurs itérant en parallèle sur les itérateurs obtenus à partir de :meth:`read_events` auront des résultats imprévisibles.

source: :class:`XMLPullParser` only guarantees that it has seen the ">" character of a starting tag when it emits a "start" event, so the attributes are defined, but the contents of the text and tail attributes are undefined at that point. The same applies to the element children; they may or may not be present.
fr: :class:`XMLPullParser` garantit uniquement qu'il a vu le caractère ``">"`` d'une balise de début lorsqu'il émet un événement ``"start"``, donc les attributs sont définis, mais le contenu des attributs *text* et *tail* n'est pas défini à ce stade. La même chose s'applique aux nœuds enfants de l'élément ; ils peuvent être présents ou non.

source: XML parse error, raised by the various parsing methods in this module when parsing fails. The string representation of an instance of this exception will contain a user-friendly error message. In addition, it will have the following attributes available:
fr: Erreur d'analyse XML, générée par les différentes méthodes d'analyse de ce module lorsque l'analyse échoue. La représentation sous forme de chaîne d'une instance de cette exception contient un message d'erreur convivial. De plus, elle possède les attributs suivants :

source: A numeric error code from the expat parser. See the documentation of :mod:`xml.parsers.expat` for the list of error codes and their meanings.
fr: Code d'erreur numérique de l'analyseur *expat*. Voir la documentation de :mod:`xml.parsers.expat` pour la liste des codes d'erreur et leur signification.

source: A tuple of *line*, *column* numbers, specifying where the error occurred.
fr: Un *n*-uplet de numéros de *ligne* et *colonne* indiquant le lieu d'apparition de l'erreur.

source: Footnotes
fr: Notes

source: The encoding string included in XML output should conform to the appropriate standards. For example, "UTF-8" is valid, but "UTF8" is not. See https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl and https://www.iana.org/assignments/character-sets/character-sets.xhtml.
fr: La chaîne de caractères encodée inclue dans la sortie XML doit être conforme aux standards. Par exemple, ``"UTF-8"`` est valide, mais pas ``"UTF8"``. Voir https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl et https://www.iana.org/assignments/character-sets/character-sets.xhtml.
