Repository: python/python-docs-fr
Catalog: library/xml.po
Languages: fr

source: XML Processing Modules
fr: Modules de traitement XML

source: **Source code:** :source:`Lib/xml/`
fr: **Code source:** :source:`Lib/xml/`

source: Python's interfaces for processing XML are grouped in the ``xml`` package.
fr: Les interfaces de Python de traitement de XML sont regroupées dans le paquet ``xml``.

source: The XML modules are not secure against erroneous or maliciously constructed data. If you need to parse untrusted or unauthenticated data see the :ref:`xml-vulnerabilities` and :ref:`defused-packages` sections.
fr: Les modules XML ne sont pas protégés contre les données mal construites ou malicieuses. Si vous devez parcourir des données douteuses non authentifiées voir les sections :ref:`xml-vulnerabilities` et :ref:`defused-packages`.

source: It is important to note that modules in the :mod:`xml` package require that there be at least one SAX-compliant XML parser available. The Expat parser is included with Python, so the :mod:`xml.parsers.expat` module will always be available.
fr: Il est important de noter que les modules dans le paquet :mod:`xml` nécessitent qu'au moins un analyseur compatible SAX soit disponible. L'analyseur Expat est inclus dans Python, ainsi le module :mod:`xml.parsers.expat` est toujours disponible.

source: The documentation for the :mod:`xml.dom` and :mod:`xml.sax` packages are the definition of the Python bindings for the DOM and SAX interfaces.
fr: La documentation des *bindings* des interfaces DOM et SAX se trouve dans :mod:`xml.dom` et :mod:`xml.sax`.

source: The XML handling submodules are:
fr: Les sous-modules de traitement XML sont :

source: :mod:`xml.etree.ElementTree`: the ElementTree API, a simple and lightweight XML processor
fr: :mod:`xml.etree.ElementTree`: l'API ElementTree, un processeur simple et léger

source: :mod:`xml.dom`: the DOM API definition
fr: :mod:`xml.dom`: la définition de l'API DOM

source: :mod:`xml.dom.minidom`: a minimal DOM implementation
fr: :mod:`xml.dom.minidom`: une implémentation minimale de DOM

source: :mod:`xml.dom.pulldom`: support for building partial DOM trees
fr: :mod:`xml.dom.pulldom`: gestion de la construction partiel des arbres DOM

source: :mod:`xml.sax`: SAX2 base classes and convenience functions
fr: :mod:`xml.sax`: classes de bases SAX2 base et fonctions utilitaires

source: :mod:`xml.parsers.expat`: the Expat parser binding
fr: :mod:`xml.parsers.expat`: le *binding* de l'analyseur Expat

source: XML vulnerabilities
fr: Vulnérabilités XML

source: The XML processing modules are not secure against maliciously constructed data. An attacker can abuse XML features to carry out denial of service attacks, access local files, generate network connections to other machines, or circumvent firewalls.
fr: Les modules de traitement XML ne sont pas sécurisés contre les données construite malicieusement. Un attaquant peut abuser des fonctionnalités XML pour exécuter des attaques par déni de service, accéder des fichiers locaux, générer des connexions réseaux à d'autres machines ou contourner des pare-feux.

source: The following table gives an overview of the known attacks and whether the various modules are vulnerable to them.
fr: Le tableau suivant donne une vue d'ensemble des attaques connues et indique si les différents modules y sont vulnérables.

source: kind
fr: type

source: **Vulnerable**
fr: **Vulnérable**

source: Safe (4)
fr: Sûr (4)

source: Safe (1)
fr: Sûr (1)

source: Safe (2)
fr: Sûr (2)

source: Safe (3)
fr: Sûr (3)

source: `DTD`_ retrieval
fr: Récupération de `DTD`_

source: Safe
fr: Sûr

source: :mod:`xml.etree.ElementTree` doesn't expand external entities and raises a :exc:`ParserError` when an entity occurs.
fr: :mod:`xml.etree.ElementTree` n'étend pas les entités externes et lève une exception :exc:`ParserError` quand une telle entité est rencontrée.

source: :mod:`xml.dom.minidom` doesn't expand external entities and simply returns the unexpanded entity verbatim.
fr: :mod:`xml.dom.minidom` n'étend pas les entités externe et renvoie simplement le verbatim de l'entité non étendu.

source: :mod:`xmlrpclib` doesn't expand external entities and omits them.
fr: :mod:`xmlrpclib` n'étend pas les entités externes et les omet.

source: Since Python 3.7.1, external general entities are no longer processed by default.
fr: Depuis Python 3.7.1, les entités générales externes ne sont plus traitées par défaut depuis Python.

source: The `Billion Laughs`_ attack -- also known as exponential entity expansion -- uses multiple levels of nested entities. Each entity refers to another entity several times, and the final entity definition contains a small string. The exponential expansion results in several gigabytes of text and consumes lots of memory and CPU time.
fr: L'attaque `Billion Laughs`_ -- aussi connue comme *exponential entity expansion* -- utilise de multiples niveaux d'entités imbriquées. Chaque entité se réfère à une autre entité de multiple fois. L'entité finale contiens une chaîne courte. Le résultat de l'expansion exponentielle génère plusieurs gigaoctet de texte et consomme beaucoup de mémoire et de temps processeur.

source: A quadratic blowup attack is similar to a `Billion Laughs`_ attack; it abuses entity expansion, too. Instead of nested entities it repeats one large entity with a couple of thousand chars over and over again. The attack isn't as efficient as the exponential case but it avoids triggering parser countermeasures that forbid deeply-nested entities.
fr: Une attaque *quadratic blowup* est similaire à l'attaque `Billion Laughs`_ ; il s'agit également d'un abus d'extension d'entités. Au lieu d'utiliser des entités imbriquées, cette attaque répète encore et encore une seule entité de plusieurs milliers de caractères. Cette attaque n'est pas aussi efficace que la version exponentielle mais contourne les contre-mesures de l'analyseur qui interdit les entités imbriquées de multiples fois.

source: Entity declarations can contain more than just text for replacement. They can also point to external resources or local files. The XML parser accesses the resource and embeds the content into the XML document.
fr: Les déclarations d'entités peuvent contenir plus que du texte de substitution. Elles peuvent également référencer des ressources externes ou des fichiers locaux. L'analyseur XML accède à ces fichiers et inclut les contenus dans le document XML.

source: Some XML libraries like Python's :mod:`xml.dom.pulldom` retrieve document type definitions from remote or local locations. The feature has similar implications as the external entity expansion issue.
fr: Certaines bibliothèques XML comme :mod:`xml.dom.pulldom` de Python récupère les documents de définitions de types (DTD) depuis des emplacements distants ou locaux. La fonctionnalité a des implications similaires que le problème d'extension d'entités externes.

source: Decompression bombs (aka `ZIP bomb`_) apply to all XML libraries that can parse compressed XML streams such as gzipped HTTP streams or LZMA-compressed files. For an attacker it can reduce the amount of transmitted data by three magnitudes or more.
fr: Des bombes de décompression (ou `ZIP bomb`_) sont valables pour toutes les bibliothèques XML qui peuvent analyser des flux XML compressés comme des flux HTTP *gzip* ou des fichiers compressés *LZMA*. Pour L'attaquant, cela permet de réduire d'une magnitude d'ordre 3 ou plus la quantité de données transmises.

source: The documentation for `defusedxml`_ on PyPI has further information about all known attack vectors with examples and references.
fr: La documentation de `defusedxml`_ sur PyPI contient plus d'informations sur tous les vecteurs d'attaques connus ainsi que des exemples et des références.

source: The :mod:`defusedxml` and :mod:`defusedexpat` Packages
fr: Les paquets :mod:`defusedxml` et :mod:`defusedexpat`

source: `defusedxml`_ is a pure Python package with modified subclasses of all stdlib XML parsers that prevent any potentially malicious operation. Use of this package is recommended for any server code that parses untrusted XML data. The package also ships with example exploits and extended documentation on more XML exploits such as XPath injection.
fr: `defusedxml`_ est un paquet écrit exclusivement en Python avec des sous-classe modifiées de tous les analyseurs de la *stdlib* XML qui empêche toutes opérations potentiellement malicieuses. L'utilisation de ce paquet est recommandé pour tous serveurs qui analyseraient des donnés XML non fiables. Le paquet inclut également des exemples d'attaques et une documentation plus fournie sur plus d'attaques XML comme *XPath injection*.

source: `defusedexpat`_ provides a modified libexpat and a patched :mod:`pyexpat` module that have countermeasures against entity expansion DoS attacks. The :mod:`defusedexpat` module still allows a sane and configurable amount of entity expansions. The modifications may be included in some future release of Python, but will not be included in any bugfix releases of Python because they break backward compatibility.
fr: `defusedexpat`_ fournit une version modifiée de *libexpat* et le module :mod:`pyexpat` modifiée embarquant des contre-mesures contre les attaques *DoS* par *entity expansion*. Le module :mod:`defusedexpat` autorise un nombre configurable et raisonnable d'extension d'entités. Ces modifications pourraient être incluses dans des futures version de Python mais ne seront incluses dans aucune version corrective de Python pour éviter de casser la compatibilité rétrograde.
