Repository: python/python-docs-fr
Catalog: library/xml.sax.handler.po
Languages: fr

source: The Parser will invoke this method once for each entity skipped. Non-validating processors may skip entities if they have not seen the declarations (because, for example, the entity was declared in an external DTD subset). All processors may skip external entities, depending on the values of the ``feature_external_ges`` and the ``feature_external_pes`` properties.
fr: L'analyseur invoque cette méthode une fois pour chaque entité ignorée. Les processeurs non validateurs peuvent ignorer les entités s'ils n'ont pas vu les déclarations (parce que, par exemple, l'entité a été déclarée dans un sous-ensemble *DTD* externe). Tous les processeurs peuvent ignorer les entités externes, en fonction des valeurs des propriétés ``feature_external_ges`` et ``feature_external_pes``.

source: DTDHandler Objects
fr: Objets *DTDHandler*

source: :class:`DTDHandler` instances provide the following methods:
fr: Les instances :class:`DTDHandler` fournissent les méthodes suivantes :

source: Handle a notation declaration event.
fr: Gère un événement de déclaration de notation.

source: Handle an unparsed entity declaration event.
fr: Gère un événement de déclaration d'entité non analysé.

source: EntityResolver Objects
fr: Objets *EntityResolver*

source: Resolve the system identifier of an entity and return either the system identifier to read from as a string, or an InputSource to read from. The default implementation returns *systemId*.
fr: Résout l'identifiant système d'une entité et renvoie soit l'identifiant système à partir duquel lire sous forme de chaîne, soit un *InputSource* à partir duquel lire. L'implémentation par défaut renvoie *systemId*.

source: ErrorHandler Objects
fr: Objets *ErrorHandler*

source: Called when the parser encounters a recoverable error. If this method does not raise an exception, parsing may continue, but further document information should not be expected by the application. Allowing the parser to continue may allow additional errors to be discovered in the input document.
fr: Appelée lorsque l'analyseur rencontre une erreur récupérable. Si cette méthode ne génère pas d'exception, l'analyse peut continuer, mais l'application ne doit pas attendre d'autres informations concernant le document. Autoriser l'analyseur à continuer peut permettre de découvrir des erreurs supplémentaires dans le document d'entrée.

source: Called when the parser encounters an error it cannot recover from; parsing is expected to terminate when this method returns.
fr: Appelée lorsque l'analyseur rencontre une erreur irrécupérable ; l'analyse devrait se terminer au retour de cette méthode.

source: Called when the parser presents minor warning information to the application. Parsing is expected to continue when this method returns, and document information will continue to be passed to the application. Raising an exception in this method will cause parsing to end.
fr: Appelée lorsque l'analyseur présente des informations d'avertissement mineures à l'application. L'analyse devrait se poursuivre lorsque cette méthode termine et les informations du document continueront d'être transmises à l'application. La levée d’une exception dans cette méthode entraîne la fin de l’analyse.

source: LexicalHandler Objects
fr: Objets *LexicalHandler*

source: Optional SAX2 handler for lexical events.
fr: Gestionnaire *SAX2* facultatif pour les événements lexicaux.

source: This handler is used to obtain lexical information about an XML document. Lexical information includes information describing the document encoding used and XML comments embedded in the document, as well as section boundaries for the DTD and for any CDATA sections. The lexical handlers are used in the same manner as content handlers.
fr: Ce gestionnaire est utilisé pour obtenir des informations lexicales relatives à un document XML. Les informations lexicales incluent des informations décrivant le codage du document utilisé et les commentaires XML intégrés dans le document, ainsi que les limites des sections pour la *DTD* et pour toutes les sections *CDATA*. Les gestionnaires lexicaux sont utilisés de la même manière que les gestionnaires de contenu.

source: Set the LexicalHandler of an XMLReader by using the setProperty method with the property identifier ``'http://xml.org/sax/properties/lexical-handler'``.
fr: Définissez le *LexicalHandler* d'un *XMLReader* en utilisant la méthode *setProperty* avec l'identifiant de propriété ``'http://xml.org/sax/properties/lexical-handler'``.

source: Reports a comment anywhere in the document (including the DTD and outside the document element).
fr: Signale un commentaire n'importe où dans le document (y compris la *DTD* et en dehors de l'élément de document).

source: Reports the start of the DTD declarations if the document has an associated DTD.
fr: Signale le début des déclarations *DTD* si le document a une *DTD* associée.

source: Reports the end of DTD declaration.
fr: Signale la fin de la déclaration de la *DTD*.

source: Reports the start of a CDATA marked section.
fr: Signale le début d’une section marquée *CDATA*.

source: The contents of the CDATA marked section will be reported through the characters handler.
fr: Le contenu de la section marquée *CDATA* est signalé via le gestionnaire de données de type caractère.

source: Reports the end of a CDATA marked section.
fr: Signale la fin d’une section marquée *CDATA*.
