Repository: python/python-docs-fr
Catalog: library/xml.dom.po
Languages: fr

source: Insert a new child node before an existing child. It must be the case that *refChild* is a child of this node; if not, :exc:`ValueError` is raised. *newChild* is returned. If *refChild* is ``None``, it inserts *newChild* at the end of the children's list.
fr: Insère un nouveau nœud fils avant un fils existant. Il est impératif que *refChild* soit un fils du nœud, sinon :exc:`ValueError` sera levée. *newChild* est renvoyé. Si *refChild* est ``None``, *newChild* est inséré à la fin de la liste des fils.

source: Remove a child node. *oldChild* must be a child of this node; if not, :exc:`ValueError` is raised. *oldChild* is returned on success. If *oldChild* will not be used further, its :meth:`unlink` method should be called.
fr: Retire un nœud fils. *oldChild* doit être un fils de ce nœud ; sinon :exc:`ValueError` sera levée. En cas de succès, *oldChild* est renvoyé. Si *oldChild* n'est plus utilisé, sa méthode :meth:`unlink` doit être appelée.

source: Replace an existing node with a new node. It must be the case that *oldChild* is a child of this node; if not, :exc:`ValueError` is raised.
fr: Remplace un nœud existant avec un nouveau. *oldChild* doit être un fils de ce nœud ; sinon :exc:`ValueError` sera levée.

source: Join adjacent text nodes so that all stretches of text are stored as single :class:`Text` instances. This simplifies processing text from a DOM tree for many applications.
fr: Jointe les nœuds texte adjacents de manière à ce que tous les segments de texte soient stockés dans une seule instance de :class:`Text`. Ceci simplifie le traitement du texte d'un arbre DOM pour de nombreuses applications.

source: Clone this node. Setting *deep* means to clone all child nodes as well. This returns the clone.
fr: Clone ce nœud. Positionner *deep* signifie que tous les nœuds fils seront également clonés. La méthode renvoi le clone.

source: NodeList Objects
fr: Objet NodeList

source: A :class:`NodeList` represents a sequence of nodes. These objects are used in two ways in the DOM Core recommendation: an :class:`Element` object provides one as its list of child nodes, and the :meth:`getElementsByTagName` and :meth:`getElementsByTagNameNS` methods of :class:`Node` return objects with this interface to represent query results.
fr: :class:`NodeList` représente une séquence de nœuds. Ces objets sont utilisés de deux manières dans la recommandation Dom Core : un objet :class:`Element` fournit en fournis liste des nœud fils et les méthodes :meth:`getElementsByTagName` et :meth:`getElementsByTagNameNS` de :class:`Node` renvoient des objet avec cette interface pour représenter les résultats des requêtes.

source: The DOM Level 2 recommendation defines one method and one attribute for these objects:
fr: La recommandation DOM Level 2 définit un attribut et une méthode pour ces objets :

source: Return the *i*'th item from the sequence, if there is one, or ``None``. The index *i* is not allowed to be less than zero or greater than or equal to the length of the sequence.
fr: Renvoie le *i*ème élément de la séquence s'il existe ou ``None``. L'index *i* ne peut pas être inférieur à 0 ou supérieur ou égale à la longueur de la séquence.

source: The number of nodes in the sequence.
fr: Le nombre d'éléments dans la séquence.

source: In addition, the Python DOM interface requires that some additional support is provided to allow :class:`NodeList` objects to be used as Python sequences. All :class:`NodeList` implementations must include support for :meth:`~object.__len__` and :meth:`~object.__getitem__`; this allows iteration over the :class:`NodeList` in :keyword:`for` statements and proper support for the :func:`len` built-in function.
fr: En plus, l'interface DOM de Python requiert quelques ajouts supplémentaires pour permettre que les objet :class:`NodeList` puissent être utilisés comme des séquences Python. Toutes les implémentations de :class:`NodeList` doivent inclure le support de :meth:`~object.__len__` et de :meth:`~object.__getitem__` ; ceci permet l'itération sur :class:`NodeList` avec l'instruction :keyword:`for` et un support de la fonction native :func:`len`.

source: If a DOM implementation supports modification of the document, the :class:`NodeList` implementation must also support the :meth:`~object.__setitem__` and :meth:`~object.__delitem__` methods.
fr: Si une implémentation de DOM support les modifications du document, l'implémentation de :class:`NodeList` doit également supporter les méthodes :meth:`~object.__setitem__` et :meth:`~object.__delitem__` .

source: DocumentType Objects
fr: Objets DocumnentType

source: Information about the notations and entities declared by a document (including the external subset if the parser uses it and can provide the information) is available from a :class:`DocumentType` object. The :class:`DocumentType` for a document is available from the :class:`Document` object's :attr:`doctype` attribute; if there is no ``DOCTYPE`` declaration for the document, the document's :attr:`doctype` attribute will be set to ``None`` instead of an instance of this interface.
fr: Les objets de type :class:`DocumentType` fournissent des informations sur les notations et les entités déclarées par un document (incluant les données externes si l'analyseur les utilise et peut les fournir). Le :class:`DocumentType` d'un :class:`Document` est accessible via l'attribut :attr:`doctype`. Si le document ne déclare pas de ``DOCTYPE``, l'attribut :attr:`doctype` vaudra ``None`` plutôt qu'une instance de cette interface.

source: :class:`DocumentType` is a specialization of :class:`Node`, and adds the following attributes:
fr: :class:`DocumentType` est une spécialisation de :class:`Node` et ajoute les attributs suivants :

source: The public identifier for the external subset of the document type definition. This will be a string or ``None``.
fr: L'identifiant publique pour un sous ensemble de la définition type de document (*DTD*). Cela sera une chaîne ou ``None``.

source: The system identifier for the external subset of the document type definition. This will be a URI as a string, or ``None``.
fr: L'identifiant système pour un sous ensemble du document de définition type (*DTD*). Cela sera une URI sous la forme d'une chaîne ou ``None``.

source: A string giving the complete internal subset from the document. This does not include the brackets which enclose the subset. If the document has no internal subset, this should be ``None``.
fr: Un chaîne donnant le sous ensemble complet du document. Ceci n'inclut pas les chevrons qui englobe le sous ensemble. Si le document n'a pas de sous ensemble, cela devrait être ``None``.

source: The name of the root element as given in the ``DOCTYPE`` declaration, if present.
fr: Le nom de l'élément racine donné dans la déclaration ``DOCTYPE`` si présente.

source: This is a :class:`NamedNodeMap` giving the definitions of external entities. For entity names defined more than once, only the first definition is provided (others are ignored as required by the XML recommendation). This may be ``None`` if the information is not provided by the parser, or if no entities are defined.
fr: Ceci est un :class:`NamedNodeMap` donnant les définitions des entités externes. Pour les entités définies plusieurs fois seule la première définition est fournie (les suivantes sont ignorées comme requis par la recommandation XML). Ceci peut retourner ``None`` si l'information n'est pas fournie à l'analyseur ou si aucune entités n'est définis.

source: This is a :class:`NamedNodeMap` giving the definitions of notations. For notation names defined more than once, only the first definition is provided (others are ignored as required by the XML recommendation). This may be ``None`` if the information is not provided by the parser, or if no notations are defined.
fr: Ceci est un :class:`NamedNodeMap` donnant la définition des notations. Pour les notations définies plus d'une fois, seule la première est fournie (les suivante sont ignorées comme requis par la recommandation XML). Ceci peut retourner ``None`` si l'information n'est pas fournie à l'analyseur ou si aucune entités n'est définis.

source: Document Objects
fr: Objets Document

source: A :class:`Document` represents an entire XML document, including its constituent elements, attributes, processing instructions, comments etc. Remember that it inherits properties from :class:`Node`.
fr: Un :class:`Document` représente un document XML en son entier, incluant les éléments qui le constitue, les attributs, les *processing instructions*, commentaires, etc. Rappelez vous qu'il hérite des propriété de :class:`Node`.

source: The one and only root element of the document.
fr: Le seul et unique élément racine du document.

source: Create and return a new element node. The element is not inserted into the document when it is created. You need to explicitly insert it with one of the other methods such as :meth:`insertBefore` or :meth:`appendChild`.
fr: Créé et renvoi un nouveau nœud élément. Ce n'est pas inséré dans le document quand il est créé. Vous avez besoin de l'insérer explicitement avec l'une des autres méthodes comme :meth:`insertBefore` ou :meth:`appendChild`.

source: Create and return a new element with a namespace. The *tagName* may have a prefix. The element is not inserted into the document when it is created. You need to explicitly insert it with one of the other methods such as :meth:`insertBefore` or :meth:`appendChild`.
fr: Créé et renvoi un nouvel élément avec un *namespace*. Le *tagName* peut avoir un préfixe. L'élément ne sera pas insérer dans le document quand il est créé. Vous avez besoin de l'insérer explicitement avec l'une des autres méthodes comme :meth:`insertBefore` ou :meth:`appendChild`.

source: Create and return a text node containing the data passed as a parameter. As with the other creation methods, this one does not insert the node into the tree.
fr: Créé et renvoi un nœud texte contenant les *data* passées en paramètre. Comme pour les autres méthodes de création, la méthode n'insère pas le nœud dans l'arbre.

source: Create and return a comment node containing the data passed as a parameter. As with the other creation methods, this one does not insert the node into the tree.
fr: Créé et renvoi un nœud commentaire contenant les *data* passé en commentaire. Comme pour les autres méthodes de création, la méthode n'insère pas le nœud dans l'arbre.

source: Create and return a processing instruction node containing the *target* and *data* passed as parameters. As with the other creation methods, this one does not insert the node into the tree.
fr: Créé et retourne un nœud *processing instruction* contenant les *target* et *data* passés en paramètres. Comme pour les autres méthodes de création, la méthode n'insère pas le nœud dans l'arbre.

source: Create and return an attribute node. This method does not associate the attribute node with any particular element. You must use :meth:`setAttributeNode` on the appropriate :class:`Element` object to use the newly created attribute instance.
fr: Créé et renvoi un nœud attribut. Cette méthode n'associe le nœud attribut aucun nœud en particulier. Vous devez utiliser la méthode :meth:`setAttributeNode` sur un objet :class:`Element` approprié pour utiliser une instance d'attribut nouvellement créé.

source: Create and return an attribute node with a namespace. The *tagName* may have a prefix. This method does not associate the attribute node with any particular element. You must use :meth:`setAttributeNode` on the appropriate :class:`Element` object to use the newly created attribute instance.
fr: Créé et renvoi un nœud attribut avec un *namespace*. Le *tagName* peut avoir un préfixe. Cette méthode n'associe le nœud attribut à aucun nœud en particulier. Vous devez utiliser la méthode :meth:`setAttributeNode` sur un objet :class:`Element` approprié pour utiliser une instance d'attribut nouvellement créé.

source: Search for all descendants (direct children, children's children, etc.) with a particular element type name.
fr: Cherche tout les descendants (fils directs, fils de fils, etc.) avec un nom de balise particulier.

source: Search for all descendants (direct children, children's children, etc.) with a particular namespace URI and localname. The localname is the part of the namespace after the prefix.
fr: Cherche tous les descendants (fils directs, fils de fils, etc.) avec un *namespace URI* particulier et un *localName*. Le *localName* fait parti du *namespace* après le préfixe.

source: Element Objects
fr: Objets Elements

source: :class:`Element` is a subclass of :class:`Node`, so inherits all the attributes of that class.
fr: :class:`Element` est une une sous classe de :class:`Node` et donc hérite de tout les éléments de cette classe.

source: The element type name. In a namespace-using document it may have colons in it. The value is a string.
fr: Le nom de l'élément type. Dans un document utilisant des *namespace*, il pourrait y avoir des *:* dedans. La valeur est une chaîne.

source: Same as equivalent method in the :class:`Document` class.
fr: Identique à la méthode équivalente de la classe :class:`Document`.

source: Return ``True`` if the element has an attribute named by *name*.
fr: Renvoie ``True`` si l'élément a un attribut nommé *name*.

source: Return ``True`` if the element has an attribute named by *namespaceURI* and *localName*.
fr: Renvoie ``True`` si l'élément a un attribut nommé *localName* dans l'espace de noms *namespaceURI*.

source: Return the value of the attribute named by *name* as a string. If no such attribute exists, an empty string is returned, as if the attribute had no value.
fr: Retourne la valeur de l'attribut nommé par *name* comme une chaîne. Si un tel attribue n'existe pas, une chaîne vide est retournée comme si l'attribut n'avait aucune valeur.

source: Return the :class:`Attr` node for the attribute named by *attrname*.
fr: Retourne le nœud :class:`Attr` pour l'attribut nommé par *attrname*.

source: Return the value of the attribute named by *namespaceURI* and *localName* as a string. If no such attribute exists, an empty string is returned, as if the attribute had no value.
fr: Renvoi la valeur de l'attribut nommé par *namespaceURI* et *localName* comme une chaîne. Si un tel attribue n'existe pas, une chaîne vide est retournée comme si l'attribut n'avait aucune valeur.

source: Return an attribute value as a node, given a *namespaceURI* and *localName*.
fr: Renvoi la valeur de l'attribue comme un nœud étant donné *namespaceURI* et *localName*.

source: Remove an attribute by name. If there is no matching attribute, a :exc:`NotFoundErr` is raised.
fr: Retire un attribut nommé *name*. S'il n'y a aucun attribut correspondant une :exc:`NotFoundErr` est levée.

source: Remove and return *oldAttr* from the attribute list, if present. If *oldAttr* is not present, :exc:`NotFoundErr` is raised.
fr: Supprime et renvoi *oldAttr* de la liste des attributs si présent. Si *oldAttr* n'est pas présent, :exc:`NotFoundErr` est levée.

source: Remove an attribute by name. Note that it uses a localName, not a qname. No exception is raised if there is no matching attribute.
fr: Retire un attribut selon son nom. Notez qu'il utilise un *localName* et nom un *qname*. Aucune exception n'est levée s'il n'y a pas d'attribut correspondant.

source: Set an attribute value from a string.
fr: Assigne la valeur à un attribut pour la chaîne.

source: Add a new attribute node to the element, replacing an existing attribute if necessary if the :attr:`name` attribute matches. If a replacement occurs, the old attribute node will be returned. If *newAttr* is already in use, :exc:`InuseAttributeErr` will be raised.
fr: Ajoute un nouveau nœud attribut à l'élément, remplaçant un attribut existant si nécessaire si :attr:`name` corresponds à un attribut. Si l'attribut en remplace un précédent, l'ancien attribut sera retourné. Si *newAttr* est déjà utilisé, :exc:`InuseAttributeErr` sera levée.

source: Add a new attribute node to the element, replacing an existing attribute if necessary if the :attr:`namespaceURI` and :attr:`localName` attributes match. If a replacement occurs, the old attribute node will be returned. If *newAttr* is already in use, :exc:`InuseAttributeErr` will be raised.
fr: Ajoute un nouveau nœud attribut, remplaçant un attribut existant si :attr:`namespaceURI` et :attr:`localName` corresponds à un attribut. S'il y a remplacement, l'ancien nœud sera renvoyé. Si *newAttr* est déjà utilisé, :exc:`InuseAttributeErr` sera levée.

source: Set an attribute value from a string, given a *namespaceURI* and a *qname*. Note that a qname is the whole attribute name. This is different than above.
fr: Assigne la valeur d'un attribut depuis une chaîne étant donnée un *namespaceURI* et un *qname*. Notez que *qname* est le nom de l'attribut en entier. Ceci est différent d'au dessus.

source: Attr Objects
fr: Objets Attr

source: :class:`Attr` inherits from :class:`Node`, so inherits all its attributes.
fr: :class:`Attr` hérite :class:`Node` et donc hérite de tout ces attributs.

source: The attribute name. In a namespace-using document it may include a colon.
fr: Le nom de l'attribut. Dans un document utilisant des *namespaces*, il pourra inclure un *:*.

source: The part of the name following the colon if there is one, else the entire name. This is a read-only attribute.
fr: La partie du nom suivant le *:* s'il y en a un ou le nom entier sinon. Ceci est un attribut en lecture seule.

source: The part of the name preceding the colon if there is one, else the empty string.
fr: La partie du nom précédent le *:* s'il y en a un ou une chaîne vide.

source: The text value of the attribute. This is a synonym for the :attr:`nodeValue` attribute.
fr: La valeur texte de l'attribut. C'est un synonyme de l'attribut :attr:`nodeValue`.

source: NamedNodeMap Objects
fr: Objets NameNodeMap

source: :class:`NamedNodeMap` does *not* inherit from :class:`Node`.
fr: :class:`NamedNodeMap` *n'hérite pas* de :class:`Node`.

source: The length of the attribute list.
fr: La longueur de la liste d'attributs.

source: Return an attribute with a particular index. The order you get the attributes in is arbitrary but will be consistent for the life of a DOM. Each item is an attribute node. Get its value with the :attr:`value` attribute.
fr: Renvoi un attribut à un index particulier. L'ordre des attribut est arbitraire mais sera constant durant toute la vie du DOM. Chacun des item sera un nœud attribut. Obtenez sa valeur avec :attr:`value` de l'attribut.

source: There are also experimental methods that give this class more mapping behavior. You can use them or you can use the standardized :meth:`getAttribute\*` family of methods on the :class:`Element` objects.
fr: Il y existe également des méthodes expérimentales qui donne à cette classe un comportement plus *mappable*. Vous pouvez les utiliser ou utiliser la famille de méthode standardisés :meth:`getAttribute\*` des objets :class:`Element`.

source: Comment Objects
fr: Objets Comment

source: :class:`Comment` represents a comment in the XML document. It is a subclass of :class:`Node`, but cannot have child nodes.
fr: :class:`Comment` représente un commentaire dans le document XML. C'est une sous classe :class:`Node` mais n'a aucune nœuds fils.

source: The content of the comment as a string. The attribute contains all characters between the leading ``<!-``\ ``-`` and trailing ``-``\ ``->``, but does not include them.
fr: Le contenu du commentaire comme une chaîne. L'attribut contient tous les caractères entre ``<!-``\ ``-`` et ``-``\ ``->`` mais ne les inclues pas.

source: Text and CDATASection Objects
fr: Objets Text et CDATASection

source: The :class:`Text` interface represents text in the XML document. If the parser and DOM implementation support the DOM's XML extension, portions of the text enclosed in CDATA marked sections are stored in :class:`CDATASection` objects. These two interfaces are identical, but provide different values for the :attr:`nodeType` attribute.
fr: L'interface :class:`Text` représente le texte dans un document XML. Si l'analyseur et l'implémentation DOM supporte les extensions XML du DOM, les portion de texte encapsulées dans des section marquées CDATA seront stockées dans des objets :class:`CDATASection`. Ces deux interfaces sont identiques mais fournissent des valeurs différentes pour l'attribut :attr:`nodeType`.

source: These interfaces extend the :class:`Node` interface. They cannot have child nodes.
fr: Ces interfaces étendent l'interface :class:`Node`. Elles ne peuvent pas avoir de nœuds fils.

source: The content of the text node as a string.
fr: Le contenu du nœud texte comme une chaîne.

source: The use of a :class:`CDATASection` node does not indicate that the node represents a complete CDATA marked section, only that the content of the node was part of a CDATA section. A single CDATA section may be represented by more than one node in the document tree. There is no way to determine whether two adjacent :class:`CDATASection` nodes represent different CDATA marked sections.
fr: L'utilisation d'un nœud :class:`CDATASection` n'indique pas que le nœud représente une section complète marquée CDATA, seulement que le contenu du nœud est le contenu d'une section CDATA. Une seule section CDATA peut représenter plus d'un nœud dans l'arbre du document. Il n'y a aucun moyen de déterminer si deux nœuds :class:`CDATASection` adjacents représentent différentes sections CDATA.

source: ProcessingInstruction Objects
fr: Objets ProcessingInstruction

source: Represents a processing instruction in the XML document; this inherits from the :class:`Node` interface and cannot have child nodes.
fr: Représente une *processing instruction* dans un document XML. Hérite de l'interface :class:`Node` et ne peut avoir aucun nœud fils.

source: The content of the processing instruction up to the first whitespace character. This is a read-only attribute.
fr: Le contenu de la *processing instruction* jusqu'au premier caractère blanc. Cet attribut est en lecture seule.

source: The content of the processing instruction following the first whitespace character.
fr: Le contenu de la *processing instruction* après le premier caractère blanc.

source: The DOM Level 2 recommendation defines a single exception, :exc:`DOMException`, and a number of constants that allow applications to determine what sort of error occurred. :exc:`DOMException` instances carry a :attr:`code` attribute that provides the appropriate value for the specific exception.
fr: La recommandation *DOM Level 2* définie une seule exception :exc:`DOMException` et un nombre de constantes qui permettent aux applications à déterminer quelle type d'erreur s'est produit. Les instances de :exc:`DOMException` ont un attribut :attr:`code` qui fourni une valeur approprié pour une exception spécifique.

source: The Python DOM interface provides the constants, but also expands the set of exceptions so that a specific exception exists for each of the exception codes defined by the DOM. The implementations must raise the appropriate specific exception, each of which carries the appropriate value for the :attr:`code` attribute.
fr: L'interface DOM de Python fournit des constant mais également étends un ensemble d'exception pour qu'il existe une exception spécifique pour chaque code d'exception défini par le DOM. L'implémentation doit lever l'exception spécifique appropriée. Chacune ayant la valeur appropriée pour l'attribut :attr:`code`.

source: Base exception class used for all specific DOM exceptions. This exception class cannot be directly instantiated.
fr: Exception de base utilisée pour toutes les exceptions spécifiques du DOM. Cette classe ne peut pas être instanciée directement.
