Repository: python/python-docs-fr
Catalog: library/xml.dom.po
Languages: fr

source: :mod:`xml.dom` --- The Document Object Model API
fr: :mod:`xml.dom` — L'API Document Object Model

source: **Source code:** :source:`Lib/xml/dom/__init__.py`
fr: **Code source:** :source:`Lib/xml/dom/__init__.py`

source: The Document Object Model, or "DOM," is a cross-language API from the World Wide Web Consortium (W3C) for accessing and modifying XML documents. A DOM implementation presents an XML document as a tree structure, or allows client code to build such a structure from scratch. It then gives access to the structure through a set of objects which provided well-known interfaces.
fr: Le Document Object Model, ou "DOM," est une API inter-langage du World Wide Web Consortium (*W3C*) pour accéder et modifier les documents XML. Une implémentation DOM présente le document XML comme un arbre ou autorise le code client à construire une telle structure depuis zéro. Il permet alors d'accéder à la structure à l'aide d'un ensemble d'objet qui fournissent des interfaces bien connues.

source: The DOM is extremely useful for random-access applications. SAX only allows you a view of one bit of the document at a time. If you are looking at one SAX element, you have no access to another. If you are looking at a text node, you have no access to a containing element. When you write a SAX application, you need to keep track of your program's position in the document somewhere in your own code. SAX does not do it for you. Also, if you need to look ahead in the XML document, you are just out of luck.
fr: Le DOM est extrêmement utile pour les applications à accès aléatoire. SAX ne vous permet de visualiser qu'un seul morceau du document à la fois. Si vous regardez un élément SAX, vous n'avez pas accès à un autre. Si vous regardez un nœud de texte, vous n'avez pas accès à un élément parent. Lorsque vous écrivez une application SAX, vous devez suivre la position de votre programme dans le document quelque part dans votre propre code. SAX ne le fait pas pour vous. De plus, si vous devez examiner un nœud plus lus loin dans le document XML, vous n'avez pas de chance.

source: Some applications are simply impossible in an event driven model with no access to a tree. Of course you could build some sort of tree yourself in SAX events, but the DOM allows you to avoid writing that code. The DOM is a standard tree representation for XML data.
fr: Il est tout simplement impossible d'implémenter certains algorithmes avec un modèle évènementiel, sans un accès à un arbre. Bien sûr, vous pourriez construire vous même un arbre à partir des événements SAX mais DOM vous permet d'éviter d'écrire ce code. Le DOM est représentation standard en arbre pour des données XML.

source: The Document Object Model is being defined by the W3C in stages, or "levels" in their terminology. The Python mapping of the API is substantially based on the DOM Level 2 recommendation.
fr: Le DOM (Document Object Model) est défini par le *W3C* en étapes ou *"levels"* (niveaux) selon leur terminologie. Le couplage de l'API de Python est essentiellement basée sur la recommandation DOM Level 2.

source: DOM applications typically start by parsing some XML into a DOM. How this is accomplished is not covered at all by DOM Level 1, and Level 2 provides only limited improvements: There is a :class:`DOMImplementation` object class which provides access to :class:`Document` creation methods, but no way to access an XML reader/parser/Document builder in an implementation-independent way. There is also no well-defined way to access these methods without an existing :class:`Document` object. In Python, each DOM implementation will provide a function :func:`getDOMImplementation`. DOM Level 3 adds a Load/Store specification, which defines an interface to the reader, but this is not yet available in the Python standard library.
fr: Typiquement, les applications DOM commencent par analyser du XML dans du DOM. Comment cela doit être exposé n'est absolument pas décrit par DOM Level 1 et Level 2 ne fournit que des améliorations limités. Il existe une classe :class:`DOMImplementation` qui fournit un accès à des méthodes de création de :class:`Document` mais il n'y a pas de moyen d'accéder à un lecteur/analyseur/constructeur de *document* de façon indépendante de l'implémentation. Il n'est pas également très bien définis comment accéder à ces méthodes sans un objet :class:`Document`. En Python, chaque implémentation fournira une fonction :func:`getDOMImplementation` . DOM Level 3 ajoute une spécification *Load/Store* (charge/stocke) qui définie une interface pour le lecteur mais qui n'est pas disponible dans la bibliothèque standard de Python.

source: Once you have a DOM document object, you can access the parts of your XML document through its properties and methods. These properties are defined in the DOM specification; this portion of the reference manual describes the interpretation of the specification in Python.
fr: Une fois que vous avez un objet document DOM, vous pouvez accéder aux parties de votre document XML à travers ses méthodes et propriétés. Ces propriétés sont définis dans les spécifications DOM ; cette portion du manuel de références décrit l'interprétation des ces spécifications en Python.

source: The specification provided by the W3C defines the DOM API for Java, ECMAScript, and OMG IDL. The Python mapping defined here is based in large part on the IDL version of the specification, but strict compliance is not required (though implementations are free to support the strict mapping from IDL). See section :ref:`dom-conformance` for a detailed discussion of mapping requirements.
fr: Les spécifications fournies par le *W3C* définissent les API DOM pour Java, ECMAScript, et OMG IDL. Les correspondances de Python définies ici sont basées pour une grande part sur la version IDL de la spécification mais une conformité stricte n'est pas requise (bien que ces implémentations soient libre d'implémenter le support strict des correspondances de IDL). Voir la section :ref:`dom-conformance` pour une discussion détaillée des pré-requis des correspondances.

source: The W3C recommendation upon which the Python DOM API is based.
fr: La recommandation *W3C* sur laquelle l'API DOM de Python est basée.

source: `Document Object Model (DOM) Level 1 Specification <https://www.w3.org/TR/REC-DOM-Level-1/>`_
fr: `Spécification Level 1 Document Object Model (DOM) <https://www.w3.org/TR/REC-DOM-Level-1/>`_

source: The W3C recommendation for the DOM supported by :mod:`xml.dom.minidom`.
fr: La recommandation du *W3C* pour le DOM supporté par :mod:`xml.dom.minidom`.

source: This specifies the mapping from OMG IDL to Python.
fr: Ceci spécifies les correspondances depuis OMG IDL vers Python.

source: Module Contents
fr: Contenu du module

source: The :mod:`xml.dom` contains the following functions:
fr: Le :mod:`xml.dom` contient les fonctions suivantes :

source: Register the *factory* function with the name *name*. The factory function should return an object which implements the :class:`DOMImplementation` interface. The factory function can return the same object every time, or a new one for each call, as appropriate for the specific implementation (e.g. if that implementation supports some customization).
fr: Enregistre la fonction *factory* avec le nom *name*. La fonction *factory* doit renvoyer un objet qui implémente l'interface de :class:`DOMImplementation`. La fonction *factory* peut renvoyer le même objet à chaque fois ou un nouveau à chaque appel en accord avec les spécificités de l'implémentation (Par exemple si l'implémentation supporte certaines personnalisations).

source: Return a suitable DOM implementation. The *name* is either well-known, the module name of a DOM implementation, or ``None``. If it is not ``None``, imports the corresponding module and returns a :class:`DOMImplementation` object if the import succeeds. If no name is given, and if the environment variable :envvar:`PYTHON_DOM` is set, this variable is used to find the implementation.
fr: Renvoie une implémentation DOM appropriée. Le *name* est soit connu, soit le nom du module d'une implémentation DOM, soit ``None``. Si ce n'est pas ``None``, le module correspondant est importé et retourne un objet :class:`DOMImplementation` si l'importation réussit. Si Aucun *name* n'est donné et que la variable d'environnement :envvar:`PYTHON_DOM` est positionnée, cette variable est utilisée pour trouver l'implémentation.

source: If name is not given, this examines the available implementations to find one with the required feature set. If no implementation can be found, raise an :exc:`ImportError`. The features list must be a sequence of ``(feature, version)`` pairs which are passed to the :meth:`hasFeature` method on available :class:`DOMImplementation` objects.
fr: Si *name* n'est pas donné, la fonction examine les implémentations disponibles pour en trouver une avec l'ensemble des fonctionnalités requises. Si aucune implémentation n'est trouvée, une :exc:`ImportError` est levée. La liste de fonctionnalité doit être une séquence de paires ``(feature, version)`` qui est passée à la méthode :meth:`hasFeature` disponible dans les objets :class:`DOMImplementation`.

source: Some convenience constants are also provided:
fr: Quelques constantes pratiques sont également fournies :

source: The value used to indicate that no namespace is associated with a node in the DOM. This is typically found as the :attr:`namespaceURI` of a node, or used as the *namespaceURI* parameter to a namespaces-specific method.
fr: La valeur utilisée pour indiquer qu'aucun espace de noms n'est associé à un nœud dans le DOM. Typiquement, ceci est trouvé comme :attr:`namespaceURI` dans un nœud ou utilisé comme le paramètre *namespaceURI* dans une méthode spécifique aux espaces de noms.

source: The namespace URI associated with the reserved prefix ``xml``, as defined by `Namespaces in XML <https://www.w3.org/TR/REC-xml-names/>`_ (section 4).
fr: L'URI de l'espace de noms associé avec le préfixe réservé ``xml`` comme défini par `Namespaces in XML <https://www.w3.org/TR/REC-xml-names/>`_ (section 4).

source: The namespace URI for namespace declarations, as defined by `Document Object Model (DOM) Level 2 Core Specification <https://www.w3.org/TR/DOM-Level-2-Core/core.html>`_ (section 1.1.8).
fr: L'URI de l'espace de noms pour la déclaration des espaces de noms, tel que défini par `Document Object Model (DOM) Level 2 Core Specification <https://www.w3.org/TR/DOM-Level-2-Core/core.html>`_ (section 1.1.8).

source: The URI of the XHTML namespace as defined by `XHTML 1.0: The Extensible HyperText Markup Language <https://www.w3.org/TR/xhtml1/>`_ (section 3.1.1).
fr: L'URI de l'espace de noms XHTML tel que défini par `XHTML 1.0: The Extensible HyperText Markup Language <https://www.w3.org/TR/xhtml1/>`_ (section 3.1.1).

source: In addition, :mod:`xml.dom` contains a base :class:`Node` class and the DOM exception classes. The :class:`Node` class provided by this module does not implement any of the methods or attributes defined by the DOM specification; concrete DOM implementations must provide those. The :class:`Node` class provided as part of this module does provide the constants used for the :attr:`nodeType` attribute on concrete :class:`Node` objects; they are located within the class rather than at the module level to conform with the DOM specifications.
fr: Par ailleurs, :mod:`xml.dom` contient une classe de base :class:`Node` et les exceptions de DOM. La classe :class:`Node` fournie par ce module n'implémente aucune des méthodes ou des attributs définis par les spécifications DOM ; les implémentations concrètes des DOM doivent fournir les informations suivantes. La classe :class:`Node` fournie part ce modules fournit les constantes utilisées pour l'attribut :attr:`nodeType` pour des objets concrets :class:`Node` ; ils sont situés dans les classes plutôt qu'au niveau du module en accord avec les spécifications DOM.

source: Objects in the DOM
fr: Objets dans le DOM

source: The definitive documentation for the DOM is the DOM specification from the W3C.
fr: La documentation finale pour le DOM est la spécification DOM du *W3C*.

source: Note that DOM attributes may also be manipulated as nodes instead of as simple strings. It is fairly rare that you must do this, however, so this usage is not yet documented.
fr: Notez que les attributs DOM peuvent également être manipulés comme des nœuds au lieu de simples chaînes. Il est relativement rare que vous ayez besoin de faire cela, cependant, cet usage n'est pas encore documenté.

source: Purpose
fr: Objectif

source: Interface to the underlying implementation.
fr: Interface de l'implémentation sous-jacente.

source: Base interface for most objects in a document.
fr: Interface de base pour la majorité des objets dans un document.

source: Interface for a sequence of nodes.
fr: Interface pour une séquence de nœuds.

source: Information about the declarations needed to process a document.
fr: Informations sur les déclarations nécessaires au traitement d'un document.

source: Object which represents an entire document.
fr: Objet représentant un document entier.

source: Element nodes in the document hierarchy.
fr: Nœuds éléments dans la hiérarchie d'un document.

source: Attribute value nodes on element nodes.
fr: Valeur des nœuds attributs sur dans des nœuds éléments.

source: Representation of comments in the source document.
fr: Représentation des commentaires dans le fichier source du document.

source: Nodes containing textual content from the document.
fr: Nœud contenant un contenu texte du document.

source: Processing instruction representation.
fr: Représentation des *Processing Instructions*.

source: An additional section describes the exceptions defined for working with the DOM in Python.
fr: Une Section additionnelle décrit les exceptions définis pour travailler avec le DOM en Python.

source: DOMImplementation Objects
fr: Objets DOMImplementation

source: The :class:`DOMImplementation` interface provides a way for applications to determine the availability of particular features in the DOM they are using. DOM Level 2 added the ability to create new :class:`Document` and :class:`DocumentType` objects using the :class:`DOMImplementation` as well.
fr: L'interface :class:`DOMImplementation` fournit un moyen pour les applications de déterminer la disponibilité de fonctionnalités particulières dans le DOM qu'elles utilisent. *DOM Level 2* ajoute la capacité de créer des nouveaux objets :class:`Document` et :class:`DocumentType` utilisant également :class:`DOMImplementation`.

source: Return ``True`` if the feature identified by the pair of strings *feature* and *version* is implemented.
fr: Renvoie ``True`` si la fonctionnalité identifiée par une paire de chaîne *feature* et *version* est implémentée.

source: Return a new :class:`Document` object (the root of the DOM), with a child :class:`Element` object having the given *namespaceUri* and *qualifiedName*. The *doctype* must be a :class:`DocumentType` object created by :meth:`createDocumentType`, or ``None``. In the Python DOM API, the first two arguments can also be ``None`` in order to indicate that no :class:`Element` child is to be created.
fr: Renvoie un nouvel objet :class:`Document` (la racine du DOM), avec un objet fils :class:`Element` ayant les *namespaceUri* et *qualifiedName* passés en paramètre. Le *doctype* doit être un objet :class:`DocumentType` créé par :meth:`createDocumentType` ou ``None``. Dans l'API DOM de Python, les deux premiers arguments peuvent également être à ``None`` de manière à indiquer qu'aucun enfant :class:`Element` ne soit crée.

source: Return a new :class:`DocumentType` object that encapsulates the given *qualifiedName*, *publicId*, and *systemId* strings, representing the information contained in an XML document type declaration.
fr: Renvoie un nouvel objet :class:`DocumentType` qui encapsule les chaînes *qualifiedName*, *publicId*, et *systemId* passées en paramètre représentant les informations contenues dans dans la déclaration du document XML.

source: Node Objects
fr: Objets nœuds

source: All of the components of an XML document are subclasses of :class:`Node`.
fr: Tous les composants d'un document XML sont des sous-classes de :class:`Node`.

source: An integer representing the node type. Symbolic constants for the types are on the :class:`Node` object: :const:`ELEMENT_NODE`, :const:`ATTRIBUTE_NODE`, :const:`TEXT_NODE`, :const:`CDATA_SECTION_NODE`, :const:`ENTITY_NODE`, :const:`PROCESSING_INSTRUCTION_NODE`, :const:`COMMENT_NODE`, :const:`DOCUMENT_NODE`, :const:`DOCUMENT_TYPE_NODE`, :const:`NOTATION_NODE`. This is a read-only attribute.
fr: Un entier représentant le type de nœud. Pour l'objet :class:`Node`, les constantes symboliques pour les types sont :const:`ELEMENT_NODE`, :const:`ATTRIBUTE_NODE`, :const:`TEXT_NODE`, :const:`CDATA_SECTION_NODE`, :const:`ENTITY_NODE`, :const:`PROCESSING_INSTRUCTION_NODE`, :const:`COMMENT_NODE`, :const:`DOCUMENT_NODE`, :const:`DOCUMENT_TYPE_NODE`, :const:`NOTATION_NODE`. Ceci est un attribut en lecture seule.

source: The parent of the current node, or ``None`` for the document node. The value is always a :class:`Node` object or ``None``. For :class:`Element` nodes, this will be the parent element, except for the root element, in which case it will be the :class:`Document` object. For :class:`Attr` nodes, this is always ``None``. This is a read-only attribute.
fr: Le parent du nœud courant ou ``None`` dans le cas du nœud document. La valeur est toujours un objet :class:`Node` ou ``None``. Pour les nœuds :class:`Element`, ce sera le parent de l'élément sauf si l'élément est la racine, dans ce cas ce sera l'objet :class:`Document`. Pour les nœuds :class:`Attr`, cela sera toujours ``None``. Ceci est un attribut en lecture seule.

source: A :class:`NamedNodeMap` of attribute objects. Only elements have actual values for this; others provide ``None`` for this attribute. This is a read-only attribute.
fr: Un objet :class:`NamedNodeMap` d'objet attributs. Seulement les éléments ayant des valeurs seront listés, les autres renverront ``None`` pour cet attribut. Cet attribut est en lecture seule.

source: The node that immediately precedes this one with the same parent. For instance the element with an end-tag that comes just before the *self* element's start-tag. Of course, XML documents are made up of more than just elements so the previous sibling could be text, a comment, or something else. If this node is the first child of the parent, this attribute will be ``None``. This is a read-only attribute.
fr: Le nœud avec le même parent qui précède immédiatement le nœud courant. Par exemple, l'élément avec la balise fermente qui est juste avant la balise ouvrante de l'élément *self*. Naturellement, les documents XML sont fait de plus que juste des éléments ; donc le *previous sibling* peut être du texte, un commentaire ou autre chose. Si le nœud courant est le premier fils du parent, cet attribut vaudra ``None``. Cet attribut est en lecture seule.

source: The node that immediately follows this one with the same parent. See also :attr:`previousSibling`. If this is the last child of the parent, this attribute will be ``None``. This is a read-only attribute.
fr: Le nœud qui suit immédiatement le nœud courant dans le même parent. Voir également :attr:`previousSibling`. Si ce nœud est le dernier de son parent, alors l'attribut sera ``None``. Cet attribut est en lecture seule.

source: A list of nodes contained within this node. This is a read-only attribute.
fr: Une liste de nœuds contenu dans le nœud courant. Cet attribut est en lecture seule.

source: The first child of the node, if there are any, or ``None``. This is a read-only attribute.
fr: S'il y a des fils, premier fils du nœud courant, sinon ``None``. Cet attribut est en lecture seule.

source: The last child of the node, if there are any, or ``None``. This is a read-only attribute.
fr: S'il y a des fils, le dernier nœud fils du nœud courant. Sinon ``None``. Cet attribut est en lecture seule.

source: The part of the :attr:`tagName` following the colon if there is one, else the entire :attr:`tagName`. The value is a string.
fr: S'il y a un *:*, contient la partie suivante de :attr:`tagName` ce *:* sinon la valeur complète de :attr:`tagName`. Cette valeur est une chaîne.

source: The part of the :attr:`tagName` preceding the colon if there is one, else the empty string. The value is a string, or ``None``.
fr: La partie de :attr:`tagName` précédent le *:* s'il y en a un. sinon une chaîne vide. La valeur est une chaîne ou ``None``.

source: The namespace associated with the element name. This will be a string or ``None``. This is a read-only attribute.
fr: L'espace de noms associé (*namespace* en anglais) au nom de l'élément. Cette valeur est une chaîne ou ``None``. Cet attribut est en lecture seule.

source: This has a different meaning for each node type; see the DOM specification for details. You can always get the information you would get here from another property such as the :attr:`tagName` property for elements or the :attr:`name` property for attributes. For all node types, the value of this attribute will be either a string or ``None``. This is a read-only attribute.
fr: L'attribut a un sens différent pour chaque type de nœud ; se reporter à la spécification DOM pour les détails. Vous obtiendrez toujours l'information que vous obtiendrez à l'aide d'une autre propriété comme :attr:`tagName` pour les éléments ou :attr:`name` pour les attributs. Pour tous les types de nœuds, la valeur sera soit une chaîne soit ``None``. Cet attribut est en lecture seule.

source: This has a different meaning for each node type; see the DOM specification for details. The situation is similar to that with :attr:`nodeName`. The value is a string or ``None``.
fr: L'attribut a un sens différent pour chaque type de nœud ; se reporter à la spécification DOM pour les détails. La situation est similaire à :attr:`nodeName`. La valeur est une chaîne ou ``None``.

source: Return ``True`` if the node has any attributes.
fr: Renvoie ``True`` si le nœud a des attributs.

source: Return ``True`` if the node has any child nodes.
fr: Renvoie ``True`` si le nœud a des nœuds fils.

source: Return ``True`` if *other* refers to the same node as this node. This is especially useful for DOM implementations which use any sort of proxy architecture (because more than one object can refer to the same node).
fr: Renvoie ``True`` si *other* fait référence au même nœud que le nœud courant. Ceci est particulièrement pratique pour une implémentation de DOM qui utilise un ou des mandataires dans son architecture (car plus d'un objet peut se référer au même nœud).

source: This is based on a proposed DOM Level 3 API which is still in the "working draft" stage, but this particular interface appears uncontroversial. Changes from the W3C will not necessarily affect this method in the Python DOM interface (though any new W3C API for this would also be supported).
fr: Ceci est basé sur l'API proposé par * DOM Level 3* qui est toujours à l'étape "*working draft*" mais cette interface particulière ne parait pas controversée. Les changement du *W3C* n'affecteront pas nécessairement cette méthode dans l'interface DOM de Python. (bien que toute nouvelle API *W3C* à cet effet soit également supportée).

source: Add a new child node to this node at the end of the list of children, returning *newChild*. If the node was already in the tree, it is removed first.
fr: Ajoute un nouveau nœud fils à ce nœud à la fin de la liste des fils renvoyant *newChild*. Si ce nœud est déjà dans l'arbre, il sera d'abord retiré.
