Repository: python/python-docs-fr
Catalog: library/xml.etree.elementtree.po
Languages: fr

source: Comment element factory. This factory function creates a special element that will be serialized as an XML comment by the standard serializer. The comment string can be either a bytestring or a Unicode string. *text* is a string containing the comment string. Returns an element instance representing a comment.
fr: Fabrique d’éléments de commentaire. Cette fonction crée un élément spécial qui sera sérialisé sous forme de commentaire XML par le sérialiseur standard. La chaîne de commentaire peut être une chaîne d'octets ou une chaîne Unicode. *text* est une chaîne contenant la chaîne de commentaire. Renvoie une instance d'élément représentant un commentaire.

source: Note that :class:`XMLParser` skips over comments in the input instead of creating comment objects for them. An :class:`ElementTree` will only contain comment nodes if they have been inserted into to the tree using one of the :class:`Element` methods.
fr: Notez que :class:`XMLParser` ignore les commentaires dans l'entrée au lieu de créer des objets de commentaire pour eux. Un :class:`ElementTree` ne contiendra que des nœuds de commentaires qui ont été insérés dans l'arborescence à l'aide de l'une des méthodes d':class:`Element`.

source: Writes an element tree or element structure to sys.stdout. This function should be used for debugging only.
fr: Écrit une arborescence d'éléments ou une structure d'éléments dans *sys.stdout*. Cette fonction doit être utilisée uniquement pour le débogage.

source: The exact output format is implementation dependent. In this version, it's written as an ordinary XML file.
fr: Le format de sortie exact dépend de l’implémentation. Dans cette version, il est écrit sous la forme d'un fichier XML ordinaire.

source: *elem* is an element tree or an individual element.
fr: *elem* est un élément de l'arborescence ou un élément individuel.

source: The :func:`dump` function now preserves the attribute order specified by the user.
fr: la fonction :func:`dump` préserve désormais l'ordre des attributs spécifié par l'utilisateur.

source: Parses an XML section from a string constant. Same as :func:`XML`. *text* is a string containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`Element` instance.
fr: Analyse une section XML à partir d'une constante de chaîne. Identique à :func:`XML`. *text* est une chaîne contenant des données XML. *parser* est une instance d'analyseur facultative. S'il n'est pas fourni, l'analyseur standard :class:`XMLParser` est utilisé. Renvoie une instance d':class:`Element`.

source: Parses an XML document from a sequence of string fragments. *sequence* is a list or other sequence containing XML data fragments. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`Element` instance.
fr: Analyse un document XML à partir d'une séquence de fragments de chaîne. *séquence* est une liste ou une autre séquence contenant des fragments de données XML. *parser* est une instance d'analyseur facultative. S'il n'est pas fourni, l'analyseur standard :class:`XMLParser` est utilisé. Renvoie une instance d':class:`Element`.

source: Appends whitespace to the subtree to indent the tree visually. This can be used to generate pretty-printed XML output. *tree* can be an Element or ElementTree. *space* is the whitespace string that will be inserted for each indentation level, two space characters by default. For indenting partial subtrees inside of an already indented tree, pass the initial indentation level as *level*.
fr: Ajoute des espaces au sous-arbre pour indenter visuellement l'arborescence. Cela peut être utilisé pour générer une sortie XML avec une mise en forme agréable. *tree* peut être un élément ou un *ElementTree*. *espace* est la chaîne d'espaces qui est insérée pour chaque niveau d'indentation, deux caractères d'espace par défaut. Pour indenter des sous-arbres partiels à l'intérieur d'un arbre déjà indenté, transmettez le niveau d'indentation initial dans *level*.

source: Check if an object appears to be a valid element object. *element* is an element instance. Return ``True`` if this is an element object.
fr: Vérifie si un objet semble être un objet élément valide. *element* est une instance d'élément. Renvoie ``True`` s'il s'agit d'un objet élément.

source: Note that while :func:`iterparse` builds the tree incrementally, it issues blocking reads on *source* (or the file it names). As such, it's unsuitable for applications where blocking reads can't be made. For fully non-blocking parsing, see :class:`XMLPullParser`.
fr: Notez que même si :func:`iterparse` construit l'arborescence de manière incrémentielle, il bloque pendant les lectures sur *source*. En tant que tel, il ne convient pas aux applications dans lesquelles le blocage pendant les lectures ne peut pas être effectué. Pour une analyse entièrement non bloquante, voir :class:`XMLPullParser`.

source: :func:`iterparse` only guarantees that it has seen the ">" character of a starting tag when it emits a "start" event, so the attributes are defined, but the contents of the text and tail attributes are undefined at that point. The same applies to the element children; they may or may not be present.
fr: :func:`iterparse` garantit uniquement qu'il a vu le caractère ``">"`` d'une balise de début lorsqu'il émet un événement ``"start"``, donc les attributs sont définis mais le contenu des attributs *text* et *tail* n'est pas défini à ce stade. La même chose s'applique aux nœuds enfants de l'élément ; ils peuvent être présents ou non.

source: If you need a fully populated element, look for "end" events instead.
fr: Si vous avez besoin d'un élément entièrement rempli, recherchez plutôt les événements ``"end"``.

source: The *parser* argument.
fr: l'argument *parser*.

source: The ``comment`` and ``pi`` events were added.
fr: les évènements ``comment`` et ``pi`` ont été ajoutés.

source: Parses an XML section into an element tree. *source* is a filename or file object containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`ElementTree` instance.
fr: Analyse une section XML dans une arborescence d'éléments. *source* est un nom de fichier ou un objet fichier contenant des données XML. *parser* (facultatif) est une instance d'analyseur. S'il n'est pas fourni, l'analyseur standard :class:`XMLParser` est utilisé. Renvoie une instance d':class:`ElementTree`.

source: PI element factory. This factory function creates a special element that will be serialized as an XML processing instruction. *target* is a string containing the PI target. *text* is a string containing the PI contents, if given. Returns an element instance, representing a processing instruction.
fr: Fabrique d’éléments *Processing Instruction* (PI). Cette fonction crée un élément spécial qui sera sérialisé en tant qu'instruction de traitement XML. *target* est une chaîne contenant la cible PI. *text* est une chaîne contenant le contenu de l'instruction de traitement (ou PI), s'il est fourni. Renvoie une instance d'élément, représentant l'instruction de traitement.

source: Registers a namespace prefix. The registry is global, and any existing mapping for either the given prefix or the namespace URI will be removed. *prefix* is a namespace prefix. *uri* is a namespace uri. Tags and attributes in this namespace will be serialized with the given prefix, if at all possible.
fr: Enregistre un préfixe d'espace de noms. Le registre est global et toute correspondance existante pour le préfixe donné ainsi que l'URI de l'espace de noms sera supprimé. *prefix* est un préfixe d'espace de noms. *uri* est un URI d'espace de noms. Les balises et les attributs de cet espace de noms seront sérialisés avec le préfixe donné, si possible.

source: Subelement factory. This function creates an element instance, and appends it to an existing element.
fr: Fabrique de sous-élément. Cette fonction crée une instance d'élément et l'ajoute à un élément existant.

source: The element name, attribute names, and attribute values can be either bytestrings or Unicode strings. *parent* is the parent element. *tag* is the subelement name. *attrib* is an optional dictionary, containing element attributes. *extra* contains additional attributes, given as keyword arguments. Returns an element instance.
fr: Le nom de l'élément, les noms d'attributs et les valeurs d'attributs peuvent être des chaînes d'octets ou des chaînes Unicode. *parent* est l'élément parent. *tag* est le nom du sous-élément. *attrib* est un dictionnaire facultatif contenant les attributs de l'élément. *extra* contient des attributs supplémentaires, donnés sous forme d'arguments nommés. Renvoie une instance d'élément.

source: Generates a string representation of an XML element, including all subelements. *element* is an :class:`Element` instance. *encoding* [1]_ is the output encoding (default is US-ASCII). Use ``encoding="unicode"`` to generate a Unicode string (otherwise, a bytestring is generated). *method* is either ``"xml"``, ``"html"`` or ``"text"`` (default is ``"xml"``). *xml_declaration*, *default_namespace* and *short_empty_elements* has the same meaning as in :meth:`ElementTree.write`. Returns an (optionally) encoded string containing the XML data.
fr: Génère une représentation sous forme de chaîne d'un élément XML, y compris tous les sous-éléments. *element* est une instance de :class:`Element`. *encoding* [1]_ est l'encodage de sortie (la valeur par défaut est US-ASCII). Utilisez ``encoding="unicode"`` pour générer une chaîne Unicode (sinon, une chaîne d'octets est générée). *method* vaut ``"xml"``, ``"html"`` ou ``"text"`` (la valeur par défaut est ``"xml"``). *xml_declaration*, *default_namespace* et *short_empty_elements* ont la même signification que dans :meth:`ElementTree.write`. Renvoie une chaîne codée (éventuellement) contenant les données XML.

source: The :func:`tostring` function now preserves the attribute order specified by the user.
fr: la fonction :func:`tostring` préserve désormais l'ordre des attributs spécifié par l'utilisateur.

source: Generates a string representation of an XML element, including all subelements. *element* is an :class:`Element` instance. *encoding* [1]_ is the output encoding (default is US-ASCII). Use ``encoding="unicode"`` to generate a Unicode string (otherwise, a bytestring is generated). *method* is either ``"xml"``, ``"html"`` or ``"text"`` (default is ``"xml"``). *xml_declaration*, *default_namespace* and *short_empty_elements* has the same meaning as in :meth:`ElementTree.write`. Returns a list of (optionally) encoded strings containing the XML data. It does not guarantee any specific sequence, except that ``b"".join(tostringlist(element)) == tostring(element)``.
fr: Génère une représentation sous forme de chaîne d'un élément XML, y compris tous les sous-éléments. *element* est une instance de :class:`Element`. *encoding* [1]_ est l'encodage de sortie (la valeur par défaut est US-ASCII). Utilisez ``encoding="unicode"`` pour générer une chaîne Unicode (sinon, une chaîne d'octets est générée). *method* vaut ``"xml"``, ``"html"`` ou ``"text"`` (la valeur par défaut est ``"xml"``). *xml_declaration*, *default_namespace* et *short_empty_elements* ont la même signification que dans :meth:`ElementTree.write`. Renvoie une liste de chaînes codées (éventuellement) contenant les données XML. Elle ne garantit aucune séquence spécifique, seulement ``b"".join(tostringlist(element)) == tostring(element)``.

source: The :func:`tostringlist` function now preserves the attribute order specified by the user.
fr: la fonction :func:`tostringlist` préserve désormais l'ordre des attributs spécifié par l'utilisateur.

source: Parses an XML section from a string constant. This function can be used to embed "XML literals" in Python code. *text* is a string containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`Element` instance.
fr: Analyse une section XML à partir d'une constante de chaîne. Cette fonction peut être utilisée pour intégrer des « littéraux XML » dans du code Python. *text* est une chaîne contenant des données XML. *parser*, facultatif, est une instance d'analyseur. S'il n'est pas fourni, l'analyseur standard :class:`XMLParser` est utilisé. Renvoie une instance d':class:`Element`.

source: Parses an XML section from a string constant, and also returns a dictionary which maps from element id:s to elements. *text* is a string containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns a tuple containing an :class:`Element` instance and a dictionary.
fr: Analyse une section XML à partir d'une constante de chaîne et renvoie également un dictionnaire qui fait correspondre les identifiants d'éléments aux éléments. *text* est une chaîne contenant des données XML. *parser*, facultatif, est une instance d'analyseur. S'il n'est pas fourni, l'analyseur standard :class:`XMLParser` est utilisé. Renvoie un *n*-uplet contenant une instance d':class:`Element` et un dictionnaire.

source: XInclude support
fr: Prise en charge de *XInclude*

source: This module provides limited support for `XInclude directives <https://www.w3.org/TR/xinclude/>`_, via the :mod:`xml.etree.ElementInclude` helper module. This module can be used to insert subtrees and text strings into element trees, based on information in the tree.
fr: Ce module fournit une prise en charge limitée des `directives XInclude <https://www.w3.org/TR/xinclude/>`_, via le module d'assistance :mod:`xml.etree.ElementInclude`. Ce module peut être utilisé pour insérer des sous-arbres et des chaînes de texte dans des arborescences d'éléments, en fonction des informations contenues dans l'arborescence.

source: Here's an example that demonstrates use of the XInclude module. To include an XML document in the current document, use the ``{http://www.w3.org/2001/XInclude}include`` element and set the **parse** attribute to ``"xml"``, and use the **href** attribute to specify the document to include.
fr: Voici un exemple qui montre l'utilisation du module *XInclude*. Pour inclure un document XML dans le document actuel, utilisez l'élément ``{http://www.w3.org/2001/XInclude}include``, définissez l'attribut **parse** sur ``"xml"`` et utilisez l'attribut **href** pour spécifier le document à inclure.

source: By default, the **href** attribute is treated as a file name. You can use custom loaders to override this behaviour. Also note that the standard helper does not support XPointer syntax.
fr: Par défaut, l'attribut **href** est traité comme un nom de fichier. Vous pouvez utiliser des chargeurs personnalisés pour remplacer ce comportement. Notez également que l'assistant standard ne prend pas en charge la syntaxe *XPointer*.

source: To process this file, load it as usual, and pass the root element to the :mod:`xml.etree.ElementTree` module:
fr: Pour traiter ce fichier, chargez-le comme d'habitude et passez l'élément racine au module :mod:`xml.etree.ElementTree` :

source: The ElementInclude module replaces the ``{http://www.w3.org/2001/XInclude}include`` element with the root element from the **source.xml** document. The result might look something like this:
fr: Le module *ElementInclude* remplace l'élément ``{http://www.w3.org/2001/XInclude}include`` par l'élément racine du document **source.xml**. Le résultat pourrait ressembler à ceci :

source: If the **parse** attribute is omitted, it defaults to "xml". The href attribute is required.
fr: Si l'attribut **parse** est omis, sa valeur par défaut est ``"xml"``. L'attribut *href* est obligatoire.

source: To include a text document, use the ``{http://www.w3.org/2001/XInclude}include`` element, and set the **parse** attribute to "text":
fr: Pour inclure un document texte, utilisez l'élément ``{http://www.w3.org/2001/XInclude}include`` et définissez l'attribut **parse** sur ``"text"`` :

source: The result might look something like:
fr: Le résultat pourrait ressembler à ceci :

source: Element Objects
fr: Objets *Element*

source: Element class. This class defines the Element interface, and provides a reference implementation of this interface.
fr: Classe Element. Cette classe définit l'interface Element et fournit une implémentation de référence de cette interface.

source: The element name, attribute names, and attribute values can be either bytestrings or Unicode strings. *tag* is the element name. *attrib* is an optional dictionary, containing element attributes. *extra* contains additional attributes, given as keyword arguments.
fr: Le nom de l'élément, les noms d'attributs et les valeurs d'attributs peuvent être des chaînes d'octets ou des chaînes Unicode. *tag* est le nom de l'élément. *attrib* est un dictionnaire facultatif contenant les attributs des éléments. *extra* contient des attributs supplémentaires, donnés sous forme d'arguments nommés.

source: A string identifying what kind of data this element represents (the element type, in other words).
fr: Chaîne identifiant le type de données que cet élément représente (en d'autres termes, le type d'élément).

source: These attributes can be used to hold additional data associated with the element. Their values are usually strings but may be any application-specific object. If the element is created from an XML file, the *text* attribute holds either the text between the element's start tag and its first child or end tag, or ``None``, and the *tail* attribute holds either the text between the element's end tag and the next tag, or ``None``. For the XML data
fr: Ces attributs peuvent être utilisés pour contenir des données supplémentaires associées à l'élément. Leurs valeurs sont généralement des chaînes mais peuvent être n'importe quel objet spécifique à une application. Si l'élément est créé à partir d'un fichier XML, l'attribut *text* contient soit le texte entre la balise de début de l'élément et sa première balise enfant ou de fin, soit ``None`` ; l'attribut *tail* contient soit le texte entre la balise de fin de l'élément et la balise suivante, soit ``None``. Pour les données XML

source: the *a* element has ``None`` for both *text* and *tail* attributes, the *b* element has *text* ``"1"`` and *tail* ``"4"``, the *c* element has *text* ``"2"`` and *tail* ``None``, and the *d* element has *text* ``None`` and *tail* ``"3"``.
fr: les attributs *text* et *tail* de l'élément *a* valent ``None``, l'attribut *text* de l'élément *b* vaut ``"1"`` et *tail* vaut ``"4"``, l'attribut *text* de l'élément *c* vaut ``"2"`` et *tail* vaut ``None``, et l'attribut *text* de l'élément *d* vaut ``None`` et *tail* vaut ``"3"``.

source: To collect the inner text of an element, see :meth:`itertext`, for example ``"".join(element.itertext())``.
fr: Pour récupérer le texte interne d'un élément, voir :meth:`itertext`, par exemple ``"".join(element.itertext())``.

source: Applications may store arbitrary objects in these attributes.
fr: Les applications peuvent stocker des objets arbitraires dans ces attributs.

source: A dictionary containing the element's attributes. Note that while the *attrib* value is always a real mutable Python dictionary, an ElementTree implementation may choose to use another internal representation, and create the dictionary only if someone asks for it. To take advantage of such implementations, use the dictionary methods below whenever possible.
fr: Dictionnaire contenant les attributs de l'élément. Notez que même si la valeur *attrib* est toujours un véritable dictionnaire Python mutable, une implémentation d'*ElementTree* peut choisir d'utiliser une autre représentation interne et de créer le dictionnaire uniquement si quelqu'un le demande. Pour profiter de telles implémentations, utilisez les méthodes de dictionnaire ci-dessous autant que possible.

source: The following dictionary-like methods work on the element attributes.
fr: Les méthodes dictionnaire-compatibles suivantes traitent les attributs de l'élément.

source: Resets an element. This function removes all subelements, clears all attributes, and sets the text and tail attributes to ``None``.
fr: Réinitialise un élément. Cette fonction supprime tous les sous-éléments, efface tous les attributs et définit les attributs *text* et *tail* sur ``None``.

source: Gets the element attribute named *key*.
fr: Accède à l'attribut de l'élément nommé *key*.

source: Returns the attribute value, or *default* if the attribute was not found.
fr: Renvoie la valeur de l'attribut ou *default* si l'attribut n'a pas été trouvé.

source: Returns the element attributes as a sequence of (name, value) pairs. The attributes are returned in an arbitrary order.
fr: Renvoie les attributs de l'élément comme une séquence de paire (nom, valeur). Les attributs sont renvoyés dans un ordre arbitraire.

source: Returns the elements attribute names as a list. The names are returned in an arbitrary order.
fr: Renvoie les noms d'attributs des éléments sous forme de liste. Les noms sont renvoyés dans un ordre arbitraire.

source: Set the attribute *key* on the element to *value*.
fr: Change l'attribut *key* à l'élément *value*.

source: The following methods work on the element's children (subelements).
fr: Les méthodes suivantes traitent les éléments enfants (sous-éléments).

source: Adds the element *subelement* to the end of this element's internal list of subelements. Raises :exc:`TypeError` if *subelement* is not an :class:`Element`.
fr: Ajoute l'élément *subelement* à la fin de la liste interne des sous-éléments de cet élément. Lève une :exc:`TypeError` si *subelement* n'est pas un :class:`Element`.

source: Finds the first subelement matching *match*. *match* may be a tag name or a :ref:`path <elementtree-xpath>`. Returns an element instance or ``None``. *namespaces* is an optional mapping from namespace prefix to full name. Pass ``''`` as prefix to move all unprefixed tag names in the expression into the given namespace.
fr: Recherche le premier sous-élément correspondant à *match*. *match* peut être un nom de balise ou un :ref:`path <elementtree-xpath>`. Renvoie une instance d'élément ou ``None``. *namespaces* est un tableau de correspondances facultatif de préfixes d'espaces de noms vers des noms complets. Passez ``''`` comme préfixe pour déplacer tous les noms de balises sans préfixe dans l'expression dans l'espace de noms donné.

source: Finds all matching subelements, by tag name or :ref:`path <elementtree-xpath>`. Returns a list containing all matching elements in document order. *namespaces* is an optional mapping from namespace prefix to full name. Pass ``''`` as prefix to move all unprefixed tag names in the expression into the given namespace.
fr: Recherche tous les sous-éléments correspondants, par nom de balise ou :ref:`path <elementtree-xpath>`. Renvoie une liste contenant tous les éléments correspondants dans l'ordre du document. *namespaces* est un tableau de correspondances facultatif de préfixes d'espaces de noms vers des noms complets. Passez ``''`` comme préfixe pour déplacer tous les noms de balises sans préfixe dans l'expression dans l'espace de noms donné.
