Repository: python/python-docs-fr
Catalog: library/xml.etree.elementtree.po
Languages: fr

source: **Source code:** :source:`Lib/xml/etree/ElementTree.py`
fr: **Code Source:** :source:`Lib/xml/etree/ElementTree.py`

source: The :mod:`xml.etree.ElementTree` module implements a simple and efficient API for parsing and creating XML data.
fr: Le module :mod:`xml.etree.ElementTree` implémente une API simple et efficace pour analyser et créer des données XML.

source: This module will use a fast implementation whenever available.
fr: ce module utilise une implémentation rapide chaque fois que c'est possible.

source: The :mod:`xml.etree.ElementTree` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data see :ref:`xml-vulnerabilities`.
fr: le module :mod:`xml.sax` n'est pas sécurisé contre les données construites de façon malveillante. Si vous avez besoin d'analyser des données non sécurisées ou non authentifiées, référez-vous à :ref:`xml-vulnerabilities`.

source: Tutorial
fr: Tutoriel

source: This is a short tutorial for using :mod:`xml.etree.ElementTree` (``ET`` in short). The goal is to demonstrate some of the building blocks and basic concepts of the module.
fr: Ceci est un petit tutoriel pour utiliser :mod:`xml.etree.ElementTree` (``ET``). Le but est de montrer quelques composants et les concepts basiques du module.

source: XML tree and elements
fr: Arborescence et éléments XML

source: XML is an inherently hierarchical data format, and the most natural way to represent it is with a tree. ``ET`` has two classes for this purpose - :class:`ElementTree` represents the whole XML document as a tree, and :class:`Element` represents a single node in this tree. Interactions with the whole document (reading and writing to/from files) are usually done on the :class:`ElementTree` level. Interactions with a single XML element and its sub-elements are done on the :class:`Element` level.
fr: XML est un format de données fondamentalement hiérarchique et la façon la plus naturelle de le représenter est avec un arbre. ``ET`` a deux classes pour ce but : :class:`ElementTree` représente l'ensemble du document XML comme un arbre et :class:`Element` représente un simple nœud dans cet arbre. Les interactions (lire et écrire vers et depuis des fichiers) sur le document sont habituellement effectuées au niveau de :class:`ElementTree`. Les interactions sur un seul élément XML et ses sous-éléments sont effectuées au niveau de :class:`Element`.

source: Parsing XML
fr: Analyse XML

source: We can import this data by reading from a file::
fr: Nous pouvons importer ces données en lisant un fichier ::

source: Or directly from a string::
fr: Ou depuis une chaîne de caractères ::

source: :func:`fromstring` parses XML from a string directly into an :class:`Element`, which is the root element of the parsed tree. Other parsing functions may create an :class:`ElementTree`. Check the documentation to be sure.
fr: :func:`fromstring` analyse les données XML depuis une chaîne de caractères et produit un :class:`Element`, qui est l'élément racine de l'arbre analysé. D'autres fonctions d'analyse peuvent créer un :class:`ElementTree`. Vérifiez la documentation pour en être sûr.

source: As an :class:`Element`, ``root`` has a tag and a dictionary of attributes::
fr: En tant qu':class:`Element`, ``root`` a une balise (*tag*) et un dictionnaire d'attributs ::

source: It also has children nodes over which we can iterate::
fr: Il contient aussi des nœuds enfants sur lesquels nous pouvons itérer ::

source: Children are nested, and we can access specific child nodes by index::
fr: Les enfants sont imbriqués et nous pouvons accéder aux nœuds enfants spécifiques *via* un indice ::

source: Not all elements of the XML input will end up as elements of the parsed tree. Currently, this module skips over any XML comments, processing instructions, and document type declarations in the input. Nevertheless, trees built using this module's API rather than parsing from XML text can have comments and processing instructions in them; they will be included when generating XML output. A document type declaration may be accessed by passing a custom :class:`TreeBuilder` instance to the :class:`XMLParser` constructor.
fr: les éléments du XML d'entrée ne sont pas tous considérés comme des éléments de l'arborescence. Actuellement, le module ignore les commentaires XML, les instructions de traitements et la déclaration du type de document dans l'entrée. Néanmoins, les arborescences construites en utilisant l'API du module plutôt que par l'analyse du texte XML peuvent contenir des commentaires et des instructions de traitement ; ils seront inclus lors de la génération du XML de sortie. La DTD du document est accessible en passant une instance de :class:`TreeBuilder` au constructeur de :class:`XMLParser`.

source: Pull API for non-blocking parsing
fr: API à flux tiré

source: Most parsing functions provided by this module require the whole document to be read at once before returning any result. It is possible to use an :class:`XMLParser` and feed data into it incrementally, but it is a push API that calls methods on a callback target, which is too low-level and inconvenient for most needs. Sometimes what the user really wants is to be able to parse XML incrementally, without blocking operations, while enjoying the convenience of fully constructed :class:`Element` objects.
fr: La plupart des fonctions d'analyse fournies par ce module nécessitent que le document entier soit lu en même temps avant de renvoyer un résultat. Il est possible d'utiliser un :class:`XMLParser` et d'y introduire des données de manière incrémentielle, mais il s'agit d'une API à flux poussé qui appelle des méthodes par rappel automatique, ce qui est de trop bas niveau et peu pratique pour la plupart des besoins. Parfois, ce que l'utilisateur souhaite réellement, c'est pouvoir analyser du XML de manière incrémentielle, sans bloquer les opérations, tout en bénéficiant de la commodité des objets :class:`Element` entièrement construits.

source: The most powerful tool for doing this is :class:`XMLPullParser`. It does not require a blocking read to obtain the XML data, and is instead fed with data incrementally with :meth:`XMLPullParser.feed` calls. To get the parsed XML elements, call :meth:`XMLPullParser.read_events`. Here is an example::
fr: L'outil le plus puissant pour ce faire est :class:`XMLPullParser`. Il ne nécessite pas de lecture bloquante pour obtenir les données XML et est plutôt alimenté en données de manière incrémentielle avec des appels à :meth:`XMLPullParser.feed`. Pour obtenir les éléments XML analysés, appelez :meth:`XMLPullParser.read_events`. Voici un exemple ::

source: The obvious use case is applications that operate in a non-blocking fashion where the XML data is being received from a socket or read incrementally from some storage device. In such cases, blocking reads are unacceptable.
fr: Le cas d'utilisation évident concerne les applications qui fonctionnent de manière non bloquante dans lesquelles les données XML sont reçues à partir d'un connecteur réseau ou lues de manière incrémentielle à partir d'un périphérique de stockage. Dans de tels cas, le blocage des lectures est inacceptable.

source: Because it's so flexible, :class:`XMLPullParser` can be inconvenient to use for simpler use-cases. If you don't mind your application blocking on reading XML data but would still like to have incremental parsing capabilities, take a look at :func:`iterparse`. It can be useful when you're reading a large XML document and don't want to hold it wholly in memory.
fr: Parce qu'il est très flexible, :class:`XMLPullParser` peut être peu pratique à utiliser pour des cas d'utilisation plus simples. Si cela ne vous dérange pas que votre application se bloque pendant la lecture de données XML mais que vous souhaitez tout de même disposer de capacités d'analyse incrémentielle, jetez un œil à :func:`iterparse`. Cela peut être utile lorsque vous lisez un document XML volumineux et que vous ne souhaitez pas le conserver entièrement en mémoire.

source: Finding interesting elements
fr: Atteinte d'éléments d'intérêt

source: :class:`Element` has some useful methods that help iterate recursively over all the sub-tree below it (its children, their children, and so on). For example, :meth:`Element.iter`::
fr: :class:`Element` a quelques méthodes très utiles qui aident à parcourir récursivement tous les sous-arbres (ses enfants, leurs enfants et ainsi de suite). Par exemple, :meth:`Element.iter` ::

source: :meth:`Element.findall` finds only elements with a tag which are direct children of the current element. :meth:`Element.find` finds the *first* child with a particular tag, and :attr:`Element.text` accesses the element's text content. :meth:`Element.get` accesses the element's attributes::
fr: :meth:`Element.findall` récupère seulement les éléments avec une balise qui sont les descendants directs de l'élément courant. :meth:`Element.find` récupère le *premier* élément avec une balise particulière et :attr:`Element.text` accède au contenu textuel de l'élément. :meth:`Element.get` accède aux attributs de l'élément ::

source: More sophisticated specification of which elements to look for is possible by using :ref:`XPath <elementtree-xpath>`.
fr: Une caractérisation plus sophistiquée des éléments à rechercher est possible en utilisant :ref:`XPath <elementtree-xpath>`.

source: Modifying an XML File
fr: Modification d'un fichier XML

source: :class:`ElementTree` provides a simple way to build XML documents and write them to files. The :meth:`ElementTree.write` method serves this purpose.
fr: :class:`ElementTree` fournit un moyen simple de créer des documents XML et de les écrire dans des fichiers. La méthode :meth:`ElementTree.write` sert à cet effet.

source: Once created, an :class:`Element` object may be manipulated by directly changing its fields (such as :attr:`Element.text`), adding and modifying attributes (:meth:`Element.set` method), as well as adding new children (for example with :meth:`Element.append`).
fr: Une fois créé, un objet :class:`Element` peut être manipulé en changeant directement ses champs (tels que :attr:`Element.text`), en ajoutant et en modifiant des attributs (méthode :meth:`Element.set`), ou en ajoutant de nouveaux enfants (par exemple avec :meth:`Element.append`).

source: Let's say we want to add one to each country's rank, and add an ``updated`` attribute to the rank element::
fr: Disons que nous voulons en ajouter un au classement de chaque pays, et ajouter un attribut *updated* (« mis à jour ») à l'élément de classement ::

source: Our XML now looks like this:
fr: Maintenant, notre XML ressemble à ceci :

source: We can remove elements using :meth:`Element.remove`. Let's say we want to remove all countries with a rank higher than 50::
fr: Nous pouvons supprimer des éléments en utilisant :meth:`Element.remove`. Supposons que nous souhaitions supprimer tous les pays dont le classement est supérieur à 50 ::

source: Note that concurrent modification while iterating can lead to problems, just like when iterating and modifying Python lists or dicts. Therefore, the example first collects all matching elements with ``root.findall()``, and only then iterates over the list of matches.
fr: Notez que les modifications simultanées lors de l'itération peuvent entraîner des problèmes, tout comme lors de l'itération et de la modification de listes ou de dictionnaires Python. Par conséquent, l'exemple collecte d'abord tous les éléments correspondants avec ``root.findall()``, et après seulement parcourt la liste des correspondances.

source: Building XML documents
fr: Création de documents XML

source: The :func:`SubElement` function also provides a convenient way to create new sub-elements for a given element::
fr: La fonction :func:`SubElement` fournit également un moyen pratique de créer de nouveaux sous-éléments pour un élément donné ::

source: Parsing XML with Namespaces
fr: Analyse d'un XML avec des espaces de noms

source: If the XML input has `namespaces <https://en.wikipedia.org/wiki/XML_namespace>`__, tags and attributes with prefixes in the form ``prefix:sometag`` get expanded to ``{uri}sometag`` where the *prefix* is replaced by the full *URI*. Also, if there is a `default namespace <https://www.w3.org/TR/xml-names/#defaulting>`__, that full URI gets prepended to all of the non-prefixed tags.
fr: Si l'entrée XML a des `espaces de noms <https://fr.wikipedia.org/wiki/Espace_de_noms_XML>`__, les balises et les attributs avec des préfixes sous la forme *préfixe:unebalise* sont étendus à ``{uri}unebalise`` où le *préfixe* est remplacé par l'*URI* complet. De plus, s'il existe un `espace de noms par défaut <https://www.w3.org/TR/xml-names/#defaulting>`__, cet URI complet est ajouté au début de toutes les balises non préfixées.

source: Here is an XML example that incorporates two namespaces, one with the prefix "fictional" and the other serving as the default namespace:
fr: Voici un exemple XML qui intègre deux espaces de noms, l'un avec le préfixe *fictional* et l'autre servant d'espace de noms par défaut :

source: One way to search and explore this XML example is to manually add the URI to every tag or attribute in the xpath of a :meth:`~Element.find` or :meth:`~Element.findall`::
fr: Une façon de rechercher et d'explorer cet exemple XML consiste à ajouter manuellement l'URI à chaque balise ou attribut dans le *xpath* d'une recherche :meth:`~Element.find` ou :meth:`~Element.findall` ::

source: A better way to search the namespaced XML example is to create a dictionary with your own prefixes and use those in the search functions::
fr: Une meilleure façon de rechercher dans l'exemple XML avec espace de noms consiste à créer un dictionnaire avec vos propres préfixes et à les utiliser dans les fonctions de recherche ::

source: These two approaches both output::
fr: Ces deux approches donnent le même résultat ::

source: XPath support
fr: Prise en charge de *XPath*

source: This module provides limited support for `XPath expressions <https://www.w3.org/TR/xpath>`_ for locating elements in a tree. The goal is to support a small subset of the abbreviated syntax; a full XPath engine is outside the scope of the module.
fr: Ce module fournit une prise en charge limitée des `expressions XPath <https://www.w3.org/TR/xpath>`_ pour localiser des éléments dans une arborescence. L'objectif est de prendre en charge un petit sous-ensemble de la syntaxe abrégée ; un moteur *XPath* complet sort du cadre du module.

source: Example
fr: Exemple

source: Here's an example that demonstrates some of the XPath capabilities of the module. We'll be using the ``countrydata`` XML document from the :ref:`Parsing XML <elementtree-parsing-xml>` section::
fr: Voici un exemple qui démontre certaines des fonctionnalités *XPath* du module. Nous utilisons le document XML ``countrydata`` de la section :ref:`Parsing XML <elementtree-parsing-xml>` ::

source: For XML with namespaces, use the usual qualified ``{namespace}tag`` notation::
fr: Pour du XML avec des espaces de noms, utilisez la notation qualifiée habituelle ``{namespace}tag`` ::

source: Supported XPath syntax
fr: Prise en charge de la syntaxe *XPath*

source: Syntax
fr: Syntaxe

source: Meaning
fr: Signification

source: Selects all child elements with the given tag. For example, ``spam`` selects all child elements named ``spam``, and ``spam/egg`` selects all grandchildren named ``egg`` in all children named ``spam``. ``{namespace}*`` selects all tags in the given namespace, ``{*}spam`` selects tags named ``spam`` in any (or no) namespace, and ``{}*`` only selects tags that are not in a namespace.
fr: Sélectionne tous les éléments enfants avec une balise donnée. Par exemple, ``spam`` sélectionne tous les éléments enfants nommés ``spam`` et ``spam/egg`` sélectionne tous les petits-enfants nommés ``egg`` dans les enfants nommés ``spam``. ``{namespace}*`` sélectionne toutes les balises dans l'espace de noms donné, ``{*}spam`` sélectionne les balises nommées ``spam`` dans n'importe quel (ou aucun) espace de noms et ``{}*`` sélectionne seulement les balises qui ne sont pas dans un espace de noms.

source: Support for star-wildcards was added.
fr: la prise en charge des caractères génériques étoiles a été ajoutée.

source: Selects all child elements, including comments and processing instructions. For example, ``*/egg`` selects all grandchildren named ``egg``.
fr: Sélectionne tous les éléments enfants, y compris les commentaires et les instructions de traitement. Par exemple, ``*/egg`` sélectionne tous les petits-enfants nommés ``egg``.

source: Selects the current node. This is mostly useful at the beginning of the path, to indicate that it's a relative path.
fr: Sélectionne le nœud actuel. C'est surtout utile au début du chemin, pour indiquer qu'il s'agit d'un chemin relatif.

source: Selects all subelements, on all levels beneath the current element. For example, ``.//egg`` selects all ``egg`` elements in the entire tree.
fr: Sélectionne tous les sous-éléments, à tous les niveaux situés sous l'élément actuel. Par exemple, ``.//egg`` sélectionne tous les éléments ``egg`` dans l'arborescence entière.

source: Selects the parent element. Returns ``None`` if the path attempts to reach the ancestors of the start element (the element ``find`` was called on).
fr: Sélectionne l'élément parent. Renvoie ``None`` si le chemin tente d'atteindre les ancêtres de l'élément de départ (l'élément sur lequel ``find`` a été appelé).

source: Selects all elements that have the given attribute.
fr: Sélectionne tous les éléments qui ont l'attribut donné.

source: Selects all elements for which the given attribute has the given value. The value cannot contain quotes.
fr: Sélectionne tous les éléments pour lesquels l'attribut donné a la valeur donnée. La valeur ne peut pas contenir de guillemet simple (``'``).

source: Selects all elements for which the given attribute does not have the given value. The value cannot contain quotes.
fr: Sélectionne tous les éléments pour lesquels l'attribut donné n'a pas la valeur donnée. La valeur ne peut pas contenir de guillemet simple (``'``).

source: Selects all elements that have a child named ``tag``. Only immediate children are supported.
fr: Sélectionne tous les éléments qui ont un enfant nommé ``tag``. Seuls les enfants immédiats sont pris en charge.

source: Selects all elements whose complete text content, including descendants, equals the given ``text``.
fr: Sélectionne tous les éléments dont le contenu textuel complet, y compris les descendants, est égal au ``text`` donné.

source: Selects all elements whose complete text content, including descendants, does not equal the given ``text``.
fr: Sélectionne tous les éléments dont le contenu textuel complet, y compris les descendants, n'est pas égal au ``text`` donné.

source: Selects all elements that have a child named ``tag`` whose complete text content, including descendants, equals the given ``text``.
fr: Sélectionne tous les éléments qui ont un enfant nommé ``tag`` dont le contenu textuel complet, y compris les descendants, est égal au ``text`` donné.

source: Selects all elements that have a child named ``tag`` whose complete text content, including descendants, does not equal the given ``text``.
fr: Sélectionne tous les éléments qui ont un enfant nommé ``tag`` dont le contenu textuel complet, y compris les descendants, n'est pas égal au ``text`` donné.

source: Selects all elements that are located at the given position. The position can be either an integer (1 is the first position), the expression ``last()`` (for the last position), or a position relative to the last position (e.g. ``last()-1``).
fr: Sélectionne tous les éléments situés à la position donnée. La position peut être soit un entier (1 est la première position), l'expression ``last()`` (pour la dernière position), ou une position relative à la dernière position (par exemple ``last()-1``).

source: Predicates (expressions within square brackets) must be preceded by a tag name, an asterisk, or another predicate. ``position`` predicates must be preceded by a tag name.
fr: Les prédicats (expressions entre crochets) doivent être précédés d'un nom de balise, d'un astérisque ou d'un autre prédicat. Les prédicats ``position`` doivent être précédés d'un nom de balise.

source: Reference
fr: Référence

source: Functions
fr: Fonctions

source: `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_ transformation function.
fr: Fonction de transformation `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_.

source: This function takes an XML data string (*xml_data*) or a file path or file-like object (*from_file*) as input, converts it to the canonical form, and writes it out using the *out* file(-like) object, if provided, or returns it as a text string if not. The output file receives text, not bytes. It should therefore be opened in text mode with ``utf-8`` encoding.
fr: Cette fonction prend une chaîne de données XML (*xml_data*) ou un chemin de fichier ou un objet de type fichier (*from_file*) en entrée, la convertit sous la forme canonique et l'écrit à l'aide de l'objet simili-fichier *out*, s'il est fourni, ou le renvoie sous forme de chaîne de texte sinon. Le fichier de sortie reçoit du texte, pas des octets. Il doit donc être ouvert en mode texte avec l'encodage ``utf-8``.

source: Typical uses::
fr: Utilisation typique ::

source: The configuration *options* are as follows:
fr: Les *options* de configuration sont les suivantes :

source: *with_comments*: set to true to include comments (default: false)
fr: *with_comments* : définissez cet attribut à vrai pour inclure les commentaires (par défaut : faux)

source: *strip_text*: set to true to strip whitespace before and after text content
fr: *strip_text* : définissez à vrai pour supprimer les espaces avant et après le contenu du texte

source: (default: false)
fr: (par défaut : faux)

source: *rewrite_prefixes*: set to true to replace namespace prefixes by "n{number}"
fr: *rewrite_prefixes* : définissez à vrai pour remplacer les préfixes d'espace de noms par « n{nombre} »

source: *qname_aware_tags*: a set of qname aware tag names in which prefixes
fr: *qname_aware_tags* : ensemble de noms de balises prenant en charge les noms qualifiés dans lesquels les préfixes

source: should be replaced in text content (default: empty)
fr: doivent être remplacés dans le contenu du texte (par défaut : vide)

source: *qname_aware_attrs*: a set of qname aware attribute names in which prefixes
fr: *qname_aware_attrs* : ensemble de noms d'attributs prenant en charge les noms qualifiés dans lesquels les préfixes

source: *exclude_attrs*: a set of attribute names that should not be serialised
fr: *exclude_attrs* : ensemble de noms d'attributs qui ne doivent pas être sérialisés

source: *exclude_tags*: a set of tag names that should not be serialised
fr: *exclude_tags* : ensemble de noms de balises qui ne doivent pas être sérialisés

source: In the option list above, "a set" refers to any collection or iterable of strings, no ordering is expected.
fr: Dans la liste d'options ci-dessus, un « ensemble » fait référence à toute collection ou itérable de chaînes, aucun ordre n'est attendu.
