Repository: python/python-docs-fr
Catalog: library/xml.etree.elementtree.po
Languages: fr

source: Finds text for the first subelement matching *match*. *match* may be a tag name or a :ref:`path <elementtree-xpath>`. Returns the text content of the first matching element, or *default* if no element was found. Note that if the matching element has no text content an empty string is returned. *namespaces* is an optional mapping from namespace prefix to full name. Pass ``''`` as prefix to move all unprefixed tag names in the expression into the given namespace.
fr: Recherche le texte du premier sous-élément correspondant à *match*. *match* peut être un nom de balise ou un :ref:`path <elementtree-xpath>`. Renvoie le contenu textuel du premier élément correspondant, ou *default* si aucun élément n'a été trouvé. Notez que si l'élément correspondant n'a pas de contenu textuel, une chaîne vide est renvoyée. *namespaces* est un tableau de correspondances facultatif de préfixes d'espaces de noms vers des noms complets. Passez ``''`` comme préfixe pour déplacer tous les noms de balises sans préfixe dans l'expression dans l'espace de noms donné.

source: Inserts *subelement* at the given position in this element. Raises :exc:`TypeError` if *subelement* is not an :class:`Element`.
fr: Insère le *subelement* à la position donnée dans cet élément. Lève une :exc:`TypeError` si *subelement* n'est pas un :class:`Element`.

source: Creates a tree :term:`iterator` with the current element as the root. The iterator iterates over this element and all elements below it, in document (depth first) order. If *tag* is not ``None`` or ``'*'``, only elements whose tag equals *tag* are returned from the iterator. If the tree structure is modified during iteration, the result is undefined.
fr: Crée un :term:`itérateur <iterator>` sur l'arbre avec l'élément actuel comme racine. L'itérateur parcourt cet élément et tous les éléments situés en dessous, dans l'ordre du document (profondeur en premier). Si *tag* n'est pas ``None`` ou ``'*'``, seuls les éléments dont la balise est égale à *tag* sont renvoyés par l'itérateur. Si l'arborescence est modifiée au cours de l'itération, le résultat est indéfini.

source: Finds all matching subelements, by tag name or :ref:`path <elementtree-xpath>`. Returns an iterable yielding all matching elements in document order. *namespaces* is an optional mapping from namespace prefix to full name.
fr: Recherche tous les sous-éléments correspondants, par nom de balise ou :ref:`path <elementtree-xpath>`. Renvoie un itérable donnant tous les éléments correspondants dans l'ordre du document. *namespaces* est un tableau de correspondances facultatif de préfixes d'espaces de noms vers des noms complets.

source: Creates a text iterator. The iterator loops over this element and all subelements, in document order, and returns all inner text.
fr: Crée un itérateur de texte. L'itérateur parcourt cet élément et tous les sous-éléments, dans l'ordre du document, et renvoie tout le texte interne.

source: Creates a new element object of the same type as this element. Do not call this method, use the :func:`SubElement` factory function instead.
fr: Crée un nouvel objet élément du même type que cet élément. N'appelez pas cette méthode, utilisez plutôt la fonction de fabrique :func:`SubElement`.

source: Removes *subelement* from the element. Unlike the find\* methods this method compares elements based on the instance identity, not on tag value or contents.
fr: Supprime le *subelement* de l'élément. Contrairement aux méthodes *find\**, cette méthode compare les éléments en fonction de l'identité de l'instance, et non de la valeur ou du contenu de la balise.

source: :class:`Element` objects also support the following sequence type methods for working with subelements: :meth:`~object.__delitem__`, :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__len__`.
fr: Les objets :class:`Element` prennent également en charge les méthodes de type séquence suivantes pour travailler avec des sous éléments : :meth:`~object.__delitem__`, :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__len__`.

source: Prior to Python 3.8, the serialisation order of the XML attributes of elements was artificially made predictable by sorting the attributes by their name. Based on the now guaranteed ordering of dicts, this arbitrary reordering was removed in Python 3.8 to preserve the order in which attributes were originally parsed or created by user code.
fr: Avant Python 3.8, l'ordre de sérialisation des attributs XML des éléments était artificiellement rendu prévisible en classant les attributs par leur nom. Sur la base de l'ordre désormais garanti des dictionnaires, cette réorganisation arbitraire a été supprimée dans Python 3.8 pour préserver l'ordre dans lequel les attributs ont été initialement analysés ou créés par le code utilisateur.

source: In general, user code should try not to depend on a specific ordering of attributes, given that the `XML Information Set <https://www.w3.org/TR/xml-infoset/>`_ explicitly excludes the attribute order from conveying information. Code should be prepared to deal with any ordering on input. In cases where deterministic XML output is required, e.g. for cryptographic signing or test data sets, canonical serialisation is available with the :func:`canonicalize` function.
fr: En général, le code utilisateur doit essayer de ne pas dépendre d'un ordre spécifique des attributs, étant donné que la `documentation de référence XML <https://www.w3.org/TR/xml-infoset/>`_ exclut explicitement que l'ordre des attributs soit porteur d'information. Le code doit être prêt à gérer tout ordre en entrée. Dans les cas où une sortie XML déterministe est requise, par exemple pour la signature cryptographique ou les ensembles de données de test, la sérialisation canonique est disponible avec la fonction :func:`canonicalize`.

source: In cases where canonical output is not applicable but a specific attribute order is still desirable on output, code should aim for creating the attributes directly in the desired order, to avoid perceptual mismatches for readers of the code. In cases where this is difficult to achieve, a recipe like the following can be applied prior to serialisation to enforce an order independently from the Element creation::
fr: Dans les cas où la sortie canonique n'est pas applicable mais où un ordre d'attributs spécifique est quand même souhaitable en sortie, le code doit viser à créer les attributs directement dans l'ordre souhaité, afin d'éviter des inadéquations de perception pour les lecteurs du code. Dans les cas où cela est difficile à réaliser, une recette comme ci-dessous peut être appliquée avant la sérialisation pour appliquer un ordre indépendant de la création de l'élément ::

source: ElementTree Objects
fr: Objets *ElementTree*

source: ElementTree wrapper class. This class represents an entire element hierarchy, and adds some extra support for serialization to and from standard XML.
fr: Classe enveloppant *ElementTree*. Cette classe représente une hiérarchie d'éléments entière et ajoute une prise en charge supplémentaire pour la sérialisation vers et depuis le XML standard.

source: *element* is the root element. The tree is initialized with the contents of the XML *file* if given.
fr: *element* est l'élément racine. L'arborescence est initialisée avec le contenu du fichier XML *file* s'il est fourni.

source: Replaces the root element for this tree. This discards the current contents of the tree, and replaces it with the given element. Use with care. *element* is an element instance.
fr: Remplace l'élément racine de cette arborescence. Cela supprime le contenu actuel de l'arborescence et le remplace par l'élément donné. À utiliser avec précaution. *element* est une instance d'élément.

source: Same as :meth:`Element.find`, starting at the root of the tree.
fr: Comme :meth:`Element.find`, commence à la racine de l'arbre.

source: Same as :meth:`Element.findall`, starting at the root of the tree.
fr: Identique à :meth:`Element.findall`, en commençant à la racine de l'arborescence.

source: Same as :meth:`Element.findtext`, starting at the root of the tree.
fr: Identique à :meth:`Element.findtext`, en commençant à la racine de l'arborescence.

source: Returns the root element for this tree.
fr: Renvoie l'élément racine de l'arbre.

source: Creates and returns a tree iterator for the root element. The iterator loops over all elements in this tree, in section order. *tag* is the tag to look for (default is to return all elements).
fr: Crée et renvoie un itérateur d'arborescence pour l'élément racine. L'itérateur parcourt tous les éléments de cette arborescence, dans l'ordre des sections. *tag* est la balise à rechercher (la valeur par défaut est de renvoyer tous les éléments).

source: Same as :meth:`Element.iterfind`, starting at the root of the tree.
fr: Identique à :meth:`Element.iterfind`, en commençant à la racine de l'arborescence.

source: Loads an external XML section into this element tree. *source* is a file name or :term:`file object`. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns the section root element.
fr: Charge une section XML externe dans cette arborescence d'éléments. *source* est un nom de fichier ou un :term:`objet fichier <file object>`. *parser*, facultatif, est une instance d'analyseur. S'il n'est pas fourni, l'analyseur standard :class:`XMLParser` est utilisé. Renvoie l'élément racine de la section.

source: Writes the element tree to a file, as XML. *file* is a file name, or a :term:`file object` opened for writing. *encoding* [1]_ is the output encoding (default is US-ASCII). *xml_declaration* controls if an XML declaration should be added to the file. Use ``False`` for never, ``True`` for always, ``None`` for only if not US-ASCII or UTF-8 or Unicode (default is ``None``). *default_namespace* sets the default XML namespace (for "xmlns"). *method* is either ``"xml"``, ``"html"`` or ``"text"`` (default is ``"xml"``). The keyword-only *short_empty_elements* parameter controls the formatting of elements that contain no content. If ``True`` (the default), they are emitted as a single self-closed tag, otherwise they are emitted as a pair of start/end tags.
fr: Écrit l'arborescence des éléments dans un fichier, au format XML. *file* est un nom de fichier ou un :term:`objet fichier <file object>` ouvert en écriture. *encoding* [1]_ est l'encodage de sortie (la valeur par défaut est US-ASCII). *xml_declaration* contrôle si une déclaration XML doit être ajoutée au fichier. Utilisez ``False`` pour jamais, ``True`` pour toujours, ``None`` pour seulement si ce n'est pas de l'US-ASCII ou de l'UTF-8 ou de l'Unicode (la valeur par défaut est ``None``). *default_namespace* définit l'espace de noms XML par défaut (pour ``"xmlns"``). *method* vaut ``"xml"``, ``"html"`` ou ``"text"`` (la valeur par défaut est ``"xml"``). Le paramètre nommé (uniquement) *short_empty_elements* contrôle le formatage des éléments qui ne contiennent aucun contenu. Si c'est ``True`` (valeur par défaut), ils sont écrits sous la forme d'une seule balise auto-fermée, sinon ils sont écrits sous la forme d'une paire de balises de début-fin.

source: The output is either a string (:class:`str`) or binary (:class:`bytes`). This is controlled by the *encoding* argument. If *encoding* is ``"unicode"``, the output is a string; otherwise, it's binary. Note that this may conflict with the type of *file* if it's an open :term:`file object`; make sure you do not try to write a string to a binary stream and vice versa.
fr: La sortie est une chaîne (:class:`str`) ou du binaire (:class:`bytes`). C'est contrôlé par l'argument *encoding*. Si *encoding* est ``"unicode"``, la sortie est une chaîne ; sinon, c'est binaire. Notez que cela peut entrer en conflit avec le type de *fichier* s'il s'agit d'un :term:`objet fichier <file object>` déjà ouvert ; assurez-vous de ne pas essayer d'écrire une chaîne dans un flux binaire et vice versa.

source: The :meth:`write` method now preserves the attribute order specified by the user.
fr: la méthode :meth:`write` préserve désormais l'ordre des attributs spécifié par l'utilisateur.

source: This is the XML file that is going to be manipulated::
fr: Voici le fichier XML à manipuler ::

source: Example of changing the attribute "target" of every link in first paragraph::
fr: Exemple de modification de l'attribut *target* de chaque lien dans le premier paragraphe ::

source: QName Objects
fr: Objets *QName*

source: QName wrapper. This can be used to wrap a QName attribute value, in order to get proper namespace handling on output. *text_or_uri* is a string containing the QName value, in the form {uri}local, or, if the tag argument is given, the URI part of a QName. If *tag* is given, the first argument is interpreted as a URI, and this argument is interpreted as a local name. :class:`QName` instances are opaque.
fr: Surcouche à *QName*. Cela peut être utilisé pour envelopper une valeur d'attribut *QName*, afin d'obtenir une gestion appropriée de l'espace de noms en sortie. *text_or_uri* est une chaîne contenant la valeur *QName*, sous la forme *{uri}local* ou, si l'argument *tag* est donné, la partie URI d'un *QName*. Si *tag* est donné, le premier argument est interprété comme un URI et cet argument est interprété comme un nom local. Les instances :class:`QName` sont opaques.

source: TreeBuilder Objects
fr: Objets *TreeBuilder*

source: Generic element structure builder. This builder converts a sequence of start, data, end, comment and pi method calls to a well-formed element structure. You can use this class to build an element structure using a custom XML parser, or a parser for some other XML-like format.
fr: Générateur de structure d'éléments générique. Ce constructeur convertit une séquence d'appels de méthode *start*, *data*, *end*, *comment* et *pi* en une structure d'éléments bien formée. Vous pouvez utiliser cette classe pour créer une structure d'éléments à l'aide d'un analyseur XML personnalisé ou d'un analyseur pour un autre type de format XML.

source: *element_factory*, when given, must be a callable accepting two positional arguments: a tag and a dict of attributes. It is expected to return a new element instance.
fr: *element_factory*, lorsqu'il est donné, doit être un appelable acceptant deux arguments positionnels : une balise et un dictionnaire d'attributs. Elle est censée renvoyer une nouvelle instance d'élément.

source: The *comment_factory* and *pi_factory* functions, when given, should behave like the :func:`Comment` and :func:`ProcessingInstruction` functions to create comments and processing instructions. When not given, the default factories will be used. When *insert_comments* and/or *insert_pis* is true, comments/pis will be inserted into the tree if they appear within the root element (but not outside of it).
fr: Les fonctions *comment_factory* et *pi_factory*, lorsqu'elles sont données, doivent se comporter comme les fonctions :func:`Comment` et :func:`ProcessingInstruction` pour créer des commentaires et des instructions de traitement. Lorsqu’elles ne sont pas fournies, les fabriques par défaut sont utilisées. Lorsque *insert_comments* ou *insert_pis* sont vraies, les commentaires et instructions de traitement sont insérés dans l'arborescence s'ils apparaissent dans l'élément racine (mais pas à l'extérieur de celui-ci).

source: Flushes the builder buffers, and returns the toplevel document element. Returns an :class:`Element` instance.
fr: Vide les tampons du générateur et renvoie l'élément de document de niveau supérieur. Renvoie une instance d':class:`Element`.

source: Adds text to the current element. *data* is a string. This should be either a bytestring, or a Unicode string.
fr: Ajoute du texte à l'élément courant. *data* est une chaîne de caractères. Cela peut être une chaîne d'octets ou une chaîne Unicode.

source: Closes the current element. *tag* is the element name. Returns the closed element.
fr: Ferme l'élément courant. *tag* est le nom de l'élément. Renvoie l'élément fermé.

source: Opens a new element. *tag* is the element name. *attrs* is a dictionary containing element attributes. Returns the opened element.
fr: Ouvre un nouvel élément. *tag* est le nom de l'élément. *attrs* est un dictionnaire contenant les attributs de l'élément. Renvoie l'élément ouvert.

source: Creates a comment with the given *text*. If ``insert_comments`` is true, this will also add it to the tree.
fr: Crée un commentaire avec le *text* donné. Si ``insert_comments`` est vrai, cela l'ajoute également à l'arborescence.

source: In addition, a custom :class:`TreeBuilder` object can provide the following methods:
fr: De plus, un objet :class:`TreeBuilder` personnalisé peut fournir les méthodes suivantes :

source: Handles a doctype declaration. *name* is the doctype name. *pubid* is the public identifier. *system* is the system identifier. This method does not exist on the default :class:`TreeBuilder` class.
fr: Gère une déclaration *doctype*. *name* est le nom du type de document. *pubid* est l'identifiant public. *system* est l'identifiant du système. Cette méthode n'existe pas sur la classe par défaut :class:`TreeBuilder`.

source: Is called whenever the parser encounters a new namespace declaration, before the ``start()`` callback for the opening element that defines it. *prefix* is ``''`` for the default namespace and the declared namespace prefix name otherwise. *uri* is the namespace URI.
fr: Est appelée chaque fois que l'analyseur rencontre une nouvelle déclaration d'espace de noms, avant le rappel ``start()`` pour l'élément d'ouverture qui le définit. *prefix* est ``''`` pour l'espace de noms par défaut et le nom du préfixe d'espace de noms déclaré dans le cas contraire. *uri* est l'URI de l'espace de noms.

source: Is called after the ``end()`` callback of an element that declared a namespace prefix mapping, with the name of the *prefix* that went out of scope.
fr: Est appelée après le rappel ``end()`` d'un élément qui a déclaré une correspondance de préfixe d'espace de noms, avec le nom du *prefix* qui passe hors de portée.

source: A `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_ writer. Arguments are the same as for the :func:`canonicalize` function. This class does not build a tree but translates the callback events directly into a serialised form using the *write* function.
fr: Écrivain `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_. Les arguments sont les mêmes que pour la fonction :func:`canonicalize`. Cette classe ne construit pas d'arborescence mais traduit les événements de rappel directement sous une forme sérialisée à l'aide de la fonction *write*.

source: XMLParser Objects
fr: Objets *XMLParser*

source: This class is the low-level building block of the module. It uses :mod:`xml.parsers.expat` for efficient, event-based parsing of XML. It can be fed XML data incrementally with the :meth:`feed` method, and parsing events are translated to a push API - by invoking callbacks on the *target* object. If *target* is omitted, the standard :class:`TreeBuilder` is used. If *encoding* [1]_ is given, the value overrides the encoding specified in the XML file.
fr: Cette classe est l’élément de base du module. Elle utilise :mod:`xml.parsers.expat` pour une analyse efficace du XML et fonctionne à base d'événements. Elle peut être alimentée en données XML de manière incrémentielle avec la méthode :meth:`feed`, et les événements d'analyse sont traduits en une API à flux poussé – en appelant les méthodes de rappel de l'objet *target*. Si *target* est omis, le :class:`TreeBuilder` standard est utilisé. Si *encoding* [1]_ est donné, la valeur remplace l'encodage spécifié dans le fichier XML.

source: Finishes feeding data to the parser. Returns the result of calling the ``close()`` method of the *target* passed during construction; by default, this is the toplevel document element.
fr: Termine l'envoi des données à l'analyseur. Renvoie le résultat de l'appel de la méthode ``close()`` de la *target* passée lors de la construction ; par défaut, il s'agit de l'élément de plus haut niveau du document.

source: Feeds data to the parser. *data* is encoded data.
fr: Fournit des données à l’analyseur. *data* est une donnée encodée.

source: :meth:`XMLParser.feed` calls *target*\'s ``start(tag, attrs_dict)`` method for each opening tag, its ``end(tag)`` method for each closing tag, and data is processed by method ``data(data)``. For further supported callback methods, see the :class:`TreeBuilder` class. :meth:`XMLParser.close` calls *target*\'s method ``close()``. :class:`XMLParser` can be used not only for building a tree structure. This is an example of counting the maximum depth of an XML file::
fr: :meth:`XMLParser.feed` appelle la méthode ``start(tag, attrs_dict)`` de *target* pour chaque balise d'ouverture, sa méthode ``end(tag)`` pour chaque balise de fermeture, et les données sont traitées par la méthode ``data(data)``. Pour d'autres méthodes de rappel prises en charge, consultez la classe :class:`TreeBuilder`. :meth:`XMLParser.close` appelle la méthode ``close()`` de *target*. :class:`XMLParser` peut être utilisée pour autre chose que seulement construire une structure arborescente. Voici un exemple de comptage de la profondeur maximale d'un fichier XML ::

source: XMLPullParser Objects
fr: Objets *XMLPullParser*

source: A pull parser suitable for non-blocking applications. Its input-side API is similar to that of :class:`XMLParser`, but instead of pushing calls to a callback target, :class:`XMLPullParser` collects an internal list of parsing events and lets the user read from it. *events* is a sequence of events to report back. The supported events are the strings ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` and ``"end-ns"`` (the "ns" events are used to get detailed namespace information). If *events* is omitted, only ``"end"`` events are reported.
fr: Analyseur à flux tiré adapté aux applications non bloquantes. Son API côté entrée est similaire à celle de :class:`XMLParser`, mais au lieu de pousser les appels vers une cible de rappel, :class:`XMLPullParser` collecte une liste interne d'événements d'analyse et permet à l'utilisateur de la lire. *events* est une séquence d'événements à signaler. Les événements pris en charge sont les chaînes ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` et ``"end-ns"`` (les événements ``"ns"`` sont utilisés pour obtenir des informations détaillées sur les espaces de noms). Si *events* est omis, seuls les événements ``"end"`` sont rapportés.

source: Feed the given bytes data to the parser.
fr: Transmet les données d’octets à l’analyseur.

source: Signal the parser that the data stream is terminated. Unlike :meth:`XMLParser.close`, this method always returns :const:`None`. Any events not yet retrieved when the parser is closed can still be read with :meth:`read_events`.
fr: Signale à l'analyseur que le flux de données est terminé. Contrairement à :meth:`XMLParser.close`, cette méthode renvoie toujours :const:`None`. Tous les événements non encore récupérés lorsque l'analyseur est fermé peuvent toujours être lus avec :meth:`read_events`.
