Repository: python/python-docs-fr
Catalog: library/xml.dom.po
Languages: fr

source: Raised when a specified range of text does not fit into a string. This is not known to be used in the Python DOM implementations, but may be received from DOM implementations not written in Python.
fr: Levée quand un intervalle spécifique de texte ne rentre pas dans une chaîne. Cette exception n'est pas réputée être utilisée par les implémentations DOM de Python mais elle peur être levée par des implémentations de DOM qui ne sont pas écrite en Python.

source: Raised when an attempt is made to insert a node where the node type is not allowed.
fr: Levée quand l'insertion d'un nœud est tentée dans un type de nœud incompatible.

source: Raised when an index or size parameter to a method is negative or exceeds the allowed values.
fr: Levée quand un index ou la taille d'un paramètre d'une méthode est négatif ou excède les valeurs autorisées.

source: Raised when an attempt is made to insert an :class:`Attr` node that is already present elsewhere in the document.
fr: Levée quand l'insertion d'un nœud :class:`Attr` est tenté alors que ce nœud est déjà présent ailleurs dans le document.

source: Raised if a parameter or an operation is not supported on the underlying object.
fr: Levée si un paramètre ou une opération n'est pas supporté par l'objet sous-jacent.

source: This exception is raised when a string parameter contains a character that is not permitted in the context it's being used in by the XML 1.0 recommendation. For example, attempting to create an :class:`Element` node with a space in the element type name will cause this error to be raised.
fr: Cette exception est levée quand un paramètre chaîne contient un caractère qui n'est pas autorisé dans le contexte utilisé par la recommandation XML 1.0. Par exemple, lors la tentative de création d'un nœud :class:`Element` avec un espace dans le nom de l'élément.

source: Raised when an attempt is made to modify the type of a node.
fr: Levée lors de la tentative de modifier le type de nœud.

source: Raised when an attempt is made to use an object that is not defined or is no longer usable.
fr: Levée quand une tentative est faite d'utiliser un objet non défini ou qui ne sont plus utilisables.

source: If an attempt is made to change any object in a way that is not permitted with regard to the `Namespaces in XML <https://www.w3.org/TR/REC-xml-names/>`_ recommendation, this exception is raised.
fr: Si une tentative est faite de changer un objet d'une manière qui n'est pas autorisée selon la recommandation `Namespaces in XML <https://www.w3.org/TR/REC-xml-names/>`_ , cette exception est levée.

source: Exception when a node does not exist in the referenced context. For example, :meth:`NamedNodeMap.removeNamedItem` will raise this if the node passed in does not exist in the map.
fr: Exception quand un nœud n'existe pas dans le contexte référencé. Par exemple, :meth:`NamedNodeMap.removeNamedItem` lèvera cette exception si le nœud passé n'appartient pas à la séquence.

source: Raised when the implementation does not support the requested type of object or operation.
fr: Levée si l'implémentation ne supporte pas le type d'objet requis ou l'opération.

source: This is raised if data is specified for a node which does not support data.
fr: Levée si la donnée spécifiée pour un nœud n'est pas supportée.

source: Raised on attempts to modify an object where modifications are not allowed (such as for read-only nodes).
fr: Levée lors de la tentative de modification sur objet où les modifications ne sont pas autorisées (tels que les nœuds en lecture seule).

source: Raised when an invalid or illegal string is specified.
fr: Levée quand une chaîne invalide ou illégale est spécifiée.

source: Raised when a node is inserted in a different document than it currently belongs to, and the implementation does not support migrating the node from one document to the other.
fr: Levée quand un nœud est inséré dans un document différent de celui auquel il appartient et que l'implémentation ne supporte pas la migration d'un document à un autre.

source: The exception codes defined in the DOM recommendation map to the exceptions described above according to this table:
fr: Les codes d'exceptions définis par la recommandation DOM avec leurs correspondances décrites si dessous selon ce tableau :

source: Constant
fr: Constante

source: Conformance
fr: Conformité

source: This section describes the conformance requirements and relationships between the Python DOM API, the W3C DOM recommendations, and the OMG IDL mapping for Python.
fr: Cette section décrit la conformité des pré requis et des relations entre l'API DOM de Python, les recommandations *W3C* DOM et les correspondances OMG IDL pour Python.

source: Type Mapping
fr: Correspondance des types

source: The IDL types used in the DOM specification are mapped to Python types according to the following table.
fr: Les types IDL utilisés dans la spécification DOM correspondent aux types Python selon le tableau suivant.

source: IDL Type
fr: Type IDL

source: Python Type
fr: Type Python

source: ``bool`` or ``int``
fr: ``bool`` ou ``int``

source: Accessor Methods
fr: Méthodes d'accès

source: The mapping from OMG IDL to Python defines accessor functions for IDL ``attribute`` declarations in much the way the Java mapping does. Mapping the IDL declarations ::
fr: Les correspondance de OMG IDL vers Python définissent des fonction d'accès pour les déclarations ``attribut`` d'IDL à la manière dont Java le fait. Correspondance des déclarations IDL ::

source: yields three accessor functions: a "get" method for :attr:`someValue` (:meth:`_get_someValue`), and "get" and "set" methods for :attr:`anotherValue` (:meth:`_get_anotherValue` and :meth:`_set_anotherValue`). The mapping, in particular, does not require that the IDL attributes are accessible as normal Python attributes: ``object.someValue`` is *not* required to work, and may raise an :exc:`AttributeError`.
fr: donne trois fonctions d'accès : une méthode *get* pour :attr:`someValue` (:meth:`_get_someValue`) et des méthodes *get* et *set* pour :attr:`anotherValue` (:meth:`_get_anotherValue` et :meth:`_set_anotherValue`). Le *mapping*, en particulier, ne requiert pas que les attributs IDL soient accessible comme des attributs Python normaux : ``object.someValue`` n'est *pas* requis de fonctionner et peut lever une :exc:`AttributeError`.

source: The Python DOM API, however, *does* require that normal attribute access work. This means that the typical surrogates generated by Python IDL compilers are not likely to work, and wrapper objects may be needed on the client if the DOM objects are accessed via CORBA. While this does require some additional consideration for CORBA DOM clients, the implementers with experience using DOM over CORBA from Python do not consider this a problem. Attributes that are declared ``readonly`` may not restrict write access in all DOM implementations.
fr: Cependant, l'API DOM de Python *impose* que les accès par attributs classiques fonctionnent. Par conséquent, les substituts générés par le compilateur IDL de Python ne fonctionneront probablement pas, et des objets façade pourraient être nécessaires côté client si les objets DOM sont manipulés via CORBA. Bien qu'utiliser un client DOM CORBA nécessite une bonne réflexion, les développeurs habitués et expérimentés à l'utilisation de CORBA ne considèrent pas que c'est un problème. Les attributs déclarés ``readonly`` pourraient ne pas voir leur accès en écriture restreint dans toutes les implémentations du DOM.

source: In the Python DOM API, accessor functions are not required. If provided, they should take the form defined by the Python IDL mapping, but these methods are considered unnecessary since the attributes are accessible directly from Python. "Set" accessors should never be provided for ``readonly`` attributes.
fr: Dans l'API DOM de Python, les fonctions d'accès ne sont pas requises. Si elles sont fournies, elles doivent prendre la forme définie par le *mapping* de Python IDL, mais ces méthodes sont considérées inutiles car les attributs sont directement accessible depuis Python. Les fonctions d'accès "Set" ne devraient jamais être fournies pour les attributs ``readonly`` (en lecture seule).

source: The IDL definitions do not fully embody the requirements of the W3C DOM API, such as the notion of certain objects, such as the return value of :meth:`getElementsByTagName`, being "live". The Python DOM API does not require implementations to enforce such requirements.
fr: Les définitions IDL n'embarquent pas entièrement les pré-requis de l'API de DOM API telle que la notion de objets ou que la valeur de retour de :meth:`getElementsByTagName` est dynamique. L'API DOM de Python ne requiert pas des implémentations d'avoir de tel pré-requis.
