Repository: python/python-docs-fr
Catalog: library/xml.sax.po
Languages: fr

source: :mod:`xml.sax` --- Support for SAX2 parsers
fr: :mod:`xml.sax` — Prise en charge des analyseurs SAX2

source: **Source code:** :source:`Lib/xml/sax/__init__.py`
fr: **Code source :** :source:`Lib/xml/sax/__init__.py`

source: The :mod:`xml.sax` package provides a number of modules which implement the Simple API for XML (SAX) interface for Python. The package itself provides the SAX exceptions and the convenience functions which will be most used by users of the SAX API.
fr: Le paquet :mod:`xml.sax` fournit des modules qui implémentent l'interface *Simple API for XML (SAX)* pour Python. Le paquet en lui même fournit les exceptions SAX et les fonctions les plus utiles qui seront le plus utilisées par les utilisateurs de SAX API.

source: The :mod:`xml.sax` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data see :ref:`xml-vulnerabilities`.
fr: Le module :mod:`xml.sax` n'est pas sécurisé contre les données construites de façon malveillante. Si vous avez besoin d'analyser des données non sécurisées ou non authentifiées, voir :ref:`xml-vulnerabilities`.

source: The SAX parser no longer processes general external entities by default to increase security. Before, the parser created network connections to fetch remote files or loaded local files from the file system for DTD and entities. The feature can be enabled again with method :meth:`~xml.sax.xmlreader.XMLReader.setFeature` on the parser object and argument :data:`~xml.sax.handler.feature_external_ges`.
fr: L'analyseur SAX ne traite plus les entités externes générales par défaut pour augmenter la sécurité. Auparavant, l'analyseur créait des connexions réseau pour extraire des fichiers distants ou des fichiers locaux chargés à partir du système de fichiers pour les DTD et les entités. La fonctionnalité peut être activée à nouveau avec la méthode :meth:`~xml.sax.xmlreader.XMLReader.setFeature` sur l'objet analyseur et l'argument :data:`~xml.sax.handler.feature_external_ges`.

source: The convenience functions are:
fr: Les fonctions les plus utiles sont:

source: Create and return a SAX :class:`~xml.sax.xmlreader.XMLReader` object. The first parser found will be used. If *parser_list* is provided, it must be a list of strings which name modules that have a function named :func:`create_parser`. Modules listed in *parser_list* will be used before modules in the default list of parsers.
fr: Crée et renvoie un objet SAX :class:`~xml.sax.xmlreader.XMLReader`. Le premier analyseur trouvé sera utilisé. Si *parser_list* est fourni, il doit être une liste de chaînes de caractères qui nomme des modules qui ont une fonction nommée :func:`create_parser`. Les modules listés dans *parser_list* seront utilisés avant les modules dans la liste par défaut des analyseurs.

source: Create a SAX parser and use it to parse a document. The document, passed in as *filename_or_stream*, can be a filename or a file object. The *handler* parameter needs to be a SAX :class:`~handler.ContentHandler` instance. If *error_handler* is given, it must be a SAX :class:`~handler.ErrorHandler` instance; if omitted, :exc:`SAXParseException` will be raised on all errors. There is no return value; all work must be done by the *handler* passed in.
fr: Crée un analyseur SAX et l'utilise pour analyser un document. Le document transmis comme *filename_or_stream*, peut être un nom de fichier ou un objet fichier. Le paramètre *handler* doit être une instance SAX :class:`~handler.ContentHandler`. Si un *error_handler* est donné, il doit être un SAX :class:`~handler.ErrorHandler` ; si omis, :exc:`SAXParseException` sera levé sur toutes les erreurs. Il n'y a pas de valeur de retour, tout le travail doit être fait par le *handler* transmis.

source: Similar to :func:`parse`, but parses from a buffer *string* received as a parameter. *string* must be a :class:`str` instance or a :term:`bytes-like object`.
fr: Similaire à :func:`parse`, mais qui analyse à partir d'un espace mémoire *string* reçu en tant que paramètre. *string* doit être une instance :class:`str` ou un objet :term:`bytes-like object`.

source: Added support of :class:`str` instances.
fr: Ajout du support des instances :class:`str`.

source: A typical SAX application uses three kinds of objects: readers, handlers and input sources. "Reader" in this context is another term for parser, i.e. some piece of code that reads the bytes or characters from the input source, and produces a sequence of events. The events then get distributed to the handler objects, i.e. the reader invokes a method on the handler. A SAX application must therefore obtain a reader object, create or open the input sources, create the handlers, and connect these objects all together. As the final step of preparation, the reader is called to parse the input. During parsing, methods on the handler objects are called based on structural and syntactic events from the input data.
fr: Une application SAX typique utilise trois types d'objets: les *readers*, les *handlers* et les sources d'entrée. "Reader" dans ce contexte est un autre terme pour le analyseur, c'est-à-dire un morceau de code qui lit les octets ou les caractères de la source d'entrée et qui produit une séquence d'événements. Les événements sont ensuite distribués aux objets du *handler*, c'est-à-dire que le lecteur appelle une méthode sur le *handler*. L'application doit donc obtenir un objet *reader*, créer ou ouvrir les sources d'entrée, créer les *handlers* et connecter ces objets tous ensemble. La dernière étape de la préparation, le *reader* est appelé à analyser l'entrée. Pendant l'analyse, les méthodes sur les objets du *handler* sont appelées en fonction d'événements structurels et syntaxiques à partir des données d'entrée.

source: For these objects, only the interfaces are relevant; they are normally not instantiated by the application itself. Since Python does not have an explicit notion of interface, they are formally introduced as classes, but applications may use implementations which do not inherit from the provided classes. The :class:`~xml.sax.xmlreader.InputSource`, :class:`~xml.sax.xmlreader.Locator`, :class:`~xml.sax.xmlreader.Attributes`, :class:`~xml.sax.xmlreader.AttributesNS`, and :class:`~xml.sax.xmlreader.XMLReader` interfaces are defined in the module :mod:`xml.sax.xmlreader`. The handler interfaces are defined in :mod:`xml.sax.handler`. For convenience, :class:`~xml.sax.xmlreader.InputSource` (which is often instantiated directly) and the handler classes are also available from :mod:`xml.sax`. These interfaces are described below.
fr: Pour ces objets, seules les interfaces sont pertinentes; elles ne sont pas normalement instanciées par l'application elle-même. Puisque Python n'a pas de notion explicite d'interface, elles sont formellement introduites en tant que classes, mais les applications peuvent utiliser des implémentations qui n'héritent pas des classes fournies. Les interfaces :class:`~xml.sax.xmlreader.InputSource`, :class:`~xml.sax.xmlreader.Locator`, :class:`~xml.sax.xmlreader.Attributes`, :class:`~xml.sax.xmlreader.AttributesNS`, et :class:`~xml.sax.xmlreader.XMLReader` sont définies dans le module :mod:`xml.sax.xmlreader`. Les interfaces du *handler* sont définies dans :mod:`xml.sax.handler`. Pour plus de commodité, :class:`xml.sax.xmlreader.InputSource` (qui est souvent instancié directement) et les classes du *handler* sont également disponibles à partir de :mod:`xml.sax`. Ces interfaces sont décrites ci-dessous.

source: In addition to these classes, :mod:`xml.sax` provides the following exception classes.
fr: En plus de ces classes, :mod:`xml.sax` fournit les classes d'exceptions suivantes.

source: Encapsulate an XML error or warning. This class can contain basic error or warning information from either the XML parser or the application: it can be subclassed to provide additional functionality or to add localization. Note that although the handlers defined in the :class:`~xml.sax.handler.ErrorHandler` interface receive instances of this exception, it is not required to actually raise the exception --- it is also useful as a container for information.
fr: Encapsule une erreur ou un avertissement XML. Cette classe peut contenir une erreur de base ou une information d'avertissement soit du analyseur XML ou de l'application: elle peut être sous-classée pour fournir des fonctionnalités supplémentaires ou pour ajouter une localisation. Noter que même si les *handlers* définis dans l'interface :class:`~xml.sax.handler.ErrorHandler` reçoivent des instances de cette exception, ce n'est pas nécessaire de lever l'exception --- il est également utile en tant que conteneur pour l'information.

source: When instantiated, *msg* should be a human-readable description of the error. The optional *exception* parameter, if given, should be ``None`` or an exception that was caught by the parsing code and is being passed along as information.
fr: Quand instancié, *msg* devrait être une description lisible par l'homme de l'erreur. Le paramètre optionnel *exception*, s'il est donné, devrait être ``None`` ou une exception qui a été interceptée par le code d'analyse et qui est transmise comme information.

source: This is the base class for the other SAX exception classes.
fr: Ceci est la classe de base pour les autres classes d'exception SAX.

source: Subclass of :exc:`SAXException` raised on parse errors. Instances of this class are passed to the methods of the SAX :class:`~xml.sax.handler.ErrorHandler` interface to provide information about the parse error. This class supports the SAX :class:`~xml.sax.xmlreader.Locator` interface as well as the :class:`SAXException` interface.
fr: Sous-classe de :exc:`SAXException` élevée sur les erreurs d'analyse. Les instances de cette classe sont passées aux méthodes de l'interface SAX :class:`~xml.sax.handler.ErrorHandler` pour fournir des informations sur l'erreur d'analyse. Cette classe supporte aussi l'interface SAX :class:`~xml.sax.xmlreader.Locator` comme l'interface :class:`SAXException`.

source: Subclass of :exc:`SAXException` raised when a SAX :class:`~xml.sax.xmlreader.XMLReader` is confronted with an unrecognized feature or property. SAX applications and extensions may use this class for similar purposes.
fr: Sous-classe de :exc:`SAXException` levée quand un SAX :class:`~xml.sax.xmlreader. XMLReader` est confronté à une caractéristique ou à une propriété non reconnue. Les applications et les extensions SAX peuvent utiliser cette classe à des fins similaires.

source: Subclass of :exc:`SAXException` raised when a SAX :class:`~xml.sax.xmlreader.XMLReader` is asked to enable a feature that is not supported, or to set a property to a value that the implementation does not support. SAX applications and extensions may use this class for similar purposes.
fr: Sous-classe de :exc:`SAXException` levée quand un SAX :class:`~xml.sax.xmlreader.XMLReader` est demandé pour activer une fonctionnalité qui n'est pas supportée, ou pour définir une propriété à une valeur que l'implémentation ne prend pas en charge. Les applications et les extensions SAX peuvent utiliser cette classe à des fins similaires.

source: `SAX: The Simple API for XML <http://www.saxproject.org/>`_
fr: `SAX: L'API simple pour XML <http://www.saxproject.org/>`_

source: This site is the focal point for the definition of the SAX API. It provides a Java implementation and online documentation. Links to implementations and historical information are also available.
fr: Ce site est le point focal pour la définition de l'API SAX. Il offre une implémentation Java et une documentation en ligne. Des liens pour l'implémentation et des informations historiques sont également disponibles.

source: Definitions of the interfaces for application-provided objects.
fr: Définitions des interfaces pour les objets fournis par l'application.

source: Convenience functions for use in SAX applications.
fr: Fonctions pratiques pour une utilisation dans les applications SAX.

source: Definitions of the interfaces for parser-provided objects.
fr: Définitions des interfaces pour les objets fournis par l'analyseur.

source: SAXException Objects
fr: Les objets SAXException

source: The :class:`SAXException` exception class supports the following methods:
fr: La classe d'exception :class:`SAXException` supporte les méthodes suivantes :

source: Return a human-readable message describing the error condition.
fr: Renvoyer un message lisible par l'homme décrivant la condition d'erreur.

source: Return an encapsulated exception object, or ``None``.
fr: Renvoie un objet d'exception encapsulé, ou``None``.
