Repository: python/python-docs-fr
Catalog: library/zipapp.po
Languages: fr

source: For a fully standalone distribution, you can distribute the launcher with your application appended, bundled with the Python "embedded" distribution. This will run on any PC with the appropriate architecture (32 bit or 64 bit).
fr: Pour une distribution entièrement autonome vous pouvez distribuer le lanceur avec votre application en fin de fichier, empaqueté avec la distribution *embedded* Python. Ceci fonctionnera sur n'importe quel ordinateur avec l'architecture appropriée (32 bits ou 64 bits).

source: Caveats
fr: Mises en garde

source: There are some limitations to the process of bundling your application into a single file. In most, if not all, cases they can be addressed without needing major changes to your application.
fr: Il y a certaines limites à l'empaquetage de votre application dans un seul fichier. Dans la plupart des cas, si ce n'est tous, elles peuvent être traitées sans qu'il soit nécessaire d'apporter de modifications majeures à votre application.

source: If your application depends on a package that includes a C extension, that package cannot be run from a zip file (this is an OS limitation, as executable code must be present in the filesystem for the OS loader to load it). In this case, you can exclude that dependency from the zipfile, and either require your users to have it installed, or ship it alongside your zipfile and add code to your ``__main__.py`` to include the directory containing the unzipped module in ``sys.path``. In this case, you will need to make sure to ship appropriate binaries for your target architecture(s) (and potentially pick the correct version to add to ``sys.path`` at runtime, based on the user's machine).
fr: Si votre application dépend d'un paquet qui inclut une extension C, ce paquet ne peut pas être exécuté à partir d'un fichier zip (c'est une limitation du système d'exploitation, car le code exécutable doit être présent dans le système de fichiers pour que le lanceur de l'OS puisse le charger). Dans ce cas, vous pouvez exclure cette dépendance du fichier zip et, soit demander à vos utilisateurs de l'installer, soit la fournir avec votre fichier zip et ajouter du code à votre fichier ``__main__.py`` pour inclure le répertoire contenant le module décompressé dans ``sys.path``. Dans ce cas, vous devrez vous assurer d'envoyer les binaires appropriés pour votre ou vos architecture(s) cible(s) (et éventuellement choisir la bonne version à ajouter à ``sys.path`` au moment de l'exécution, basée sur la machine de l'utilisateur).

source: If you are shipping a Windows executable as described above, you either need to ensure that your users have ``python3.dll`` on their PATH (which is not the default behaviour of the installer) or you should bundle your application with the embedded distribution.
fr: Si vous livrez un exécutable Windows comme décrit ci-dessus, vous devez vous assurer que vos utilisateurs ont ``python3.dll`` sur leur PATH (ce qui n'est pas le comportement par défaut de l'installateur) ou vous devez inclure la distribution intégrée dans votre application.

source: The suggested launcher above uses the Python embedding API. This means that in your application, ``sys.executable`` will be your application, and *not* a conventional Python interpreter. Your code and its dependencies need to be prepared for this possibility. For example, if your application uses the :mod:`multiprocessing` module, it will need to call :func:`multiprocessing.set_executable` to let the module know where to find the standard Python interpreter.
fr: Le lanceur suggéré ci-dessus utilise l'API d'intégration Python. Cela signifie que dans votre application ``sys.executable`` sera votre application et *pas* un interpréteur Python classique. Votre code et ses dépendances doivent être préparés à cette possibilité. Par exemple, si votre application utilise le module :mod:`multiprocessing`, elle devra appeler :func:`multiprocessing.set_executable` pour que le module sache où trouver l'interpréteur Python standard.

source: The Python Zip Application Archive Format
fr: Le format d'archive d'application Zip Python

source: Python has been able to execute zip files which contain a ``__main__.py`` file since version 2.6. In order to be executed by Python, an application archive simply has to be a standard zip file containing a ``__main__.py`` file which will be run as the entry point for the application. As usual for any Python script, the parent of the script (in this case the zip file) will be placed on :data:`sys.path` and thus further modules can be imported from the zip file.
fr: Python est capable d'exécuter des fichiers zip qui contiennent un fichier ``__main__.py`` depuis la version 2.6. Pour être exécutée par Python, une archive d'application doit simplement être un fichier zip standard contenant un fichier ``__main__.py`` qui sera exécuté comme point d'entrée de l'application. Comme d'habitude pour tout script Python, le parent du script (dans ce cas le fichier zip) sera placé sur :data:`sys.path` et ainsi d'autres modules pourront être importés depuis le fichier zip.

source: The zip file format allows arbitrary data to be prepended to a zip file. The zip application format uses this ability to prepend a standard POSIX "shebang" line to the file (``#!/path/to/interpreter``).
fr: Le format de fichier zip permet d'ajouter des données arbitraires à un fichier zip. Le format de l'application zip utilise cette possibilité pour préfixer une ligne *shebang* POSIX standard dans le fichier (``#!/path/to/interpreter``).

source: Formally, the Python zip application format is therefore:
fr: Formellement, le format d'application zip de Python est donc :

source: An optional shebang line, containing the characters ``b'#!'`` followed by an interpreter name, and then a newline (``b'\n'``) character. The interpreter name can be anything acceptable to the OS "shebang" processing, or the Python launcher on Windows. The interpreter should be encoded in UTF-8 on Windows, and in :func:`sys.getfilesystemencoding()` on POSIX.
fr: Une ligne *shebang* facultative, contenant les caractères ``b'#!`` suivis d'un nom d’interpréteur, puis un caractère fin de ligne (``b'\n'``). Le nom de l'interpréteur peut être n'importe quoi acceptable pour le traitement *shebang* de l'OS, ou le lanceur Python sous Windows. L'interpréteur doit être encodé en UTF-8 sous Windows, et en :func:`sys.getfilesystemencoding()` sur POSIX.

source: Standard zipfile data, as generated by the :mod:`zipfile` module. The zipfile content *must* include a file called ``__main__.py`` (which must be in the "root" of the zipfile - i.e., it cannot be in a subdirectory). The zipfile data can be compressed or uncompressed.
fr: Des données *zipfile* standards, telles que générées par le module :mod:`zipfile`. Le contenu du fichier zip *doit* inclure un fichier appelé ``__main__.py`` (qui doit se trouver à la racine du fichier zip — c'est-à-dire qu'il ne peut se trouver dans un sous-répertoire). Les données du fichier zip peuvent être compressées ou non.

source: If an application archive has a shebang line, it may have the executable bit set on POSIX systems, to allow it to be executed directly.
fr: Si une archive d'application a une ligne *shebang*, elle peut avoir le bit exécutable activé sur les systèmes POSIX, pour lui permettre d'être exécutée directement.

source: There is no requirement that the tools in this module are used to create application archives - the module is a convenience, but archives in the above format created by any means are acceptable to Python.
fr: Vous pouvez créer des archives d'applications sans utiliser les outils de ce module — le module existe pour faciliter les choses, mais les archives, créées par n'importe quel moyen tout en respectant le format ci-dessus, sont valides pour Python.
