Repository: python/python-docs-fr
Catalog: library/zipapp.po
Languages: fr

source: :mod:`zipapp` --- Manage executable Python zip archives
fr: :mod:`zipapp` — Gestion des archives zip exécutables Python

source: **Source code:** :source:`Lib/zipapp.py`
fr: **Code source :** :source:`Lib/zipapp.py`

source: This module provides tools to manage the creation of zip files containing Python code, which can be :ref:`executed directly by the Python interpreter <using-on-interface-options>`. The module provides both a :ref:`zipapp-command-line-interface` and a :ref:`zipapp-python-api`.
fr: Ce module fournit des outils pour gérer la création de fichiers zip contenant du code Python, qui peuvent être :ref:`exécutés directement par l'interpréteur Python <using-on-interface-options>`. Le module fournit à la fois une interface de ligne de commande :ref:`zipapp-command-line-interface` et une interface :ref:`zipapp-python-api`.

source: Basic Example
fr: Exemple de base

source: The following example shows how the :ref:`zipapp-command-line-interface` can be used to create an executable archive from a directory containing Python code. When run, the archive will execute the ``main`` function from the module ``myapp`` in the archive.
fr: L'exemple suivant montre comment l'interface de ligne de commande :ref:`zipapp-command-line-interface` peut être utilisée pour créer une archive exécutable depuis un répertoire contenant du code Python. Lors de l'exécution, l'archive exécutera la fonction ``main`` du module ``myapp`` dans l'archive.

source: Command-Line Interface
fr: Interface en ligne de commande

source: When called as a program from the command line, the following form is used:
fr: Lorsqu'il est appelé en tant que programme à partir de la ligne de commande, la syntaxe suivante est utilisée :

source: If *source* is a directory, this will create an archive from the contents of *source*. If *source* is a file, it should be an archive, and it will be copied to the target archive (or the contents of its shebang line will be displayed if the --info option is specified).
fr: Si *source* est un répertoire, une archive est créée à partir du contenu de *source*. Si *source* est un fichier, ce doit être une archive et il est copié dans l'archive cible (ou le contenu de sa ligne `shebang` est affiché si l'option ``--info`` est indiquée).

source: The following options are understood:
fr: Les options suivantes sont disponibles :

source: Write the output to a file named *output*. If this option is not specified, the output filename will be the same as the input *source*, with the extension ``.pyz`` added. If an explicit filename is given, it is used as is (so a ``.pyz`` extension should be included if required).
fr: Écrire la sortie dans un fichier nommé *output*. Si cette option n'est pas spécifiée, le nom du fichier de sortie sera le même que celui de l'entrée *source*, avec l'extension ``.pyz``. Si un nom de fichier explicite est donné, il est utilisé tel quel (une extension ``.pyz`` doit donc être incluse si nécessaire).

source: An output filename must be specified if the *source* is an archive (and in that case, *output* must not be the same as *source*).
fr: Un nom de fichier de sortie doit être spécifié si la *source* est une archive (et dans ce cas, la *sortie* ne doit pas être la même que la *source*).

source: Add a ``#!`` line to the archive specifying *interpreter* as the command to run. Also, on POSIX, make the archive executable. The default is to write no ``#!`` line, and not make the file executable.
fr: Ajoute une ligne ``#!`` à l'archive en spécifiant *interpreter* comme commande à exécuter. Aussi, sur un système POSIX, cela rend l'archive exécutable. Le comportement par défaut est de ne pas écrire la ligne ``#!`` et de ne pas rendre le fichier exécutable.

source: Write a ``__main__.py`` file to the archive that executes *mainfn*. The *mainfn* argument should have the form "pkg.mod:fn", where "pkg.mod" is a package/module in the archive, and "fn" is a callable in the given module. The ``__main__.py`` file will execute that callable.
fr: Écrit un fichier ``__main__.py`` dans l'archive qui exécute *mainfn*. L'argument *mainfn* est de la forme « *pkg.mod:fn* », où « pkg.mod » est un paquet/module dans l'archive, et « *fn* » est un appelable dans le module donné. Le fichier ``__main__.py`` réalise cet appel.

source: :option:`--main` cannot be specified when copying an archive.
fr: :option:`--main` ne peut pas être spécifié lors de la copie d'une archive.

source: Compress files with the deflate method, reducing the size of the output file. By default, files are stored uncompressed in the archive.
fr: Compresse les fichiers avec la méthode *deflate*, réduisant ainsi la taille du fichier de sortie. Par défaut, les fichiers sont stockés non compressés dans l'archive.

source: :option:`--compress` has no effect when copying an archive.
fr: :option:`--compress` n'a aucun effet lors de la copie d'une archive.

source: Display the interpreter embedded in the archive, for diagnostic purposes. In this case, any other options are ignored and SOURCE must be an archive, not a directory.
fr: Affiche l'interpréteur intégré dans l'archive, à des fins de diagnostic. Dans ce cas, toutes les autres options sont ignorées et SOURCE doit être une archive et non un répertoire.

source: Print a short usage message and exit.
fr: Affiche un court message d'aide et quitte.

source: Python API
fr: API Python

source: The module defines two convenience functions:
fr: Ce module définit deux fonctions utilitaires :

source: Create an application archive from *source*. The source can be any of the following:
fr: Crée une archive d'application à partir de *source*. La source peut être l'une des sources suivantes :

source: The name of a directory, or a :term:`path-like object` referring to a directory, in which case a new application archive will be created from the content of that directory.
fr: Le nom d'un répertoire, ou un :term:`path-like object` se référant à un répertoire, auquel cas une nouvelle archive d'application sera créée à partir du contenu de ce répertoire.

source: The name of an existing application archive file, or a :term:`path-like object` referring to such a file, in which case the file is copied to the target (modifying it to reflect the value given for the *interpreter* argument). The file name should include the ``.pyz`` extension, if required.
fr: Le nom d'un fichier d'archive d'application existant, ou un :term:`path-like object` se référant à un tel fichier, auquel cas le fichier est copié sur la cible (en le modifiant pour refléter la valeur donnée à l'argument *interpreter*). Le nom du fichier doit inclure l'extension ``.pyz``, si nécessaire.

source: A file object open for reading in bytes mode. The content of the file should be an application archive, and the file object is assumed to be positioned at the start of the archive.
fr: Un objet fichier ouvert pour la lecture en mode binaire. Le contenu du fichier doit être une archive d'application et Python suppose que l'objet fichier est positionné au début de l'archive.

source: The *target* argument determines where the resulting archive will be written:
fr: L'argument *target* détermine où l'archive résultante sera écrite :

source: If it is the name of a file, or a :term:`path-like object`, the archive will be written to that file.
fr: S'il s'agit d'un nom de fichier, ou d'un :term:`path-like object`, l'archive sera écrite dans ce fichier.

source: If it is an open file object, the archive will be written to that file object, which must be open for writing in bytes mode.
fr: S'il s'agit d'un objet fichier ouvert, l'archive sera écrite dans cet objet fichier, qui doit être ouvert pour l'écriture en mode octets.

source: If the target is omitted (or ``None``), the source must be a directory and the target will be a file with the same name as the source, with a ``.pyz`` extension added.
fr: Si la cible est omise (ou ``None``), la source doit être un répertoire et la cible sera un fichier portant le même nom que la source, avec une extension ``.pyz`` ajoutée.

source: The *interpreter* argument specifies the name of the Python interpreter with which the archive will be executed. It is written as a "shebang" line at the start of the archive. On POSIX, this will be interpreted by the OS, and on Windows it will be handled by the Python launcher. Omitting the *interpreter* results in no shebang line being written. If an interpreter is specified, and the target is a filename, the executable bit of the target file will be set.
fr: L'argument *interpreter* spécifie le nom de l'interpréteur Python avec lequel l'archive sera exécutée. Il est écrit dans une ligne *shebang* au début de l'archive. Sur un système POSIX, cela est interprété par le système d'exploitation et, sur Windows, il sera géré par le lanceur Python. L'omission de l'*interpreter* n'entraîne pas l'écriture d'une ligne *shebang*. Si un interpréteur est spécifié et que la cible est un nom de fichier, le bit exécutable du fichier cible sera mis à 1.

source: The *main* argument specifies the name of a callable which will be used as the main program for the archive. It can only be specified if the source is a directory, and the source does not already contain a ``__main__.py`` file. The *main* argument should take the form "pkg.module:callable" and the archive will be run by importing "pkg.module" and executing the given callable with no arguments. It is an error to omit *main* if the source is a directory and does not contain a ``__main__.py`` file, as otherwise the resulting archive would not be executable.
fr: L'argument *main* spécifie le nom d'un appelable, utilisé comme programme principal pour l'archive. Il ne peut être spécifié que si la source est un répertoire, et si la source ne contient pas déjà un fichier ``__main__.py``. L'argument *main* doit prendre la forme ``pkg.module:callable`` et l'archive sera exécutée en important ``pkg.module`` et en exécutant l'appelable donné sans argument. Omettre *main* est une erreur si la source est un répertoire et ne contient pas un fichier ``__main__.py``, car dans ce cas l'archive résultante ne serait pas exécutable.

source: The optional *filter* argument specifies a callback function that is passed a Path object representing the path to the file being added (relative to the source directory). It should return ``True`` if the file is to be added.
fr: L'argument optionnel *filter* spécifie une fonction de rappel qui est passée par un objet *Path* représentant le chemin du fichier ajouté (par rapport au répertoire source). Elle doit renvoyer ``True`` si le fichier doit être ajouté.

source: The optional *compressed* argument determines whether files are compressed. If set to ``True``, files in the archive are compressed with the deflate method; otherwise, files are stored uncompressed. This argument has no effect when copying an existing archive.
fr: L'argument optionnel *compressed* détermine si les fichiers sont compressés. S'il vaut ``True``, les fichiers de l'archive sont compressés avec l'algorithme *deflate* ; sinon, les fichiers sont stockés non compressés. Cet argument n'a aucun effet lors de la copie d'une archive existante.

source: If a file object is specified for *source* or *target*, it is the caller's responsibility to close it after calling create_archive.
fr: Si un objet fichier est spécifié pour *source* ou *target*, il est de la responsabilité de l'appelant de le fermer après avoir appelé ``create_archive``.

source: When copying an existing archive, file objects supplied only need ``read`` and ``readline``, or ``write`` methods. When creating an archive from a directory, if the target is a file object it will be passed to the ``zipfile.ZipFile`` class, and must supply the methods needed by that class.
fr: Lors de la copie d'une archive existante, les objets fichier fournis n'ont besoin que des méthodes ``read`` et ``readline`` ou ``write``. Lors de la création d'une archive à partir d'un répertoire, si la cible est un objet fichier, elle sera passée à la classe ``zipfile.ZipFile`` et devra fournir les méthodes nécessaires à cette classe.

source: Added the *filter* and *compressed* arguments.
fr: Ajout des arguments *filter* et *compressed*.

source: Return the interpreter specified in the ``#!`` line at the start of the archive. If there is no ``#!`` line, return :const:`None`. The *archive* argument can be a filename or a file-like object open for reading in bytes mode. It is assumed to be at the start of the archive.
fr: Renvoie l'interpréteur spécifié dans la ligne ``#!`` au début de l'archive. S'il n'y a pas de ligne ``#!``, renvoie :const:`None`. L'argument *archive* peut être un nom de fichier ou un objet de type fichier ouvert à la lecture en mode binaire. Python suppose qu'il est au début de l'archive.

source: Examples
fr: Exemples

source: Pack up a directory into an archive, and run it.
fr: Regroupe le contenu d'un répertoire dans une archive, et l'exécute.

source: The same can be done using the :func:`create_archive` function::
fr: La même chose peut être faite en utilisant la fonction :func:`create_archive` : ::

source: To make the application directly executable on POSIX, specify an interpreter to use.
fr: Pour rendre l'application directement exécutable sur un système POSIX, spécifiez un interpréteur à utiliser.

source: To replace the shebang line on an existing archive, create a modified archive using the :func:`create_archive` function::
fr: Pour remplacer la ligne *shebang* sur une archive existante, créez une archive modifiée en utilisant la fonction :func:`create_archive` : ::

source: To update the file in place, do the replacement in memory using a :class:`BytesIO` object, and then overwrite the source afterwards. Note that there is a risk when overwriting a file in place that an error will result in the loss of the original file. This code does not protect against such errors, but production code should do so. Also, this method will only work if the archive fits in memory::
fr: Pour mettre à jour le fichier sans créer de copie locale, effectuez le remplacement en mémoire à l'aide d'un objet :class:`BytesIO`, puis écrasez la source par la suite. Notez qu'il y a un risque lors de l'écrasement d'un fichier local qu'une erreur entraîne la perte du fichier original. Ce code ne protège pas contre de telles erreurs mais si vous le faites en production, vous devriez vous assurer de le faire. De plus, cette méthode ne fonctionnera que si l'archive tient en mémoire : ::

source: Specifying the Interpreter
fr: Spécification de l'interprète

source: Note that if you specify an interpreter and then distribute your application archive, you need to ensure that the interpreter used is portable. The Python launcher for Windows supports most common forms of POSIX ``#!`` line, but there are other issues to consider:
fr: Notez que si vous spécifiez un interpréteur et que vous distribuez ensuite votre archive d'application, vous devez vous assurer que l'interpréteur utilisé est portable. Le lanceur Python pour Windows gère la plupart des formes courantes de la ligne POSIX ``#!``, mais il y a d'autres problèmes à considérer :

source: If you use "/usr/bin/env python" (or other forms of the "python" command, such as "/usr/bin/python"), you need to consider that your users may have either Python 2 or Python 3 as their default, and write your code to work under both versions.
fr: Si vous utilisez ``/usr/bin/env python`` (ou d'autres formes de la commande *python*, comme ``/usr/bin/python``), vous devez considérer que vos utilisateurs peuvent avoir Python 2 ou Python 3 par défaut, et écrire votre code pour fonctionner dans les deux versions.

source: If you use an explicit version, for example "/usr/bin/env python3" your application will not work for users who do not have that version. (This may be what you want if you have not made your code Python 2 compatible).
fr: Si vous utilisez une version explicite, par exemple ``/usr/bin/env python3`` votre application ne fonctionnera pas pour les utilisateurs qui n'ont pas cette version. (C'est peut-être ce que vous voulez si vous n'avez pas rendu votre code compatible Python 2).

source: There is no way to say "python X.Y or later", so be careful of using an exact version like "/usr/bin/env python3.4" as you will need to change your shebang line for users of Python 3.5, for example.
fr: Il n'y a aucun moyen de dire « python X.Y ou supérieur » donc faites attention si vous utilisez une version exacte comme ``/usr/bin/env python3.4`` car vous devrez changer votre ligne *shebang* pour les utilisateurs de Python 3.5, par exemple.

source: Typically, you should use an "/usr/bin/env python2" or "/usr/bin/env python3", depending on whether your code is written for Python 2 or 3.
fr: Normalement, vous devriez utiliser un ``/usr/bin/env python2`` ou ``/usr/bin/env python3``, selon que votre code soit écrit pour Python 2 ou 3.

source: Creating Standalone Applications with zipapp
fr: Création d'applications autonomes avec *zipapp*

source: Using the :mod:`zipapp` module, it is possible to create self-contained Python programs, which can be distributed to end users who only need to have a suitable version of Python installed on their system. The key to doing this is to bundle all of the application's dependencies into the archive, along with the application code.
fr: En utilisant le module :mod:`zipapp`, il est possible de créer des programmes Python autonomes qui peuvent être distribués aux utilisateurs finaux qui n'ont besoin d'avoir qu'une version appropriée de Python installée sur leur système. La clé pour se faire est de regrouper toutes les dépendances de l'application dans l'archive avec le code source de l'application.

source: The steps to create a standalone archive are as follows:
fr: Les étapes pour créer une archive autonome sont les suivantes :

source: Create your application in a directory as normal, so you have a ``myapp`` directory containing a ``__main__.py`` file, and any supporting application code.
fr: Créez votre application dans un répertoire comme d'habitude, de manière à avoir un répertoire ``myapp`` contenant un fichier ``__main__.py`` et tout le code de l'application correspondante.

source: Install all of your application's dependencies into the ``myapp`` directory, using pip:
fr: Installez toutes les dépendances de votre application dans le répertoire ``myapp`` en utilisant *pip* :

source: (this assumes you have your project requirements in a ``requirements.txt`` file - if not, you can just list the dependencies manually on the pip command line).
fr: (ceci suppose que vous ayez vos dépendances de projet dans un fichier ``requirements.txt`` — sinon vous pouvez simplement lister les dépendances manuellement sur la ligne de commande *pip*).

source: Optionally, delete the ``.dist-info`` directories created by pip in the ``myapp`` directory. These hold metadata for pip to manage the packages, and as you won't be making any further use of pip they aren't required - although it won't do any harm if you leave them.
fr: Si nécessaire, supprimez les répertoires ``.dist-info`` créés par *pip* dans le répertoire ``myapp``. Ceux-ci contiennent des métadonnées pour *pip* afin de gérer les paquets, et comme vous n'utiliserez plus *pip*, ils ne sont pas nécessaires (ils n'ont pas de conséquences si vous les laissez).

source: Package the application using:
fr: Regroupez le tout à l'aide de :

source: This will produce a standalone executable, which can be run on any machine with the appropriate interpreter available. See :ref:`zipapp-specifying-the-interpreter` for details. It can be shipped to users as a single file.
fr: Cela produira un exécutable autonome qui peut être exécuté sur n'importe quelle machine avec l'interpréteur approprié disponible. Voir :ref:`zipapp-specifying-the-interpreter` pour plus de détails. Il peut être envoyé aux utilisateurs sous la forme d'un seul fichier.

source: On Unix, the ``myapp.pyz`` file is executable as it stands. You can rename the file to remove the ``.pyz`` extension if you prefer a "plain" command name. On Windows, the ``myapp.pyz[w]`` file is executable by virtue of the fact that the Python interpreter registers the ``.pyz`` and ``.pyzw`` file extensions when installed.
fr: Sous Unix, le fichier ``myapp.pyz`` est exécutable tel quel. Vous pouvez renommer le fichier pour supprimer l'extension ``.pyz`` si vous préférez un nom de commande « simple ». Sous Windows, le fichier ``myapp.pyz[w]`` est exécutable en vertu du fait que l'interpréteur Python est associé aux extensions de fichier ``.pyz`` et ``.pyzw`` une fois installé.

source: Making a Windows executable
fr: Création d'un exécutable Windows

source: On Windows, registration of the ``.pyz`` extension is optional, and furthermore, there are certain places that don't recognise registered extensions "transparently" (the simplest example is that ``subprocess.run(['myapp'])`` won't find your application - you need to explicitly specify the extension).
fr: Sous Windows, l'association de Python à l'extension ``.pyz`` est facultative et, de plus, il y a certains mécanismes qui ne reconnaissent pas les extensions enregistrées de manière « transparente » (l'exemple le plus simple est que ``subprocess.run(['myapp'])`` ne trouvera pas votre application — vous devez explicitement spécifier l'extension).

source: On Windows, therefore, it is often preferable to create an executable from the zipapp. This is relatively easy, although it does require a C compiler. The basic approach relies on the fact that zipfiles can have arbitrary data prepended, and Windows exe files can have arbitrary data appended. So by creating a suitable launcher and tacking the ``.pyz`` file onto the end of it, you end up with a single-file executable that runs your application.
fr: Sous Windows, il est donc souvent préférable de créer un exécutable à partir du *zipapp*. C'est relativement facile bien que cela nécessite un compilateur C. L'approche de base repose sur le fait que les fichiers zip peuvent avoir des données arbitraires au début et les fichiers *exe* de Windows peuvent avoir des données arbitraires à la fin. Ainsi, en créant un lanceur approprié et en rajoutant le fichier ``.pyz`` à sa fin, vous obtenez un fichier unique qui exécute votre application.

source: A suitable launcher can be as simple as the following::
fr: Un lanceur approprié peut être aussi simple que ce qui suit : ::

source: If you define the ``WINDOWS`` preprocessor symbol, this will generate a GUI executable, and without it, a console executable.
fr: Si vous définissez le symbole du préprocesseur ``WINDOWS`` cela va générer un exécutable IUG, et sans lui, un exécutable console.

source: To compile the executable, you can either just use the standard MSVC command line tools, or you can take advantage of the fact that distutils knows how to compile Python source::
fr: Pour compiler l'exécutable, vous pouvez soit simplement utiliser les outils standards en ligne de commande *MSVC*, soit profiter du fait que *distutils* sait comment compiler les sources Python: ::

source: The resulting launcher uses the "Limited ABI", so it will run unchanged with any version of Python 3.x. All it needs is for Python (``python3.dll``) to be on the user's ``PATH``.
fr: Le lanceur résultant utilise le « Limited ABI » donc il fonctionnera sans changement avec n'importe quelle version de Python 3.x. Tout ce dont il a besoin est que Python (``python3.dll``) soit sur le ``PATH`` de l'utilisateur.
