Repository: python/python-docs-fr
Catalog: library/zipfile.po
Languages: fr

source: When passing a :class:`ZipInfo` instance as the *zinfo_or_arcname* parameter, the compression method used will be that specified in the *compress_type* member of the given :class:`ZipInfo` instance. By default, the :class:`ZipInfo` constructor sets this member to :const:`ZIP_STORED`.
fr: Lorsque l'on passe une instance de :class:`ZipInfo` dans le paramètre *zinfo_or_arcname*, la méthode de compression utilisée sera celle spécifiée dans le membre *compress_type* de l'instance :class:`ZipInfo` donnée. Par défaut, le constructeur de la classe :class:`ZipInfo` définit ce membre à :const:`ZIP_STORED`.

source: The *compress_type* argument.
fr: L'argument *compress_type*.

source: Calling :meth:`writestr` on a ZipFile created with mode ``'r'`` or a closed ZipFile will raise a :exc:`ValueError`. Previously, a :exc:`RuntimeError` was raised.
fr: Appeler :meth:`.writestr` sur un fichier ZipFile fermé lève une erreur :exc:`ValueError`. Précédemment, une erreur :exc:`RuntimeError` était levée.

source: The following data attributes are also available:
fr: Les attributs suivants sont aussi disponibles :

source: Name of the ZIP file.
fr: Nom du fichier ZIP.

source: The level of debug output to use. This may be set from ``0`` (the default, no output) to ``3`` (the most output). Debugging information is written to ``sys.stdout``.
fr: Le niveau d'affichage de *debug* à utiliser. Peut être défini de ``0`` (par défaut, pas d'affichage) à ``3`` (affichage le plus bavard). Les informations de débogage sont affichées sur ``sys.stdout``.

source: The comment associated with the ZIP file as a :class:`bytes` object. If assigning a comment to a :class:`ZipFile` instance created with mode ``'w'``, ``'x'`` or ``'a'``, it should be no longer than 65535 bytes. Comments longer than this will be truncated.
fr: Le commentaire associé au fichier ZIP en tant qu'objet :class:`bytes`. Si vous affectez un commentaire à une instance de :class:`ZipFile` créée avec le mode ``'w'``, ``'x'`` ou ``'a'``, il ne doit pas dépasser 65535 octets. Les commentaires plus longs que cette taille seront tronqués.

source: Path Objects
fr: Objets *Path*

source: Construct a Path object from a ``root`` zipfile (which may be a :class:`ZipFile` instance or ``file`` suitable for passing to the :class:`ZipFile` constructor).
fr: Construit un objet *Path* depuis le fichier ZIP *root* (qui peut être une instance de :class:`ZipFile` ou tout ce qui sera accepté par le paramètre *file* du constructeur de :class:`ZipFile`).

source: ``at`` specifies the location of this Path within the zipfile, e.g. 'dir/file.txt', 'dir/', or ''. Defaults to the empty string, indicating the root.
fr: ``at`` indique la position de ce *Path* dans l'archive ZIP, par exemple ``"dir/file.txt"``, ``"dir/"``, ou ``""``. Par défaut c'est une chaine vide, indiquant la racine de l'archive.

source: Path objects expose the following features of :mod:`pathlib.Path` objects:
fr: Les objets ``Path`` de ``zipfile`` exposent les fonctionnalités suivantes des objets de :mod:`pathlib.Path` :

source: The final path component.
fr: Le dernier segment du chemin.

source: Invoke :meth:`ZipFile.open` on the current path. Allows opening for read or write, text or binary through supported modes: 'r', 'w', 'rb', 'wb'. Positional and keyword arguments are passed through to :class:`io.TextIOWrapper` when opened as text and ignored otherwise. ``pwd`` is the ``pwd`` parameter to :meth:`ZipFile.open`.
fr: Appelle :meth:`ZipFile.open` sur ce chemin. Il est possible d'ouvrir en lecture ou en écriture, au format texte ou binaire, via les modes ``'r'``, ``'w'``, ``'rb'`` et ``'wb'``. Les arguments positionnels et nommés sont passés à la classe :class:`io.TextIOWrapper` lors d'une ouverture au format texte, ils sont ignorés autrement. ``pwd`` est le paramètre ``pwd`` de :meth:`ZipFile.open`.

source: Added support for text and binary modes for open. Default mode is now text.
fr: prise en charge des modes texte et binaire pour ``open``. Le mode texte est maintenant le mode par défaut.

source: Enumerate the children of the current directory.
fr: Énumère le contenu du dossier actuel.

source: Return ``True`` if the current context references a directory.
fr: Renvoie ``True`` si ce chemin pointe sur un dossier.

source: Return ``True`` if the current context references a file.
fr: Renvoie ``True`` si ce chemin pointe sur un fichier.

source: Return ``True`` if the current context references a file or directory in the zip file.
fr: Renvoie ``True`` si le chemin pointe sur un fichier ou un dossier de l'archive ZIP

source: Read the current file as unicode text. Positional and keyword arguments are passed through to :class:`io.TextIOWrapper` (except ``buffer``, which is implied by the context).
fr: Lit le fichier au format texte. Les arguments positionnels et nommés sont passés à :class:`io.TextIOWrapper` (sauf ``buffer``, qui est imposé par le contexte)

source: Read the current file as bytes.
fr: Lit le fichier en mode binaire, renvoyant un objet *bytes*.

source: PyZipFile Objects
fr: Objets *PyZipFile*

source: The :class:`PyZipFile` constructor takes the same parameters as the :class:`ZipFile` constructor, and one additional parameter, *optimize*.
fr: Le constructeur de :class:`PyZipFile` prend les mêmes paramètres que le constructeur de :class:`ZipFile` avec un paramètre additionnel *optimize*.

source: The *optimize* parameter.
fr: Le paramètre *optimize*.

source: Instances have one method in addition to those of :class:`ZipFile` objects:
fr: Les instances ont une méthode supplémentaire par rapport aux objets :class:`ZipFile` :

source: Search for files :file:`\*.py` and add the corresponding file to the archive.
fr: Cherche les fichiers :file:`\*.py` et ajoute le fichier correspondant à l'archive.

source: If the *optimize* parameter to :class:`PyZipFile` was not given or ``-1``, the corresponding file is a :file:`\*.pyc` file, compiling if necessary.
fr: Si le paramètre *optimize* du constructeur de :class:`PyZipFile` n'a pas été donné ou est à ``-1``, le fichier correspondant est un fichier :file:`\*.pyc`, à compiler si nécessaire.

source: If the *optimize* parameter to :class:`PyZipFile` was ``0``, ``1`` or ``2``, only files with that optimization level (see :func:`compile`) are added to the archive, compiling if necessary.
fr: Si le paramètre *optimize* du constructeur de :class:`PyZipFile` est à ``0``, ``1`` ou ``2``, ne sont ajoutés dans l'archive que les fichiers avec ce niveau d'optimisation (voir :func:`compile`), à compiler si nécessaire.

source: If *pathname* is a file, the filename must end with :file:`.py`, and just the (corresponding :file:`\*.pyc`) file is added at the top level (no path information). If *pathname* is a file that does not end with :file:`.py`, a :exc:`RuntimeError` will be raised. If it is a directory, and the directory is not a package directory, then all the files :file:`\*.pyc` are added at the top level. If the directory is a package directory, then all :file:`\*.pyc` are added under the package name as a file path, and if any subdirectories are package directories, all of these are added recursively in sorted order.
fr: Si *pathname* est un fichier, le chemin de fichier doit terminer par :file:`.py` et uniquement le fichier (:file:`\*.pyc` correspondant) est ajouté au niveau le plus haut (sans information de chemin). Si *pathname* est un fichier ne terminant pas par :file:`.py`, une exception :exc:`RuntimeError` est levée. Si c'est un répertoire et que le répertoire n'est pas un répertoire de paquet, alors tous les fichiers :file:`\*.pyc` sont ajoutés à la racine. Si le répertoire est un répertoire de paquet, alors tous les :file:`\*.pyc` sont ajoutés sous le nom du paquet en tant que chemin, et s'il y a des sous-répertoires qui sont des répertoires de paquet, ils sont tous ajoutés récursivement dans un ordre trié.

source: *basename* is intended for internal use only.
fr: *basename* n'est sensé être utilisé qu'en interne.

source: *filterfunc*, if given, must be a function taking a single string argument. It will be passed each path (including each individual full file path) before it is added to the archive. If *filterfunc* returns a false value, the path will not be added, and if it is a directory its contents will be ignored. For example, if our test files are all either in ``test`` directories or start with the string ``test_``, we can use a *filterfunc* to exclude them::
fr: *filterfunc*, si donné, doit être une fonction prenant une seule chaîne de caractères en argument. Il lui sera passé chaque chemin (incluant chaque chemin de fichier complet individuel) avant d'être ajouté à l'archive. Si *filterfunc* retourne une valeur fausse, le chemin n'est pas ajouté et si c'est un répertoire son contenu est ignoré. Par exemple, si nos fichiers de test sont tous soit dans des répertoires ``test`` ou commencent par ``test_``, nous pouvons utiliser une fonction *filterfunc* pour les exclure ::

source: The :meth:`writepy` method makes archives with file names like this::
fr: La méthode :meth:`writepy` crée des archives avec des noms de fichier comme suit ::

source: The *filterfunc* parameter.
fr: Le paramètre *filterfunc*.

source: The *pathname* parameter accepts a :term:`path-like object`.
fr: Le paramètre *pathname* accepte un objet chemin-compatible :term:`path-like object`.

source: Recursion sorts directory entries.
fr: La récursion trie les entrées de dossier.

source: ZipInfo Objects
fr: Objets *ZipInfo*

source: Instances of the :class:`ZipInfo` class are returned by the :meth:`.getinfo` and :meth:`.infolist` methods of :class:`ZipFile` objects. Each object stores information about a single member of the ZIP archive.
fr: Des instances de la classe :class:`ZipInfo` sont retournées par les méthodes :meth:`.getinfo` et :meth:`.infolist` des objets :class:`ZipFile`. Chaque objet stocke des informations sur un seul membre de l'archive ZIP.

source: There is one classmethod to make a :class:`ZipInfo` instance for a filesystem file:
fr: Il y a une méthode de classe pour créer une instance de :class:`ZipInfo` pour un fichier du système de fichiers :

source: Construct a :class:`ZipInfo` instance for a file on the filesystem, in preparation for adding it to a zip file.
fr: Construit une instance de :class:`ZipInfo` pour le fichier du système de fichiers, en préparation de l'ajouter à un fichier ZIP.

source: *filename* should be the path to a file or directory on the filesystem.
fr: *filename* doit être un chemin vers un fichier ou un répertoire dans le système de fichiers.

source: If *arcname* is specified, it is used as the name within the archive. If *arcname* is not specified, the name will be the same as *filename*, but with any drive letter and leading path separators removed.
fr: Si *arcname* est spécifié, il est utilisé en tant que nom dans l'archive. Si *arcname* n'est pas spécifié, le nom sera le même que *filename* mais sans lettre de disque et sans séparateur de chemin en première position.

source: The *filename* parameter accepts a :term:`path-like object`.
fr: Le paramètre *filename* accepte un objet chemin-compatible :term:`path-like object`.

source: Instances have the following methods and attributes:
fr: Les instances ont les méthodes et attributs suivants :

source: Return ``True`` if this archive member is a directory.
fr: Retourne ``True`` si le membre d'archive est un répertoire.

source: This uses the entry's name: directories should always end with ``/``.
fr: Utilise le nom de l'entrée : les répertoires doivent toujours se terminer par ``/``.

source: Name of the file in the archive.
fr: Nom du fichier dans l'archive.

source: The time and date of the last modification to the archive member. This is a tuple of six values:
fr: Date et heure de dernière modification pour le membre de l'archive. *Tuple* de six valeurs :

source: Value
fr: Valeur

source: Year (>= 1980)
fr: Année (>= 1980)

source: Month (one-based)
fr: Mois (indexé à partir de 1)

source: Day of month (one-based)
fr: Jour du mois (indexé à partir de 1)

source: Hours (zero-based)
fr: Heures (indexées à partir de 0)

source: Minutes (zero-based)
fr: Minutes (indexées à partir de 0)

source: Seconds (zero-based)
fr: Secondes (indexées à partir de 0)

source: The ZIP file format does not support timestamps before 1980.
fr: Le format de fichier ZIP ne gère pas les horodatages avant 1980.

source: Type of compression for the archive member.
fr: Type de compression du membre d'archive.

source: Comment for the individual archive member as a :class:`bytes` object.
fr: Commentaire pour le membre d'archive individuel en tant qu'objet :class:`bytes`.

source: Expansion field data. The `PKZIP Application Note`_ contains some comments on the internal structure of the data contained in this :class:`bytes` object.
fr: Données du champ d'extension. La documentation `PKZIP Application Note`_ contient quelques commentaires sur la structure interne des données contenues dans cet objet :class:`bytes`.

source: System which created ZIP archive.
fr: Système ayant créé l'archive ZIP.

source: PKZIP version which created ZIP archive.
fr: Version de PKZIP ayant créé l'archive ZIP.

source: PKZIP version needed to extract archive.
fr: Version de PKZIP nécessaire à l'extraction de l'archive ZIP.

source: Must be zero.
fr: Doit être à zéro.

source: ZIP flag bits.
fr: Bits d'options ZIP.

source: Volume number of file header.
fr: Numéro de volume de l'entête du fichier.

source: Internal attributes.
fr: Attributs internes.

source: External file attributes.
fr: Attributs de fichier externes.

source: Byte offset to the file header.
fr: Longueur de l'entête du fichier en octets.

source: CRC-32 of the uncompressed file.
fr: CRC-32 du fichier décompressé.

source: Size of the compressed data.
fr: Taille des données décompressées.

source: Size of the uncompressed file.
fr: Taille du fichier décompressé.

source: Command-Line Interface
fr: Interface en ligne de commande

source: The :mod:`zipfile` module provides a simple command-line interface to interact with ZIP archives.
fr: Le module :mod:`zipfile` fournit une interface en ligne de commande simple pour interagir avec des archives ZIP.

source: If you want to create a new ZIP archive, specify its name after the :option:`-c` option and then list the filename(s) that should be included:
fr: Si vous voulez créer une nouvelle archive ZIP, spécifiez son nom après l'option :option:`-c` et listez ensuite le(s) nom(s) de fichier à inclure :

source: Passing a directory is also acceptable:
fr: Passer un répertoire est aussi possible :

source: If you want to extract a ZIP archive into the specified directory, use the :option:`-e` option:
fr: Si vous voulez extraire une archive ZIP dans un répertoire donné, utilisez l'option :option:`-e` :

source: For a list of the files in a ZIP archive, use the :option:`-l` option:
fr: Pour une liste des fichiers dans une archive ZIP, utilisez l'option :option:`-l` :

source: Command-line options
fr: Options de la ligne de commande

source: List files in a zipfile.
fr: Liste les fichiers dans un fichier ZIP *zipfile*.

source: Create zipfile from source files.
fr: Crée un fichier ZIP *zipfile* à partir des fichiers *source*.

source: Extract zipfile into target directory.
fr: Extrait le fichier ZIP *zipfile* vers le répertoire cible *output_dir*.

source: Test whether the zipfile is valid or not.
fr: Teste si le fichier zip est valide.

source: Decompression pitfalls
fr: Problèmes de décompression

source: The extraction in zipfile module might fail due to some pitfalls listed below.
fr: L'extraction d'une archive ZIP par le module *zipfile* peut échouer pour les raisons listées ci-dessous.

source: From file itself
fr: À cause du fichier lui-même

source: Decompression may fail due to incorrect password / CRC checksum / ZIP format or unsupported compression method / decryption.
fr: La décompression peut échouer à cause d'un mot de passe ou d'une somme de contrôle CRC incorrectes. Elle peut aussi échouer si le format, la méthode de compression, ou de chiffrement n'est pas implémenté.

source: File System limitations
fr: Limitations du système de fichiers

source: Exceeding limitations on different file systems can cause decompression failed. Such as allowable characters in the directory entries, length of the file name, length of the pathname, size of a single file, and number of files, etc.
fr: Dépasser les limites du système de fichiers peut faire échouer la décompression. Ces limites peuvent concerner les caractères licites pour un nom de fichier, la longueur du nom du fichier ou du chemin, la taille d'un fichier, le nombre de fichiers, etc.

source: Resources limitations
fr: Ressources limitées

source: The lack of memory or disk volume would lead to decompression failed. For example, decompression bombs (aka `ZIP bomb`_) apply to zipfile library that can cause disk volume exhaustion.
fr: Le manque de mémoire ou d'espace disque peut mener à un échec de décompression. Par exemple, une bombe de décompression (`ZIP bomb`_), décompressés avec *zifile* peut remplir l'espace disque.

source: Interruption during the decompression, such as pressing control-C or killing the decompression process may result in incomplete decompression of the archive.
fr: Une interruption durant la décompression, en utilisant *control-C* ou en tuant le processus, peut mener à une décompression partielle de l'archive.

source: Default behaviors of extraction
fr: Comportements par défaut de l'extraction

source: Not knowing the default extraction behaviors can cause unexpected decompression results. For example, when extracting the same archive twice, it overwrites files without asking.
fr: Ne pas connaître le comportement d'extraction par défaut peut causer des résultats inattendus. Par exemple, lors de l'extraction d'une même archive deux fois, les fichiers sont écrasés sans prévenir.
