Repository: python/python-docs-fr
Catalog: library/zipfile.po
Languages: fr

source: :mod:`zipfile` --- Work with ZIP archives
fr: :mod:`zipfile` — Travailler avec des archives ZIP

source: **Source code:** :source:`Lib/zipfile.py`
fr: **Code source :** :source:`Lib/zipfile.py`

source: The ZIP file format is a common archive and compression standard. This module provides tools to create, read, write, append, and list a ZIP file. Any advanced use of this module will require an understanding of the format, as defined in `PKZIP Application Note`_.
fr: Le format de fichier ZIP est une archive et un standard de compression couramment utilisés. Ce module fournit des outils pour créer, écrire, ajouter des données à et lister un fichier ZIP. L'utilisation avancée de ce module requiert une certaine compréhension du format, comme défini dans `PKZIP Application Note`_.

source: This module does not currently handle multi-disk ZIP files. It can handle ZIP files that use the ZIP64 extensions (that is ZIP files that are more than 4 GiB in size). It supports decryption of encrypted files in ZIP archives, but it currently cannot create an encrypted file. Decryption is extremely slow as it is implemented in native Python rather than C.
fr: Ce module ne gère pas pour l'instant les fichiers ZIP multi-disque. Il gère les fichiers ZIP qui utilisent les extensions ZIP64 (c'est-à-dire des fichiers d'une taille supérieure à 4 Go). Il gère le chiffrement d'archives ZIP chiffrées, mais il ne peut pas pour l'instant créer de fichier chiffré. Le déchiffrement est extrêmement lent car il est implémenté uniquement en Python plutôt qu'en C.

source: The module defines the following items:
fr: Le module définit les éléments suivants :

source: The error raised for bad ZIP files.
fr: Erreur levée en cas de fichier ZIP non valide.

source: Alias of :exc:`BadZipFile`, for compatibility with older Python versions.
fr: Alias de :exc:`BadZipFile`, pour la compatibilité avec les versions de Python précédentes.

source: The error raised when a ZIP file would require ZIP64 functionality but that has not been enabled.
fr: Erreur levée quand un fichier ZIP nécessite la fonctionnalité ZIP64 mais qu'elle n'a pas été activée.

source: The class for reading and writing ZIP files. See section :ref:`zipfile-objects` for constructor details.
fr: Classe pour lire et écrire des fichiers ZIP. Voir la section :ref:`zipfile-objects` pour les détails du constructeur.

source: Class for creating ZIP archives containing Python libraries.
fr: Classe pour créer des archives ZIP contenant des bibliothèques Python.

source: Class used to represent information about a member of an archive. Instances of this class are returned by the :meth:`.getinfo` and :meth:`.infolist` methods of :class:`ZipFile` objects. Most users of the :mod:`zipfile` module will not need to create these, but only use those created by this module. *filename* should be the full name of the archive member, and *date_time* should be a tuple containing six fields which describe the time of the last modification to the file; the fields are described in section :ref:`zipinfo-objects`.
fr: Classe utilisée pour représenter les informations d'un membre d'une archive. Les instances de cette classe sont retournées par les méthodes :meth:`.getinfo` et :meth:`.infolist` des objets :class:`ZipFile`. La plupart des utilisateurs du module :mod:`zipfile` n'ont pas besoin de créer ces instances mais d'utiliser celles créées par ce module. *filename* doit être le nom complet du membre de l'archive et *date_time* doit être un sextuplet décrivant la date de dernière modification du fichier ; les champs sont décrits dans la section :ref:`zipinfo-objects`.

source: Returns ``True`` if *filename* is a valid ZIP file based on its magic number, otherwise returns ``False``. *filename* may be a file or file-like object too.
fr: Retourne ``True`` si *filename* est un fichier ZIP valide basé sur son nombre magique, sinon retourne ``False``. *filename* peut aussi être un fichier ou un objet fichier-compatible.

source: Support for file and file-like objects.
fr: Gestion des objets fichier et fichier-compatibles.

source: The numeric constant for an uncompressed archive member.
fr: Constante numérique pour un membre d'une archive décompressée.

source: The numeric constant for the usual ZIP compression method. This requires the :mod:`zlib` module.
fr: Constante numérique pour la méthode habituelle de compression de ZIP. Nécessite le module :mod:`zlib`.

source: The numeric constant for the BZIP2 compression method. This requires the :mod:`bz2` module.
fr: Constante numérique pour la méthode de compressions BZIP2. Nécessite le module :mod:`bz2`.

source: The numeric constant for the LZMA compression method. This requires the :mod:`lzma` module.
fr: Constante numérique pour la méthode de compressions LZMA. Nécessite le module :mod:`lzma`.

source: The ZIP file format specification has included support for bzip2 compression since 2001, and for LZMA compression since 2006. However, some tools (including older Python releases) do not support these compression methods, and may either refuse to process the ZIP file altogether, or fail to extract individual files.
fr: La spécification du format de fichier ZIP inclut la gestion de la compression BZIP2 depuis 2001 et LZMA depuis 2006. Néanmoins, certains outils (comme certaines versions de Python) ne gèrent pas ces méthodes de compression et peuvent soit totalement refuser de traiter le fichier ZIP soit ne pas extraire certains fichiers.

source: Documentation on the ZIP file format by Phil Katz, the creator of the format and algorithms used.
fr: Documentation sur le format de fichier ZIP par Phil Katz, créateur du format et des algorithmes utilisés.

source: Information about the Info-ZIP project's ZIP archive programs and development libraries.
fr: Informations sur les programmes et les bibliothèques de développement d'archivage ZIP du projet Info-ZIP.

source: ZipFile Objects
fr: Objets ZipFile

source: Open a ZIP file, where *file* can be a path to a file (a string), a file-like object or a :term:`path-like object`.
fr: Ouvre un fichier ZIP, où *file* peut être un chemin vers un fichier (une chaîne de caractères), un objet fichier-compatible ou un objet chemin-compatible :term:`path-like object`.

source: The *mode* parameter should be ``'r'`` to read an existing file, ``'w'`` to truncate and write a new file, ``'a'`` to append to an existing file, or ``'x'`` to exclusively create and write a new file. If *mode* is ``'x'`` and *file* refers to an existing file, a :exc:`FileExistsError` will be raised. If *mode* is ``'a'`` and *file* refers to an existing ZIP file, then additional files are added to it. If *file* does not refer to a ZIP file, then a new ZIP archive is appended to the file. This is meant for adding a ZIP archive to another file (such as :file:`python.exe`). If *mode* is ``'a'`` and the file does not exist at all, it is created. If *mode* is ``'r'`` or ``'a'``, the file should be seekable.
fr: Le paramètre *mode* doit être ``r`` pour lire un fichier existant, ``w`` pour tronquer et écrire un nouveau fichier, ``a`` pour ajouter des données à la fin d'un fichier existant ou ``x`` pour créer et écrire exclusivement un nouveau fichier. Si *mode* est à ``x`` et *file* fait référence à un fichier existant, une exception :exc:`FileExistsError` est levée. Si *mode* est à ``a`` et *file* fait référence à un fichier ZIP existant, alors des fichiers supplémentaires y seront ajoutés. Si *file* ne fait pas référence à un fichier ZIP, alors une nouvelle archive ZIP est ajoutée au fichier, afin de prévoir le cas d'ajouter une archive ZIP à un autre fichier (comme par exemple :file:`python.exe`). Si *mode* est à ``r`` ou ``a``, le fichier doit être navigable.

source: *compression* is the ZIP compression method to use when writing the archive, and should be :const:`ZIP_STORED`, :const:`ZIP_DEFLATED`, :const:`ZIP_BZIP2` or :const:`ZIP_LZMA`; unrecognized values will cause :exc:`NotImplementedError` to be raised. If :const:`ZIP_DEFLATED`, :const:`ZIP_BZIP2` or :const:`ZIP_LZMA` is specified but the corresponding module (:mod:`zlib`, :mod:`bz2` or :mod:`lzma`) is not available, :exc:`RuntimeError` is raised. The default is :const:`ZIP_STORED`.
fr: Le paramètre *compression* est la méthode de compression ZIP à utiliser lors de l'écriture de l'archive et doit être défini à :const:`ZIP_STORED`, :const:`ZIP_DEFLATED`, :const:`ZIP_BZIP2` ou :const:`ZIP_LZMA` ; les valeurs non reconnues lèveront une exception :exc:`NotImplementedError`. Si :const:`ZIP_DEFLATED`, :const:`ZIP_BZIP2` ou :const:`ZIP_LZMA` est spécifié mais le module correspondant (:mod:`zlib`, :mod:`bz2` ou :mod:`lzma`) n'est pas disponible, une exception :exc:`RuntimeError` est levée. Est défini par défaut à :const:`ZIP_STORED`.

source: If *allowZip64* is ``True`` (the default) zipfile will create ZIP files that use the ZIP64 extensions when the zipfile is larger than 4 GiB. If it is ``false`` :mod:`zipfile` will raise an exception when the ZIP file would require ZIP64 extensions.
fr: Si *allowZip64* est à ``True`` (par défaut), *zipfile* crée des fichiers ZIP utilisant les extensions ZIP64 quand le fichier ZIP est plus grand que 4 Go. S'il est à ``False``, :mod:`zipfile` lève une exception quand le fichier ZIP nécessiterait les extensions ZIP64.

source: The *compresslevel* parameter controls the compression level to use when writing files to the archive. When using :const:`ZIP_STORED` or :const:`ZIP_LZMA` it has no effect. When using :const:`ZIP_DEFLATED` integers ``0`` through ``9`` are accepted (see :class:`zlib <zlib.compressobj>` for more information). When using :const:`ZIP_BZIP2` integers ``1`` through ``9`` are accepted (see :class:`bz2 <bz2.BZ2File>` for more information).
fr: Le paramètre *compresslevel* contrôle le niveau de compression à utiliser lors de l'écriture des fichiers dans l'archive. Avec :const:`ZIP_STORED` ou :const:`ZIP_LZMA`, cela est sans effet. Avec :const:`ZIP_DEFLATED` les entiers de ``0`` à ``9`` sont acceptés (voir :class:`zlib <zlib.compressobj>` pour plus d'informations). Avec :const:`ZIP_BZIP2` les entiers de ``1`` à ``9`` sont acceptés (voir :class:`bz2 <bz2.BZ2File>` pour plus d'informations).

source: The *strict_timestamps* argument, when set to ``False``, allows to zip files older than 1980-01-01 at the cost of setting the timestamp to 1980-01-01. Similar behavior occurs with files newer than 2107-12-31, the timestamp is also set to the limit.
fr: Les fichiers ZIP plus anciens que le 1er janvier 1980 sont autorisés lorsque l'argument *strict_timestamps* vaut ``False``, moyennant de les voir datés du 1er janvier 1980. De même pour les fichiers datés d'après le 31 décembre 2107 qui voient leur horodatage fixé au 31 décembre 2107.

source: If the file is created with mode ``'w'``, ``'x'`` or ``'a'`` and then :meth:`closed <close>` without adding any files to the archive, the appropriate ZIP structures for an empty archive will be written to the file.
fr: Si le fichier est créé avec le mode ``'w'``, ``'x'`` ou ``'a'`` et ensuite :meth:`fermé <close>` sans ajouter de fichiers à l'archive, la structure appropriée pour un fichier archive ZIP vide sera écrite dans le fichier.

source: ZipFile is also a context manager and therefore supports the :keyword:`with` statement. In the example, *myzip* is closed after the :keyword:`!with` statement's suite is finished---even if an exception occurs::
fr: *ZipFile* est aussi un gestionnaire de contexte et gère ainsi la déclaration :keyword:`with`. Dans l'exemple, *myzip* est fermé à la fin de la déclaration :keyword:`!with` --- même si une exception est levée ::

source: Added the ability to use :class:`ZipFile` as a context manager.
fr: Ajout de la possibilité d'utiliser :class:`ZipFile` comme un gestionnaire de contexte.

source: Added support for :mod:`bzip2 <bz2>` and :mod:`lzma` compression.
fr: Ajout de la gestion de la compression :mod:`bzip2 <bz2>` et :mod:`lzma`.

source: ZIP64 extensions are enabled by default.
fr: Les extensions ZIP64 sont activées par défaut.

source: Added support for writing to unseekable streams. Added support for the ``'x'`` mode.
fr: Ajout de la gestion de l'écriture dans des flux non navigables. Ajout de la gestion du mode ``x``.

source: Previously, a plain :exc:`RuntimeError` was raised for unrecognized compression values.
fr: Auparavant, une simple exception :exc:`RuntimeError` était levée pour des valeurs de compression non reconnues.

source: The *file* parameter accepts a :term:`path-like object`.
fr: Le paramètre *file* accepte un objet fichier-compatible :term:`path-like object`.

source: Add the *compresslevel* parameter.
fr: Ajout du paramètre *compresslevel*.

source: The *strict_timestamps* keyword-only argument
fr: l'argument nommé *strict_timestamps*

source: Close the archive file. You must call :meth:`close` before exiting your program or essential records will not be written.
fr: Ferme l'archive. Vous devez appeler :meth:`close` avant de terminer votre programme ou des informations essentielles n'y seront pas enregistrées.

source: Return a :class:`ZipInfo` object with information about the archive member *name*. Calling :meth:`getinfo` for a name not currently contained in the archive will raise a :exc:`KeyError`.
fr: Retourne un objet :class:`ZipInfo` avec les informations du membre *name* de l'archive. Appeler :meth:`getinfo` pour un nom non contenu dans l'archive lève une exception :exc:`KeyError`.

source: Return a list containing a :class:`ZipInfo` object for each member of the archive. The objects are in the same order as their entries in the actual ZIP file on disk if an existing archive was opened.
fr: Retourne une liste contenant un objet :class:`ZipInfo` pour chaque membre de l'archive. Les objets ont le même ordre que leurs entrées dans le fichier ZIP présent sur disque s'il s'agissait d'une archive préexistante.

source: Return a list of archive members by name.
fr: Retourne une liste des membres de l'archive indexés par leur nom.

source: :meth:`~ZipFile.open` is also a context manager and therefore supports the :keyword:`with` statement::
fr: :meth:`~ZipFile.open` est aussi un gestionnaire de contexte et gère ainsi la déclaration :keyword:`with` ::

source: With ``mode='w'``, a writable file handle is returned, which supports the :meth:`~io.BufferedIOBase.write` method. While a writable file handle is open, attempting to read or write other files in the ZIP file will raise a :exc:`ValueError`.
fr: Avec ``mode='w'`` un descripteur de fichier en écriture est retourné, gérant la méthode :meth:`~io.BufferedIOBase.write`. Quand le descripteur d'un fichier inscriptible est ouvert, tenter de lire ou écrire d'autres fichiers dans le fichier ZIP lève une exception :exc:`ValueError`.

source: When writing a file, if the file size is not known in advance but may exceed 2 GiB, pass ``force_zip64=True`` to ensure that the header format is capable of supporting large files. If the file size is known in advance, construct a :class:`ZipInfo` object with :attr:`~ZipInfo.file_size` set, and use that as the *name* parameter.
fr: Lors de l'écriture d'un fichier, si la taille du fichier n'est pas connue mais peut être supérieure à 2 GiO, spécifiez ``force_zip64=True`` afin de vous assurer que le format d'en-tête est capable de supporter des fichiers volumineux. Si la taille du fichier est connue à l'avance, instanciez un objet :class:`ZipInfo` avec l'attribut :attr:`~ZipInfo.file_size` défini et utilisez-le en tant que paramètre *name*.

source: The :meth:`.open`, :meth:`read` and :meth:`extract` methods can take a filename or a :class:`ZipInfo` object. You will appreciate this when trying to read a ZIP file that contains members with duplicate names.
fr: Les méthodes :meth:`.open`, :meth:`read` et :meth:`extract` peuvent prendre un nom de fichier ou un objet :class:`ZipInfo`. Cela est appréciable lorsqu'on essaie de lire un fichier ZIP qui contient des membres avec des noms en double.

source: Removed support of ``mode='U'``. Use :class:`io.TextIOWrapper` for reading compressed text files in :term:`universal newlines` mode.
fr: Suppression de la gestion de ``mode='U'``. Utilisez :class:`io.TextIOWrapper` pour lire des fichiers texte compressés en mode :term:`universal newlines`.

source: Calling :meth:`.open` on a closed ZipFile will raise a :exc:`ValueError`. Previously, a :exc:`RuntimeError` was raised.
fr: Appeler :meth:`.open` sur un fichier ZipFile fermé lève une erreur :exc:`ValueError`. Précédemment, une erreur :exc:`RuntimeError` était levée.

source: Returns the normalized path created (a directory or new file).
fr: Retourne le chemin normalisé créé (un dossier ou un nouveau fichier).

source: If a member filename is an absolute path, a drive/UNC sharepoint and leading (back)slashes will be stripped, e.g.: ``///foo/bar`` becomes ``foo/bar`` on Unix, and ``C:\foo\bar`` becomes ``foo\bar`` on Windows. And all ``".."`` components in a member filename will be removed, e.g.: ``../../foo../../ba..r`` becomes ``foo../ba..r``. On Windows illegal characters (``:``, ``<``, ``>``, ``|``, ``"``, ``?``, and ``*``) replaced by underscore (``_``).
fr: Si le nom de fichier d'un membre est un chemin absolu, le disque/partage UNC et les (anti)slashes de départ seront supprimés, par exemple ``///foo/bar`` devient ``foo/bar`` sous Unix et ``C:\foo\bar`` devient ``foo\bar`` sous Windows. Et tous les composants ``".."`` dans le nom de fichier d'un membre seront supprimés, par exemple ``../../foo../../ba..r`` devient ``foo../ba..r``. Sous Windows les caractères illégaux (``:``, ``<``, ``>``, ``|``, ``"``, ``?`` et ``*``) sont remplacés par un *underscore* (``_``).

source: Calling :meth:`extract` on a closed ZipFile will raise a :exc:`ValueError`. Previously, a :exc:`RuntimeError` was raised.
fr: Appeler :meth:`.extract` sur un fichier ZipFile fermé lève une erreur :exc:`ValueError`. Précédemment, une erreur :exc:`RuntimeError` était levée.

source: The *path* parameter accepts a :term:`path-like object`.
fr: Le paramètre *path* accepte un objet chemin-compatible :term:`path-like object`.

source: Never extract archives from untrusted sources without prior inspection. It is possible that files are created outside of *path*, e.g. members that have absolute filenames starting with ``"/"`` or filenames with two dots ``".."``. This module attempts to prevent that. See :meth:`extract` note.
fr: N'extrayez jamais d'archives depuis des sources non fiables sans inspection préalable. Il est possible que des fichiers soient créés en dehors de *path*, par exemple des membres qui ont des chemins de fichier absolus commençant par ``"/"`` ou des noms de fichier avec deux points ``".."``. Ce module essaie de prévenir ceci. Voir la note de :meth:`extract`.

source: Calling :meth:`extractall` on a closed ZipFile will raise a :exc:`ValueError`. Previously, a :exc:`RuntimeError` was raised.
fr: Appeler :meth:`.extractall` sur un fichier ZipFile fermé lève une erreur :exc:`ValueError`. Précédemment, une erreur :exc:`RuntimeError` était levée.

source: Print a table of contents for the archive to ``sys.stdout``.
fr: Affiche la liste des contenus de l'archive sur ``sys.stdout``.

source: Calling :meth:`read` on a closed ZipFile will raise a :exc:`ValueError`. Previously, a :exc:`RuntimeError` was raised.
fr: Appeler :meth:`.read` sur un fichier ZipFile fermé lève une erreur :exc:`ValueError`. Précédemment, une erreur :exc:`RuntimeError` était levée.

source: Read all the files in the archive and check their CRC's and file headers. Return the name of the first bad file, or else return ``None``.
fr: Lit tous les fichiers de l'archive et vérifie leurs sommes CRC et leurs en-têtes. Retourne le nom du premier fichier mauvais ou retourne ``None`` sinon.

source: Calling :meth:`testzip` on a closed ZipFile will raise a :exc:`ValueError`. Previously, a :exc:`RuntimeError` was raised.
fr: Appeler :meth:`testzip` sur un fichier ZipFile fermé lève une erreur :exc:`ValueError`. Précédemment, une erreur :exc:`RuntimeError` était levée.

source: Write the file named *filename* to the archive, giving it the archive name *arcname* (by default, this will be the same as *filename*, but without a drive letter and with leading path separators removed). If given, *compress_type* overrides the value given for the *compression* parameter to the constructor for the new entry. Similarly, *compresslevel* will override the constructor if given. The archive must be open with mode ``'w'``, ``'x'`` or ``'a'``.
fr: Écrit le fichier nommé *filename* dans l'archive, lui donnant *arcname* comme nom dans l'archive (par défaut, *arcname* prend la même valeur que *filename* mais sans lettre de disque et séparateur de chemin en première position). Si donné, *compress_type* écrase la valeur donnée pour le paramètre *compression* au constructeur pour la nouvelle entrée. De la même manière, *compression* écrase le constructeur si donné. L'archive doit être ouverte avec le mode ``'w'``, ``'x'`` ou ``'a'``.

source: Archive names should be relative to the archive root, that is, they should not start with a path separator.
fr: Les noms d'archive doivent être relatifs à la racine de l'archive, c'est-à-dire qu'ils ne doivent pas commencer par un séparateur de chemin.

source: If ``arcname`` (or ``filename``, if ``arcname`` is not given) contains a null byte, the name of the file in the archive will be truncated at the null byte.
fr: Si ``arcname`` (ou ``filename`` si ``arcname`` n'est pas donné) contient un octet nul, le nom du fichier dans l'archive sera tronqué à l'octet nul.

source: Calling :meth:`write` on a ZipFile created with mode ``'r'`` or a closed ZipFile will raise a :exc:`ValueError`. Previously, a :exc:`RuntimeError` was raised.
fr: Appeler :meth:`.write` sur un fichier ZipFile fermé lève une erreur :exc:`ValueError`. Précédemment, une erreur :exc:`RuntimeError` était levée.

source: Write a file into the archive. The contents is *data*, which may be either a :class:`str` or a :class:`bytes` instance; if it is a :class:`str`, it is encoded as UTF-8 first. *zinfo_or_arcname* is either the file name it will be given in the archive, or a :class:`ZipInfo` instance. If it's an instance, at least the filename, date, and time must be given. If it's a name, the date and time is set to the current date and time. The archive must be opened with mode ``'w'``, ``'x'`` or ``'a'``.
fr: Écrit un fichier dans l'archive. Le contenu est *data*, qui peut être soit une instance de :class:`str` ou une instance de :class:`bytes` ; s'il s'agit d'une :class:`str`, il est encodé en UTF-8 au préalable. *zinfo_or_arcname* est soit le nom de fichier qu'il sera donné dans l'archive, soit une instance de :class:`ZipInfo`. Si c'est une instance, au moins le nom de fichier, la date et l'heure doivent être donnés. S'il s'agit d'un nom, la date et l'heure sont définies sur la date et l'heure actuelles. L'archive doit être ouverte avec le mode ``'w'``, ``'x'`` ou ``'a'``.

source: If given, *compress_type* overrides the value given for the *compression* parameter to the constructor for the new entry, or in the *zinfo_or_arcname* (if that is a :class:`ZipInfo` instance). Similarly, *compresslevel* will override the constructor if given.
fr: Si donné, *compress_type* écrase la valeur donnée pour le paramètre *compression* au constructeur de la nouvelle entrée ou dans le paramètre *zinfo_or_arcname* (si c'est une instance de :class:`ZipInfo`). De la même manière, *compresslevel* le constructeur si donné.
