Repository: python/python-docs-fr
Catalog: library/zipimport.po
Languages: fr

source: **Source code:** :source:`Lib/zipimport.py`
fr: **Code source :** :source:`Lib/zipimport.py`

source: This module adds the ability to import Python modules (:file:`\*.py`, :file:`\*.pyc`) and packages from ZIP-format archives. It is usually not needed to use the :mod:`zipimport` module explicitly; it is automatically used by the built-in :keyword:`import` mechanism for :data:`sys.path` items that are paths to ZIP archives.
fr: Ce module ajoute la possibilité d'importer des modules Python (:file:`\*.py`, :file:`\*.pyc`) et des paquets depuis des archives au format ZIP. Il n'est généralement pas nécessaire d'utiliser explicitement le module :mod:`zipimport` ; il est automatiquement utilisé par le mécanisme intégré de :keyword:`import` pour les éléments de :data:`sys.path` qui sont des chemins vers des archives ZIP.

source: Typically, :data:`sys.path` is a list of directory names as strings. This module also allows an item of :data:`sys.path` to be a string naming a ZIP file archive. The ZIP archive can contain a subdirectory structure to support package imports, and a path within the archive can be specified to only import from a subdirectory. For example, the path :file:`example.zip/lib/` would only import from the :file:`lib/` subdirectory within the archive.
fr: En général, :data:`sys.path` est une liste de noms de répertoires sous forme de chaînes. Ce module permet également à un élément de :data:`sys.path` d'être une chaîne nommant une archive de fichier ZIP. L'archive peut contenir une arborescence de répertoires pour prendre en charge les importations de paquets, et un chemin dans l'archive peut être donné pour importer uniquement à partir d'un sous-répertoire. Par exemple, le chemin d'accès :file:`example.zip/lib/` importerait uniquement depuis le sous-répertoire :file:`lib/` dans l'archive.

source: Any files may be present in the ZIP archive, but importers are only invoked for :file:`.py` and :file:`.pyc` files. ZIP import of dynamic modules (:file:`.pyd`, :file:`.so`) is disallowed. Note that if an archive only contains :file:`.py` files, Python will not attempt to modify the archive by adding the corresponding :file:`.pyc` file, meaning that if a ZIP archive doesn't contain :file:`.pyc` files, importing may be rather slow.
fr: Tous les fichiers peuvent être présents dans l'archive ZIP, mais les importateurs ne sont invoqués que pour les fichiers :file:`.py` et :file:`.pyc`. L'importation ZIP de modules dynamiques (:file:`.py`, :file:`.so`) n'est pas permise. Notez que si une archive ne contient que des fichiers :file:`.py`, Python n'essaiera pas de modifier l'archive en ajoutant le fichier :file:`.pyc` correspondant, ce qui signifie que si une archive ZIP ne contient pas de fichiers :file:`.pyc`, l'importation peut être assez lente.

source: Previously, ZIP archives with an archive comment were not supported.
fr: auparavant, les archives ZIP avec un commentaire d’archive n’étaient pas prises en charge.

source: Documentation on the ZIP file format by Phil Katz, the creator of the format and algorithms used.
fr: Documentation sur le format de fichier ZIP par Phil Katz, créateur du format et des algorithmes utilisés.

source: :pep:`273` - Import Modules from Zip Archives
fr: :pep:`273` — Importation de modules depuis des archives ZIP

source: Written by James C. Ahlstrom, who also provided an implementation. Python 2.3 follows the specification in :pep:`273`, but uses an implementation written by Just van Rossum that uses the import hooks described in :pep:`302`.
fr: Écrit par James C. Ahlstrom, qui a également fourni une mise en œuvre. Python 2.3 suit les spécifications de :pep:`273`, mais utilise une implémentation écrite par Just van Rossum qui utilise les crochets d'importation décrits dans :pep:`302`.

source: :mod:`importlib` - The implementation of the import machinery
fr: :mod:`importlib` — Implémentation du système d'importation

source: Package providing the relevant protocols for all importers to implement.
fr: Paquet qui définit les protocoles que doivent implémenter tous les objets importateurs.

source: This module defines an exception:
fr: Ce module définit une exception :

source: Exception raised by zipimporter objects. It's a subclass of :exc:`ImportError`, so it can be caught as :exc:`ImportError`, too.
fr: Exception levée par les objets *zipimporter*. C'est une sous-classe de :exc:`ImportError`, donc elle peut être aussi interceptée comme une :exc:`ImportError`.

source: zipimporter Objects
fr: Objets *zimporter*

source: :class:`zipimporter` is the class for importing ZIP files.
fr: :class:`zipimporter` est la classe pour importer des fichiers ZIP.

source: Create a new zipimporter instance. *archivepath* must be a path to a ZIP file, or to a specific path within a ZIP file. For example, an *archivepath* of :file:`foo/bar.zip/lib` will look for modules in the :file:`lib` directory inside the ZIP file :file:`foo/bar.zip` (provided that it exists).
fr: Classe d'objets qui importent depuis les archives. Dans le constructeur, *archivepath* doit être un chemin vers un fichier ZIP, éventuellement augmenté d'un chemin à l'intérieur de l'archive. Par exemple, un *archivepath* de :file:`foo/bar.zip/lib` cherchera les modules dans le répertoire :file:`lib` du fichier ZIP :file:`foo/bar.zip` (à supposer que ce répertoire existe).

source: :exc:`ZipImportError` is raised if *archivepath* doesn't point to a valid ZIP archive.
fr: :exc:`ZipImportError` est levée si *archivepath* ne pointe pas vers une archive ZIP valide.

source: Implementation of :meth:`importlib.abc.Loader.create_module` that returns :const:`None` to explicitly request the default semantics.
fr: Implémentation de :meth:`importlib.abc.Loader.create_module`. Elle renvoie toujours :const:`None`, ce qui déclenche le mécanisme standard.

source: Implementation of :meth:`importlib.abc.Loader.exec_module`.
fr: Implémentation de :meth:`importlib.abc.Loader.exec_module`.

source: An implementation of :meth:`importlib.abc.PathEntryFinder.find_spec`.
fr: Implémentation de :meth:`importlib.abc.PathEntryFinder.find_spec`.

source: Return the code object for the specified module. Raise :exc:`ZipImportError` if the module couldn't be imported.
fr: Renvoie l'objet de code pour le module spécifié. Lève :exc:`ZipImportError` si l'importation a échoué.

source: Return the data associated with *pathname*. Raise :exc:`OSError` if the file wasn't found.
fr: Renvoie les données associées à *pathname*. Lève :exc:`OSError` si le fichier n'a pas été trouvé.

source: Return the value ``__file__`` would be set to if the specified module was imported. Raise :exc:`ZipImportError` if the module couldn't be imported.
fr: Renvoie la valeur ``__file____`` qui serait définie si le module spécifié était importé. Lève :exc:`ZipImportError` si l'importation a échoué.

source: Return the source code for the specified module. Raise :exc:`ZipImportError` if the module couldn't be found, return :const:`None` if the archive does contain the module, but has no source for it.
fr: Renvoie le code source du module spécifié. Lève :exc:`ZipImportError` si le module n'a pas pu être trouvé, renvoie :const:`None` si l'archive contient le module, mais n'en a pas la source.

source: Return ``True`` if the module specified by *fullname* is a package. Raise :exc:`ZipImportError` if the module couldn't be found.
fr: Renvoie ``True`` si le module spécifié par *fullname* est un paquet. Lève :exc:`ZipImportError` si le module n'a pas pu être trouvé.

source: Load the module specified by *fullname*. *fullname* must be the fully qualified (dotted) module name. Returns the imported module on success, raises :exc:`ZipImportError` on failure.
fr: Charge et renvoie le module spécifié par *fullname*, qui doit être le nom du module entièrement qualifié (avec des points). Lève :exc:`ZipImportError` si l'importation a échoué.

source: Use :meth:`exec_module` instead.
fr: utilisez plutôt :meth:`exec_module`.

source: Clear out the internal cache of information about files found within the ZIP archive.
fr: Efface le cache interne des informations sur les fichiers à l'intérieur de l'archive ZIP.

source: The file name of the importer's associated ZIP file, without a possible subpath.
fr: Le nom de fichier de l'archive ZIP associé à l'importateur, sans sous-chemin à l'intérieur.

source: The subpath within the ZIP file where modules are searched. This is the empty string for zipimporter objects which point to the root of the ZIP file.
fr: Le sous-chemin du fichier ZIP où les modules sont recherchés. C'est la chaîne vide pour les objets *zipimporter* qui pointent vers la racine du fichier ZIP.

source: The :attr:`archive` and :attr:`prefix` attributes, when combined with a slash, equal the original *archivepath* argument given to the :class:`zipimporter` constructor.
fr: On a schématiquement :attr:`archive` + ``'/'`` + :attr:`prefix` == *archivepath*, où *archivepath* est l'argument donné au constructeur :class:`zipimporter`.

source: Examples
fr: Exemples

source: Here is an example that imports a module from a ZIP archive - note that the :mod:`zipimport` module is not explicitly used.
fr: Voici un exemple qui importe un module d'une archive ZIP — notez que le module :mod:`zipimport` n'est pas explicitement utilisé.
