Repository: python/python-docs-fr
Catalog: library/zlib.po
Languages: fr

source: The optional parameter *length* sets the initial size of the output buffer.
fr: Le paramètre optionnel *length* définit la taille initiale du tampon de sortie.

source: Returns a copy of the decompression object. This can be used to save the state of the decompressor midway through the data stream in order to speed up random seeks into the stream at a future point.
fr: Renvoie une copie du décompresseur. Vous pouvez l'utiliser pour sauvegarder l'état de la décompression en cours, afin de pouvoir revenir rapidement à cet endroit plus tard.

source: Added :func:`copy.copy` and :func:`copy.deepcopy` support to decompression objects.
fr: Ajout de :func:`copy.copy` et de :func:`copy.deepcopy` au support de décompression d'objets.

source: Information about the version of the zlib library in use is available through the following constants:
fr: Des informations relatives à la version de la bibliothèque *zlib* utilisée sont disponibles via les constantes suivantes :

source: The version string of the zlib library that was used for building the module. This may be different from the zlib library actually used at runtime, which is available as :const:`ZLIB_RUNTIME_VERSION`.
fr: Version de la bibliothèque *zlib* utilisée lors de la compilation du module. Elle peut être différente de la bibliothèque *zlib* actuellement utilisée par le système, qui est consultable par :const:`ZLIB_RUNTIME_VERSION`.

source: The version string of the zlib library actually loaded by the interpreter.
fr: Chaîne contenant la version de la bibliothèque *zlib* actuellement utilisée par l'interpréteur.

source: Reading and writing :program:`gzip`\ -format files.
fr: Lire et écrire des fichiers au format :program:`gzip`.

source: The zlib library home page.
fr: Page officielle de la bibliothèque *zlib*.

source: The zlib manual explains the semantics and usage of the library's many functions.
fr: La documentation de *zlib* explique le sens et l'utilisation des nombreuses fonctions fournies par la bibliothèque.
