Repository: python/python-docs-fr
Catalog: library/zoneinfo.po
Languages: fr

source: :mod:`zoneinfo` --- IANA time zone support
fr: :mod:`zoneinfo` — Prise en charge des fuseaux horaires IANA

source: The :mod:`zoneinfo` module provides a concrete time zone implementation to support the IANA time zone database as originally specified in :pep:`615`. By default, :mod:`zoneinfo` uses the system's time zone data if available; if no system time zone data is available, the library will fall back to using the first-party `tzdata`_ package available on PyPI.
fr: Le module :mod:`zoneinfo` fournit une implémentation concrète des fuseaux horaires qui s'appuie sur la base de données de fuseaux horaires IANA spécifiée initialement dans la :pep:`615`. Par défaut, :mod:`zoneinfo` utilise les données des fuseaux horaires du système si elles sont disponibles, sinon la bibliothèque utilise le paquet quasi-natif `tzdata`_ disponible sur PyPI.

source: Provides the :class:`~datetime.time` and :class:`~datetime.datetime` types with which the :class:`ZoneInfo` class is designed to be used.
fr: Fournit les types :class:`~datetime.time` et :class:`~datetime.datetime` attendus par :class:`ZoneInfo`.

source: Package `tzdata`_
fr: Paquet `tzdata`_

source: First-party package maintained by the CPython core developers to supply time zone data via PyPI.
fr: Paquet « quasi-natif » maintenu par les développeurs de CPython pour fournir les données des fuseaux horaires via PyPI.

source: Using ``ZoneInfo``
fr: Utilisation de ``ZoneInfo``

source: :class:`ZoneInfo` is a concrete implementation of the :class:`datetime.tzinfo` abstract base class, and is intended to be attached to ``tzinfo``, either via the constructor, the :meth:`datetime.replace <datetime.datetime.replace>` method or :meth:`datetime.astimezone <datetime.datetime.astimezone>`::
fr: :class:`ZoneInfo` est une implémentation concrète de la classe de base abstraite :class:`datetime.tzinfo`, et est destinée à être rattachée à ``tzinfo``, par le constructeur, par :meth:`datetime.replace <datetime.datetime.replace>` ou par :meth:`datetime.astimezone <datetime.datetime.astimezone>` ::

source: Datetimes constructed in this way are compatible with datetime arithmetic and handle daylight saving time transitions with no further intervention::
fr: Les *datetime* construits de cette manière sont compatibles avec l'arithmétique *datetime* et gèrent le passage à l'heure d'été sans autre intervention ::

source: These time zones also support the :attr:`~datetime.datetime.fold` attribute introduced in :pep:`495`. During offset transitions which induce ambiguous times (such as a daylight saving time to standard time transition), the offset from *before* the transition is used when ``fold=0``, and the offset *after* the transition is used when ``fold=1``, for example::
fr: Ces fuseaux horaires prennent aussi en charge l'attribut :attr:`~datetime.dateime.fold` introduit dans la :pep:`495`. Pendant les transitions des décalages horaires qui induisent des temps ambigus (comme le passage de l'heure d'été à l'heure normale), le décalage *avant* la transition est utilisé quand ``fold=0``, et le décalage *après* la transition est utilisé quand ``fold=1``, par exemple ::

source: When converting from another time zone, the fold will be set to the correct value::
fr: Lors de la conversion à partir d'un autre fuseau horaire, *fold* sera réglé à la valeur correcte ::

source: Data sources
fr: Sources de données

source: The ``zoneinfo`` module does not directly provide time zone data, and instead pulls time zone information from the system time zone database or the first-party PyPI package `tzdata`_, if available. Some systems, including notably Windows systems, do not have an IANA database available, and so for projects targeting cross-platform compatibility that require time zone data, it is recommended to declare a dependency on tzdata. If neither system data nor tzdata are available, all calls to :class:`ZoneInfo` will raise :exc:`ZoneInfoNotFoundError`.
fr: Le module ``zoninfo`` ne fournit pas de données de fuseaux horaires directement, mais extrait des informations sur les fuseaux horaires de la base de données des fuseaux horaires du système ou du paquet PyPI quasi-natif `tzdata`_, s'ils sont disponibles. Certains systèmes, comme les systèmes Windows, n'ont pas de base de données IANA, et donc il est recommandé aux projets visant la compatibilité entre plates-formes et qui nécessitent des données sur les fuseaux horaires, de déclarer une dépendance à *tzdata*. Si aucune donnée système, ni *tzdata*, n'est disponible, tous les appels à :class:`ZoneInfo` lèvent :exc:`ZoneInfoNotFoundError`.

source: Configuring the data sources
fr: Configurer les sources de données

source: When ``ZoneInfo(key)`` is called, the constructor first searches the directories specified in :data:`TZPATH` for a file matching ``key``, and on failure looks for a match in the tzdata package. This behavior can be configured in three ways:
fr: Lorsque ``ZoneInfo(key)`` est appelé, le constructeur recherche d'abord un fichier nommé ``key`` dans les répertoires spécifiés par :data:`TZPATH` et, en cas d'échec, recherche dans le paquet *tzdata*. Ce comportement peut être configuré de trois manières :

source: The default :data:`TZPATH` when not otherwise specified can be configured at :ref:`compile time <zoneinfo_data_compile_time_config>`.
fr: La valeur par défaut :data:`TZPATH`, lorsqu'elle n'est pas spécifiée autrement, peut être configurée à :ref:`la compilation <zoneinfo_data_compile_time_config>`.

source: :data:`TZPATH` can be configured using :ref:`an environment variable <zoneinfo_data_environment_var>`.
fr: :data:`TZPATH` peut être configuré en utilisant :ref:`une variable d'environnement <zoneinfo_data_environment_var>`.

source: At :ref:`runtime <zoneinfo_data_runtime_config>`, the search path can be manipulated using the :func:`reset_tzpath` function.
fr: À :ref:`l'exécution <zoneinfo_data_runtime_config>`, le chemin de recherche peut être manipulé à l'aide de la fonction :func:`reset_tzpath`.

source: Compile-time configuration
fr: Configuration à la compilation

source: On all platforms, the configured value is available as the ``TZPATH`` key in :func:`sysconfig.get_config_var`.
fr: Sur toutes les plates-formes, la valeur configurée est disponible en tant que clé de ``TZPATH`` dans :func:`sysconfig.get_config_var`.

source: Environment configuration
fr: Configuration par l'environnement

source: When initializing :data:`TZPATH` (either at import time or whenever :func:`reset_tzpath` is called with no arguments), the ``zoneinfo`` module will use the environment variable ``PYTHONTZPATH``, if it exists, to set the search path.
fr: Lors de l'initialisation de :data:`TZPATH` (soit au moment de l'importation, soit lorsque :func:`reset_tzpath` est appelé sans argument), le module ``zoneinfo`` utilise la variable d'environnement ``PYTHONTZPATH``, si elle existe, pour définir le chemin de recherche.

source: This is an :data:`os.pathsep`-separated string containing the time zone search path to use. It must consist of only absolute rather than relative paths. Relative components specified in ``PYTHONTZPATH`` will not be used, but otherwise the behavior when a relative path is specified is implementation-defined; CPython will raise :exc:`InvalidTZPathWarning`, but other implementations are free to silently ignore the erroneous component or raise an exception.
fr: Il s'agit d'une chaîne séparée par :data:`os.pathsep` contenant le chemin de recherche du fuseau horaire à utiliser. Elle doit être constituée uniquement de chemins absolus et non de chemins relatifs. Les composants relatifs spécifiés dans ``PYTHONTZPATH`` ne sont pas utilisés, mais le comportement reste défini par l'implémentation lorsqu'un chemin relatif est spécifié. CPython lève :exc:`InvalidTZPathWarning` dans ce cas. Les autres implémentations sont libres d'ignorer silencieusement le composant erroné ou de lever une exception.

source: To set the system to ignore the system data and use the tzdata package instead, set ``PYTHONTZPATH=""``.
fr: Pour que le système ignore les données système et utilise le paquet *tzdata* à la place, définissez ``PYTHONTZPATH=""``.

source: Runtime configuration
fr: Configuration à l'exécution

source: The TZ search path can also be configured at runtime using the :func:`reset_tzpath` function. This is generally not an advisable operation, though it is reasonable to use it in test functions that require the use of a specific time zone path (or require disabling access to the system time zones).
fr: Le chemin de recherche *TZ* peut également être configuré au moment de l'exécution à l'aide de la fonction :func:`reset_tzpath`. Cette opération n'est généralement pas conseillée, bien qu'il soit raisonnable de l'utiliser dans les fonctions de test qui nécessitent l'utilisation d'un chemin de fuseau horaire spécifique (ou qui nécessitent de désactiver l'accès aux fuseaux horaires du système).

source: The ``ZoneInfo`` class
fr: La classe ``ZoneInfo``

source: A concrete :class:`datetime.tzinfo` subclass that represents an IANA time zone specified by the string ``key``. Calls to the primary constructor will always return objects that compare identically; put another way, barring cache invalidation via :meth:`ZoneInfo.clear_cache`, for all values of ``key``, the following assertion will always be true:
fr: Une sous-classe concrète de :class:`datetime.tzinfo` qui représente un fuseau horaire IANA spécifié par la chaîne ``key``. Les appels au constructeur principal renvoient toujours des objets dont la comparaison est identique ; autrement dit, sauf invalidation du cache via :meth:`ZoneInfo.clear_cache`, pour toutes les valeurs de ``key``, l'assertion suivante est toujours vraie :

source: ``key`` must be in the form of a relative, normalized POSIX path, with no up-level references. The constructor will raise :exc:`ValueError` if a non-conforming key is passed.
fr: ``key`` doit être sous la forme d'un chemin POSIX relatif et normalisé, sans références de niveau supérieur. Le constructeur lève :exc:`ValueError` si une clé non conforme est passée.

source: If no file matching ``key`` is found, the constructor will raise :exc:`ZoneInfoNotFoundError`.
fr: Si aucun fichier correspondant à ``key`` n'est trouvé, le constructeur lève :exc:`ZoneInfoNotFoundError`.

source: The ``ZoneInfo`` class has two alternate constructors:
fr: La classe ``ZoneInfo`` possède deux constructeurs alternatifs :

source: Constructs a ``ZoneInfo`` object from a file-like object returning bytes (e.g. a file opened in binary mode or an :class:`io.BytesIO` object). Unlike the primary constructor, this always constructs a new object.
fr: Construit un objet ``ZoneInfo`` à partir d'un objet fichier renvoyant des octets (par exemple, un fichier ouvert en mode binaire ou un objet :class:`io.BytesIO`). Contrairement au constructeur principal, il construit toujours un nouvel objet.

source: The ``key`` parameter sets the name of the zone for the purposes of :py:meth:`~object.__str__` and :py:meth:`~object.__repr__`.
fr: Le paramètre ``key`` définit le nom de la zone pour les besoins de :py:meth:`~object.__str__` et :py:meth:`~object.__repr__`.

source: Objects created via this constructor cannot be pickled (see `pickling`_).
fr: Les objets créés via ce constructeur ne peuvent pas être sérialisés (voir `pickling`_).

source: An alternate constructor that bypasses the constructor's cache. It is identical to the primary constructor, but returns a new object on each call. This is most likely to be useful for testing or demonstration purposes, but it can also be used to create a system with a different cache invalidation strategy.
fr: Un constructeur alternatif qui contourne le cache du constructeur. Il est identique au constructeur principal, mais renvoie un nouvel objet à chaque appel. Il est surtout utile à des fins de test ou de démonstration, mais il peut également être utilisé pour créer un système avec une stratégie d'invalidation du cache différente.

source: Objects created via this constructor will also bypass the cache of a deserializing process when unpickled.
fr: Les objets créés via ce constructeur contournent également le cache d'un processus de *désérialisation* lorsqu'ils sont désérialisés.

source: Using this constructor may change the semantics of your datetimes in surprising ways, only use it if you know that you need to.
fr: L'utilisation de ce constructeur peut modifier la sémantique de vos *datetimes* de manière surprenante, ne l'utilisez que si vous en avez vraiment besoin.

source: The following class methods are also available:
fr: Les méthodes de classe suivantes sont également disponibles :

source: A method for invalidating the cache on the ``ZoneInfo`` class. If no arguments are passed, all caches are invalidated and the next call to the primary constructor for each key will return a new instance.
fr: Une méthode pour invalider le cache de la classe ``ZoneInfo``. Si aucun argument n'est passé, tous les caches sont invalidés et le prochain appel au constructeur principal pour chaque clé renverra une nouvelle instance.

source: If an iterable of key names is passed to the ``only_keys`` parameter, only the specified keys will be removed from the cache. Keys passed to ``only_keys`` but not found in the cache are ignored.
fr: Si un itérable de noms de clés est passé au paramètre ``only_keys``, seules les clés spécifiées sont retirées du cache. Les clés passées à ``only_keys`` mais non trouvées dans le cache sont ignorées.

source: Invoking this function may change the semantics of datetimes using ``ZoneInfo`` in surprising ways; this modifies process-wide global state and thus may have wide-ranging effects. Only use it if you know that you need to.
fr: L'invocation de cette fonction peut changer la sémantique des *datetimes* utilisant ``ZoneInfo`` de manière surprenante ; cela modifie l'état global du processus et peut donc avoir des effets étendus. Ne l'utilisez que si vous en avez vraiment besoin.

source: The class has one attribute:
fr: La classe a un attribut :

source: This is a read-only :term:`attribute` that returns the value of ``key`` passed to the constructor, which should be a lookup key in the IANA time zone database (e.g. ``America/New_York``, ``Europe/Paris`` or ``Asia/Tokyo``).
fr: Il s'agit d'un :term:`attribut` en lecture seule qui renvoie la valeur de ``key`` passée au constructeur, qui doit être une clé de recherche dans la base de données des fuseaux horaires de l'IANA (par exemple, ``America/New_York``, ``Europe/Paris`` ou ``Asia/Tokyo``).

source: For zones constructed from file without specifying a ``key`` parameter, this will be set to ``None``.
fr: Pour les zones construites à partir d'un fichier sans spécifier de paramètre ``key``, cette valeur sera fixée à ``None``.

source: Although it is a somewhat common practice to expose these to end users, these values are designed to be primary keys for representing the relevant zones and not necessarily user-facing elements. Projects like CLDR (the Unicode Common Locale Data Repository) can be used to get more user-friendly strings from these keys.
fr: Bien qu'il soit assez courant de les exposer aux utilisateurs finaux, ces valeurs sont conçues pour être des clés primaires permettant de représenter les zones concernées et pas nécessairement des éléments destinés à l'utilisateur. Des projets comme CLDR (Unicode Common Locale Data Repository) peuvent être utilisés pour obtenir des chaînes de caractères plus conviviales à partir de ces clés.

source: String representations
fr: Représentation sous forme de chaîne de caractères

source: Functions
fr: Fonctions
