Repository: python/python-docs-fr
Catalog: distributing/index.po
Languages: fr

source: Distributing Python Modules
fr: Distribuer des modules Python

source: As a popular open source development project, Python has an active supporting community of contributors and users that also make their software available for other Python developers to use under open source license terms.
fr: En tant que logiciel libre populaire, Python bénéficie d'une communauté active de contributeurs et d'utilisateurs qui rendent à leur tour leurs logiciels disponibles, sous licence libre, pour les autres développeurs Python.

source: This allows Python users to share and collaborate effectively, benefiting from the solutions others have already created to common (and sometimes even rare!) problems, as well as potentially contributing their own solutions to the common pool.
fr: Cela permet aux utilisateurs de Python de partager et de collaborer efficacement, bénéficiant des solutions que les autres ont déjà crées pour résoudre les problèmes communs (ou même, parfois, rares !), aussi que de partager leurs propres solutions à tous.

source: This guide covers the distribution part of the process. For a guide to installing other Python projects, refer to the :ref:`installation guide <installing-index>`.
fr: Ce guide couvre la partie distribution du processus. Pour un guide sur l'installation d'autres projets Python, voir :ref:`installation guide <installing-index>`.

source: For corporate and other institutional users, be aware that many organisations have their own policies around using and contributing to open source software. Please take such policies into account when making use of the distribution and installation tools provided with Python.
fr: Pour les entreprises et autres institutions, gardez en tête que certaines organisations ont leurs propres règles sur l'utilisation et la contribution au logiciel libre. Prenez ces règles en compte lorsque vous utilisez les outils de distribution et d'installation fournis par Python.

source: Key terms
fr: Vocabulaire

source: the `Python Packaging Index <https://pypi.org>`__ is a public repository of open source licensed packages made available for use by other Python users
fr: le `Python Packaging Index <https://pypi.org/pypi>`__ est un dépôt public de paquets sous licence libre rendus disponibles par d'autres utilisateurs Python

source: the `Python Packaging Authority <https://www.pypa.io/>`__ are the group of developers and documentation authors responsible for the maintenance and evolution of the standard packaging tools and the associated metadata and file format standards. They maintain a variety of tools, documentation and issue trackers on both `GitHub <https://github.com/pypa>`__ and `Bitbucket <https://bitbucket.org/pypa/>`__.
fr: le `Python Packaging Authority <https://www.pypa.io>`__ est le groupe de développeurs et d'auteurs de documentation responsables de la maintenance et de l'évolution des outils standards de création de paquets, des métadonnées, et des formats de fichiers standards. Ils maintiennent quelques outils, documentation, et gestionnaires de ticket, aussi bien sur `GitHub <https://github.com/pypa>`__ que sur `Bitbucket <https://bitbucket.org/pypa/>`__.

source: :mod:`distutils` is the original build and distribution system first added to the Python standard library in 1998. While direct use of :mod:`distutils` is being phased out, it still laid the foundation for the current packaging and distribution infrastructure, and it not only remains part of the standard library, but its name lives on in other ways (such as the name of the mailing list used to coordinate Python packaging standards development).
fr: :mod:`distutils` est le premier système de construction et de distribution ajouté à la bibliothèque standard en 1998. Bien que l'utilisation directe de :mod:`distutils` est progressivement supprimée, elle reste le fondement de l'infrastructure actuelle de construction de paquet et de distribution. Au delà de rester dans la bibliothèque standard, son nom vit aussi sous d'autres formes, tel que la liste de diffusion utilisée pour coordonner le développement et les standards de la création de paquet.

source: `setuptools`_ is a (largely) drop-in replacement for :mod:`distutils` first published in 2004. Its most notable addition over the unmodified :mod:`distutils` tools was the ability to declare dependencies on other packages. It is currently recommended as a more regularly updated alternative to :mod:`distutils` that offers consistent support for more recent packaging standards across a wide range of Python versions.
fr: `setuptools`_, d'abord publié en 2004, est (en grande partie) le remplaçant de :mod:`distutils`. La nouveauté la plus notable, au delà des outils non modifiés de :mod:`distutils` est la possibilité de déclarer des dépendances à d'autres paquets. C'est l'alternative actuellement recommandée car plus régulièrement mise à jour que :mod:`distutils` et gère mieux les standards de création de paquets actuels, pour un large choix de version de Python.

source: `wheel`_ (in this context) is a project that adds the ``bdist_wheel`` command to :mod:`distutils`/`setuptools`_. This produces a cross platform binary packaging format (called "wheels" or "wheel files" and defined in :pep:`427`) that allows Python libraries, even those including binary extensions, to be installed on a system without needing to be built locally.
fr: `wheel`_ (dans ce contexte) est un projet qui ajoute la commande ``bdist_wheel`` à :mod:`distutils`/`setuptools`_. Cela produit un paquet binaire multiplateforme (nommé "*wheels*" ou "*wheel files*" et définis dans la :pep:`427`) qui permet aux bibliothèques Python, même celles incluant des extensions binaires, d'être installées sur un système sans avoir à les compiler localement.

source: Open source licensing and collaboration
fr: Licence libre et collaboration

source: In most parts of the world, software is automatically covered by copyright. This means that other developers require explicit permission to copy, use, modify and redistribute the software.
fr: Dans la plupart des pays du monde, le logiciel est automatiquement couvert par les droits d'auteur. Cela signifie que les autres développeurs ont besoin d'une autorisation explicite pour copier, utiliser, modifier, et redistribuer le logiciel.

source: Open source licensing is a way of explicitly granting such permission in a relatively consistent way, allowing developers to share and collaborate efficiently by making common solutions to various problems freely available. This leaves many developers free to spend more time focusing on the problems that are relatively unique to their specific situation.
fr: Les licences libres sont un moyen d'autoriser explicitement ces permissions par un moyen relativement cohérent, autorisant les développeurs à partager et collaborer efficacement en rendant des solutions communes à divers problèmes librement disponibles. Cela laisse beaucoup de développeurs libres de dépenser plus de temps concentrés sur des problèmes relativement uniques à leur cas spécifiques.

source: The distribution tools provided with Python are designed to make it reasonably straightforward for developers to make their own contributions back to that common pool of software if they choose to do so.
fr: Les outils de distribution fournis avec Python sont conçus pour rendre la vie des développeurs relativement simple lorsqu'ils souhaitent contribuer, s'il le désirent, à ces ressources communes.

source: The same distribution tools can also be used to distribute software within an organisation, regardless of whether that software is published as open source software or not.
fr: Ces mêmes outils de distribution peuvent aussi être utilisés pour distribuer du logiciel à l'intérieur d'une organisation, que ce soit du logiciel libre ou non.

source: Installing the tools
fr: Installer les outils

source: The standard library does not include build tools that support modern Python packaging standards, as the core development team has found that it is important to have standard tools that work consistently, even on older versions of Python.
fr: La bibliothèque standard n'inclut pas d'outils capable de créer des paquets selon les standards modernes, car l'équipe fondamentale de développement à trouvé qu'il était plus important d'avoir des outils standards qui fonctionnent de manière cohérente, même avec de plus vieilles versions de Python.

source: The currently recommended build and distribution tools can be installed by invoking the ``pip`` module at the command line::
fr: Les outils de construction de paquets et de distribution actuellement recommandées peuvent être installées en invoquant le module ``pip`` dans une invite de commande ::

source: For POSIX users (including Mac OS X and Linux users), these instructions assume the use of a :term:`virtual environment`.
fr: Pour les utilisateurs d'environnements POSIX (incluant Mac OS X et les utilisateurs de Linux), ces instructions supposent l'utilisation d'un :term:`environnement virtuel`.

source: For Windows users, these instructions assume that the option to adjust the system PATH environment variable was selected when installing Python.
fr: Pour les utilisateurs de Windows, ces instructions supposent que l'option proposant de modifier la variable d'environnement PATH à été cochée lors de l'installation de Python.

source: The Python Packaging User Guide includes more details on the `currently recommended tools`_.
fr: Le *Python Packaging User Guide* contient plus de détails sur les `(en) outils actuellement recommandés <currently recommended tools_>`_.

source: Reading the Python Packaging User Guide
fr: Consultez le *Python Packaging User Guide*

source: The Python Packaging User Guide covers the various key steps and elements involved in creating and publishing a project:
fr: Le *Python Packaging User Guide* couvre les différentes étapes et les éléments clés de la création et publication d'un projet :

source: `Project structure`_
fr: `(en) Structure d'un projet <Project structure_>`_

source: `Building and packaging the project`_
fr: `(en) Construire et empaqueter le projet <Building and packaging the project_>`_

source: `Uploading the project to the Python Packaging Index`_
fr: `(en) Téléverser le projet sur le Python Packaging Index <Uploading the project to the Python Packaging Index_>`_

source: How do I...?
fr: Comment puis-je ...?

source: These are quick answers or links for some common tasks.
fr: Ce sont des réponses rapides ou des liens pour certaines tâches courantes.

source: ... choose a name for my project?
fr: ... choisir un nom pour mon projet ?

source: This isn't an easy topic, but here are a few tips:
fr: Ce n'est pas un sujet facile, mais voici quelques conseils :

source: check the Python Packaging Index to see if the name is already in use
fr: vérifiez dans le *Python Packaging Index* si le nom est déjà utilisé

source: check popular hosting sites like GitHub, Bitbucket, etc to see if there is already a project with that name
fr: vérifiez sur quelques sites d'hébergement populaires tels que GitHub, Bitbucket, etc pour voir s'il y existe déjà un projet avec ce nom

source: check what comes up in a web search for the name you're considering
fr: vérifiez ce qui sort en recherchant sur le web le nom que vous envisagez

source: avoid particularly common words, especially ones with multiple meanings, as they can make it difficult for users to find your software when searching for it
fr: évitez les mots trop communs, plus particulièrement ceux ayant plusieurs significations, car pour vos utilisateurs, cela complique la recherche de votre logiciel

source: ... create and distribute binary extensions?
fr: ... créer et distribuer des extensions binaires ?

source: This is actually quite a complex topic, with a variety of alternatives available depending on exactly what you're aiming to achieve. See the Python Packaging User Guide for more information and recommendations.
fr: C'est un sujet particulièrement compliqué, avec pléthore alternatives disponibles dont le choix dépend de votre objectif exact. Voir le *Python Packaging User Guide* pour plus d'informations et de recommandations.
