Repository: python/python-docs-fr
Catalog: distutils/apiref.po
Languages: fr

source: Preprocess a single C/C++ source file, named in *source*. Output will be written to file named *output_file*, or *stdout* if *output_file* not supplied. *macros* is a list of macro definitions as for :meth:`compile`, which will augment the macros set with :meth:`define_macro` and :meth:`undefine_macro`. *include_dirs* is a list of directory names that will be added to the default list, in the same way as :meth:`add_include_dir`.
fr: Prétraitement d'un seul fichier source C/C++, désigné dans *source*. La sortie du traitement est écrite dans un fichier nommé *output_file*, ou dans *stdout* si *output_file* n'est pas fourni. *macros* est une liste de définitions de macros comme pour :meth:`compile`, qui vont s'ajouter aux macros définies avec :meth:`define_macro` et :meth:`undefine_macro`. *include_dirs* est une liste de noms de répertoires qui seront ajoutés à la liste par défaut, de la même manière que :meth:`add_include_dir`.

source: Raises :exc:`PreprocessError` on failure.
fr: Lève :exc:`PreprocessError` en cas d'échec.

source: The following utility methods are defined by the :class:`CCompiler` class, for use by the various concrete subclasses.
fr: Les méthodes utilitaires suivantes sont définies par la classe :class:`CCompiler`, à l'usage des différentes sous-classes concrètes.

source: Returns the filename of the executable for the given *basename*. Typically for non-Windows platforms this is the same as the basename, while Windows will get a :file:`.exe` added.
fr: Renvoie le nom de fichier de l'exécutable pour un *nom de base* donné. Généralement, pour les plates-formes non Windows, c'est le même nom que le nom de base, tandis que sur Windows l'extension :file:`.exe` sera ajouté.

source: Returns the filename for the given library name on the current platform. On Unix a library with *lib_type* of ``'static'`` will typically be of the form :file:`liblibname.a`, while a *lib_type* of ``'dynamic'`` will be of the form :file:`liblibname.so`.
fr: Renvoie le nom de fichier pour le nom de bibliothèque donné sur la plate-forme actuelle. Sous Unix, une bibliothèque avec un *lib_type* de type ``static`` sera généralement de la forme :file:`liblibname.a`, tandis qu'un *lib_type* de type ``dynamic`` sera de la forme :file:`liblibname.so`.

source: Returns the name of the object files for the given source files. *source_filenames* should be a list of filenames.
fr: Renvoie le nom des fichiers objets pour les fichiers sources donnés. *source_filenames* doit être une liste de noms de fichiers.

source: Returns the name of a shared object file for the given file name *basename*.
fr: Renvoie le nom d'un fichier objet partagé pour le nom de fichier *basename*.

source: Invokes :func:`distutils.util.execute`. This method invokes a Python function *func* with the given arguments *args*, after logging and taking into account the *dry_run* flag.
fr: Invoque :func:`distutils.util.execute`. Cette méthode invoque une fonction Python *func* avec les arguments *args* , après journalisation et prise en compte de l'option *dry_run*.

source: Invokes :func:`distutils.util.spawn`. This invokes an external process to run the given command.
fr: Invoque :func:`distutils.util.spawn`. Invoque un processus externe pour exécuter la commande donnée.

source: Invokes :func:`distutils.dir_util.mkpath`. This creates a directory and any missing ancestor directories.
fr: Invoque :func:`distutils.dir_util.mkpath`. Crée un répertoire et tous les répertoires parents manquants.

source: Invokes :meth:`distutils.file_util.move_file`. Renames *src* to *dst*.
fr: Invoque :meth:`distutils.file_util.move_file`. Renomme *src* en *dst*.

source: Write a message using :func:`distutils.log.debug`.
fr: Écrit un message en utilisant :func:`distutils.log.debug`.

source: Write a warning message *msg* to standard error.
fr: Écris un message d'avertissement *msg* dans la sortie d'erreur standard.

source: If the *debug* flag is set on this :class:`CCompiler` instance, print *msg* to standard output, otherwise do nothing.
fr: Si l'option *debug* est activée pour cette instance de :class:`CCompiler`, affiche *msg* sur la sortie standard, sinon rien ne s'affiche.

source: :mod:`distutils.unixccompiler` --- Unix C Compiler
fr: :mod:`distutils.unixccompiler` — Compilateur C Unix

source: This module provides the :class:`UnixCCompiler` class, a subclass of :class:`CCompiler` that handles the typical Unix-style command-line C compiler:
fr: Ce module fournit la classe :class:`UnixCCompiler`, une sous-classe de la classe :class:`CCompiler` qui gère les compilateurs C ayant une interface en ligne de commande conforme au standard Unix :

source: macros defined with :option:`!-Dname[=value]`
fr: macros définies avec l'option :option:`!-Dname[=value]`.

source: macros undefined with :option:`!-Uname`
fr: macros désaffectées avec :option:`!-Uname`.

source: include search directories specified with :option:`!-Idir`
fr: inclut les répertoires de recherche spécifiés avec l'option :option:`!-Idir`.

source: libraries specified with :option:`!-llib`
fr: bibliothèques spécifiées avec l'option :option:`!-llib`

source: library search directories specified with :option:`!-Ldir`
fr: répertoires de recherche des bibliothèques définis avec l'option :option:`!-Ldir`.

source: compile handled by :program:`cc` (or similar) executable with :option:`!-c` option: compiles :file:`.c` to :file:`.o`
fr: compilation gérée par :program:`cc` (ou similaire) exécutable avec l'option :option:`!-c` compile :file:`.c` vers :file:`.o`.

source: link static library handled by :program:`ar` command (possibly with :program:`ranlib`)
fr: édition de liens pour une bibliothèque statique gérée par le programme en ligne de commande :program:`ar` (éventuellement avec le programme :program:`ranlib`).

source: link shared library handled by :program:`cc` :option:`!-shared`
fr: édition de liens pour une bibliothèque gérée par :program:`cc` :option:`!-shared`.

source: :mod:`distutils.msvccompiler` --- Microsoft Compiler
fr: :mod:`distutils.msvccompiler` — Compilateur Microsoft

source: This module provides :class:`MSVCCompiler`, an implementation of the abstract :class:`CCompiler` class for Microsoft Visual Studio. Typically, extension modules need to be compiled with the same compiler that was used to compile Python. For Python 2.3 and earlier, the compiler was Visual Studio 6. For Python 2.4 and 2.5, the compiler is Visual Studio .NET 2003.
fr: Ce module fournit :class:`MSVCCompiler`, une implémentation de la classe abstraite :class:`CCompiler` pour Microsoft Visual Studio. Généralement, les modules d'extension doivent être compilés avec le même compilateur que celui utilisé pour compiler Python. Pour Python 2.3 et les versions antérieures, le compilateur était Visual Studio 6. Pour Python 2.4 et 2.5, le compilateur est Visual Studio .NET 2003.

source: :class:`MSVCCompiler` will normally choose the right compiler, linker etc. on its own. To override this choice, the environment variables *DISTUTILS_USE_SDK* and *MSSdk* must be both set. *MSSdk* indicates that the current environment has been setup by the SDK's ``SetEnv.Cmd`` script, or that the environment variables had been registered when the SDK was installed; *DISTUTILS_USE_SDK* indicates that the distutils user has made an explicit choice to override the compiler selection by :class:`MSVCCompiler`.
fr: La classe :class:`MSVCCompiler` sélectionnera normalement le bon compilateur, éditeur de liens, etc. Pour remplacer ces choix, les variables d'environnement *DISTUTILS_USE_SDK* et *MSSdk* doivent être toutes les deux définies. *MSSdk* indique que l'environnement courant a été configuré par le script ``SetEnv.Cmd`` du kit de développement logiciel (*SDK*), ou que les variables d'environnement ont été enregistrées lorsque le kit a été installé ; *DISTUTILS_USE_SDK* indique que l'utilisateur de *distutils* a choisi explicitement de remplacer le compilateur utilisé par :class:`MSVCCompiler`.

source: :mod:`distutils.bcppcompiler` --- Borland Compiler
fr: :mod:`distutils.bcppcompiler` — Compilateur Borland

source: This module provides :class:`BorlandCCompiler`, a subclass of the abstract :class:`CCompiler` class for the Borland C++ compiler.
fr: Ce module fournit :class:`BorlandCCompiler`, une sous-classe de la classe abstraite :class:`CCompiler` classe pour le compilateur Borland C++.

source: :mod:`distutils.cygwincompiler` --- Cygwin Compiler
fr: :mod:`distutils.cygwincompiler` — Compilateur Cygwin

source: This module provides the :class:`CygwinCCompiler` class, a subclass of :class:`UnixCCompiler` that handles the Cygwin port of the GNU C compiler to Windows. It also contains the Mingw32CCompiler class which handles the mingw32 port of GCC (same as cygwin in no-cygwin mode).
fr: Ce module fournit la classe :class:`CygwinCCompiler`, une sous-classe de la classe :class:`UnixCCompiler` qui gère *Cygwin*, le portage du compilateur GNU C sur Windows. Il contient également la classe Mingw32CCompiler qui gère le portage *mingw32* de GCC (comme *cygwin* en mode *no-cygwin*).

source: :mod:`distutils.archive_util` --- Archiving utilities
fr: :mod:`distutils.archive_util` — Utilitaires d'archivage

source: This module provides a few functions for creating archive files, such as tarballs or zipfiles.
fr: Ce module fournit quelques fonctions pour créer des fichiers d'archive, tels que des archives aux formats *tarballs* ou *zipfiles*.

source: Create an archive file (eg. ``zip`` or ``tar``). *base_name* is the name of the file to create, minus any format-specific extension; *format* is the archive format: one of ``zip``, ``tar``, ``gztar``, ``bztar``, ``xztar``, or ``ztar``. *root_dir* is a directory that will be the root directory of the archive; ie. we typically ``chdir`` into *root_dir* before creating the archive. *base_dir* is the directory where we start archiving from; ie. *base_dir* will be the common prefix of all files and directories in the archive. *root_dir* and *base_dir* both default to the current directory. Returns the name of the archive file.
fr: Crée un fichier d'archive (par exemple ``zip`` ou ``tar``). *base_name* est le nom du fichier à créer, sans extension spécifique indiquant le format. *format* est le format d'archive : un parmi ``zip``, ``tar``, ``gztar``, ``bztar``, ``xztar``, ``xztar``, ou ``ztar``. *root_dir* est un répertoire qui sera le répertoire racine de l'archive ; c'est-à-dire que le programme se positionne dans *root_dir* avant de créer l'archive. *base_dir* est le répertoire à partir duquel se lance l'archivage ; par exemple, *base_dir* est le préfixe commun à tous les fichiers et répertoires de l'archive. *root_dir* et *base_dir* sont tous deux par défaut dans le répertoire courant. Renvoie le nom du fichier archive.

source: Added support for the ``xztar`` format.
fr: Ajout du support des fichiers ``xztar``.

source: 'Create an (optional compressed) archive as a tar file from all files in and under *base_dir*. *compress* must be ``'gzip'`` (the default), ``'bzip2'``, ``'xz'``, ``'compress'``, or ``None``. For the ``'compress'`` method the compression utility named by :program:`compress` must be on the default program search path, so this is probably Unix-specific. The output tar file will be named :file:`base_dir.tar`, possibly plus the appropriate compression extension (``.gz``, ``.bz2``, ``.xz`` or ``.Z``). Return the output filename.
fr: Crée une archive (compressée en option) sous forme de fichier au format *tar* à partir de tous les fichiers dans et sous *base_dir*. *compress* doit être ``'gzip'`` (par défaut), ``'bzip2'``, ``'xz'``, ``'compress'`` ou ``None``. Pour la méthode ``'compress'`` l'utilitaire de compression nommé par :program:`compress` doit être sur le chemin de recherche par défaut, donc c'est sans doute spécifique à Unix. Le fichier *tar* de sortie sera nommé :file:`base_dir.tar`, avec l'extension de compression appropriée (``.gz``, ``.bz2``, ``.xz`` ou ``.Z``). Renvoie le nom du fichier de sortie.

source: Added support for the ``xz`` compression.
fr: Ajout du support de la compression ``xz``.

source: Create a zip file from all files in and under *base_dir*. The output zip file will be named *base_name* + :file:`.zip`. Uses either the :mod:`zipfile` Python module (if available) or the InfoZIP :file:`zip` utility (if installed and found on the default search path). If neither tool is available, raises :exc:`DistutilsExecError`. Returns the name of the output zip file.
fr: Crée un fichier zip à partir de tous les fichiers dans et sous *base_dir*. Le fichier zip de sortie est nommé *base_name* + :file:`.zip`. Utilise soit le module Python :mod:`zipfile` (si disponible) ou l'utilitaire InfoZIP :file:`zip` (s'il est installé et trouvé sur le chemin de recherche par défaut). Si aucun des deux outils n'est disponible, lève :exc:`DistutilsExecError`. Renvoie le nom du fichier zip de sortie.

source: :mod:`distutils.dep_util` --- Dependency checking
fr: :mod:`distutils.dep_util` — Vérification des dépendances

source: This module provides functions for performing simple, timestamp-based dependency of files and groups of files; also, functions based entirely on such timestamp dependency analysis.
fr: Ce module fournit des fonctions permettant d'effectuer des tests de dépendance simples, basés sur les horodatages de fichiers et de groupes de fichiers, ainsi que des fonctionnalités entièrement basées sur ces analyses de dépendance par rapport aux horodatages.

source: Return true if *source* exists and is more recently modified than *target*, or if *source* exists and *target* doesn't. Return false if both exist and *target* is the same age or newer than *source*. Raise :exc:`DistutilsFileError` if *source* does not exist.
fr: Renvoie la valeur *true* si *source* existe et a été modifiée plus récemment que *target*, ou si *source* existe et *target* n'existe pas. Renvoie la valeur *false* si les deux existent et que *target* est aussi ou plus récent que *source*. Lève :exc:`DistutilsFileError` si *source* n'existe pas.

source: Walk two filename lists in parallel, testing if each source is newer than its corresponding target. Return a pair of lists (*sources*, *targets*) where source is newer than target, according to the semantics of :func:`newer`.
fr: Parcourt en parallèle deux listes de noms de fichiers, en vérifiant si chaque source est plus récente que sa cible correspondante. Renvoie une paire de listes (*sources*, *cibles*) où la source est plus récente que la cible, selon la sémantique de :func:`newer`.

source: Return true if *target* is out-of-date with respect to any file listed in *sources*. In other words, if *target* exists and is newer than every file in *sources*, return false; otherwise return true. *missing* controls what we do when a source file is missing; the default (``'error'``) is to blow up with an :exc:`OSError` from inside :func:`os.stat`; if it is ``'ignore'``, we silently drop any missing source files; if it is ``'newer'``, any missing source files make us assume that *target* is out-of-date (this is handy in "dry-run" mode: it'll make you pretend to carry out commands that wouldn't work because inputs are missing, but that doesn't matter because you're not actually going to run the commands).
fr: Renvoie la valeur *True* si *target* a une date dépassée par rapport à un fichier figurant dans *sources* En d'autres termes, si *target* existe et est plus récente que chaque fichier dans *sources*, renvoie la valeur *False* ; sinon renvoie la valeur *True*. *missing* contrôle ce qui se passe lorsqu'un fichier source est manquant ; la valeur par défaut (``'error'``) est de lever une exception :exc:`OSError` à l'intérieur de :func:`os.stat` ; si *missing* vaut ``'ignore'``,tout fichier source manquant est ignoré. Si *missing* vaut ``'newer'``, tout fichier source manquant indique que *target* n'est plus à jour (ce qui est utile en mode *dry-run* : cela permet d'exécuter des commandes qui ne fonctionneraient pas parce que des entrées sont manquantes sans les exécuter réellement).

source: :mod:`distutils.dir_util` --- Directory tree operations
fr: :mod:`distutils.dir_util` --- Opérations sur l'arborescence des répertoires

source: This module provides functions for operating on directories and trees of directories.
fr: Ce module fournit des fonctions pour travailler sur des répertoires et des arborescences de répertoires.

source: Create a directory and any missing ancestor directories. If the directory already exists (or if *name* is the empty string, which means the current directory, which of course exists), then do nothing. Raise :exc:`DistutilsFileError` if unable to create some directory along the way (eg. some sub-path exists, but is a file rather than a directory). If *verbose* is true, print a one-line summary of each mkdir to stdout. Return the list of directories actually created.
fr: Crée un répertoire et tous les répertoires parents manquants. Si le répertoire existe déjà (ou si *name* est la chaîne vide, c'est-à-dire le répertoire courant, qui existe bien sûr), alors ne fait rien. Lève :exc:`DistutilsFileError` s'il n'est pas possible de créer un répertoire en cours de route (par exemple, un sous-chemin existe, mais est un fichier plutôt qu'un répertoire). Si *verbose* est vrai, affiche un résumé d'une ligne de chaque *mkdir* vers *stdout*. Renvoie la liste des répertoires réellement créés.

source: Create all the empty directories under *base_dir* needed to put *files* there. *base_dir* is just the name of a directory which doesn't necessarily exist yet; *files* is a list of filenames to be interpreted relative to *base_dir*. *base_dir* + the directory portion of every file in *files* will be created if it doesn't already exist. *mode*, *verbose* and *dry_run* flags are as for :func:`mkpath`.
fr: Crée tous les répertoires vides sous *base_dir* nécessaires pour placer *files*. *base_dir* est le nom d'un répertoire qui n'existe pas encore nécessairement ; *files* est une liste de noms de fichiers relatifs à *base_dir*. *base_dir* + la partie répertoire de chaque fichier dans *files* est créée si elle n'existe pas déjà. Les options *mode*, *verbose* et *dry_run* sont les mêmes que pour :func:`mkpath`.

source: Copy an entire directory tree *src* to a new location *dst*. Both *src* and *dst* must be directory names. If *src* is not a directory, raise :exc:`DistutilsFileError`. If *dst* does not exist, it is created with :func:`mkpath`. The end result of the copy is that every file in *src* is copied to *dst*, and directories under *src* are recursively copied to *dst*. Return the list of files that were copied or might have been copied, using their output name. The return value is unaffected by *update* or *dry_run*: it is simply the list of all files under *src*, with the names changed to be under *dst*.
fr: Copie une arborescence de répertoires entière *src* vers un nouvel emplacement *dst*. *src* et *dst* doivent tous deux être des noms de répertoire. Si *src* n'est pas un répertoire, lève :exc:`DistutilsFileError`. Si *dst* n'existe pas, il est créé avec :func:`mkpath`. Le résultat final de la copie est que chaque fichier dans *src* est copié dans *dst*, et les répertoires sous *src* sont récursivement copiés dans *dst*. Renvoie la liste des fichiers qui ont été copiés ou qui auraient pu l'être, en utilisant leur nom de sortie. La valeur renvoyée n'est pas affectée par *update* ou *dry_run* : c'est tout simplement la liste de tous les fichiers sous *src*, avec les noms modifiés pour être sous *dst*.

source: *preserve_mode* and *preserve_times* are the same as for :func:`distutils.file_util.copy_file`; note that they only apply to regular files, not to directories. If *preserve_symlinks* is true, symlinks will be copied as symlinks (on platforms that support them!); otherwise (the default), the destination of the symlink will be copied. *update* and *verbose* are the same as for :func:`copy_file`.
fr: Les modes *preserve_mode* et *preserve_times* sont les mêmes que pour :func:`distutils.file_util.copy_file` ; il faut savoir que cela ne concerne que les fichiers réguliers, et non les dossiers. Si *preserve_symlinks* est vrai, les liens symboliques seront copiés en tant que liens symboliques (sur les plateformes qui les gèrent !); sinon (par défaut), la destination du lien sera copiée. *update* et *verbose* sont les mêmes que pour :func:`copy_file`.

source: Files in *src* that begin with :file:`.nfs` are skipped (more information on these files is available in answer D2 of the `NFS FAQ page <http://nfs.sourceforge.net/#section_d>`_).
fr: Les fichiers dans *src* qui commencent par :file:`.nfs` sont ignorés (plus d'informations sur ces fichiers sont disponibles dans la réponse *D2* de la page `NFS FAQ page <http://nfs.sourceforge.net/#section_d>`_).

source: NFS files are ignored.
fr: Les fichiers NFS sont ignorés.

source: Recursively remove *directory* and all files and directories underneath it. Any errors are ignored (apart from being reported to ``sys.stdout`` if *verbose* is true).
fr: Supprime récursivement *directory* et tous les fichiers et répertoires en dessous. Toutes les erreurs sont ignorées (sauf si *verbose* est vrai, elles sont affichées sur ``sys.stdout``).

source: :mod:`distutils.file_util` --- Single file operations
fr: :mod:`distutils.file_util` — Traitements mono-fichier

source: This module contains some utility functions for operating on individual files.
fr: Ce module contient quelques fonctions de service pour travailler sur des fichiers individuels.

source: Copy file *src* to *dst*. If *dst* is a directory, then *src* is copied there with the same name; otherwise, it must be a filename. (If the file exists, it will be ruthlessly clobbered.) If *preserve_mode* is true (the default), the file's mode (type and permission bits, or whatever is analogous on the current platform) is copied. If *preserve_times* is true (the default), the last-modified and last-access times are copied as well. If *update* is true, *src* will only be copied if *dst* does not exist, or if *dst* does exist but is older than *src*.
fr: Copie le fichier *src* dans *dst*. Si *dst* est un répertoire, alors *src* y est copié avec le même nom ; sinon, il faut que ce soit un nom de fichier. Si *preserve_mode* est vrai (par défaut), le mode du fichier (son type et ses bits de permission, ou ce qui est analogue sur la plate-forme actuelle) sont copiés. Si *preserve_times* est vrai (par défaut), les horodatages de la dernière modification et du dernier accès sont également copiés. Si *update* est vrai, *src* ne peut être copié que si *dst* n'existe pas, ou si *dst* existe mais est plus ancien que *src*.

source: *link* allows you to make hard links (using :func:`os.link`) or symbolic links (using :func:`os.symlink`) instead of copying: set it to ``'hard'`` or ``'sym'``; if it is ``None`` (the default), files are copied. Don't set *link* on systems that don't support it: :func:`copy_file` doesn't check if hard or symbolic linking is available. It uses :func:`_copy_file_contents` to copy file contents.
fr: *link* permets de créer des liens physiques (en utilisant :func:`os.link`) ou symboliques (en utilisant :func:`os.symlink`) au lieu de les copier : paramétrez la valeur a ``'hard'`` ou ``'sym'`` ; si elle vaut ``None`` (par défaut), les fichiers sont copiés. Ne définissez pas *link* sur les systèmes qui ne les gèrent pas : :func:`copy_file` ne vérifie pas si des liens symboliques ou physiques sont disponibles. La fonction :func:`_copy_file_contents` est utilisée pour copier le contenu des fichiers.
