Repository: python/python-docs-fr
Catalog: distutils/apiref.po
Languages: fr

source: The :mod:`distutils.sysconfig` module provides access to Python's low-level configuration information. The specific configuration variables available depend heavily on the platform and configuration. The specific variables depend on the build process for the specific version of Python being run; the variables are those found in the :file:`Makefile` and configuration header that are installed with Python on Unix systems. The configuration header is called :file:`pyconfig.h` for Python versions starting with 2.2, and :file:`config.h` for earlier versions of Python.
fr: Le module :mod:`distutils.sysconfig` donne accès aux informations de configuration bas niveau de Python. Les variables de configuration spécifiques disponibles dépendent de la plate-forme et de la configuration. Les variables spécifiques dépendent du processus de compilation de la version *spécifique* de Python en cours d'exécution. Les variables sont celles qui se trouvent dans le fichier :file:`Makefile` et dans les entêtes de configuration installés avec Python sur des systèmes Unix. Le fichier des entêtes de configuration s'appelle :file:`pyconfig.h` pour les versions de Python commençant par 2.2, et :file:`config.h` pour les versions antérieures de Python.

source: Some additional functions are provided which perform some useful manipulations for other parts of the :mod:`distutils` package.
fr: Quelques fonctions supplémentaires sont fournies pour effectuer des manipulations utiles pour d'autres parties du paquet :mod:`distutils`.

source: The result of ``os.path.normpath(sys.prefix)``.
fr: Le résultat de ``os.path.normpath(sys.prefix)``.

source: The result of ``os.path.normpath(sys.exec_prefix)``.
fr: Le résultat de ``os.path.normpath(sys.exec_prefix)``.

source: Return the value of a single variable. This is equivalent to ``get_config_vars().get(name)``.
fr: Retourne la valeur d'une seule variable. C'est l'équivalent de ``get_config_vars().get(name)``.

source: Return a set of variable definitions. If there are no arguments, this returns a dictionary mapping names of configuration variables to values. If arguments are provided, they should be strings, and the return value will be a sequence giving the associated values. If a given name does not have a corresponding value, ``None`` will be included for that variable.
fr: Retourne un ensemble de définitions de variables. S'il n'y a pas d'arguments, cela renvoie un dictionnaire qui associe les noms des variables de configuration aux valeurs. Si des arguments sont spécifiés, ils doivent être des chaînes de caractères, et la valeur renvoyée sera une séquence donnant les valeurs correspondantes. Si un nom donné n'a pas de valeur correspondante, la valeur ``None`` sera utilisée pour cette variable.

source: Return the full path name of the configuration header. For Unix, this will be the header generated by the :program:`configure` script; for other platforms the header will have been supplied directly by the Python source distribution. The file is a platform-specific text file.
fr: Renvoie le nom complet du chemin d'accès de l'en-tête de configuration. Pour Unix, c'est l'en-tête généré par le script :program:`configure` ; pour les autres plates-formes, l'en-tête provient directement de la distribution source Python. Le fichier est un fichier texte spécifique à la plate-forme.

source: Return the full path name of the :file:`Makefile` used to build Python. For Unix, this will be a file generated by the :program:`configure` script; the meaning for other platforms will vary. The file is a platform-specific text file, if it exists. This function is only useful on POSIX platforms.
fr: Renvoie le nom complet du chemin d'accès du fichier :file:`Makefile` utilisé pour construire Python. Pour Unix, c'est le fichier généré par le script :program:`configure`. La définition pour les autres plateformes varie. S'il existe, il s'agit d'un fichier texte spécifique à la plate-forme. Cette fonction n'est utile que sur les plates-formes POSIX.

source: Return the directory for either the general or platform-dependent C include files. If *plat_specific* is true, the platform-dependent include directory is returned; if false or omitted, the platform-independent directory is returned. If *prefix* is given, it is used as either the prefix instead of :const:`PREFIX`, or as the exec-prefix instead of :const:`EXEC_PREFIX` if *plat_specific* is true.
fr: Renvoie le répertoire pour les fichiers d'inclusion C standards ou dépendants de la plate-forme. Si *plat_specific* est vrai, le répertoire *include* dépendant de la plate-forme est renvoyé ; si la valeur est *faux* ou *None*, le répertoire indépendant de la plate-forme est renvoyé. Si *prefix* est donné, il est utilisé soit comme préfixe au lieu de :const:`PREFIX`, soit comme préfixe d'exécution au lieu de :const:`EXEC_PREFIX` si *plat_specific* est vrai.

source: Return the directory for either the general or platform-dependent library installation. If *plat_specific* is true, the platform-dependent include directory is returned; if false or omitted, the platform-independent directory is returned. If *prefix* is given, it is used as either the prefix instead of :const:`PREFIX`, or as the exec-prefix instead of :const:`EXEC_PREFIX` if *plat_specific* is true. If *standard_lib* is true, the directory for the standard library is returned rather than the directory for the installation of third-party extensions.
fr: Renvoie le répertoire pour l'installation de la bibliothèque standard ou dépendante de la plate-forme. Si *plat_specific* est vrai, le répertoire *include* dépendant de la plate-forme est renvoyé ; si la valeur est *faux* ou *None*, le répertoire indépendant de la plate-forme est renvoyé. Si *prefix* est donné, il est utilisé soit comme préfixe au lieu de :const:`PREFIX`, soit comme préfixe d'exécution au lieu de :const:`EXEC_PREFIX` si *plat_specific* est vrai. Si *standard_lib* est vrai, le répertoire de la bibliothèque standard est renvoyé plutôt que le répertoire d'installation des extensions tierces.

source: The following function is only intended for use within the :mod:`distutils` package.
fr: La fonction suivante est uniquement destinée à être utilisée dans le paquet :mod:`distutils`.

source: Do any platform-specific customization of a :class:`distutils.ccompiler.CCompiler` instance.
fr: Exécute toute personnalisation spécifique à la plate-forme d'une instance :class:`distutils.ccompiler.CCompiler`.

source: This function is only needed on Unix at this time, but should be called consistently to support forward-compatibility. It inserts the information that varies across Unix flavors and is stored in Python's :file:`Makefile`. This information includes the selected compiler, compiler and linker options, and the extension used by the linker for shared objects.
fr: Cette fonction n'est nécessaire que sous Unix pour le moment, mais doit être appelée de manière cohérente pour supporter la compatibilité ascendante. Elle insère des informations qui varient d'une version à l'autre d'Unix et qui sont stockées dans le fichier Python :file:`Makefile`. Ces informations comprennent le compilateur, les options du compilateur et de l'éditeur de liens sélectionnés, ainsi que l'extension utilisée par l'éditeur de liens pour les objets partagés.

source: This function is even more special-purpose, and should only be used from Python's own build procedures.
fr: Cette fonction est encore plus spéciale, et ne devrait être utilisée que dans les procédures de compilation de Python.

source: Inform the :mod:`distutils.sysconfig` module that it is being used as part of the build process for Python. This changes a lot of relative locations for files, allowing them to be located in the build area rather than in an installed Python.
fr: Informe le module :mod:`distutils.sysconfig` qu'il est utilisé dans le cadre du processus de compilation de Python. Cela change beaucoup d'emplacements relatifs pour les fichiers, ce qui les place dans la zone de compilation plutôt que dans un interpréteur Python installé.

source: :mod:`distutils.text_file` --- The TextFile class
fr: :mod:`distutils.text_file` — La classe TextFile

source: This module provides the :class:`TextFile` class, which gives an interface to text files that (optionally) takes care of stripping comments, ignoring blank lines, and joining lines with backslashes.
fr: Ce module fournit la classe :class:`TextFile`, qui donne une interface aux fichiers texte qui s'occupe (optionnellement) de supprimer les commentaires, d'ignorer les lignes vides et de joindre les lignes avec des antislash.

source: This class provides a file-like object that takes care of all the things you commonly want to do when processing a text file that has some line-by-line syntax: strip comments (as long as ``#`` is your comment character), skip blank lines, join adjacent lines by escaping the newline (ie. backslash at end of line), strip leading and/or trailing whitespace. All of these are optional and independently controllable.
fr: Cette classe fournit un objet de type fichier qui se charge de tout ce que vous voulez généralement faire lors du traitement d'un fichier texte ayant une syntaxe ligne par ligne : Suppression des commentaires (tant que ``#`` est votre caractère de commentaire), passer les lignes vides, joindre des lignes adjacentes en échappant la nouvelle ligne (les lignes se terminant par une antislash), supprime les espace blancs avant et après le texte etc. Toutes ces fonctions sont optionnelles et peuvent être commandées indépendamment.

source: The class provides a :meth:`warn` method so you can generate warning messages that report physical line number, even if the logical line in question spans multiple physical lines. Also provides :meth:`unreadline` for implementing line-at-a-time lookahead.
fr: La classe fournit une méthode :meth:`warn` pour pouvoir générer des messages d'avertissement qui renvoie le numéro de ligne physique, même si la ligne logique en question couvre plusieurs lignes physiques. Fournit également :meth:`unreadline` pour implémenter un système prospectif ligne par ligne.

source: :class:`TextFile` instances are create with either *filename*, *file*, or both. :exc:`RuntimeError` is raised if both are ``None``. *filename* should be a string, and *file* a file object (or something that provides :meth:`readline` and :meth:`close` methods). It is recommended that you supply at least *filename*, so that :class:`TextFile` can include it in warning messages. If *file* is not supplied, :class:`TextFile` creates its own using the :func:`open` built-in function.
fr: Les instances de :class:`TextFile` sont créées soit avec *filename*, soit avec *file* ou bien les deux. :exc:`RuntimeError` est levé si les deux valent ``None``. *filename* doit être une chaîne de caractères, et *file* un objet fichier (ou quelque chose qui fournit les méthodes :meth:`readline` et :meth:`close`). Il est recommandé de fournir au moins *filename*, afin que :class:`TextFile` puisse l'inclure dans les messages d'avertissement. Si *file* n'est pas fourni, :class:`TextFile` crée son propre fichier en utilisant la fonction :func:`open`.

source: The options are all boolean, and affect the values returned by :meth:`readline`
fr: Les options sont toutes booléennes et affectent les valeurs renvoyées par :meth:`readline`.

source: option name
fr: Nom des options

source: strip from ``'#'`` to end-of-line, as well as any whitespace leading up to the ``'#'``\ ---unless it is escaped by a backslash
fr: Supprime les caractères à partir de ``'#'`` jusqu'à la fin de la ligne, ainsi que tout espace blanc menant au premier ``'#'`` --- à moins qu'il ne soit échappé par une antislash

source: strip leading whitespace from each line before returning it
fr: Efface les espaces blancs en début de chaque ligne avant de la renvoyer.

source: strip trailing whitespace (including line terminator!) from each line before returning it.
fr: Efface les espaces blancs de fin de ligne (y compris le terminateur de ligne !) de chaque ligne avant de la renvoyer.

source: skip lines that are empty \*after\* stripping comments and whitespace. (If both lstrip_ws and rstrip_ws are false, then some lines may consist of solely whitespace: these will \*not\* be skipped, even if *skip_blanks* is true.)
fr: Ignore les lignes qui sont vides \*après\* la suppression des commentaires et des espaces. (Si *lstrip_ws* et *rstrip_ws* sont tous les deux faux, alors certaines lignes peuvent être composées uniquement d'espaces : elles ne seront pas ignorées, même si *skip_blanks* est vrai.

source: if a backslash is the last non-newline character on a line after stripping comments and whitespace, join the following line to it to form one logical line; if N consecutive lines end with a backslash, then N+1 physical lines will be joined to form one logical line.
fr: Si sur la ligne, une antislash est le dernier caractère et que ce caractère n'est pas le caractère de nouvelle ligne. Joint la ligne suivante pour former une ligne logique. Si N lignes consécutives se terminent par une antislash, alors N+1 lignes physiques seront liées pour former une seul ligne logique.

source: strip leading whitespace from lines that are joined to their predecessor; only matters if ``(join_lines and not lstrip_ws)``
fr: Supprime les espaces blancs des lignes qui sont jointes à leur prédécesseur. n'est utile que que si ``(join_lines and not lstrip_ws)``.

source: Note that since *rstrip_ws* can strip the trailing newline, the semantics of :meth:`readline` must differ from those of the built-in file object's :meth:`readline` method! In particular, :meth:`readline` returns ``None`` for end-of-file: an empty string might just be a blank line (or an all-whitespace line), if *rstrip_ws* is true but *skip_blanks* is not.
fr: Notez que puisque *rstrip_ws* peut effacer la fin de la ligne, la sémantique de :meth:`readline` doit être différente de celle de la méthode standard :meth:`readline` des objets fichier ! En particulier, :meth:`readline` renvoie ``None`` pour indiquer la fin du fichier: une chaîne vide peut être juste une ligne blanche (ou une ligne entièrement blanche), si *rstrip_ws* est vrai mais pas si *skip_blanks* est faux.

source: Open a new file *filename*. This overrides any *file* or *filename* constructor arguments.
fr: Ouvre un nouveau fichier *filename*. Remplace tous les arguments du constructeur *file* ou *filename*.

source: Close the current file and forget everything we know about it (including the filename and the current line number).
fr: Ferme le fichier courant et oublie toutes les informations connues à son sujet (y compris le nom du fichier et le numéro de la ligne courante).

source: Print (to stderr) a warning message tied to the current logical line in the current file. If the current logical line in the file spans multiple physical lines, the warning refers to the whole range, such as ``"lines 3-5"``. If *line* is supplied, it overrides the current line number; it may be a list or tuple to indicate a range of physical lines, or an integer for a single physical line.
fr: Affiche (vers *stderr*) un message d'avertissement lié à la ligne logique courante dans le fichier courant. Si la ligne logique courante dans le fichier s'étend sur plusieurs lignes physiques, l'avertissement se réfère à une plage de lignes physiques, telles que ``"lignes 3-5"``. Si *line* est fourni, il remplace le numéro de la ligne courante ; il peut s'agir d'une liste ou d'un couple pour indiquer une plage de lignes physiques, ou d'un entier pour une seule ligne physique.

source: Read and return a single logical line from the current file (or from an internal buffer if lines have previously been "unread" with :meth:`unreadline`). If the *join_lines* option is true, this may involve reading multiple physical lines concatenated into a single string. Updates the current line number, so calling :meth:`warn` after :meth:`readline` emits a warning about the physical line(s) just read. Returns ``None`` on end-of-file, since the empty string can occur if *rstrip_ws* is true but *strip_blanks* is not.
fr: Lit et renvoie une seule ligne logique à partir du fichier courant (ou à partir d'un tampon interne si les lignes ont déjà été marqué comme non lue avec :meth:`unreadline`). Si l'option *join_lines* est vraie, cela peut impliquer la lecture de plusieurs lignes physiques concaténées en une seule chaîne. Met à jour le numéro de la ligne courante. Appeler :meth:`warn` après :meth:`readline` émet donc un avertissement sur la ou les lignes physiques qui viennent d'être lues. Renvoie ``None`` à la fin du fichier, puisque la chaîne vide peut se produire si *rstrip_ws* est vrai mais pas si *strip_blanks* est faux.

source: Read and return the list of all logical lines remaining in the current file. This updates the current line number to the last line of the file.
fr: Lit et renvoie la liste de toutes les lignes logiques restant dans le fichier courant. Met à jour le numéro de la ligne courante à la dernière ligne du fichier.

source: Push *line* (a string) onto an internal buffer that will be checked by future :meth:`readline` calls. Handy for implementing a parser with line-at-a-time lookahead. Note that lines that are "unread" with :meth:`unreadline` are not subsequently re-cleansed (whitespace stripped, or whatever) when read with :meth:`readline`. If multiple calls are made to :meth:`unreadline` before a call to :meth:`readline`, the lines will be returned most in most recent first order.
fr: Insère la ligne *line* (une chaîne de caractères) dans un tampon interne qui sera vérifié par les futurs appels de :meth:`readline`. Utile pour implémenter un analyseur prospectif ligne par ligne. Notez que les lignes qui sont "non lues" avec :meth:`unreadline` ne sont ensuite pas traitées de nouveau (espace blancs, ou autre) quand elles sont lues avec :meth:`readline`. Si plusieurs appels sont faits à :meth:`unreadline` avant un appel à :meth:`readline`, les lignes sont renvoyées dans l'ordre de la plus récente première à la plus ancienne.

source: :mod:`distutils.version` --- Version number classes
fr: :mod:`distutils.version` — Classes de numéros de version

source: :mod:`distutils.cmd` --- Abstract base class for Distutils commands
fr: :mod:`distutils.cmd` --- Classe de base abstraite pour les commandes *Distutils*

source: This module supplies the abstract base class :class:`Command`.
fr: Ce module fournit la classe de base abstraite :class:`Command`.

source: Abstract base class for defining command classes, the "worker bees" of the Distutils. A useful analogy for command classes is to think of them as subroutines with local variables called *options*. The options are declared in :meth:`initialize_options` and defined (given their final values) in :meth:`finalize_options`, both of which must be defined by every command class. The distinction between the two is necessary because option values might come from the outside world (command line, config file, ...), and any options dependent on other options must be computed after these outside influences have been processed --- hence :meth:`finalize_options`. The body of the subroutine, where it does all its work based on the values of its options, is the :meth:`run` method, which must also be implemented by every command class.
fr: Classe de base abstraite pour définir les classes de commandes, les "ouvrières" de *Distutils*. Une analogie utile pour les classes de commandes est de les considérer comme des sous-routines avec des variables locales appelées *options*. Les options sont déclarées dans :meth:`initialiser_options` et définies (compte tenu de leur valeur finale) dans :meth:`finalize_options`, qui doivent être définies pour chaque classe de commande. La distinction entre les deux est nécessaire parce que les valeurs des options peuvent venir de l'extérieur (ligne de commande, fichier de configuration, ....), et toutes les options dépendantes d'autres options doivent être calculées après que ces options externes aient été traitées --- ce qui explique :meth:`finalize_options`. Le corps de la sous-routine, où s'effectue tout le travail est basé sur les valeurs de ses options, est la méthode :meth:`run`, qui doit être implémentée par chaque classe de commande.

source: The class constructor takes a single argument *dist*, a :class:`~distutils.core.Distribution` instance.
fr: Le constructeur prend un seul argument, *dist*, une instance de :class:`~distutils.core.Distribution`.

source: Creating a new Distutils command
fr: Créer une nouvelle commande *Distutils*

source: This section outlines the steps to create a new Distutils command.
fr: Cette section décrit les étapes pour créer une nouvelle commande *Distutils*.

source: A new command lives in a module in the :mod:`distutils.command` package. There is a sample template in that directory called :file:`command_template`. Copy this file to a new module with the same name as the new command you're implementing. This module should implement a class with the same name as the module (and the command). So, for instance, to create the command ``peel_banana`` (so that users can run ``setup.py peel_banana``), you'd copy :file:`command_template` to :file:`distutils/command/peel_banana.py`, then edit it so that it's implementing the class :class:`peel_banana`, a subclass of :class:`distutils.cmd.Command`.
fr: Une nouvelle commande doit résider dans un module du package :mod:`distutils.command`. Il existe un exemple de modèle dans ce répertoire nommé :file:`command_template`. Copiez ce fichier dans un nouveau module portant le même nom que la nouvelle commande que vous implémentez. Ce module doit implémenter une classe portant le même nom que le module (et la commande). Par exemple, pour créer la commande ``peel_banana`` (afin que les utilisateurs puissent exécuter ``setup.py peel_banana``), vous devez copier le fichier :file:`commande_template` dans :file:`distutils/command/peel_banana.py`, puis l'éditer pour qu'il implémente la classe :class:`peel_banana`, une sous-classe de la classe :class:`distutils.cmd.Command`.

source: Subclasses of :class:`Command` must define the following methods.
fr: Les sous-classes de la classe :class:`Command` doivent définir les méthodes suivantes.

source: Set default values for all the options that this command supports. Note that these defaults may be overridden by other commands, by the setup script, by config files, or by the command-line. Thus, this is not the place to code dependencies between options; generally, :meth:`initialize_options` implementations are just a bunch of ``self.foo = None`` assignments.
fr: Définit des valeurs par défaut pour toutes les options que cette commande gère. Notez que ces valeurs par défaut peuvent être remplacées par d'autres commandes, par le script d'installation, par des fichiers de configuration ou par la ligne de commande. Ce n'est donc pas l'endroit idéal pour introduire des dépendances entre les options. En règle générale, les méthodes suivantes :meth:`initialize_options` ne font que des assignations de type ``self.truc = None``.
