Repository: python/python-docs-fr
Catalog: distutils/apiref.po
Languages: fr

source: Return a tuple ``(dest_name, copied)``: *dest_name* is the actual name of the output file, and *copied* is true if the file was copied (or would have been copied, if *dry_run* true).
fr: Renvoie un couple ``(dest_name, copied)`` : *dest_name* est le nom réel du fichier de sortie, et *copied* est vrai si le fichier a été copié (ou aurait été copié, si *dry_run* est vrai).

source: Move file *src* to *dst*. If *dst* is a directory, the file will be moved into it with the same name; otherwise, *src* is just renamed to *dst*. Returns the new full name of the file.
fr: Déplace le fichier *src* vers *dst*. Si *dst* est un répertoire, le fichier y est déplacé avec le même nom ; sinon, *src* est simplement renommé *dst*. Renvoie le nouveau nom complet du fichier.

source: Handles cross-device moves on Unix using :func:`copy_file`. What about other systems?
fr: Gère les déplacements inter-périphériques sous Unix en utilisant :func:`copy_file`. Qu'en est-il sur les autres systèmes ?

source: Create a file called *filename* and write *contents* (a sequence of strings without line terminators) to it.
fr: Crée un fichier appelé *filename* et y écrit *contents* (une séquence de chaînes sans terminaison de ligne).

source: :mod:`distutils.util` --- Miscellaneous other utility functions
fr: :mod:`distutils.util` — Autres fonctions de service

source: This module contains other assorted bits and pieces that don't fit into any other utility module.
fr: Ce module contient d'autres éléments qui ne correspondent à aucun autre module de service.

source: Return a string that identifies the current platform. This is used mainly to distinguish platform-specific build directories and platform-specific built distributions. Typically includes the OS name and version and the architecture (as supplied by 'os.uname()'), although the exact information included depends on the OS; e.g., on Linux, the kernel version isn't particularly important.
fr: Renvoie une chaîne qui identifie la plate-forme courante. Ceci est utilisé pour distinguer les répertoires de compilation spécifiques aux plates-formes et les distributions construites spécifiques aux plates-formes. Cette chaîne inclut en règle générale le nom et la version de l'OS et l'architecture (tels que fournis par la fonction ``os.uname()`` ). Bien que l'information exacte dépend de l'OS, par exemple, sous Linux, la version noyau ne joue pas un grand rôle.

source: Examples of returned values:
fr: Exemples de valeurs renvoyées :

source: For non-POSIX platforms, currently just returns ``sys.platform``.
fr: Pour les plates-formes qui ne sont pas POSIX, renvoie simplement ``sys.platform``.

source: For Mac OS X systems the OS version reflects the minimal version on which binaries will run (that is, the value of ``MACOSX_DEPLOYMENT_TARGET`` during the build of Python), not the OS version of the current system.
fr: Pour les systèmes Mac OS X, la version du système d'exploitation correspond à la version minimale sur laquelle les binaires pourront être exécutés (c'est-à-dire la valeur de ``MACOSX_DEPLOYMENT_TARGET`` pendant la compilation de Python), et non la version du système actuel.

source: For universal binary builds on Mac OS X the architecture value reflects the universal binary status instead of the architecture of the current processor. For 32-bit universal binaries the architecture is ``fat``, for 64-bit universal binaries the architecture is ``fat64``, and for 4-way universal binaries the architecture is ``universal``. Starting from Python 2.7 and Python 3.2 the architecture ``fat3`` is used for a 3-way universal build (ppc, i386, x86_64) and ``intel`` is used for a universal build with the i386 and x86_64 architectures
fr: Pour les binaires universels construits sur Mac OS X, la valeur de l'architecture reflète l'état du binaire universel au lieu de celle de l'architecture du processeur en cours. Pour les binaires universels 32 bits, l'architecture est ``fat``, pour les binaires universels 64 bits, l'architecture est ``fat64``, et pour les binaires universels 4 voies, l'architecture est ``universelle``. A partir de Python 2.7 et Python 3.2, l'architecture ``fat3`` est utilisée pour une compilation universelle à 3 voies (*ppc*, *i386*, *x86_64*) et ``intel`` est utilisée pour une compilation universelle avec les architectures *i386* et *x86_64*

source: Examples of returned values on Mac OS X:
fr: Exemples de valeurs renvoyées sous Mac OS X :

source: Return 'pathname' as a name that will work on the native filesystem, i.e. split it on '/' and put it back together again using the current directory separator. Needed because filenames in the setup script are always supplied in Unix style, and have to be converted to the local convention before we can actually use them in the filesystem. Raises :exc:`ValueError` on non-Unix-ish systems if *pathname* either starts or ends with a slash.
fr: Renvoie un chemin *pathname* qui fonctionne sur le système de fichiers natif. Par exemple, il sépare le chemin sur */* et le recompose en utilisant le séparateur de répertoires courant. Cela est nécessaire parce que les noms de fichiers dans les scripts d'installations sont toujours fournis dans le style Unix, et doivent être convertis dans la convention du système avant d'être utilisé par le système de fichiers. Lève :exc:`ValueError` sur les systèmes non UNIX si *pathname* commence ou se termine par une barre oblique (*slash* en anglais).

source: Return *pathname* with *new_root* prepended. If *pathname* is relative, this is equivalent to ``os.path.join(new_root,pathname)`` Otherwise, it requires making *pathname* relative and then joining the two, which is tricky on DOS/Windows.
fr: Renvoie un chemin *pathname* préfixé avec *new_root*. Si *pathname* est relatif, c`est l'équivalent de ``os.path.join(new_root,pathname)`` Sinon, il faut rendre *pathname* relatif et joindre les deux, ce qui est dangereux sous DOS/Windows.

source: Ensure that 'os.environ' has all the environment variables we guarantee that users can use in config files, command-line options, etc. Currently this includes:
fr: Vérifie que 'os.environ' possède toutes les variables d'environnement utilisables dans les fichiers de configuration, les options en ligne de commande, etc. À l'heure actuelle, cela comprend :

source: :envvar:`HOME` - user's home directory (Unix only)
fr: :envvar:`HOME`. Répertoire d’accueil de l'utilisateur (Unix uniquement)

source: :envvar:`PLAT` - description of the current platform, including hardware and OS (see :func:`get_platform`)
fr: :envvar:`PLAT`. Description de la plate-forme actuelle, y compris le matériel et le l'OS (voir :func:`get_platform`)

source: Perform shell/Perl-style variable substitution on *s*. Every occurrence of ``$`` followed by a name is considered a variable, and variable is substituted by the value found in the *local_vars* dictionary, or in ``os.environ`` if it's not in *local_vars*. *os.environ* is first checked/augmented to guarantee that it contains certain values: see :func:`check_environ`. Raise :exc:`ValueError` for any variables not found in either *local_vars* or ``os.environ``.
fr: Exécute la substitution de variable de style shell/Perl sur *s*. Chaque occurrence de ``$`` suivie d'un nom est considérée comme une variable, et la variable est remplacée par la valeur trouvée dans le dictionnaire *local_vars*, ou dans ``os.environ`` si elle ne se trouve pas dans *local_vars*. *os.environ* est d'abord vérifié/étendu pour garantir qu'elle contient certaines valeurs : voir :func:`check_environ`. Lève :exc:`ValueError` pour toute variable non trouvée dans *local_vars* ou ``os.environ``.

source: Note that this is not a fully-fledged string interpolation function. A valid ``$variable`` can consist only of upper and lower case letters, numbers and an underscore. No { } or ( ) style quoting is available.
fr: Remarquez qu'il ne s'agit pas d'une fonction d'interpolation de chaîne à part entière. Une ``$variable`` valide ne peut être composée que de lettres majuscules et minuscules, de chiffres et d'un tiret bas. Aucune syntaxe de type {} ou () pour indiquer des variables n'est disponible.

source: Split a string up according to Unix shell-like rules for quotes and backslashes. In short: words are delimited by spaces, as long as those spaces are not escaped by a backslash, or inside a quoted string. Single and double quotes are equivalent, and the quote characters can be backslash-escaped. The backslash is stripped from any two-character escape sequence, leaving only the escaped character. The quote characters are stripped from any quoted string. Returns a list of words.
fr: Sépare une chaîne de caractères selon les règles de type shell Unix pour les guillemets et les barres obliques inverses. En bref : les mots sont délimités par des espaces, tant que ces espaces ne sont pas échappées par une barre oblique inversée, ou à l'intérieur d'une chaîne guillemets. Les guillemets simples et doubles sont équivalents, et les caractères entre guillemets peuvent être échappés à l'aide d'une barre oblique inversée. La barre oblique inversée est supprimée de toute séquence d'échappement à deux caractères, ne laissant que le caractère échappé. Les caractères guillemets sont supprimés de toute chaîne de caractères entre guillemets. Renvoie une liste de mots.

source: Perform some action that affects the outside world (for instance, writing to the filesystem). Such actions are special because they are disabled by the *dry_run* flag. This method takes care of all that bureaucracy for you; all you have to do is supply the function to call and an argument tuple for it (to embody the "external action" being performed), and an optional message to print.
fr: Exécute une action qui affecte le monde extérieur (par exemple, écrire dans le système de fichiers). De telles actions sont spéciales car elles sont désactivées par l'option *dry_run*. Cette méthode s'occupe de tout. Vous devez simplement fournir la fonction à appeler avec un couple d'argument lui correspondant et un message facultatif à afficher.

source: Convert a string representation of truth to true (1) or false (0).
fr: Convertit une chaîne de caractères représentant une valeur booléenne en ``1`` (si elle est évaluée comme vraie) ou ``0`` (si elle est évaluée comme fausse).

source: True values are ``y``, ``yes``, ``t``, ``true``, ``on`` and ``1``; false values are ``n``, ``no``, ``f``, ``false``, ``off`` and ``0``. Raises :exc:`ValueError` if *val* is anything else.
fr: Les valeurs *vraies* sont , ``y``, ``yes``, ``t``, ``true``, ``on`` et ``1``. Les valeurs *fausses* sont ``n``, ``no``, ``f``, ``false``, ``off`` et ``0``. Lève :exc:`ValueError` si *val* est autre chose.

source: Byte-compile a collection of Python source files to :file:`.pyc` files in a :file:`__pycache__` subdirectory (see :pep:`3147` and :pep:`488`). *py_files* is a list of files to compile; any files that don't end in :file:`.py` are silently skipped. *optimize* must be one of the following:
fr: Effectue une compilation vers du *bytecode* Python à partir d'un ensemble de fichiers sources Python dans un fichier :file:`.pyc` dans un sous répertoire :file:`__pycache__` (voir :pep:`3147` et :pep:`488`). *py_files* est une liste de fichiers à compiler ; tous les fichiers qui ne se terminent pas par :file:`.py` sont ignorés en silence. *optimize* doit être l'un des éléments suivants :

source: ``0`` - don't optimize
fr: ``0``: ne pas optimiser

source: ``1`` - normal optimization (like ``python -O``)
fr: ``1``: optimisation normale (comme ``python -O``)

source: ``2`` - extra optimization (like ``python -OO``)
fr: ``2``: optimisation supplémentaire (comme ``python -OO``)

source: If *force* is true, all files are recompiled regardless of timestamps.
fr: Si *force* est vrai, tous les fichiers sont recompilés indépendamment des horodatages.

source: The source filename encoded in each :term:`bytecode` file defaults to the filenames listed in *py_files*; you can modify these with *prefix* and *basedir*. *prefix* is a string that will be stripped off of each source filename, and *base_dir* is a directory name that will be prepended (after *prefix* is stripped). You can supply either or both (or neither) of *prefix* and *base_dir*, as you wish.
fr: Le nom du fichier source encodé dans chaque fichier :term:`bytecode` est par défaut le nom présent dans la liste des noms de fichiers source *py_files* ; vous pouvez modifier dynamiquement ses noms avec *prefix* et *basedir*. *prefix* est une chaîne de caractères qui sera supprimée de chaque nom de fichier source, et *base_dir* est un nom de répertoire qui sera préfixé au nom (après que le *prefixe* soit supprimé). Vous pouvez choisir de fournir l'un ou l'autre (ou les deux) paramètres : *prefixe* et *base_dir*.

source: If *dry_run* is true, doesn't actually do anything that would affect the filesystem.
fr: Si *dry_run* est vrai, ne fait rien qui puisse affecter le système de fichiers.

source: Byte-compilation is either done directly in this interpreter process with the standard :mod:`py_compile` module, or indirectly by writing a temporary script and executing it. Normally, you should let :func:`byte_compile` figure out to use direct compilation or not (see the source for details). The *direct* flag is used by the script generated in indirect mode; unless you know what you're doing, leave it set to ``None``.
fr: La compilation binaire se fait soit directement dans l'interpréteur courant avec le module standard :mod:`py_compile`, soit indirectement en écrivant un script temporaire et en l'exécutant. Normalement, vous devez laisser :func:`byte_compile` choisir d'utiliser la compilation directe ou non (voir le code-source pour les détails). Le paramètre *direct* est utilisé par le script généré en mode indirect ; à moins que vous ne sachiez ce que vous faites, laissez le paramètre à ``None`` (Aucun).

source: Create ``.pyc`` files with an :func:`import magic tag <imp.get_tag>` in their name, in a :file:`__pycache__` subdirectory instead of files without tag in the current directory.
fr: Crée des fichiers ``.pyc`` avec un sous-répertoire :func:`import magic tag <imp.get_tag>` dans leur nom, dans le sous répertoire :file:`__pycache__` plutôt que dans le répertoire courant, sans tag.

source: Create ``.pyc`` files according to :pep:`488`.
fr: Crée des fichiers ``.pyc`` selon la :pep:`488`.

source: Return a version of *header* escaped for inclusion in an :rfc:`822` header, by ensuring there are 8 spaces space after each newline. Note that it does no other modification of the string.
fr: Renvoie une version de *header* traitée avec les échappements compatibles avec les en-têtes :rfc:`822`, en s'assurant qu'il y a 8 espaces après chaque nouvelle ligne. Notez qu'il ne fait aucune autre modification de la chaîne de caractères.

source: :mod:`distutils.dist` --- The Distribution class
fr: :mod:`distutils.dist` — La classe Distribution

source: This module provides the :class:`~distutils.core.Distribution` class, which represents the module distribution being built/installed/distributed.
fr: Ce module fournit la classe :class:`~distutils.core.Distribution`, qui représente le module *distribution* en cours de construction/installation/distribution.

source: :mod:`distutils.extension` --- The Extension class
fr: :mod:`distutils.extension` — La classe Extension

source: This module provides the :class:`Extension` class, used to describe C/C++ extension modules in setup scripts.
fr: Ce module fournit la classe :class:`Extension`, utilisée pour décrire les modules d'extension C/C++ dans les scripts de configuration.

source: :mod:`distutils.debug` --- Distutils debug mode
fr: :mod:`distutils.debug` — Mode de débogage du module *Distutils*

source: This module provides the DEBUG flag.
fr: Ce module fournit l'option *DEBUG*.

source: :mod:`distutils.errors` --- Distutils exceptions
fr: :mod:`distutils.errors` — Exceptions du module *Distutils*

source: Provides exceptions used by the Distutils modules. Note that Distutils modules may raise standard exceptions; in particular, SystemExit is usually raised for errors that are obviously the end-user's fault (eg. bad command-line arguments).
fr: Fournit les exceptions utilisées par les modules de *Distutils*. Notez que les modules *Distutils* peuvent soulever des exceptions standard ; en particulier, ``SystemExit`` est généralement levée pour les erreurs qui sont manifestement de la responsabilité de l'utilisateur final (ex : mauvais argument en ligne de commande).

source: This module is safe to use in ``from ... import *`` mode; it only exports symbols whose names start with ``Distutils`` and end with ``Error``.
fr: Ce module est utilisable avec la syntaxe ``from ... import *`` ; il n'exporte que des symboles dont le nom commence par ``Distutils`` et se termine par ``Error``.

source: :mod:`distutils.fancy_getopt` --- Wrapper around the standard getopt module
fr: :mod:`distutils.fancy_getopt` --- Encapsulation du module *getopt* standard

source: This module provides a wrapper around the standard :mod:`getopt` module that provides the following additional features:
fr: Ce module est une encapsulation du module standard :mod:`getopt` qui apporte les fonctionnalités supplémentaires suivantes :

source: short and long options are tied together
fr: Les options *short* et *long* sont liées entre elles.

source: options have help strings, so :func:`fancy_getopt` could potentially create a complete usage summary
fr: Les options ont des pages d'aide, donc :func:`fancy_getopt` pourrait potentiellement créer un résumé d'utilisation complet

source: options set attributes of a passed-in object
fr: Les options définissent les attributs à partir d'un objet fourni.

source: boolean options can have "negative aliases" --- eg. if :option:`!--quiet` is the "negative alias" of :option:`!--verbose`, then :option:`!--quiet` on the command line sets *verbose* to false.
fr: Les options booléennes peuvent avoir des "alias négatifs" --- par exemple l'option :option:`!-quiet` est *l'alias négatif* de :option:`!--verbose`, l'option :option:`!-quiet` sur la ligne de commande met *verbose* à faux.

source: Wrapper function. *options* is a list of ``(long_option, short_option, help_string)`` 3-tuples as described in the constructor for :class:`FancyGetopt`. *negative_opt* should be a dictionary mapping option names to option names, both the key and value should be in the *options* list. *object* is an object which will be used to store values (see the :meth:`getopt` method of the :class:`FancyGetopt` class). *args* is the argument list. Will use ``sys.argv[1:]`` if you pass ``None`` as *args*.
fr: Encapsulation de la fonction ``getopt``. *options* est une liste de triplets ``(long_option, short_option, help_string)`` comme décrit dans le constructeur de la classe :class:`FancyGetopt`. *negative_opt* doit être un dictionnaire associant les noms des options aux noms des options, la clé et la valeur doivent être dans la liste *options*. *object* est un objet qui sera utilisé pour stocker des valeurs (voir la méthode :meth:`getopt` de la classe :class:`FancyGetopt`). *args* est la liste des arguments. Utilise ``sys.argv[1 :]`` si ``None`` est passé à *args*.

source: Wraps *text* to less than *width* wide.
fr: Ajoute des retours à la ligne à *texte* de manière à ce que la largeur soit inférieure à *largeur*.

source: The option_table is a list of 3-tuples: ``(long_option, short_option, help_string)``
fr: La liste *option_table* est constituée de triplets : ``(long_option, short_option, help_string*)``

source: If an option takes an argument, its *long_option* should have ``'='`` appended; *short_option* should just be a single character, no ``':'`` in any case. *short_option* should be ``None`` if a *long_option* doesn't have a corresponding *short_option*. All option tuples must have long options.
fr: Si une option prend un argument, sa *long_option* doit se terminer par ``'='``. *short_option* doit être un seul caractère, jamais ``':'`'. *option_courte* doit être ``None`` si *long_option* n'a pas de *short_option* correspondante. Tous les triplets d'options doivent avoir des options longues.

source: The :class:`FancyGetopt` class provides the following methods:
fr: La classe :class:`FancyGetopt` fournit les méthodes suivantes :

source: Parse command-line options in args. Store as attributes on *object*.
fr: Analyse les options de ligne de commande des arguments. Les stocke en tant qu'attributs de *objet*.

source: If *args* is ``None`` or not supplied, uses ``sys.argv[1:]``. If *object* is ``None`` or not supplied, creates a new :class:`OptionDummy` instance, stores option values there, and returns a tuple ``(args, object)``. If *object* is supplied, it is modified in place and :func:`getopt` just returns *args*; in both cases, the returned *args* is a modified copy of the passed-in *args* list, which is left untouched.
fr: Si *args* est ``None`` ou n'est pas définie, utilise ``sys.argv[1:]``. Si *object* est ``None`` ou n'est pas définie, créer une nouvelle instance de la classe :class:`OptionDummy` , stocke les valeurs d'options dans l'instance et renvoie un couple ``(args, object)``. Si *objet* est fourni, il est modifié sur place et :func:`getopt` renvoie simplement *args*; dans les deux cas, Les arguments *args* renvoyés sont une copie modifiée de la liste *args* transmise, qui est n'est pas modifiée.

source: Returns the list of ``(option, value)`` tuples processed by the previous run of :meth:`getopt` Raises :exc:`RuntimeError` if :meth:`getopt` hasn't been called yet.
fr: Renvoie la liste des couples ``(option, valeur)`` traités par l'exécution précédente de :meth:`getopt`. Déclenche :exc:`RuntimeError` si :meth:`getopt` n'a pas encore été appelée.

source: Generate help text (a list of strings, one per suggested line of output) from the option table for this :class:`FancyGetopt` object.
fr: Génère un texte d'aide (une liste de chaînes, une par ligne de sortie suggérée) de la liste d'options pour l'objet de la classe :class:`FancyGetopt`.

source: If supplied, prints the supplied *header* at the top of the help.
fr: S'il est fourni, affiche l'en-tête *header* en haut de l'aide.

source: :mod:`distutils.filelist` --- The FileList class
fr: :mod:`distutils.filelist` — La classe *FileList* liste des fichiers

source: This module provides the :class:`FileList` class, used for poking about the filesystem and building lists of files.
fr: Ce module fournit la classe :class:`FileList`, utilisée pour parcourir le système de fichiers et construire des listes de fichiers.

source: :mod:`distutils.spawn` --- Spawn a sub-process
fr: :mod:`distutils.spawn` — Crée un sous-processus

source: This module provides the :func:`spawn` function, a front-end to various platform-specific functions for launching another program in a sub-process. Also provides :func:`find_executable` to search the path for a given executable name.
fr: Ce module offre la fonction :func:`spawn`, une interface avec diverses fonctions spécifiques à la plate-forme pour lancer un autre programme dans un sous-processus. Inclut également :func:`find_executable` pour rechercher le chemin d'accès pour un nom d'exécutable donné.

source: :mod:`distutils.sysconfig` --- System configuration information
fr: :mod:`distutils.sysconfig` --- Informations de configuration du système
