Repository: python/python-docs-fr
Catalog: distutils/apiref.po
Languages: fr

source: Add *dir* to the list of directories that will be searched for header files. The compiler is instructed to search directories in the order in which they are supplied by successive calls to :meth:`add_include_dir`.
fr: Ajoute *dir* à la liste des répertoires qui sont recherchés pour les fichiers d'en-tête. Le compilateur est chargé de rechercher les répertoires dans l'ordre dans lequel ils sont fournis par des appels successifs à :meth:`add_include_dir`.

source: Set the list of directories that will be searched to *dirs* (a list of strings). Overrides any preceding calls to :meth:`add_include_dir`; subsequent calls to :meth:`add_include_dir` add to the list passed to :meth:`set_include_dirs`. This does not affect any list of standard include directories that the compiler may search by default.
fr: Affecte la liste des répertoires qui seront recherchés à la valeur de *dirs* (une liste de chaînes). Remplace tous les appels précédents de :meth:`add_include_dir` ; les appels suivants de :meth:`add_include_dir` s'ajoutent à la liste transmise par :meth:`set_include_dirs`. Ceci n'affecte pas la liste des répertoires d'inclusion standard que le compilateur peut rechercher par défaut.

source: Add *libname* to the list of libraries that will be included in all links driven by this compiler object. Note that *libname* should \*not\* be the name of a file containing a library, but the name of the library itself: the actual filename will be inferred by the linker, the compiler, or the compiler class (depending on the platform).
fr: Ajoute *libname* à la liste des bibliothèques qui seront incluses dans tous les liens gérés par l'objet compilateur. Notez que *libname* ne *doit pas être* le nom d'un fichier contenant une bibliothèque, mais le nom de la bibliothèque elle-même : le nom du fichier sera déduit par l'éditeur de liens, le compilateur ou la classe de compilation (selon la plate-forme).

source: The linker will be instructed to link against libraries in the order they were supplied to :meth:`add_library` and/or :meth:`set_libraries`. It is perfectly valid to duplicate library names; the linker will be instructed to link against libraries as many times as they are mentioned.
fr: L'éditeur de liens est chargé de lier les bibliothèques dans l'ordre dans lequel elles sont fournies à :meth:`add_library` et/ou :meth:`set_libraries`. Il est parfaitement valide de dupliquer les noms de bibliothèques ; l'éditeur de liens est chargé de créer des liens avec les bibliothèques autant de fois que les noms sont mentionnées.

source: Set the list of libraries to be included in all links driven by this compiler object to *libnames* (a list of strings). This does not affect any standard system libraries that the linker may include by default.
fr: Affecte la liste des bibliothèques à inclure dans tous les liens gérés par l'objet compilateur avec la valeur de *libnames* (une liste des chaînes de caractères). Ceci n'affecte pas les bibliothèques système standard que l'éditeur de liens peut inclure par défaut.

source: Add *dir* to the list of directories that will be searched for libraries specified to :meth:`add_library` and :meth:`set_libraries`. The linker will be instructed to search for libraries in the order they are supplied to :meth:`add_library_dir` and/or :meth:`set_library_dirs`.
fr: Ajoute *dir* à la liste des répertoires qui seront recherchés pour les bibliothèques spécifiées dans :meth:`add_library` et :meth:`set_libraries`. L'éditeur de liens est chargé de rechercher les bibliothèques dans l'ordre dans lequel elles sont fournies à :meth:`add_library_dir` et/ou :meth:`set_library_dirs`.

source: Set the list of library search directories to *dirs* (a list of strings). This does not affect any standard library search path that the linker may search by default.
fr: Affecte la liste des répertoires de recherche de bibliothèque avec la valeur de *dirs* (une liste de chaînes de caractères). Cela n'affecte pas le chemin de recherche standard de la bibliothèque que l'éditeur de liens peut rechercher par défaut.

source: Add *dir* to the list of directories that will be searched for shared libraries at runtime.
fr: Ajoute *dir* à la liste des répertoires qui seront recherchés par les bibliothèques partagées au moment de l'exécution.

source: Set the list of directories to search for shared libraries at runtime to *dirs* (a list of strings). This does not affect any standard search path that the runtime linker may search by default.
fr: Affecte la liste des répertoires pour rechercher les bibliothèques partagées au moment de l'exécution à la valeur de *dirs* (une liste des chaînes de caractères). Ceci n'affecte aucun chemin de recherche standard que l'éditeur de liens d'exécution peut rechercher par défaut.

source: Define a preprocessor macro for all compilations driven by this compiler object. The optional parameter *value* should be a string; if it is not supplied, then the macro will be defined without an explicit value and the exact outcome depends on the compiler used.
fr: Définit une macro de préprocesseur pour toutes les compilations gérées par cet objet compilateur. Le paramètre optionnel *value* doit être une chaîne de caractères ; s'il n'est pas fourni, alors la macro sera définie sans valeur explicite et le résultat exact dépendra du compilateur utilisé.

source: Undefine a preprocessor macro for all compilations driven by this compiler object. If the same macro is defined by :meth:`define_macro` and undefined by :meth:`undefine_macro` the last call takes precedence (including multiple redefinitions or undefinitions). If the macro is redefined/undefined on a per-compilation basis (ie. in the call to :meth:`compile`), then that takes precedence.
fr: Désactive une macro de préprocesseur pour toutes les compilations gérées par cet objet compilateur. Si la même macro est définie par :meth:`define_macro` et ensuite désactivée par un appel à :meth:`undefine_macro`, le dernier appel est prioritaire (y compris en cas de redéfinitions multiples). Si la macro est redéfinie/désactivée par compilation (c'est-à-dire dans l'appel à :meth:`compile`), alors cet appel prévaut.

source: Add *object* to the list of object files (or analogues, such as explicitly named library files or the output of "resource compilers") to be included in every link driven by this compiler object.
fr: Ajoute *objet* à la liste des fichiers objets (ou analogues, tels que les fichiers de bibliothèque explicitement nommés ou la sortie des "compilateurs de ressources") à inclure dans chaque lien qui est géré par ce compilateur d'objets.

source: Set the list of object files (or analogues) to be included in every link to *objects*. This does not affect any standard object files that the linker may include by default (such as system libraries).
fr: Définit la liste des fichiers objets (ou analogues) à inclure dans chaque lien à la valeur de *objects*. Ceci n'affecte pas les fichiers d'objets standard que l'éditeur de liens peut inclure par défaut (comme les bibliothèques système).

source: The following methods implement methods for autodetection of compiler options, providing some functionality similar to GNU :program:`autoconf`.
fr: Les méthodes suivantes offre des services pour l'auto-détection des options du compilateur. Elles offrent des fonctionnalités similaires à celles du programme GNU :program:`autoconf`.

source: Detect the language of a given file, or list of files. Uses the instance attributes :attr:`language_map` (a dictionary), and :attr:`language_order` (a list) to do the job.
fr: Détecte le langage d'un fichier donné, ou d'une liste de fichiers. Utilise les attributs d'instance :attr:`language_map` (un dictionnaire) et :attr:`language_order` (une liste) pour faire le travail.

source: Search the specified list of directories for a static or shared library file *lib* and return the full path to that file. If *debug* is true, look for a debugging version (if that makes sense on the current platform). Return ``None`` if *lib* wasn't found in any of the specified directories.
fr: Recherche dans la liste des répertoires spécifiés un fichier de bibliothèque statique ou partagée *lib* et renvoie le chemin complet vers ce fichier. Si *debug* est vrai, recherche une version de débogage (si cela a du sens sur la plate-forme actuelle). Renvoie ``None`` si *lib* n'a pas été trouvé dans l'un des répertoires spécifiés.

source: Return a boolean indicating whether *funcname* is supported on the current platform. The optional arguments can be used to augment the compilation environment by providing additional include files and paths and libraries and paths.
fr: Renvoie un booléen indiquant si *funcname* est pris en charge sur la plate-forme courante. Les arguments optionnels peuvent être utilisés pour enrichir l'environnement de compilation en fournissant des fichiers, des répertoires de fichiers, des bibliothèques, des répertoires de bibliothèques supplémentaires

source: Return the compiler option to add *dir* to the list of directories searched for libraries.
fr: Renvoie l'option de compilation pour ajouter *dir* à la liste des répertoires recherchés pour les bibliothèques.

source: Return the compiler option to add *lib* to the list of libraries linked into the shared library or executable.
fr: Renvoie l'option de compilation pour ajouter *lib* à la liste des bibliothèques liées à la bibliothèque partagée ou à l'exécutable.

source: Return the compiler option to add *dir* to the list of directories searched for runtime libraries.
fr: Renvoie l'option de compilation pour ajouter *dir* à la liste des répertoires recherchés par les bibliothèques d'exécution.

source: Define the executables (and options for them) that will be run to perform the various stages of compilation. The exact set of executables that may be specified here depends on the compiler class (via the 'executables' class attribute), but most will have:
fr: Définit les exécutables (et leurs options) qui seront exécutés pour effectuer les différentes étapes de compilation. L'ensemble exact des exécutables qui peuvent être spécifiés ici dépend de la classe du compilateur (via l'attribut de classe *executables*), mais la plupart utilisent :

source: attribute
fr: attribut

source: the C/C++ compiler
fr: Le compilateur C/C++.

source: linker used to create shared objects and libraries
fr: L'éditeur de liens utilisé pour la création d'objets ou de bibliothèques partagées.

source: linker used to create binary executables
fr: L'éditeur de lien utilisé pour créer des exécutables binaires.

source: static library creator
fr: Créateur de bibliothèque statique.

source: On platforms with a command-line (Unix, DOS/Windows), each of these is a string that will be split into executable name and (optional) list of arguments. (Splitting the string is done similarly to how Unix shells operate: words are delimited by spaces, but quotes and backslashes can override this. See :func:`distutils.util.split_quoted`.)
fr: Sur les plates-formes disposant d'un outil de ligne de commande (Unix, DOS/Windows), chacun de ces éléments est une chaîne qui sera fractionnée en un nom exécutable et, éventuellement, une liste d'arguments. Le fractionnement de la chaîne est réalisée selon la même procédure que celle appliquée par les *shells* Unix : les mots sont délimités par des espaces, mais les guillemets et les antislashs permettent de les ignorer. Voir :func:`distutils.util.split_quoted`.

source: The following methods invoke stages in the build process.
fr: Les méthodes suivantes permettent d'exécuter des étapes lors de processus de construction.

source: Compile one or more source files. Generates object files (e.g. transforms a :file:`.c` file to a :file:`.o` file.)
fr: Compile un ou plusieurs fichiers source. Génère des fichiers objets (par exemple, transforme un fichier :file:`.c` en fichier :file:`.o`).

source: *sources* must be a list of filenames, most likely C/C++ files, but in reality anything that can be handled by a particular compiler and compiler class (eg. :class:`MSVCCompiler` can handle resource files in *sources*). Return a list of object filenames, one per source filename in *sources*. Depending on the implementation, not all source files will necessarily be compiled, but all corresponding object filenames will be returned.
fr: *sources* doit être une liste de noms de fichiers, généralement des fichiers C/C++, mais elle pourrait contenir n'importe quel fichier géré par un compilateur et une classe de compilateur (par exemple, :class:`MSVCCompiler` peut gérer les fichiers de ressources dans *sources*). Renvoie une liste de noms de fichiers objet : un objet par nom de fichier dans *sources*. Selon les cas, tous les fichiers source ne seront pas forcément compilés, mais tous les noms de fichiers objet correspondants seront renvoyés.

source: If *output_dir* is given, object files will be put under it, while retaining their original path component. That is, :file:`foo/bar.c` normally compiles to :file:`foo/bar.o` (for a Unix implementation); if *output_dir* is *build*, then it would compile to :file:`build/foo/bar.o`.
fr: Si *output_dir* est donné, les fichiers objets seront placés à l'intérieur, tout en conservant leurs chemins relatifs. Par exemple, le :file:`truc/machin.c` compile normalement en :file:`truc/machin.o` (pour une implémentation Unix) ; si *output_dir* a la valeur *build*, alors il compilera en :file:`build/truc/machin.o`.

source: *macros*, if given, must be a list of macro definitions. A macro definition is either a ``(name, value)`` 2-tuple or a ``(name,)`` 1-tuple. The former defines a macro; if the value is ``None``, the macro is defined without an explicit value. The 1-tuple case undefines a macro. Later definitions/redefinitions/undefinitions take precedence.
fr: Le paramètre *macros*, s'il est donné, doit être une liste de définitions de macros. Une définition de macro est soit un couple ``(nom, valeur)``, ou un singleton ``(nom,)``. Le premier définit une macro ; si la valeur est ``None``, la macro est définie sans valeur explicite. L'utilisation d'un singleton désactive la macro. Les définitions, redéfinitions ou désactivations ultérieures priment.

source: *include_dirs*, if given, must be a list of strings, the directories to add to the default include file search path for this compilation only.
fr: *include_dirs* doit être une liste de chaînes de caractères contenant les répertoires à ajouter au chemin de recherche par défaut pour cette compilation uniquement.

source: *debug* is a boolean; if true, the compiler will be instructed to output debug symbols in (or alongside) the object file(s).
fr: *debug* est un booléen ; si sa valeur est *vraie*, le compilateur est chargé d'afficher les symboles de débogage dans (ou à côté) du ou des fichiers objets.

source: *extra_preargs* and *extra_postargs* are implementation-dependent. On platforms that have the notion of a command-line (e.g. Unix, DOS/Windows), they are most likely lists of strings: extra command-line arguments to prepend/append to the compiler command line. On other platforms, consult the implementation class documentation. In any event, they are intended as an escape hatch for those occasions when the abstract compiler framework doesn't cut the mustard.
fr: *extra_preargs* et *extra_postargs* dépendent de l'implémentation. Sur les plates-formes qui ont une ligne de commande (par exemple Unix, DOS/Windows), il s'agit très probablement de listes de chaînes de caractères. Ce sont des arguments supplémentaires à ajouter avant (*preargs*) et après (*postargs*) la ligne de commande du compilateur. Sur d'autres plates-formes, consultez la documentation de la classe d'implémentation. Ces paramètres sont exposés pour permettre de sortir du cadre de la classe abstraite en cas de nécessité.

source: *depends*, if given, is a list of filenames that all targets depend on. If a source file is older than any file in depends, then the source file will be recompiled. This supports dependency tracking, but only at a coarse granularity.
fr: *depends* est une liste de noms de fichiers dont dépendent toutes les cibles. Si un fichier source est plus ancien qu'un fichier dans *depends*, alors le fichier source sera recompilé. Cela permet un suivi des dépendances à un niveau macro.

source: Raises :exc:`CompileError` on failure.
fr: Lève :exc:`CompileError` en cas d'échec.

source: Link a bunch of stuff together to create a static library file. The "bunch of stuff" consists of the list of object files supplied as *objects*, the extra object files supplied to :meth:`add_link_object` and/or :meth:`set_link_objects`, the libraries supplied to :meth:`add_library` and/or :meth:`set_libraries`, and the libraries supplied as *libraries* (if any).
fr: Relie un ensemble d'éléments pour créer un fichier de bibliothèque statique. L'ensemble d'éléments se compose de la liste des fichiers d'objets fournis comme *objets*, des fichiers d'objets supplémentaires fournis à :meth:`add_link_object` et/ou :meth:`set_link_objects`, des bibliothèques fournies à :meth:`add_library` et/ou :meth:`set_libraries` et les bibliothèques fournies à *libraries* (le cas échéant).

source: *output_libname* should be a library name, not a filename; the filename will be inferred from the library name. *output_dir* is the directory where the library file will be put.
fr: *output_libname* doit être un nom de bibliothèque et non un nom de fichier ; le nom de fichier sera déduit du nom de bibliothèque. *output_dir* est le répertoire dans lequel le fichier bibliothèque sera placé.

source: *debug* is a boolean; if true, debugging information will be included in the library (note that on most platforms, it is the compile step where this matters: the *debug* flag is included here just for consistency).
fr: *debug* est un booléen ; si sa valeur est *vraie*, les informations de débogage seront incluses dans la bibliothèque (notez que sur la plupart des plateformes, c'est à l'étape de compilation que ce paramètre est pris en compte : le paramètre *debug* est inclus ici pour assurer une cohérence).

source: *target_lang* is the target language for which the given objects are being compiled. This allows specific linkage time treatment of certain languages.
fr: *target_lang* est le langage cible pour lequel les objets donnés sont compilés. Cela permet un traitement spécifique du temps de liaison dans certains langages.

source: Raises :exc:`LibError` on failure.
fr: Lève :exc:`LibError` en cas d'échec.

source: Link a bunch of stuff together to create an executable or shared library file.
fr: Relie un ensemble d'éléments pour créer un fichier exécutable ou une bibliothèque partagée.

source: The "bunch of stuff" consists of the list of object files supplied as *objects*. *output_filename* should be a filename. If *output_dir* is supplied, *output_filename* is relative to it (i.e. *output_filename* can provide directory components if needed).
fr: L'ensemble d'éléments se compose de la liste des fichiers objets fournis comme *objets*. *output_filename* devrait être un nom de fichier. Si *output_dir* est fourni, *output_filename* lui est relatif (c'est-à-dire que *output_filename* peut être un chemin vers un fichier ).

source: *libraries* is a list of libraries to link against. These are library names, not filenames, since they're translated into filenames in a platform-specific way (eg. *foo* becomes :file:`libfoo.a` on Unix and :file:`foo.lib` on DOS/Windows). However, they can include a directory component, which means the linker will look in that specific directory rather than searching all the normal locations.
fr: *libraries* est une liste de bibliothèques avec lesquelles il est possible d'établir des liens. Ce sont des noms de bibliothèques, pas des noms de fichiers, puisqu'ils sont traduits en noms de fichiers d'une manière spécifique à la plate-forme (par exemple *truc* devient :file:`libtruc.a` sous Unix et :file:`truc.lib` sous DOS/Windows). Cependant, ils peuvent inclure un chemin, ce qui signifie que l'éditeur de liens cherchera dans ce chemin spécifique plutôt que de rechercher tous les emplacements standard.

source: *library_dirs*, if supplied, should be a list of directories to search for libraries that were specified as bare library names (ie. no directory component). These are on top of the system default and those supplied to :meth:`add_library_dir` and/or :meth:`set_library_dirs`. *runtime_library_dirs* is a list of directories that will be embedded into the shared library and used to search for other shared libraries that \*it\* depends on at run-time. (This may only be relevant on Unix.)
fr: *library_dirs*, s'il est fourni, doit être une liste de répertoires à rechercher pour les bibliothèques qui ont été spécifiées comme des bibliothèques pures (c'est-à-dire sans aucun répertoire). Celles-ci s'ajoutent aux valeurs par défaut du système et à celles fournies à :meth:`add_library_dir` et/ou :meth:`set_library_dirs`. *runtime_library_dirs* est une liste de répertoires qui seront intégrés dans la bibliothèque partagée et utilisés pour rechercher d'autres bibliothèques partagées dont elle dépend à l'exécution. (Ceci est probablement valable uniquement sous UNIX.)

source: *export_symbols* is a list of symbols that the shared library will export. (This appears to be relevant only on Windows.)
fr: *export_symbols* est une liste de symboles que la bibliothèque partagée va exporter. (Ceci est probablement valable uniquement sous Window.)

source: *debug* is as for :meth:`compile` and :meth:`create_static_lib`, with the slight distinction that it actually matters on most platforms (as opposed to :meth:`create_static_lib`, which includes a *debug* flag mostly for form's sake).
fr: *debug* s'utilise comme pour :meth:`compile` et :meth:`create_static_lib`, avec la nuance qu'elle a ici une importance sur la plupart des plateformes (par opposition à :meth:`create_static_lib` qui inclut une option *debug* pour se conformer à l'interface).

source: *extra_preargs* and *extra_postargs* are as for :meth:`compile` (except of course that they supply command-line arguments for the particular linker being used).
fr: *extra_preargs* et *extra_postargs* s'utilisent comme pour :meth:`compile` (sauf bien sûr qu'ils fournissent des arguments à la ligne de commande pour l'éditeur de liens spécifique utilisé).

source: Raises :exc:`LinkError` on failure.
fr: Lève :exc:`LinkError` en cas d'échec.

source: Link an executable. *output_progname* is the name of the file executable, while *objects* are a list of object filenames to link in. Other arguments are as for the :meth:`link` method.
fr: Lie un exécutable. *output_progname* est le nom de l'exécutable du fichier, tandis que *objects* est une liste de noms de fichiers objets à lier. Les autres arguments sont les mêmes que pour la méthode :meth:`link`.

source: Link a shared library. *output_libname* is the name of the output library, while *objects* is a list of object filenames to link in. Other arguments are as for the :meth:`link` method.
fr: Lie une bibliothèque partagée. *output_libname* est le nom de la bibliothèque de sortie, tandis que *objects* est une liste de noms de fichiers d'objets à lier. Les autres arguments sont les mêmes que pour la méthode :meth:`link`.

source: Link a shared object. *output_filename* is the name of the shared object that will be created, while *objects* is a list of object filenames to link in. Other arguments are as for the :meth:`link` method.
fr: Lie un objet partagé. *output_filename* est le nom de l'objet partagé qui sera créé, tandis que *objects* est une liste de noms de fichiers d'objets à lier. Les autres arguments sont les mêmes que pour la méthode :meth:`link`.
