Repository: python/python-docs-fr
Catalog: distutils/apiref.po
Languages: fr

source: API Reference
fr: Référence de l'API

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
fr: Cette page est conservée uniquement jusqu'à ce que la documentation ``setuptool`` sur https://setuptools.readthedocs.io/en/latest/setuptools.html couvre de manière indépendante toutes les informations pertinentes actuellement incluses ici.

source: :mod:`distutils.core` --- Core Distutils functionality
fr: :mod:`distutils.core` --- Fonctionnalités principales du module Distutils

source: The :mod:`distutils.core` module is the only module that needs to be installed to use the Distutils. It provides the :func:`setup` (which is called from the setup script). Indirectly provides the :class:`distutils.dist.Distribution` and :class:`distutils.cmd.Command` class.
fr: Le module :mod:`distutils.core` est le seul module qui a besoin d'être installé pour utiliser Distutils. Il fournit le :func:`setup` (qui est appelé par le script *setup.py*). Il fournit indirectement les classes :class:`distutils.dist.Distribution` et :class:`distutils.cmd.Command`.

source: The basic do-everything function that does most everything you could ever ask for from a Distutils method.
fr: La fonction de base à tout faire qui fait presque tout ce dont vous pourriez attendre d'une méthode Distutils.

source: The setup function takes a large number of arguments. These are laid out in the following table.
fr: La fonction ``setup`` prend un grand nombre d'arguments. Ils sont présentés dans le tableau suivant.

source: argument name
fr: nom de l'argument

source: value
fr: valeur

source: The name of the package
fr: Le nom du paquet

source: a string
fr: une chaîne de caractères

source: The version number of the package; see :mod:`distutils.version`
fr: Le numéro de version du paquet, voir :mod:`distutils.version`

source: A single line describing the package
fr: Une ligne unique décrivant le paquet

source: Longer description of the package
fr: Une description plus longue du paquet

source: The name of the package author
fr: Le nom de l'auteur du paquet

source: The email address of the package author
fr: L'adresse e-mail de l'auteur du paquet

source: The name of the current maintainer, if different from the author. Note that if the maintainer is provided, distutils will use it as the author in :file:`PKG-INFO`
fr: Le nom de l'actuel mainteneur, s'il est différent de l'auteur. Remarquez que si *maintainer* est fourni, *distutils* l'utilise à la place de *author* dans :file:`PKG-INFO`.

source: The email address of the current maintainer, if different from the author
fr: Le courriel de l'actuel mainteneur, si différent de l'auteur

source: A URL for the package (homepage)
fr: Une URL pour le paquet (page d'accueil)

source: A URL to download the package
fr: Une URL pour télécharger le paquet

source: A list of Python packages that distutils will manipulate
fr: Une liste des paquets Python que *distutils* va manipuler

source: a list of strings
fr: une liste de chaînes de caractères

source: A list of Python modules that distutils will manipulate
fr: Une liste de modules Python que *distutils* va manipuler

source: A list of standalone script files to be built and installed
fr: Une liste de scripts autonomes à construire et à installer

source: A list of Python extensions to be built
fr: Une liste des extensions Python à construire

source: a list of instances of :class:`distutils.core.Extension`
fr: une liste d'instances de :class:`distutils.core.Extension`

source: A list of categories for the package
fr: Une liste de catégories pour le paquet

source: a list of strings; valid classifiers are listed on `PyPI <https://pypi.org/classifiers>`_.
fr: une liste des chaînes de caractères, les classificateurs valides sont listés sur `PyPI <https://pypi.org/pypi?:action=list_classifiers>`_.

source: the :class:`Distribution` class to use
fr: la classe :class:`Distribution` à utiliser

source: a subclass of :class:`distutils.core.Distribution`
fr: une sous classe de :class:`distutils.core.Distribution`

source: The name of the setup.py script - defaults to ``sys.argv[0]``
fr: Le nom du script *setup.py* . Initialisé par ``sys.argv[0]``

source: Arguments to supply to the setup script
fr: Arguments à fournir au script d'installation

source: default options for the setup script
fr: options par défaut pour le script d'installation

source: a dictionary
fr: un dictionnaire

source: The license for the package
fr: La licence pour le paquet

source: Descriptive meta-data, see :pep:`314`
fr: Méta-données descriptives, voir :pep:`314`

source: a list of strings or a comma-separated string
fr: Une liste de chaînes de caractères ou une chaîne de caractère dont les éléments sont séparés par des virgules.

source: A mapping of command names to :class:`Command` subclasses
fr: Un dictionnaire des noms de commandes et des sous-classes :class:`Command`

source: A list of data files to install
fr: Une liste de fichiers de données à installer

source: a list
fr: une liste

source: A mapping of package to directory names
fr: Un dictionnaire des paquets et des noms de dossiers

source: Run a setup script in a somewhat controlled environment, and return the :class:`distutils.dist.Distribution` instance that drives things. This is useful if you need to find out the distribution meta-data (passed as keyword args from *script* to :func:`setup`), or the contents of the config files or command-line.
fr: Exécute un script d'installation dans un environnement quelque peu contrôlé, et renvoie une instance :class:`distutils.dist.distribution` qui contrôle l’exécution. Ceci est utile si vous avez besoin de connaître les méta-données de la distribution (passées sous forme d'arguments nommés de *script* à la fonction :func:`setup`), ou le contenu des fichiers de configuration ou de la ligne de commande.

source: *script_name* is a file that will be read and run with :func:`exec`. ``sys.argv[0]`` will be replaced with *script* for the duration of the call. *script_args* is a list of strings; if supplied, ``sys.argv[1:]`` will be replaced by *script_args* for the duration of the call.
fr: *script_name* est un fichier qui sera lu et exécuté avec :func:`exec`. ``sys.argv[0]`` sera remplacé par *script* par la durée de l'appel. *script_args* est une liste de chaînes de caractères; si fourni, ``sys.argv[1:]`` sera remplacé par *script_args* pour la durée de l'appel.

source: *stop_after* tells :func:`setup` when to stop processing; possible values:
fr: *stop_after* dit à :func:`setup` quand s'arrêter; valeurs possibles:

source: Stop after the :class:`Distribution` instance has been created and populated with the keyword arguments to :func:`setup`
fr: S'arrête une fois que l'instance :class:`Distribution` a été créée et renseignée avec les arguments-clés de :func:`setup`

source: Stop after config files have been parsed (and their data stored in the :class:`Distribution` instance)
fr: S'arrête une fois que les fichiers de configuration ont été parcouru (et que leurs données ont été stockées dans l'instance :class:`Distribution`)

source: Stop after the command-line (``sys.argv[1:]`` or *script_args*) have been parsed (and the data stored in the :class:`Distribution` instance.)
fr: S'arrête une fois que la ligne de commande (``sys.argv[1:]`` ou *script_args*) a été parcouru (et les données stockées dans l'instance :class:`Distribution`)

source: Stop after all commands have been run (the same as if :func:`setup` had been called in the usual way). This is the default value.
fr: S'arrête une fois que toutes les commandes ont été exécutées (comme si :func:`setup` fût appelé de la manière habituelle). Ceci est la valeur par défaut.

source: In addition, the :mod:`distutils.core` module exposed a number of classes that live elsewhere.
fr: De plus, le module :mod:`distutils.core` a exposé un nombre de classe qui existent ailleurs.

source: :class:`~distutils.extension.Extension` from :mod:`distutils.extension`
fr: :class:`~distutils.extension.Extension` du module :mod:`distutils.extension`

source: :class:`~distutils.cmd.Command` from :mod:`distutils.cmd`
fr: :class:`~distutils.cmd.Command` du module :mod:`distutils.cmd`

source: :class:`~distutils.dist.Distribution` from :mod:`distutils.dist`
fr: :class:`~distutils.dist.Distribution` du module :mod:`distutils.dist`

source: A short description of each of these follows, but see the relevant module for the full reference.
fr: Une courte description de chacune d'elle suit, mais consultez le module concerné pour une référence complète.

source: The Extension class describes a single C or C++ extension module in a setup script. It accepts the following keyword arguments in its constructor:
fr: La classe *Extension* décrit un seul module d'extension C ou C++ dans un script d'installation. Elle accepte dans son constructeur les arguments nommés suivants:

source: the full name of the extension, including any packages --- ie. *not* a filename or pathname, but Python dotted name
fr: Le nom complet de l'extension, incluant n'importe quel paquet --- c-à-d *pas* un nom de fichier ou de chemin mais un nom Python séparé par des points.

source: list of source filenames, relative to the distribution root (where the setup script lives), in Unix form (slash-separated) for portability. Source files may be C, C++, SWIG (.i), platform-specific resource files, or whatever else is recognized by the :command:`build_ext` command as source for a Python extension.
fr: Listes des noms de fichier des sources, relatifs à la racine de la distribution (où est placé le script *setup.py*), dans un format Unix (séparé par des slashs) dans un souci de portabilité. Les fichiers de code source peuvent être du C, C++, SWIG (*.i*), des fichiers de ressources spécifiques à la plateforme ou tout autre reconnu par la commande :command:`build_ext` comme source d'une extension Python.

source: list of directories to search for C/C++ header files (in Unix form for portability)
fr: Liste des répertoires où chercher les fichiers d'entêtes C/C++ (en format Unix dans un souci de portabilité).

source: list of macros to define; each macro is defined using a 2-tuple ``(name, value)``, where *value* is either the string to define it to or ``None`` to define it without a particular value (equivalent of ``#define FOO`` in source or :option:`!-DFOO` on Unix C compiler command line)
fr: Liste de macros à définir ; chaque macro est définie à l'aide d'un couple ``(name, value)``, où *value* correspond soit à la chaîne sur laquelle la macro doit être définie, soit à ``None`` pour définir la macro sur aucune valeur particulière (équivalent à ``#define TRUC`` dans la source ou à :option:`!-DTRUC` dans la ligne de commande du compilateur C Unix.

source: a list of tuples
fr: une liste de tuples

source: list of macros to undefine explicitly
fr: Liste de macros à ignorer explicitement.

source: list of directories to search for C/C++ libraries at link time
fr: Liste de répertoires à parcourir pour chercher les bibliothèques C/C++ lors de la phase d'édition de liens.

source: list of library names (not filenames or paths) to link against
fr: Liste de noms de bibliothèques à lier à la compilation. Pas de noms de fichiers ou de chemin.

source: list of directories to search for C/C++ libraries at run time (for shared extensions, this is when the extension is loaded)
fr: Liste de répertoires à parcourir pour les bibliothèques C/C++ lors de la phase d'exécution. Pour les extensions partagées, c'est à ce moment que l'extension est chargée.

source: list of extra files to link with (eg. object files not implied by 'sources', static library that must be explicitly specified, binary resource files, etc.)
fr: Liste des fichiers supplémentaires à lier (par exemple les fichiers d'objets non explicités dans les 'sources', bibliothèque statique qui doit être explicitement spécifiée, fichiers de ressources binaires, etc. ).

source: any extra platform- and compiler-specific information to use when compiling the source files in 'sources'. For platforms and compilers where a command line makes sense, this is typically a list of command-line arguments, but for other platforms it could be anything.
fr: Toute information supplémentaire spécifique à la plate-forme et au compilateur à utiliser lors de la compilation des fichiers sources dans 'sources'. Pour les plates-formes et les compilateurs où une ligne de commande a du sens, il s'agit généralement d'une liste d'arguments de ligne de commande, mais pour d'autres plates-formes, cela peut être n'importe quoi.

source: any extra platform- and compiler-specific information to use when linking object files together to create the extension (or to create a new static Python interpreter). Similar interpretation as for 'extra_compile_args'.
fr: Toute information supplémentaire spécifique à la plate-forme et au compilateur à utiliser lors de la liaison de fichiers objets pour créer l'extension (ou pour créer un nouvel interpréteur Python statique). Interprétation similaire à celle de *extra_compile_args*.

source: list of symbols to be exported from a shared extension. Not used on all platforms, and not generally necessary for Python extensions, which typically export exactly one symbol: ``init`` + extension_name.
fr: Liste des symboles à exporter à partir d'une extension partagée. N'est pas utilisé sur toutes les plates-formes et n'est généralement pas nécessaire pour les extensions Python, qui exportent généralement exactement un symbole : ``init + nom_de_l'extension``.

source: list of files that the extension depends on
fr: Liste des fichiers dont dépend l'extension.

source: extension language (i.e. ``'c'``, ``'c++'``, ``'objc'``). Will be detected from the source extensions if not provided.
fr: Langage de l'extension (par exemple ``'c'``, ``'c++'``, ``'objc'``). Il sera détecté selon l'extension de la source s'il n'est pas précisé.

source: specifies that a build failure in the extension should not abort the build process, but simply skip the extension.
fr: Spécifie qu'un échec de compilation dans l'extension ne doit pas interrompre le processus de compilation, mais simplement ignorer l'extension.

source: a boolean
fr: un booléen

source: A :class:`Distribution` describes how to build, install and package up a Python software package.
fr: Une classe :class:`Distribution` décrit comment compiler, installer et empaqueter un paquet logiciel Python.

source: See the :func:`setup` function for a list of keyword arguments accepted by the Distribution constructor. :func:`setup` creates a Distribution instance.
fr: Voir la fonction :func:`setup` pour une liste des arguments de mots-clés acceptés par le constructeur *Distribution*. :func:`setup` crée une instance de Distribution.

source: :class:`~distutils.core.Distribution` now warns if ``classifiers``, ``keywords`` and ``platforms`` fields are not specified as a list or a string.
fr: :class:`~distutils.core.Distribution` avertit maintenant si les champs ``classifiers``, ``keywords`` et ``platforms`` ne sont pas spécifiés comme une liste ou une chaîne de caractères.

source: A :class:`Command` class (or rather, an instance of one of its subclasses) implement a single distutils command.
fr: Une classe :class:`Command` (ou plutôt une instance d'une de ses sous-classes) implémente une commande *distutils* unique.

source: :mod:`distutils.ccompiler` --- CCompiler base class
fr: :mod:`distutils.ccompiler` — Classe de base CCompiler

source: This module provides the abstract base class for the :class:`CCompiler` classes. A :class:`CCompiler` instance can be used for all the compile and link steps needed to build a single project. Methods are provided to set options for the compiler --- macro definitions, include directories, link path, libraries and the like.
fr: Ce module fournit la classe de base abstraite pour les classes :class:`CCompiler`. Une instance de :class:`CCompiler` peut être utilisée pour toutes les étapes de compilation et de liaison nécessaires à la compilation d'un projet unique. Des méthodes sont fournies pour définir des options pour le compilateur --- définitions de macros, inclusion des répertoires, des chemins de liens, des bibliothèques, etc.

source: This module provides the following functions.
fr: Ce module fournit les fonctions suivantes.

source: Generate linker options for searching library directories and linking with specific libraries. *libraries* and *library_dirs* are, respectively, lists of library names (not filenames!) and search directories. Returns a list of command-line options suitable for use with some compiler (depending on the two format strings passed in).
fr: Génère des options de liaison pour chercher dans les répertoires des bibliothèques et pour effectuer les liaisons avec des bibliothèques spécifiques. *libraries* et *library_dirs* sont, respectivement, des listes de noms de bibliothèques (pas de noms de fichiers !) et de répertoires à rechercher. Renvoie une liste d'options de ligne de commande utilisables avec certains compilateurs (en fonction des deux chaînes de format transmises).

source: Generate C pre-processor options (:option:`!-D`, :option:`!-U`, :option:`!-I`) as used by at least two types of compilers: the typical Unix compiler and Visual C++. *macros* is the usual thing, a list of 1- or 2-tuples, where ``(name,)`` means undefine (:option:`!-U`) macro *name*, and ``(name, value)`` means define (:option:`!-D`) macro *name* to *value*. *include_dirs* is just a list of directory names to be added to the header file search path (:option:`!-I`). Returns a list of command-line options suitable for either Unix compilers or Visual C++.
fr: Génère les options du préprocesseur C (:option:`!-D`, :option:`!-U`, :option:`!-I`) utilisées par au moins deux types de compilateurs : les compilateurs type Unix et Visual C++. *macros* est une liste de couples où ``(name,)`` est traité comme *non définie* (:option:`!-U`); ``(name, value)`` est traité comme *définie* (:option:`!-D`). *include_dirs* est la liste de noms de répertoires à ajouter au chemin de recherche du fichier d'en-tête (:option:`!-I`). Renvoie une liste d'options de ligne de commande pour les compilateurs Unix ou Visual C+++.

source: Determine the default compiler to use for the given platform.
fr: Détermine le compilateur par défaut a utiliser par une plateforme donnée.

source: *osname* should be one of the standard Python OS names (i.e. the ones returned by ``os.name``) and *platform* the common value returned by ``sys.platform`` for the platform in question.
fr: *osname* doit être l'un des noms d'OS Python standard (c'est-à-dire un des noms renvoyés par ``os.name``) et *platform* la valeur commune renvoyés par ``sys.platform`` pour la plate-forme en question.

source: The default values are ``os.name`` and ``sys.platform`` in case the parameters are not given.
fr: Les valeurs par défaut sont ``os.name`` et ``sys.platform`` si les paramètres ne sont pas fournis.

source: Factory function to generate an instance of some CCompiler subclass for the supplied platform/compiler combination. *plat* defaults to ``os.name`` (eg. ``'posix'``, ``'nt'``), and *compiler* defaults to the default compiler for that platform. Currently only ``'posix'`` and ``'nt'`` are supported, and the default compilers are "traditional Unix interface" (:class:`UnixCCompiler` class) and Visual C++ (:class:`MSVCCompiler` class). Note that it's perfectly possible to ask for a Unix compiler object under Windows, and a Microsoft compiler object under Unix---if you supply a value for *compiler*, *plat* is ignored.
fr: Fonction de génération produisant une instance d'une sous-classe CCompiler pour la combinaison plateforme/compilateur fournie. Par défaut, *plat* est le ``os.name`` (par exemple ``'posix'``, ``'nt'``), et *compiler* est le compilateur par défaut pour cette plate-forme. Actuellement, seuls ``'posix'`` et ``'nt'`` sont gérés, et les compilateurs par défaut sont ceux qui gèrent une "interface Unix traditionnelle" (:class:`UnixCCompiler`) et Visual C++ (:class:`MSVCCompiler`). Notez qu'il est tout à fait possible de demander un objet compilateur Unix sous Windows, et un objet compilateur Microsoft sous Unix. Si vous fournissez une valeur pour *compiler*, *plat* est ignoré.

source: Print list of available compilers (used by the :option:`!--help-compiler` options to :command:`build`, :command:`build_ext`, :command:`build_clib`).
fr: Affiche la liste des compilateurs disponibles (utilisés par l'option :option:`!--help-compiler` pour les commandes :command:`build`, :command:`build_ext`, :command:`build_clib`).

source: The abstract base class :class:`CCompiler` defines the interface that must be implemented by real compiler classes. The class also has some utility methods used by several compiler classes.
fr: La classe de base abstraite :class:`CCompiler` définit l'interface qui doit être implémentée par des classes de compilateur concrètes. La classe possède également quelques méthodes utilitaires utilisées par plusieurs classes de compilateurs.

source: The basic idea behind a compiler abstraction class is that each instance can be used for all the compile/link steps in building a single project. Thus, attributes common to all of those compile and link steps --- include directories, macros to define, libraries to link against, etc. --- are attributes of the compiler instance. To allow for variability in how individual files are treated, most of those attributes may be varied on a per-compilation or per-link basis.
fr: L'idée de base derrière une classe abstraite de compilateur est que chaque instance peut être utilisée pour toutes les étapes de compilation/lien dans la construction d'un seul projet. Ainsi, les attributs communs à toutes ces étapes de compilation et de liaison (ce qui inclut les répertoires, les macros à définir, les bibliothèques à relier, etc.) sont des attributs de l'instance du compilateur. Pour tenir compte des variations dans la façon dont chaque fichier est traité, la plupart de ces attributs peuvent être modifiés en fonction de chaque compilation ou de chaque lien.

source: The constructor for each subclass creates an instance of the Compiler object. Flags are *verbose* (show verbose output), *dry_run* (don't actually execute the steps) and *force* (rebuild everything, regardless of dependencies). All of these flags default to ``0`` (off). Note that you probably don't want to instantiate :class:`CCompiler` or one of its subclasses directly - use the :func:`distutils.CCompiler.new_compiler` factory function instead.
fr: Le constructeur de chaque sous-classe crée une instance de l'objet *Compiler*. Les paramètres optionnels sont *verbose* (affiche plus d'information à l'exécution), *dry_run* (ne pas exécuter les étapes) et *force* (tout reconstruire, indépendamment des dépendances). Tous ces paramètres ont la valeur par défaut ``0`` (désactivé). Notez que vous ne voulez probablement pas instancier directement la classe :class:`CCompiler` ou une de ses sous-classes. Utilisez plutôt la fonction génératrice :func:`distutils.CCompiler.new_compiler`.

source: The following methods allow you to manually alter compiler options for the instance of the Compiler class.
fr: Les méthodes suivantes vous permettent de modifier manuellement les options du compilateur de l'instance de la classe *Compiler*.
