Repository: python/python-docs-fr
Catalog: distutils/apiref.po
Languages: fr

source: Set final values for all the options that this command supports. This is always called as late as possible, ie. after any option assignments from the command-line or from other commands have been done. Thus, this is the place to code option dependencies: if *foo* depends on *bar*, then it is safe to set *foo* from *bar* as long as *foo* still has the same value it was assigned in :meth:`initialize_options`.
fr: Définit les valeurs finales pour toutes les options que cette commande gère. Cette méthode doit toujours être appelée le plus tard possible, c'est-à-dire après que toutes les affectations des options de la ligne de commande ou que d'autres commandes ont été faites. C'est donc l'endroit idéal pour introduire des dépendances d'options : si *truc* dépend de *machin*, alors il est sûr de mettre *truc* de *machin* aussi longtemps que *truc* a toujours la même valeur qui lui a été attribué par :meth:`initialize_options`.

source: A command's raison d'etre: carry out the action it exists to perform, controlled by the options initialized in :meth:`initialize_options`, customized by other commands, the setup script, the command-line, and config files, and finalized in :meth:`finalize_options`. All terminal output and filesystem interaction should be done by :meth:`run`.
fr: La raison d'être d'une commande : exécuter l'action programmée en étant contrôlée par les options initialisées dans :meth:`initialize_options`, personnalisées par d'autres commandes, par le script de configuration, par la ligne de commande et les fichiers de configuration, puis finalisée dans :meth:`finalize_options`. Toutes les interactions avec le système de fichiers et la sortie du terminal doivent être effectuées par :meth:`run`.

source: *sub_commands* formalizes the notion of a "family" of commands, e.g. ``install`` as the parent with sub-commands ``install_lib``, ``install_headers``, etc. The parent of a family of commands defines *sub_commands* as a class attribute; it's a list of 2-tuples ``(command_name, predicate)``, with *command_name* a string and *predicate* a function, a string or ``None``. *predicate* is a method of the parent command that determines whether the corresponding command is applicable in the current situation. (E.g. ``install_headers`` is only applicable if we have any C header files to install.) If *predicate* is ``None``, that command is always applicable.
fr: *sub_commands* formalise la notion de "famille" de commandes, par exemple. ``install`` est le parent des sous-commandes ``install_lib``, ``install_headers``, etc. Le parent d'une famille de commandes définit *sub_commands* en tant qu'attribut de classe ; c'est une liste de couples ``(command_name, predicate)``, avec *command_name* le nom de la commande et *predicate* une fonction, une chaîne ou ``None``. *predicate* est une méthode de la commande parent qui détermine si la commande correspondante est applicable dans la situation actuelle. Par exemple : ``install_headers`` n'est applicable que s'il existe des fichiers d'en-tête C à installer. Si *predicate* est ``None``, cette commande est toujours effectuée.

source: *sub_commands* is usually defined at the *end* of a class, because predicates can be methods of the class, so they must already have been defined. The canonical example is the :command:`install` command.
fr: *sub_commands* est généralement défini à la *fin* d'une classe, car les prédicats peuvent être des méthodes de la classe, ils doivent donc déjà avoir été définis. L'exemple canonique est la commande :command:`install`.

source: :mod:`distutils.command` --- Individual Distutils commands
fr: :mod:`distutils.command` — Commandes *Distutils* individuelles

source: :mod:`distutils.command.bdist` --- Build a binary installer
fr: :mod:`distutils.command.bdist` — Construit un installateur binaire

source: :mod:`distutils.command.bdist_packager` --- Abstract base class for packagers
fr: :mod:`distutils.command.bdist_packager` --- Classe de base abstraite pour empaqueteurs

source: :mod:`distutils.command.bdist_dumb` --- Build a "dumb" installer
fr: :mod:`distutils.command.bdist_dumb` --- Construit un installateur passif (*dumb*)

source: :mod:`distutils.command.bdist_msi` --- Build a Microsoft Installer binary package
fr: :mod:`distutils.command.bdist_msi` --- Construit un installateur Microsoft

source: Builds a `Windows Installer`_ (.msi) binary package.
fr: Construit un installateur `Windows Installeur`_ (*.msi*)

source: In most cases, the ``bdist_msi`` installer is a better choice than the ``bdist_wininst`` installer, because it provides better support for Win64 platforms, allows administrators to perform non-interactive installations, and allows installation through group policies.
fr: Dans la plupart des cas, l'installateur ``bdist_msi`` est un meilleur choix que l'installateur ``bdist_wininst``, car il gère mieux les plates-formes *Win64*, et permet en plus aux administrateurs d'effectuer des installations non interactives ainsi que des installations via des stratégies de groupe.

source: :mod:`distutils.command.bdist_rpm` --- Build a binary distribution as a Redhat RPM and SRPM
fr: :mod:`distutils.command.bdist_rpm` --- Construit une distribution binaire au format Redhat RPM et SRPM

source: :mod:`distutils.command.bdist_wininst` --- Build a Windows installer
fr: :mod:`distutils.command.bdist_wininst` --- Construit un installateur Windows

source: :mod:`distutils.command.sdist` --- Build a source distribution
fr: :mod:`distutils.command.sdist` — Construit une distribution source

source: :mod:`distutils.command.build` --- Build all files of a package
fr: :mod:`distutils.command.build` --- Construit tous les fichiers d'un paquet

source: :mod:`distutils.command.build_clib` --- Build any C libraries in a package
fr: :mod:`distutils.command.build_clib` --- Construit toutes les bibliothèques C d'un paquet

source: :mod:`distutils.command.build_ext` --- Build any extensions in a package
fr: :mod:`distutils.command.build_ext` --- Construit toutes les extensions d'un paquet

source: :mod:`distutils.command.build_py` --- Build the .py/.pyc files of a package
fr: :mod:`distutils.command.build_py` --- Construit les fichiers *.py/.pyc* d'un paquet

source: Alternative implementation of build_py which also runs the 2to3 conversion library on each .py file that is going to be installed. To use this in a setup.py file for a distribution that is designed to run with both Python 2.x and 3.x, add::
fr: Implémentation alternative de *build_py* qui exécute également la bibliothèque de conversion *2to3* sur chaque fichier *.py* qui va être installé. Pour l'utiliser dans un fichier *setup.py* pour une distribution conçue pour fonctionner avec *Python 2.x* et *3.x*, ajouter ::

source: to your setup.py, and later::
fr: à votre *setup.py* et, plus tard ::

source: to the invocation of setup().
fr: à l'appel de *setup()*.

source: :mod:`distutils.command.build_scripts` --- Build the scripts of a package
fr: :mod:`distutils.command.build_scripts` --- Construit les scripts d'un paquet

source: :mod:`distutils.command.clean` --- Clean a package build area
fr: :mod:`distutils.command.clean` --- Nettoie un dossier de compilation d'un paquet

source: This command removes the temporary files created by :command:`build` and its subcommands, like intermediary compiled object files. With the ``--all`` option, the complete build directory will be removed.
fr: Cette commande supprime les fichiers temporaires créés par la commande :command:`build` et ses sous-commandes, comme les fichiers objets compilés intermédiaires. Avec l'option ``--all``, le répertoire de compilation sera supprimé.

source: Extension modules built :ref:`in place <distutils-build-ext-inplace>` will not be cleaned, as they are not in the build directory.
fr: Les modules d'extension construits :ref:`sur place <distutils-build-ext-inplace>` ne seront pas effacés, car ils ne sont pas dans le répertoire *build*.

source: :mod:`distutils.command.config` --- Perform package configuration
fr: :mod:`distutils.command.config` --- Effectue la configuration d'un paquet

source: :mod:`distutils.command.install` --- Install a package
fr: :mod:`distutils.command.install` — Installe un paquet

source: :mod:`distutils.command.install_data` --- Install data files from a package
fr: :mod:`distutils.command.install_data` --- Installe les fichiers de données d'un paquet

source: :mod:`distutils.command.install_headers` --- Install C/C++ header files from a package
fr: :mod:`distutils.command.install_headers` --- Installe les fichiers d'en-tête C/C++ d'un paquet

source: :mod:`distutils.command.install_lib` --- Install library files from a package
fr: :mod:`distutils.command.install_lib` --- Installe les fichiers de bibliothèque à partir d'un paquet

source: :mod:`distutils.command.install_scripts` --- Install script files from a package
fr: :mod:`distutils.command.install_scripts` --- Installe les fichiers de script d'un paquet

source: :mod:`distutils.command.register` --- Register a module with the Python Package Index
fr: :mod:`distutils.command.register` --- Enregistre un module dans l'Index des paquets Python (*Python Package Index* ou *PyPI* en anglais)

source: The ``register`` command registers the package with the Python Package Index. This is described in more detail in :pep:`301`.
fr: La commande ``register`` enregistre le paquet dans l'index des paquets Python. Plus de détails à ce sujet dans la :pep:`301`.

source: :mod:`distutils.command.check` --- Check the meta-data of a package
fr: :mod:`distutils.command.check` --- Vérifie les méta-données d'un paquet

source: The ``check`` command performs some tests on the meta-data of a package. For example, it verifies that all required meta-data are provided as the arguments passed to the :func:`setup` function.
fr: La commande ``check`` effectue des tests sur les méta-données d'un paquet. Par exemple, elle vérifie que toutes les méta-données requises sont fournies lorsque les arguments sont passés à la fonction :func:`setup`.
