Repository: python/python-docs-fr
Catalog: distutils/commandref.po
Languages: fr

source: Command Reference
fr: Référence des commandes

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
fr: Cette page est conservée uniquement jusqu'à ce que la documentation ``setuptool`` sur https://setuptools.readthedocs.io/en/latest/setuptools.html couvre de manière indépendante toutes les informations pertinentes actuellement incluses ici.

source: Installing modules: the :command:`install` command family
fr: Installer des modules: la famille de commande :command:`install`

source: The install command ensures that the build commands have been run and then runs the subcommands :command:`install_lib`, :command:`install_data` and :command:`install_scripts`.
fr: La commande d'installation s’assure que la commande de construction a bien été lancé puis lance les sous-commandes :command:`install_lib`, :command:`install_data` et :command:`install_scripts`.

source: This command installs all data files provided with the distribution.
fr: Cette commande installe tous les fichiers fournis avec la distribution.

source: This command installs all (Python) scripts in the distribution.
fr: Cette commande installe tout les scripts (Python) dans la distribution.

source: Creating a source distribution: the :command:`sdist` command
fr: Créer une distribution source: la commande :command:`sdist`

source: The manifest template commands are:
fr: Les commandes du modèle manifeste sont :

source: Command
fr: Commande

source: include all files matching any of the listed patterns
fr: Inclut tous les fichiers ressemblant aux modèles listés

source: exclude all files matching any of the listed patterns
fr: exclut tous les fichiers ressemblant aux modèles listés

source: include all files under *dir* matching any of the listed patterns
fr: inclut récursivement tous les fichiers sous *dir* ressemblant aux modèles listés

source: exclude all files under *dir* matching any of the listed patterns
fr: exclut tous les fichiers sous *dir* ressemblant aux modèles listés

source: include all files anywhere in the source tree matching --- & any of the listed patterns
fr: Inclut tous les fichiers dans l'arborescence ressemblant aux modèles listés

source: exclude all files anywhere in the source tree matching --- & any of the listed patterns
fr: exclut tous les fichiers dans l'arborescence ressemblant aux modèles listés

source: exclude all files under *dir*
fr: exclut tous les fichiers dans *dir*

source: include all files under *dir*
fr: inclut tous les fichiers dans *dir*

source: The patterns here are Unix-style "glob" patterns: ``*`` matches any sequence of regular filename characters, ``?`` matches any single regular filename character, and ``[range]`` matches any of the characters in *range* (e.g., ``a-z``, ``a-zA-Z``, ``a-f0-9_.``). The definition of "regular filename character" is platform-specific: on Unix it is anything except slash; on Windows anything except backslash or colon.
fr: Les modèles sont de style Unix *glob* : ``*`` correspond à n'importe quelle chaîne de caractères d'un nom de fichier valide, ``?`` correspond à un seul caractère d'un nom de fichier valide et ``[range]`` correspond à n'importe quel caractère dans la *range* (e.g., ``a-z``, ``a-zA-Z``, ``a-f0-9_.``). La définition de "caractère de nom de fichier valide" est spécifique à chaque plateforme: sur Unix il s'agir de n'importe quel caractère à part le slash; sur Windows il s'agir de n'importe quel caractère a part l'anti-slash et les deux points.
