Repository: python/python-docs-fr
Catalog: distutils/configfile.po
Languages: fr

source: Writing the Setup Configuration File
fr: Écrire le fichier de configuration

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
fr: Ce document doit rester présent jusqu’à ce que la documentation ``setuptools`` à l'adresse https://setuptools.readthedocs.io/en/latest/setuptools.html contienne l'intégralité des informations importante inclus dans ce fichier.

source: Often, it's not possible to write down everything needed to build a distribution *a priori*: you may need to get some information from the user, or from the user's system, in order to proceed. As long as that information is fairly simple---a list of directories to search for C header files or libraries, for example---then providing a configuration file, :file:`setup.cfg`, for users to edit is a cheap and easy way to solicit it. Configuration files also let you provide default values for any command option, which the installer can then override either on the command-line or by editing the config file.
fr: Souvent, il n'es pas possible d’écrire tout ce qu'il es t demandé pour construire la distribution *a priori*: vous devez demander plus d'information à l'utilisateur, ou l'utilisateur système, et dans cette ordre la. Tant que cette information est simple—la liste des répertoires pour rechercher le fichier d'entête C ou les librairie, par exemple—créer un fichier de configuration, :file.

source: The setup configuration file is a useful middle-ground between the setup script---which, ideally, would be opaque to installers [#]_---and the command-line to the setup script, which is outside of your control and entirely up to the installer. In fact, :file:`setup.cfg` (and any other Distutils configuration files present on the target system) are processed after the contents of the setup script, but before the command-line. This has several useful consequences:
fr: Le fichier de configuration est utile intermédiaire entre le script d'installation --- dans lequel, idéalement, pourrait être opaque aux installateurs[#]_--- et la ligne de commande du script d'installation, dans lequel il est en dehors de votre contrôle mais entièrement aux installateurs. En fait, :file:`setup.cfg` (et les autres fichiers de configuration de Distutils présent sur le système cible) sont traitées après le contenus de setup.cfg, mais parés la ligne de commande. Cela à plusieurs conséquence utile:

source: installers can override some of what you put in :file:`setup.py` by editing :file:`setup.cfg`
fr: les installeurs vont contourner ce qui est contenus dans le :file:`setup.py` par édition du :file:`setup.cfg`

source: you can provide non-standard defaults for options that are not easily set in :file:`setup.py`
fr: vous pouvez fournir des options atypique qui ne sont pas facilement paramétrables dans :file:`setup.py`

source: installers can override anything in :file:`setup.cfg` using the command-line options to :file:`setup.py`
fr: installeur peut réécrire tout dans :file:`setup.cfg` en utilisant l'option sur la ligne de commande de :file:`setup.py`

source: The basic syntax of the configuration file is simple:
fr: La syntaxe de base de ce fichier de configuration est simple:

source: where *command* is one of the Distutils commands (e.g. :command:`build_py`, :command:`install`), and *option* is one of the options that command supports. Any number of options can be supplied for each command, and any number of command sections can be included in the file. Blank lines are ignored, as are comments, which run from a ``'#'`` character until the end of the line. Long option values can be split across multiple lines simply by indenting the continuation lines.
fr: quand *command* est une commande de Distutils (ex.: :command:`build_py`, :command:`install`), et *option* est une option supportée par la commande. Il y a de nombreuses options supplémentaires pour chaque commande, et de nombreuses commandes peuvent être inclus dans le fichier. Les lignes blanches sont ignorées, tout comme les commentaires, qui commence après le caractère `#` et ce jusqu’à la fin de la ligne. Les longues options peuvent être découpées sur plusieurs lignes avec une indentation à chaque lignes supplémentaires.

source: You can find out the list of options supported by a particular command with the universal :option:`!--help` option, e.g.
fr: Vous pouvez trouver la liste des options supportées par une commande particulière avec l' :option: universel `!--help`, par ex.

source: Note that an option spelled :option:`!--foo-bar` on the command-line is spelled ``foo_bar`` in configuration files.
fr: Notez que l'option appelée :option:`!--foo-bar` sur le ligne de commande s’appelle ``foo_bar`` dans le fichier de configuration.

source: For example, say you want your extensions to be built "in-place"---that is, you have an extension :mod:`pkg.ext`, and you want the compiled extension file (:file:`ext.so` on Unix, say) to be put in the same source directory as your pure Python modules :mod:`pkg.mod1` and :mod:`pkg.mod2`. You can always use the :option:`!--inplace` option on the command-line to ensure this:
fr: Par exemple, dire que votre extension soit compilé à la place--- C'est a dire que votre extension :mod`pkg.ext`, et que vous voulez que le fichier d'extension compilé (:file:`ext.so`) sur Unix) soit installé dans le même dossier que les extensions de votre installation python :mod:`pkg.mod1` et :mod:`pkg.mod2`. Vous pouvez utiliser l'option `!--inplace` sur la ligne de commande pour vous en assurer:

source: But this requires that you always specify the :command:`build_ext` command explicitly, and remember to provide :option:`!--inplace`. An easier way is to "set and forget" this option, by encoding it in :file:`setup.cfg`, the configuration file for this distribution:
fr: Mais cela nécessite que vous spécifiez toujours la commande explicite :command:`build_ext` , et n'oubliez pas de fournir :option:`!--inplace`. Une façon de régler l'option définitivement c'est de l'écrire dans :file:`setup.cfg`, le fichier de configuration de cette version:

source: This will affect all builds of this module distribution, whether or not you explicitly specify :command:`build_ext`. If you include :file:`setup.cfg` in your source distribution, it will also affect end-user builds---which is probably a bad idea for this option, since always building extensions in-place would break installation of the module distribution. In certain peculiar cases, though, modules are built right in their installation directory, so this is conceivably a useful ability. (Distributing extensions that expect to be built in their installation directory is almost always a bad idea, though.)
fr: Cela affecteras toutes les versions de cette distribution de modules, si vous explicitez ou non :command:`buils_ext`. Si vous incluez :file:`setup.cfg` dans votre distribution de source, cela affectera aussi les compilation des utilisateurs finaux--- il est probable que c'est une mauvaise idée pour cette option, puisque cela cassera systématiquement l'installation des modules pour la distribution. Dans certain cas particulier,néanmoins, les modules compilés directement dans leurs répertoires d'installation, c'est probablement une option utile. (Distribuer les extensions qui s'attendent à être construites dans leur répertoire d'installation est presque toujours une mauvaise idée, mais...)

source: Another example: certain commands take a lot of options that don't change from run to run; for example, :command:`bdist_rpm` needs to know everything required to generate a "spec" file for creating an RPM distribution. Some of this information comes from the setup script, and some is automatically generated by the Distutils (such as the list of files installed). But some of it has to be supplied as options to :command:`bdist_rpm`, which would be very tedious to do on the command-line for every run. Hence, here is a snippet from the Distutils' own :file:`setup.cfg`:
fr: Un autre exemple: certaines commandes prennent plusieurs options qui ne changent pas à chaque exécutions. par exemples, :commande:`bdist_rpm` nécessite de connaître tous ce qui est nécessaire pour générer le fichier de "spec" pour la création sur les distribution RPM. Certaines de ses informations vienne du script setup, et d'autres sont automatiquement généré par Distutils ( tel que le liste des fichiers installé). Mais certaines d'entre elles doivent être fournis en options à la :command:`bdist_rpm`, ce qui serait très fastidieux à faire sur la ligne de commande pour chaque exécution. Voici donc un extrait du :file :`setup.cfg` de Distutils

source: Note that the ``doc_files`` option is simply a whitespace-separated string split across multiple lines for readability.
fr: Notez que l'option ``doc_files`` est simplement une chaîne de caractères séparés par des espaces, divisée sur plusieurs lignes pour une meilleure lisibilité.

source: :ref:`inst-config-syntax` in "Installing Python Modules"
fr: :ref:`inst-config-syntax` dans "le dossier d'installation des modules Python"

source: More information on the configuration files is available in the manual for system administrators.
fr: Plus d'information sur le fichier de configuration est disponible dans le manuel pour les administrateurs systèmes.

source: Footnotes
fr: Notes

source: This ideal probably won't be achieved until auto-configuration is fully supported by the Distutils.
fr: Cet idéal ne sera vraisemblablement être atteint tant que l'auto-configuration ne sera pas pleinement supporté par Distutils.
