Repository: python/python-docs-fr
Catalog: distutils/introduction.po
Languages: fr

source: An Introduction to Distutils
fr: Introduction à Distutils

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
fr: Cette page est conservée uniquement jusqu'à ce que la documentation ``setuptool`` sur https://setuptools.readthedocs.io/en/latest/setuptools.html couvre de manière indépendante toutes les informations pertinentes actuellement incluses ici.

source: This document covers using the Distutils to distribute your Python modules, concentrating on the role of developer/distributor: if you're looking for information on installing Python modules, you should refer to the :ref:`install-index` chapter.
fr: Ce document traite de l'utilisation de Distutils pour distribuer des modules Python, en se concentrant sur le rôle de développeur/distributeur : si vous cherchez des informations sur l'installation de modules Python, vous devriez vous référer au chapitre :ref:`install-index`.

source: Concepts & Terminology
fr: Concepts et Terminologie

source: Using the Distutils is quite simple, both for module developers and for users/administrators installing third-party modules. As a developer, your responsibilities (apart from writing solid, well-documented and well-tested code, of course!) are:
fr: Utiliser Distuils est assez simple, à la fois pour les développeurs de module et pour les utilisateurs/administrateurs qui installent des modules tiers. En tant que développeur, vous responsabilités (en dehors d'écrire du code solide, bien documenté et bien testé bien entendu !) sont :

source: write a setup script (:file:`setup.py` by convention)
fr: écrire un script d'installation (:file:`setup.py` par convention)

source: (optional) write a setup configuration file
fr: (optionnel) écrire un fichier de configuration pour l'installation

source: create a source distribution
fr: créer une distribution source

source: (optional) create one or more built (binary) distributions
fr: (optionnel) créer une ou plusieurs distributions compilées (binaires)

source: Each of these tasks is covered in this document.
fr: Chacune de ces tâches est couverte dans ce document.

source: Not all module developers have access to a multitude of platforms, so it's not always feasible to expect them to create a multitude of built distributions. It is hoped that a class of intermediaries, called *packagers*, will arise to address this need. Packagers will take source distributions released by module developers, build them on one or more platforms, and release the resulting built distributions. Thus, users on the most popular platforms will be able to install most popular Python module distributions in the most natural way for their platform, without having to run a single setup script or compile a line of code.
fr: Tous développeurs de modules n'ont pas accès à une multitude de plateformes, donc ce n'est pas toujours possible de s'attendre à ce qu'ils créent une multitude de distributions compilées. On espère que certains intermédiaires, appelés *packagers*, vont prendre en charge ce besoin. Les packagers vont prendre les sources des distributions publiées par les développeurs de modules, les construire sur on ou plusieurs plateformes, et publier les distributions compilées résultantes. Ainsi, les utilisateurs sur les plateformes les plus populaires vont pouvoir installer la plupart des modules Python de la façon la plus naturelle qu'il soit pour leur plateforme, sans avoir à exécuter de script ou à compiler du code.

source: A Simple Example
fr: Un exemple simple

source: The setup script is usually quite simple, although since it's written in Python, there are no arbitrary limits to what you can do with it, though you should be careful about putting arbitrarily expensive operations in your setup script. Unlike, say, Autoconf-style configure scripts, the setup script may be run multiple times in the course of building and installing your module distribution.
fr: Le script d'installation est habituellement assez simple, bien que dès lors qu'il est écrit en Python, il n'y a aucune limite arbitraire à ce que vous pouvez faire avec, bien que vous devriez faire attention au sujet d'opération coûteuse dans les scripts d'installation. Contrairement à disons aux scripts Autoconf-style, le script de setup pourrait être exécuté plusieurs fois au cours de la compilation et de l'installation de votre module.

source: If all you want to do is distribute a module called :mod:`foo`, contained in a file :file:`foo.py`, then your setup script can be as simple as this::
fr: Si tout ce que vous voulez est de distribuer un module appelé :mod:`foo`, contenu dans un fichier :file:`foo.py`, alors votre script d'installation peut être aussi simple que ::

source: Some observations:
fr: Des observations:

source: most information that you supply to the Distutils is supplied as keyword arguments to the :func:`setup` function
fr: la plupart des informations que vous fournissez à Distutils sont fournies en tant que qu'arguments nommés à la fonction :func:`setup`

source: those keyword arguments fall into two categories: package metadata (name, version number) and information about what's in the package (a list of pure Python modules, in this case)
fr: ces arguments nommés tombent dans deux catégories: métadonnées du paquet (nom, numéro de version) et en informations à propos de ce qui est dans le paquet (une liste de pure modules Python, dans ce cas)

source: modules are specified by module name, not filename (the same will hold true for packages and extensions)
fr: les modules sont spécifiés par nom de module, plutôt que par nom de fichier (le cas est similaire pour les paquets et extensions)

source: it's recommended that you supply a little more metadata, in particular your name, email address and a URL for the project (see section :ref:`setup-script` for an example)
fr: il est recommandé que vous fournissiez un minimum de métadonnées, en particulier votre nom, une adresse e-mail et une URL pour le projet (voir section :ref:`setup-script` pour un exemple)

source: To create a source distribution for this module, you would create a setup script, :file:`setup.py`, containing the above code, and run this command from a terminal::
fr: Pour créer une distribution source pour ce module, vous pourriez créer un script d'installation, :file:`setup.py`, contenant le code ci-dessus, et exécuter cette commande depuis un terminal ::

source: For Windows, open a command prompt window (:menuselection:`Start --> Accessories`) and change the command to::
fr: Pour Windows, ouvrez une fenêtre de prompt de commande (:menuselection:`Start --> Accessories`) et changez la commande pour ::

source: :command:`sdist` will create an archive file (e.g., tarball on Unix, ZIP file on Windows) containing your setup script :file:`setup.py`, and your module :file:`foo.py`. The archive file will be named :file:`foo-1.0.tar.gz` (or :file:`.zip`), and will unpack into a directory :file:`foo-1.0`.
fr: :command:`sdist` va créer un fichier d'archive (c.f., une tarball sur Unix, un fichier ZIP sous Windows) contenant votre script d'installation :file:`setup.py`, et votre module :file:`foo.py`. Le fichier d'archive va être nommé :file:`foo-1.0.tar.gz` (ou :file:`.zip`), et va se décompresser dans un répertoire :file:`foo-1.0`.

source: If an end-user wishes to install your :mod:`foo` module, all they have to do is download :file:`foo-1.0.tar.gz` (or :file:`.zip`), unpack it, and---from the :file:`foo-1.0` directory---run ::
fr: Si un utilisateur final souhaite installer votre module :mod:`foo`, tout ce qu'il aura à faire est de télécharger le fichier :file:`foo-1.0.tar.gz` (ou :file:`.zip`), le décompresser et ---depuis le répertoire :file:`foo-1.0`--- exécuter ::

source: which will ultimately copy :file:`foo.py` to the appropriate directory for third-party modules in their Python installation.
fr: ce qui va finalement copier :file:`foo.py` dans le répertoire approprié pour un module tierce dans son installation Python.

source: This simple example demonstrates some fundamental concepts of the Distutils. First, both developers and installers have the same basic user interface, i.e. the setup script. The difference is which Distutils *commands* they use: the :command:`sdist` command is almost exclusively for module developers, while :command:`install` is more often for installers (although most developers will want to install their own code occasionally).
fr: Ce simple exemple démontre des concepts fondamentaux de Distutils, Premièrement, les développeurs et installeurs ont la même interface utilisateur basique, c.f. le script d'installation. La différence est quelle *commande* Distutils ils utilisent: la commande :command:`sdist` est quasiment exclusivement pour les développeurs de modules Python, tandis que :command:`install` est plus souvent pour les installeurs (bien que la plupart des développeurs vont vouloir installer leur code occasionnellement).

source: If you want to make things really easy for your users, you can create one or more built distributions for them. For instance, if you are running on a Windows machine, and want to make things easy for other Windows users, you can create an executable installer (the most appropriate type of built distribution for this platform) with the :command:`bdist_wininst` command. For example::
fr: Si vous voulez rendre les choses vraiment faciles pour vos utilisateurs, vous pouvez créer on ou plusieurs distributions compilées pour eux. En l’occurrence, si vous tournez sous une machine Windows, et que vous voulez rendre les choses faciles pour les autres utilisateurs Windows, vous pouvez créer un installateur exécutable (le mode de distribution le plus approprié pour cette plateforme) avec la commande :command:`bdist_wininst`. Par exemple ::

source: will create an executable installer, :file:`foo-1.0.win32.exe`, in the current directory.
fr: va créer une installeur exécutable, :file:`foo-1.0.win32.exe`, dans le répertoire courant.

source: Other useful built distribution formats are RPM, implemented by the :command:`bdist_rpm` command, Solaris :program:`pkgtool` (:command:`bdist_pkgtool`), and HP-UX :program:`swinstall` (:command:`bdist_sdux`). For example, the following command will create an RPM file called :file:`foo-1.0.noarch.rpm`::
fr: D'autres formats de distributions compilés utiles sont RPM, implémenté par la commande :command:`bdist_rpm`, Solaris :program:`pkgtool` (:command:`bdist_pkgtool`), et HP-UX :program:`swinstall` (;command:`bdist_sdux`). Par exemple, la commande suivante va créer un fichier RPM appelé :file:`foo-1.0.noarch.rpm`::

source: (The :command:`bdist_rpm` command uses the :command:`rpm` executable, therefore this has to be run on an RPM-based system such as Red Hat Linux, SuSE Linux, or Mandrake Linux.)
fr: (La commande :command:`bdist_rpm` utilise l'exécutable :command:`rpm`, cependant cela doit être exécuté sur un système basé sur RPM tel que Red Hat Linux, SuSE Linux, or Mandrake Linux.)

source: You can find out what distribution formats are available at any time by running ::
fr: Vous pouvez trouver quelles sont les formats de distribution disponibles à n'importe quel moment en exécutant ::

source: General Python terminology
fr: Terminologie Python générale

source: If you're reading this document, you probably have a good idea of what modules, extensions, and so forth are. Nevertheless, just to be sure that everyone is operating from a common starting point, we offer the following glossary of common Python terms:
fr: Si vous lisez ce document, vous avez probablement une bonne idée de ce que sont les modules, extensions, etc... . Néanmoins, juste pour être sur que tout le monde opère depuis un point d'entrée commun, nous reprécisons le glossaire suivant des termes Python communs :

source: the basic unit of code reusability in Python: a block of code imported by some other code. Three types of modules concern us here: pure Python modules, extension modules, and packages.
fr: l'unité de base de la réutilisabilité en Python: un bloc de code importé par un autre code. Trois types de modules nous concernent ici: les pures modules Python, les modules d'extension, et les packages.

source: pure Python module
fr: module Python pure

source: a module written in Python and contained in a single :file:`.py` file (and possibly associated :file:`.pyc` files). Sometimes referred to as a "pure module."
fr: un module écrit en Python et contenu dans un seul fichier :file:`.py` (et possiblement un fichier :file:`.pyc` associé). Parfois appelé "pure module."

source: extension module
fr: module d'extension

source: a module written in the low-level language of the Python implementation: C/C++ for Python, Java for Jython. Typically contained in a single dynamically loadable pre-compiled file, e.g. a shared object (:file:`.so`) file for Python extensions on Unix, a DLL (given the :file:`.pyd` extension) for Python extensions on Windows, or a Java class file for Jython extensions. (Note that currently, the Distutils only handles C/C++ extensions for Python.)
fr: un module écrit dans un language de bas niveau de l'implémentation Python: C/C++ pour Python, Java pour Jython. Typiquement contenu dans un unique fichier pré-compilé chargeable, c.f; un fichier objet partagé (:file:`.so`) pour des extensions Python sous Unix, un fichier DLL (étant donné l'extension :file:`.pyd`) pour les extensions Python sous Windows, ou un fichier de classe Java pour les extensions Jython. (Notez qu'actuellement, le Distutils gère seulement les extensions Python C/C++.)

source: package
fr: paquet

source: a module that contains other modules; typically contained in a directory in the filesystem and distinguished from other directories by the presence of a file :file:`__init__.py`.
fr: un module qui contient d'autres modules; typiquement contenu dans un répertoire du système de fichier et qui se distingue des autres répertoires par la présence d'un fichier :file:`__init__.py`.

source: root package
fr: paquet racine

source: the root of the hierarchy of packages. (This isn't really a package, since it doesn't have an :file:`__init__.py` file. But we have to call it something.) The vast majority of the standard library is in the root package, as are many small, standalone third-party modules that don't belong to a larger module collection. Unlike regular packages, modules in the root package can be found in many directories: in fact, every directory listed in ``sys.path`` contributes modules to the root package.
fr: la racine de la hiérarchie de paquets. (Ce n'est pas vraiment un paquet, dès lors qu'il n'a pas un fichier :file:`__init__.py`. Mais nous devons bien le nommer.) La plus grande majorité de la librairie standard est dans le package racine, comme le sont certains petits, des packages tiers autonomes qui n'appartiennent pas à une un module plus grand. Contrairement aux packages réguliers, les modules dans le package racine peuvent être trouvés dans plusieurs répertoires: en effet, tous les répertoires listés ``sys.path`` contribuent à faire partie du package racine.

source: Distutils-specific terminology
fr: Terminologie spécifique à Distutils

source: The following terms apply more specifically to the domain of distributing Python modules using the Distutils:
fr: Les termes suivant s'appliquent plus spécifiquement au domaine de la distribution de modules Python en utilisant les Distutils :

source: module distribution
fr: module de distribution

source: a collection of Python modules distributed together as a single downloadable resource and meant to be installed *en masse*. Examples of some well-known module distributions are NumPy, SciPy, Pillow, or mxBase. (This would be called a *package*, except that term is already taken in the Python context: a single module distribution may contain zero, one, or many Python packages.)
fr: une collection de modules Python distribués ensemble en tant qu'unique ressource téléchargeable et ayant pour but d'être installé *en masse*. Des exemples de modules distribués bien connus sont NumPy, SciPy, Pillow, ou mxBase. (On pourrait les appeler des *packages*, malgré que le terme soit déjà pris dans le contexte Python: une distribution de module simple pourrait contenir zéro, on ou plusieurs packages Python

source: pure module distribution
fr: distribution de module pure

source: a module distribution that contains only pure Python modules and packages. Sometimes referred to as a "pure distribution."
fr: une distribution de module qui contient seulement des modules purs et packages Python. Parfois référencé en tant que "pure distribution."

source: non-pure module distribution
fr: distribution de module non pur

source: a module distribution that contains at least one extension module. Sometimes referred to as a "non-pure distribution."
fr: une distribution de module qui contient au moins un module d'extension. Parfois référencé en tant que "distribution non pure."

source: distribution root
fr: distribution racine

source: the top-level directory of your source tree (or source distribution); the directory where :file:`setup.py` exists. Generally :file:`setup.py` will be run from this directory.
fr: le répertoire de plus haut niveau de votre arborescence (ou distribution source); le répertoire ou :file:`setup.py` existe. Généralement :file:`setup.py` va être exécuté depuis ce répertoire.
