Repository: python/python-docs-fr
Catalog: distutils/setupscript.po
Languages: fr

source: Writing the Setup Script
fr: Rédiger le script ``setup.py``

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
fr: Ce document est conservé uniquement jusqu'à ce que la documentation de ``setuptools`` présente à l'adresse https://setuptools.readthedocs.io/en/latest/setuptools.html couvre indépendamment toutes les informations pertinentes actuellement incluses ici.

source: The setup script is the centre of all activity in building, distributing, and installing modules using the Distutils. The main purpose of the setup script is to describe your module distribution to the Distutils, so that the various commands that operate on your modules do the right thing. As we saw in section :ref:`distutils-simple-example` above, the setup script consists mainly of a call to :func:`setup`, and most information supplied to the Distutils by the module developer is supplied as keyword arguments to :func:`setup`.
fr: Le script ``setup.py`` est au centre de toute opération de construction, de distribution et d'installation des modules utilisant les *Distutils*. L'objectif principal du script ``setup.py`` est de décrire le module aux *Distutils*, de telle sorte que les diverses commandes qui agissent sur votre module fassent les bonnes choses. Comme nous avons vu dans la section :ref:`distutils-simple-example` au-dessus, le script ``setup.py`` consiste principalement à un appel à :func:`setup`, et la plupart des informations fournies aux *Distutils* par le développeur du module sont fournies en tant qu'arguments nommés à :func:`setup.py`.

source: Here's a slightly more involved example, which we'll follow for the next couple of sections: the Distutils' own setup script. (Keep in mind that although the Distutils are included with Python 1.6 and later, they also have an independent existence so that Python 1.5.2 users can use them to install other module distributions. The Distutils' own setup script, shown here, is used to install the package into Python 1.5.2.) ::
fr: Voici un exemple un peu plus concret, que nous allons suivre pour les quelques sections suivantes : le propre script ``setup.py`` des *Distutils*. (Gardez toujours à l'esprit qu'en dépit de l'inclusion des *Distutils* dans python 1.6 et ses versions successives, ils ont aussi une existence à part entière de telle sorte que les utilisateurs de Python 1.5.2 puissent les utiliser pour installer d'autres modules. Le propre script ``setup.py`` des *Distutils* montré ici est utilisé pour installer le paquet dans Python 1.5.2.) ::

source: There are only two differences between this and the trivial one-file distribution presented in section :ref:`distutils-simple-example`: more metadata, and the specification of pure Python modules by package, rather than by module. This is important since the Distutils consist of a couple of dozen modules split into (so far) two packages; an explicit list of every module would be tedious to generate and difficult to maintain. For more information on the additional meta-data, see section :ref:`meta-data`.
fr: Il y a seulement 2 différences entre cet exemple et l'exemple trivial de la distribution d'un unique fichier présenté dans la partie :ref:`distutils-simple-example` : plus de métadonnées, et la définition de modules purement Python par paquet, plutôt que par module. C'est important car les *Distutils* sont composés de quelques douzaines de modules séparés (pour le moment) en deux paquets ; une liste explicite de chaque module serait pénible à générer et difficile à maintenir. Pour plus d'information sur les métadonnées supplémentaires, voir la partie :ref:`meta-data`.

source: Note that any pathnames (files or directories) supplied in the setup script should be written using the Unix convention, i.e. slash-separated. The Distutils will take care of converting this platform-neutral representation into whatever is appropriate on your current platform before actually using the pathname. This makes your setup script portable across operating systems, which of course is one of the major goals of the Distutils. In this spirit, all pathnames in this document are slash-separated.
fr: À noter que chaque chemin d'accès fourni au script ``setup.py`` doit être écrit selon la convention Unix. Autrement dit, séparé par des barres obliques (slash). Les *Distutils* prendront soin de convertir cette représentation indépendante d'une plateforme en une représentation adaptée à votre plateforme actuelle avant d'effectivement utiliser le chemin d'accès. Cela rend votre script ``setup.py`` portable d'un système d'exploitation à l'autre, ce qui évidemment est l'un des buts majeurs des *Distutils*. Dans cet esprit, tous les chemins d'accès dans ce document sont séparés par des barres obliques (slash).

source: This, of course, only applies to pathnames given to Distutils functions. If you, for example, use standard Python functions such as :func:`glob.glob` or :func:`os.listdir` to specify files, you should be careful to write portable code instead of hardcoding path separators::
fr: Cela, évidemment, s'applique uniquement aux chemins d'accès passés aux fonctions de *Distutils*. Si vous, par exemple, vous utilisez les fonctions standard de Python telles que :func:`glob.glob` or :func:`os.listdir` pour définir des fichiers, vous devez prendre soin d'écrire du code portable au lieu de coder en dur les séparateurs de chemin ::

source: Listing whole packages
fr: Lister l'ensemble des paquets

source: The ``packages`` option tells the Distutils to process (build, distribute, install, etc.) all pure Python modules found in each package mentioned in the ``packages`` list. In order to do this, of course, there has to be a correspondence between package names and directories in the filesystem. The default correspondence is the most obvious one, i.e. package :mod:`distutils` is found in the directory :file:`distutils` relative to the distribution root. Thus, when you say ``packages = ['foo']`` in your setup script, you are promising that the Distutils will find a file :file:`foo/__init__.py` (which might be spelled differently on your system, but you get the idea) relative to the directory where your setup script lives. If you break this promise, the Distutils will issue a warning but still process the broken package anyway.
fr: L'option ``packages`` dit aux *Distutils* de traiter (construire, distribuer, installer, etc.) tous les modules en Python pur trouvés dans chaque paquet mentionné dans la liste ``packages``. A cette fin, évidemment, il faut une correspondance entre les noms des paquets et des répertoires dans le système de fichiers. La correspondance par défaut est la plus évidente. À savoir : le paquet :mod:`distutils` se trouve dans le répertoire :file:`distutils` situé à la racine de la distribution. Ainsi, quand vous écrivez ``packages = ['foo']`` dans votre script ``setup.py``, vous vous engagez à ce que les *Distutils* trouvent un fichier ``foo/__init__.py`` (qui peut s'épeler différemment sur votre système, mais vous voyez l'idée) à un emplacement relatif au répertoire où se trouve le script ``setup.py``. Si ce n'est pas le cas, les *Distutils* lèvent un avertissement mais traitent tout de même le paquet défectueux.

source: If you use a different convention to lay out your source directory, that's no problem: you just have to supply the ``package_dir`` option to tell the Distutils about your convention. For example, say you keep all Python source under :file:`lib`, so that modules in the "root package" (i.e., not in any package at all) are in :file:`lib`, modules in the :mod:`foo` package are in :file:`lib/foo`, and so forth. Then you would put ::
fr: Si vous utilisez une convention différente pour arranger votre répertoire de sources, ce n'est pas un problème : vous avez seulement à fournir l'option ``package_dir`` pour prévenir les *Distutils* de l'usage de cette convention. Par exemple, supposons que vous gardez toutes les sources Python sous :file:`lib`, de telle sorte que les modules dans le « paquet racine » (c'est-à-dire dans aucun paquet du tout) sont dans :file:`lib`, les modules dans le paquet :mod:`foo` sont dans :file:`lib/foo`, et ainsi de suite. Ensuite vous pouvez mettre ::

source: in your setup script. The keys to this dictionary are package names, and an empty package name stands for the root package. The values are directory names relative to your distribution root. In this case, when you say ``packages = ['foo']``, you are promising that the file :file:`lib/foo/__init__.py` exists.
fr: dans votre script ``setup.py``. Les clés de ce dictionnaire sont les noms des paquets, et un nom de paquet vide fait office de paquet racine. Les valeurs sont des noms de répertoires relatifs à la racine de votre distribution. Dans ce cas, lorsque vous dites ``packages = ['foo']``, vous vous engagez à ce que le fichier :file:`lib/foo/__init__.py` existe.

source: Another possible convention is to put the :mod:`foo` package right in :file:`lib`, the :mod:`foo.bar` package in :file:`lib/bar`, etc. This would be written in the setup script as ::
fr: Une autre convention possible est de mettre le paquet :mod:`foo` directement dans :file:`lib`, le paquet :mod:`foo.bar` dans :file:`lib/bar`, etc. Cela s'écrirait ainsi dans le script ``setup.py`` : ::

source: Listing individual modules
fr: Lister des modules individuels

source: For a small module distribution, you might prefer to list all modules rather than listing packages---especially the case of a single module that goes in the "root package" (i.e., no package at all). This simplest case was shown in section :ref:`distutils-simple-example`; here is a slightly more involved example::
fr: Pour un petit module, vous pouvez préférer lister tous les modules plutôt que les paquets — surtout le cas d'un module seul qui va dans le « paquet racine » (à savoir, aucun paquet du tout). Le cas le plus simple a été montré dans la partie :ref:`distutils-simple-example` ; voici un exemple plus concret ::

source: This describes two modules, one of them in the "root" package, the other in the :mod:`pkg` package. Again, the default package/directory layout implies that these two modules can be found in :file:`mod1.py` and :file:`pkg/mod2.py`, and that :file:`pkg/__init__.py` exists as well. And again, you can override the package/directory correspondence using the ``package_dir`` option.
fr: Deux modules sont décrits, l'un dans le paquet « racine », l'autre dans le paquet :mod:`pkg`. Encore une fois, la structure paquet/répertoire par défaut implique que ces deux modules peuvent être trouvés dans :file:`mod1.py` et :file:`pkg/mod2.py`, et que :file:`pkg/__init__.py` existe aussi. Et encore, vous pouvez redéfinir la correspondance paquet/répertoire en utilisant l'option ``package_dir``.

source: Describing extension modules
fr: Décrire des modules d'extension

source: Just as writing Python extension modules is a bit more complicated than writing pure Python modules, describing them to the Distutils is a bit more complicated. Unlike pure modules, it's not enough just to list modules or packages and expect the Distutils to go out and find the right files; you have to specify the extension name, source file(s), and any compile/link requirements (include directories, libraries to link with, etc.).
fr: Tout comme écrire des modules d'extension Python est un peu plus compliqué que d’écrire des modules purement en Python, les décrire aux *Distutils* est un peu plus compliqué. Contrairement aux modules purs, il ne suffit pas de simplement lister les modules ou les paquets et d'attendre que les *Distutils* trouvent par eux-mêmes les bons fichiers ; vous devez définir le nom de l'extension, du ou des fichiers de sources, et les prérequis de compilation/lien (répertoires à inclure, bibliothèques à lier, etc.).

source: All of this is done through another keyword argument to :func:`setup`, the ``ext_modules`` option. ``ext_modules`` is just a list of :class:`~distutils.core.Extension` instances, each of which describes a single extension module. Suppose your distribution includes a single extension, called :mod:`foo` and implemented by :file:`foo.c`. If no additional instructions to the compiler/linker are needed, describing this extension is quite simple::
fr: Tout ceci est fait à l'aide d'un autre argument nommé dans :func:`setup`, l'option ``ext_modules``. ``ext_modules`` est simplement une liste de classes :class:`~distutils.core.Extension`, chacune décrivant une seule extension de module. Supposons que votre distribution inclut une seule extension appelée :mod:`foo` et implémentée par :file:`foo.c`. Si aucune instruction supplémentaire au compilateur/lieur n'est requise, décrire cette extension est assez simple ::

source: The :class:`Extension` class can be imported from :mod:`distutils.core` along with :func:`setup`. Thus, the setup script for a module distribution that contains only this one extension and nothing else might be::
fr: La classe :class:`Extension` peut être importée depuis :mod:`distutils.core` en même temps que :func:`setup`. Ainsi, le script ``setup.py`` pour un module qui ne contient que cette seule extension et rien d'autre peut être ::

source: The :class:`Extension` class (actually, the underlying extension-building machinery implemented by the :command:`build_ext` command) supports a great deal of flexibility in describing Python extensions, which is explained in the following sections.
fr: La classe :class:`Extension` (en réalité, la machine sous-jacente construisant les extensions implémentées par la commande :command:`build_ext`) permet une grande flexibilité dans la description des extensions Python, ce qui est expliqué dans les parties suivantes.

source: Extension names and packages
fr: Nom des extensions et paquets

source: The first argument to the :class:`~distutils.core.Extension` constructor is always the name of the extension, including any package names. For example, ::
fr: Le premier argument du constructeur :class:`~distutils.core.Extension` est toujours le nom de l'extension, incluant tout nom de paquet. Par exemple ::

source: describes an extension that lives in the root package, while ::
fr: décrit une extension qui se situe dans le paquet racine, tandis que ::

source: describes the same extension in the :mod:`pkg` package. The source files and resulting object code are identical in both cases; the only difference is where in the filesystem (and therefore where in Python's namespace hierarchy) the resulting extension lives.
fr: décrit la même extension dans le paquet :mod:`pkg`. Les fichiers sources et le code objet résultant sont identiques dans les deux cas ; la seule différence est où, dans le système de fichier (et conséquemment dans la hiérarchie de l'espace de nommage de Python), l'extension résultante se situe.

source: If you have a number of extensions all in the same package (or all under the same base package), use the ``ext_package`` keyword argument to :func:`setup`. For example, ::
fr: Si vous avez un certain nombre d'extensions toutes dans le même paquet (ou toutes sous le même paquet de base), utilisez l'argument nommé ``ext_package`` de :func:`setup`. Par exemple ::

source: will compile :file:`foo.c` to the extension :mod:`pkg.foo`, and :file:`bar.c` to :mod:`pkg.subpkg.bar`.
fr: compilera :file:`foo.c` en l’extension :mod:`pkg.foo`, et :file:`bar.c` en :mod:`pkg.subpkg.bar`.

source: Extension source files
fr: Fichiers sources d'extension

source: The second argument to the :class:`~distutils.core.Extension` constructor is a list of source files. Since the Distutils currently only support C, C++, and Objective-C extensions, these are normally C/C++/Objective-C source files. (Be sure to use appropriate extensions to distinguish C++ source files: :file:`.cc` and :file:`.cpp` seem to be recognized by both Unix and Windows compilers.)
fr: Le second argument du constructeur d' :class:`~distutils.core.Extension` est une liste de fichiers sources. Puisque les *Distutils* ne gèrent que les extensions en C, C++ et Objective-C, ce sont normalement des fichiers sources en C/C++/Objective-C. (Assurez vous d'utiliser les extensions appropriées pour détecter les fichiers sources en C++ : :file:`.cc` et :file:`.cpp` semblent être reconnus tant par les compilateurs Unix que Windows.)

source: However, you can also include SWIG interface (:file:`.i`) files in the list; the :command:`build_ext` command knows how to deal with SWIG extensions: it will run SWIG on the interface file and compile the resulting C/C++ file into your extension.
fr: Néanmoins, vous pouvez également inclure des fichiers d'interface SWIG (:file:`.i`) dans la liste ; la commande :command:`build_ext` sait comment gérer les extensions SWIG : il lancera SWIG sur un fichier d'interface et compilera le fichier en C/C++ en une extension.

source: This warning notwithstanding, options to SWIG can be currently passed like this::
fr: Malgré cet avertissement, les options peuvent être actuellement passées à SWIG de la façon suivante ::

source: Or on the commandline like this::
fr: Ou en ligne de commande de cette façon ::

source: On some platforms, you can include non-source files that are processed by the compiler and included in your extension. Currently, this just means Windows message text (:file:`.mc`) files and resource definition (:file:`.rc`) files for Visual C++. These will be compiled to binary resource (:file:`.res`) files and linked into the executable.
fr: Sur certaines plateformes, vous pouvez inclure des fichiers autres que sources qui seront traités par le compilateur et inclus dans votre extension. Pour l'instant, cela concerne seulement les fichiers de messages texte Windows (:file:`.mc`) et les fichiers de définition de ressource pour Visual C++ (:file:`.rc`). Ils seront compilés en fichiers de ressources binaires (:file:`.res`) et liés à l'exécutable.

source: Preprocessor options
fr: Options de préprocesseur

source: You can specify absolute directories there; if you know that your extension will only be built on Unix systems with X11R6 installed to :file:`/usr`, you can get away with ::
fr: Ici, vous pouvez définir le chemin absolu des répertoires ; si vous savez que votre extension sera compilée sur un système Unix avec ``X11R6`` installé dans :file:`/usr`, vous pouvez vous en tirer avec ::

source: You should avoid this sort of non-portable usage if you plan to distribute your code: it's probably better to write C code like ::
fr: Il convient d'éviter ce type d'utilisation non portable si vous envisagez de distribuer votre code : C'est probablement mieux d'écrire du code C comme ::

source: If you need to include header files from some other Python extension, you can take advantage of the fact that header files are installed in a consistent way by the Distutils :command:`install_headers` command. For example, the Numerical Python header files are installed (on a standard Unix installation) to :file:`/usr/local/include/python1.5/Numerical`. (The exact location will differ according to your platform and Python installation.) Since the Python include directory---\ :file:`/usr/local/include/python1.5` in this case---is always included in the search path when building Python extensions, the best approach is to write C code like ::
fr: Si vous avez besoin d'inclure des fichiers d'en-tête provenant d'autres extensions Python, vous pouvez profiter du fait que les fichiers d'en-tête sont installés de façon cohérente par la commande :command:`install_headers` des *Distutils*. Par exemple, les fichiers d'en-têtes de *Numerical Python* (NumPy) sont installés (dans le cas d'une installation Unix standard) dans :file:`/usr/local/include/python1.5/Numerical`. (L'emplacement exact diffère selon votre plateforme et votre installation de Python.) Vu que le répertoire :file:`include` de Python —\ :file:`/usr/local/include/python1.5` dans ce cas-ci — est toujours inclus dans le chemin de recherche quand vous construisez des extensions Python, la meilleure approche est d'écrire du code C comme ::

source: If you must put the :file:`Numerical` include directory right into your header search path, though, you can find that directory using the Distutils :mod:`distutils.sysconfig` module::
fr: Si vous devez mettre le répertoire :file:`include` de :file:`Numerical` directement dans l'en-tête du chemin de recherche, cependant, vous pouvez trouver ce répertoire en utilisant le module :mod:`distutils.sysconfig` des *Distutils* ::

source: Even though this is quite portable---it will work on any Python installation, regardless of platform---it's probably easier to just write your C code in the sensible way.
fr: Même si c'est assez portable — ça marche sur la plupart des installations de Python, indépendamment de la plateforme — il est probablement plus facile de d'écrire un code C un peu plus réfléchi.

source: You can define and undefine pre-processor macros with the ``define_macros`` and ``undef_macros`` options. ``define_macros`` takes a list of ``(name, value)`` tuples, where ``name`` is the name of the macro to define (a string) and ``value`` is its value: either a string or ``None``. (Defining a macro ``FOO`` to ``None`` is the equivalent of a bare ``#define FOO`` in your C source: with most compilers, this sets ``FOO`` to the string ``1``.) ``undef_macros`` is just a list of macros to undefine.
fr: Vous pouvez définir ou ignorer des macros de pré-processeur avec les options ``define_macros`` et ``undef_macros``. ``define_macros`` prend une liste de tuples ``(nom, valeur)``, où ``nom`` est le nom de la macro à définir (une chaîne de caractères) et ``valeur`` est sa valeur : soit une chaîne de caractères, soit ``None`` (définir une macro ``FOO`` à ``None`` est équivalent à un simple ``#define FOO`` dans votre source en C : pour la majorité des compilateurs, cela définit la valeur de ``FOO`` à la chaîne de caractère ``1``). ``undef_macros`` est juste une liste de macros à supprimer.

source: For example::
fr: Par exemple ::

source: is the equivalent of having this at the top of every C source file::
fr: est équivalent à avoir ça en haut de chaque fichier source en C ::

source: Library options
fr: Options des bibliothèques

source: You can also specify the libraries to link against when building your extension, and the directories to search for those libraries. The ``libraries`` option is a list of libraries to link against, ``library_dirs`` is a list of directories to search for libraries at link-time, and ``runtime_library_dirs`` is a list of directories to search for shared (dynamically loaded) libraries at run-time.
fr: Vous pouvez aussi définir les bibliothèques à lier quand vous construisez votre extension, ainsi que le répertoire de recherche pour ces bibliothèques. L'option ``libraries`` est une liste de bibliothèques à lier, ``library_dirs`` est une liste de répertoire de libraires pour la recherche au moment de la liaison, et ``runtime_library_dirs`` est une liste de répertoire pour la recherche des bibliothèques partagées (chargées dynamiquement) à l'exécution.

source: For example, if you need to link against libraries known to be in the standard library search path on target systems ::
fr: Par exemple si vous avez besoin de lier des bibliothèques que l'on sait dans le chemin des bibliothèques standard des systèmes cible ::

source: If you need to link with libraries in a non-standard location, you'll have to include the location in ``library_dirs``::
fr: Si vous avez besoin d'établir un lien avec des bibliothèques à un emplacement non standard, vous devrez inclure l'emplacement dans ``library_dirs`` ::
