Repository: python/python-docs-fr
Catalog: distutils/setupscript.po
Languages: fr

source: (Again, this sort of non-portable construct should be avoided if you intend to distribute your code.)
fr: (Encore, ce genre de construction non portable doit être évité si vous avez l'intention de distribuer votre code.)

source: Other options
fr: Autres options

source: There are still some other options which can be used to handle special cases.
fr: Il y a encore d'autres options qui peuvent être utilisées pour gérer des cas spéciaux.

source: The ``optional`` option is a boolean; if it is true, a build failure in the extension will not abort the build process, but instead simply not install the failing extension.
fr: L'option ``optional`` est un booléen ; s'il est vrai, un échec de la construction dans l'extension n'annulera pas le processus de construction, mais à la place, l'extension en échec ne sera pas installée.

source: The ``extra_objects`` option is a list of object files to be passed to the linker. These files must not have extensions, as the default extension for the compiler is used.
fr: L'option ``extra_objects`` est une liste d'objets fichiers à passer au lieur. Ces fichiers ne doivent pas avoir des extensions car l'extension par défaut du compilateur est utilisée.

source: ``extra_compile_args`` and ``extra_link_args`` can be used to specify additional command line options for the respective compiler and linker command lines.
fr: ``extra_compile_args`` et ``extra_link_args`` peuvent être utilisés pour définir des options additionnelles en ligne de commande propres aux lignes de commandes respectives du compilateur et du lieur.

source: ``export_symbols`` is only useful on Windows. It can contain a list of symbols (functions or variables) to be exported. This option is not needed when building compiled extensions: Distutils will automatically add ``initmodule`` to the list of exported symbols.
fr: ``export_symbols`` est seulement utile sur Windows. Il peut contenir une liste de symboles (fonctions ou variables) à exporter. Cette option n'est pas requise pour la construction d'extensions compilées : *Distutils* ajoutera automatiquement ``initmodule`` à la liste des symboles exportés.

source: The ``depends`` option is a list of files that the extension depends on (for example header files). The build command will call the compiler on the sources to rebuild extension if any on this files has been modified since the previous build.
fr: L'option ``depends`` est une liste de fichiers dont les extensions dépendent (par exemple les fichiers d'en-têtes). La commande ``build`` appellera le compilateur appellera le compilateur sur les sources pour reconstruire l'extension si un quelconque de ces fichiers a été modifié depuis la dernière construction.

source: Relationships between Distributions and Packages
fr: Relations entre Distributions et Paquets

source: A distribution may relate to packages in three specific ways:
fr: Une distribution peut se rapporter à des paquets de 3 manières spécifiques :

source: It can require packages or modules.
fr: Elle peut nécessiter des paquets ou des modules.

source: It can provide packages or modules.
fr: Elle peut fournir des paquets ou des modules.

source: It can obsolete packages or modules.
fr: Elle peut rendre obsolète des paquets ou des modules.

source: These relationships can be specified using keyword arguments to the :func:`distutils.core.setup` function.
fr: Ces relations peuvent être définies en utilisant des paramètres nommés dans la fonction :func:`distutils.core.setup`.

source: Dependencies on other Python modules and packages can be specified by supplying the *requires* keyword argument to :func:`setup`. The value must be a list of strings. Each string specifies a package that is required, and optionally what versions are sufficient.
fr: Les dépendances à d'autres modules et paquets Python peuvent être définies en fournissant le paramètre nommé ``requires`` à :func:`setup`. La valeur doit être une liste de chaînes de caractères. Chaque chaîne de caractères définit un paquet requis, et en option les versions suffisantes.

source: To specify that any version of a module or package is required, the string should consist entirely of the module or package name. Examples include ``'mymodule'`` and ``'xml.parsers.expat'``.
fr: Il est nécessaire de définir chaque version d'un module ou d'un paquet, la chaîne de caractères doit être entièrement constituée de noms de modules ou de paquets. Les exemples incluent ``mymodule`` et ``'xml.parsers.expat'``.

source: If specific versions are required, a sequence of qualifiers can be supplied in parentheses. Each qualifier may consist of a comparison operator and a version number. The accepted comparison operators are::
fr: Si des versions spécifiques sont requises, une suite de qualificateurs peut être fournie entre parenthèses. Chaque qualificateur peut consister en un opérateur de comparaison et un numéro de version. Les opérateurs de comparaison acceptés sont ::

source: These can be combined by using multiple qualifiers separated by commas (and optional whitespace). In this case, all of the qualifiers must be matched; a logical AND is used to combine the evaluations.
fr: Ils peuvent être combinés en utilisant plusieurs qualificateurs séparés par des virgules (et de façon optionnelle des espaces). Dans ce cas, tous les qualificateurs doivent être validés ; un ET logique est utilisé pour combiner les évaluations.

source: Let's look at a bunch of examples:
fr: Jetons un œil à quelques exemples :

source: Requires Expression
fr: Valeur de ``requires``

source: Explanation
fr: Explication

source: Only version ``1.0`` is compatible
fr: Seule la version ``1.0`` est compatible

source: Any version after ``1.0`` and before ``2.0`` is compatible, except ``1.5.1``
fr: Toute version après ``1.0`` et avant ``2.0`` est compatible, à l'exception de ``1.5.1``

source: Now that we can specify dependencies, we also need to be able to specify what we provide that other distributions can require. This is done using the *provides* keyword argument to :func:`setup`. The value for this keyword is a list of strings, each of which names a Python module or package, and optionally identifies the version. If the version is not specified, it is assumed to match that of the distribution.
fr: Maintenant que nous pouvons définir des dépendances, nous devons également être en mesure de définir dans ce que nous fournissons ce que d'autres distributions peuvent nécessiter. Cela est réalisé en utilisant l'argument nommé *provides* dans :func:`setup`. La valeur de cet argument est une liste de chaînés de caractères, chacune d'entre elle étant un module Python ou un paquet, et de façon optionnelle identifie la version. Si la version n'est pas définie, il est supposé qu'elle correspond à celle de la distribution.

source: Some examples:
fr: Quelques exemples :

source: Provides Expression
fr: Valeur de ``provides``

source: ``mypkg``
fr: ``monpaquet``

source: Provide ``mypkg``, using the distribution version
fr: On fournit ``monpaquet`` en utilisant la version de la distribution

source: ``mypkg (1.1)``
fr: ``monpaquet (1.1)``

source: Provide ``mypkg`` version 1.1, regardless of the distribution version
fr: On fournit ``monpaquet`` en version 1.1, indépendamment de la version de la distribution

source: A package can declare that it obsoletes other packages using the *obsoletes* keyword argument. The value for this is similar to that of the *requires* keyword: a list of strings giving module or package specifiers. Each specifier consists of a module or package name optionally followed by one or more version qualifiers. Version qualifiers are given in parentheses after the module or package name.
fr: Un paquet peut déclarer qu'il rend obsolète d'autres paquets en utilisant l'argument nommé *obsoletes*. La valeur pour celui-ci est similaire à celui de l'argument nommé *requires* : une liste de chaînes de caractères donnant les spécifications du module ou du paquet.

source: The versions identified by the qualifiers are those that are obsoleted by the distribution being described. If no qualifiers are given, all versions of the named module or package are understood to be obsoleted.
fr: Les versions identifiées par les qualificateurs sont celles qui sont rendues obsolètes par la distribution décrite. Si aucun qualificateur n'est donné, toutes les versions du module ou du paquet nommé sont interprétées comme obsolètes.

source: Installing Scripts
fr: Installation des scripts

source: So far we have been dealing with pure and non-pure Python modules, which are usually not run by themselves but imported by scripts.
fr: Jusqu'à présent nous avons interagi avec des modules purement ou non en Python, qui ne sont habituellement pas lancés par eux-mêmes mais importés par des scripts.

source: Scripts are files containing Python source code, intended to be started from the command line. Scripts don't require Distutils to do anything very complicated. The only clever feature is that if the first line of the script starts with ``#!`` and contains the word "python", the Distutils will adjust the first line to refer to the current interpreter location. By default, it is replaced with the current interpreter location. The :option:`!--executable` (or :option:`!-e`) option will allow the interpreter path to be explicitly overridden.
fr: Les scripts sont des fichiers contenant du code source Python prévus pour être lancés en ligne de commande. Les scripts n'ont pas besoin des *Distutils* pour faire quoique ce soit de très compliqué. La seule fonctionnalité astucieuse est que la première ligne du script commence par ``#!`` et contient le mot "python", les *Distutils* ajusteront la première ligne pour faire référence à l'emplacement actuel de l'interpréteur. Par défaut, elle est replacée par l'emplacement actuel de l'interpréteur. L'option :option:`!--executable` (or :option:`!-e`) permettra au chemin de l'interpréteur d'être explicitement remplacé.

source: The ``scripts`` option simply is a list of files to be handled in this way. From the PyXML setup script::
fr: L'option ``scripts`` est simplement une liste de fichiers à utiliser de cette façon. Depuis le script ``setup.py`` de PyML ::

source: All the scripts will also be added to the ``MANIFEST`` file if no template is provided. See :ref:`manifest`.
fr: Tous les scripts seront aussi ajoutés au fichier ``MANIFEST`` si aucun modèle n'est fourni. Voir :ref:`manifest`.

source: Installing Package Data
fr: Installer des paquets de données

source: Often, additional files need to be installed into a package. These files are often data that's closely related to the package's implementation, or text files containing documentation that might be of interest to programmers using the package. These files are called :dfn:`package data`.
fr: Souvent, des fichiers additionnels doivent être installés dans le paquet. Ces fichiers sont souvent de la donnée qui est intimement liée à l'implémentation du paquet, ou des fichiers texte contenant de la documentation qui peut être intéressante pour le programmeur utilisant le paquet. Ces fichiers sont appelés :dfn:`package data`.

source: Package data can be added to packages using the ``package_data`` keyword argument to the :func:`setup` function. The value must be a mapping from package name to a list of relative path names that should be copied into the package. The paths are interpreted as relative to the directory containing the package (information from the ``package_dir`` mapping is used if appropriate); that is, the files are expected to be part of the package in the source directories. They may contain glob patterns as well.
fr: Les 'paquets de données' peuvent être ajoutés en utilisant l'argument nommé ``package_data`` dans la fonction :func:`setup`. La valeur doit être un mappage du nom du paquet à une liste de chemins relatifs qui doivent être copiés dans le paquet. Les chemins sont interprétés relativement au répertoire contenant le paquet (l'information du mappage ``package_dir`` est utilisée le cas échéant) ; ceci étant, on s'attend à ce que les fichiers fassent partie du répertoire source du paquet. Ils peuvent également contenir des motifs `glob`.

source: The path names may contain directory portions; any necessary directories will be created in the installation.
fr: Les chemins d'accès peuvent contenir des parties de répertoires ; tout répertoire nécessaire sera créé dans cette installation.

source: For example, if a package should contain a subdirectory with several data files, the files can be arranged like this in the source tree::
fr: Par exemple, si un paquet contient un sous-répertoire avec de nombreux fichiers de donnée, les fichiers peuvent être organisés dans l'arbre source de la façon suivante ::

source: The corresponding call to :func:`setup` might be::
fr: L'appel correspondant à :func:`setup` peut être ::

source: All the files that match ``package_data`` will be added to the ``MANIFEST`` file if no template is provided. See :ref:`manifest`.
fr: Tous les fichiers correspondant à ``package_date`` seront ajoutés au fichier ``MANIFEST`` si aucun modèle n'est fourni. Voir :ref:`manifest`.

source: Installing Additional Files
fr: Installer des fichiers additionnels

source: The ``data_files`` option can be used to specify additional files needed by the module distribution: configuration files, message catalogs, data files, anything which doesn't fit in the previous categories.
fr: L'option ``data_files`` peut être utilisée pour définir des fichiers additionnels requis par la distribution du module : fichiers de configurations, catalogues de messages, fichiers de donnée, tout ce qui ne rentre par dans les catégories précédentes.

source: ``data_files`` specifies a sequence of (*directory*, *files*) pairs in the following way::
fr: ``data_files`` définie une séquence de paires (*répertoires*, *fichiers*) de la façon suivante ::

source: Each (*directory*, *files*) pair in the sequence specifies the installation directory and the files to install there.
fr: Chaque paire (*répertoire*, *fichier*) dans la séquence définit le répertoire d'installation et les fichiers à y installer.

source: Each file name in *files* is interpreted relative to the :file:`setup.py` script at the top of the package source distribution. Note that you can specify the directory where the data files will be installed, but you cannot rename the data files themselves.
fr: Chaque nom de fichier dans *fichiers* est interprété relativement au script :file:`setup.py` en haut du paquet de la distribution source. Notez que vous pouvez définir un répertoire où les fichiers de donnée seront installés, mais vous ne pouvez pas renommer les fichiers de donnée eux-mêmes.

source: The *directory* should be a relative path. It is interpreted relative to the installation prefix (Python's ``sys.prefix`` for system installations; ``site.USER_BASE`` for user installations). Distutils allows *directory* to be an absolute installation path, but this is discouraged since it is incompatible with the wheel packaging format. No directory information from *files* is used to determine the final location of the installed file; only the name of the file is used.
fr: Le *répertoire* doit être un chemin relatif. Il est interprété relativement au préfixe d'installation (le ``sys.prefix`` de Python pour les installations ``système`` ; ``site.USER_BASE`` pour les installations ``utilisateur``). *Distutils* permet à *répertoire* d'être un chemin d'installation absolu, mais cela est déconseillé dans la mesure où c'est incompatible avec la mise en paquet au format `wheel`. Aucune information de répertoire provenant de *fichiers* n'est utilisée pour déterminer l’emplacement final d'installation du fichier ; seul le nom du fichier est utilisé.

source: You can specify the ``data_files`` options as a simple sequence of files without specifying a target directory, but this is not recommended, and the :command:`install` command will print a warning in this case. To install data files directly in the target directory, an empty string should be given as the directory.
fr: Vous pouvez définir les options ``data_files`` comme une simple succession de fichiers sans définir de répertoire cible, mais cela n'est pas recommandé, et la commande :command:`install` affichera un message d'alerte dans ce cas. Pour installer des fichiers de donnée directement dans le répertoire cible, une chaîne de caractère vide devra être donnée en tant que répertoire.

source: All the files that match ``data_files`` will be added to the ``MANIFEST`` file if no template is provided. See :ref:`manifest`.
fr: Tous les fichiers correspondant à ``data_files`` seront ajoutés au fichier ``MANIFEST`` si aucun modèle n'est fourni. Voir :ref:`manifest`.

source: Additional meta-data
fr: Métadonnées additionnelles

source: The setup script may include additional meta-data beyond the name and version. This information includes:
fr: Le script ``setup.py`` peut inclure des métadonnées additionnelles au-delà du nom et de la version. Ces informations incluent :

source: Meta-Data
fr: Métadonnées

source: Value
fr: Valeur

source: name of the package
fr: nom du paquet

source: short string
fr: courte chaîne de caractères

source: version of this release
fr: version de la publication

source: package author's name
fr: nom de l'auteur du paquet

source: email address of the package author
fr: adresse courriel de l'auteur du paquet

source: email address
fr: adresse de courriel

source: package maintainer's name
fr: nom du mainteneur du paquet

source: email address of the package maintainer
fr: adresse du courriel du mainteneur du paquet

source: home page for the package
fr: page d’accueil du paquet

source: short, summary description of the package
fr: bref résumé décrivant le paquet

source: longer description of the package
fr: plus longue description du paquet

source: long string
fr: longue chaîne de caractères

source: location where the package may be downloaded
fr: endroit où le paquet peut être téléchargé

source: a list of classifiers
fr: une liste de classificateurs

source: list of strings
fr: liste de chaînes de caractères

source: a list of platforms
fr: une liste de plateformes

source: a list of keywords
fr: une liste de mots clés

source: license for the package
fr: licence du paquet

source: These fields are required.
fr: Ces champs sont requis.

source: It is recommended that versions take the form *major.minor[.patch[.sub]]*.
fr: Il est recommandé que les versions prennent la forme *majeure.mineure[.correctif[.sous]]*.

source: Either the author or the maintainer must be identified. If maintainer is provided, distutils lists it as the author in :file:`PKG-INFO`.
fr: L'un ou l'autre de l'auteur ou un mainteneur doit être identifié. Si un mainteneur est fourni, *distutils* l'indique en tant qu'auteur dans le fichier :file:`PKG-INFO`.

source: The ``long_description`` field is used by PyPI when you publish a package, to build its project page.
fr: Le champ ``long_description`` est utilisé par PyPI quand vous publiez un paquet pour construire sa page de projet.

source: The ``license`` field is a text indicating the license covering the package where the license is not a selection from the "License" Trove classifiers. See the ``Classifier`` field. Notice that there's a ``licence`` distribution option which is deprecated but still acts as an alias for ``license``.
fr: Le champ ``license`` est un texte indiquant la licence couvrant le paquet ou la licence n'est pas sélectionné parmi les classificateurs de la "Licence" Trove. Voir le champ ``Classifier``. À noter qu'il y a une option de distribution ``licence`` qui est dépréciée mais agit toujours comme un alias pour ``license``.

source: This field must be a list.
fr: Ce champ doit être une liste.

source: The valid classifiers are listed on `PyPI <https://pypi.org/classifiers>`_.
fr: Les classificateurs valides sont listés sur `PyPI <https://pypi.org/classifiers>`_.

source: To preserve backward compatibility, this field also accepts a string. If you pass a comma-separated string ``'foo, bar'``, it will be converted to ``['foo', 'bar']``, Otherwise, it will be converted to a list of one string.
fr: Pour préserver la rétrocompatibilité, ce champ accepte aussi une chaîne de caractères. Si vous passez une chaine de caractères séparée par des virgules ``'foo, bar'``, elle sera convertie en ``['foo', 'bar']``, Autrement, elle sera convertie en une liste d'une chaîne de caractères.

source: 'short string'
fr: 'courte chaîne de caractères'

source: A single line of text, not more than 200 characters.
fr: Une simple ligne de texte ne dépassant par 200 caractères.

source: 'long string'
fr: 'long chaîne de caractères'

source: Multiple lines of plain text in reStructuredText format (see http://docutils.sourceforge.net/).
fr: De multiples chaînes de texte au format ReStructuredText (voir http://docutils.sourceforge.net/).

source: 'list of strings'
fr: 'liste de chaînes de caractères'

source: See below.
fr: Voir ci-dessous.

source: Encoding the version information is an art in itself. Python packages generally adhere to the version format *major.minor[.patch][sub]*. The major number is 0 for initial, experimental releases of software. It is incremented for releases that represent major milestones in a package. The minor number is incremented when important new features are added to the package. The patch number increments when bug-fix releases are made. Additional trailing version information is sometimes used to indicate sub-releases. These are "a1,a2,...,aN" (for alpha releases, where functionality and API may change), "b1,b2,...,bN" (for beta releases, which only fix bugs) and "pr1,pr2,...,prN" (for final pre-release release testing). Some examples:
fr: Encoder les informations de version est un art en soi. Les paquets Python adhèrent généralement au format de version *majeure.mineure[.correctif][sous]*. Le numéro majeur est 0 pour initial, publications expérimentales d'un logiciel. Il est incrémenté pour les publications qui représentent des étapes majeures pour le paquet. Le nombre mineur est incrémenté quand des d'importantes nouvelles fonctionnalités sont ajoutées au paquet. Le numéro de correctif s'incrémente lors de la publication d'une correction de bogue est faite. Celles-ci sont "*a1,a2,...,aN*" (pour les publications alpha, où les fonctionnalités et l'API peut changer), "*b1,b2,...,bN*" (pour les publications *beta*, qui corrigent seulement les bogues) et "*pr1,pr2,...,prN*" (pour les ultimes pré-publication et publications de test). Quelques exemples :

source: the first, experimental release of a package
fr: la première, publication expérimentale du paquet

source: the second alpha release of the first patch version of 1.0
fr: la seconde publication alpha du premier correctif de la version 1.0

source: ``classifiers`` must be specified in a list::
fr: les ``classifiers`` doivent être définis dans une liste ::

source: :class:`~distutils.core.setup` now warns when ``classifiers``, ``keywords`` or ``platforms`` fields are not specified as a list or a string.
fr: :class:`~distutils.core.setup` alerte maintenant lorsque les champs ``classifiers``, ``keywords`` ou ``platforms`` ne sont pas définis en tant que liste ou chaîne de caractères.

source: Debugging the setup script
fr: Débogage du script ``setup.py``

source: Sometimes things go wrong, and the setup script doesn't do what the developer wants.
fr: Parfois les choses tournent mal, et le script ``setup.py`` ne fait pas ce que le développeur veut.
