Repository: python/python-docs-fr
Catalog: distutils/setupscript.po
Languages: fr

source: Distutils catches any exceptions when running the setup script, and print a simple error message before the script is terminated. The motivation for this behaviour is to not confuse administrators who don't know much about Python and are trying to install a package. If they get a big long traceback from deep inside the guts of Distutils, they may think the package or the Python installation is broken because they don't read all the way down to the bottom and see that it's a permission problem.
fr: *Distutils* saisit toute exception lors de l'exécution du script ``setup.py``, et affiche un message d'erreur simple avant d'arrêter le script. L'intention pour ce comportement est de ne pas embrouiller les administrateurs qui ne savent pas grand-chose de Python et qui essayent d'installer un paquet. S'ils reçoivent une grosse et longue trace d'appels provenant des entrailles de *Distutils*, ils peuvent penser que le paquet ou que l'installation de Python est corrompue car, ils ne lisent pas tout jusqu'en bas et voient que c'est un problème de permissions.

source: On the other hand, this doesn't help the developer to find the cause of the failure. For this purpose, the :envvar:`DISTUTILS_DEBUG` environment variable can be set to anything except an empty string, and distutils will now print detailed information about what it is doing, dump the full traceback when an exception occurs, and print the whole command line when an external program (like a C compiler) fails.
fr: D'un autre côté, cela n'aide pas le développeur à trouver la cause du problème. À cette fin, la variable d'environnement :envvar:`DISTUTILS_DEBUG` peut être assignée à n'importe quoi sauf une chaîne de caractères vide, et *distutils* affichera maintenant une information détaillée à propos de ce qu'il fait, déversera la trace d'appels complète lors d'une exception, et affichera la ligne de commande complète quand un programme externe (comme un compilateur C) échoue.
