Repository: python/python-docs-fr
Catalog: distutils/sourcedist.po
Languages: fr

source: Creating a Source Distribution
fr: Créer une distribution source

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
fr: Cette page est conservée uniquement jusqu'à ce que la documentation ``setuptool`` sur https://setuptools.readthedocs.io/en/latest/setuptools.html couvre de manière indépendante toutes les informations pertinentes actuellement incluses ici.

source: As shown in section :ref:`distutils-simple-example`, you use the :command:`sdist` command to create a source distribution. In the simplest case, ::
fr: Comme montré dans le chapitre :ref:`distutils-simple-example`, vous pouvez utiliser la commande :command:`sdist` pour créer une distribution source. Dans le cas le plus simple, ::

source: (assuming you haven't specified any :command:`sdist` options in the setup script or config file), :command:`sdist` creates the archive of the default format for the current platform. The default format is a gzip'ed tar file (:file:`.tar.gz`) on Unix, and ZIP file on Windows.
fr: (en supposant que vous n'avez spécifié aucune option pour la commande :command:`sdist` dans le script de préparation ou le fichier de configuration), :command:`sdist` crée une archive au format par défaut pour la plateforme utilisée. Le format par défaut est un fichier *tar* compressé (:file:`.tar.gz`) sur Unix et un fichier ZIP sur Windows.

source: You can specify as many formats as you like using the :option:`!--formats` option, for example::
fr: Vous pouvez donner autant de formats que désiré *via* l'option :option:`!--formats`, par exemple ::

source: to create a gzipped tarball and a zip file. The available formats are:
fr: pour créer un fichier *tarball* compressé et un fichier ZIP. Les formats disponibles actuellement sont :

source: zip file (:file:`.zip`)
fr: Fichier *zip* (:file:`.zip`)

source: gzip'ed tar file (:file:`.tar.gz`)
fr: Fichier *tar* compressé par *gzip* (:file:`.tar.gz`)

source: bzip2'ed tar file (:file:`.tar.bz2`)
fr: Fichier *tar* compressé par *bzip2* (:file:`.tar.bz2`)

source: xz'ed tar file (:file:`.tar.xz`)
fr: Fichier *tar* compressé par *xz* (:file:`.tar.xz`)

source: compressed tar file (:file:`.tar.Z`)
fr: Fichier *tar* compressé par *compress* (:file:`.tar.Z`)

source: tar file (:file:`.tar`)
fr: fichier *tar* (:file:`.tar`)

source: Added support for the ``xztar`` format.
fr: Ajout du support des fichiers ``xztar``.

source: default on Windows
fr: Par défaut sur Windows

source: default on Unix
fr: Par défaut sur Unix

source: requires either external :program:`zip` utility or :mod:`zipfile` module (part of the standard Python library since Python 1.6)
fr: nécessite soit un utilitaire :program:`zip` extérieur ou le module :mod:`zipfile` (inclut dans la bibliothèque standard depuis Python 1.6)

source: requires the :program:`compress` program. Notice that this format is now pending for deprecation and will be removed in the future versions of Python.
fr: nécessite le programme :program:`compress`. Remarquez que ce format sera bientôt obsolète et sera enlevé des prochaines version de Python.

source: When using any ``tar`` format (``gztar``, ``bztar``, ``xztar``, ``ztar`` or ``tar``), under Unix you can specify the ``owner`` and ``group`` names that will be set for each member of the archive.
fr: Lorsque vous utilisez n'importe quel format ``tar`` (``gztar``, ``bztar``, ``xztar``, ``ztar`` or ``tar``), vous pouvez spécifier sous Unix le propriétaire et le groupe qui seront appliqué pour chaque fichier de l'archive.

source: For example, if you want all files of the archive to be owned by root::
fr: Par exemple, si vous voulez que tous les fichiers de l'archive soient détenu par *root* ::

source: Specifying the files to distribute
fr: Spécifier les fichiers à distribuer

source: If you don't supply an explicit list of files (or instructions on how to generate one), the :command:`sdist` command puts a minimal default set into the source distribution:
fr: Si vous ne fournissez pas une liste explicite de fichiers (ou les instructions pour la générer), la commande :command:`sdist` en met par défaut le minimum dans la distribution source :

source: all Python source files implied by the ``py_modules`` and ``packages`` options
fr: tous les fichiers source Python sous-entendus par les options ``py_modules`` et ``packages``

source: all C source files mentioned in the ``ext_modules`` or ``libraries`` options
fr: tous les fichiers source C mentionnés dans les arguments ``ext_modules`` ou ``libraries``

source: scripts identified by the ``scripts`` option See :ref:`distutils-installing-scripts`.
fr: scripts identifiés par l'argument ``scripts``. Voir :ref:`distutils-installing-scripts`.

source: anything that looks like a test script: :file:`test/test\*.py` (currently, the Distutils don't do anything with test scripts except include them in source distributions, but in the future there will be a standard for testing Python module distributions)
fr: tout ce qui ressemble à un script de test :file:`test/test\*.py` (pour l'instant, Distutils ne fait rien avec ces scripts de test, si ce n'est les inclure dans les distributions sources, mais dans le futur un standard sera implémenté pour tester les distributions de module Python)

source: Any of the standard README files (:file:`README`, :file:`README.txt`, or :file:`README.rst`), :file:`setup.py` (or whatever you called your setup script), and :file:`setup.cfg`.
fr: n'importe quel fichier README classique (:file:`README`, :file:`README.txt`, ou :file:`README.rst`), ainsi que le fichier :file:`setup.py` (ou votre script d'installation si vous l'avez appelé autrement) et le fichier :file:`setup.cfg`.

source: all files that matches the ``package_data`` metadata. See :ref:`distutils-installing-package-data`.
fr: tous les fichiers associés aux méta-données ``package_data``. Voir :ref:`distutils-installing-package-data`.

source: all files that matches the ``data_files`` metadata. See :ref:`distutils-additional-files`.
fr: tous les fichiers associés aux méta-données ``data_files``. Voir :ref:`distutils-additional-files`.

source: Sometimes this is enough, but usually you will want to specify additional files to distribute. The typical way to do this is to write a *manifest template*, called :file:`MANIFEST.in` by default. The manifest template is just a list of instructions for how to generate your manifest file, :file:`MANIFEST`, which is the exact list of files to include in your source distribution. The :command:`sdist` command processes this template and generates a manifest based on its instructions and what it finds in the filesystem.
fr: Parfois ce fonctionnement suffit, mais généralement vous voudrez spécifier des fichiers supplémentaires à distribuer. La façon classique de le faire est d'écrire un *manifeste modèle*, appelé :file:`MANIFEST.in` par défaut. Ce manifeste modèle est juste une liste d'instructions pour générer votre fichier manifeste final, :file:`MANIFEST`, qui est la liste exacte des fichiers à inclure dans votre distribution source. La commande :command:`sdist` traite ce modèle et génère un manifeste à partir de ces instructions et de ce qu'elle trouve dans le système de fichiers.

source: If you prefer to roll your own manifest file, the format is simple: one filename per line, regular files (or symlinks to them) only. If you do supply your own :file:`MANIFEST`, you must specify everything: the default set of files described above does not apply in this case.
fr: Si vous préférez créer votre propre fichier manifeste, le format est simple : un nom de fichier par ligne, uniquement des fichiers normaux (ou leur lien symbolique). Si vous fournissez votre propre :file:`MANIFEST`, vous devez tout spécifier : les groupes de fichiers par défaut décrits au-dessus ne sont pas inclus automatiquement dans ce cas.

source: An existing generated :file:`MANIFEST` will be regenerated without :command:`sdist` comparing its modification time to the one of :file:`MANIFEST.in` or :file:`setup.py`.
fr: Un :file:`MANIFEST` existant généré automatiquement sera régénéré sans que :command:`sdist` ne compare son heure de modification à :file:`MANIFEST.in` ou :file:`setup.py`.

source: :file:`MANIFEST` files start with a comment indicating they are generated. Files without this comment are not overwritten or removed.
fr: Les fichiers :file:`MANIFEST` commencent par un commentaire indiquant qu'ils sont générés. Les fichiers sans ce commentaire ne sont pas réécrits ou supprimés.

source: :command:`sdist` will read a :file:`MANIFEST` file if no :file:`MANIFEST.in` exists, like it used to do.
fr: :command:`sdist` lira un ficher :file:`MANIFEST` s'il n'existe pas de :file:`MANIFEST.in` , tel qu'il en avait l'habitude.

source: :file:`README.rst` is now included in the list of distutils standard READMEs.
fr: Le fichier :file:`README.rst` est maintenant inclus dans la liste des fichiers *README* standards de *distutils*.

source: The manifest template has one command per line, where each command specifies a set of files to include or exclude from the source distribution. For an example, again we turn to the Distutils' own manifest template:
fr: Le modèle de manifeste possède une commande par ligne, où chaque commande spécifie un ensemble de fichiers à inclure ou à exclure de la distribution source. Par exemple, regardons à nouveau le propre manifeste de Distutils :

source: The meanings should be fairly clear: include all files in the distribution root matching :file:`\*.txt`, all files anywhere under the :file:`examples` directory matching :file:`\*.txt` or :file:`\*.py`, and exclude all directories matching :file:`examples/sample?/build`. All of this is done *after* the standard include set, so you can exclude files from the standard set with explicit instructions in the manifest template. (Or, you can use the :option:`!--no-defaults` option to disable the standard set entirely.) There are several other commands available in the manifest template mini-language; see section :ref:`sdist-cmd`.
fr: La signification est assez claire : inclure tous les fichiers à la racine de la distribution correspondant à :file:`*.txt`, tous les fichiers n'importe où dans le dossier :file:`examples` correspondant à :file:`\*.txt` ou :file:`\*.py`, et exclure tous les dossiers correspondant à :file:`examples/sample?/build`. Tout ceci est fait **après** l'ensemble d'inclusions standard, vous pouvez donc exclure des fichiers précédemment inclus en utilisant une instruction explicite dans le manifeste. (Vous pouvez aussi utiliser l'option :option:`!--no-defaults` pour désactiver complètement les inclusions standards). Il existe d'autres commandes dans le langage du fichier manifeste, consultez le chapitre :ref:`sdist-cmd`.

source: The order of commands in the manifest template matters: initially, we have the list of default files as described above, and each command in the template adds to or removes from that list of files. Once we have fully processed the manifest template, we remove files that should not be included in the source distribution:
fr: L'ordre des commandes dans le modèle manifeste compte : nous avons, à la base, la liste de fichiers par défaut telle que décrite plus haut. Ensuite, chaque commande du modèle ajoute ou supprime des fichiers de cette liste. Une fois que le traitement du manifeste modèle est fini, nous enlevons les fichiers qui ne doivent pas être inclus dans la distribution source :

source: all files in the Distutils "build" tree (default :file:`build/`)
fr: tous les fichiers dans l'arborescence de *build* de Distutils (par défaut :file:`build/`)

source: all files in directories named :file:`RCS`, :file:`CVS`, :file:`.svn`, :file:`.hg`, :file:`.git`, :file:`.bzr` or :file:`_darcs`
fr: tous les fichiers dans les dossiers nommés :file:`RCS`, :file:`CVS`, :file:`.svn`, :file:`.hg`, :file:`.git`, :file:`.bzr` ou :file:`_darcs`

source: Now we have our complete list of files, which is written to the manifest for future reference, and then used to build the source distribution archive(s).
fr: Maintenant nous avons notre liste complète de fichiers ; elle est désormais écrite dans le manifeste pour une utilisation future et sera utilisée pour construire la ou les archive(s) de notre distribution source.

source: You can disable the default set of included files with the :option:`!--no-defaults` option, and you can disable the standard exclude set with :option:`!--no-prune`.
fr: Vous pouvez désactiver l'ensemble des fichiers inclus par défaut en utilisant l'option :option:`!--no-defaults`, ainsi que désactiver les exclusions standards avec l'option :option:`!--no-prune`.

source: Following the Distutils' own manifest template, let's trace how the :command:`sdist` command builds the list of files to include in the Distutils source distribution:
fr: Voici le manifeste modèle de Distutils, suivons comment la commande :command:`sdist` construit la liste des fichiers à inclure dans la distribution source de Distutils.

source: include all Python source files in the :file:`distutils` and :file:`distutils/command` subdirectories (because packages corresponding to those two directories were mentioned in the ``packages`` option in the setup script---see section :ref:`setup-script`)
fr: inclure tous les fichiers source Python dans les sous-dossiers :file:`distutils` et :file:`distutils/command` (parce que des paquets correspondant à ces deux dossiers ont été mentionnés dans l'argument ``packages`` du script d'installation --- voir le chapitre :ref:`setup-script`)

source: include :file:`README.txt`, :file:`setup.py`, and :file:`setup.cfg` (standard files)
fr: inclure :file:`README.txt`, :file:`setup.py` et :file:`setup.cfg` (fichiers standards)

source: include :file:`test/test\*.py` (standard files)
fr: inclure :file:`test/test\*.py` (fichiers standard)

source: include :file:`\*.txt` in the distribution root (this will find :file:`README.txt` a second time, but such redundancies are weeded out later)
fr: inclure :file:`\*.txt` à la racine de la distribution (ceci trouve :file:`README.txt` une seconde fois, mais les redondances sont supprimées plus tard)

source: include anything matching :file:`\*.txt` or :file:`\*.py` in the sub-tree under :file:`examples`,
fr: inclure tout fichier de la forme :file:`\*.txt` ou :file:`\*.py` dans la sous-arborescence de :file:`examples`,

source: exclude all files in the sub-trees starting at directories matching :file:`examples/sample?/build`\ ---this may exclude files included by the previous two steps, so it's important that the ``prune`` command in the manifest template comes after the ``recursive-include`` command
fr: exclure tous les fichiers dans les sous-arborescences dont les dossiers racines sont de la forme :file:`examples/sample?/build`\ --- Ceci peut exclure des fichiers inclus dans les étapes précédentes, il est donc important que la commande ``prune`` dans le manifeste modèle vienne après la commande ``recursive-include``

source: exclude the entire :file:`build` tree, and any :file:`RCS`, :file:`CVS`, :file:`.svn`, :file:`.hg`, :file:`.git`, :file:`.bzr` and :file:`_darcs` directories
fr: exclure l'arborescence de :file:`build` ainsi que les dossiers :file:`RCS`, :file:`CVS`, :file:`.svn`, :file:`.hg`, :file:`.git`, :file:`.bzr` et :file:`_darcs`

source: Just like in the setup script, file and directory names in the manifest template should always be slash-separated; the Distutils will take care of converting them to the standard representation on your platform. That way, the manifest template is portable across operating systems.
fr: Comme dans le script de préparation, les chemins des fichiers et des dossiers dans le manifeste modèle doivent toujours être séparés par des barres obliques (*slash* en anglais) ; Distutils s'occupe de les convertir à la représentation standard de votre plateforme. De cette manière, le manifeste modèle est portable sur tout système d'exploitation.

source: Manifest-related options
fr: Options pour le manifeste

source: The normal course of operations for the :command:`sdist` command is as follows:
fr: L'ordre normal des opérations pour la commande :command:`sdist` est le suivant :

source: if the manifest file (:file:`MANIFEST` by default) exists and the first line does not have a comment indicating it is generated from :file:`MANIFEST.in`, then it is used as is, unaltered
fr: si le fichier manifeste (:file:`MANIFEST` par défaut) existe et que la première ligne n'a pas de commentaire indiquant qu'il a été généré par :file:`MANIFEST.in`, alors il est utilisé tel quel, inchangé

source: if the manifest file doesn't exist or has been previously automatically generated, read :file:`MANIFEST.in` and create the manifest
fr: si le manifeste n'existe pas ou s'il a été généré automatiquement, lire :file:`MANIFEST.in` et créer le manifeste

source: if neither :file:`MANIFEST` nor :file:`MANIFEST.in` exist, create a manifest with just the default file set
fr: s'il n'existe ni :file:`MANIFEST`, ni :file:`MANIFEST.in`, alors créer un manifeste contenant uniquement le groupe de fichiers par défaut

source: use the list of files now in :file:`MANIFEST` (either just generated or read in) to create the source distribution archive(s)
fr: utiliser maintenant la liste de fichiers de :file:`MANIFEST` (qu'il ait été généré ou lu) pour créer la ou les archive(s) de la distribution source

source: There are a couple of options that modify this behaviour. First, use the :option:`!--no-defaults` and :option:`!--no-prune` to disable the standard "include" and "exclude" sets.
fr: Il existe deux manières pour modifier ce comportement. D'abord utilisez les options :option:`!--no-defaults` et :option:`!--no-prune` pour désactiver les inclusions et exclusions standards.

source: Second, you might just want to (re)generate the manifest, but not create a source distribution::
fr: Ensuite, si vous ne voulez que (ré)générer le manifeste, mais pas créer la distribution source ::

source: :option:`!-o` is a shortcut for :option:`!--manifest-only`.
fr: L'option :option:`!-o` est un raccourci pour l'option :option:`!--manifest-only`.
