Repository: python/python-docs-fr
Catalog: using/cmdline.po
Languages: fr

source: Multiple :option:`-W` options may be given; when a warning matches more than one option, the action for the last matching option is performed. Invalid :option:`-W` options are ignored (though, a warning message is printed about invalid options when the first warning is issued).
fr: L'option :option:`-W` peut être répétée ; lorsqu'un avertissement correspond à plus d'une option, l'action associée à la dernière correspondance est effectuée. Les options :option:`-W` invalides sont ignorées (cependant, un message d'avertissement est affiché sur les options invalides au moment où le premier avertissement est généré).

source: Warnings can also be controlled using the :envvar:`PYTHONWARNINGS` environment variable and from within a Python program using the :mod:`warnings` module.
fr: Les avertissements peuvent aussi être contrôlés en utilisant la variable d'environnement :envvar:`PYTHONWARNINGS` et depuis un programme Python en utilisant le module :mod:`warnings`.

source: The simplest settings apply a particular action unconditionally to all warnings emitted by a process (even those that are otherwise ignored by default)::
fr: Les configurations les plus simples forcent l'application de l'action à tous les avertissements émis par un processus (même ceux qui auraient été ignorés par défaut) ::

source: The action names can be abbreviated as desired (e.g. ``-Wi``, ``-Wd``, ``-Wa``, ``-We``) and the interpreter will resolve them to the appropriate action name.
fr: Les noms des actions peuvent être abrégés à votre convenance (par exemple. ``-Wi``, ``-Wd``, ``-Wa``, ``-We``), l'interpréteur fait la résolution vers le nom adéquat.

source: See :ref:`warning-filter` and :ref:`describing-warning-filters` for more details.
fr: Voir :ref:`warning-filter` et :ref:`describing-warning-filters` pour plus de détails.

source: Skip the first line of the source, allowing use of non-Unix forms of ``#!cmd``. This is intended for a DOS specific hack only.
fr: Saute la première ligne du code source, autorisant ainsi les directives de type ``#!cmd`` non conformes au standard Unix. L'objectif est de proposer une astuce spécifique pour le DOS.

source: Reserved for various implementation-specific options. CPython currently defines the following possible values:
fr: Réservée pour les options spécifiques aux différentes implémentations. CPython reconnaît actuellement les valeurs suivantes :

source: ``-X faulthandler`` to enable :mod:`faulthandler`;
fr: ``-X faulthandler`` pour activer :mod:`faulthandler` ;

source: ``-X showrefcount`` to output the total reference count and number of used memory blocks when the program finishes or after each statement in the interactive interpreter. This only works on debug builds.
fr: ``-X showrefcount`` pour afficher le compteur des références et le nombre de blocs mémoire utilisés lorsque le programme se termine ou après chaque entrée de l'interpréteur interactif. Ceci ne fonctionne que sur les versions compilées en mode débogage.

source: ``-X tracemalloc`` to start tracing Python memory allocations using the :mod:`tracemalloc` module. By default, only the most recent frame is stored in a traceback of a trace. Use ``-X tracemalloc=NFRAME`` to start tracing with a traceback limit of *NFRAME* frames. See the :func:`tracemalloc.start` for more information.
fr: ``-X tracemalloc`` pour lancer le suivi des allocations mémoire par Python en utilisant le module :mod:`tracemalloc`. Par défaut, seul l'appel (la *frame* en anglais) le plus récent est stocké dans la trace de la pile d'appels. Utilisez ``-X tracemalloc=NFRAME`` pour lancer le suivi avec une limite des traces à *NFRAME* appels. Voir :func:`tracemalloc.start` pour plus d'informations.

source: ``-X showalloccount`` to output the total count of allocated objects for each type when the program finishes. This only works when Python was built with ``COUNT_ALLOCS`` defined.
fr: ``-X showalloccount`` pour afficher à la fin de l'exécution du programme le total des objets alloués pour chaque type. Ceci ne fonctionne que si Python a été compilé avec l'option ``COUNT_ALLOCS``.

source: ``-X importtime`` to show how long each import takes. It shows module name, cumulative time (including nested imports) and self time (excluding nested imports). Note that its output may be broken in multi-threaded application. Typical usage is ``python3 -X importtime -c 'import asyncio'``. See also :envvar:`PYTHONPROFILEIMPORTTIME`.
fr: ``-X importtime`` affiche le temps mis pour chaque importation. Le temps total par module est affiché (y compris le temps pris par les importations imbriquées) ainsi que le temps propre du module (c-à-d sans les importations imbriquées). Notez que l'affichage peut être perturbé dans une application avec de multiples fils d'exécution. L'utilisation classique est ``python3 -X importtime -c 'import asyncio'``. Voir aussi :envvar:`PYTHONPROFILEIMPORTTIME`.

source: ``-X dev``: enable CPython's "development mode", introducing additional runtime checks which are too expensive to be enabled by default. It should not be more verbose than the default if the code is correct: new warnings are only emitted when an issue is detected. Effect of the developer mode:
fr: ``-X dev``: active le "mode développeur" de CPython, injectant des vérifications à l'exécution qui ne sont pas actives par défaut. Ce n'est pas plus verbeux que le mode par défaut si le code est correct : les avertissements supplémentaires ne sont émis que quand un problème est détecté. Effets du mode développeur :

source: Add ``default`` warning filter, as :option:`-W` ``default``.
fr: Ajoute le filtre ``default`` pour les avertissements, comme l'option :option:`-W` ``default``.

source: Install debug hooks on memory allocators: see the :c:func:`PyMem_SetupDebugHooks` C function.
fr: Installe des points d'entrée (*hook* en anglais) pour le débogage dans les allocateurs de mémoire : voir la fonction C :c:func:`PyMem_SetupDebugHooks`.

source: Enable the :mod:`faulthandler` module to dump the Python traceback on a crash.
fr: Active le module :mod:`faulthandler` pour décharger la pile d'appels de Python en cas de crash.

source: Enable :ref:`asyncio debug mode <asyncio-debug-mode>`.
fr: Active le :ref:`mode de débogage d'asyncio <asyncio-debug-mode>`.

source: Set the :attr:`~sys.flags.dev_mode` attribute of :attr:`sys.flags` to ``True``.
fr: Définit l'attribut :attr:`~sys.flags.dev_mode` de :attr:`sys.flags` à ``True``

source: :class:`io.IOBase` destructor logs ``close()`` exceptions.
fr: Le destructeur de :class:`io.IOBase` journalise les exceptions levées par ``close()``.

source: ``-X utf8`` enables UTF-8 mode for operating system interfaces, overriding the default locale-aware mode. ``-X utf8=0`` explicitly disables UTF-8 mode (even when it would otherwise activate automatically). See :envvar:`PYTHONUTF8` for more details.
fr: ``-X utf8`` active le mode UTF-8 pour les interfaces avec le système d'exploitation, prenant le dessus sur le mode par défaut qui s'appuie sur la configuration régionale. ``-X utf8=0`` désactive explicitement le mode UTF-8 (même s'il avait du s'activer automatiquement). Voir :envvar:`PYTHONUTF8` pour plus de détails.

source: ``-X pycache_prefix=PATH`` enables writing ``.pyc`` files to a parallel tree rooted at the given directory instead of to the code tree. See also :envvar:`PYTHONPYCACHEPREFIX`.
fr: ``-X pycache_prefix=PATH`` place l'arborescence des fichiers ``.pyc`` à partir du chemin donné au lieu de l'arborescence du code source. Voir aussi :envvar:`PYTHONPYCACHEPREFIX`.

source: It also allows passing arbitrary values and retrieving them through the :data:`sys._xoptions` dictionary.
fr: Il est aussi possible de passer des valeurs arbitraires et de les récupérer par le dictionnaire :data:`sys._xoptions`.

source: The :option:`-X` option was added.
fr: L'option :option:`-X` a été ajoutée.

source: The ``-X faulthandler`` option.
fr: L'option ``-X faulthandler``.

source: The ``-X showrefcount`` and ``-X tracemalloc`` options.
fr: Les options ``-X showrefcount`` et ``-X tracemalloc`` .

source: The ``-X showalloccount`` option.
fr: L'option ``-X showalloccount``.

source: The ``-X importtime``, ``-X dev`` and ``-X utf8`` options.
fr: Les options ``-X importtime``, ``-X dev`` et ``-X utf8``.

source: The ``-X pycache_prefix`` option. The ``-X dev`` option now logs ``close()`` exceptions in :class:`io.IOBase` destructor.
fr: L'option ``-X pycache_prefix``. L'option ``-X dev`` journalise maintenant des exceptions ``close()`` dans le destructeur de la classe :class:`io.IOBase`.

source: Options you shouldn't use
fr: Options à ne pas utiliser

source: Reserved for use by Jython_.
fr: Utilisation réservée à Jython_.

source: Environment variables
fr: Variables d'environnement

source: These environment variables influence Python's behavior, they are processed before the command-line switches other than -E or -I. It is customary that command-line switches override environmental variables where there is a conflict.
fr: Les variables d'environnement suivantes modifient le comportement de Python. Elles sont analysées avant les options de la ligne de commande, autres que *-E* ou *-I*. Il est d'usage que les options de la ligne de commande prennent le pas sur les variables d'environnement en cas de conflit.

source: Change the location of the standard Python libraries. By default, the libraries are searched in :file:`{prefix}/lib/python{version}` and :file:`{exec_prefix}/lib/python{version}`, where :file:`{prefix}` and :file:`{exec_prefix}` are installation-dependent directories, both defaulting to :file:`/usr/local`.
fr: Modifie l'emplacement des bibliothèques standards de Python. Par défaut, les bibliothèques sont recherchées dans :file:`{préfixe}/lib/python{version}` et :file:`{préfixe_exec}/lib/python{version}` où :file:`{préfixe}` et :file:`{préfixe_exec}` sont des répertoires qui dépendent de l'installation (leur valeur par défaut étant :file:`/usr/local`).

source: When :envvar:`PYTHONHOME` is set to a single directory, its value replaces both :file:`{prefix}` and :file:`{exec_prefix}`. To specify different values for these, set :envvar:`PYTHONHOME` to :file:`{prefix}:{exec_prefix}`.
fr: Quand :envvar:`PYTHONHOME` est défini à un simple répertoire, sa valeur remplace à la fois :file:`{préfixe}` et :file:`{préfixe_exec}`. Pour spécifier des valeurs différentes à ces variables, définissez :envvar:`PYTHONHOME` à :file:`{préfixe}:{préfixe_exec}`.

source: Augment the default search path for module files. The format is the same as the shell's :envvar:`PATH`: one or more directory pathnames separated by :data:`os.pathsep` (e.g. colons on Unix or semicolons on Windows). Non-existent directories are silently ignored.
fr: Augmente le chemin de recherche par défaut des fichiers de modules. Le format est le même que pour :envvar:`PATH` du shell : un ou plusieurs chemins de répertoires séparés par :data:`os.pathsep` (par exemple, le caractère deux-points sous Unix et point-virgule sous Windows). Les répertoires qui n'existent pas sont ignorés silencieusement.

source: In addition to normal directories, individual :envvar:`PYTHONPATH` entries may refer to zipfiles containing pure Python modules (in either source or compiled form). Extension modules cannot be imported from zipfiles.
fr: En plus des répertoires normaux, des entrées individuelles de :envvar:`PYTHONPATH` peuvent faire référence à des fichiers zip contenant des modules en pur Python (soit sous forme de code source, soit sous forme compilée). Les modules d'extensions ne peuvent pas être importés à partir de fichiers zip.

source: The default search path is installation dependent, but generally begins with :file:`{prefix}/lib/python{version}` (see :envvar:`PYTHONHOME` above). It is *always* appended to :envvar:`PYTHONPATH`.
fr: Le chemin de recherche par défaut dépend de l'installation mais commence généralement par :file:`{préfixe}/lib/python{version}` (voir :envvar:`PYTHONHOME` ci-dessus). Il est *toujours* ajouté à :envvar:`PYTHONPATH`.

source: An additional directory will be inserted in the search path in front of :envvar:`PYTHONPATH` as described above under :ref:`using-on-interface-options`. The search path can be manipulated from within a Python program as the variable :data:`sys.path`.
fr: Comme indiqué ci-dessus dans :ref:`using-on-interface-options`, un répertoire supplémentaire est inséré dans le chemin de recherche devant :envvar:`PYTHONPATH`. Le chemin de recherche peut être manipulé depuis un programme Python avec la variable :data:`sys.path`.

source: If this is the name of a readable file, the Python commands in that file are executed before the first prompt is displayed in interactive mode. The file is executed in the same namespace where interactive commands are executed so that objects defined or imported in it can be used without qualification in the interactive session. You can also change the prompts :data:`sys.ps1` and :data:`sys.ps2` and the hook :data:`sys.__interactivehook__` in this file.
fr: S'il s'agit d'un nom de fichier accessible en lecture, les commandes Python de ce fichier sont exécutées avant que la première invite ne soit affichée en mode interactif. Le fichier est exécuté dans le même espace de nommage que les commandes interactives, de manière à ce que les objets définis ou importés puissent être utilisés sans qualificatif dans la session interactive. Vous pouvez aussi changer les invites :data:`sys.ps1` et :data:`sys.ps2` ainsi que le point d'entrée (*hook* en anglais) :data:`sys.__interactivehook__` dans ce fichier.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_startup`` with argument ``filename``.
fr: Lève un :ref:`évènement d'audit <auditing>` ``cpython.run_startup`` avec comme argument ``filename``.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_startup`` with the filename as the argument when called on startup.
fr: Lève un :ref:`évènement d'audit <auditing>` ``cpython.run_startup`` avec le nom du fichier en argument lorsqu'il est lancé au démarrage.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-O` option. If set to an integer, it is equivalent to specifying :option:`-O` multiple times.
fr: Si elle est définie à une chaîne non vide, c'est équivalent à spécifier l'option :option:`-O`. Si elle est définie à un entier, c'est équivalent à spécifier l'option :option:`-O` plusieurs fois.

source: If this is set, it names a callable using dotted-path notation. The module containing the callable will be imported and then the callable will be run by the default implementation of :func:`sys.breakpointhook` which itself is called by built-in :func:`breakpoint`. If not set, or set to the empty string, it is equivalent to the value "pdb.set_trace". Setting this to the string "0" causes the default implementation of :func:`sys.breakpointhook` to do nothing but return immediately.
fr: Si elle est définie, elle fait référence à un appelable en utilisant la notation des chemins délimités par des points. Le module contenant l'appelable est importé et l'appelable est alors lancé par l'implémentation par défaut de :func:`sys.breakpointhook`, elle-même étant appelée par la fonction native :func:`breakpoint`. Si elle n'est pas définie ou définie par une chaîne vide, elle vaut la même chose que `pdb.set_trace`. La définir à la chaîne "0" entraine que l'implémentation par défaut de :func:`sys.breakpointhook` ne fait rien et s'interrompt immédiatement.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-d` option. If set to an integer, it is equivalent to specifying :option:`-d` multiple times.
fr: Si elle est définie à une chaîne non vide, c'est équivalent à spécifier l'option :option:`-d`. Si elle est définie à un entier, c'est équivalent à spécifier l'option :option:`-d` plusieurs fois.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-i` option.
fr: Si elle est définie à une chaîne non vide, c'est équivalent à spécifier l'option :option:`-i`.

source: This variable can also be modified by Python code using :data:`os.environ` to force inspect mode on program termination.
fr: Cette variable peut aussi être modifiée par du code Python en utilisant :data:`os.environ` pour forcer le mode introspectif à la fin du programme.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-u` option.
fr: Si elle est définie à une chaîne non vide, c'est équivalent à spécifier l'option :option:`-u`.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-v` option. If set to an integer, it is equivalent to specifying :option:`-v` multiple times.
fr: Si elle est définie à une chaîne non vide, c'est équivalent à spécifier l'option :option:`-v`. Si elle est définie à un entier, c'est équivalent à spécifier l'option :option:`-v` plusieurs fois.

source: If this is set, Python ignores case in :keyword:`import` statements. This only works on Windows and OS X.
fr: Si elle est définie, Python ignore la casse dans les instructions :keyword:`import`. Ceci ne fonctionne que sous Windows et OS X.

source: If this is set to a non-empty string, Python won't try to write ``.pyc`` files on the import of source modules. This is equivalent to specifying the :option:`-B` option.
fr: Si elle est définie et n'est pas une chaîne vide, Python n'écrit pas de fichier ``.pyc`` à l'importation des modules sources. C'est équivalent à spécifier l'option :option:`-B`.

source: If this is set, Python will write ``.pyc`` files in a mirror directory tree at this path, instead of in ``__pycache__`` directories within the source tree. This is equivalent to specifying the :option:`-X` ``pycache_prefix=PATH`` option.
fr: Si elle est définie, Python n'écrit pas ses fichiers ``.pyc`` dans ``__pycache__`` mais dans une arborescence miroir à ce chemin. C'est l'équivalent de l'option :option:`-X` ``pycache_prefix=PATH``.

source: If this variable is not set or set to ``random``, a random value is used to seed the hashes of str and bytes objects.
fr: Si cette variable n'est pas définie ou définie à ``random``, une valeur aléatoire est utilisée pour saler les empreintes des objets ``str`` et ``bytes``.

source: If :envvar:`PYTHONHASHSEED` is set to an integer value, it is used as a fixed seed for generating the hash() of the types covered by the hash randomization.
fr: Si :envvar:`PYTHONHASHSEED` est définie à une valeur entière, elle est utilisée comme valeur de salage pour générer les empreintes des types utilisant l'imprévisibilité du hachage.

source: Its purpose is to allow repeatable hashing, such as for selftests for the interpreter itself, or to allow a cluster of python processes to share hash values.
fr: L'objectif est d'avoir des empreintes reproductibles, pour des tests de l'interpréteur lui-même ou pour qu'un groupe de processus Python puisse partager des empreintes.

source: The integer must be a decimal number in the range [0,4294967295]. Specifying the value 0 will disable hash randomization.
fr: Le nombre entier doit être écrit en base 10 et être compris entre 0 et 4 294 967 295. Spécifier la valeur 0 désactive l'imprévisibilité des empreintes.

source: If this is set before running the interpreter, it overrides the encoding used for stdin/stdout/stderr, in the syntax ``encodingname:errorhandler``. Both the ``encodingname`` and the ``:errorhandler`` parts are optional and have the same meaning as in :func:`str.encode`.
fr: Si la variable est définie sous la forme ``nom_encodage:gestionnaire_erreur`` avant le lancement de l'interpréteur, cela prend le pas sur l'encodage utilisé pour l'entrée standard, la sortie standard ou la sortie d'erreur. ``nom_encodage`` et ``:gestionnaire_erreur`` sont facultatifs tous les deux et possèdent la même signification que dans :func:`str.encode`.

source: For stderr, the ``:errorhandler`` part is ignored; the handler will always be ``'backslashreplace'``.
fr: Pour la sortie d'erreur, la partie ``:gestionnaire_erreur`` est ignorée : le gestionnaire est toujours ``'backslashreplace'``.

source: The ``encodingname`` part is now optional.
fr: La partie ``nom_encodage`` est maintenant optionnelle.

source: On Windows, the encoding specified by this variable is ignored for interactive console buffers unless :envvar:`PYTHONLEGACYWINDOWSSTDIO` is also specified. Files and pipes redirected through the standard streams are not affected.
fr: Sous Windows, l'encodage spécifié par cette variable est ignoré pour le tampon des consoles interactives à moins que :envvar:`PYTHONLEGACYWINDOWSSTDIO` ne soit aussi spécifié. Les fichiers et tubes (*pipes* en anglais) redirigés vers les flux standards ne sont pas concernés.

source: If this is set, Python won't add the :data:`user site-packages directory <site.USER_SITE>` to :data:`sys.path`.
fr: Si elle est définie, Python n'ajoute pas le répertoire :data:`site-packages propre à l'utilisateur <site.USER_SITE>` à :data:`sys.path`.

source: Defines the :data:`user base directory <site.USER_BASE>`, which is used to compute the path of the :data:`user site-packages directory <site.USER_SITE>` and :ref:`Distutils installation paths <inst-alt-install-user>` for ``python setup.py install --user``.
fr: Définit le répertoire :data:`base utilisateur <site.USER_BASE>`. Celui-ci est utilisé pour déterminer le chemin du :data:`répertoire site-packages propre à l'utilisateur <site.USER_SITE>` et des :ref:`schémas d'installation de Distutils <inst-alt-install-user>` pour ``python setup.py install --user``.

source: If this environment variable is set, ``sys.argv[0]`` will be set to its value instead of the value got through the C runtime. Only works on Mac OS X.
fr: Si cette variable d'environnement est définie, ``sys.argv[0]`` est définie à cette valeur au lieu de la valeur fournie par l'exécutable. Ne fonctionne que sur Mac OS X.

source: This is equivalent to the :option:`-W` option. If set to a comma separated string, it is equivalent to specifying :option:`-W` multiple times, with filters later in the list taking precedence over those earlier in the list.
fr: C'est équivalent à spécifier l'option :option:`-W`. Si la valeur est une chaîne séparée par des virgules, c'est équivalent à spécifier l'option :option:`-W` plusieurs fois. Dans ce cas, les filtres spécifiés en derniers prennent le pas sur ceux qui les précèdent dans la liste.

source: If this environment variable is set to a non-empty string, :func:`faulthandler.enable` is called at startup: install a handler for :const:`SIGSEGV`, :const:`SIGFPE`, :const:`SIGABRT`, :const:`SIGBUS` and :const:`SIGILL` signals to dump the Python traceback. This is equivalent to :option:`-X` ``faulthandler`` option.
fr: Si elle est définie à une chaîne non vide, :func:`faulthandler.enable` est appelée au démarrage : ceci installe un gestionnaire pour les signaux :const:`SIGSEGV`, :const:`SIGFPE`, :const:`SIGABRT`, :const:`SIGBUS` et :const:`SIGILL` afin de générer une trace de la pile d'appels. C'est équivalent à spécifier l'option :option:`-X` ``faulthandler``.
