Repository: python/python-docs-fr
Catalog: using/cmdline.po
Languages: fr

source: If this environment variable is set to a non-empty string, start tracing Python memory allocations using the :mod:`tracemalloc` module. The value of the variable is the maximum number of frames stored in a traceback of a trace. For example, ``PYTHONTRACEMALLOC=1`` stores only the most recent frame. See the :func:`tracemalloc.start` for more information.
fr: Si elle est définie à une chaîne non vide, lance le suivi des allocations mémoire par Python en utilisant le module :mod:`tracemalloc`. La valeur de la variable définit le nombre maximum d'appels (les *frames* en anglais) stockés dans la trace de pile d'appels. Par exemple, ``PYTHONTRACEMALLOC=1`` ne stocke que l'appel le plus récent. Voir :func:`tracemalloc.start` pour davantage d'informations.

source: If this environment variable is set to a non-empty string, Python will show how long each import takes. This is exactly equivalent to setting ``-X importtime`` on the command line.
fr: Si elle est définie et n'est pas une chaîne vide, Python affiche le temps pris par les importations. C'est exactement équivalent à donner ``-X importtime`` en ligne de commande.

source: If this environment variable is set to a non-empty string, enable the :ref:`debug mode <asyncio-debug-mode>` of the :mod:`asyncio` module.
fr: Si elle est définie à une chaîne non vide, active le :ref:`mode debogage <asyncio-debug-mode>` du module :mod:`asyncio`.

source: Set the Python memory allocators and/or install debug hooks.
fr: Définit l'allocateur mémoire de Python ou installe des points d'entrée (*hooks* en anglais) de débogage.

source: Set the family of memory allocators used by Python:
fr: Définit la famille d'allocateurs mémoire utilisés par Python :

source: ``default``: use the :ref:`default memory allocators <default-memory-allocators>`.
fr: ``default``: utilise les :ref:`allocateurs de mémoire par défaut <default-memory-allocators>`.

source: ``malloc``: use the :c:func:`malloc` function of the C library for all domains (:c:data:`PYMEM_DOMAIN_RAW`, :c:data:`PYMEM_DOMAIN_MEM`, :c:data:`PYMEM_DOMAIN_OBJ`).
fr: ``malloc`` : utilise la fonction :c:func:`malloc` de la bibliothèque C standard pour tous les domaines (:c:data:`PYMEM_DOMAIN_RAW`, :c:data:`PYMEM_DOMAIN_MEM`, :c:data:`PYMEM_DOMAIN_OBJ`).

source: ``pymalloc``: use the :ref:`pymalloc allocator <pymalloc>` for :c:data:`PYMEM_DOMAIN_MEM` and :c:data:`PYMEM_DOMAIN_OBJ` domains and use the :c:func:`malloc` function for the :c:data:`PYMEM_DOMAIN_RAW` domain.
fr: ``pymalloc`` : utilise l’:ref:`allocateur pymalloc <pymalloc>` pour les domaines :c:data:`PYMEM_DOMAIN_MEM` ainsi que :c:data:`PYMEM_DOMAIN_OBJ` et utilise la fonction :c:func:`malloc` pour le domaine :c:data:`PYMEM_DOMAIN_RAW`.

source: Install debug hooks:
fr: Installe des points d'entrée de débogage :

source: ``debug``: install debug hooks on top of the :ref:`default memory allocators <default-memory-allocators>`.
fr: ``debug`` : installe des points d'entrée de débogage pour :ref:`l'allocateur de mémoire par défaut <default-memory-allocators>`.

source: ``malloc_debug``: same as ``malloc`` but also install debug hooks.
fr: ``malloc_debug``: identique à ``malloc`` mais installe aussi des points d'entrée de débogage

source: ``pymalloc_debug``: same as ``pymalloc`` but also install debug hooks.
fr: ``pymalloc_debug``: identique à ``pymalloc`` mais installe aussi des points d'entrée de débogage

source: See the :ref:`default memory allocators <default-memory-allocators>` and the :c:func:`PyMem_SetupDebugHooks` function (install debug hooks on Python memory allocators).
fr: Reportez-vous au chapitre :ref:`default-memory-allocators` et à la fonction :c:func:`PyMem_SetupDebugHooks` (configure des points d'entrée de débogage sur les allocateurs de mémoire de Python).

source: Added the ``"default"`` allocator.
fr: L'allocateur ``default`` a été ajouté.

source: If set to a non-empty string, Python will print statistics of the :ref:`pymalloc memory allocator <pymalloc>` every time a new pymalloc object arena is created, and on shutdown.
fr: Si elle est définie à une chaîne non vide, Python affiche des statistiques relatives à l’:ref:`allocateur mémoire pymalloc <pymalloc>` chaque fois qu'un objet est créé par ce gestionnaire, ainsi qu'à la fin de l'exécution du programme.

source: This variable is ignored if the :envvar:`PYTHONMALLOC` environment variable is used to force the :c:func:`malloc` allocator of the C library, or if Python is configured without ``pymalloc`` support.
fr: Cette variable est ignorée si la variable d'environnement :envvar:`PYTHONMALLOC` est utilisée pour forcer l'allocateur :c:func:`malloc` de la bibliothèque C standard ou si Python est configuré sans le support de ``pymalloc``.

source: This variable can now also be used on Python compiled in release mode. It now has no effect if set to an empty string.
fr: Cette variable peut maintenant être utilisée avec Python compilé en mode *release*. Elle n'a pas d'effet si elle est définie à une chaine vide.

source: If set to a non-empty string, the default filesystem encoding and errors mode will revert to their pre-3.6 values of 'mbcs' and 'replace', respectively. Otherwise, the new defaults 'utf-8' and 'surrogatepass' are used.
fr: Si elle est définie et n’est pas une chaîne vide, l'encodage par défaut respectivement du système de fichiers et des erreurs reviennent à leur valeur pré-3.6, respectivement ``'mbcs'`` et ``'replace'``. Sinon, les nouvelles valeurs par défaut ``"UTF-8"`` et ``"surrogatepass"`` sont utilisées.

source: This may also be enabled at runtime with :func:`sys._enablelegacywindowsfsencoding()`.
fr: Vous pouvez aussi activer ceci à l'exécution avec :func:`sys._enablelegacywindowsfsencoding()`.

source: :ref:`Availability <availability>`: Windows.
fr: :ref:`Disponibilité <availability>` : Windows.

source: See :pep:`529` for more details.
fr: Voir la :pep:`529` pour plus d'informations.

source: If set to a non-empty string, does not use the new console reader and writer. This means that Unicode characters will be encoded according to the active console code page, rather than using utf-8.
fr: Si elle est définie et n’est pas une chaîne vide, n'utilise pas les lecteur et écrivain de la nouvelle console. Cela signifie que les caractères Unicode sont encodés avec l'encodage de la console active plutôt qu'en UTF-8.

source: This variable is ignored if the standard streams are redirected (to files or pipes) rather than referring to console buffers.
fr: Cette variable est ignorée si les flux standards sont redirigés (vers des fichiers ou des tubes) plutôt que pointant vers des mémoires tampons de console.

source: If set to the value ``0``, causes the main Python command line application to skip coercing the legacy ASCII-based C and POSIX locales to a more capable UTF-8 based alternative.
fr: Si elle est définie à la valeur ``0``, l'application en ligne de commande principale Python ne prend pas en compte les configurations régionales C et POSIX à base ASCII, mais bascule sur une alternative basée sur l'UTF-8 qui doit posséder plus de possibilités.

source: If this variable is *not* set (or is set to a value other than ``0``), the ``LC_ALL`` locale override environment variable is also not set, and the current locale reported for the ``LC_CTYPE`` category is either the default ``C`` locale, or else the explicitly ASCII-based ``POSIX`` locale, then the Python CLI will attempt to configure the following locales for the ``LC_CTYPE`` category in the order listed before loading the interpreter runtime:
fr: Si cette variable n'est pas définie (ou est définie à une valeur autre que ``0``), que la variable d'environnement de configuration régionale ``LC_ALL`` est également non définie et que la configuration régionale indiquée dans la catégorie ``LC_TYPE`` est soit la région par défaut ``C``, soit la région ``POSIX`` qui demande explicitement de l'ASCII, alors l'interpréteur en ligne de commande Python essaie de configurer les paramètres régionaux pour la catégorie ``LC_TYPE`` dans l'ordre suivant avant de charger l'exécutable de l'interpréteur :

source: If setting one of these locale categories succeeds, then the ``LC_CTYPE`` environment variable will also be set accordingly in the current process environment before the Python runtime is initialized. This ensures that in addition to being seen by both the interpreter itself and other locale-aware components running in the same process (such as the GNU ``readline`` library), the updated setting is also seen in subprocesses (regardless of whether or not those processes are running a Python interpreter), as well as in operations that query the environment rather than the current C locale (such as Python's own :func:`locale.getdefaultlocale`).
fr: Si la définition d'une des configurations régionales fonctionne, la variable d'environnement ``LC_TYPE`` est aussi définie ainsi dans l'environnement du processus avant que l'exécutable Python ne soit initialisé. Ceci assure que, en plus d'être vue par l'interpréteur lui-même et tous les autres composants prenant en charge la configuration régionale dans le même processus (telle que la bibliothèque GNU ``readline``), la configuration mise à jour est aussi valable pour les sous-processus (indépendamment du fait qu'ils utilisent un interpréteur Python ou non) ainsi que pour les opérations qui font appel à l'environnement (qui utiliseraient sinon la configuration régionale C courante, tel que c'est le cas pour la propre fonction Python :func:`locale.getdefaultlocale`).

source: Configuring one of these locales (either explicitly or via the above implicit locale coercion) automatically enables the ``surrogateescape`` :ref:`error handler <error-handlers>` for :data:`sys.stdin` and :data:`sys.stdout` (:data:`sys.stderr` continues to use ``backslashreplace`` as it does in any other locale). This stream handling behavior can be overridden using :envvar:`PYTHONIOENCODING` as usual.
fr: La configuration d'une de ces variables régionales (soit explicitement, soit *via* le mécanisme décrit ci-dessus) active automatiquement ``surrogateescape`` pour la :ref:`gestion des erreurs <error-handlers>` de :data:`sys.stdin` et :data:`sys.stdout` (:data:`sys.stderr` continue d'utiliser ``backslashreplace`` comme pour toute autre configuration régionale). Ce comportement relatif à la gestion des flux standards peut être surchargé, comme d'habitude, par :envvar:`PYTHONIOENCODING`.

source: For debugging purposes, setting ``PYTHONCOERCECLOCALE=warn`` will cause Python to emit warning messages on ``stderr`` if either the locale coercion activates, or else if a locale that *would* have triggered coercion is still active when the Python runtime is initialized.
fr: À fin de débogage, définir ``PYTHONCOERCECLOCALE=warn`` indique à Python d'émettre les messages d'avertissement sur ``stderr`` si la configuration régionale est activée, ou si une configuration régionale qui *aurait* activé est toujours active quand l'interpréteur Python est initialisé.

source: Also note that even when locale coercion is disabled, or when it fails to find a suitable target locale, :envvar:`PYTHONUTF8` will still activate by default in legacy ASCII-based locales. Both features must be disabled in order to force the interpreter to use ``ASCII`` instead of ``UTF-8`` for system interfaces.
fr: Notez également que même si la contrainte sur la configuration régionale est désactivée, ou si elle ne trouve pas une configuration satisfaisante et échoue, :envvar:`PYTHONUTF8` s'active par défaut avec une configuration régionale par défaut à base ASCII. Ces fonctionnalités doivent être désactivées pour forcer l'interpréteur à utiliser ``ASCII`` en lieu et place de ``UTF-8`` pour les interfaces avec le système.

source: :ref:`Availability <availability>`: \*nix.
fr: :ref:`Disponibilité <availability>` : systèmes de type UNIX.

source: See :pep:`538` for more details.
fr: Voir la :pep:`538` pour plus d'informations.

source: If this environment variable is set to a non-empty string, enable the CPython "development mode". See the :option:`-X` ``dev`` option.
fr: Si cette variable d'environnement est définie et non vide, active le "mode développeur" de CPython. Voir l'option :option:`-X` ``dev``.

source: If set to ``1``, enables the interpreter's UTF-8 mode, where ``UTF-8`` is used as the text encoding for system interfaces, regardless of the current locale setting.
fr: Si elle vaut ``1``, active le mode UTF-8 pour l'interpréteur, où ``UTF-8`` est utilisé pour encoder le texte en interface avec le système, quelle que soit la configuration régionale en vigueur.

source: This means that:
fr: Ce qui signifie que :

source: :func:`sys.getfilesystemencoding()` returns ``'UTF-8'`` (the locale encoding is ignored).
fr: :func:`sys.getfilesystemencoding()` renvoie ``'UTF-8'`` (l'encodage défini par la configuration régionale est ignoré).

source: :func:`locale.getpreferredencoding()` returns ``'UTF-8'`` (the locale encoding is ignored, and the function's ``do_setlocale`` parameter has no effect).
fr: :func:`locale.getpreferredencoding()` renvoie ``'UTF-8'`` (l'encodage défini par la configuration régionale est ignoré et le paramètre ``do_setlocale`` de la fonction n'a aucun effet).

source: :data:`sys.stdin`, :data:`sys.stdout`, and :data:`sys.stderr` all use UTF-8 as their text encoding, with the ``surrogateescape`` :ref:`error handler <error-handlers>` being enabled for :data:`sys.stdin` and :data:`sys.stdout` (:data:`sys.stderr` continues to use ``backslashreplace`` as it does in the default locale-aware mode)
fr: :data:`sys.stdin`, :data:`sys.stdout` et :data:`sys.stderr` utilisent tous l'UTF-8 pour l'encodage du texte, avec le :ref:`gestionnaire d'erreurs <error-handlers>` ``surrogateescape`` activé pour :data:`sys.stdin` et :data:`sys.stdout` (:data:`sys.stderr` continue d'utiliser ``backslashreplace`` comme pour le mode par défaut où il prend en compte la configuration régionale).

source: As a consequence of the changes in those lower level APIs, other higher level APIs also exhibit different default behaviours:
fr: En raison des changements apportés à ces API de bas-niveau, les API de haut-niveau ont un comportement par défaut différent :

source: Command line arguments, environment variables and filenames are decoded to text using the UTF-8 encoding.
fr: Les arguments en ligne de commande, les variables d'environnement et les noms de fichiers sont décodés en texte en utilisant l'UTF-8.

source: :func:`os.fsdecode()` and :func:`os.fsencode()` use the UTF-8 encoding.
fr: :func:`os.fsdecode()` et :func:`os.fsencode()` utilisent l'encodage UTF-8.

source: :func:`open()`, :func:`io.open()`, and :func:`codecs.open()` use the UTF-8 encoding by default. However, they still use the strict error handler by default so that attempting to open a binary file in text mode is likely to raise an exception rather than producing nonsense data.
fr: :func:`open()`, :func:`io.open()` et :func:`codecs.open()` utilisent l'encodage UTF-8 par défaut. Cependant, elles utilisent le gestionnaire d'erreurs "strict" par défaut, de manière à ce qu'ouvrir un fichier binaire en mode texte lève une exception plutôt que de produire de la donnée sans aucun sens.

source: Note that the standard stream settings in UTF-8 mode can be overridden by :envvar:`PYTHONIOENCODING` (just as they can be in the default locale-aware mode).
fr: Notez que la configuration des flux standards en mode UTF-8 peut être surchargée par :envvar:`PYTHONIOENCODING` (de la même manière qu'elles peuvent l'être dans le mode par défaut qui est configuré pour la région locale).

source: If set to ``0``, the interpreter runs in its default locale-aware mode.
fr: Si elle vaut ``0``, l'interpréteur fonctionne dans le mode configuré pour la région locale (mode par défaut).

source: Setting any other non-empty string causes an error during interpreter initialisation.
fr: Définir une valeur autre (non vide) entraine une erreur pendant l'initialisation de l'interpréteur.

source: If this environment variable is not set at all, then the interpreter defaults to using the current locale settings, *unless* the current locale is identified as a legacy ASCII-based locale (as described for :envvar:`PYTHONCOERCECLOCALE`), and locale coercion is either disabled or fails. In such legacy locales, the interpreter will default to enabling UTF-8 mode unless explicitly instructed not to do so.
fr: Si cette variable d'environnement n'est pas définie, l'interpréteur se configure pour utiliser la configuration régionale en cours, *à moins que* cette configuration régionale ne soit identifiée comme ASCII (comme décrit pour :envvar:`PYTHONCOERCECLOCALE`), et que soit la contrainte est désactivée, soit elle échoue. Dans cette configuration régionale, l'interpréteur active par défaut le mode UTF-8 à moins que vous n'indiquiez explicitement de ne pas le faire.

source: Also available as the :option:`-X` ``utf8`` option.
fr: Également disponible en tant qu'option :option:`-X` ``utf8``.

source: See :pep:`540` for more details.
fr: Voir la :pep:`540` pour plus d'informations.

source: Debug-mode variables
fr: Variables en mode débogage

source: Setting these variables only has an effect in a debug build of Python.
fr: Définir ces variables n'a d'effet que si Python a été compilé en mode débogage.

source: If set, Python will print threading debug info.
fr: Si elle est définie, Python affiche des informations de débogage relatives aux différents fils d'exécution.

source: Need Python configured with the ``--with-pydebug`` build option.
fr: Nécessite que Python soit configuré avec l'option de compilation ``--with-pydebug``.

source: If set, Python will dump objects and reference counts still alive after shutting down the interpreter.
fr: Si elle est définie, Python affiche (de manière brute) les objets et les compteurs de références toujours existant après la fermeture de l'interpréteur.

source: Need Python configured with the ``--with-trace-refs`` build option.
fr: Nécessite que Python soit configuré avec l'option de compilation ``--with-trace-refs``.
