Repository: python/python-docs-fr
Catalog: using/cmdline.po
Languages: fr

source: Command line and environment
fr: Ligne de commande et environnement

source: The CPython interpreter scans the command line and the environment for various settings.
fr: L'interpréteur CPython analyse la ligne de commande et l'environnement à la recherche de différents paramètres.

source: Other implementations' command line schemes may differ. See :ref:`implementations` for further resources.
fr: Le format des lignes de commande utilisé par d'autres implémentations peut s'avérer différent. Voir :ref:`implementations` pour plus d'informations.

source: Command line
fr: Ligne de commande

source: When invoking Python, you may specify any of these options::
fr: Quand vous invoquez Python, vous pouvez spécifier n’importe laquelle de ces options ::

source: The most common use case is, of course, a simple invocation of a script::
fr: Le cas d'utilisation le plus courant est, bien entendu, la simple invocation d'un script ::

source: Interface options
fr: Options de l'interface

source: The interpreter interface resembles that of the UNIX shell, but provides some additional methods of invocation:
fr: L'interface de l’interpréteur ressemble à celle du shell UNIX mais fournit quelques méthodes d'invocation supplémentaires :

source: When called with standard input connected to a tty device, it prompts for commands and executes them until an EOF (an end-of-file character, you can produce that with :kbd:`Ctrl-D` on UNIX or :kbd:`Ctrl-Z, Enter` on Windows) is read.
fr: Quand l'interpréteur est appelé avec l'entrée standard connectée à un périphérique tty, il lit les lignes de commande et les exécute jusqu'à ce qu'un caractère EOF (caractère fin de fichier, que vous pouvez produire avec :kbd:`Ctrl-D` sous UNIX ou :kbd:`Ctrl-Z, Enter` sous Windows) soit lu.

source: When called with a file name argument or with a file as standard input, it reads and executes a script from that file.
fr: Quand l'interpréteur est appelé avec un argument correspondant à un nom de fichier ou avec un fichier comme entrée standard, il lit et exécute le script contenu dans ce fichier.

source: When called with a directory name argument, it reads and executes an appropriately named script from that directory.
fr: Quand l'interpréteur est appelé avec un argument correspondant à un répertoire, il lit et exécute un script d’un certain nom dans ce répertoire.

source: When called with ``-c command``, it executes the Python statement(s) given as *command*. Here *command* may contain multiple statements separated by newlines. Leading whitespace is significant in Python statements!
fr: Quand l'interpréteur est appelé avec l'option ``-c commande``, il exécute la ou les instructions Python données comme *commande*. Ici *commande* peut contenir plusieurs instructions séparées par des fins de ligne. Les blancs en début de ligne ne sont pas ignorés dans les instructions Python !

source: When called with ``-m module-name``, the given module is located on the Python module path and executed as a script.
fr: Quand l'interpréteur est appelé avec l'option ``-m nom-de-module``, le module donné est recherché dans le chemin des modules Python et est exécuté en tant que script.

source: In non-interactive mode, the entire input is parsed before it is executed.
fr: En mode non-interactif, toute l’entrée est analysée avant d’être exécutée.

source: An interface option terminates the list of options consumed by the interpreter, all consecutive arguments will end up in :data:`sys.argv` -- note that the first element, subscript zero (``sys.argv[0]``), is a string reflecting the program's source.
fr: Une option d'interface termine la liste des options consommées par l'interpréteur ; tous les arguments atterrissent dans :data:`sys.argv` — notez que le premier élément, à l'indice zéro (``sys.argv|0]``), est une chaîne de caractères indiquant la source du programme.

source: Execute the Python code in *command*. *command* can be one or more statements separated by newlines, with significant leading whitespace as in normal module code.
fr: Exécute le code Python dans *command*. *command* peut être une ou plusieurs instructions, séparées par des fins de ligne, dont les espaces en début de ligne sont significatives, comme dans le code d’un module.

source: If this option is given, the first element of :data:`sys.argv` will be ``"-c"`` and the current directory will be added to the start of :data:`sys.path` (allowing modules in that directory to be imported as top level modules).
fr: Si cette option est donnée, le premier élément de :data:`sys.argv` est ``"-c"`` et le répertoire courant est ajouté au début de :data:`sys.path` (permettant aux modules de ce répertoire d'être importés comme des modules de premier niveau).

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_command`` with argument ``command``.
fr: Lève un :ref:`évènement d'audit <auditing>` ``cpython.run_command`` avec comme argument ``command``.

source: Search :data:`sys.path` for the named module and execute its contents as the :mod:`__main__` module.
fr: Parcourt :data:`sys.path` à la recherche du module donné et exécute son contenu en tant que module :mod:`__main__`.

source: Since the argument is a *module* name, you must not give a file extension (``.py``). The module name should be a valid absolute Python module name, but the implementation may not always enforce this (e.g. it may allow you to use a name that includes a hyphen).
fr: L'argument étant un nom de *module*, vous ne devez pas fournir d’extension de fichier (``.py``). Le nom du module doit être un nom de module Python valide, absolu, mais l'implémentation peut ne pas l'imposer (par exemple, l'utilisation d'un trait d'union peut être autorisée).

source: Package names (including namespace packages) are also permitted. When a package name is supplied instead of a normal module, the interpreter will execute ``<pkg>.__main__`` as the main module. This behaviour is deliberately similar to the handling of directories and zipfiles that are passed to the interpreter as the script argument.
fr: Les noms de paquets sont aussi autorisés (ainsi que les paquets-espace de nommage, *namespace packages* en anglais). Quand un nom de paquet est donné à la place d'un simple module, l'interpréteur exécute ``<pkg>.__main__`` comme module principal. Ce comportement est délibérément identique au traitement d'un dossier ou d'un fichier zip donné en argument à l'interpréteur comme script.

source: This option cannot be used with built-in modules and extension modules written in C, since they do not have Python module files. However, it can still be used for precompiled modules, even if the original source file is not available.
fr: Cette option ne peut pas être utilisée avec les modules natifs et les modules d'extension écrits en C, étant donné qu'ils ne possèdent pas de fichiers modules en Python. Cependant, elle peut toujours être utilisée pour les modules pré-compilés, même si le fichier source original n'est pas disponible.

source: If this option is given, the first element of :data:`sys.argv` will be the full path to the module file (while the module file is being located, the first element will be set to ``"-m"``). As with the :option:`-c` option, the current directory will be added to the start of :data:`sys.path`.
fr: Si cette option est donnée, le premier élément de :data:`sys.argv` est le chemin complet d'accès au fichier du module (pendant que le fichier est recherché, le premier élément est mis à ``"-m"``). Comme avec l'option :option:`-c`, le dossier courant est ajouté au début de :data:`sys.path`.

source: :option:`-I` option can be used to run the script in isolated mode where :data:`sys.path` contains neither the current directory nor the user's site-packages directory. All :envvar:`PYTHON*` environment variables are ignored, too.
fr: L'option :option:`-I` peut être utilisée pour exécuter le script en mode isolé où :data:`sys.path` ne contient ni le dossier courant, ni le dossier ``site-packages`` de l'utilisateur. Toutes les variables d'environnement :envvar:`PYTHON*` sont également ignorées.

source: Many standard library modules contain code that is invoked on their execution as a script. An example is the :mod:`timeit` module::
fr: De nombreux modules de la bibliothèque standard contiennent du code qui est invoqué quand ils sont exécutés comme scripts. Un exemple est le module :mod:`timeit`\ ::

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_module`` with argument ``module-name``.
fr: Lève un :ref:`évènement d'audit <auditing>` ``cpython.run_command`` avec comme argument ``module-name``.

source: Equivalent functionality directly available to Python code
fr: Fonctionnalité équivalente directement disponible en code Python

source: :pep:`338` -- Executing modules as scripts
fr: :pep:`338` -- Exécuter des modules en tant que scripts

source: Supply the package name to run a ``__main__`` submodule.
fr: Fournir le nom d'un paquet pour exécuter un sous-module ``__main__``.

source: namespace packages are also supported
fr: les paquets-espaces de nommage sont aussi gérés

source: Read commands from standard input (:data:`sys.stdin`). If standard input is a terminal, :option:`-i` is implied.
fr: Lit les commandes depuis l'entrée standard (:data:`sys.stdin`). Si l'entrée standard est un terminal, l'option :option:`-i` est activée implicitement.

source: If this option is given, the first element of :data:`sys.argv` will be ``"-"`` and the current directory will be added to the start of :data:`sys.path`.
fr: Si cette option est donnée, le premier élément de :data:`sys.argv` est ``"-"`` et le dossier courant est ajouté au début de :data:`sys.path`.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_stdin`` with no arguments.
fr: Lève un :ref:`évènement d'audit <auditing>` ``cpython.run_stdin`` sans argument.

source: Execute the Python code contained in *script*, which must be a filesystem path (absolute or relative) referring to either a Python file, a directory containing a ``__main__.py`` file, or a zipfile containing a ``__main__.py`` file.
fr: Exécute le code Python contenu dans *script*, qui doit être un chemin d'accès (absolu ou relatif) à un fichier, faisant référence à un fichier Python, à un répertoire contenant un fichier ``__main__.py`` ou à un fichier zip contenant un fichier ``__main__.py``.

source: If this option is given, the first element of :data:`sys.argv` will be the script name as given on the command line.
fr: Si cette option est donnée, le premier élément de :data:`sys.argv` est le nom du script tel que donné sur la ligne de commande.

source: If the script name refers directly to a Python file, the directory containing that file is added to the start of :data:`sys.path`, and the file is executed as the :mod:`__main__` module.
fr: Si le nom du script se réfère directement à un fichier Python, le répertoire contenant ce fichier est ajouté au début de :data:`sys.path` et le fichier est exécuté en tant que module :mod:`__main__`.

source: If the script name refers to a directory or zipfile, the script name is added to the start of :data:`sys.path` and the ``__main__.py`` file in that location is executed as the :mod:`__main__` module.
fr: Si le nom du script fait référence à un dossier ou à un fichier zip, le nom du script est ajouté au début de :data:`sys.path` et le fichier ``__main__.py`` à cet endroit est exécuté en tant que module :mod:`__main__`.

source: :option:`-I` option can be used to run the script in isolated mode where :data:`sys.path` contains neither the script's directory nor the user's site-packages directory. All :envvar:`PYTHON*` environment variables are ignored, too.
fr: L'option :option:`-I` peut être utilisée pour lancer le script en mode isolé où :data:`sys.path` ne contient ni le dossier du script, ni le dossier ``site-packages`` de l'utilisateur. Toutes les variables d'environnement :envvar:`PYTHON*` sont aussi ignorées.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_file`` with argument ``filename``.
fr: Lève un :ref:`évènement d'audit <auditing>` ``cpython.run_file`` avec comme argument ``filename``.

source: If no interface option is given, :option:`-i` is implied, ``sys.argv[0]`` is an empty string (``""``) and the current directory will be added to the start of :data:`sys.path`. Also, tab-completion and history editing is automatically enabled, if available on your platform (see :ref:`rlcompleter-config`).
fr: Si aucune option d'interface n'est donnée, l'option :option:`-i` est activée implicitement, ``sys.argv[0]`` est une chaine vide (``""``) et le dossier courant est ajouté au début de :data:`sys.path`. Aussi, la complétion par tabulation et l'édition de l'historique sont automatiquement activés, s'ils sont disponibles sur votre système (voir :ref:`rlcompleter-config`).

source: Automatic enabling of tab-completion and history editing.
fr: Activation automatique de la complétion par tabulation et édition de l'historique.

source: Generic options
fr: Options génériques

source: Print a short description of all command line options.
fr: Affiche une brève description de toutes les options de la ligne de commande.

source: Print the Python version number and exit. Example output could be:
fr: Affiche la version de Python et termine. Par exemple :

source: When given twice, print more information about the build, like:
fr: Lorsque l'option est doublée, affiche davantage d'informations sur la manière dont Python a été compilé, comme :

source: The ``-VV`` option.
fr: L'option ``-VV``.

source: Miscellaneous options
fr: Options diverses

source: Issue a warning when comparing :class:`bytes` or :class:`bytearray` with :class:`str` or :class:`bytes` with :class:`int`. Issue an error when the option is given twice (:option:`!-bb`).
fr: Affiche un avertissement (*warning* en anglais) lors d'une comparaison d'un objet de type :class:`bytes` ou :class:`bytearray` avec un objet de type :class:`str` ou un objet de type :class:`bytes` avec un objet de type :class:`int`. Lève une erreur si cette option est doublée (:option:`!-bb`).

source: Affects comparisons of :class:`bytes` with :class:`int`.
fr: Concerne les comparaisons de :class:`bytes` avec :class:`int`.

source: If given, Python won't try to write ``.pyc`` files on the import of source modules. See also :envvar:`PYTHONDONTWRITEBYTECODE`.
fr: S'il est donné, Python ne tente pas d'écrire de fichier ``.pyc`` ou ``.pyo`` à l'importation des modules sources. Voir aussi :envvar:`PYTHONDONTWRITEBYTECODE`.

source: Control the validation behavior of hash-based ``.pyc`` files. See :ref:`pyc-invalidation`. When set to ``default``, checked and unchecked hash-based bytecode cache files are validated according to their default semantics. When set to ``always``, all hash-based ``.pyc`` files, whether checked or unchecked, are validated against their corresponding source file. When set to ``never``, hash-based ``.pyc`` files are not validated against their corresponding source files.
fr: Contrôle la façon dont sont validés les fichiers ``.pyc`` avec empreinte (voir :ref:`pyc-invalidation`). Quand la valeur est ``default``, les caches de fichiers de code intermédiaire sont validés en fonction de leur sémantique par défaut. Quand la valeur est ``always``, tous les fichiers ``.pyc``, qu'ils soient vérifiés ou non, sont validés par rapport à leurs fichiers sources correspondants. Quand la valeur est ``never``, les fichiers ``.pyc`` ne sont pas validés par rapport à leurs fichiers sources correspondants.

source: The semantics of timestamp-based ``.pyc`` files are unaffected by this option.
fr: La sémantique des fichiers ``.pyc`` générés en fonction de l'horodatage n'est pas affectée par cette option.

source: Turn on parser debugging output (for expert only, depending on compilation options). See also :envvar:`PYTHONDEBUG`.
fr: Active la sortie de l'analyseur en mode débogage (pour les experts uniquement, en fonction des options de compilation). Voir aussi :envvar:`PYTHONDEBUG`.

source: Ignore all :envvar:`PYTHON*` environment variables, e.g. :envvar:`PYTHONPATH` and :envvar:`PYTHONHOME`, that might be set.
fr: Ignore toutes les variables d'environnement :envvar:`PYTHON*` qui pourraient être définies. Par exemple, :envvar:`PYTHONPATH` et :envvar:`PYTHONHOME`.

source: When a script is passed as first argument or the :option:`-c` option is used, enter interactive mode after executing the script or the command, even when :data:`sys.stdin` does not appear to be a terminal. The :envvar:`PYTHONSTARTUP` file is not read.
fr: Quand un script est passé comme premier argument ou que l'option :option:`-c` est utilisée, entre en mode interactif après avoir exécuté le script ou la commande, même lorsque :data:`sys.stdin` ne semble pas être un terminal. Le fichier :envvar:`PYTHONSTARTUP` n'est pas lu.

source: This can be useful to inspect global variables or a stack trace when a script raises an exception. See also :envvar:`PYTHONINSPECT`.
fr: Cela peut être utile pour examiner les variables globales ou une trace de la pile lorsque le script lève une exception. Voir aussi :envvar:`PYTHONINSPECT`.

source: Run Python in isolated mode. This also implies -E and -s. In isolated mode :data:`sys.path` contains neither the script's directory nor the user's site-packages directory. All :envvar:`PYTHON*` environment variables are ignored, too. Further restrictions may be imposed to prevent the user from injecting malicious code.
fr: Lance Python en mode isolé. Cela implique aussi *-E* et *-s*. En mode isolé, :data:`sys.path` ne contient ni le répertoire du script ni le répertoire *site-packages* de l'utilisateur. Toutes les variables d'environnement :envvar:`PYTHON*` sont aussi ignorées. Davantage de restrictions peuvent être imposées pour éviter que l'utilisateur n'injecte du code malicieux.

source: Remove assert statements and any code conditional on the value of :const:`__debug__`. Augment the filename for compiled (:term:`bytecode`) files by adding ``.opt-1`` before the ``.pyc`` extension (see :pep:`488`). See also :envvar:`PYTHONOPTIMIZE`.
fr: Enlève les instructions *assert* et tout le code qui dépend de la valeur de :const:`__debug__`. Ajoute ``.opt-1`` au nom de fichier du code intermédiaire (:term:`bytecode`), avant l'extension ``.pyc`` (voir la :pep:`488`). Voir aussi :envvar:`PYTHONOPTIMIZE`.

source: Modify ``.pyc`` filenames according to :pep:`488`.
fr: Modifie les noms de fichiers ``.pyc`` suivant la :pep:`488`.

source: Do :option:`-O` and also discard docstrings. Augment the filename for compiled (:term:`bytecode`) files by adding ``.opt-2`` before the ``.pyc`` extension (see :pep:`488`).
fr: Agit comme :option:`-O` et ignore aussi les *docstrings*. Ajoute ``.opt-2`` au nom de fichier du code intermédiaire (:term:`bytecode`), avant l'extension ``.pyc`` (voir la :pep:`488`).

source: Don't display the copyright and version messages even in interactive mode.
fr: N'affiche pas le copyright et la version, même en mode interactif.

source: Turn on hash randomization. This option only has an effect if the :envvar:`PYTHONHASHSEED` environment variable is set to ``0``, since hash randomization is enabled by default.
fr: Active l'imprévisibilité du hachage. Cette option ne produit un effet que si la variable d'environnement :envvar:`PYTHONHASHSEED` est mise à ``0``, puisque l'imprévisibilité du hachage est activée par défaut.

source: On previous versions of Python, this option turns on hash randomization, so that the :meth:`__hash__` values of str and bytes objects are "salted" with an unpredictable random value. Although they remain constant within an individual Python process, they are not predictable between repeated invocations of Python.
fr: Sur les versions précédentes de Python, cette option activait l'imprévisibilité des empreintes de manière à ce que les :meth:`__hash__` des *str* et des *bytes* soient « salés » avec une valeur aléatoire non prévisible. Bien que ce sel soit constant durant le déroulement d'un processus Python, il n'est pas prévisible pour des invocations répétées de code Python.

source: Hash randomization is intended to provide protection against a denial-of-service caused by carefully-chosen inputs that exploit the worst case performance of a dict construction, O(n^2) complexity. See http://www.ocert.org/advisories/ocert-2011-003.html for details.
fr: L'imprévisibilité des empreintes a pour objectif de se protéger contre les dénis de service qui utiliseraient des valeurs d'entrée judicieusement choisies afin de forcer la construction des dictionnaires dans le pire cas, c'est-à-dire avec une complexité en O(n\ :sup:`2`). Voir http://www.ocert.org/advisories/ocert-2011-003.html pour obtenir les détails.

source: :envvar:`PYTHONHASHSEED` allows you to set a fixed value for the hash seed secret.
fr: :envvar:`PYTHONHASHSEED` vous permet de définir vous-même la valeur du sel pour l'algorithme de calcul des empreintes.

source: The option is no longer ignored.
fr: Cette option n'est plus ignorée.

source: Don't add the :data:`user site-packages directory <site.USER_SITE>` to :data:`sys.path`.
fr: N'ajoute pas le répertoire utilisateur :data:`site-packages <site.USER_SITE>` à :data:`sys.path`.

source: :pep:`370` -- Per user site-packages directory
fr: :pep:`370` -- Répertoire site-packages propre à l'utilisateur

source: Disable the import of the module :mod:`site` and the site-dependent manipulations of :data:`sys.path` that it entails. Also disable these manipulations if :mod:`site` is explicitly imported later (call :func:`site.main` if you want them to be triggered).
fr: Désactive l’importation du module :mod:`site` et les modifications locales de :data:`sys.path` qu’il implique. Désactive aussi ces manipulations si :mod:`site` est importé explicitement plus tard (appelez :func:`site.main` si vous voulez les déclencher).

source: Force the stdout and stderr streams to be unbuffered. This option has no effect on the stdin stream.
fr: Force les flux de sortie et d'erreur standards à ne pas utiliser de tampon. Cette option n'a pas d'effet sur le flux d'entrée standard.

source: See also :envvar:`PYTHONUNBUFFERED`.
fr: Voir aussi :envvar:`PYTHONUNBUFFERED`.

source: The text layer of the stdout and stderr streams now is unbuffered.
fr: La couche texte des flux de sortie et d'erreur standards n'utilise maintenant plus de tampon.

source: Print a message each time a module is initialized, showing the place (filename or built-in module) from which it is loaded. When given twice (:option:`!-vv`), print a message for each file that is checked for when searching for a module. Also provides information on module cleanup at exit. See also :envvar:`PYTHONVERBOSE`.
fr: Affiche un message chaque fois qu'un module est initialisé, montrant l'emplacement (nom du fichier ou module natif) à partir duquel il est chargé. Lorsque l'option est doublée (:option:`!-vv`), affiche un message pour chaque fichier vérifié lors de la recherche du module. Fournit aussi des informations sur le nettoyage des modules à la fin. Voir aussi :envvar:`PYTHONVERBOSE`.

source: Warning control. Python's warning machinery by default prints warning messages to :data:`sys.stderr`. A typical warning message has the following form:
fr: Contrôle des avertissements. Le mécanisme d'avertissement de Python, par défaut, affiche les messages d'avertissement sur :data:`sys.stderr`. Un message d'avertissement type est de la forme suivante :

source: By default, each warning is printed once for each source line where it occurs. This option controls how often warnings are printed.
fr: Par défaut, chaque avertissement est affiché une seule fois pour chaque ligne de source où il se trouve. Cette option définit à quelle fréquence afficher ces avertissements.
