Repository: python/python-docs-fr
Catalog: using/mac.po
Languages: fr

source: Using Python on a Macintosh
fr: Utilisation de Python sur un Macintosh

source: Author
fr: Auteur

source: Python on a Macintosh running Mac OS X is in principle very similar to Python on any other Unix platform, but there are a number of additional features such as the IDE and the Package Manager that are worth pointing out.
fr: Python sur un Macintosh exécutant Mac OS X est en principe très similaire à Python sur n'importe quelle autre plateforme Unix, mais il y a un certain nombre de fonctionnalités additionnelle telle que l'IDE et le gestionnaire de paquets qui méritent d'être soulignées.

source: Getting and Installing MacPython
fr: Obtenir et installer MacPython

source: Mac OS X 10.8 comes with Python 2.7 pre-installed by Apple. If you wish, you are invited to install the most recent version of Python 3 from the Python website (https://www.python.org). A current "universal binary" build of Python, which runs natively on the Mac's new Intel and legacy PPC CPU's, is available there.
fr: Mac OS X 10.8 contient déjà Python 2.7 pré-installé par Apple. Si vous le souhaitez, vous êtes invités à installer la version la plus récente de Python 3 à partir du site de Python (https://www.python.org). Une version "binaire universelle" de Python, qui s'exécute nativement sur les nouveaux processeurs Intel de Mac et les processeurs PPC, CPUs hérités de Mac, y est disponible.

source: What you get after installing is a number of things:
fr: Vous obtiendrez un certain nombre de choses après installation:

source: A :file:`MacPython 3.6` folder in your :file:`Applications` folder. In here you find IDLE, the development environment that is a standard part of official Python distributions; PythonLauncher, which handles double-clicking Python scripts from the Finder; and the "Build Applet" tool, which allows you to package Python scripts as standalone applications on your system.
fr: Un dossier :file:`MacPython 3.6` dans votre dossier :file:`Applications`. Dedans vous trouverez **IDLE**, l'environnement de développement qui fait partie des distributions Python officielles ; **PythonLauncher**, qui gère le lancement de scripts Python depuis le ``Finder`` ; et l'outil **"Build Applet"**, qui permets d'empaqueter des scripts Python en tant qu'applications à part entière sur votre système.

source: A framework :file:`/Library/Frameworks/Python.framework`, which includes the Python executable and libraries. The installer adds this location to your shell path. To uninstall MacPython, you can simply remove these three things. A symlink to the Python executable is placed in /usr/local/bin/.
fr: Un **framework** :file:`/Library/Frameworks/Python.framework`, qui inclut l’exécutable Python et ses bibliothèques. L’installateur ajoute ce chemin à votre **PATH**. Pour désinstaller MacPython, vous pouvez simplement supprimer ces trois choses. Un lien symbolique vers l'exécutable Python est placé dans ``/usr/local/bin/``.

source: The Apple-provided build of Python is installed in :file:`/System/Library/Frameworks/Python.framework` and :file:`/usr/bin/python`, respectively. You should never modify or delete these, as they are Apple-controlled and are used by Apple- or third-party software. Remember that if you choose to install a newer Python version from python.org, you will have two different but functional Python installations on your computer, so it will be important that your paths and usages are consistent with what you want to do.
fr: Le **build** Python fourni par Apple est installé dans :file:`/System/Library/Frameworks/Python.framework` et :file:`/usr/bin/python`. Vous ne devriez jamais les modifier ou supprimer, car ils sont contrôlés et utilisés par Apple (ou d'autres logiciels). Rappelez vous que si vous choisissez d'installer un Python plus récent depuis python.org, vous aurez deux installations de Python différentes et fonctionnelles sur votre ordinateur, il est donc important que vos chemins et utilisations soit cohérentes avec ce que vous voulez faire.

source: IDLE includes a help menu that allows you to access Python documentation. If you are completely new to Python you should start reading the tutorial introduction in that document.
fr: **IDLE** inclut un menu d'aide qui vous permet d’accéder à la documentation Python. Si vous êtes entièrement novice, vous devriez commencer par lire le tutoriel d'introduction dans ce document.

source: If you are familiar with Python on other Unix platforms you should read the section on running Python scripts from the Unix shell.
fr: Si vous êtes familier avec Python sur d'autres plateformes Unix, vous devriez lire la section sur comment exécuter des scripts Python depuis un shell Unix.

source: How to run a Python script
fr: Comment exécuter un script Python

source: Your best way to get started with Python on Mac OS X is through the IDLE integrated development environment, see section :ref:`ide` and use the Help menu when the IDE is running.
fr: Le meilleur moyen de démarrer avec Python sur Max OS X est d'utiliser l'environnement de développement intégré **IDLE**, voir la section :ref:`ide` et utilisez le menu d'aide (**Help**) quand l'``IDE`` est lancé.

source: If you want to run Python scripts from the Terminal window command line or from the Finder you first need an editor to create your script. Mac OS X comes with a number of standard Unix command line editors, :program:`vim` and :program:`emacs` among them. If you want a more Mac-like editor, :program:`BBEdit` or :program:`TextWrangler` from Bare Bones Software (see http://www.barebones.com/products/bbedit/index.html) are good choices, as is :program:`TextMate` (see https://macromates.com/). Other editors include :program:`Gvim` (http://macvim-dev.github.io/macvim/) and :program:`Aquamacs` (http://aquamacs.org/).
fr: Si vous souhaitez exécuter des scripts Python depuis l'invite de commande dans la fenêtre Terminal, ou depuis le **Finder**, vous avez d'abord besoin d'un éditeur pour créer votre script. Max OS X propose un certain nombre d’éditeurs shell Unix standards, dont :program:`vim` et :program:`emacs`. Si vous voulez une interface plus Mac, :program:`BBEdit` ou :program:`TextWrangler` de Bare Bones Software (voir http://www.barebones.com/products/bbedit/index.html) sont de bons choix, tout comme :program:`TextMate` (voir https://macromates.com/). D'autres éditeurs existent comme :program:`Gvim` (http://macvim-dev.github.io/macvim/) et :program:`Aquamacs` (http://aquamacs.org/).

source: To run your script from the Terminal window you must make sure that :file:`/usr/local/bin` is in your shell search path.
fr: Pour exécuter votre script depuis la fenêtre Terminal, vous devez vous assurer que :file:`/usr/local/bin` est dans le chemin de recherche de votre shell (**PATH**).

source: To run your script from the Finder you have two options:
fr: Pour exécuter votre script depuis le Finder vous avez deux options :

source: Drag it to :program:`PythonLauncher`
fr: Glissez-le vers :program:`PythonLauncher`

source: Select :program:`PythonLauncher` as the default application to open your script (or any .py script) through the finder Info window and double-click it. :program:`PythonLauncher` has various preferences to control how your script is launched. Option-dragging allows you to change these for one invocation, or use its Preferences menu to change things globally.
fr: Sélectionnez :program:`PythonLauncher` en tant qu'application par défaut pour ouvrir votre script (ou n'importe quel script ``.py``) depuis la fenêtre **info** de votre Finder puis double-cliquez votre script. :program:`PythonLauncher` a des préférences variées pour contrôler comment votre script est exécuté. Glisser des options permets de les changer pour une invocation, ou utilisez le menu Préférences pour changer les choses globalement.

source: Running scripts with a GUI
fr: Lancer des scripts avec une interface graphique

source: With older versions of Python, there is one Mac OS X quirk that you need to be aware of: programs that talk to the Aqua window manager (in other words, anything that has a GUI) need to be run in a special way. Use :program:`pythonw` instead of :program:`python` to start such scripts.
fr: Avec les anciennes versions de Python, il y a une bizarrerie Max OS X dont vous devez être au courant : les programmes qui communiquent avec le gestionnaires de fenêtre **Aqua** (en d'autres termes, tout ce qui a une interface graphique) doivent être exécutés de façon spécifique. Utilisez :program:`pythonw` au lieu de :program:`python` pour exécuter ce genre de scripts.

source: With Python 3.6, you can use either :program:`python` or :program:`pythonw`.
fr: Avec Python 3.6, vous pouvez utilisez :program:`python` ou :program:`pythonw`.

source: Python on OS X honors all standard Unix environment variables such as :envvar:`PYTHONPATH`, but setting these variables for programs started from the Finder is non-standard as the Finder does not read your :file:`.profile` or :file:`.cshrc` at startup. You need to create a file :file:`~/.MacOSX/environment.plist`. See Apple's Technical Document QA1067 for details.
fr: Python sur OS X respecte tous les standards Unix pour les variables d'environnement comme :envvar:`PYTHONPATH`, mais définir ces variables pour des programmes exécutés depuis le Finder n'est pas standard car le Finder ne lit pas votre :file:`.profile` ou :file:`.cshrc` au démarrage. Vous devez créer un fichier :file:`~/.MacOSX/environment.plist`. Voir le document technique d'Apple QA1067 pour plus de détails.

source: For more information on installation Python packages in MacPython, see section :ref:`mac-package-manager`.
fr: Pour plus d'informations sur l'installation de paquets Python dans **MacPython**, voir la section :ref:`mac-package-manager`.

source: The IDE
fr: L'*IDE*

source: MacPython ships with the standard IDLE development environment. A good introduction to using IDLE can be found at http://www.hashcollision.org/hkn/python/idle_intro/index.html.
fr: **MacPython** est livré avec l'environnement de développement standard **IDLE**. Une bonne introduction sur l’utilisation d'**IDLE** peut être trouvée à http://www.hashcollision.org/hkn/python/idle_intro/index.html.

source: Installing Additional Python Packages
fr: Installation de paquets Python additionnels

source: There are several methods to install additional Python packages:
fr: Il y a plusieurs méthodes pour installer des paquets Python supplémentaires :

source: Packages can be installed via the standard Python distutils mode (``python setup.py install``).
fr: Les paquets peuvent être installés en utilisant **distutils** (``python setup.py install``).

source: Many packages can also be installed via the :program:`setuptools` extension or :program:`pip` wrapper, see https://pip.pypa.io/.
fr: Beaucoup de paquets peuvent aussi être installés via l'extension :program:`setuptools` ou :program:`pip`, voir https://pip.pypa.io/.

source: GUI Programming on the Mac
fr: Programmation d'interface graphique sur le Mac

source: There are several options for building GUI applications on the Mac with Python.
fr: Il y a plusieurs options pour construire des applications avec interface graphique sur le Mac avec Python.

source: *PyObjC* is a Python binding to Apple's Objective-C/Cocoa framework, which is the foundation of most modern Mac development. Information on PyObjC is available from https://pythonhosted.org/pyobjc/.
fr: *PyObjC* est un **binding** Python vers le **framework** Objective-C/Cocoa d'Apple, qui est la base de la plupart des développements modernes sur Mac. Des informations sur PyObjC sont disponible à https://pythonhosted.org/pyobjc/.

source: *wxPython* is another popular cross-platform GUI toolkit that runs natively on Mac OS X. Packages and documentation are available from https://www.wxpython.org.
fr: *wxPython* est une boîte à outils multi-plateformes pour interfaces graphique populaire qui tourne nativement sur Mac OS X. Les paquets et la documentation sont disponibles sur https://www.wxpython.org.

source: *PyQt* is another popular cross-platform GUI toolkit that runs natively on Mac OS X. More information can be found at https://riverbankcomputing.com/software/pyqt/intro.
fr: *PyQt* est une boîte à outils multi-plateformes pour interfaces graphique populaire qui tourne nativement sur Mac OS X. Plus d'informations disponible sur https://riverbankcomputing.com/software/pyqt/intro.

source: Distributing Python Applications on the Mac
fr: Distribuer des Applications Python sur le Mac

source: The "Build Applet" tool that is placed in the MacPython 3.6 folder is fine for packaging small Python scripts on your own machine to run as a standard Mac application. This tool, however, is not robust enough to distribute Python applications to other users.
fr: L'outil "Build Applet" qui est placé dans le dossier MacPython 3.6 est suffisant pour empaqueter des petits scripts Python sur votre propre machine et pour les exécuter en tant qu'application Mac standard. Cependant, cet outil n'est pas assez robuste pour distribuer des applications Python à d'autres utilisateurs.

source: The standard tool for deploying standalone Python applications on the Mac is :program:`py2app`. More information on installing and using py2app can be found at http://undefined.org/python/#py2app.
fr: L'outil standard pour déployer des applications Python sur le Mac est :program:`py2app`. Plus d'information sur l'installation et l'utilisation de **py2app** sur http://undefined.org/python/#py2app.

source: Other Resources
fr: Autres ressources

source: The MacPython mailing list is an excellent support resource for Python users and developers on the Mac:
fr: La liste de diffusion courriel **MacPython** est une excellente ressource support pour les utilisateurs et développeurs Python sur Mac :

source: Another useful resource is the MacPython wiki:
fr: Une autre ressource utile est le wiki **MacPython** :
