Repository: python/python-docs-fr
Catalog: using/unix.po
Languages: fr

source: Using Python on Unix platforms
fr: Utilisation de Python sur les plateformes Unix

source: Getting and installing the latest version of Python
fr: Récupérer et installer la dernière version de Python

source: On Linux
fr: Sur Linux

source: Python comes preinstalled on most Linux distributions, and is available as a package on all others. However there are certain features you might want to use that are not available on your distro's package. You can easily compile the latest version of Python from source.
fr: Python est pré-installé sur la plupart des distributions Linux, et est disponible en paquet sur toutes les autres. Cependant, il y a certaines fonctionnalités que vous voudrez utiliser qui ne seront pas disponibles sur le paquet de votre distribution. Vous pouvez facilement compiler la dernière version de Python depuis les sources.

source: In the event that Python doesn't come preinstalled and isn't in the repositories as well, you can easily make packages for your own distro. Have a look at the following links:
fr: Dans le cas où Python n'est pas pré-installé et n'est pas dans les dépôts non plus, vous pouvez facilement faire les paquets pour votre propre distribution. Jetez un œil à ces liens :

source: https://www.debian.org/doc/manuals/maint-guide/first.en.html
fr: https://www.debian.org/doc/manuals/maint-guide/first.fr.html

source: for Debian users
fr: pour les utilisateurs de Debian

source: for OpenSuse users
fr: pour les utilisateurs d'OpenSuse

source: for Fedora users
fr: pour les utilisateurs de Fedora

source: for Slackware users
fr: pour les utilisateurs de Slackware

source: On FreeBSD and OpenBSD
fr: Sur FreeBSD et OpenBSD

source: FreeBSD users, to add the package use::
fr: Utilisateurs de FreeBSD, pour installer le paquet, utilisez ::

source: OpenBSD users, to add the package use::
fr: Utilisateurs d'OpenBSD, pour installer le paquet, utilisez ::

source: For example i386 users get the 2.5.1 version of Python using::
fr: Par exemple les utilisateurs d'``i386`` récupèrent la version 2.5.1 de Python en faisant ::

source: On OpenSolaris
fr: Sur OpenSolaris

source: You can get Python from `OpenCSW <https://www.opencsw.org/>`_. Various versions of Python are available and can be installed with e.g. ``pkgutil -i python27``.
fr: Vous pouvez récupérer Python depuis `OpenCSW <https://www.opencsw.org/>`_. Différentes versions de Python sont disponibles et peuvent être installées. Exemple : ``pkgutil -i python27``.

source: Building Python
fr: Compiler Python

source: The build process consists of the usual commands::
fr: La compilation s'effectue avec les commandes habituelles ::

source: :ref:`Configuration options <configure-options>` and caveats for specific Unix platforms are extensively documented in the :source:`README.rst` file in the root of the Python source tree.
fr: Les :ref:`options de configuration <configure-options>` et mises en garde pour certaines plateformes Unix spécifiques sont largement documentées dans le fichier :source:`README.rst` à la racine du dossier des sources Python.

source: ``make install`` can overwrite or masquerade the :file:`python3` binary. ``make altinstall`` is therefore recommended instead of ``make install`` since it only installs :file:`{exec_prefix}/bin/python{version}`.
fr: ``make install`` peut écraser ou cacher le binaire :file:`python3`. ``make altinstall`` est donc recommandé à la place de ``make install`` puisqu'il installe seulement :file:`{exec_prefix}/bin/python{version}`.

source: Python-related paths and files
fr: Fichiers et chemins liés à Python

source: These are subject to difference depending on local installation conventions; :envvar:`prefix` (``${prefix}``) and :envvar:`exec_prefix` (``${exec_prefix}``) are installation-dependent and should be interpreted as for GNU software; they may be the same.
fr: Ceux-ci sont sujets à des différences en fonction des conventions locales d'installation ; :envvar:`prefix` (``${prefix}``) et :envvar:`exec_prefix` (``${exec_prefix}``) sont dépendants de l’installation et doivent être interprétés comme pour des logiciels GNU ; ils peuvent être égaux.

source: For example, on most Linux systems, the default for both is :file:`/usr`.
fr: Par exemple, sur la plupart des systèmes Linux, leur valeur par défaut est :file:`/usr`.

source: File/directory
fr: Fichier/dossier

source: Meaning
fr: Signification

source: Recommended location of the interpreter.
fr: Emplacement recommandé de l'interpréteur.

source: Recommended locations of the directories containing the standard modules.
fr: Emplacements recommandés des dossiers contenant les modules standards.

source: Recommended locations of the directories containing the include files needed for developing Python extensions and embedding the interpreter.
fr: Emplacements recommandés des dossiers contenant les entêtes nécessaires au développement d'extensions Python et à l'intégration de l'interpréteur.

source: Miscellaneous
fr: Divers

source: To easily use Python scripts on Unix, you need to make them executable, e.g. with
fr: Pour utiliser facilement des scripts Python sur Unix, vous devez les rendre exécutables, par exemple avec

source: and put an appropriate Shebang line at the top of the script. A good choice is usually ::
fr: et mettre un *shebang* approprié en haut du script. Un bon choix est généralement ::

source: which searches for the Python interpreter in the whole :envvar:`PATH`. However, some Unices may not have the :program:`env` command, so you may need to hardcode ``/usr/bin/python3`` as the interpreter path.
fr: qui cherche l’interpréteur Python dans le :envvar:`PATH` complet. Cependant, certains systèmes Unix peuvent ne pas avoir la commande :program:`env`, donc vous devrez littéralement écrire ``/usr/bin/python3`` en tant que chemin d’interpréteur.

source: To use shell commands in your Python scripts, look at the :mod:`subprocess` module.
fr: Pour utiliser des commandes *shell* dans vos scripts Python, regardez le module :mod:`subprocess`.

source: Custom OpenSSL
fr: Version personnalisée d'OpenSSL

source: To use your vendor's OpenSSL configuration and system trust store, locate the directory with ``openssl.cnf`` file or symlink in ``/etc``. On most distribution the file is either in ``/etc/ssl`` or ``/etc/pki/tls``. The directory should also contain a ``cert.pem`` file and/or a ``certs`` directory.
fr: Pour compiler avec votre propre configuration d'OpenSSL et le magasin des certificats de confiance du système, commencez par trouver le sous-dossier de ``/etc`` qui contient le fichier ou le lien symbolique ``openssl.cnf``. Sur la plupart des distributions, c'est soit ``/etc/ssl``, soit ``/etc/pki/tls``. Ce dossier doit également contenir un fichier ``cert.pem`` ou un sous-dossier ``certs`` (ou les deux).

source: Download, build, and install OpenSSL. Make sure you use ``install_sw`` and not ``install``. The ``install_sw`` target does not override ``openssl.cnf``.
fr: Téléchargez et compilez OpenSSL. Installez-le, en prenant bien garde de le faire avec la cible ``install_sw`` et non pas ``install``. En effet, ``install`` réécrirait le fichier ``openssl.cnf``.

source: Patch releases of OpenSSL have a backwards compatible ABI. You don't need to recompile Python to update OpenSSL. It's sufficient to replace the custom OpenSSL installation with a newer version.
fr: Les versions d'OpenSSL dans une même série (incrémentation du troisième chiffre) conservent la compatibilité de l'interface binaire. Pour mettre à jour OpenSSL, il n'y a pas besoin de recompiler Python, il suffit de remplacer l'installation d'OpenSSL avec la nouvelle version.
