Repository: python/python-docs-fr
Catalog: using/windows.po
Languages: fr

source: On the first page of the installer, an option labelled "Add Python to PATH" may be selected to have the installer add the install location into the :envvar:`PATH`. The location of the :file:`Scripts\\` folder is also added. This allows you to type :command:`python` to run the interpreter, and :command:`pip` for the package installer. Thus, you can also execute your scripts with command line options, see :ref:`using-on-cmdline` documentation.
fr: Sur la première page de l'installateur, une option intitulée "Ajouter Python au *PATH*" peut être sélectionnée pour que l'installateur ajoute l'emplacement d'installation dans le :envvar:`PATH`. L'emplacement du dossier :file:`Scripts\\` y est également ajouté. Cela vous permet de taper :command:`Python` pour exécuter l'interpréteur, et :command:`pip` pour l'installateur de paquets. Ainsi, vous pouvez également exécuter vos scripts avec les options de ligne de commande, voir la documentation :ref:`using-on-cmdline`.

source: If you don't enable this option at install time, you can always re-run the installer, select Modify, and enable it. Alternatively, you can manually modify the :envvar:`PATH` using the directions in :ref:`setting-envvars`. You need to set your :envvar:`PATH` environment variable to include the directory of your Python installation, delimited by a semicolon from other entries. An example variable could look like this (assuming the first two entries already existed)::
fr: Si vous n'activez pas cette option au moment de l'installation, vous pouvez toujours ré-exécuter l'installateur, sélectionner Modifier et l'activer. Vous pouvez également modifier manuellement le :envvar:`PATH` à l'aide des instructions de :ref:`setting-envvars`. Vous devez définir votre variable d'environnement :envvar:`PATH` pour inclure le répertoire de votre installation Python, délimité par un point-virgule des autres entrées. Une variable d'exemple pourrait ressembler à ceci (en supposant que les deux premières entrées existaient déjà) ::

source: Python Launcher for Windows
fr: Lanceur Python pour Windows

source: The Python launcher for Windows is a utility which aids in locating and executing of different Python versions. It allows scripts (or the command-line) to indicate a preference for a specific Python version, and will locate and execute that version.
fr: Le lanceur Python pour Windows est un utilitaire qui facilite la recherche et l'exécution de différentes versions de Python. Il permet aux scripts (ou à la ligne de commande) d'indiquer une préférence pour une version Python spécifique, cherchera et exécutera cette version.

source: Unlike the :envvar:`PATH` variable, the launcher will correctly select the most appropriate version of Python. It will prefer per-user installations over system-wide ones, and orders by language version rather than using the most recently installed version.
fr: Contrairement à la variable :envvar:`PATH`, le lanceur sélectionne correctement la version la plus appropriée de Python. Il préfère les installations par utilisateur sur celles du système, et les trie par version plutôt que d'utiliser la version la plus récente installée.

source: The launcher was originally specified in :pep:`397`.
fr: Le lanceur a été initialement spécifié dans :pep:`397`.

source: Getting started
fr: Pour commencer

source: From the command-line
fr: Depuis la ligne de commande

source: System-wide installations of Python 3.3 and later will put the launcher on your :envvar:`PATH`. The launcher is compatible with all available versions of Python, so it does not matter which version is installed. To check that the launcher is available, execute the following command in Command Prompt:
fr: Les installations systèmes de Python 3.3 et ultérieur mettent le lanceur dans votre :envvar:`PATH`. Le lanceur est compatible avec toutes les versions disponibles de Python, peu importe lesquelles sont installées. Pour vérifier que le lanceur est disponible, exécutez la commande suivante dans l'invite de commandes :

source: You should find that the latest version of Python you have installed is started - it can be exited as normal, and any additional command-line arguments specified will be sent directly to Python.
fr: Vous devriez voir se lancer la dernière version de Python installée — il peut être quitté normalement, et tous les arguments de ligne de commande supplémentaires spécifiés seront envoyés directement à Python.

source: If you have multiple versions of Python installed (e.g., 2.7 and |version|) you will have noticed that Python |version| was started - to launch Python 2.7, try the command:
fr: Si plusieurs versions de Python sont installées (par exemple, 2.7 et |version|), vous aurez remarqué que Python |version| se lance -- pour lancer Python 2.7, essayez la commande :

source: If you want the latest version of Python 2.x you have installed, try the command:
fr: Si vous voulez que la dernière version de Python 2.x que vous avez installé, essayez la commande :

source: You should find the latest version of Python 2.x starts.
fr: Remarquez que la dernière version de Python 2.x démarre.

source: If you see the following error, you do not have the launcher installed:
fr: Si vous voyez l'erreur suivante, le lanceur n'est pas installé :

source: Per-user installations of Python do not add the launcher to :envvar:`PATH` unless the option was selected on installation.
fr: Les installations par utilisateur de Python n'ajoutent pas le lanceur à :envvar:`PATH` sauf si l'option a été sélectionnée lors de l'installation.

source: Virtual environments
fr: Environnements virtuels

source: If the launcher is run with no explicit Python version specification, and a virtual environment (created with the standard library :mod:`venv` module or the external ``virtualenv`` tool) active, the launcher will run the virtual environment's interpreter rather than the global one. To run the global interpreter, either deactivate the virtual environment, or explicitly specify the global Python version.
fr: Si le lanceur est exécuté sans version de Python explicite et qu'un environnement virtuel (créé avec le module de la bibliothèque standard :mod:`venv` ou l'outil externe ``virtualenv``) est actif, le lanceur exécute l'interpréteur de l'environnement virtuel plutôt que l'interpréteur global. Pour exécuter l'interpréteur global, désactivez l'environnement virtuel ou spécifiez explicitement la version Python globale.

source: From a script
fr: À partir d'un script

source: Let's create a test Python script - create a file called ``hello.py`` with the following contents
fr: Créons un script Python de test, créez un fichier appelé ``hello.py`` avec le contenu suivant

source: From the directory in which hello.py lives, execute the command:
fr: À partir du répertoire dans lequel se trouve ``hello.py``, exécutez la commande :

source: You should notice the version number of your latest Python 2.x installation is printed. Now try changing the first line to be:
fr: Vous devriez voir le numéro de version du Python 2.x le plus récemment installé. Maintenant, essayez de changer la première ligne en :

source: Re-executing the command should now print the latest Python 3.x information. As with the above command-line examples, you can specify a more explicit version qualifier. Assuming you have Python 2.6 installed, try changing the first line to ``#! python2.6`` and you should find the 2.6 version information printed.
fr: La commande doit maintenant afficher les dernières informations de Python 3.x. Comme pour les exemples de ligne de commande ci-dessus, vous pouvez spécifier un qualificateur de version plus explicite. En supposant que vous avez installé Python 2.6, essayez de changer la première ligne à ``#! python2.6`` et vous devriez trouver les informations de version 2.6 imprimées.

source: Note that unlike interactive use, a bare "python" will use the latest version of Python 2.x that you have installed. This is for backward compatibility and for compatibility with Unix, where the command ``python`` typically refers to Python 2.
fr: Notez que, contrairement à l'utilisation interactive, un "python" nu utilisera la dernière version de Python 2.x que vous avez installé. C'est pour la compatibilité ascendante et pour la compatibilité avec UNIX, où la commande ``python`` fait généralement référence à Python 2.

source: From file associations
fr: À partir d'associations de fichiers

source: The launcher should have been associated with Python files (i.e. ``.py``, ``.pyw``, ``.pyc`` files) when it was installed. This means that when you double-click on one of these files from Windows explorer the launcher will be used, and therefore you can use the same facilities described above to have the script specify the version which should be used.
fr: Le lanceur aurait dû être associé à des fichiers Python (des fichiers comme ``.py``, ``.pyw``, ``.pyc``) lorsqu'il a été installé. Cela signifie que lorsque vous double-cliquez sur l'un de ces fichiers à partir de l'Explorateur Windows, le lanceur sera utilisé, et donc vous pouvez utiliser les mêmes installations décrites ci-dessus pour que le script spécifie la version qui doit être utilisée.

source: The key benefit of this is that a single launcher can support multiple Python versions at the same time depending on the contents of the first line.
fr: L'avantage principal de ceci est qu'un seul lanceur peut prendre en charge plusieurs versions de Python en même temps en fonction du contenu de la première ligne.

source: Shebang Lines
fr: Lignes Shebang

source: If the first line of a script file starts with ``#!``, it is known as a "shebang" line. Linux and other Unix like operating systems have native support for such lines and they are commonly used on such systems to indicate how a script should be executed. This launcher allows the same facilities to be used with Python scripts on Windows and the examples above demonstrate their use.
fr: Si la première ligne d'un fichier de script commence par ``#!``, elle est connue sous le nom de ligne "*shebang*". Linux et d'autres systèmes basés sur Unix ont une prise en charge native de ces lignes et les *shebangs* sont couramment utilisés sur ces systèmes pour indiquer comment un script doit être exécuté. Ce lanceur permet aux mêmes installations d'être utilisés avec des scripts Python sur Windows et les exemples ci-dessus démontrent leur utilisation.

source: To allow shebang lines in Python scripts to be portable between Unix and Windows, this launcher supports a number of 'virtual' commands to specify which interpreter to use. The supported virtual commands are:
fr: Pour permettre aux *shebang* dans les scripts Python d'être portables entre UNIX et Windows, ce lanceur prend en charge un certain nombre de commandes « virtuelles » pour spécifier l'interpréteur à utiliser. Les commandes virtuelles prises en charge sont :

source: For example, if the first line of your script starts with
fr: Par exemple, si la première ligne de votre script commence par

source: The default Python will be located and used. As many Python scripts written to work on Unix will already have this line, you should find these scripts can be used by the launcher without modification. If you are writing a new script on Windows which you hope will be useful on Unix, you should use one of the shebang lines starting with ``/usr``.
fr: Le Python par défaut sera trouvé et utilisé. Comme de nombreux scripts Python écrits pour fonctionner sur UNIX auront déjà cette ligne, ils devraient fonctionner avec le lanceur sans modification. Si vous écrivez un nouveau script sur Windows et que vous pensez qu'il sera utile sur UNIX, vous devez utiliser l'une des lignes *shebang* commençant par ``/usr``.

source: Any of the above virtual commands can be suffixed with an explicit version (either just the major version, or the major and minor version). Furthermore the 32-bit version can be requested by adding "-32" after the minor version. I.e. ``/usr/bin/python2.7-32`` will request usage of the 32-bit python 2.7.
fr: Les commandes virtuelles ci-dessus peuvent être suffixées avec une version explicite (soit seulement la version principale, soit la version principale et mineure). De plus la version 32-bit peut être demandée en ajoutant **-32** après le numéro de version mineur. Par exemple ``/usr/bin/python2.7-32`` demande d’utiliser la version 32-bit de Python 2.7.

source: Beginning with python launcher 3.7 it is possible to request 64-bit version by the "-64" suffix. Furthermore it is possible to specify a major and architecture without minor (i.e. ``/usr/bin/python3-64``).
fr: Depuis la version 3.7 du lanceur Python, il est possible de demander une version *64-bit* en utilisant le suffixe **-64**. De plus il est possible de spécifier une version majeure et une architecture sans version mineure (par exemple ``/usr/bin/python3-64``).

source: The ``/usr/bin/env`` form of shebang line has one further special property. Before looking for installed Python interpreters, this form will search the executable :envvar:`PATH` for a Python executable. This corresponds to the behaviour of the Unix ``env`` program, which performs a :envvar:`PATH` search.
fr: La forme ``/usr/bin/env`` de ligne *shebang* possède une autre propriété spéciale. Avant de rechercher les interpréteurs Python installés, cette forme recherche d'abord l'exécutable dans le :envvar:`PATH`. Cela correspond au comportement du programme Unix ``env``, qui effectue une recherche dans :envvar:`PATH`.

source: Arguments in shebang lines
fr: Arguments dans les lignes *shebang*

source: The shebang lines can also specify additional options to be passed to the Python interpreter. For example, if you have a shebang line:
fr: Les lignes *shebang* peuvent également spécifier des options supplémentaires à passer à l'interpréteur Python. Par exemple, si vous avez une ligne *shebang* :

source: Then Python will be started with the ``-v`` option
fr: Alors, Python sera démarré avec l'option ``-v``

source: Customization
fr: Personnalisation

source: Customization via INI files
fr: Personnalisation via des fichiers INI

source: Two .ini files will be searched by the launcher - ``py.ini`` in the current user's "application data" directory (i.e. the directory returned by calling the Windows function ``SHGetFolderPath`` with ``CSIDL_LOCAL_APPDATA``) and ``py.ini`` in the same directory as the launcher. The same .ini files are used for both the 'console' version of the launcher (i.e. py.exe) and for the 'windows' version (i.e. pyw.exe).
fr: Deux fichiers ``.ini`` seront recherchés par le lanceur -- ``py.ini`` dans le répertoire "Application Data" de l'utilisateur actuel (c'est-à-dire le répertoire retourné en appelant la fonction Windows ``SHGetFolderPath`` avec ``CSIDL_LOCAL_APPDATA``) et ``py.ini`` dans le même répertoire que le lanceur. Les mêmes fichiers ``.ini`` sont utilisés à la fois pour la version « console » du lanceur (c'est-à-dire ``py.exe``) et pour la version « fenêtrée » (c'est-à-dire ``pyw.exe``).

source: Customization specified in the "application directory" will have precedence over the one next to the executable, so a user, who may not have write access to the .ini file next to the launcher, can override commands in that global .ini file.
fr: La personnalisation spécifiée dans le "répertoire de l'application" aura la priorité sur celle à côté de l'exécutable, de sorte qu'un utilisateur, qui peut ne pas avoir accès en écriture au fichier ``.ini`` à côté du lanceur, peut substituer des commandes dans ce fichier ``.ini`` global)

source: Customizing default Python versions
fr: Personnalisation des versions Python par défaut

source: In some cases, a version qualifier can be included in a command to dictate which version of Python will be used by the command. A version qualifier starts with a major version number and can optionally be followed by a period ('.') and a minor version specifier. Furthermore it is possible to specify if a 32 or 64 bit implementation shall be requested by adding "-32" or "-64".
fr: Dans certains cas, un qualificateur de version peut être inclus dans une commande pour dicter quelle version de Python sera utilisée par la commande. Un qualificateur de version commence par un numéro de version majeure et peut éventuellement être suivi d'un point (``.``) et d'un spécificateur de version secondaire. De plus il est possible de préciser si une implémentation 32 ou 64 bit doit être demandée en ajoutant **-32** ou **-64**.

source: For example, a shebang line of ``#!python`` has no version qualifier, while ``#!python3`` has a version qualifier which specifies only a major version.
fr: Par exemple, une ligne *shebang* valant ``#!python`` n'a pas de qualificateur de version, tandis que ``#!python3`` a un qualificateur de version qui ne spécifie qu'une version majeure.

source: If no version qualifiers are found in a command, the environment variable :envvar:`PY_PYTHON` can be set to specify the default version qualifier. If it is not set, the default is "3". The variable can specify any value that may be passed on the command line, such as "3", "3.7", "3.7-32" or "3.7-64". (Note that the "-64" option is only available with the launcher included with Python 3.7 or newer.)
fr: Si aucun qualificateur de version n'est trouvé dans une commande, la variable d'environnement :envvar:`PY_PYTHON` peut être définie pour spécifier le qualificateur de version par défaut. Si non définie, la valeur par défaut est ``3``. La variable peut spécifier n’importe quelle valeur qui peut être passée dans la ligne de commande telle que ``3``, ``3.7``, ``3.7-32`` ou ``3.7-64``. (Notez que l’option **-64** est seulement disponible avec le lanceur inclus avec Python 3.7 ou plus récent.)

source: If no minor version qualifiers are found, the environment variable ``PY_PYTHON{major}`` (where ``{major}`` is the current major version qualifier as determined above) can be set to specify the full version. If no such option is found, the launcher will enumerate the installed Python versions and use the latest minor release found for the major version, which is likely, although not guaranteed, to be the most recently installed version in that family.
fr: Si aucun qualificateur de version mineure n'est trouvé, la variable d'environnement ``PY_PYTHON{major}`` (où ``{major}`` est le qualificateur de version principale actuelle tel que déterminé ci-dessus) peut être définie pour spécifier la version complète. Si aucune option de ce type n'est trouvée, le lanceur énumérera les versions de Python installées et utilisera la dernière version mineure trouvée pour la version principale, qui est probablement la plus récemment installée dans cette famille.

source: On 64-bit Windows with both 32-bit and 64-bit implementations of the same (major.minor) Python version installed, the 64-bit version will always be preferred. This will be true for both 32-bit and 64-bit implementations of the launcher - a 32-bit launcher will prefer to execute a 64-bit Python installation of the specified version if available. This is so the behavior of the launcher can be predicted knowing only what versions are installed on the PC and without regard to the order in which they were installed (i.e., without knowing whether a 32 or 64-bit version of Python and corresponding launcher was installed last). As noted above, an optional "-32" or "-64" suffix can be used on a version specifier to change this behaviour.
fr: Sur Windows 64-bits avec les implémentations 32-bits et 64-bits de la même version Python (``major.minor``) installée, la version 64-bit est toujours préférée. Cela est vrai pour les implémentations 32-bits et 64-bits du lanceur – un lanceur 32-bits préfère exécuter une installation Python de 64-bits de la version spécifiée si elle est disponible. Le comportement du lanceur est donc prévisible en sachant seulement quelles versions sont installées sur le PC et sans tenir compte de l'ordre dans lequel ils ont été installés (i.e., sans savoir si une version 32 ou 64-bit de Python et le lanceur correspondant a été installé en dernier). Comme indiqué ci-dessus, un suffixe optionnel ``-32`` ou ``-64`` peut être utilisé sur un spécificateur de version pour modifier ce comportement.

source: Examples:
fr: Exemples :

source: If no relevant options are set, the commands ``python`` and ``python2`` will use the latest Python 2.x version installed and the command ``python3`` will use the latest Python 3.x installed.
fr: Si aucune option pertinente n'est définie, les commandes ``python`` et ``python2`` utiliseront la dernière version de Python 2.x installée et la commande ``python3`` utilisera le dernier Python 3.x installé.

source: The commands ``python3.1`` and ``python2.7`` will not consult any options at all as the versions are fully specified.
fr: Les commandes ``python3.1`` et ``python2.7`` ne consultent aucune option du tout car les versions sont entièrement spécifiées.

source: If ``PY_PYTHON=3``, the commands ``python`` and ``python3`` will both use the latest installed Python 3 version.
fr: Si ``PY_PYTHON=3``, les commandes ``python`` et ``python3`` utiliseront la dernière version de Python 3 installée.

source: If ``PY_PYTHON=3.1-32``, the command ``python`` will use the 32-bit implementation of 3.1 whereas the command ``python3`` will use the latest installed Python (PY_PYTHON was not considered at all as a major version was specified.)
fr: Si ``PY_PYTHON=3.1-32``, la commande ``python`` utilisera l'implémentation 32-bits de 3.1 alors que la commande ``python3`` utilisera le dernier Python installé (*PY_PYTHON* n'a pas été considéré du tout comme une version majeure a été spécifiée.)

source: If ``PY_PYTHON=3`` and ``PY_PYTHON3=3.1``, the commands ``python`` and ``python3`` will both use specifically 3.1
fr: Si ``PY_PYTHON=3`` et ``PY_PYTHON3=3.1``, les commandes ``python`` et ``python3`` utiliseront spécifiquement 3.1

source: In addition to environment variables, the same settings can be configured in the .INI file used by the launcher. The section in the INI file is called ``[defaults]`` and the key name will be the same as the environment variables without the leading ``PY_`` prefix (and note that the key names in the INI file are case insensitive.) The contents of an environment variable will override things specified in the INI file.
fr: En plus des variables d'environnement, les mêmes paramètres peuvent être configurés dans le ``.INI`` utilisé par le lanceur. La section dans le fichier INI est appelée ``[defaults]`` et le nom de la clé sera le même que les variables d'environnement sans le préfixe ``PY_`` principal (et notez que les noms de clés dans le fichier **INI** sont insensibles à la case.) Le contenu d'une variable d'environnement remplacera les éléments spécifiés dans le fichier *INI*.

source: For example:
fr: Par exemple :

source: Setting ``PY_PYTHON=3.1`` is equivalent to the INI file containing:
fr: Le paramètre ``PY_PYTHON=3.1`` équivaut au fichier **INI** contenant :

source: Setting ``PY_PYTHON=3`` and ``PY_PYTHON3=3.1`` is equivalent to the INI file containing:
fr: Le paramètre ``PY_PYTHON=3`` et ``PY_PYTHON3=3.1`` équivaut au fichier *INI* contenant :
