Repository: python/python-docs-fr
Catalog: using/windows.po
Languages: fr

source: Using Python on Windows
fr: Utilisation de Python sur Windows

source: This document aims to give an overview of Windows-specific behaviour you should know about when using Python on Microsoft Windows.
fr: Ce document a pour but de donner une vue d'ensemble des comportements spécifiques à Windows dont vous devriez être au courant si vous utilisez Python sur Microsoft Windows.

source: Unlike most Unix systems and services, Windows does not include a system supported installation of Python. To make Python available, the CPython team has compiled Windows installers (MSI packages) with every `release <https://www.python.org/download/releases/>`_ for many years. These installers are primarily intended to add a per-user installation of Python, with the core interpreter and library being used by a single user. The installer is also able to install for all users of a single machine, and a separate ZIP file is available for application-local distributions.
fr: Contrairement à la plupart des systèmes Unix, Windows n'inclut pas d'installation de Python par défaut. Pour rendre Python disponible, l’équipe CPython a compilé des installateurs (paquets MSI) pour chaque `release <https://www.python.org/download/releases/>`_ depuis plusieurs années. Ces installateurs sont principalement destinés à une installation par utilisateur de Python, avec l’interpréteur et la bibliothèque standard utilisés par un seul utilisateur. Cet installateur peut aussi installer Python pour tous les utilisateurs sur une seule machine et un fichier ZIP séparé est disponible pour intégrer Python dans d'autres applications.

source: As specified in :pep:`11`, a Python release only supports a Windows platform while Microsoft considers the platform under extended support. This means that Python |version| supports Windows Vista and newer. If you require Windows XP support then please install Python 3.4.
fr: Comme spécifié dans la :pep:`11`, une *release* Python ne gère qu'une plateforme Windows alors que Microsoft considère la plateforme sous support étendu. Ce qui veut dire que Python |version| supporte Windows Vista et plus. Si vous avez besoin de compatibilité Windows XP, vous devez utiliser Python 3.4.

source: There are a number of different installers available for Windows, each with certain benefits and downsides.
fr: Il existe un certain nombre d'installateurs différents disponibles pour Windows, chacun avec certains avantages et inconvénients.

source: :ref:`windows-full` contains all components and is the best option for developers using Python for any kind of project.
fr: :ref:`windows-full` contient tous les composants et est la meilleure option pour les développeurs utilisant Python pour tout type de projet.

source: :ref:`windows-store` is a simple installation of Python that is suitable for running scripts and packages, and using IDLE or other development environments. It requires Windows 10, but can be safely installed without corrupting other programs. It also provides many convenient commands for launching Python and its tools.
fr: :ref:`windows-store` est une simple installation de Python qui convient à l'exécution de scripts, de paquets et à l’utilisation d’IDLE ou d'autres environnements de développement. Il nécessite Windows 10, mais peut être installé en toute sécurité sans endommager d'autres programmes. Il fournit également de nombreuses commandes pratiques pour lancer Python et ses outils.

source: :ref:`windows-nuget` are lightweight installations intended for continuous integration systems. It can be used to build Python packages or run scripts, but is not updateable and has no user interface tools.
fr: :ref:`windows-nuget` sont des installations légères destinées aux systèmes d'intégration continue. Ils peuvent être utilisés pour créer des packages Python ou exécuter des scripts, mais ne sont pas modifiables et n'ont pas d'outils d'interface utilisateur.

source: :ref:`windows-embeddable` is a minimal package of Python suitable for embedding into a larger application.
fr: :ref:`windows-embeddable` est un paquet minimal de Python approprié pour l'intégration dans une plus grande application.

source: The full installer
fr: L'installateur complet

source: Installation steps
fr: Étapes d'installation

source: Four Python |version| installers are available for download - two each for the 32-bit and 64-bit versions of the interpreter. The *web installer* is a small initial download, and it will automatically download the required components as necessary. The *offline installer* includes the components necessary for a default installation and only requires an internet connection for optional features. See :ref:`install-layout-option` for other ways to avoid downloading during installation.
fr: Quatre installateurs Python |version| sont disponibles au téléchargement — deux de chaque pour les versions 32-bit et 64-bit de l'interpréteur. L'**installateur web** est léger, et téléchargera automatiquement les composants nécessaires. L'**installateur hors-ligne** inclut les composants nécessaires pour une installation par défaut et n'a besoin d'une connexion internet que pour des fonctionnalités optionnelles. Voir :ref:`install-layout-option` pour d'autres moyens d’éviter des téléchargements durant l'installation.

source: After starting the installer, one of two options may be selected:
fr: Après avoir lancé l'installateur, deux options s'affichent :

source: If you select "Install Now":
fr: Si vous sélectionnez "Installer Maintenant" (``Install Now``):

source: You will *not* need to be an administrator (unless a system update for the C Runtime Library is required or you install the :ref:`launcher` for all users)
fr: Vous n'aurez *pas* besoin d'avoir les droits d'administrateur (sauf si une mise à jour de la bibliothèque d'exécution C est nécessaire ou si vous installez le :ref:`launcher` pour tous les utilisateurs)

source: Python will be installed into your user directory
fr: Python sera installé dans votre répertoire utilisateur

source: The :ref:`launcher` will be installed according to the option at the bottom of the first page
fr: Le :ref:`launcher` sera installé suivant l'option en bas de la première page

source: The standard library, test suite, launcher and pip will be installed
fr: La bibliothèque standard, la suite de tests, le lanceur et *pip* seront installés

source: If selected, the install directory will be added to your :envvar:`PATH`
fr: Si l'option est cochée, le dossier d'installation sera ajouté à votre :envvar:`PATH`

source: Shortcuts will only be visible for the current user
fr: Les raccourcis ne seront visibles que pour l'utilisateur actuel

source: Selecting "Customize installation" will allow you to select the features to install, the installation location and other options or post-install actions. To install debugging symbols or binaries, you will need to use this option.
fr: Sélectionner "Personnaliser l'installation" (``Customize installation``) vous permettra de sélectionner les fonctionnalités à installer, le chemin d'installation et d'autres options ou des options post-installation. Pour installer des binaires ou symboles de débogage, vous devrez utiliser cette option.

source: To perform an all-users installation, you should select "Customize installation". In this case:
fr: Pour effectuer une installation pour tous les utilisateurs, vous devez sélectionner "Personnaliser l'installation". Dans ce cas :

source: You may be required to provide administrative credentials or approval
fr: Vous pouvez avoir à donner une approbation ou des identifiants administrateur

source: Python will be installed into the Program Files directory
fr: Python sera installé dans le dossier *Program Files*

source: The :ref:`launcher` will be installed into the Windows directory
fr: Le :ref:`launcher` sera installé dans le dossier *Windows*

source: Optional features may be selected during installation
fr: Des fonctionnalités optionnelles peuvent être sélectionnées durant l'installation

source: The standard library can be pre-compiled to bytecode
fr: La bibliothèque standard peut être pré-compilée en code intermédiaire (*bytecode* en anglais)

source: If selected, the install directory will be added to the system :envvar:`PATH`
fr: Si sélectionné, le chemin d'installation sera ajouté au :envvar:`PATH` système

source: Shortcuts are available for all users
fr: Les raccourcis sont disponibles pour tous les utilisateurs

source: Removing the MAX_PATH Limitation
fr: Suppression de la limitation `MAX_PATH`

source: Windows historically has limited path lengths to 260 characters. This meant that paths longer than this would not resolve and errors would result.
fr: Historiquement les chemins sous Windows étaient limités 260 caractères. Cela impliquait que les chemins plus longs n'étaient pas résolus, et seraient une cause d'erreurs.

source: In the latest versions of Windows, this limitation can be expanded to approximately 32,000 characters. Your administrator will need to activate the "Enable Win32 long paths" group policy, or set the registry value ``HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\FileSystem@LongPathsEnabled`` to ``1``.
fr: Dans les dernières versions de Windows, cette limitation peut être étendue à approximativement 32.000 caractères. Votre administrateur devra activer la stratégie de groupe "**Enable Win32 long paths**" ou mettre la valeur du registre ``HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\FileSystem@LongPathsEnabled`` à ``1``.

source: This allows the :func:`open` function, the :mod:`os` module and most other path functionality to accept and return paths longer than 260 characters when using strings. (Use of bytes as paths is deprecated on Windows, and this feature is not available when using bytes.)
fr: Ceci permet à la fonction :func:`open`, le module :mod:`os` et la plupart des autres fonctionnalités utilisant des chemins d'accepter et de renvoyer des chemins plus longs que 260 caractères quand vous utilisez des chaînes. (L'utilisation de chemins sous forme de `bytes` obsolète sur Windows, et cette fonctionnalité n'est pas disponible quand vous utilisez des `bytes`.)

source: After changing the above option, no further configuration is required.
fr: Après avoir changé l'option si-dessus, aucune configuration supplémentaire n'est requise.

source: Support for long paths was enabled in Python.
fr: Gestion des chemins longs.

source: Installing Without UI
fr: Installation sans l'interface utilisateur

source: All of the options available in the installer UI can also be specified from the command line, allowing scripted installers to replicate an installation on many machines without user interaction. These options may also be set without suppressing the UI in order to change some of the defaults.
fr: Toutes les options disponibles dans l'installateur graphique peuvent aussi être spécifiées dans l'invite de commande, permettant à des installateurs scriptés de répliquer une installation sur plusieurs machines sans interaction humaine. Ces options peuvent aussi être ajoutées sans enlever l'interface graphique pour changer les valeurs par défauts.

source: To completely hide the installer UI and install Python silently, pass the ``/quiet`` option. To skip past the user interaction but still display progress and errors, pass the ``/passive`` option. The ``/uninstall`` option may be passed to immediately begin removing Python - no prompt will be displayed.
fr: Pour complétement cacher l'interface de l'installateur et installer Python silencieusement, passez l'option ``/quiet``. Pour sauter les interactions utilisateur mais afficher la progression et les erreurs, passez l'option ``/passive``. L'option ``/uninstall`` peut être passée pour immédiatement démarrer la suppression de Python -- Aucune confirmation ne sera demandée.

source: All other options are passed as ``name=value``, where the value is usually ``0`` to disable a feature, ``1`` to enable a feature, or a path. The full list of available options is shown below.
fr: Toutes les autres options sont passées sous la forme ``name=value``, ou ``value`` est normalement soit ``0`` pour désactiver une fonctionnalité, soit ``1`` pour activer une fonctionnalité, soit un chemin. Ci-dessous la liste complète des options.

source: Name
fr: Nom

source: Default
fr: Valeur par défaut

source: Perform a system-wide installation.
fr: Effectue une installation pour tous les utilisateurs.

source: The installation directory
fr: Le dossier d'installation

source: Selected based on InstallAllUsers
fr: Sélection basée sur InstallAllUsers

source: The default installation directory for all-user installs
fr: Le dossier d'installation par défaut pour les installations pour tous les utilisateurs

source: :file:`%ProgramFiles%\\\ Python X.Y` or :file:`\ %ProgramFiles(x86)%\\\ Python X.Y`
fr: :file:`%ProgramFiles%\\\ Python X.Y` ou :file:`\ %ProgramFiles(x86)%\\\ Python X.Y`

source: The default install directory for just-for-me installs
fr: Le dossier d'installation par défaut pour des installations juste pour soi

source: :file:`%LocalAppData%\\\ Programs\\PythonXY` or :file:`%LocalAppData%\\\ Programs\\PythonXY-32` or :file:`%LocalAppData%\\\ Programs\\PythonXY-64`
fr: :file:`%LocalAppData%\\\ Programs\\PythonXY` ou :file:`%LocalAppData%\\\ Programs\\PythonXY-32` ou :file:`%LocalAppData%\\\ Programs\\PythonXY-64`

source: The default custom install directory displayed in the UI
fr: Le dossier d'installation personnalisé par défaut affiché par l'interface utilisateur

source: (empty)
fr: (vide)

source: Create file associations if the launcher is also installed.
fr: Crée les associations de fichiers si le lanceur est aussi installé.

source: Compile all ``.py`` files to ``.pyc``.
fr: Compile tous les fichiers ``.py`` en ``.pyc``.

source: Add install and Scripts directories to :envvar:`PATH` and ``.PY`` to :envvar:`PATHEXT`
fr: Ajoute les dossiers ``install`` et ``Scripts`` à :envvar:`PATH` et assigne ``.PY`` à :envvar:`PATHEXT`

source: Create shortcuts for the interpreter, documentation and IDLE if installed.
fr: Crée des raccourcis pour l'interpréteur, la documentation et IDLE si installé.

source: Install Python manual
fr: Installe le manuel Python

source: Install debug binaries
fr: Installe les binaires de débogage

source: Install developer headers and libraries
fr: Installe les fichiers d'en-tête et les bibliothèques développeur

source: Install :file:`python.exe` and related files
fr: Installe :file:`python.exe` et les fichiers connexes

source: Install :ref:`launcher`.
fr: Installe le :ref:`launcher`.

source: Installs :ref:`launcher` for all users.
fr: Installe le :ref:`launcher` pour tous les utilisateurs.

source: Install standard library and extension modules
fr: Installe la bibliothèque standard et les modules d'extension

source: Install bundled pip and setuptools
fr: Installe ``pip`` et ``setuptools``

source: Install debugging symbols (`*`.pdb)
fr: Installe les symboles de débogage (``*.pdb``)

source: Install Tcl/Tk support and IDLE
fr: Installe Tcl/Tk et IDLE

source: Install standard library test suite
fr: Installe la suite de tests de la bibliothèque standard

source: Install utility scripts
fr: Installe les scripts utilitaires

source: Only installs the launcher. This will override most other options.
fr: Installe seulement le lanceur. Ceci écrasera la plupart des autres options.

source: Disable most install UI
fr: Désactive la plupart de l'interface d'installation

source: A custom message to display when the simplified install UI is used.
fr: Un message personnalisé à afficher quand l'interface d'installation simplifiée est utilisée.

source: For example, to silently install a default, system-wide Python installation, you could use the following command (from an elevated command prompt)::
fr: Par exemple, pour installer silencieusement Python sur tout le système, vous pourriez utilisez la commande suivante (depuis une invite de commande administrateur) ::

source: To allow users to easily install a personal copy of Python without the test suite, you could provide a shortcut with the following command. This will display a simplified initial page and disallow customization::
fr: Pour permettre à l'utilisateur d'installer facilement une copie de Python sans la suite de tests, vous pouvez proposer un raccourci avec la commande suivante. Cela affichera une page initiale simplifiée et interdira la personnalisation ::

source: (Note that omitting the launcher also omits file associations, and is only recommended for per-user installs when there is also a system-wide installation that included the launcher.)
fr: (Notez qu'omettre le lanceur omet aussi les associations de fichiers, et n'est recommandé que pour les installations par utilisateur quand il y a aussi une installation complète sur le système qui a inclus de lanceur.)

source: The options listed above can also be provided in a file named ``unattend.xml`` alongside the executable. This file specifies a list of options and values. When a value is provided as an attribute, it will be converted to a number if possible. Values provided as element text are always left as strings. This example file sets the same options as the previous example:
fr: Les options listées ci-dessus peuvent aussi être passées dans un fichier nommé ``unattend.xml`` à côté de l'exécutable. Ce fichier spécifie une liste d'options et de valeurs. Quand une valeur est donnée en tant qu'attribut, elle sera convertie en nombre si possible. Les valeurs données en élément texte sont toujours laissées en tant que chaînes de caractères. Ce fichier d'exemple propose les mêmes options que l'exemple précédent :

source: Installing Without Downloading
fr: Installation sans téléchargement

source: As some features of Python are not included in the initial installer download, selecting those features may require an internet connection. To avoid this need, all possible components may be downloaded on-demand to create a complete *layout* that will no longer require an internet connection regardless of the selected features. Note that this download may be bigger than required, but where a large number of installations are going to be performed it is very useful to have a locally cached copy.
fr: Comme certaines fonctionnalités de Python ne sont pas incluses dans l'installateur initial, la sélection de certaines de ces fonctionnalités peut demander une connexion Internet. Pour éviter ce besoin, tous les composants nécessaires peuvent être téléchargés à la demande pour créer un installateur complet qui ne demandera plus de connexion Internet indépendamment des options sélectionnées. Notez que ce téléchargement peut être plus gros que nécessaire, mais lorsqu'un un grand nombre d'installations doivent être faites, il est très utile d'avoir une copie locale.

source: Execute the following command from Command Prompt to download all possible required files. Remember to substitute ``python-3.8.0.exe`` for the actual name of your installer, and to create layouts in their own directories to avoid collisions between files with the same name.
fr: Exécutez la commande suivante depuis l'invite de commande pour télécharger tous les fichiers requis possibles. Rappelez-vous de remplacer ``python-3.8.0.exe`` par le nom actuel de votre installateur, et pour créer des *couches* dans leurs propres dossiers pour éviter les conflits entre fichiers du même nom.

source: You may also specify the ``/quiet`` option to hide the progress display.
fr: Vous pouvez aussi spécifier l'option ``/quiet`` pour masquer la progression.

source: Modifying an install
fr: Modification d'une installation

source: Once Python has been installed, you can add or remove features through the Programs and Features tool that is part of Windows. Select the Python entry and choose "Uninstall/Change" to open the installer in maintenance mode.
fr: Une fois Python installé, vous pouvez ajouter ou supprimer des fonctionnalités depuis l'outil Windows *Programs and Features* (Programmes et Fonctionnalités). Sélectionnez la ligne `Python` et choisissez "Uninstall/Change" (Désinstaller/Modifier) pour ouvrir l'installateur en mode maintenance.

source: "Modify" allows you to add or remove features by modifying the checkboxes - unchanged checkboxes will not install or remove anything. Some options cannot be changed in this mode, such as the install directory; to modify these, you will need to remove and then reinstall Python completely.
fr: "Modify" vous permet d'ajouter ou d'enlever des fonctionnalités en modifiant les cases à cocher (les cases inchangées n'installeront ou ne supprimeront rien). Certaines options ne peuvent pas être modifiées dans ce mode, comme le dossier d'installation. Pour modifier ces options, vous devrez ré-installer Python entièrement.

source: "Repair" will verify all the files that should be installed using the current settings and replace any that have been removed or modified.
fr: "Repair" vérifiera tous les fichiers qui doivent être installés avec les paramètres actuels le sont, et remplacera ceux qui ont étés supprimés ou modifiés.

source: "Uninstall" will remove Python entirely, with the exception of the :ref:`launcher`, which has its own entry in Programs and Features.
fr: "Uninstall" désinstallera Python entièrement, à l'exception du :ref:`launcher` qui à sa propre ligne dans *Programs and Features*.

source: The Microsoft Store package
fr: Le paquet Microsoft Store

source: The Microsoft Store package is an easily installable Python interpreter that is intended mainly for interactive use, for example, by students.
fr: Le paquet *Microsoft Store* est un interpréteur Python facilement installable qui est destiné principalement à une utilisation interactive, par exemple, par des étudiants.

source: To install the package, ensure you have the latest Windows 10 updates and search the Microsoft Store app for "Python |version|". Ensure that the app you select is published by the Python Software Foundation, and install it.
fr: Pour installer le paquet, assurez-vous d'avoir les dernières mises à jour de Windows 10 et de chercher dans l'application *Microsoft Store* “Python |version|”. Assurez-vous que l'application que vous sélectionnez est publiée par la *Python Software Foundation* et installez-la.

source: Python will always be available for free on the Microsoft Store. If you are asked to pay for it, you have not selected the correct package.
fr: Python sera toujours disponible gratuitement sur le Microsoft Store. Si vous êtes invité à payer, vous n'avez pas sélectionné le bon paquet.

source: After installation, Python may be launched by finding it in Start. Alternatively, it will be available from any Command Prompt or PowerShell session by typing ``python``. Further, pip and IDLE may be used by typing ``pip`` or ``idle``. IDLE can also be found in Start.
fr: Après l'installation, Python peut être lancé depuis le menu Démarrer. Il est aussi disponible à partir de n'importe quelle invite de commande ou session PowerShell en entrant ``python``. De plus, pip et IDLE peuvent être utilisés en entrant ``pip`` ou ``idle`` . IDLE peut également être trouvé dans le menu Démarrer.
