Repository: python/python-docs-fr
Catalog: using/windows.po
Languages: fr

source: All three commands are also available with version number suffixes, for example, as ``python3.exe`` and ``python3.x.exe`` as well as ``python.exe`` (where ``3.x`` is the specific version you want to launch, such as |version|). Open "Manage App Execution Aliases" through Start to select which version of Python is associated with each command. It is recommended to make sure that ``pip`` and ``idle`` are consistent with whichever version of ``python`` is selected.
fr: Les trois commandes sont également disponibles avec les suffixes de numéro de version, par exemple, ``python3.exe`` et ``python3.x.exe`` ainsi que ``python.exe`` (ou ``3.x`` est la version spécifique que vous souhaitez lancer, tel que |version|). Depuis le « menu Démarrer », ouvrez « Alias d'exécution d'application » (ou « *Manage App Execution Aliases* » en anglais) pour choisir quelle version de Python est associée à quelle commande. Il est recommandé de s'assurer que ``pip`` et ``idle`` utilisent la même version de Python que la commande ``python``.

source: Virtual environments can be created with ``python -m venv`` and activated and used as normal.
fr: Les environnements virtuels peuvent être créés avec ``python -m venv`` et activés et utilisés normalement.

source: If you have installed another version of Python and added it to your ``PATH`` variable, it will be available as ``python.exe`` rather than the one from the Microsoft Store. To access the new installation, use ``python3.exe`` or ``python3.x.exe``.
fr: Si vous avez installé une autre version de Python et l'avez ajoutée à votre variable d'environnement ``PATH``, elle sera disponible en tant que ``python.exe`` plutôt que celle de la boutique Microsoft. Pour accéder à la nouvelle installation, utilisez ``python3.exe`` ou ``python3.x.exe``.

source: The ``py.exe`` launcher will detect this Python installation, but will prefer installations from the traditional installer.
fr: Le lanceur ``py.exe`` va détecter cette installation Python, mais préfèrera les versions de l'installateur traditionnel.

source: To remove Python, open Settings and use Apps and Features, or else find Python in Start and right-click to select Uninstall. Uninstalling will remove all packages you installed directly into this Python installation, but will not remove any virtual environments
fr: Pour supprimer Python, depuis les paramètres Windows ouvrez *Apps and Features* (Applications et Fonctionnalités), ou bien trouvez Python dans le menu Démarrer et cliquez avec le bouton droit pour sélectionner désinstaller. La désinstallation supprimera tous les paquets que vous avez installés directement dans cette installation Python, mais ne supprimera aucun environnement virtuel

source: Known Issues
fr: Problèmes connus

source: Because of restrictions on Microsoft Store apps, Python scripts may not have full write access to shared locations such as ``TEMP`` and the registry. Instead, it will write to a private copy. If your scripts must modify the shared locations, you will need to install the full installer.
fr: En raison de restrictions sur les applications Microsoft Store, les scripts Python peuvent ne pas avoir un accès en écriture complet aux emplacements partagés tels que ``TEMP`` et le registre. Au lieu de cela, il écrira sur une copie privée. Si vos scripts doivent modifier les emplacements partagés, vous devrez installer le programme d'installation complet.

source: The nuget.org packages
fr: Les paquets *nuget.org*

source: The nuget.org package is a reduced size Python environment intended for use on continuous integration and build systems that do not have a system-wide install of Python. While nuget is "the package manager for .NET", it also works perfectly fine for packages containing build-time tools.
fr: Le paquet *nuget.org* est un environnement Python de taille réduite destiné à être utilisé sur des systèmes d'intégration et de génération continus qui n'ont pas Python d'installé. Alors que *nuget* est “le gestionnaire de package pour .NET”, il fonctionne également parfaitement bien pour les packages contenant des outils de *build-time*.

source: Visit `nuget.org <https://www.nuget.org/>`_ for the most up-to-date information on using nuget. What follows is a summary that is sufficient for Python developers.
fr: Visitez `nuget.org <https://www.nuget.org/>`_ pour les informations les plus à jour sur l'utilisation de *nuget*. Ce qui suit est un résumé suffisant pour les développeurs Python.

source: The ``nuget.exe`` command line tool may be downloaded directly from ``https://aka.ms/nugetclidl``, for example, using curl or PowerShell. With the tool, the latest version of Python for 64-bit or 32-bit machines is installed using::
fr: L'outil de ligne de commande ``nuget.exe`` peut être téléchargé directement à partir de ``https://aka.ms/nugetclidl``, par exemple, à l'aide de *curl* ou de PowerShell. Avec l'outil, la dernière version de Python pour les machines 64 bits ou 32 bits est installée à l'aide de ::

source: To select a particular version, add a ``-Version 3.x.y``. The output directory may be changed from ``.``, and the package will be installed into a subdirectory. By default, the subdirectory is named the same as the package, and without the ``-ExcludeVersion`` option this name will include the specific version installed. Inside the subdirectory is a ``tools`` directory that contains the Python installation::
fr: Pour sélectionner une version particulière, ajoutez un ``-Version 3.x.y``. Le répertoire d'installation être modifié (de ``.``), et le paquet sera installé dans un sous-répertoire. Par défaut, le sous-répertoire est nommé comme le paquet, et sans l'option ``-ExcludeVersion``, ce nom inclura la version spécifique installée. À l'intérieur du sous-répertoire se trouve un répertoire ``tools`` qui contient l'installation Python ::

source: In general, nuget packages are not upgradeable, and newer versions should be installed side-by-side and referenced using the full path. Alternatively, delete the package directory manually and install it again. Many CI systems will do this automatically if they do not preserve files between builds.
fr: En général, les paquets *nuget* ne peuvent pas êtres mis à jour et les versions plus récentes doivent être installées côte à côte et référencées à l'aide du chemin d'accès complet. Vous pouvez également supprimer le répertoire du paquet manuellement et l'installer à nouveau. De nombreux systèmes CI le feront automatiquement s'ils ne conservent pas les fichiers entre les *builds*.

source: Alongside the ``tools`` directory is a ``build\native`` directory. This contains a MSBuild properties file ``python.props`` that can be used in a C++ project to reference the Python install. Including the settings will automatically use the headers and import libraries in your build.
fr: À côté du répertoire ``tools`` est un répertoire ``build\native``. Il contient un fichier de propriétés MSBuild ``python.props`` qui peut être utilisé dans un projet C++ pour référencer l'installation de Python. L'inclusion des paramètres utilisera automatiquement les en-têtes et les bibliothèques d'importation dans votre *build*.

source: The package information pages on nuget.org are `www.nuget.org/packages/python <https://www.nuget.org/packages/python>`_ for the 64-bit version and `www.nuget.org/packages/pythonx86 <https://www.nuget.org/packages/pythonx86>`_ for the 32-bit version.
fr: Les pages d’information sur *nuget.org* sont `www.nuget.org/packages/python <https://www.nuget.org/packages/python>`_ pour la version 64 Bits et `www.nuget.org/packages/pythonx86 <https://www.nuget.org/packages/pythonx86>`_ pour la version 32 Bits.

source: The embeddable package
fr: Le paquet intégrable

source: The embedded distribution is a ZIP file containing a minimal Python environment. It is intended for acting as part of another application, rather than being directly accessed by end-users.
fr: La distribution embarquée est un fichier ZIP contenant un environnement Python minimal. Il est destiné à agir dans le cadre d'une autre application, plutôt que d'être directement accessible par les utilisateurs finaux.

source: When extracted, the embedded distribution is (almost) fully isolated from the user's system, including environment variables, system registry settings, and installed packages. The standard library is included as pre-compiled and optimized ``.pyc`` files in a ZIP, and ``python3.dll``, ``python37.dll``, ``python.exe`` and ``pythonw.exe`` are all provided. Tcl/tk (including all dependants, such as Idle), pip and the Python documentation are not included.
fr: Une fois extrait, la distribution intégrée est (presque) entièrement isolée du système de l'utilisateur, y compris les variables d'environnement, les paramètres du registre système et les paquets installés. La bibliothèque standard est incluse en tant que fichiers pré-compilés et optimisés ``.pyc`` dans un fichier ZIP, et ``python3.dll``, ``python37.dll``, ``python.exe`` et ``pythonw.exe`` sont tous fournis. *Tcl/Tk* (y compris tous les dépendants, telles que IDLE), pip et la documentation Python ne sont pas inclus.

source: The embedded distribution does not include the `Microsoft C Runtime <https://www.microsoft.com/en-us/download/details.aspx?id=48145>`_ and it is the responsibility of the application installer to provide this. The runtime may have already been installed on a user's system previously or automatically via Windows Update, and can be detected by finding ``ucrtbase.dll`` in the system directory.
fr: La distribution intégrée n'inclut pas le `Microsoft C Runtime <https://www.microsoft.com/en-us/download/details.aspx?id=48145>`_ et il est de la responsabilité de l'installateur d'application de le fournir. Le *runtime* peut avoir déjà été installé sur le système d'un utilisateur précédemment ou automatiquement via Windows Update, et peut être détecté en trouvant ``ucrtbase.dll`` dans le répertoire système.

source: Third-party packages should be installed by the application installer alongside the embedded distribution. Using pip to manage dependencies as for a regular Python installation is not supported with this distribution, though with some care it may be possible to include and use pip for automatic updates. In general, third-party packages should be treated as part of the application ("vendoring") so that the developer can ensure compatibility with newer versions before providing updates to users.
fr: Les paquets tiers doivent être installés par le programme d'installation de l'application parallèlement à la distribution embarquée. L'utilisation de pip pour gérer les dépendances comme pour une installation Python régulière n'est pas prise en charge avec cette distribution, mais il reste possible d'inclure et d'utiliser pip pour les mises à jour automatiques. En général, les paquets tiers doivent être traités dans le cadre de l'application (*vendoring*) afin que le développeur puisse assurer la compatibilité avec les versions plus récentes avant de fournir des mises à jour aux utilisateurs.

source: The two recommended use cases for this distribution are described below.
fr: Les deux cas d'utilisation recommandés pour cette distribution sont décrits ci-dessous.

source: Python Application
fr: Application Python

source: An application written in Python does not necessarily require users to be aware of that fact. The embedded distribution may be used in this case to include a private version of Python in an install package. Depending on how transparent it should be (or conversely, how professional it should appear), there are two options.
fr: Une application écrite en Python n'exige pas nécessairement que les utilisateurs soient au courant de ce fait. La distribution embarquée peut être utilisée dans ce cas pour inclure une version privée de Python dans un package d'installation. Selon la façon dont il devrait être transparent (ou inversement, à quel point il doit paraître professionnel), il y a deux options.

source: Using a specialized executable as a launcher requires some coding, but provides the most transparent experience for users. With a customized launcher, there are no obvious indications that the program is running on Python: icons can be customized, company and version information can be specified, and file associations behave properly. In most cases, a custom launcher should simply be able to call ``Py_Main`` with a hard-coded command line.
fr: L'utilisation d'un exécutable spécialisé en tant que lanceur nécessite de la programmation, mais fournit l'expérience la plus transparente pour les utilisateurs. Avec un lanceur personnalisé, il n'y a pas d'indications évidentes que le programme s'exécute sur Python : les icônes peuvent être personnalisées, les informations de la société et de la version peuvent être spécifiées, et les associations de fichiers se comportent correctement. Dans la plupart des cas, un lanceur personnalisé devrait simplement pouvoir appeler ``Py_Main`` avec une ligne de commande codée en dur.

source: The simpler approach is to provide a batch file or generated shortcut that directly calls the ``python.exe`` or ``pythonw.exe`` with the required command-line arguments. In this case, the application will appear to be Python and not its actual name, and users may have trouble distinguishing it from other running Python processes or file associations.
fr: L'approche la plus simple consiste à fournir un fichier batch ou un raccourci généré qui appelle directement le ``python.exe`` ou ``pythonw.exe`` avec les arguments de ligne de commande requis. Dans ce cas, l'application semble être Python et non son nom réel, et les utilisateurs peuvent avoir du mal à le distinguer des autres processus Python en cours d'exécution ou des associations de fichiers.

source: With the latter approach, packages should be installed as directories alongside the Python executable to ensure they are available on the path. With the specialized launcher, packages can be located in other locations as there is an opportunity to specify the search path before launching the application.
fr: Avec cette dernière approche, les packages doivent être installés en tant que répertoires à côté de l'exécutable Python pour s'assurer qu'ils soient visibles par Python. Avec le lanceur spécialisé, les paquets peuvent être installés dans d'autres emplacements car il y a une possibilité de spécifier le chemin de recherche avant de lancer l'application.

source: Embedding Python
fr: Embarquer Python

source: Applications written in native code often require some form of scripting language, and the embedded Python distribution can be used for this purpose. In general, the majority of the application is in native code, and some part will either invoke ``python.exe`` or directly use ``python3.dll``. For either case, extracting the embedded distribution to a subdirectory of the application installation is sufficient to provide a loadable Python interpreter.
fr: Les applications écrites en code natif nécessitent souvent une certaine forme de langage de *scripting*, et la distribution Python intégrée peut être utilisée à cette fin. En général, la majorité de l'application est dans le code natif, qui soit invoque ``python.exe`` soit utilise directement ``python3.dll``. Dans les deux cas, l'extraction de la distribution intégrée dans un sous-répertoire de l'installation de l'application est suffisante pour fournir un interpréteur Python chargeable.

source: As with the application use, packages can be installed to any location as there is an opportunity to specify search paths before initializing the interpreter. Otherwise, there is no fundamental differences between using the embedded distribution and a regular installation.
fr: Comme pour l'utilisation de l'application, les paquets peuvent être installés sur n'importe quel emplacement, car il est possible de spécifier des chemins de recherche avant d'initialiser l'interpréteur. Sinon, il n'y a pas de différences fondamentales entre l'utilisation de la distribution embarquée et une installation classique.

source: Alternative bundles
fr: Paquets alternatifs

source: Besides the standard CPython distribution, there are modified packages including additional functionality. The following is a list of popular versions and their key features:
fr: À part la distribution standard CPython, il y a des paquets modifiés incluant des fonctionnalités additionnelles. La liste qui suit est une liste de versions populaires et de leurs fonctionnalités principales :

source: Installer with multi-platform compatibility, documentation, PyWin32
fr: Installeur avec une compatibilité multi-plateforme, de la documentation, et *PyWin32*

source: Popular scientific modules (such as numpy, scipy and pandas) and the ``conda`` package manager.
fr: Des modules scientifiques populaires (comme *numpy*, *scipy* et *pandas*) et le gestionnaire de paquets ``conda``.

source: A "comprehensive Python analysis environment" with editors and other development tools.
fr: Un "environnement d'analyse complet Python" avec des éditeurs et autres outils de développement.

source: Windows-specific distribution with prebuilt scientific packages and tools for building packages.
fr: Distribution spécifique à Windows avec des paquets scientifiques pré-compilés et des outils pour construire des paquets.

source: Note that these packages may not include the latest versions of Python or other libraries, and are not maintained or supported by the core Python team.
fr: Notez que ces paquets peuvent ne pas inclure la dernière version de Python ou d'autres bibliothèques, et ne sont pas maintenus ni supportés par les *core devs* Python.

source: Configuring Python
fr: Configurer Python

source: To run Python conveniently from a command prompt, you might consider changing some default environment variables in Windows. While the installer provides an option to configure the PATH and PATHEXT variables for you, this is only reliable for a single, system-wide installation. If you regularly use multiple versions of Python, consider using the :ref:`launcher`.
fr: Pour exécuter Python confortablement à partir d'une invite de commandes, vous pouvez envisager de modifier certaines variables d'environnement par défaut dans Windows. Bien que l'installateur offre une option pour configurer les variables ``PATH`` et ``PATHEXT`` pour vous, ce n'est fiable que pour une seule installation à l'échelle du système. Si vous utilisez régulièrement plusieurs versions de Python, pensez à utiliser le :ref:`launcher`.

source: Excursus: Setting environment variables
fr: Digression : Définition des variables d'environnement

source: Windows allows environment variables to be configured permanently at both the User level and the System level, or temporarily in a command prompt.
fr: Windows permet de configurer les variables d'environnement de façon permanente au niveau de l'utilisateur et du système, ou temporairement dans une invite de commandes.

source: To temporarily set environment variables, open Command Prompt and use the :command:`set` command:
fr: Pour définir temporairement les variables d'environnement, ouvrez l'invite de commandes et utilisez la commande :command:`set` :

source: These changes will apply to any further commands executed in that console, and will be inherited by any applications started from the console.
fr: Ces modifications s'appliqueront à toutes les autres commandes exécutées dans cette console et seront héritées par toutes les applications démarrées à partir de cette console.

source: Including the variable name within percent signs will expand to the existing value, allowing you to add your new value at either the start or the end. Modifying :envvar:`PATH` by adding the directory containing :program:`python.exe` to the start is a common way to ensure the correct version of Python is launched.
fr: Un nom de variable entre des signes pour cent sera remplacé par sa valeur, vous permettant d'ajouter votre nouvelle valeur au début ou à la fin. Ajouter :program:`python.exe` au début de :envvar:`PATH` est un moyen courant de s'assurer que la version correcte de Python est lancée.

source: To permanently modify the default environment variables, click Start and search for 'edit environment variables', or open System properties, :guilabel:`Advanced system settings` and click the :guilabel:`Environment Variables` button. In this dialog, you can add or modify User and System variables. To change System variables, you need non-restricted access to your machine (i.e. Administrator rights).
fr: Pour modifier définitivement les variables d'environnement par défaut, recherchez « modifier les variables d'environnement », via le menu démarrer, ou ouvrez « Propriétés Système », :guilabel:`Paramètres Système Avancés` et cliquez sur le bouton :guilabel:`Variables d'Environnement`. Dans cette boîte de dialogue, vous pouvez ajouter ou modifier des variables utilisateurs et systèmes. Pour modifier les variables systèmes, vous avez besoin d'un accès non restreint à votre ordinateur (c'est-à-dire aux droits d'administrateur).

source: Windows will concatenate User variables *after* System variables, which may cause unexpected results when modifying :envvar:`PATH`.
fr: Windows va concaténer les variables utilisateurs *après* les variables systèmes, ce qui peut provoquer des résultats inattendus lors de la modification de :envvar:`PATH`.

source: The :envvar:`PYTHONPATH` variable is used by all versions of Python 2 and Python 3, so you should not permanently configure this variable unless it only includes code that is compatible with all of your installed Python versions.
fr: La variable :envvar:`PYTHONPATH` est utilisée par toutes les versions de Python 2 et Python 3, vous ne devez donc pas configurer cette variable de façon permanente à moins qu'elle n'ajoute que du code compatible avec toutes les versions de Python installées.

source: Environment variables in Windows NT
fr: Variables d'environnement dans Windows NT

source: The SET command, for temporarily modifying environment variables
fr: La commande SET, pour modifier temporairement les variables d'environnement

source: The SETX command, for permanently modifying environment variables
fr: La commande SETX, pour modifier de façon permanente les variables d'environnement

source: How To Manage Environment Variables in Windows XP
fr: Comment gérer les variables d'environnement sous Windows XP

source: Setting Environment variables, Louis J. Farrugia
fr: Définir les variables d'environnement, *Louis J. Farrugia*

source: Finding the Python executable
fr: Trouver l'exécutable Python

source: Besides using the automatically created start menu entry for the Python interpreter, you might want to start Python in the command prompt. The installer has an option to set that up for you.
fr: En plus d'utiliser l'entrée du menu Démarrer automatiquement créée pour l'interpréteur Python, vous souhaiterez peut-être démarrer Python depuis l'invite de commandes. L'installateur a une option pour installer cela pour vous.
