Repository: python/python-docs-fr
Catalog: using/windows.po
Languages: fr

source: If an environment variable ``PYLAUNCH_DEBUG`` is set (to any value), the launcher will print diagnostic information to stderr (i.e. to the console). While this information manages to be simultaneously verbose *and* terse, it should allow you to see what versions of Python were located, why a particular version was chosen and the exact command-line used to execute the target Python.
fr: Si une variable d'environnement ``PYLAUNCH_DEBUG`` est définie (à n'importe quelle valeur), le lanceur affichera des informations de diagnostic sur *stderr* (c'est-à-dire sur la console). Bien que ces informations parviennent à être en même temps nombreuses et concises, elles devraient vous permettre de voir quelles versions de Python ont été trouvées, pourquoi une version particulière a été choisie et la ligne de commande exacte utilisée pour exécuter le Python cible.

source: Finding modules
fr: Recherche de modules

source: Python usually stores its library (and thereby your site-packages folder) in the installation directory. So, if you had installed Python to :file:`C:\\Python\\`, the default library would reside in :file:`C:\\Python\\Lib\\` and third-party modules should be stored in :file:`C:\\Python\\Lib\\site-packages\\`.
fr: Python stocke généralement sa bibliothèque (et donc votre dossier ``site-packages``) dans le répertoire d'installation. Donc, si vous aviez installé Python dans :file:`C:\\Python\\`, la bibliothèque par défaut résiderait dans :file:`C:\\Python\\Lib\\` et les modules tiers devraient être stockés dans :file:`C:\\Python\\Lib\\site-packages\\`.

source: To completely override :data:`sys.path`, create a ``._pth`` file with the same name as the DLL (``python37._pth``) or the executable (``python._pth``) and specify one line for each path to add to :data:`sys.path`. The file based on the DLL name overrides the one based on the executable, which allows paths to be restricted for any program loading the runtime if desired.
fr: Pour remplacer complètement :data:`sys.path`, créez un fichier ``._pth`` portant le même nom que le DLL (``python37._pth``) ou l'exécutable (``python._pth``) et spécifiez une ligne pour chaque chemin à ajouter à :data:`sys.path`. Le fichier basé sur le nom de la DLL remplace celui basé sur l'exécutable, qui permet aux chemins d'être restreints pour tout programme chargeant le *runtime* si désiré.

source: When the file exists, all registry and environment variables are ignored, isolated mode is enabled, and :mod:`site` is not imported unless one line in the file specifies ``import site``. Blank paths and lines starting with ``#`` are ignored. Each path may be absolute or relative to the location of the file. Import statements other than to ``site`` are not permitted, and arbitrary code cannot be specified.
fr: Lorsque le fichier existe, toutes les variables de registre et d'environnement sont ignorées, le mode isolé est activé et :mod:`site` n'est pas importé, sauf si une ligne du fichier spécifie ``import site``. Les chemins et les lignes vides commençant par ``#`` sont ignorés. Chaque chemin d'accès peut être absolu ou relatif à l'emplacement du fichier. Les importations autres que vers *site* ne sont pas autorisées, ni n'importe quelle instruction Python.

source: Note that ``.pth`` files (without leading underscore) will be processed normally by the :mod:`site` module when ``import site`` has been specified.
fr: Notez que les fichiers ``.pth`` (sans `underscore` précédant le ``pth``) seront traités normalement par le module :mod:`site` lorsque ``import site`` a été spécifié.

source: When no ``._pth`` file is found, this is how :data:`sys.path` is populated on Windows:
fr: Lorsque aucun fichier ``._pth`` n'est trouvé, voilà comment :data:`sys.path` est construit sur Windows :

source: An empty entry is added at the start, which corresponds to the current directory.
fr: Une entrée vide est ajoutée au début, qui correspond au répertoire courant.

source: If the environment variable :envvar:`PYTHONPATH` exists, as described in :ref:`using-on-envvars`, its entries are added next. Note that on Windows, paths in this variable must be separated by semicolons, to distinguish them from the colon used in drive identifiers (``C:\`` etc.).
fr: Si la variable d'environnement :envvar:`PYTHONPATH` existe, comme décrit dans :ref:`using-on-envvars`, ses entrées sont ajoutées ensuite. Notez que sur Windows, les chemins d'accès de cette variable doivent être séparés par des points-virgules, pour les distinguer des deux points utilisés dans les identificateurs de lecteur (``C:\`` etc.).

source: Additional "application paths" can be added in the registry as subkeys of :samp:`\\SOFTWARE\\Python\\PythonCore\\{version}\\PythonPath` under both the ``HKEY_CURRENT_USER`` and ``HKEY_LOCAL_MACHINE`` hives. Subkeys which have semicolon-delimited path strings as their default value will cause each path to be added to :data:`sys.path`. (Note that all known installers only use HKLM, so HKCU is typically empty.)
fr: Des "chemins d'accès d'application" supplémentaires peuvent être ajoutés dans le registre en tant que sous-clés de :samp:`\\SOFTWARE\\Python\\PythonCore\\{version}\\PythonPath` sous les ruches ``HKEY_CURRENT_USER`` et ``HKEY_LOCAL_MACHINE``. Les sous-clés qui ont des chaînes de chemin délimitées par des points-virgules comme valeur par défaut entraînent l'ajout de chaque chemin d'accès à :data:`sys.path`. (Notez que tous les installateurs connus utilisent seulement HKLM, donc HKCU est généralement vide.)

source: If the environment variable :envvar:`PYTHONHOME` is set, it is assumed as "Python Home". Otherwise, the path of the main Python executable is used to locate a "landmark file" (either ``Lib\os.py`` or ``pythonXY.zip``) to deduce the "Python Home". If a Python home is found, the relevant sub-directories added to :data:`sys.path` (``Lib``, ``plat-win``, etc) are based on that folder. Otherwise, the core Python path is constructed from the PythonPath stored in the registry.
fr: Si la variable d'environnement :envvar:`PYTHONHOME` est définie, elle est supposée comme "Python Home". Sinon, le chemin de l'exécutable principal de Python est utilisé pour chercher un "fichier de repère" (soit ``Lib\os.py`` ou ``pythonXY.zip``) pour déduire le "Python Home". Si un "Python Home" est trouvé, les sous-répertoires correspondants ajoutés à :data:`sys.path` (``Lib``, ``plat-win``, etc) sont basés sur ce dossier. Sinon, le chemin d'accès Python principal est construit à partir du PythonPath stocké dans le registre.

source: If the Python Home cannot be located, no :envvar:`PYTHONPATH` is specified in the environment, and no registry entries can be found, a default path with relative entries is used (e.g. ``.\Lib;.\plat-win``, etc).
fr: Si le "Python Home" ne peut pas être trouvé, :envvar:`PYTHONPATH` n'est pas spécifié dans l'environnement et aucune entrée de registre ne peut être trouvée, un chemin par défaut avec des entrées relatives est utilisé (par exemple ``.\Lib`` ; ``.\plat-win``, etc.).

source: If a ``pyvenv.cfg`` file is found alongside the main executable or in the directory one level above the executable, the following variations apply:
fr: Si un fichier ``pyvenv.cfg`` se trouve à côté de l'exécutable principal ou dans le répertoire un niveau au-dessus de l'exécutable, les variantes suivantes s'appliquent :

source: If ``home`` is an absolute path and :envvar:`PYTHONHOME` is not set, this path is used instead of the path to the main executable when deducing the home location.
fr: Si ``home`` est un chemin absolu et :envvar:`PYTHONHOME` n'est pas défini, ce chemin d'accès est utilisé au lieu du chemin d'accès à l'exécutable principal lors de la déduction de l'emplacement du `home`.

source: The end result of all this is:
fr: Le résultat final de tout ceci est :

source: When running :file:`python.exe`, or any other .exe in the main Python directory (either an installed version, or directly from the PCbuild directory), the core path is deduced, and the core paths in the registry are ignored. Other "application paths" in the registry are always read.
fr: Lors de l'exécution de :file:`python.exe`, ou tout autre ``.exe`` dans le répertoire principal de Python (soit une version installée, soit directement à partir du répertoire PCbuild), le chemin principal est déduit et les chemins d'accès principaux dans le Registre sont ignorés. D'autres "chemins d'application" dans le registre sont toujours lus.

source: When Python is hosted in another .exe (different directory, embedded via COM, etc), the "Python Home" will not be deduced, so the core path from the registry is used. Other "application paths" in the registry are always read.
fr: Lorsque Python est hébergé dans un autre fichier ``.exe`` (répertoire différent, intégré via COM, etc.), le "Python Home" ne sera pas déduit, de sorte que le chemin d'accès principal du registre est utilisé. D'autres "chemins d'application" dans le registre sont toujours lus.

source: If Python can't find its home and there are no registry value (frozen .exe, some very strange installation setup) you get a path with some default, but relative, paths.
fr: Si Python ne peut pas trouver son "home" et il n'y a pas de valeur de registre (*.exe* gelé, une installation très étrange) vous obtenez un chemin d'accès avec certains chemins par défaut, mais relatif.

source: For those who want to bundle Python into their application or distribution, the following advice will prevent conflicts with other installations:
fr: Pour ceux qui veulent intégrer Python dans leur application ou leur distribution, les conseils suivants empêcheront les conflits avec d'autres installations :

source: Include a ``._pth`` file alongside your executable containing the directories to include. This will ignore paths listed in the registry and environment variables, and also ignore :mod:`site` unless ``import site`` is listed.
fr: Incluez un fichier ``._pth`` à côté de votre exécutable contenant les répertoires à inclure. Ceci ignorera les chemins répertoriés dans le registre et les variables d'environnement, et ignorera également :mod:`site` à moins que ``import site`` soit listé.

source: If you are loading :file:`python3.dll` or :file:`python37.dll` in your own executable, explicitly call :c:func:`Py_SetPath` or (at least) :c:func:`Py_SetProgramName` before :c:func:`Py_Initialize`.
fr: Si vous chargez :file:`python3.dll` ou :file:`python37.dll` dans votre propre exécutable, appelez explicitement :c:func:`Py_SetPath` ou (au moins) :c:func:`Py_SetProgramName` avant :c:func:`Py_Initialize`.

source: Clear and/or overwrite :envvar:`PYTHONPATH` and set :envvar:`PYTHONHOME` before launching :file:`python.exe` from your application.
fr: Effacer et/ou écraser :envvar:`PYTHONPATH` et configurez :envvar:`PYTHONHOME` avant de lancer le :file:`python.exe` de votre application.

source: If you cannot use the previous suggestions (for example, you are a distribution that allows people to run :file:`python.exe` directly), ensure that the landmark file (:file:`Lib\\os.py`) exists in your install directory. (Note that it will not be detected inside a ZIP file, but a correctly named ZIP file will be detected instead.)
fr: Si vous ne pouvez pas utiliser les suggestions précédentes (par exemple, vous êtes une distribution qui permet aux gens d'exécuter :file:`python.exe` directement), assurez-vous que le point de repère :file:`Lib\\os.py` existe dans votre répertoire d'installation. (Notez qu'il ne sera pas détecté à l'intérieur d'un fichier ZIP, mais un fichier ZIP correctement nommé sera détecté à la place.)

source: These will ensure that the files in a system-wide installation will not take precedence over the copy of the standard library bundled with your application. Otherwise, your users may experience problems using your application. Note that the first suggestion is the best, as the others may still be susceptible to non-standard paths in the registry and user site-packages.
fr: Ceux-ci garantiront que les fichiers d'une installation à l'échelle du système n'auront pas la priorité sur la copie de la bibliothèque standard livrée avec votre application. Sinon, vos utilisateurs pourraient rencontrer des problèmes en utilisant votre application. Notez que la première suggestion est la meilleure, car les autres peuvent encore être sensibles aux chemins non-standard dans le registre et le *site-packages* utilisateur.

source: Adds ``._pth`` file support and removes ``applocal`` option from ``pyvenv.cfg``.
fr: Ajout de la gestion des ``._pth`` et suppression de l'option ``applocal`` de ``pyvenv.cfg``.

source: Adds ``pythonXX.zip`` as a potential landmark when directly adjacent to the executable.
fr: Ajout de ``pythonXX.zip`` comme point de repère potentiel lorsqu'il est directement adjacent à l'exécutable.

source: Modules specified in the registry under ``Modules`` (not ``PythonPath``) may be imported by :class:`importlib.machinery.WindowsRegistryFinder`. This finder is enabled on Windows in 3.6.0 and earlier, but may need to be explicitly added to :attr:`sys.meta_path` in the future.
fr: Les modules spécifiés dans le registre sous ``Modules`` (pas ``PythonPath``) peuvent être importés par :class:`importlib.machinery.WindowsRegistryFinder`. Ce Finder est activé sur Windows dans 3.6.0 et plus récent, mais il pourrait être nécessaire de l'ajouter explicitement à :attr:`sys.meta_path` à l'avenir.

source: Additional modules
fr: Modules supplémentaires

source: Even though Python aims to be portable among all platforms, there are features that are unique to Windows. A couple of modules, both in the standard library and external, and snippets exist to use these features.
fr: Même si Python a l'ambition d'être portable parmi toutes les plates-formes, il existe des fonctionnalités propres à Windows. Certains modules, à la fois dans la bibliothèque standard et externe, et des exemples existent pour utiliser ces fonctionnalités.

source: The Windows-specific standard modules are documented in :ref:`mswin-specific-services`.
fr: Les modules standard de Windows sont documentés dans :ref:`mswin-specific-services`.

source: The `PyWin32 <https://pypi.org/project/pywin32>`_ module by Mark Hammond is a collection of modules for advanced Windows-specific support. This includes utilities for:
fr: Le module `PyWin32 <https://pypi.org/project/pywin32>`_ de Mark Hammond est une collection de modules pour un support avancé spécifique à Windows. Cela inclut les services pour :

source: Win32 API calls
fr: Appels à l'API Win32

source: Registry
fr: Registre

source: Event log
fr: Journal d'événement

source: `Microsoft Foundation Classes <https://msdn.microsoft.com/en-us/library/fe1cf721%28VS.80%29.aspx>`_ (MFC) user interfaces
fr: `Microsoft Foundation Classes <http://msdn.microsoft.com/en-us/library/fe1cf721%28VS.80%29.aspx>`_ (MFC) interfaces utilisateur

source: `PythonWin <https://web.archive.org/web/20060524042422/ https://www.python.org/windows/pythonwin/>`_ is a sample MFC application shipped with PyWin32. It is an embeddable IDE with a built-in debugger.
fr: `PythonWin <http://web.archive.org/web/20060524042422/ http://www.python.org/windows/pythonwin/>`_ est un exemple d'application MFC livrée avec PyWin32. Il s'agit d'un IDE embarqué avec débogueur intégré.

source: by Tim Golden
fr: par Tim Golden

source: by David and Paul Boddie
fr: par David et Paul Boddie

source: `cx_Freeze <https://anthony-tuininga.github.io/cx_Freeze/>`_ is a :mod:`distutils` extension (see :ref:`extending-distutils`) which wraps Python scripts into executable Windows programs (:file:`{*}.exe` files). When you have done this, you can distribute your application without requiring your users to install Python.
fr: `cx_Freeze <https://anthony-tuininga.github.io/cx_Freeze/>`_ est une extension :mod:`distutils` (voir :ref:`extending-distutils`) qui encapsule des scripts Python dans des programmes exécutables Windows (Fichiers :file:`{*}.exe`). Lorsque vous l'avez fait, vous pouvez distribuer votre application sans demander à vos utilisateurs d'installer Python.

source: Since Python's advanced terminal handling layer, :mod:`curses`, is restricted to Unix-like systems, there is a library exclusive to Windows as well: Windows Console I/O for Python.
fr: Depuis la couche avancée de gestion de terminal de Python, :mod:`curses`, est limité aux systèmes de type UNIX, il existe une bibliothèque exclusive à Windows : *Windows Console I/O for Python*.

source: `WConio <http://newcenturycomputers.net/projects/wconio.html>`_ is a wrapper for Turbo-C's :file:`CONIO.H`, used to create text user interfaces.
fr: `WConio <http://newcenturycomputers.net/projects/wconio.html>`_ est un *wrapper* pour les fichiers Turbo-C :file:`CONIO.H`, utilisé pour créer des interfaces texte utilisateur.

source: Compiling Python on Windows
fr: Compiler Python sous Windows

source: If you want to compile CPython yourself, first thing you should do is get the `source <https://www.python.org/downloads/source/>`_. You can download either the latest release's source or just grab a fresh `checkout <https://devguide.python.org/setup/#getting-the-source-code>`_.
fr: Si vous voulez compiler CPython vous-même, la première chose à faire est obtenir la `source <https://www.python.org/downloads/source/>`_. Vous pouvez télécharger soit la source de la dernière version ou tout simplement prendre un `checkout <https://devguide.python.org/setup/#getting-the-source-code>`_.

source: The source tree contains a build solution and project files for Microsoft Visual Studio 2015, which is the compiler used to build the official Python releases. These files are in the :file:`PCbuild` directory.
fr: L'arborescence source contient une solution de compilation et des fichiers projet pour Microsoft Visual Studio 2015, qui est le compilateur utilisé pour générer les versions officielles de Python. Ces fichiers se trouvent dans le répertoire :file:`PCbuild`.

source: Check :file:`PCbuild/readme.txt` for general information on the build process.
fr: Consultez :file:`PC/readme.txt` pour des informations générales sur le processus de construction.

source: For extension modules, consult :ref:`building-on-windows`.
fr: Pour les modules d'extension, consultez :ref:`building-on-windows`.

source: or "Creating Python extensions in C/C++ with SWIG and compiling them with MinGW gcc under Windows" or "Installing Python extension with distutils and without Microsoft Visual C++" by Sébastien Sauvage, 2003
fr: ou "*Creating Python extensions in C/C++ with SWIG and compiling them with MinGW gcc under Windows*" ou "*Installing Python extension with distutils and without Microsoft Visual C++*" par Sébastien Sauvage, 2003

source: Other Platforms
fr: Autres plateformes

source: With ongoing development of Python, some platforms that used to be supported earlier are no longer supported (due to the lack of users or developers). Check :pep:`11` for details on all unsupported platforms.
fr: Avec le développement continu de Python, certaines plateformes qui étaient auparavant prises en charge ne sont plus prises en charge (en raison du manque d'utilisateurs ou de développeurs). Voir :pep:`11` pour plus de détails sur toutes les plateformes non prises en charge.

source: `Windows CE <http://pythonce.sourceforge.net/>`_ is still supported.
fr: `Windows CE <http://pythonce.sourceforge.net/>`_ est toujours pris en charge.

source: The `Cygwin <https://cygwin.com/>`_ installer offers to install the Python interpreter as well (cf. `Cygwin package source <ftp://ftp.uni-erlangen.de/pub/pc/gnuwin32/cygwin/mirrors/cygnus/ release/python>`_, `Maintainer releases <http://www.tishler.net/jason/software/python/>`_)
fr: L’installateur `Cygwin <https://cygwin.com/>`_ offre d’installer l’interpréteur Python (cf. `Cygwin package source <ftp://ftp.uni-erlangen.de/pub/pc/gnuwin32/cygwin/mirrors/cygnus/ release/Python>`_, `Maintainer releases <http://www.tishler.net/jason/software/Python/>`_)

source: See `Python for Windows <https://www.python.org/downloads/windows/>`_ for detailed information about platforms with pre-compiled installers.
fr: Voir `Python pour Windows <https://www.python.org/downloads/windows/>`_ pour des instructions détaillées sur les plateformes avec installateurs pré-compilés.
