Repository: python/python-docs-fr
Catalog: howto/curses.po
Languages: fr

source: Attributes allow displaying text in highlighted forms such as boldface, underline, reverse code, or in color. They'll be explained in more detail in the next subsection.
fr: Les attributs permettent de mettre en valeur du texte : gras, souligné, mode vidéo inversé ou en couleur. Nous les voyons plus en détail dans la section suivante.

source: The :meth:`~curses.window.addstr` method takes a Python string or bytestring as the value to be displayed. The contents of bytestrings are sent to the terminal as-is. Strings are encoded to bytes using the value of the window's :attr:`encoding` attribute; this defaults to the default system encoding as returned by :func:`locale.getpreferredencoding`.
fr: La méthode :meth:`~curses.window.addstr` prend en argument une chaîne ou une suite d'octets Python. Le contenu des chaînes d'octets est envoyé vers le terminal tel quel. Les chaînes sont encodées en octets en utilisant la valeur de l'attribut :attr:`encoding` de la fenêtre ; c'est par défaut l'encodage du système tel que renvoyé par :func:`locale.getpreferredencoding`.

source: The :meth:`~curses.window.addch` methods take a character, which can be either a string of length 1, a bytestring of length 1, or an integer.
fr: Les méthodes :meth:`~curses.window.addch` prennent un caractère, soit sous la forme d'une chaîne de longueur 1, d'une chaîne d'octets de longueur 1 ou d'un entier.

source: Constants are provided for extension characters; these constants are integers greater than 255. For example, :const:`ACS_PLMINUS` is a +/- symbol, and :const:`ACS_ULCORNER` is the upper left corner of a box (handy for drawing borders). You can also use the appropriate Unicode character.
fr: Des constantes sont disponibles pour étendre les caractères ; ces constantes sont des entiers supérieurs à 255. Par exemple, :const:`ACS_PLMINUS` correspond au symbole +/- et :const:`ACS_ULCORNER` correspond au coin en haut et à gauche d'une boîte (utile pour dessiner des encadrements). Vous pouvez aussi utiliser les caractères Unicode adéquats.

source: Windows remember where the cursor was left after the last operation, so if you leave out the *y,x* coordinates, the string or character will be displayed wherever the last operation left off. You can also move the cursor with the ``move(y,x)`` method. Because some terminals always display a flashing cursor, you may want to ensure that the cursor is positioned in some location where it won't be distracting; it can be confusing to have the cursor blinking at some apparently random location.
fr: Windows se souvient de l'endroit où le curseur était positionné lors de la dernière opération, de manière à ce que si vous n'utilisez pas les coordonnées *y,x*, l'affichage se produit au dernier endroit utilisé. Vous pouvez aussi déplacer le curseur avec la méthode ``move(y,x)``. Comme certains terminaux affichent un curseur clignotant, vous pouvez ainsi vous assurer que celui-ci est positionné à un endroit où il ne distrait pas l'utilisateur (il peut être déroutant d'avoir un curseur qui clignote à des endroits apparemment aléatoires).

source: If your application doesn't need a blinking cursor at all, you can call ``curs_set(False)`` to make it invisible. For compatibility with older curses versions, there's a ``leaveok(bool)`` function that's a synonym for :func:`~curses.curs_set`. When *bool* is true, the curses library will attempt to suppress the flashing cursor, and you won't need to worry about leaving it in odd locations.
fr: Si votre application n'a pas besoin d'un curseur clignotant, vous pouvez appeler ``curs_set(False)`` pour le rendre invisible. Par souci de compatibilité avec les anciennes versions de *curses*, il existe la fonction ``leaveok(bool)`` qui est un synonyme de :func:`~curses.curs_set`. Quand *bool* vaut ``True``, la bibliothèque *curses* essaie de supprimer le curseur clignotant et vous n'avez plus besoin de vous soucier de le laisser trainer à des endroits bizarres.

source: Attributes and Color
fr: Attributs et couleurs

source: Characters can be displayed in different ways. Status lines in a text-based application are commonly shown in reverse video, or a text viewer may need to highlight certain words. curses supports this by allowing you to specify an attribute for each cell on the screen.
fr: Les caractères peuvent être affichés de différentes façons. Les lignes de statut des applications en mode texte sont généralement affichées en mode vidéo inversé ; vous pouvez avoir besoin de mettre en valeur certains mots. À ces fins, *curses* vous permet de spécifier un attribut pour chaque caractère à l'écran.

source: An attribute is an integer, each bit representing a different attribute. You can try to display text with multiple attribute bits set, but curses doesn't guarantee that all the possible combinations are available, or that they're all visually distinct. That depends on the ability of the terminal being used, so it's safest to stick to the most commonly available attributes, listed here.
fr: Un attribut est un entier dont chaque bit représente un attribut différent. Vous pouvez essayer d'afficher du texte avec plusieurs attributs définis simultanément mais *curses* ne garantit pas que toutes les combinaisons soient prises en compte ou que le résultat soit visuellement différent. Cela dépend de la capacité de chaque terminal utilisé, il est donc plus sage de se cantonner aux attributs les plus communément utilisés, dont la liste est fournie ci-dessous.

source: Attribute
fr: Attribut

source: Blinking text
fr: Texte clignotant

source: Extra bright or bold text
fr: Texte en surbrillance ou en gras

source: Half bright text
fr: Texte en demi-ton

source: Reverse-video text
fr: Texte en mode vidéo inversé

source: The best highlighting mode available
fr: Le meilleur mode de mis en valeur pour le texte

source: Underlined text
fr: Texte souligné

source: So, to display a reverse-video status line on the top line of the screen, you could code::
fr: Ainsi, pour mettre la ligne de statut située en haut de l'écran en mode vidéo inversé, vous pouvez coder ::

source: The curses library also supports color on those terminals that provide it. The most common such terminal is probably the Linux console, followed by color xterms.
fr: La bibliothèque *curses* gère également les couleurs pour les terminaux compatibles. Le plus répandu de ces terminaux est sûrement la console Linux, suivie par *xterm* en couleurs.

source: To use color, you must call the :func:`~curses.start_color` function soon after calling :func:`~curses.initscr`, to initialize the default color set (the :func:`curses.wrapper` function does this automatically). Once that's done, the :func:`~curses.has_colors` function returns TRUE if the terminal in use can actually display color. (Note: curses uses the American spelling 'color', instead of the Canadian/British spelling 'colour'. If you're used to the British spelling, you'll have to resign yourself to misspelling it for the sake of these functions.)
fr: Pour utiliser les couleurs, vous devez d'abord appeler la fonction :func:`~curses.start_color` juste après avoir appelé :func:`~curses.initscr` afin d'initialiser (la fonction :func:`curses.wrapper` le fait automatiquement). Ensuite, la fonction :func:`~curses.has_colors` renvoie ``True`` si le terminal utilisé gère les couleurs (note : *curses* utilise l'orthographe américaine *color* et non pas l'orthographe britannique ou canadienne *colour* ; si vous êtes habitué à l'orthographe britannique, vous devrez vous résigner à mal l'orthographier tant que vous utilisez *curses*).

source: The curses library maintains a finite number of color pairs, containing a foreground (or text) color and a background color. You can get the attribute value corresponding to a color pair with the :func:`~curses.color_pair` function; this can be bitwise-OR'ed with other attributes such as :const:`A_REVERSE`, but again, such combinations are not guaranteed to work on all terminals.
fr: La bibliothèque *curses* maintient un nombre restreint de paires de couleurs, constituées d'une couleur de texte (*foreground*) et de fond (*background*). Vous pouvez obtenir la valeur des attributs correspondant à une paire de couleur avec la fonction :func:`~curses.color_pair` ; cette valeur peut être combinée bit par bit (avec la fonction *OR*) avec les autres attributs tels que :const:`A_REVERSE`,mais là encore, de telles combinaisons risquent de ne pas fonctionner sur tous les terminaux.

source: An example, which displays a line of text using color pair 1::
fr: Un exemple d'affichage d'une ligne de texte en utilisant la paire de couleur 1 ::

source: As I said before, a color pair consists of a foreground and background color. The ``init_pair(n, f, b)`` function changes the definition of color pair *n*, to foreground color f and background color b. Color pair 0 is hard-wired to white on black, and cannot be changed.
fr: Comme indiqué auparavant, une paire de couleurs est constituée d'une couleur de texte et d'une couleur de fond. La fonction ``init_pair(n, f, b)`` change la définition de la paire de couleurs *n*, en définissant la couleur de texte à *f* et la couleur de fond à *b*. La paire de couleurs 0 est codée en dur à blanc sur noir et ne peut être modifiée.

source: Colors are numbered, and :func:`start_color` initializes 8 basic colors when it activates color mode. They are: 0:black, 1:red, 2:green, 3:yellow, 4:blue, 5:magenta, 6:cyan, and 7:white. The :mod:`curses` module defines named constants for each of these colors: :const:`curses.COLOR_BLACK`, :const:`curses.COLOR_RED`, and so forth.
fr: Les couleurs sont numérotées et :func:`start_color` initialise 8 couleurs basiques lors de l'activation du mode en couleurs. Ce sont : 0 pour noir (*black*), 1 pour rouge (*red*), 2 pour vert (*green*), 3 pour jaune (*yellow*), 4 pour bleu *(blue*), 5 pour magenta, 6 pour cyan et 7 pour blanc (*white*). Le module :mod:`curses` définit des constantes nommées pour chacune de ces couleurs : :const:`curses.COLOR_BLACK`, :const:`curses.COLOR_RED` et ainsi de suite.

source: Let's put all this together. To change color 1 to red text on a white background, you would call::
fr: Testons tout ça. Pour changer la couleur 1 à rouge sur fond blanc, appelez ::

source: When you change a color pair, any text already displayed using that color pair will change to the new colors. You can also display new text in this color with::
fr: Quand vous modifiez une paire de couleurs, tout le texte déjà affiché qui utilise cette paire de couleur voit les nouvelles couleurs s'appliquer à lui. Vous pouvez aussi afficher du nouveau texte dans cette couleur avec ::

source: Very fancy terminals can change the definitions of the actual colors to a given RGB value. This lets you change color 1, which is usually red, to purple or blue or any other color you like. Unfortunately, the Linux console doesn't support this, so I'm unable to try it out, and can't provide any examples. You can check if your terminal can do this by calling :func:`~curses.can_change_color`, which returns ``True`` if the capability is there. If you're lucky enough to have such a talented terminal, consult your system's man pages for more information.
fr: Les terminaux « de luxe » peuvent définir les couleurs avec des valeurs *RGB*. Cela vous permet de modifier la couleur 1, habituellement rouge, en violet ou bleu voire toute autre couleur selon votre goût. Malheureusement, la console Linux ne gère pas cette fonctionnalité, je suis donc bien incapable de la tester et de vous en fournir un exemple. Vous pouvez vérifier si votre terminal la prend en charge en appelant :func:`~curses.can_change_color`, qui renvoie ``True`` en cas de succès. Si vous avez la chance d'avoir un terminal aussi perfectionné, consultez les pages du manuel de votre système pour obtenir plus d'informations.

source: User Input
fr: Entrées de l'utilisateur

source: The C curses library offers only very simple input mechanisms. Python's :mod:`curses` module adds a basic text-input widget. (Other libraries such as `Urwid <https://pypi.org/project/urwid/>`_ have more extensive collections of widgets.)
fr: La bibliothèque C *curses* ne propose que quelques mécanismes très simples pour les entrées. Le module :mod:`curses` y ajoute un *widget* basique d'entrée de texte (d'autres bibliothèques telles que `Urwid <https://pypi.org/project/urwid/>`_ ont un ensemble de *widgets* plus conséquent).

source: There are two methods for getting input from a window:
fr: Il y a deux méthodes pour obtenir des entrées dans une fenêtre :

source: :meth:`~curses.window.getch` refreshes the screen and then waits for the user to hit a key, displaying the key if :func:`~curses.echo` has been called earlier. You can optionally specify a coordinate to which the cursor should be moved before pausing.
fr: :meth:`~curses.window.getch` rafraîchit l'écran et attend que l'utilisateur appuie sur une touche, affichant cette touche si :func:`~curses.echo` a été appelé auparavant. Vous pouvez en option spécifier des coordonnées où positionner le curseur avant la mise en pause ;

source: :meth:`~curses.window.getkey` does the same thing but converts the integer to a string. Individual characters are returned as 1-character strings, and special keys such as function keys return longer strings containing a key name such as ``KEY_UP`` or ``^G``.
fr: :meth:`~curses.window.getkey` effectue la même chose mais convertit l'entier en chaîne. Les caractères individuels sont renvoyés en chaînes de longueur 1 alors que les touches spéciales (telles que les touches de fonction) renvoient des chaînes plus longues contenant le nom de la touche (tel que ``KEY_UP`` ou ``^G``).

source: It's possible to not wait for the user using the :meth:`~curses.window.nodelay` window method. After ``nodelay(True)``, :meth:`getch` and :meth:`getkey` for the window become non-blocking. To signal that no input is ready, :meth:`getch` returns ``curses.ERR`` (a value of -1) and :meth:`getkey` raises an exception. There's also a :func:`~curses.halfdelay` function, which can be used to (in effect) set a timer on each :meth:`getch`; if no input becomes available within a specified delay (measured in tenths of a second), curses raises an exception.
fr: Il est possible de ne pas attendre l'utilisateur en utilisant la méthode de fenêtre :meth:`~curses.window.nodelay`. Après ``nodelay(True)``, les méthodes de fenêtre :meth:`getch` et :meth:`getkey` deviennent non bloquantes. Pour indiquer qu'aucune entrée n'a eu lieu, :meth:`getch` renvoie ``curses.ERR`` (ayant pour valeur −1) et :meth:`getkey` lève une exception. Il existe aussi la fonction :func:`~curses.halfdelay`, qui peut être utilisée pour définir un délai maximal pour chaque :meth:`getch` ; si aucune entrée n'est disponible dans le délai spécifié (mesuré en dixièmes de seconde), *curses* lève une exception.

source: The :meth:`getch` method returns an integer; if it's between 0 and 255, it represents the ASCII code of the key pressed. Values greater than 255 are special keys such as Page Up, Home, or the cursor keys. You can compare the value returned to constants such as :const:`curses.KEY_PPAGE`, :const:`curses.KEY_HOME`, or :const:`curses.KEY_LEFT`. The main loop of your program may look something like this::
fr: La méthode :meth:`getch` renvoie un entier ; s'il est entre 0 et 255, c'est le code ASCII de la touche pressée. Les valeurs supérieures à 255 sont des touches spéciales telles que Page Précédente, Accueil ou les touches du curseur. Vous pouvez comparer la valeur renvoyée aux constantes :const:`curses.KEY_PPAGE`, :const:`curses.KEY_HOME`, :const:`curses.KEY_LEFT`, etc. La boucle principale de votre programme pourrait ressembler à quelque chose comme ::

source: The :mod:`curses.ascii` module supplies ASCII class membership functions that take either integer or 1-character string arguments; these may be useful in writing more readable tests for such loops. It also supplies conversion functions that take either integer or 1-character-string arguments and return the same type. For example, :func:`curses.ascii.ctrl` returns the control character corresponding to its argument.
fr: Le module :mod:`curses.ascii` fournit des fonctions pour déterminer si l'entier ou la chaîne de longueur 1 passés en arguments font partie de la classe ASCII ; elles peuvent s'avérer utile pour écrire du code plus lisible dans ce genre de boucles. Il fournit également des fonctions de conversion qui prennent un entier ou une chaîne de longueur 1 en entrée et renvoient le type correspondant au nom de la fonction. Par exemple, :func:`curses.ascii.ctrl` renvoie le caractère de contrôle correspondant à son paramètre.

source: There's also a method to retrieve an entire string, :meth:`~curses.window.getstr`. It isn't used very often, because its functionality is quite limited; the only editing keys available are the backspace key and the Enter key, which terminates the string. It can optionally be limited to a fixed number of characters. ::
fr: Il existe aussi une méthode pour récupérer une chaîne entière, :meth:`~curses.window.getstr`. Elle n'est pas beaucoup utilisée car son utilité est limitée : les seules touches d'édition disponibles sont le retour arrière et la touche Entrée, qui termine la chaîne. Elle peut, en option, être limitée à un nombre fixé de caractères. ::

source: The :mod:`curses.textpad` module supplies a text box that supports an Emacs-like set of keybindings. Various methods of the :class:`~curses.textpad.Textbox` class support editing with input validation and gathering the edit results either with or without trailing spaces. Here's an example::
fr: Le module :mod:`curses.textpad` fournit un type de boîte texte qui gère des touches de fonctions à la façon d'\ *Emacs*. Plusieurs méthodes de la classe :class:`~curses.textpad.Textbox` gèrent l'édition avec la validation des entrées et le regroupement de l'entrée avec ou sans les espaces de début et de fin. Par exemple ::

source: See the library documentation on :mod:`curses.textpad` for more details.
fr: Consultez la documentation de la bibliothèque pour plus de détails sur :mod:`curses.textpad`.

source: For More Information
fr: Pour aller plus loin

source: This HOWTO doesn't cover some advanced topics, such as reading the contents of the screen or capturing mouse events from an xterm instance, but the Python library page for the :mod:`curses` module is now reasonably complete. You should browse it next.
fr: Ce guide pratique ne couvre pas certains sujets avancés, tels que la lecture du contenu de l'écran ou la capture des événements relatifs à la souris dans une instance *xterm*, mais la page de la bibliothèque Python du module :mod:`curses` est maintenant suffisamment complète. Nous vous encourageons à la parcourir.

source: If you're in doubt about the detailed behavior of the curses functions, consult the manual pages for your curses implementation, whether it's ncurses or a proprietary Unix vendor's. The manual pages will document any quirks, and provide complete lists of all the functions, attributes, and :const:`ACS_\*` characters available to you.
fr: Si vous vous posez des questions sur le fonctionnement précis de fonctions *curses*, consultez les pages de manuel de l'implémentation *curses* de votre système, que ce soit *ncurses* ou une version propriétaire Unix. Les pages de manuel documentent toutes les bizarreries et vous donneront les listes complètes des fonctions, attributs et codes :const:`ACS_\*` des caractères disponibles.

source: Because the curses API is so large, some functions aren't supported in the Python interface. Often this isn't because they're difficult to implement, but because no one has needed them yet. Also, Python doesn't yet support the menu library associated with ncurses. Patches adding support for these would be welcome; see `the Python Developer's Guide <https://devguide.python.org/>`_ to learn more about submitting patches to Python.
fr: Étant donné que l'API *curses* est si volumineuse, certaines fonctions ne sont pas prises en charge dans l'interface Python. Souvent, ce n'est pas parce qu'elles sont difficiles à implémenter, mais parce que personne n'en a eu encore besoin. De plus, Python ne prend pas encore en charge la bibliothèque de gestion des menus associée à *ncurses*. Les correctifs ajoutant cette prise en charge seraient bienvenus ; reportez-vous au `guide du développeur Python <https://devguide.python.org/>`_ pour apprendre comment soumettre des améliorations à Python.

source: `The ncurses man page <https://linux.die.net/man/3/ncurses>`_
fr: `La page de manuel ncurses <https://linux.die.net/man/3/ncurses>`_

source: `"Use curses... don't swear" <https://www.youtube.com/watch?v=eN1eZtjLEnU>`_: video of a PyCon 2013 talk on controlling terminals using curses or Urwid.
fr: `"Use curses... don't swear" <https://www.youtube.com/watch?v=eN1eZtjLEnU>`_ : vidéo d'une conférence lors de la PyCon 2013 sur la gestion des terminaux à l'aide de *curses* et *Urwid* (vidéo en anglais).
