Repository: python/python-docs-fr
Catalog: howto/curses.po
Languages: fr

source: Curses Programming with Python
fr: Programmation *Curses* avec Python

source: Author
fr: Auteur

source: Release
fr: Version

source: Abstract
fr: Résumé

source: This document describes how to use the :mod:`curses` extension module to control text-mode displays.
fr: Ce document décrit comment utiliser le module d'extension :mod:`curses` pour contrôler l'affichage en mode texte.

source: What is curses?
fr: Qu'est-ce que *curses* ?

source: The curses library supplies a terminal-independent screen-painting and keyboard-handling facility for text-based terminals; such terminals include VT100s, the Linux console, and the simulated terminal provided by various programs. Display terminals support various control codes to perform common operations such as moving the cursor, scrolling the screen, and erasing areas. Different terminals use widely differing codes, and often have their own minor quirks.
fr: La bibliothèque *curses* fournit une capacité de dessin à l'écran et de gestion du clavier indépendante du terminal pour les terminaux textuels ; ces terminaux comprennent les *VT100*, la console Linux et le terminal simulé fourni par divers programmes. Les terminaux d'affichage prennent en charge divers codes de commande pour effectuer des opérations courantes telles que déplacer le curseur, faire défiler l'écran et effacer des zones. Différents terminaux utilisent des codes très différents et ont souvent leurs propres bizarreries mineures.

source: In a world of graphical displays, one might ask "why bother"? It's true that character-cell display terminals are an obsolete technology, but there are niches in which being able to do fancy things with them are still valuable. One niche is on small-footprint or embedded Unixes that don't run an X server. Another is tools such as OS installers and kernel configurators that may have to run before any graphical support is available.
fr: Dans un monde d'affichages graphiques, on pourrait se demander « pourquoi s'embêter ? ». Il est vrai que les terminaux d'affichage caractère par caractère sont une technologie obsolète, mais il existe des niches pour lesquelles la possibilité de faire des choses fantaisistes est encore précieuse. En exemple de niche, on peut citer les systèmes de type Unix de petite taille ou embarqués qui n'utilisent pas de serveur X. Il y a aussi les outils tels que les installateurs d'OS et les outils de configuration du noyau qui doivent être exécutés avant qu'un support graphique ne soit disponible.

source: The curses library provides fairly basic functionality, providing the programmer with an abstraction of a display containing multiple non-overlapping windows of text. The contents of a window can be changed in various ways---adding text, erasing it, changing its appearance---and the curses library will figure out what control codes need to be sent to the terminal to produce the right output. curses doesn't provide many user-interface concepts such as buttons, checkboxes, or dialogs; if you need such features, consider a user interface library such as `Urwid <https://pypi.org/project/urwid/>`_.
fr: La bibliothèque *curses* propose des fonctionnalités assez basiques, fournissant au programmeur une abstraction d'affichage contenant plusieurs fenêtres de texte qui ne se chevauchent pas. Le contenu d'une fenêtre peut être modifié de différentes manières — en ajoutant du texte, en l'effaçant ou en changeant son apparence — et la bibliothèque *curses* trouve quels codes de contrôle doivent être envoyés au terminal pour produire le bon résultat. *curses* ne fournit pas beaucoup de concepts d'interface utilisateur tels que boutons, cases à cocher ou dialogues ; si vous avez besoin de telles fonctionnalités, pensez à une bibliothèque d'interface utilisateur comme `Urwid <https://pypi.org/project/urwid/>`_.

source: The curses library was originally written for BSD Unix; the later System V versions of Unix from AT&T added many enhancements and new functions. BSD curses is no longer maintained, having been replaced by ncurses, which is an open-source implementation of the AT&T interface. If you're using an open-source Unix such as Linux or FreeBSD, your system almost certainly uses ncurses. Since most current commercial Unix versions are based on System V code, all the functions described here will probably be available. The older versions of curses carried by some proprietary Unixes may not support everything, though.
fr: La bibliothèque *curses* a été écrite à l'origine pour BSD Unix ; les dernières versions *System V* d'Unix d'AT&T ont ajouté de nombreuses améliorations et de nouvelles fonctions. BSD *curses* n'est plus maintenu, ayant été remplacé par *ncurses*, qui est une implémentation open-source de l'interface AT&T. Si vous utilisez un Unix open-source comme Linux ou FreeBSD, votre système utilise presque certainement *ncurses*. Comme la plupart des versions commerciales actuelles d'Unix sont basées sur le code *System V*, toutes les fonctions décrites ici seront probablement disponibles. Les anciennes versions de *curses* portées par certains Unix propriétaires pourraient ne pas gérer toutes les fonctions.

source: The Windows version of Python doesn't include the :mod:`curses` module. A ported version called `UniCurses <https://pypi.org/project/UniCurses>`_ is available.
fr: La version Windows de Python n'inclut pas le module :mod:`curses`. Une version portée appelée `UniCurses <https://pypi.org/project/UniCurses>`_ est disponible.

source: The Python curses module
fr: Le module *curses* de Python

source: The Python module is a fairly simple wrapper over the C functions provided by curses; if you're already familiar with curses programming in C, it's really easy to transfer that knowledge to Python. The biggest difference is that the Python interface makes things simpler by merging different C functions such as :c:func:`addstr`, :c:func:`mvaddstr`, and :c:func:`mvwaddstr` into a single :meth:`~curses.window.addstr` method. You'll see this covered in more detail later.
fr: Le module Python est une surcouche assez simple enrobant les fonctions C fournies par *curses* ; si vous êtes déjà familier avec la programmation *curses* en C, il est très facile de transférer cette connaissance à Python. La plus grande différence est que l'interface Python simplifie les choses en fusionnant différentes fonctions C telles que :c:func:`addstr`, :c:func:`mvaddstr` et :c:func:`mvwaddstr` en une seule méthode :meth:`~curses.window.addstr`. Nous voyons cela plus en détail ci-après.

source: This HOWTO is an introduction to writing text-mode programs with curses and Python. It doesn't attempt to be a complete guide to the curses API; for that, see the Python library guide's section on ncurses, and the C manual pages for ncurses. It will, however, give you the basic ideas.
fr: Ce guide pratique est une introduction à l'écriture de programmes en mode texte avec *curses* et Python. Il n'essaie pas d'être un guide complet de l'API *curses* ; pour cela, consultez la section du guide de la bibliothèque Python sur *ncurses* et les pages du manuel C pour *ncurses*. Il vous donne cependant les idées de base.

source: Starting and ending a curses application
fr: Lancement et arrêt une application *curses*

source: Before doing anything, curses must be initialized. This is done by calling the :func:`~curses.initscr` function, which will determine the terminal type, send any required setup codes to the terminal, and create various internal data structures. If successful, :func:`initscr` returns a window object representing the entire screen; this is usually called ``stdscr`` after the name of the corresponding C variable. ::
fr: Avant de faire quoi que ce soit, *curses* doit être initialisé. Appelez pour cela la fonction :func:`~curses.initscr`, elle détermine le type de terminal, envoie tous les codes de configuration requis au terminal et crée diverses structures de données internes. En cas de succès, :func:`initscr` renvoie un objet fenêtre représentant l'écran entier ; il est généralement appelé ``stdscr`` d'après le nom de la variable C correspondante. ::

source: Usually curses applications turn off automatic echoing of keys to the screen, in order to be able to read keys and only display them under certain circumstances. This requires calling the :func:`~curses.noecho` function. ::
fr: Habituellement, les applications *curses* désactivent l'écho automatique des touches à l'écran, afin de pouvoir lire les touches et ne les afficher que dans certaines circonstances. Cela nécessite d'appeler la fonction :func:`~curses.noecho`. ::

source: Applications will also commonly need to react to keys instantly, without requiring the Enter key to be pressed; this is called cbreak mode, as opposed to the usual buffered input mode. ::
fr: Également, les applications réagissent généralement instantanément aux touches sans qu'il soit nécessaire d'appuyer sur la touche Entrée ; c'est ce qu'on appelle le mode *cbreak*, par opposition au mode d'entrée habituel avec un tampon. ::

source: Terminals usually return special keys, such as the cursor keys or navigation keys such as Page Up and Home, as a multibyte escape sequence. While you could write your application to expect such sequences and process them accordingly, curses can do it for you, returning a special value such as :const:`curses.KEY_LEFT`. To get curses to do the job, you'll have to enable keypad mode. ::
fr: Les terminaux renvoient généralement les touches spéciales, telles que les touches de curseur ou les touches de navigation (Page précédente et Accueil par exemple), comme une séquence d'échappement sur plusieurs octets. Bien que vous puissiez écrire votre application pour vous attendre à de telles séquences et les traiter en conséquence, *curses* peut le faire pour vous, renvoyant une valeur spéciale telle que :const:`curses.KEY_LEFT`. Pour que *curses* fasse le travail, vous devez activer le mode *keypad*. ::

source: Terminating a curses application is much easier than starting one. You'll need to call::
fr: Arrêter une application *curses* est beaucoup plus facile que d'en démarrer une. Appelez ::

source: to reverse the curses-friendly terminal settings. Then call the :func:`~curses.endwin` function to restore the terminal to its original operating mode. ::
fr: pour inverser les réglages du terminal mis en place pour *curses*. Ensuite, appelez la fonction :func:`~curses.enddwin` pour restaurer le terminal dans son mode de fonctionnement original. ::

source: A common problem when debugging a curses application is to get your terminal messed up when the application dies without restoring the terminal to its previous state. In Python this commonly happens when your code is buggy and raises an uncaught exception. Keys are no longer echoed to the screen when you type them, for example, which makes using the shell difficult.
fr: Un problème courant lors du débogage d'une application *curses* est de se retrouver avec un terminal sans queue ni tête lorsque l'application meurt sans restaurer le terminal à son état précédent. Avec Python, cela arrive souvent lorsque votre code est bogué et lève une exception non interceptée. Les touches ne sont plus répétées à l'écran lorsque vous les tapez, par exemple, ce qui rend l'utilisation de l'interface de commande du *shell* difficile.

source: In Python you can avoid these complications and make debugging much easier by importing the :func:`curses.wrapper` function and using it like this::
fr: En Python, vous pouvez éviter ces complications et faciliter le débogage en important la fonction :func:`curses.wrapper` et en l'utilisant comme suit ::

source: The :func:`~curses.wrapper` function takes a callable object and does the initializations described above, also initializing colors if color support is present. :func:`wrapper` then runs your provided callable. Once the callable returns, :func:`wrapper` will restore the original state of the terminal. The callable is called inside a :keyword:`try`...\ :keyword:`except` that catches exceptions, restores the state of the terminal, and then re-raises the exception. Therefore your terminal won't be left in a funny state on exception and you'll be able to read the exception's message and traceback.
fr: La fonction :func:`~curses.wrapper` prend un objet appelable et fait les initialisations décrites ci-dessus, initialisant également les couleurs si la gestion des couleurs est possible. :func:`wrapper` lance l'appelable fourni. Une fois que l'appelable termine, :func:`wrapper` restaure l'état d'origine du terminal. L'appelable est appelé à l'intérieur d'un :keyword:`try`...\ :keyword:`except` qui capture les exceptions, restaure l'état du terminal, puis relève l'exception. Par conséquent, votre terminal ne reste pas dans un drôle d'état au moment de l'exception et vous pourrez lire le message de l'exception et la trace de la pile d'appels.

source: Windows and Pads
fr: Fenêtres et tampons (*pads* en anglais)

source: Windows are the basic abstraction in curses. A window object represents a rectangular area of the screen, and supports methods to display text, erase it, allow the user to input strings, and so forth.
fr: Les fenêtres sont l'abstraction de base de *curses*. Un objet fenêtre représente une zone rectangulaire de l'écran qui gère des méthodes pour afficher du texte, l'effacer, permettre à l'utilisateur de saisir des chaînes, etc.

source: The ``stdscr`` object returned by the :func:`~curses.initscr` function is a window object that covers the entire screen. Many programs may need only this single window, but you might wish to divide the screen into smaller windows, in order to redraw or clear them separately. The :func:`~curses.newwin` function creates a new window of a given size, returning the new window object. ::
fr: L'objet ``stdscr`` renvoyé par la fonction :func:`~curses.initscr` est un objet fenêtre qui couvre l'écran entier. De nombreux programmes peuvent n'avoir besoin que de cette fenêtre unique, mais vous pouvez diviser l'écran en fenêtres plus petites, afin de les redessiner ou de les effacer séparément. La fonction :func:`~curses.newwin` crée une nouvelle fenêtre d'une taille donnée, renvoyant le nouvel objet fenêtre. ::

source: Note that the coordinate system used in curses is unusual. Coordinates are always passed in the order *y,x*, and the top-left corner of a window is coordinate (0,0). This breaks the normal convention for handling coordinates where the *x* coordinate comes first. This is an unfortunate difference from most other computer applications, but it's been part of curses since it was first written, and it's too late to change things now.
fr: Notez que le système de coordonnées utilisé dans *curses* est inhabituel. Les coordonnées sont toujours passées dans l'ordre *y,x* et le coin supérieur gauche d'une fenêtre a pour coordonnées (0,0). Ceci rompt la convention normale des coordonnées où la coordonnée *x* vient en premier. C'est une différence malheureuse par rapport à la plupart des autres applications informatiques, mais elle fait partie de *curses* depuis qu'il a été écrit et il est trop tard pour changer les choses maintenant.

source: Your application can determine the size of the screen by using the :data:`curses.LINES` and :data:`curses.COLS` variables to obtain the *y* and *x* sizes. Legal coordinates will then extend from ``(0,0)`` to ``(curses.LINES - 1, curses.COLS - 1)``.
fr: Votre application peut déterminer la taille de l'écran en utilisant les variables :data:`curses.LINES` et :data:`curses.COLS` pour obtenir les tailles *y* et *x*. Les coordonnées licites s'étendent alors de ``(0,0)`` à ``(curses.LINES - 1, curses.COLS - 1)``.

source: When you call a method to display or erase text, the effect doesn't immediately show up on the display. Instead you must call the :meth:`~curses.window.refresh` method of window objects to update the screen.
fr: Quand vous appelez une méthode pour afficher ou effacer du texte, l'affichage ne le reflète pas immédiatement. Vous devez appeler la méthode :meth:`~curses.window.refresh` des objets fenêtre pour mettre à jour l'écran.

source: This is because curses was originally written with slow 300-baud terminal connections in mind; with these terminals, minimizing the time required to redraw the screen was very important. Instead curses accumulates changes to the screen and displays them in the most efficient manner when you call :meth:`refresh`. For example, if your program displays some text in a window and then clears the window, there's no need to send the original text because they're never visible.
fr: C'est parce que *curses* a été écrit du temps des terminaux avec une connexion à 300 bauds seulement ; avec ces terminaux, il était important de minimiser le temps passé à redessiner l'écran. *curses* calcule donc les modifications à apporter à l'écran pour les afficher de la manière la plus efficace au moment où la méthode :meth:`refresh` est appelée. Par exemple, si votre programme affiche du texte dans une fenêtre puis efface cette fenêtre, il n'est pas nécessaire de l'afficher puisqu'il ne sera jamais visible.

source: In practice, explicitly telling curses to redraw a window doesn't really complicate programming with curses much. Most programs go into a flurry of activity, and then pause waiting for a keypress or some other action on the part of the user. All you have to do is to be sure that the screen has been redrawn before pausing to wait for user input, by first calling ``stdscr.refresh()`` or the :meth:`refresh` method of some other relevant window.
fr: Pratiquement, le fait de devoir indiquer explicitement à *curses* de redessiner une fenêtre ne rend pas la programmation plus compliquée. La plupart des programmes effectuent une rafale de traitements puis attendent qu'une touche soit pressée ou toute autre action de la part de l'utilisateur. Tout ce que vous avez à faire consiste à vous assurer que l'écran a bien été redessiné avant d'attendre une entrée utilisateur, en appelant d'abord ``stdscr.refresh()`` ou la méthode :meth:`refresh` de la fenêtre adéquate.

source: A pad is a special case of a window; it can be larger than the actual display screen, and only a portion of the pad displayed at a time. Creating a pad requires the pad's height and width, while refreshing a pad requires giving the coordinates of the on-screen area where a subsection of the pad will be displayed. ::
fr: Un tampon (*pad* en anglais) est une forme spéciale de fenêtre ; il peut être plus grand que l'écran effectif et il est possible de n'afficher qu'une partie du tampon à la fois. La création d'un tampon nécessite de fournir sa hauteur et sa largeur, tandis que pour le rafraîchissement du tampon, vous devez fournir les coordonnées de la zone de l'écran où une partie du tampon sera affichée.

source: The :meth:`refresh` call displays a section of the pad in the rectangle extending from coordinate (5,5) to coordinate (20,75) on the screen; the upper left corner of the displayed section is coordinate (0,0) on the pad. Beyond that difference, pads are exactly like ordinary windows and support the same methods.
fr: L'appel à :meth:`refresh` affiche une partie du tampon dans le rectangle formé par les coins de coordonnées (5,5) et (20,75) de l'écran ; le coin supérieur gauche de la partie affichée a pour coordonnées (0,0) dans le tampon. À part cette différence, les tampons sont exactement comme les fenêtres ordinaires et gèrent les mêmes méthodes.

source: If you have multiple windows and pads on screen there is a more efficient way to update the screen and prevent annoying screen flicker as each part of the screen gets updated. :meth:`refresh` actually does two things:
fr: Si vous avez plusieurs fenêtres et tampons sur l'écran, il existe un moyen plus efficace pour rafraîchir l'écran et éviter des scintillements agaçants à chaque mise à jour. :meth:`refresh` effectue en fait deux choses :

source: Calls the :meth:`~curses.window.noutrefresh` method of each window to update an underlying data structure representing the desired state of the screen.
fr: elle appelle la méthode :meth:`~curses.window.noutrefresh` de chaque fenêtre pour mettre à jour les données sous-jacentes qui permettent d'obtenir l'affichage voulu ;

source: Calls the function :func:`~curses.doupdate` function to change the physical screen to match the desired state recorded in the data structure.
fr: elle appelle la fonction :func:`~curses.doupdate` pour modifier l'écran physique afin de correspondre à l'état défini par les données sous-jacentes.

source: Instead you can call :meth:`noutrefresh` on a number of windows to update the data structure, and then call :func:`doupdate` to update the screen.
fr: Vous pouvez ainsi appeler :meth:`noutrefresh` sur les fenêtres dont vous voulez mettre à jour des données, puis :func:`doupdate` pour mettre à jour l'écran.

source: Displaying Text
fr: Affichage de texte

source: From a C programmer's point of view, curses may sometimes look like a twisty maze of functions, all subtly different. For example, :c:func:`addstr` displays a string at the current cursor location in the ``stdscr`` window, while :c:func:`mvaddstr` moves to a given y,x coordinate first before displaying the string. :c:func:`waddstr` is just like :c:func:`addstr`, but allows specifying a window to use instead of using ``stdscr`` by default. :c:func:`mvwaddstr` allows specifying both a window and a coordinate.
fr: D'un point de vue de programmeur C, *curses* peut parfois ressembler à un enchevêtrement de fonctions, chacune ayant sa subtilité. Par exemple, :c:func:`addstr` affiche une chaîne à la position actuelle du curseur de la fenêtre ``stdscr``, alors que :c:func:`mvaddstr` se déplace d'abord jusqu'aux coordonnées (y,x) avant d'afficher la chaîne. :c:func:`waddstr` est comme :c:func:`addstr`, mais permet de spécifier la fenêtre au lieu d'utiliser ``stdscr`` par défaut. :c:func:`mvwaddstr` permet de spécifier à la fois les coordonnées et la fenêtre.

source: Fortunately the Python interface hides all these details. ``stdscr`` is a window object like any other, and methods such as :meth:`~curses.window.addstr` accept multiple argument forms. Usually there are four different forms.
fr: Heureusement, l'interface Python masque tous ces détails. ``stdscr`` est un objet fenêtre comme les autres et les méthodes telles que :meth:`~curses.window.addstr` acceptent leurs arguments sous de multiples formes, habituellement quatre.

source: Form
fr: Forme

source: *str* or *ch*
fr: *str* ou *ch*

source: Display the string *str* or character *ch* at the current position
fr: Affiche la chaîne *str* ou le caractère *ch* à la position actuelle

source: *str* or *ch*, *attr*
fr: *str* ou *ch*, *attr*

source: Display the string *str* or character *ch*, using attribute *attr* at the current position
fr: Affiche la chaîne *str* ou le caractère *ch*, en utilisant l'attribut *attr* à la position actuelle

source: *y*, *x*, *str* or *ch*
fr: *y*, *x*, *str* ou *ch*

source: Move to position *y,x* within the window, and display *str* or *ch*
fr: Se déplace à la position *y,x* dans la fenêtre et affiche la chaîne *str* ou le caractère *ch*

source: *y*, *x*, *str* or *ch*, *attr*
fr: *y*, *x*, *str* ou *ch*, *attr*

source: Move to position *y,x* within the window, and display *str* or *ch*, using attribute *attr*
fr: Se déplace à la position *y,x* dans la fenêtre et affiche la chaîne *str* ou le caractère *ch* en utilisant l'attribut *attr*
