Repository: python/python-docs-fr
Catalog: howto/descriptor.po
Languages: fr

source: The logic for a dotted lookup such as ``A.x`` is in :meth:`type.__getattribute__`. The steps are similar to those for :meth:`object.__getattribute__` but the instance dictionary lookup is replaced by a search through the class's :term:`method resolution order`.
fr: La logique pour une recherche « après un point » telle que ``A.x`` se trouve dans :meth:`type.__getattribute__`. Les étapes sont similaires à celles de :meth:`object.__getattribute__` mais la recherche dans le dictionnaire d'instance est remplacée par une recherche suivant l':term:`ordre de résolution des méthodes <method resolution order>` de la classe.

source: If a descriptor is found, it is invoked with ``desc.__get__(None, A)``.
fr: Si un descripteur est trouvé, il est appelé par ``desc.__get__(None, A)``.

source: Invocation from super
fr: Appel depuis super

source: A dotted lookup such as ``super(A, obj).m`` searches ``obj.__class__.__mro__`` for the base class ``B`` immediately following ``A`` and then returns ``B.__dict__['m'].__get__(obj, A)``. If not a descriptor, ``m`` is returned unchanged.
fr: La recherche d'attribut ``super(A, obj).m`` recherche dans ``obj.__class__.__mro__`` la classe ``B`` qui suit immédiatement A, et renvoie ``B.__dict__['m'].__get__(obj, A)``. Si ce n'est pas un descripteur, ``m`` est renvoyé inchangé.

source: Summary of invocation logic
fr: Résumé de la logique d'appel

source: The important points to remember are:
fr: Les points importants à retenir sont :

source: Descriptors are invoked by the :meth:`__getattribute__` method.
fr: les descripteurs sont appelés par la méthode :meth:`__getattribute__` ;

source: Classes inherit this machinery from :class:`object`, :class:`type`, or :func:`super`.
fr: les classes héritent ce mécanisme de :class:`object`, :class:`type` ou :func:`super` ;

source: Overriding :meth:`__getattribute__` prevents automatic descriptor calls because all the descriptor logic is in that method.
fr: redéfinir :meth:`__getattribute____` empêche les appels automatiques de descripteur car toute la logique des descripteurs est dans cette méthode ;

source: :meth:`object.__getattribute__` and :meth:`type.__getattribute__` make different calls to :meth:`__get__`. The first includes the instance and may include the class. The second puts in ``None`` for the instance and always includes the class.
fr: :meth:`objet.__getattribute__` et :meth:`type.__getattribute__` font différents appels à :meth:`__get__`. La première inclut l'instance et peut inclure la classe. La seconde met ``None`` pour l'instance et inclut toujours la classe ;

source: Data descriptors always override instance dictionaries.
fr: les descripteurs de données sont toujours prioritaires sur les dictionnaires d'instances.

source: Non-data descriptors may be overridden by instance dictionaries.
fr: les descripteurs hors-données peuvent céder la priorité aux dictionnaires d'instance.

source: Automatic name notification
fr: Notification automatique des noms

source: Sometimes it is desirable for a descriptor to know what class variable name it was assigned to. When a new class is created, the :class:`type` metaclass scans the dictionary of the new class. If any of the entries are descriptors and if they define :meth:`__set_name__`, that method is called with two arguments. The *owner* is the class where the descriptor is used, and the *name* is the class variable the descriptor was assigned to.
fr: Il est parfois souhaitable qu'un descripteur sache à quel nom de variable de classe il a été affecté. Lorsqu'une nouvelle classe est créée, la métaclasse :class:`type` parcourt le dictionnaire de la nouvelle classe. Si l'une des entrées est un descripteur et si elle définit :meth:`__set_name__`, cette méthode est appelée avec deux arguments : *owner* (propriétaire) est la classe où le descripteur est utilisé, et *name* est la variable de classe à laquelle le descripteur a été assigné.

source: Since the update logic is in :meth:`type.__new__`, notifications only take place at the time of class creation. If descriptors are added to the class afterwards, :meth:`__set_name__` will need to be called manually.
fr: Comme la logique de mise à jour est dans :meth:`type.__new__`, les notifications n'ont lieu qu'au moment de la création de la classe. Si des descripteurs sont ajoutés à la classe par la suite, :meth:`__set_name__` doit être appelée manuellement.

source: ORM example
fr: Exemple d'ORM

source: The following code is a simplified skeleton showing how data descriptors could be used to implement an `object relational mapping <https://en.wikipedia.org/wiki/Object%E2%80%93relational_mapping>`_.
fr: Le code suivant est une ossature simplifiée montrant comment les descripteurs de données peuvent être utilisés pour implémenter une `correspondance objet-relationnel <https://fr.wikipedia.org/wiki/Mapping_objet-relationnel>`_.

source: The essential idea is that the data is stored in an external database. The Python instances only hold keys to the database's tables. Descriptors take care of lookups or updates:
fr: L'idée essentielle est que les données sont stockées dans une base de données externe. Les instances Python ne contiennent que les clés des tables de la base de données. Les descripteurs s'occupent des recherches et des mises à jour :

source: We can use the :class:`Field` class to define `models <https://en.wikipedia.org/wiki/Database_model>`_ that describe the schema for each table in a database:
fr: Nous pouvons utiliser la classe :class:`Field` pour définir des `modèles <https://en.wikipedia.org/wiki/Database_model>`_ qui décrivent le schéma de chaque table d'une base de données :

source: To use the models, first connect to the database::
fr: Pour utiliser les modèles, connectons-nous d'abord à la base de données ::

source: An interactive session shows how data is retrieved from the database and how it can be updated:
fr: Une session interactive montre comment les données sont extraites de la base de données et comment elles peuvent être mises à jour :

source: Pure Python Equivalents
fr: Équivalents en Python pur

source: The descriptor protocol is simple and offers exciting possibilities. Several use cases are so common that they have been prepackaged into built-in tools. Properties, bound methods, static methods, class methods, and \_\_slots\_\_ are all based on the descriptor protocol.
fr: Le protocole descripteur est simple et offre des possibilités très intéressantes. Plusieurs cas d'utilisation sont si courants qu'ils ont été regroupés dans des outils intégrés. Les propriétés, les méthodes liées, les méthodes statiques et les méthodes de classe sont toutes basées sur le protocole descripteur.

source: Properties
fr: Propriétés

source: Calling :func:`property` is a succinct way of building a data descriptor that triggers a function call upon access to an attribute. Its signature is::
fr: Appeler :func:`property` construit de façon succincte un descripteur de données qui déclenche un appel de fonction lors de l'accès à un attribut. Sa signature est ::

source: The documentation shows a typical use to define a managed attribute ``x``:
fr: La documentation montre une utilisation caractéristique pour définir un attribut géré ``x`` :

source: To see how :func:`property` is implemented in terms of the descriptor protocol, here is a pure Python equivalent:
fr: Pour voir comment :func:`property` est implémentée dans le protocole du descripteur, voici un équivalent en Python pur :

source: The :func:`property` builtin helps whenever a user interface has granted attribute access and then subsequent changes require the intervention of a method.
fr: La fonction native :func:`property` aide chaque fois qu'une interface utilisateur a accordé l'accès à un attribut et que des modifications ultérieures nécessitent l'intervention d'une méthode.

source: For instance, a spreadsheet class may grant access to a cell value through ``Cell('b10').value``. Subsequent improvements to the program require the cell to be recalculated on every access; however, the programmer does not want to affect existing client code accessing the attribute directly. The solution is to wrap access to the value attribute in a property data descriptor:
fr: Par exemple, une classe de tableur peut donner accès à une valeur de cellule via ``Cell('b10').value``. Les améliorations ultérieures du programme exigent que la cellule soit recalculée à chaque accès ; cependant, le programmeur ne veut pas impacter le code client existant accédant directement à l'attribut. La solution consiste à envelopper l'accès à l'attribut *value* dans un descripteur de données :

source: Either the built-in :func:`property` or our :func:`Property` equivalent would work in this example.
fr: Soit la :func:`property` native, soit notre équivalent :func:`Property` fonctionnent dans cet exemple.

source: Functions and methods
fr: Fonctions et méthodes

source: Python's object oriented features are built upon a function based environment. Using non-data descriptors, the two are merged seamlessly.
fr: Les fonctionnalités orientées objet de Python sont construites sur un environnement basé sur des fonctions. À l'aide de descripteurs hors-données, les deux sont fusionnés de façon transparente.

source: Functions stored in class dictionaries get turned into methods when invoked. Methods only differ from regular functions in that the object instance is prepended to the other arguments. By convention, the instance is called *self* but could be called *this* or any other variable name.
fr: Les fonctions placées dans les dictionnaires des classes sont transformées en méthodes au moment de l'appel. Les méthodes ne diffèrent des fonctions ordinaires que par le fait que le premier argument est réservé à l'instance de l'objet. Par convention Python, la référence de l'instance est appelée *self*, bien qu'il soit possible de l'appeler *this* ou tout autre nom de variable.

source: Methods can be created manually with :class:`types.MethodType` which is roughly equivalent to:
fr: Les méthodes peuvent être créées manuellement avec :class:`types.MethodType`, qui équivaut à peu près à :

source: To support automatic creation of methods, functions include the :meth:`__get__` method for binding methods during attribute access. This means that functions are non-data descriptors that return bound methods during dotted lookup from an instance. Here's how it works:
fr: Pour prendre en charge la création automatique des méthodes, les fonctions incluent la méthode :meth:`__get__` pour lier les méthodes pendant l'accès aux attributs. Cela signifie que toutes les fonctions sont des descripteurs hors-données qui renvoient des méthodes liées au cours d'une recherche d'attribut d'une instance. Cela fonctionne ainsi :

source: Running the following class in the interpreter shows how the function descriptor works in practice:
fr: L'exécution de la classe suivante dans l'interpréteur montre comment le descripteur de fonction se comporte en pratique :

source: The function has a :term:`qualified name` attribute to support introspection:
fr: La fonction possède un attribut ``__qualname__`` (:term:`nom qualifié<qualified name>`) pour prendre en charge l'introspection :

source: Accessing the function through the class dictionary does not invoke :meth:`__get__`. Instead, it just returns the underlying function object::
fr: L'accès à la fonction *via* le dictionnaire de classe n'invoque pas :meth:`__get__`. À la place, il renvoie simplement l'objet de fonction sous-jacent ::

source: Dotted access from a class calls :meth:`__get__` which just returns the underlying function unchanged::
fr: La recherche d'attribut depuis une classe appelle :meth:`__get__`, qui renvoie simplement la fonction sous-jacente inchangée ::

source: The interesting behavior occurs during dotted access from an instance. The dotted lookup calls :meth:`__get__` which returns a bound method object::
fr: Le comportement intéressant se produit lors d'une recherche d'attribut à partir d'une instance. La recherche d'attribut appelle :meth:`__get__` qui renvoie un objet « méthode liée » ::

source: Internally, the bound method stores the underlying function and the bound instance::
fr: En interne, la méthode liée stocke la fonction sous-jacente et l'instance liée ::

source: If you have ever wondered where *self* comes from in regular methods or where *cls* comes from in class methods, this is it!
fr: Si vous vous êtes déjà demandé d'où vient *self* dans les méthodes ordinaires ou d'où vient *cls* dans les méthodes de classe, c'est ça !

source: Kinds of methods
fr: Types de méthodes

source: Non-data descriptors provide a simple mechanism for variations on the usual patterns of binding functions into methods.
fr: Les descripteurs hors-données constituent un moyen simple pour modifier le modèle usuel de transformation des fonctions en méthodes.

source: To recap, functions have a :meth:`__get__` method so that they can be converted to a method when accessed as attributes. The non-data descriptor transforms an ``obj.f(*args)`` call into ``f(obj, *args)``. Calling ``cls.f(*args)`` becomes ``f(*args)``.
fr: Pour résumer, les fonctions ont une méthode :meth:`__get__` pour qu'elles puissent être converties en méthodes lorsqu'on y accède comme attributs. Le descripteur hors-données transforme un appel ``obj.f(*args)`` en ``f(obj, *args)``. L'appel ``cls.f(*args)`` devient ``f(*args)``.

source: This chart summarizes the binding and its two most useful variants:
fr: Ce tableau résume le lien classique (*binding*) et ses deux variantes les plus utiles :

source: Called from an object
fr: Appelée depuis un objet

source: Called from a class
fr: Appelée depuis une classe

source: function
fr: fonction

source: staticmethod
fr: méthode statique

source: classmethod
fr: méthode de classe

source: Static methods
fr: Méthodes statiques

source: Static methods return the underlying function without changes. Calling either ``c.f`` or ``C.f`` is the equivalent of a direct lookup into ``object.__getattribute__(c, "f")`` or ``object.__getattribute__(C, "f")``. As a result, the function becomes identically accessible from either an object or a class.
fr: Les méthodes statiques renvoient la fonction sous-jacente sans modification. Appeler ``c.f`` ou ``C.f`` est l'équivalent d'une recherche directe dans ``objet.__getattribute__(c, "f")`` ou ``objet.__getattribute__(C, "f")``. Par conséquent, l'accès à la fonction devient identique que ce soit à partir d'un objet ou d'une classe.

source: Good candidates for static methods are methods that do not reference the ``self`` variable.
fr: Les bonnes candidates pour être méthode statique sont des méthodes qui ne font pas référence à la variable ``self``.

source: For instance, a statistics package may include a container class for experimental data. The class provides normal methods for computing the average, mean, median, and other descriptive statistics that depend on the data. However, there may be useful functions which are conceptually related but do not depend on the data. For instance, ``erf(x)`` is handy conversion routine that comes up in statistical work but does not directly depend on a particular dataset. It can be called either from an object or the class: ``s.erf(1.5) --> .9332`` or ``Sample.erf(1.5) --> .9332``.
fr: Par exemple, un paquet traitant de statistiques peut inclure une classe qui est un conteneur pour des données expérimentales. La classe fournit les méthodes normales pour calculer la moyenne, la médiane et d'autres statistiques descriptives qui dépendent des données. Cependant, il peut y avoir des fonctions utiles qui sont conceptuellement liées mais qui ne dépendent pas des données. Par exemple, la fonction d'erreur ``erf(x)`` est souvent utile lorsqu'on travaille en statistique mais elle ne dépend pas directement d'un ensemble de données particulier. Elle peut être appelée à partir d'un objet ou de la classe : ``s.erf(1.5) --> .9332`` ou ``Sample.erf(1.5) --> .9332``.

source: Since static methods return the underlying function with no changes, the example calls are unexciting:
fr: Puisque les méthodes statiques renvoient la fonction sous-jacente sans changement, les exemples d’appels sont d'une grande banalité :

source: Using the non-data descriptor protocol, a pure Python version of :func:`staticmethod` would look like this:
fr: En utilisant le protocole de descripteur hors-données, une version Python pure de :func:`staticmethod` ressemblerait à ceci :

source: Class methods
fr: Méthodes de classe

source: Unlike static methods, class methods prepend the class reference to the argument list before calling the function. This format is the same for whether the caller is an object or a class:
fr: Contrairement aux méthodes statiques, les méthodes de classe ajoutent la référence de classe en tête de la liste d'arguments, avant d'appeler la fonction. C'est le même format que l'appelant soit un objet ou une classe :

source: This behavior is useful whenever the method only needs to have a class reference and does not rely on data stored in a specific instance. One use for class methods is to create alternate class constructors. For example, the classmethod :func:`dict.fromkeys` creates a new dictionary from a list of keys. The pure Python equivalent is:
fr: Ce comportement est utile lorsque la fonction n'a besoin que d'une référence de classe et ne se soucie pas des données propres à une instance particulière. Une des utilisations des méthodes de classe est de créer des constructeurs de classe personnalisés. Par exemple, la méthode de classe :func:`dict.fromkeys` crée un nouveau dictionnaire à partir d'une liste de clés. L'équivalent Python pur est :

source: Now a new dictionary of unique keys can be constructed like this:
fr: Maintenant un nouveau dictionnaire de clés uniques peut être construit comme ceci :

source: Using the non-data descriptor protocol, a pure Python version of :func:`classmethod` would look like this:
fr: En utilisant le protocole de descripteur hors-données, une version Python pure de :func:`classmethod` ressemblerait à ceci :

source: The code path for ``hasattr(type(self.f), '__get__')`` was added in Python 3.9 and makes it possible for :func:`classmethod` to support chained decorators. For example, a classmethod and property could be chained together. In Python 3.11, this functionality was deprecated.
fr: La portion de code pour ``hasattr(type(self.f), '__get__')`` a été ajoutée dans Python 3.9 et permet à :func:`classmethod` de prendre en charge les décorateurs chaînés. Par exemple, un décorateur « méthode de classe » peut être chaîné à un décorateur « propriété ». Dans Python 3.11, cette fonctionnalité est devenue obsolète.

source: Member objects and __slots__
fr: Objets membres et *__slots__*

source: When a class defines ``__slots__``, it replaces instance dictionaries with a fixed-length array of slot values. From a user point of view that has several effects:
fr: Lorsqu'une classe définit ``__slots__``, Python remplace le dictionnaire d'instance par un tableau de longueur fixe de créneaux prédéfinis. D'un point de vue utilisateur, cela :

source: 1. Provides immediate detection of bugs due to misspelled attribute assignments. Only attribute names specified in ``__slots__`` are allowed:
fr: 1/ permet une détection immédiate des bogues dus à des affectations d'attributs mal orthographiés. Seuls les noms d'attribut spécifiés dans ``__slots__`` sont autorisés :

source: 2. Helps create immutable objects where descriptors manage access to private attributes stored in ``__slots__``:
fr: 2/ aide à créer des objets immuables où les descripteurs gèrent l'accès aux attributs privés stockés dans ``__slots__`` :

source: 3. Saves memory. On a 64-bit Linux build, an instance with two attributes takes 48 bytes with ``__slots__`` and 152 bytes without. This `flyweight design pattern <https://en.wikipedia.org/wiki/Flyweight_pattern>`_ likely only matters when a large number of instances are going to be created.
fr: 3/ économise de la mémoire. Sur une version Linux 64 bits, une instance avec deux attributs prend 48 octets avec ``__slots__`` et 152 octets sans. Ce patron de conception `poids mouche <https://fr.wikipedia.org/wiki/Poids-mouche_(patron_de_conception)>`_ n'a probablement d'importance que si un grand nombre d'instances doivent être créées ;

source: 4. Improves speed. Reading instance variables is 35% faster with ``__slots__`` (as measured with Python 3.10 on an Apple M1 processor).
fr: 4/ améliore la vitesse. La lecture des variables d'instance est 35 % plus rapide avec ``__slots__`` (mesure effectuée avec Python 3.10 sur un processeur Apple M1) ;

source: 5. Blocks tools like :func:`functools.cached_property` which require an instance dictionary to function correctly:
fr: 5/ bloque les outils comme :func:`functools.cached_property` qui nécessitent un dictionnaire d'instance pour fonctionner correctement :

source: It is not possible to create an exact drop-in pure Python version of ``__slots__`` because it requires direct access to C structures and control over object memory allocation. However, we can build a mostly faithful simulation where the actual C structure for slots is emulated by a private ``_slotvalues`` list. Reads and writes to that private structure are managed by member descriptors:
fr: Il n'est pas possible de créer une version Python pure exacte de ``__slots__`` car il faut un accès direct aux structures C et un contrôle sur l'allocation de la mémoire des objets. Cependant, nous pouvons construire une simulation presque fidèle où la structure C réelle pour les *slots* est émulée par une liste privée ``_slotvalues``. Les lectures et écritures dans cette structure privée sont gérées par des descripteurs de membres :

source: The :meth:`type.__new__` method takes care of adding member objects to class variables:
fr: La méthode :meth:`type.__new__` s'occupe d'ajouter des objets membres aux variables de classe :

source: The :meth:`object.__new__` method takes care of creating instances that have slots instead of an instance dictionary. Here is a rough simulation in pure Python:
fr: La méthode :meth:`object.__new__` s'occupe de créer des instances qui ont des *slots* au lieu d'un dictionnaire d'instances. Voici une simulation approximative en Python pur :

source: To use the simulation in a real class, just inherit from :class:`Object` and set the :term:`metaclass` to :class:`Type`:
fr: Pour utiliser la simulation dans une classe réelle, héritez simplement de :class:`Object` et définissez la :term:`métaclasse <metaclass>` à :class:`Type` :

source: At this point, the metaclass has loaded member objects for *x* and *y*::
fr: À ce stade, la métaclasse a chargé des objets membres pour *x* et *y* ::

source: When instances are created, they have a ``slot_values`` list where the attributes are stored:
fr: Lorsque les instances sont créées, elles ont une liste ``slot_values`` où les attributs sont stockés :

source: Misspelled or unassigned attributes will raise an exception:
fr: Les attributs mal orthographiés ou non attribués lèvent une exception :
