Repository: python/python-docs-fr
Catalog: howto/descriptor.po
Languages: fr

source: Author
fr: Auteur

source: Contents
fr: Sommaire

source: :term:`Descriptors <descriptor>` let objects customize attribute lookup, storage, and deletion.
fr: Les :term:`descripteurs <descriptor>` permettent de personnaliser la recherche, le stockage et la suppression des attributs des objets.

source: This guide has four major sections:
fr: Ce guide comporte quatre parties principales :

source: The "primer" gives a basic overview, moving gently from simple examples, adding one feature at a time. Start here if you're new to descriptors.
fr: l'« introduction » donne un premier aperçu, en partant d'exemples simples, puis en ajoutant une fonctionnalité à la fois. Commencez par là si vous débutez avec les descripteurs ;

source: The second section shows a complete, practical descriptor example. If you already know the basics, start there.
fr: la deuxième partie montre un exemple de descripteur complet et pratique. Si vous connaissez déjà les bases, commencez par là ;

source: The third section provides a more technical tutorial that goes into the detailed mechanics of how descriptors work. Most people don't need this level of detail.
fr: la troisième partie fournit un didacticiel plus technique qui décrit de manière détaillée comment fonctionnent les descripteurs. La plupart des gens n'ont pas besoin de ce niveau de détail ;

source: The last section has pure Python equivalents for built-in descriptors that are written in C. Read this if you're curious about how functions turn into bound methods or about the implementation of common tools like :func:`classmethod`, :func:`staticmethod`, :func:`property`, and :term:`__slots__`.
fr: la dernière partie contient des équivalents en pur Python des descripteurs natifs écrits en C. Lisez ceci si vous êtes curieux de savoir comment les fonctions se transforment en méthodes liées ou si vous voulez connaître l'implémentation d'outils courants comme :func:`classmethod`, :func:`staticmethod`, :func:`property` et :term:`__slots__`.

source: Primer
fr: Introduction

source: In this primer, we start with the most basic possible example and then we'll add new capabilities one by one.
fr: Dans cette introduction, nous commençons par l'exemple le plus simple possible, puis nous ajoutons de nouvelles fonctionnalités une par une.

source: Simple example: A descriptor that returns a constant
fr: Un exemple simple : un descripteur qui renvoie une constante

source: The :class:`Ten` class is a descriptor whose :meth:`__get__` method always returns the constant ``10``:
fr: La classe :class:`Ten` est un descripteur dont la méthode :meth:`__get__` renvoie toujours la constante ``10`` :

source: To use the descriptor, it must be stored as a class variable in another class:
fr: Pour utiliser le descripteur, il doit être stocké en tant que variable de classe dans une autre classe :

source: An interactive session shows the difference between normal attribute lookup and descriptor lookup:
fr: Une session interactive montre la différence entre la recherche d'attribut normale et la recherche *via* un descripteur :

source: In the ``a.x`` attribute lookup, the dot operator finds ``'x': 5`` in the class dictionary. In the ``a.y`` lookup, the dot operator finds a descriptor instance, recognized by its ``__get__`` method. Calling that method returns ``10``.
fr: Dans la recherche d'attribut ``a.x``, l'opérateur « point » trouve ``'x': 5`` dans le dictionnaire de classe. Dans la recherche ``a.y``, l'opérateur « point » trouve une instance de descripteur, reconnue par sa méthode ``__get__``. L'appel de cette méthode renvoie ``10``.

source: Note that the value ``10`` is not stored in either the class dictionary or the instance dictionary. Instead, the value ``10`` is computed on demand.
fr: Notez que la valeur ``10`` n'est stockée ni dans le dictionnaire de classe ni dans le dictionnaire d'instance. Non, la valeur ``10`` est calculée à la demande.

source: This example shows how a simple descriptor works, but it isn't very useful. For retrieving constants, normal attribute lookup would be better.
fr: Cet exemple montre comment fonctionne un descripteur simple, mais il n'est pas très utile. Pour récupérer des constantes, une recherche d'attribut normale est préférable.

source: In the next section, we'll create something more useful, a dynamic lookup.
fr: Dans la section suivante, nous allons créer quelque chose de plus utile, une recherche dynamique.

source: Dynamic lookups
fr: Recherches dynamiques

source: Interesting descriptors typically run computations instead of returning constants:
fr: Les descripteurs intéressants exécutent généralement des calculs au lieu de renvoyer des constantes :

source: An interactive session shows that the lookup is dynamic — it computes different, updated answers each time::
fr: Une session interactive montre que la recherche est dynamique — elle calcule des réponses différentes, mises à jour à chaque fois ::

source: Besides showing how descriptors can run computations, this example also reveals the purpose of the parameters to :meth:`__get__`. The *self* parameter is *size*, an instance of *DirectorySize*. The *obj* parameter is either *g* or *s*, an instance of *Directory*. It is the *obj* parameter that lets the :meth:`__get__` method learn the target directory. The *objtype* parameter is the class *Directory*.
fr: En plus de montrer comment les descripteurs peuvent exécuter des calculs, cet exemple révèle également le but des paramètres de :meth:`__get__`. Le paramètre *self* est *size*, une instance de *DirectorySize*. Le paramètre *obj* est soit *g* soit *s*, une instance de *Directory*. C'est le paramètre *obj* qui permet à la méthode :meth:`__get__` de connaître le répertoire cible. Le paramètre *objtype* est la classe *Directory*.

source: Managed attributes
fr: Attributs gérés

source: A popular use for descriptors is managing access to instance data. The descriptor is assigned to a public attribute in the class dictionary while the actual data is stored as a private attribute in the instance dictionary. The descriptor's :meth:`__get__` and :meth:`__set__` methods are triggered when the public attribute is accessed.
fr: Une utilisation courante des descripteurs est la gestion de l'accès aux données d'instances. Le descripteur est affecté à un attribut public dans le dictionnaire de classe tandis que les données réelles sont stockées en tant qu'attribut privé dans le dictionnaire d'instance. Les méthodes :meth:`__get__` et :meth:`__set__` du descripteur sont déclenchées lors de l'accès à l'attribut public.

source: In the following example, *age* is the public attribute and *_age* is the private attribute. When the public attribute is accessed, the descriptor logs the lookup or update:
fr: Dans l'exemple qui suit, *age* est l'attribut public et *_age* est l'attribut privé. Lors de l'accès à l'attribut public, le descripteur journalise la recherche ou la mise à jour :

source: An interactive session shows that all access to the managed attribute *age* is logged, but that the regular attribute *name* is not logged:
fr: Une session interactive montre que tous les accès à l'attribut géré *age* sont consignés, mais que rien n'est journalisé pour l'attribut normal *name* :

source: One major issue with this example is that the private name *_age* is hardwired in the *LoggedAgeAccess* class. That means that each instance can only have one logged attribute and that its name is unchangeable. In the next example, we'll fix that problem.
fr: Un problème majeur avec cet exemple est que le nom privé *_age* est écrit en dur dans la classe *LoggedAgeAccess*. Cela signifie que chaque instance ne peut avoir qu'un seul attribut journalisé et que son nom est immuable. Dans l'exemple suivant, nous allons résoudre ce problème.

source: Customized names
fr: Noms personnalisés

source: When a class uses descriptors, it can inform each descriptor about which variable name was used.
fr: Lorsqu'une classe utilise des descripteurs, elle peut informer chaque descripteur du nom de variable utilisé.

source: In this example, the :class:`Person` class has two descriptor instances, *name* and *age*. When the :class:`Person` class is defined, it makes a callback to :meth:`__set_name__` in *LoggedAccess* so that the field names can be recorded, giving each descriptor its own *public_name* and *private_name*:
fr: Dans cet exemple, la classe :class:`Person` a deux instances de descripteurs, *name* et *age*. Lorsque la classe :class:`Person` est définie, :meth:`__set_name__` est appelée automatiquement dans *LoggedAccess* afin que les noms de champs puissent être enregistrés, en donnant à chaque descripteur ses propres *public_name* et *private_name* :

source: An interactive session shows that the :class:`Person` class has called :meth:`__set_name__` so that the field names would be recorded. Here we call :func:`vars` to look up the descriptor without triggering it:
fr: Une session interactive montre que la classe :class:`Person` a appelé :meth:`__set_name__` pour que les noms des champs soient enregistrés. Ici, nous appelons :func:`vars` pour rechercher le descripteur sans le déclencher :

source: The new class now logs access to both *name* and *age*:
fr: La nouvelle classe enregistre désormais l'accès à la fois à *name* et *age* :

source: The two *Person* instances contain only the private names:
fr: Les deux instances de *Person* ne contiennent que les noms privés :

source: Closing thoughts
fr: Réflexions finales

source: A :term:`descriptor` is what we call any object that defines :meth:`__get__`, :meth:`__set__`, or :meth:`__delete__`.
fr: Nous appelons :term:`descripteur <descriptor>` tout objet qui définit :meth:`__get__`, :meth:`__set__` ou :meth:`__delete__`.

source: Optionally, descriptors can have a :meth:`__set_name__` method. This is only used in cases where a descriptor needs to know either the class where it was created or the name of class variable it was assigned to. (This method, if present, is called even if the class is not a descriptor.)
fr: Facultativement, les descripteurs peuvent avoir une méthode :meth:`__set_name__`. Elle n'est utile que dans les cas où un descripteur doit connaître soit la classe dans laquelle il a été créé, soit le nom de la variable de classe à laquelle il a été affecté (cette méthode, si elle est présente, est appelée même si la classe n'est pas un descripteur).

source: Descriptors get invoked by the dot operator during attribute lookup. If a descriptor is accessed indirectly with ``vars(some_class)[descriptor_name]``, the descriptor instance is returned without invoking it.
fr: Les descripteurs sont invoqués par l'opérateur « point » lors de la recherche d'attribut. Si on accède indirectement au descripteur avec ``vars(some_class)[descriptor_name]``, l'instance du descripteur est renvoyée sans l'invoquer.

source: Descriptors only work when used as class variables. When put in instances, they have no effect.
fr: Les descripteurs ne fonctionnent que lorsqu'ils sont utilisés comme variables de classe. Lorsqu'ils sont placés dans des instances, ils n'ont aucun effet.

source: The main motivation for descriptors is to provide a hook allowing objects stored in class variables to control what happens during attribute lookup.
fr: La principale raison d'être des descripteurs est de fournir un point d'entrée permettant aux objets stockés dans des variables de classe de contrôler ce qui se passe lors de la recherche d'attributs.

source: Traditionally, the calling class controls what happens during lookup. Descriptors invert that relationship and allow the data being looked-up to have a say in the matter.
fr: Traditionnellement, la classe appelante contrôle ce qui se passe pendant la recherche. Les descripteurs inversent cette relation et permettent aux données recherchées d'avoir leur mot à dire.

source: Descriptors are used throughout the language. It is how functions turn into bound methods. Common tools like :func:`classmethod`, :func:`staticmethod`, :func:`property`, and :func:`functools.cached_property` are all implemented as descriptors.
fr: Les descripteurs sont utilisés partout dans le langage. C'est ainsi que les fonctions se transforment en méthodes liées. Les outils courants tels que :func:`classmethod`, :func:`staticmethod`, :func:`property` et :func:`functools.cached_property` sont tous implémentés en tant que descripteurs.

source: Complete Practical Example
fr: Exemple complet pratique

source: In this example, we create a practical and powerful tool for locating notoriously hard to find data corruption bugs.
fr: Dans cet exemple, nous créons un outil pratique et puissant pour localiser les bogues de corruption de données notoirement difficiles à trouver.

source: Validator class
fr: Classe « validateur »

source: A validator is a descriptor for managed attribute access. Prior to storing any data, it verifies that the new value meets various type and range restrictions. If those restrictions aren't met, it raises an exception to prevent data corruption at its source.
fr: Un validateur est un descripteur pour l'accès aux attributs gérés. Avant de stocker des données, il vérifie que la nouvelle valeur respecte différentes restrictions de type et de plage. Si ces restrictions ne sont pas respectées, il lève une exception pour empêcher la corruption des données à la source.

source: This :class:`Validator` class is both an :term:`abstract base class` and a managed attribute descriptor:
fr: Cette classe :class:`Validator` est à la fois une :term:`classe mère abstraite <abstract base class>` et un descripteur d'attributs gérés :

source: Custom validators need to inherit from :class:`Validator` and must supply a :meth:`validate` method to test various restrictions as needed.
fr: Les validateurs personnalisés doivent hériter de :class:`Validator` et doivent fournir une méthode :meth:`validate` pour tester diverses restrictions adaptées aux besoins.

source: Custom validators
fr: Validateurs personnalisés

source: Here are three practical data validation utilities:
fr: Voici trois utilitaires concrets de validation de données :

source: :class:`OneOf` verifies that a value is one of a restricted set of options.
fr: :class:`OneOf` vérifie qu'une valeur fait partie d'un ensemble limité de valeurs ;

source: :class:`Number` verifies that a value is either an :class:`int` or :class:`float`. Optionally, it verifies that a value is between a given minimum or maximum.
fr: :class:`Number` vérifie qu'une valeur est soit un :class:`int` soit un :class:`float`. Facultativement, il vérifie qu'une valeur se situe entre un minimum ou un maximum donnés ;

source: :class:`String` verifies that a value is a :class:`str`. Optionally, it validates a given minimum or maximum length. It can validate a user-defined `predicate <https://en.wikipedia.org/wiki/Predicate_(mathematical_logic)>`_ as well.
fr: :class:`String` vérifie qu'une valeur est une :class:`chaîne de caractères <str>`. Éventuellement, il valide les longueurs minimale ou maximale données. Il peut également valider un `prédicat <https://fr.wikipedia.org/wiki/Pr%C3%A9dicat_(logique_math%C3%A9matique)>`_ défini par l'utilisateur.

source: Practical application
fr: Application pratique

source: Here's how the data validators can be used in a real class:
fr: Voici comment les validateurs de données peuvent être utilisés par une classe réelle :

source: The descriptors prevent invalid instances from being created:
fr: Les descripteurs empêchent la création d'instances non valides :

source: Technical Tutorial
fr: Tutoriel technique

source: What follows is a more technical tutorial for the mechanics and details of how descriptors work.
fr: Ce qui suit est un tutoriel plus technique relatif aux mécanismes et détails de fonctionnement des descripteurs.

source: Abstract
fr: Résumé

source: Defines descriptors, summarizes the protocol, and shows how descriptors are called. Provides an example showing how object relational mappings work.
fr: Ce tutoriel définit des descripteurs, résume le protocole et montre comment les descripteurs sont appelés. Il fournit un exemple montrant comment fonctionnent les correspondances relationnelles entre objets.

source: Learning about descriptors not only provides access to a larger toolset, it creates a deeper understanding of how Python works.
fr: L'apprentissage des descripteurs permet non seulement d'accéder à un ensemble d'outils plus vaste, mais aussi de mieux comprendre le fonctionnement de Python.

source: Definition and introduction
fr: Définition et introduction

source: In general, a descriptor is an attribute value that has one of the methods in the descriptor protocol. Those methods are :meth:`__get__`, :meth:`__set__`, and :meth:`__delete__`. If any of those methods are defined for an attribute, it is said to be a :term:`descriptor`.
fr: En général, un descripteur est la valeur d'un attribut qui possède une des méthodes définies dans le « protocole descripteur ». Ces méthodes sont : :meth:`__get__`, :meth:`__set__` et :meth:`__delete__`. Si l'une de ces méthodes est définie pour un attribut, il s'agit d'un :term:`descripteur <descriptor>`.

source: The default behavior for attribute access is to get, set, or delete the attribute from an object's dictionary. For instance, ``a.x`` has a lookup chain starting with ``a.__dict__['x']``, then ``type(a).__dict__['x']``, and continuing through the method resolution order of ``type(a)``. If the looked-up value is an object defining one of the descriptor methods, then Python may override the default behavior and invoke the descriptor method instead. Where this occurs in the precedence chain depends on which descriptor methods were defined.
fr: Le comportement par défaut pour l'accès aux attributs consiste à obtenir, définir ou supprimer l'attribut dans le dictionnaire d'un objet. Par exemple, pour chercher ``a.x`` Python commence par chercher ``a.__dict__['x']``, puis ``type(a).__dict__['x']``, et continue la recherche en utilisant la MRO (l'ordre de résolution des méthodes) de ``type(a)``. Si la valeur recherchée est un objet définissant l'une des méthodes de descripteur, Python remplace le comportement par défaut par un appel à la méthode du descripteur. Le moment où cela se produit dans la chaîne de recherche dépend des méthodes définies par le descripteur.

source: Descriptor protocol
fr: Protocole descripteur

source: That is all there is to it. Define any of these methods and an object is considered a descriptor and can override default behavior upon being looked up as an attribute.
fr: C'est tout ce qu'il y a à faire. Définissez n'importe laquelle de ces méthodes et un objet est considéré comme un descripteur ; il peut alors remplacer le comportement par défaut lorsqu'il est recherché en tant qu'attribut.

source: If an object defines :meth:`__set__` or :meth:`__delete__`, it is considered a data descriptor. Descriptors that only define :meth:`__get__` are called non-data descriptors (they are often used for methods but other uses are possible).
fr: Si un objet définit :meth:`__set__` ou :meth:`__delete__`, il est considéré comme un descripteur de données. Les descripteurs qui ne définissent que :meth:`__get__` sont appelés descripteurs hors-données (ils sont généralement utilisés pour des méthodes mais d'autres utilisations sont possibles).

source: Data and non-data descriptors differ in how overrides are calculated with respect to entries in an instance's dictionary. If an instance's dictionary has an entry with the same name as a data descriptor, the data descriptor takes precedence. If an instance's dictionary has an entry with the same name as a non-data descriptor, the dictionary entry takes precedence.
fr: Les descripteurs de données et les descripteurs hors-données diffèrent dans la façon dont les changements de comportement sont calculés en ce qui concerne les entrées du dictionnaire d'une instance. Si le dictionnaire d'une instance comporte une entrée portant le même nom qu'un descripteur de données, le descripteur de données est prioritaire. Si le dictionnaire d'une instance comporte une entrée portant le même nom qu'un descripteur hors-données, l'entrée du dictionnaire a la priorité.

source: To make a read-only data descriptor, define both :meth:`__get__` and :meth:`__set__` with the :meth:`__set__` raising an :exc:`AttributeError` when called. Defining the :meth:`__set__` method with an exception raising placeholder is enough to make it a data descriptor.
fr: Pour créer un descripteur de données en lecture seule, définissez à la fois :meth:`__get__` et :meth:`__set__` avec :meth:`__set__` levant une erreur :exc:`AttributeError` quand elle est appelée. Définir la méthode :meth:`__set__` ne faisant que lever cette exception est suffisant pour en faire un descripteur de données.

source: Overview of descriptor invocation
fr: Présentation de l'appel de descripteur

source: A descriptor can be called directly with ``desc.__get__(obj)`` or ``desc.__get__(None, cls)``.
fr: Un descripteur peut être appelé directement par ``desc.__get__(obj)`` ou ``desc.__get__(None, cls)``.

source: But it is more common for a descriptor to be invoked automatically from attribute access.
fr: Mais il est plus courant qu'un descripteur soit invoqué automatiquement à partir d'un accès à un attribut.

source: The details of invocation depend on whether ``obj`` is an object, class, or instance of super.
fr: Les détails de l'appel varient selon que ``obj`` est un objet, une classe ou une instance de *super*.

source: Invocation from an instance
fr: Appel depuis une instance

source: Instance lookup scans through a chain of namespaces giving data descriptors the highest priority, followed by instance variables, then non-data descriptors, then class variables, and lastly :meth:`__getattr__` if it is provided.
fr: La recherche d'instance consiste à parcourir la liste d'espaces de noms en donnant aux descripteurs de données la priorité la plus élevée, suivis des variables d'instance, puis des descripteurs hors-données, puis des variables de classe, et enfin :meth:`__getattr__` s'il est fourni.

source: If a descriptor is found for ``a.x``, then it is invoked with: ``desc.__get__(a, type(a))``.
fr: Si un descripteur est trouvé pour ``a.x``, alors il est appelé par ``desc.__get__(a, type(a))``.

source: The logic for a dotted lookup is in :meth:`object.__getattribute__`. Here is a pure Python equivalent:
fr: La logique d'une recherche « après un point » se trouve dans :meth:`object.__getattribute__`. Voici un équivalent en Python pur :

source: Note, there is no :meth:`__getattr__` hook in the :meth:`__getattribute__` code. That is why calling :meth:`__getattribute__` directly or with ``super().__getattribute__`` will bypass :meth:`__getattr__` entirely.
fr: Notez qu'il n'y a pas d'appel vers :meth:`__getattr__` dans le code de :meth:`__getattribute__`. C'est pourquoi appeler :meth:`__getattribute__` directement ou avec ``super().__getattribute__`` contourne entièrement :meth:`__getattr__`.

source: Instead, it is the dot operator and the :func:`getattr` function that are responsible for invoking :meth:`__getattr__` whenever :meth:`__getattribute__` raises an :exc:`AttributeError`. Their logic is encapsulated in a helper function:
fr: Au lieu, c'est l'opérateur « point » et la fonction :func:`getattr` qui sont responsables de l'appel de :meth:`__getattr__` chaque fois que :meth:`__getattribute__` déclenche une :exc:`AttributeError`. Cette logique est présentée encapsulée dans une fonction utilitaire :

source: Invocation from a class
fr: Appel depuis une classe
