Repository: python/python-docs-fr
Catalog: howto/enum.po
Languages: fr

source: The :meth:`__new__` method, if defined, is used during creation of the Enum members; it is then replaced by Enum's :meth:`__new__` which is used after class creation for lookup of existing members.
fr: la méthode :meth:`__new__`, si elle est définie, est utilisée lors de la création des membres de l'énumération ; elle est ensuite remplacée par :meth:`__new__` de l'*Enum* qui est utilisée après la création de la classe pour la recherche des membres existants.

source: OrderedEnum
fr: Énumération ordonnée

source: An ordered enumeration that is not based on :class:`IntEnum` and so maintains the normal :class:`Enum` invariants (such as not being comparable to other enumerations)::
fr: Voici une énumération ordonnée qui n'est pas basée sur :class:`IntEnum` et maintient donc les invariants normaux d':class:`Enum` (comme ne pas pouvoir être comparée à d'autres énumérations) ::

source: DuplicateFreeEnum
fr: Énumération sans doublon

source: This is a useful example for subclassing Enum to add or change other behaviors as well as disallowing aliases. If the only desired change is disallowing aliases, the :func:`unique` decorator can be used instead.
fr: c'est un exemple utile de dérivation d'*Enum* pour ajouter ou modifier d'autres comportements ainsi que pour interdire les synonymes. Si le seul changement souhaité est l'interdiction des synonymes, le décorateur :func:`unique` peut être utilisé à la place.

source: Planet
fr: Planète

source: If :meth:`__new__` or :meth:`__init__` is defined, the value of the enum member will be passed to those methods::
fr: Si :meth:`__new__` ou :meth:`__init__` est définie, la valeur du membre de l'énumération est passée à ces méthodes ::

source: TimePeriod
fr: Intervalle de temps

source: An example to show the :attr:`_ignore_` attribute in use::
fr: Exemple pour montrer l'utilisation de l'attribut :attr:`_ignore_` ::

source: Subclassing EnumType
fr: Dérivations d'*EnumType*

source: While most enum needs can be met by customizing :class:`Enum` subclasses, either with class decorators or custom functions, :class:`EnumType` can be subclassed to provide a different Enum experience.
fr: Alors que la plupart des besoins d'énumérations peuvent être satisfaits en sous-classant :class:`Enum`, avec des décorateurs de classe ou des fonctions personnalisées, :class:`EnumType` peut être dérivée pour créer des énumérations vraiment différentes.
