Repository: python/python-docs-fr
Catalog: howto/enum.po
Languages: fr

source: The next variation of :class:`Enum` provided, :class:`IntFlag`, is also based on :class:`int`. The difference being :class:`IntFlag` members can be combined using the bitwise operators (&, \|, ^, ~) and the result is still an :class:`IntFlag` member, if possible. Like :class:`IntEnum`, :class:`IntFlag` members are also integers and can be used wherever an :class:`int` is used.
fr: La variante suivante fournie d':class:`Enum` est :class:`IntFlag`, également basée sur :class:`int`. La différence étant que les membres :class:`IntFlag` peuvent être combinés à l'aide des opérateurs bit-à-bit (&, \|, ^, ~) et le résultat est toujours un membre :class:`IntFlag`, si possible. Comme :class:`IntEnum`, les membres de :class:`IntFlag` sont aussi des entiers et peuvent être utilisés partout où on utilise un :class:`int`.

source: Any operation on an :class:`IntFlag` member besides the bit-wise operations will lose the :class:`IntFlag` membership.
fr: toute opération sur un membre :class:`IntFlag`, en dehors des opérations bit-à-bit, fait perdre l'appartenance à :class:`IntFlag`.

source: Bit-wise operations that result in invalid :class:`IntFlag` values will lose the :class:`IntFlag` membership. See :class:`FlagBoundary` for details.
fr: Les opérations bit-à-bit qui entraînent des valeurs :class:`IntFlag` invalides font perdre l'appartenance à :class:`IntFlag`. Voir :class:`FlagBoundary` pour plus de détails.

source: Sample :class:`IntFlag` class::
fr: Classe exemple dérivée d':class:`Intflag` ::

source: It is also possible to name the combinations::
fr: Il est également possible de nommer les combinaisons ::

source: Named combinations are considered aliases. Aliases do not show up during iteration, but can be returned from by-value lookups.
fr: les combinaisons nommées sont considérées être des synonymes (ou alias). Les synonymes n'apparaissent pas dans une itération, mais peuvent être renvoyés à partir de recherches par valeur.

source: Another important difference between :class:`IntFlag` and :class:`Enum` is that if no flags are set (the value is 0), its boolean evaluation is :data:`False`::
fr: Une autre différence importante entre :class:`IntFlag` et :class:`Enum` est que si aucun indicateur n'est défini (la valeur est 0), son évaluation booléenne est :data:`False` ::

source: Because :class:`IntFlag` members are also subclasses of :class:`int` they can be combined with them (but may lose :class:`IntFlag` membership::
fr: Comme les membres d'une :class:`IntFlag` sont aussi des sous-classes de :class:`int`, ils peuvent être combinés avec eux (mais peuvent alors perdre l'appartenance à :class:`IntFlag`) ::

source: The negation operator, ``~``, always returns an :class:`IntFlag` member with a positive value::
fr: l'opérateur de négation, ``~``, renvoie toujours un membre :class:`IntFlag` avec une valeur positive ::

source: :class:`IntFlag` members can also be iterated over::
fr: On peut aussi itérer sur les membres d'une :class:`IntFlag` ::

source: The last variation is :class:`Flag`. Like :class:`IntFlag`, :class:`Flag` members can be combined using the bitwise operators (&, \|, ^, ~). Unlike :class:`IntFlag`, they cannot be combined with, nor compared against, any other :class:`Flag` enumeration, nor :class:`int`. While it is possible to specify the values directly it is recommended to use :class:`auto` as the value and let :class:`Flag` select an appropriate value.
fr: La dernière variante est :class:`Flag`. Comme :class:`IntFlag`, les membres de :class:`Flag` peuvent être combinés à l'aide des opérateurs bit-à-bit (&, \|, ^, ~). Contrairement à :class:`IntFlag`, ils ne peuvent être combinés ni comparés à aucune autre énumération :class:`Flag`, ni à :class:`int`. Bien qu'il soit possible de spécifier les valeurs directement, il est recommandé d'utiliser :class:`auto` comme valeur et de laisser :class:`Flag` sélectionner une valeur appropriée.

source: Like :class:`IntFlag`, if a combination of :class:`Flag` members results in no flags being set, the boolean evaluation is :data:`False`::
fr: Comme pour :class:`IntFlag`, si une combinaison de membres :class:`Flag` entraîne qu'aucun indicateur n'est défini, l'évaluation booléenne est :data:`False` ::

source: Giving a name to the "no flags set" condition does not change its boolean value::
fr: Donner un nom à la condition « aucun indicateur défini » ne change pas sa valeur booléenne ::

source: :class:`Flag` members can also be iterated over::
fr: On peut aussi itérer sur les membres d'une :class:`Flag` ::

source: For the majority of new code, :class:`Enum` and :class:`Flag` are strongly recommended, since :class:`IntEnum` and :class:`IntFlag` break some semantic promises of an enumeration (by being comparable to integers, and thus by transitivity to other unrelated enumerations). :class:`IntEnum` and :class:`IntFlag` should be used only in cases where :class:`Enum` and :class:`Flag` will not do; for example, when integer constants are replaced with enumerations, or for interoperability with other systems.
fr: pour la majorité du code nouveau, :class:`Enum` et :class:`Flag` sont fortement recommandées, car :class:`IntEnum` et :class:`IntFlag` brisent certaines promesses sémantiques d'une énumération (en pouvant être comparées à des entiers et donc, par transitivité, à d'autres énumérations sans rapport). :class:`IntEnum` et :class:`IntFlag` ne doivent être utilisées que dans les cas où :class:`Enum` et :class:`Flag` ne suffisent pas ; par exemple, lorsque des constantes entières sont remplacées par des énumérations, ou pour l'interopérabilité avec d'autres systèmes.

source: Others
fr: Autres énumérations

source: While :class:`IntEnum` is part of the :mod:`enum` module, it would be very simple to implement independently::
fr: Bien que :class:`IntEnum` fasse partie du module :mod:`enum`, il serait très simple de l'implémenter indépendamment ::

source: This demonstrates how similar derived enumerations can be defined; for example a :class:`FloatEnum` that mixes in :class:`float` instead of :class:`int`.
fr: Ceci montre comment définir des énumérations dérivées similaires ; par exemple une :class:`FloatEnum` qui utilise :class:`float` au lieu de :class:`int`.

source: Some rules:
fr: Quelques règles :

source: When subclassing :class:`Enum`, mix-in types must appear before :class:`Enum` itself in the sequence of bases, as in the :class:`IntEnum` example above.
fr: Lorsque vous dérivez :class:`Enum`, les classes mères mélangées doivent apparaître avant :class:`Enum` elle-même dans la liste des classes mères, comme dans l'exemple :class:`IntEnum` ci-dessus.

source: Mix-in types must be subclassable. For example, :class:`bool` and :class:`range` are not subclassable and will throw an error during Enum creation if used as the mix-in type.
fr: Les types mélangés doivent pouvoir être sous-classés. Par exemple, :class:`bool` et :class:`range` ne peuvent pas être sous-classés et génèrent une erreur lors de la création d'une énumération s'ils sont utilisés comme type de mélange.

source: While :class:`Enum` can have members of any type, once you mix in an additional type, all the members must have values of that type, e.g. :class:`int` above. This restriction does not apply to mix-ins which only add methods and don't specify another type.
fr: Alors qu':class:`Enum` peut avoir des membres de n'importe quel type, une fois que vous avez mélangé un type supplémentaire, tous les membres doivent avoir des valeurs de ce type, par exemple :class:`int` ci-dessus. Cette restriction ne s'applique pas aux classes de mélange qui ajoutent uniquement des méthodes et ne spécifient pas d'autre type.

source: When another data type is mixed in, the :attr:`value` attribute is *not the same* as the enum member itself, although it is equivalent and will compare equal.
fr: Lorsqu'un autre type de données est mélangé, l'attribut :attr:`value` n'est *pas le même* que le membre de l'énumération en tant que tel, bien qu'il soit équivalent et renvoie égal lors d'une comparaison.

source: %-style formatting: ``%s`` and ``%r`` call the :class:`Enum` class's :meth:`__str__` and :meth:`__repr__` respectively; other codes (such as ``%i`` or ``%h`` for IntEnum) treat the enum member as its mixed-in type.
fr: Formatage de style % : ``%s`` et ``%r`` appellent respectivement les méthodes :meth:`__str__` et :meth:`__repr__` de la classe :class:`Enum` ; d'autres codes (tels que ``%i`` ou ``%h`` pour *IntEnum*) traitent le membre de l’énumération comme son type mélangé.

source: :ref:`Formatted string literals <f-strings>`, :meth:`str.format`, and :func:`format` will use the enum's :meth:`__str__` method.
fr: :ref:`Les littéraux de chaîne formatés <f-strings>`, :meth:`str.format` et :func:`format` utilisent la méthode :meth:`__str__` de l'énumération.

source: When to use :meth:`__new__` vs. :meth:`__init__`
fr: Utilisation de :meth:`__new__` ou de :meth:`__init__`

source: :meth:`__new__` must be used whenever you want to customize the actual value of the :class:`Enum` member. Any other modifications may go in either :meth:`__new__` or :meth:`__init__`, with :meth:`__init__` being preferred.
fr: :meth:`__new__` doit être utilisée chaque fois que vous souhaitez personnaliser la valeur réelle des membres d'une :class:`Enum`. Pour les autres personnalisations, elles peuvent être définies dans :meth:`__new__` ou :meth:`__init__`, avec une préférence pour :meth:`__init__`.

source: For example, if you want to pass several items to the constructor, but only want one of them to be the value::
fr: Par exemple, si vous souhaitez passer plusieurs éléments au constructeur, mais que vous souhaitez qu'un seul d'entre eux soit la valeur ::

source: Finer Points
fr: Approfondissements

source: Supported ``__dunder__`` names
fr: Noms de la forme ``__dunder__`` disponibles

source: :attr:`__members__` is a read-only ordered mapping of ``member_name``:``member`` items. It is only available on the class.
fr: :attr:`__members__` est un dictionnaire ordonné d'éléments en lecture seule de la forme ``nom_du_membre`` : ``membre``. Il n'est disponible que dans la classe.

source: :meth:`__new__`, if specified, must create and return the enum members; it is also a very good idea to set the member's :attr:`_value_` appropriately. Once all the members are created it is no longer used.
fr: La méthode :meth:`__new__`, si elle est définie, doit créer et renvoyer les membres de l'énumération ; affecter correctement l'attribut :attr:`_value_` du membre est également conseillé. Une fois que tous les membres ont été créés, cette méthode n'est plus utilisée.

source: Supported ``_sunder_`` names
fr: Noms de la forme ``_sunder_`` disponibles

source: ``_name_`` -- name of the member
fr: ``_name_`` — nom du membre

source: ``_value_`` -- value of the member; can be set / modified in ``__new__``
fr: ``_value_`` — valeur du membre ; il est possible d'y accéder et de la modifier dans ``__new__``

source: ``_missing_`` -- a lookup function used when a value is not found; may be overridden
fr: ``_missing_`` — fonction de recherche qui est appelée quand la valeur n'est pas trouvée ; elle peut être surchargée

source: ``_ignore_`` -- a list of names, either as a :class:`list` or a :class:`str`, that will not be transformed into members, and will be removed from the final class
fr: ``_ignore_`` — liste de noms, sous la forme d'une :func:`list` ou d'une :func:`str`, qui ne sont pas convertis en membres et sont supprimés de la classe résultante

source: ``_order_`` -- used in Python 2/3 code to ensure member order is consistent (class attribute, removed during class creation)
fr: ``_order_`` — utilisé en Python 2 ou 3 pour s'assurer que l'ordre des membres est cohérent (attribut de classe, supprimé durant la création de la classe)

source: ``_generate_next_value_`` -- used by the `Functional API`_ and by :class:`auto` to get an appropriate value for an enum member; may be overridden
fr: ``_generate_next_value_`` — utilisé par l'`API fonctionnelle`_ et par :class:`auto` pour obtenir une valeur appropriée pour un membre de l'énumération ; elle peut être surchargée

source: For standard :class:`Enum` classes the next value chosen is the last value seen incremented by one.
fr: pour les classes standard :class:`Enum`, la valeur choisie suivante est la dernière valeur vue incrémentée de un.

source: For :class:`Flag` classes the next value chosen will be the next highest power-of-two, regardless of the last value seen.
fr: Pour les classes :class:`Flag`, la valeur choisie suivante est la prochaine puissance de deux la plus élevée, quelle que soit la dernière valeur vue.

source: To help keep Python 2 / Python 3 code in sync an :attr:`_order_` attribute can be provided. It will be checked against the actual order of the enumeration and raise an error if the two do not match::
fr: Pour aider à garder le code Python 2 / Python 3 synchronisé, un attribut :attr:`_order_` peut être fourni. Il est vérifié par rapport à l'ordre réel de l'énumération et lève une erreur si les deux ne correspondent pas ::

source: In Python 2 code the :attr:`_order_` attribute is necessary as definition order is lost before it can be recorded.
fr: dans le code Python 2, l'attribut :attr:`_order_` est nécessaire car l'ordre de définition est perdu avant de pouvoir être enregistré.

source: :ref:`Private names <private-name-mangling>` are not converted to enum members, but remain normal attributes.
fr: :ref:`Les noms privés <private-name-mangling>` ne sont pas convertis en membres de l'énumération, mais restent des attributs normaux.

source: ``Enum`` member type
fr: Types des membres d'une ``Enum``

source: Creating members that are mixed with other data types
fr: Création de membres mélangés avec d'autres types de données

source: When subclassing other data types, such as :class:`int` or :class:`str`, with an :class:`Enum`, all values after the ``=`` are passed to that data type's constructor. For example::
fr: Lorsque vous dérivez d'autres types de données, tels que :class:`int` ou :class:`str`, avec une :class:`Enum`, toutes les valeurs après ``=`` sont passées au constructeur de ce type de données. Par exemple ::

source: Boolean value of ``Enum`` classes and members
fr: Valeur booléenne des classes et membres ``Enum``

source: Enum classes that are mixed with non-:class:`Enum` types (such as :class:`int`, :class:`str`, etc.) are evaluated according to the mixed-in type's rules; otherwise, all members evaluate as :data:`True`. To make your own enum's boolean evaluation depend on the member's value add the following to your class::
fr: Les classes *Enum* mélangées avec des types non-:class:`Enum` (tels que :class:`int`, :class:`str`, etc.) sont évaluées selon les règles du type mélangé ; sinon, tous les membres sont évalués comme :data:`True`. Pour que l'évaluation booléenne de votre propre énumération dépende de la valeur du membre, ajoutez ce qui suit à votre classe ::

source: Plain :class:`Enum` classes always evaluate as :data:`True`.
fr: Les classes simples :class:`Enum` sont toujours évaluées comme :data:`True`.

source: ``Enum`` classes with methods
fr: Méthodes dans les classes ``Enum``

source: If you give your enum subclass extra methods, like the `Planet`_ class below, those methods will show up in a :func:`dir` of the member, but not of the class::
fr: Si vous dotez votre sous-classe énumération de méthodes supplémentaires, comme la classe `Planet`_ ci-dessous, ces méthodes apparaissent dans le :func:`dir` des membres, mais pas dans celui de la classe ::

source: Combining members of ``Flag``
fr: Combinaisons de membres de ``Flag``

source: Iterating over a combination of :class:`Flag` members will only return the members that are comprised of a single bit::
fr: L'itération sur une combinaison de membres :class:`Flag` ne renvoie que les membres dont un seul bit est à 1 ::

source: ``Flag`` and ``IntFlag`` minutia
fr: Précisions sur ``Flag`` et ``IntFlag``

source: Using the following snippet for our examples::
fr: En utilisant l'extrait suivant pour nos exemples ::

source: the following are true:
fr: ce qui suit est vrai :

source: single-bit flags are canonical
fr: les membres dont un seul bit est à 1 sont canoniques ;

source: multi-bit and zero-bit flags are aliases
fr: ceux qui ont plusieurs bits à 1 ou aucun bit à 1 sont des synonymes ;

source: only canonical flags are returned during iteration::
fr: seuls les membres canoniques sont renvoyés pendant une itération ::

source: negating a flag or flag set returns a new flag/flag set with the corresponding positive integer value::
fr: la négation d'un membre ou d'une composition de membres renvoie un nouveau membre (ou composition de membres) avec la valeur entière positive correspondante ::

source: names of pseudo-flags are constructed from their members' names::
fr: les noms des pseudo-membres sont construits à partir des noms de leurs membres ::

source: multi-bit flags, aka aliases, can be returned from operations::
fr: les membres avec plusieurs bits à 1 (des alias) peuvent être renvoyés par les opérations ::

source: membership / containment checking: zero-valued flags are always considered to be contained::
fr: pour la vérification d'appartenance, les membres dont la valeur est 0 sont toujours considérés comme étant membres ::

source: otherwise, only if all bits of one flag are in the other flag will True be returned::
fr: sinon, seulement si tous les bits à 1 d'un membre sont aussi à 1 dans l'autre membre, renvoie *True* ::

source: There is a new boundary mechanism that controls how out-of-range / invalid bits are handled: ``STRICT``, ``CONFORM``, ``EJECT``, and ``KEEP``:
fr: Il existe un nouveau mécanisme de délimitation qui contrôle la façon dont les bits hors plage/invalides sont gérés : ``STRICT``, ``CONFORM``, ``EJECT`` et ``KEEP`` :

source: STRICT --> raises an exception when presented with invalid values
fr: *STRICT* --> lève une exception lorsqu'on lui présente des valeurs invalides

source: CONFORM --> discards any invalid bits
fr: *CONFORM* --> ignore les bits invalides

source: EJECT --> lose Flag status and become a normal int with the given value
fr: *EJECT* --> la valeur présentée perd le statut de membre et devient un entier normal

source: KEEP --> keep the extra bits
fr: *KEEP* --> garde les bits supplémentaires

source: keeps Flag status and extra bits
fr: garde le statut de membre avec les bits supplémentaires

source: extra bits do not show up in iteration
fr: les bits supplémentaires ne sont pas produits dans une itération

source: extra bits do show up in repr() and str()
fr: les bits supplémentaires ne sont pas représentés par *repr()* et *str()*

source: The default for Flag is ``STRICT``, the default for ``IntFlag`` is ``EJECT``, and the default for ``_convert_`` is ``KEEP`` (see ``ssl.Options`` for an example of when ``KEEP`` is needed).
fr: La valeur par défaut pour *Flag* est ``STRICT``, la valeur par défaut pour ``IntFlag`` est ``EJECT`` et la valeur par défaut pour ``_convert_`` est ``KEEP`` (voir ``ssl.Options`` pour un exemple de cas où ``KEEP`` est nécessaire).

source: Enums have a custom metaclass that affects many aspects of both derived :class:`Enum` classes and their instances (members).
fr: Les énumérations ont une métaclasse personnalisée qui modifie de nombreux aspects des classes dérivées d':class:`Enum` et de leurs instances (membres).

source: Enum Classes
fr: Classes *Enum*

source: Enum Members (aka instances)
fr: Membres d'une *Enum* (les instances)

source: The most interesting thing about enum members is that they are singletons. :class:`EnumType` creates them all while it is creating the enum class itself, and then puts a custom :meth:`__new__` in place to ensure that no new ones are ever instantiated by returning only the existing member instances.
fr: Le plus intéressant à propos des membres d'une énumération est que ce sont des singletons. :class:`EnumType` les crée tous pendant qu'il crée la classe *enum* elle-même, puis met en place une méthode :meth:`__new__` personnalisée pour s'assurer qu'aucun nouveau membre n'est jamais instancié (en renvoyant uniquement les instances de membres existantes).

source: While :class:`Enum`, :class:`IntEnum`, :class:`StrEnum`, :class:`Flag`, and :class:`IntFlag` are expected to cover the majority of use-cases, they cannot cover them all. Here are recipes for some different types of enumerations that can be used directly, or as examples for creating one's own.
fr: :class:`Enum`, :class:`IntEnum`, :class:`StrEnum`, :class:`Flag` et :class:`IntFlag` sont censées couvrir la majorité des cas d'utilisation, mais elles ne peuvent pas tout couvrir. Voici quelques recettes pour différents types d'énumérations qui peuvent être utilisées directement, ou pour servir d'exemples afin de créer les vôtres.

source: Omitting values
fr: Omission de valeurs

source: In many use-cases, one doesn't care what the actual value of an enumeration is. There are several ways to define this type of simple enumeration:
fr: Dans de nombreux cas d'utilisation, on ne se soucie pas de la valeur réelle d'une énumération. Il existe plusieurs manières de définir ce type d'énumération simple :

source: use instances of :class:`auto` for the value
fr: utilisez des instances d':class:`auto` pour la valeur ;

source: use instances of :class:`object` as the value
fr: utilisez des instances d':class:`object` comme valeur ;

source: use a descriptive string as the value
fr: utilisez une chaîne de caractères descriptive comme valeur ;

source: use a tuple as the value and a custom :meth:`__new__` to replace the tuple with an :class:`int` value
fr: utilisez un *n*-uplet comme valeur et une :meth:`__new__` personnalisée pour remplacer le *n*-uplet par une valeur :class:`int`.

source: Using any of these methods signifies to the user that these values are not important, and also enables one to add, remove, or reorder members without having to renumber the remaining members.
fr: L'utilisation de l'une de ces méthodes signifie au lecteur que ces valeurs ne sont pas importantes et permet également d'ajouter, de supprimer ou de réorganiser des membres sans avoir à renuméroter les autres membres.

source: Using :class:`auto`
fr: Utilisation d':class:`auto`

source: Using :class:`auto` would look like::
fr: Voici un exemple où nous utilisons :class:`auto` ::

source: Using :class:`object`
fr: Utilisation d':class:`object`

source: Using :class:`object` would look like::
fr: Voici un exemple où nous utilisons :class:`object` ::

source: This is also a good example of why you might want to write your own :meth:`__repr__`::
fr: Voici un bon exemple montrant pourquoi vouloir écrire sa propre :meth:`__repr__` ::

source: Using a descriptive string
fr: Utilisation d'une chaîne de caractères descriptive

source: Using a string as the value would look like::
fr: Voici un exemple où nous utilisons une chaîne de caractères ::

source: Using a custom :meth:`__new__`
fr: Utilisation d'une méthode :meth:`__new__` personnalisée

source: Using an auto-numbering :meth:`__new__` would look like::
fr: Cette méthode :meth:`__new__` numérote automatiquement ::

source: To make a more general purpose ``AutoNumber``, add ``*args`` to the signature::
fr: Pour créer une ``AutoNumber`` plus générale, ajoutons ``*args`` à la signature ::

source: Then when you inherit from ``AutoNumber`` you can write your own ``__init__`` to handle any extra arguments::
fr: Ensuite, lorsque nous héritons de ``AutoNumber``, nous pouvons écrire notre propre ``__init__`` pour gérer les arguments supplémentaires ::
