Repository: python/python-docs-fr
Catalog: howto/enum.po
Languages: fr

source: Enum HOWTO
fr: Guide sur l'utilisation d'*Enum*

source: An :class:`Enum` is a set of symbolic names bound to unique values. They are similar to global variables, but they offer a more useful :func:`repr()`, grouping, type-safety, and a few other features.
fr: Une :class:`Enum` est un ensemble de noms symboliques associés à des valeurs uniques. Elles sont similaires aux variables globales, mais elles offrent des particularités utiles telles qu'une meilleure :func:`repr()`, le regroupement, une sécurité concernant le typage et quelques autres fonctionnalités.

source: They are most useful when you have a variable that can take one of a limited selection of values. For example, the days of the week::
fr: Elles sont particulièrement utiles lorsque vous avez une variable qui peut prendre une valeur dans une plage limitée de valeurs. Par exemple, les jours de la semaine ::

source: Or perhaps the RGB primary colors::
fr: Ou alors les couleurs primaires *RVB* (NdT : *RGB* en anglais) ::

source: As you can see, creating an :class:`Enum` is as simple as writing a class that inherits from :class:`Enum` itself.
fr: Comme vous pouvez le voir, créer une :class:`Enum` est très simple à écrire, il suffit qu'elle hérite de :class:`Enum` elle-même.

source: Case of Enum Members
fr: casse des membres d'une énumération

source: Because Enums are used to represent constants we recommend using UPPER_CASE names for members, and will be using that style in our examples.
fr: Étant donné que les énumérations sont utilisées pour représenter des constantes, nous vous recommandons d'utiliser des noms en MAJUSCULES pour les membres, et nous utiliserons ce style dans nos exemples.

source: Depending on the nature of the enum a member's value may or may not be important, but either way that value can be used to get the corresponding member::
fr: Selon la nature de l'énumération, il peut être important d'avoir accès à la valeur d'un membre. Dans tous les cas, cette valeur peut être utilisée pour obtenir le membre correspondant ::

source: As you can see, the ``repr()`` of a member shows the enum name, the member name, and the value. The ``str()`` of a member shows only the enum name and member name::
fr: Comme vous pouvez le constater, la ``repr()`` d'un membre affiche le nom de l'énumération, le nom du membre et la valeur. La ``str()`` d'un membre affiche uniquement le nom de l'énumération et le nom du membre ::

source: The *type* of an enumeration member is the enum it belongs to::
fr: Le *type* d'un membre d'énumération est l'énumération à laquelle il appartient ::

source: Enum members have an attribute that contains just their :attr:`name`::
fr: Les membres d'une énumération possèdent un attribut :attr:`name` qui contient leur nom ::

source: Likewise, they have an attribute for their :attr:`value`::
fr: De même, ils ont un attribut :attr:`value` pour leur valeur ::

source: Unlike many languages that treat enumerations solely as name/value pairs, Python Enums can have behavior added. For example, :class:`datetime.date` has two methods for returning the weekday: :meth:`weekday` and :meth:`isoweekday`. The difference is that one of them counts from 0-6 and the other from 1-7. Rather than keep track of that ourselves we can add a method to the :class:`Weekday` enum to extract the day from the :class:`date` instance and return the matching enum member::
fr: Contrairement à de nombreux langages qui traitent les énumérations uniquement comme des paires nom-valeur, le comportement des énumérations Python peut être augmenté. Par exemple, :class:`datetime.date` a deux méthodes pour renvoyer le jour de la semaine : :meth:`weekday` et :meth:`isoweekday`. La différence est que la première compte de 0 à 6 et la seconde de 1 à 7. Plutôt que d'avoir à nous en rappeler nous-mêmes, nous pouvons ajouter une méthode à l'énumération :class:`Weekday` pour extraire le jour d'une instance :class:`date` et renvoyer le membre correspondant de l'énumération ::

source: The complete :class:`Weekday` enum now looks like this::
fr: L'énumération :class:`Weekday` en entier ressemble maintenant à ceci ::

source: Now we can find out what today is! Observe::
fr: Maintenant, nous pouvons découvrir quel jour nous sommes aujourd'hui ! Regardez ::

source: Of course, if you're reading this on some other day, you'll see that day instead.
fr: Bien sûr, si vous lisez cette page un autre jour, vous verrez ce jour-là à la place.

source: This :class:`Weekday` enum is great if our variable only needs one day, but what if we need several? Maybe we're writing a function to plot chores during a week, and don't want to use a :class:`list` -- we could use a different type of :class:`Enum`::
fr: Cette énumération :class:`Weekday` est idéale si notre variable n'a besoin que d'un jour, mais que se passe-t-il si nous en avons besoin de plusieurs ? Par exemple si nous écrivons une fonction pour garder une trace des tâches pendant une semaine, et que nous ne voulons pas utiliser une :class:`list` — nous pouvons utiliser un autre type :class:`Enum` ::

source: We've changed two things: we're inherited from :class:`Flag`, and the values are all powers of 2.
fr: Nous avons changé deux choses : nous héritons de :class:`Flag` et les valeurs sont toutes des puissances de 2.

source: Just like the original :class:`Weekday` enum above, we can have a single selection::
fr: De la même manière que pour l'énumération originale :class:`Weekday` ci-dessus, nous pouvons sélectionner un seul élément ::

source: But :class:`Flag` also allows us to combine several members into a single variable::
fr: Mais :class:`Flag` nous permet aussi de combiner plusieurs membres en une seule variable ::

source: You can even iterate over a :class:`Flag` variable::
fr: Nous pouvons même itérer sur une variable :class:`Flag` ::

source: Okay, let's get some chores set up::
fr: Bien, préparons quelques corvées ::

source: And a function to display the chores for a given day::
fr: Et une fonction pour afficher les corvées d'un jour donné ::

source: In cases where the actual values of the members do not matter, you can save yourself some work and use :func:`auto()` for the values::
fr: Au cas où les valeurs réelles des membres n'ont pas d'importance, nous pouvons nous épargner du travail et utiliser :func:`auto()` pour les valeurs ::

source: Programmatic access to enumeration members and their attributes
fr: Accès par programme aux membres de l'énumération et à leurs attributs

source: Sometimes it's useful to access members in enumerations programmatically (i.e. situations where ``Color.RED`` won't do because the exact color is not known at program-writing time). ``Enum`` allows such access::
fr: Il est parfois utile d'accéder aux membres d'une énumération programmatiquement (c'est-à-dire les cas où ``Color.RED`` ne suffit pas car la couleur exacte n'est pas connue au moment de l'écriture du programme). ``Enum`` permet de tels accès ::

source: If you want to access enum members by *name*, use item access::
fr: Si vous souhaitez accéder aux membres d'une énumération par leur nom, utilisez l'accès par indice ::

source: If you have an enum member and need its :attr:`name` or :attr:`value`::
fr: Si vous avez un membre d'une énumération et que vous avez besoin de son :attr:`nom <name>` ou de sa :attr:`valeur <value>`, utilisez ses attributs ::

source: Duplicating enum members and values
fr: Duplication des membres et des valeurs d'une énumération

source: Having two enum members with the same name is invalid::
fr: Il n'est pas licite d'avoir deux membres d'une énumération avec le même nom ::

source: However, an enum member can have other names associated with it. Given two entries ``A`` and ``B`` with the same value (and ``A`` defined first), ``B`` is an alias for the member ``A``. By-value lookup of the value of ``A`` will return the member ``A``. By-name lookup of ``A`` will return the member ``A``. By-name lookup of ``B`` will also return the member ``A``::
fr: Cependant, un membre peut avoir d'autres noms qui lui sont associés. Étant donné deux entrées ``A`` et ``B`` avec la même valeur (et ``A`` définie en premier), ``B`` est un synonyme (ou alias) du membre ``A``. La recherche par valeur de la valeur de ``A`` renvoie le membre ``A``. La recherche par nom de ``A`` renvoie le membre ``A``. La recherche par nom de ``B`` renvoie également le membre ``A`` ::

source: Attempting to create a member with the same name as an already defined attribute (another member, a method, etc.) or attempting to create an attribute with the same name as a member is not allowed.
fr: tenter de créer un membre portant le même nom qu'un attribut déjà défini (un autre membre, une méthode, etc.) ou tenter de créer un attribut portant le même nom qu'un membre n'est pas autorisé.

source: Ensuring unique enumeration values
fr: Garantie de valeurs d'énumération uniques

source: By default, enumerations allow multiple names as aliases for the same value. When this behavior isn't desired, you can use the :func:`unique` decorator::
fr: Par défaut, les énumérations autorisent plusieurs noms comme synonymes pour la même valeur. Lorsque ce comportement n'est pas souhaité, vous pouvez utiliser le décorateur :func:`unique` ::

source: Using automatic values
fr: Utilisation de valeurs automatiques

source: If the exact value is unimportant you can use :class:`auto`::
fr: Si la valeur exacte n'est pas importante, vous pouvez utiliser :class:`auto` ::

source: The values are chosen by :func:`_generate_next_value_`, which can be overridden::
fr: Les valeurs sont choisies par :func:`_generate_next_value_`, qui peut être surchargée ::

source: The :meth:`_generate_next_value_` method must be defined before any members.
fr: la méthode :meth:`_generate_next_value_` doit être définie avant tout membre.

source: Iteration
fr: Itération

source: Iterating over the members of an enum does not provide the aliases::
fr: L'itération sur les membres d'une énumération ne fournit pas les synonymes ::

source: The special attribute ``__members__`` is a read-only ordered mapping of names to members. It includes all names defined in the enumeration, including the aliases::
fr: L'attribut spécial ``__members__`` est un tableau de correspondances ordonné en lecture seule des noms vers les membres. Il inclut tous les noms définis dans l'énumération, y compris les synonymes ::

source: The ``__members__`` attribute can be used for detailed programmatic access to the enumeration members. For example, finding all the aliases::
fr: L'attribut ``__members__`` peut être utilisé pour un accès programmatique détaillé aux membres de l'énumération. Par exemple, trouver tous les synonymes ::

source: Comparisons
fr: Comparaisons

source: Enumeration members are compared by identity::
fr: Les membres de l'énumération sont comparés par identité ::

source: Ordered comparisons between enumeration values are *not* supported. Enum members are not integers (but see `IntEnum`_ below)::
fr: Les comparaisons ordonnées entre les valeurs d'énumération *ne sont pas* prises en charge. Les membres d'une énumération ne sont pas des entiers (mais voir `IntEnum`_ plus bas) ::

source: Equality comparisons are defined though::
fr: Les comparaisons d'égalité sont cependant définies ::

source: Comparisons against non-enumeration values will always compare not equal (again, :class:`IntEnum` was explicitly designed to behave differently, see below)::
fr: Les comparaisons avec des valeurs en dehors de l'énumération sont toujours fausses (encore une fois, :class:`IntEnum` a été explicitement conçue pour se comporter différemment, voir ci-dessous) ::

source: Allowed members and attributes of enumerations
fr: Membres et attributs autorisés des énumérations

source: Most of the examples above use integers for enumeration values. Using integers is short and handy (and provided by default by the `Functional API`_), but not strictly enforced. In the vast majority of use-cases, one doesn't care what the actual value of an enumeration is. But if the value *is* important, enumerations can have arbitrary values.
fr: La plupart des exemples ci-dessus utilisent des nombres entiers pour les valeurs d'énumération. L'utilisation d'entiers est rapide et pratique (et fournie par défaut par l'`API fonctionnelle`_), mais n'est pas strictement obligatoire. Dans la grande majorité des cas, on ne se soucie pas de la valeur réelle des membres d'une énumération. Mais si la valeur *est* importante, les énumérations peuvent avoir des valeurs arbitraires.

source: Enumerations are Python classes, and can have methods and special methods as usual. If we have this enumeration::
fr: Les énumérations sont des classes Python et peuvent avoir des méthodes ainsi que des méthodes spéciales comme d'habitude. Prenons cette énumération ::

source: Then::
fr: alors ::

source: The rules for what is allowed are as follows: names that start and end with a single underscore are reserved by enum and cannot be used; all other attributes defined within an enumeration will become members of this enumeration, with the exception of special methods (:meth:`__str__`, :meth:`__add__`, etc.), descriptors (methods are also descriptors), and variable names listed in :attr:`_ignore_`.
fr: Les règles concernant ce qui est autorisé ou pas sont les suivantes : les noms qui commencent et se terminent par un seul caractère de soulignement sont réservés par l'énumération et ne peuvent pas être utilisés ; tous les autres attributs définis dans une énumération deviendront membres de cette énumération, à l'exception des méthodes spéciales (:meth:`__str__`, :meth:`__add__`, etc.), des descripteurs (les méthodes sont aussi des descripteurs) et des noms de variables listés dans :attr:`_ignore_`.

source: Note: if your enumeration defines :meth:`__new__` and/or :meth:`__init__` then any value(s) given to the enum member will be passed into those methods. See `Planet`_ for an example.
fr: Remarque : si votre énumération définit :meth:`__new__` ou :meth:`__init__`, alors toute valeur donnée à un membre de l'énumération sera passée à ces méthodes. Voir `Planète`_ pour un exemple.

source: Restricted Enum subclassing
fr: Restrictions sur la dérivation d'énumérations

source: A new :class:`Enum` class must have one base enum class, up to one concrete data type, and as many :class:`object`-based mixin classes as needed. The order of these base classes is::
fr: Une nouvelle classe :class:`Enum` doit avoir une classe mère *Enum*, jusqu'à un type de données concret, et autant de classes mélangées filles de :class:`object` que nécessaire. L'ordre de ces classes mères est ::

source: Also, subclassing an enumeration is allowed only if the enumeration does not define any members. So this is forbidden::
fr: De plus, la dérivation d'une énumération n'est autorisée que si l'énumération ne définit aucun membre. Donc ceci est interdit ::

source: But this is allowed::
fr: Mais ceci est autorisé ::

source: Allowing subclassing of enums that define members would lead to a violation of some important invariants of types and instances. On the other hand, it makes sense to allow sharing some common behavior between a group of enumerations. (See `OrderedEnum`_ for an example.)
fr: Autoriser la dérivation d'énumérations qui définissent les membres conduirait à une violation de certains invariants importants des types et des instances. D'un autre côté, il est logique de permettre le partage d'un comportement commun entre un groupe d'énumérations (voir `OrderedEnum`_ pour un exemple).

source: Pickling
fr: Sérialisation

source: Enumerations can be pickled and unpickled::
fr: Les énumérations peuvent être sérialisées et désérialisées ::

source: The usual restrictions for pickling apply: picklable enums must be defined in the top level of a module, since unpickling requires them to be importable from that module.
fr: Les restrictions habituelles pour la sérialisation s'appliquent : les énumérations sérialisables doivent être définies au niveau supérieur d'un module, car la sérialisation nécessite qu'elles puissent être importées à partir de ce module.

source: With pickle protocol version 4 it is possible to easily pickle enums nested in other classes.
fr: avec la version 4 du protocole *pickle*, il est possible de sérialiser facilement les énumérations imbriquées dans d'autres classes.

source: Functional API
fr: API fonctionnelle

source: The :class:`Enum` class is callable, providing the following functional API::
fr: La classe :class:`Enum` est appelable, elle fournit l'API fonctionnelle suivante ::

source: The semantics of this API resemble :class:`~collections.namedtuple`. The first argument of the call to :class:`Enum` is the name of the enumeration.
fr: La sémantique de cette API ressemble à celle des :class:`~collections.namedtuple`. Le premier argument de l'appel à :class:`Enum` est le nom de l'énumération.

source: The second argument is the *source* of enumeration member names. It can be a whitespace-separated string of names, a sequence of names, a sequence of 2-tuples with key/value pairs, or a mapping (e.g. dictionary) of names to values. The last two options enable assigning arbitrary values to enumerations; the others auto-assign increasing integers starting with 1 (use the ``start`` parameter to specify a different starting value). A new class derived from :class:`Enum` is returned. In other words, the above assignment to :class:`Animal` is equivalent to::
fr: Le deuxième argument est la *source* des noms des membres de l'énumération. Il peut s'agir d'une chaîne de noms séparés par des espaces, d'une séquence de noms, d'une séquence de couples clé-valeur, ou d'un tableau de correspondances (par exemple, un dictionnaire) de noms vers des valeurs. Les deux dernières options permettent d'attribuer des valeurs arbitraires aux énumérations ; les autres assignent automatiquement des entiers croissants commençant à 1 (utilisez le paramètre ``start`` pour spécifier une valeur de départ différente). Une nouvelle classe dérivée d':class:`Enum` est renvoyée. En d'autres termes, l'affectation ci-dessus à :class:`Animal` est équivalente à ::

source: The reason for defaulting to ``1`` as the starting number and not ``0`` is that ``0`` is ``False`` in a boolean sense, but by default enum members all evaluate to ``True``.
fr: La raison de la valeur par défaut de ``1`` comme numéro de départ et non de ``0`` est que le sens booléen de ``0`` est ``False``. Or, par défaut, les membres d'une énumération s'évaluent tous à ``True``.

source: Pickling enums created with the functional API can be tricky as frame stack implementation details are used to try and figure out which module the enumeration is being created in (e.g. it will fail if you use a utility function in a separate module, and also may not work on IronPython or Jython). The solution is to specify the module name explicitly as follows::
fr: La sérialisation d'énumérations créées avec l'API fonctionnelle peut être délicat car les détails d'implémentation de la pile d'appels sont utilisés pour essayer de déterminer dans quel module l'énumération est créée (par exemple, cela échoue si vous utilisez une fonction utilitaire dans un module séparé, et peut également ne pas fonctionner sur *IronPython* ou *Jython*). La solution consiste à spécifier explicitement le nom du module comme suit ::

source: If ``module`` is not supplied, and Enum cannot determine what it is, the new Enum members will not be unpicklable; to keep errors closer to the source, pickling will be disabled.
fr: si le ``module`` n'est pas fourni et qu'*Enum* ne peut pas le déterminer, les nouveaux membres de l'énumération ne pourront pas être sélectionnés ; pour garder les erreurs au plus près de la source, la sérialisation est désactivée.

source: The new pickle protocol 4 also, in some circumstances, relies on :attr:`~definition.__qualname__` being set to the location where pickle will be able to find the class. For example, if the class was made available in class SomeData in the global scope::
fr: Le nouveau protocole *pickle* 4 s'appuie également, dans certaines circonstances, sur :attr:`~definition.__qualname__` qui définit l'emplacement où la sérialisation peut trouver la classe. Par exemple, si la classe a été rendue disponible dans la classe *SomeData* avec une portée globale ::

source: The complete signature is::
fr: La signature complète est ::

source: What the new enum class will record as its name.
fr: ce que la nouvelle classe *enum* enregistre comme nom.

source: The enum members. This can be a whitespace- or comma-separated string (values will start at 1 unless otherwise specified)::
fr: les membres de l'énumération. Il peut s'agir d'une chaîne séparée par des espaces ou des virgules (les valeurs commencent à 1 sauf indication contraire) ::

source: or an iterator of names::
fr: ou un itérateur sur des noms ::

source: or an iterator of (name, value) pairs::
fr: ou un itérateur sur des paires (nom, valeur) ::

source: or a mapping::
fr: ou un tableau de correspondances ::

source: name of module where new enum class can be found.
fr: nom du module où la nouvelle classe *enum* peut être trouvée.

source: where in module new enum class can be found.
fr: à quel endroit dans le module la nouvelle classe *enum* peut être trouvée.

source: type to mix in to new enum class.
fr: types à mélanger avec la nouvelle classe *enum*.

source: number to start counting at if only names are passed in.
fr: nombre à partir duquel commencer à compter si seuls les noms sont transmis.

source: The *start* parameter was added.
fr: le paramètre *start* a été ajouté.

source: Derived Enumerations
fr: Déclinaisons d'énumérations

source: The first variation of :class:`Enum` that is provided is also a subclass of :class:`int`. Members of an :class:`IntEnum` can be compared to integers; by extension, integer enumerations of different types can also be compared to each other::
fr: La première variante de :class:`Enum` fournie est également une sous-classe de :class:`int`. Les membres d'une :class:`IntEnum` peuvent être comparés à des entiers ; par extension, des énumérations *IntEnum* de différents types peuvent aussi être comparées ::

source: However, they still can't be compared to standard :class:`Enum` enumerations::
fr: Cependant, elles ne peuvent toujours pas être comparées aux énumérations classiques :class:`Enum` ::

source: :class:`IntEnum` values behave like integers in other ways you'd expect::
fr: Les valeurs :class:`IntEnum` se comportent comme des entiers, comme vous pouvez vous y attendre ::

source: The second variation of :class:`Enum` that is provided is also a subclass of :class:`str`. Members of a :class:`StrEnum` can be compared to strings; by extension, string enumerations of different types can also be compared to each other.
fr: La deuxième variante de :class:`Enum` fournie est également une sous-classe de :class:`str`. Les membres d'une :class:`StrEnum` peuvent être comparés à des chaînes ; par extension, les énumérations *StrEnum* de différents types peuvent également être comparées les unes aux autres.
