Repository: python/python-docs-fr
Catalog: howto/functional.po
Languages: fr

source: Note that you can only go forward in an iterator; there's no way to get the previous element, reset the iterator, or make a copy of it. Iterator objects can optionally provide these additional capabilities, but the iterator protocol only specifies the :meth:`~iterator.__next__` method. Functions may therefore consume all of the iterator's output, and if you need to do something different with the same stream, you'll have to create a new iterator.
fr: Notez qu'il n'est possible de parcourir un itérateur que vers l'avant et qu'il est impossible de récupérer l'élément précédent, de réinitialiser l'itérateur ou d'en créer une copie. Des objets itérateurs peuvent offrir ces possibilités de façon facultative, mais le protocole d'itération ne spécifie que la méthode :meth:`~iterator.__next__`. Certaines fonctions peuvent ainsi consommer l'entièreté de la sortie d'un itérateur et, si vous devez utiliser le même flux pour autre chose, vous devrez en créer un nouveau.

source: Data Types That Support Iterators
fr: Types de données itérables

source: We've already seen how lists and tuples support iterators. In fact, any Python sequence type, such as strings, will automatically support creation of an iterator.
fr: Nous avons vu précédemment comment les listes et les *tuples* gèrent les itérateurs. En réalité, n'importe quel type de séquence en Python, par exemple les chaînes de caractères, sont itérables.

source: Calling :func:`iter` on a dictionary returns an iterator that will loop over the dictionary's keys::
fr: Appeler :func:`iter` sur un dictionnaire renvoie un itérateur qui parcourt l'ensemble de ses clés ::

source: Note that starting with Python 3.7, dictionary iteration order is guaranteed to be the same as the insertion order. In earlier versions, the behaviour was unspecified and could vary between implementations.
fr: Notez qu'à partir de la version 3.7, Python garantit que l'ordre de l'itération sur un dictionnaire est identique à l'ordre d'insertion des clés. Dans les versions précédentes, ce comportement n'était pas spécifié et pouvait varier en fonction de l'implémentation.

source: Applying :func:`iter` to a dictionary always loops over the keys, but dictionaries have methods that return other iterators. If you want to iterate over values or key/value pairs, you can explicitly call the :meth:`~dict.values` or :meth:`~dict.items` methods to get an appropriate iterator.
fr: Appliquer :func:`iter` sur un dictionnaire produit un itérateur sur ses clés mais il est possible d'obtenir d'autres itérateurs par d'autres méthodes. Si vous souhaitez itérer sur les valeurs ou les paires clé/valeur du dictionnaire, vous pouvez explicitement appeler les méthodes :meth:`~dict.values` ou :meth:`~dict.items` pour obtenir l'itérateur idoine.

source: The :func:`dict` constructor can accept an iterator that returns a finite stream of ``(key, value)`` tuples:
fr: Le constructeur :func:`dict` accepte de prendre un itérateur en argument qui renvoie un flux fini de pairs ``(clé, valeur)`` :

source: Files also support iteration by calling the :meth:`~io.TextIOBase.readline` method until there are no more lines in the file. This means you can read each line of a file like this::
fr: Les fichiers gèrent aussi l'itération en appelant la méthode :meth:`~io.TextIOBase.readline` jusqu'à ce qu'il n'y ait plus d'autre ligne dans le fichier. Cela signifie que vous pouvez lire l'intégralité d'un fichier de la façon suivante ::

source: Sets can take their contents from an iterable and let you iterate over the set's elements::
fr: Les ensembles peuvent être créés à partir d'un itérable et autorisent l'itération sur les éléments de l'ensemble ::

source: Generator expressions and list comprehensions
fr: Expressions génératrices et compréhension de listes

source: Two common operations on an iterator's output are 1) performing some operation for every element, 2) selecting a subset of elements that meet some condition. For example, given a list of strings, you might want to strip off trailing whitespace from each line or extract all the strings containing a given substring.
fr: Deux opérations courantes réalisables sur la sortie d'un itérateur sont 1) effectuer une opération pour chaque élément, 2) extraire le sous-ensemble des éléments qui vérifient une certaine condition. Par exemple, pour une liste de chaînes de caractères, vous pouvez choisir de retirer tous les caractères blancs à la fin de chaque ligne ou extraire toutes les chaînes contenant une sous-chaîne précise.

source: List comprehensions and generator expressions (short form: "listcomps" and "genexps") are a concise notation for such operations, borrowed from the functional programming language Haskell (https://www.haskell.org/). You can strip all the whitespace from a stream of strings with the following code::
fr: Les compréhensions de listes et les expressions génératrices sont une façon concise d'exprimer de telles opérations, inspirées du langage de programmation fonctionnel Haskell (https://www.haskell.org/). Vous pouvez retirer tous les caractères blancs d'un flux de chaînes de caractères à l'aide du code suivant ::

source: You can select only certain elements by adding an ``"if"`` condition::
fr: Vous pouvez ne sélectionner que certains éléments en ajoutant une condition ``"if"`` ::

source: With a list comprehension, you get back a Python list; ``stripped_list`` is a list containing the resulting lines, not an iterator. Generator expressions return an iterator that computes the values as necessary, not needing to materialize all the values at once. This means that list comprehensions aren't useful if you're working with iterators that return an infinite stream or a very large amount of data. Generator expressions are preferable in these situations.
fr: La compréhension de liste retourne une liste Python ; ``stripped_list`` est une liste contenant les lignes après transformation, pas un itérateur. Les expressions génératrices renvoient un itérateur qui calcule les valeurs au fur et à mesure sans toutes les matérialiser d'un seul coup. Cela signifie que les compréhensions de listes ne sont pas très utiles si vous travaillez sur des itérateurs infinis ou produisant une très grande quantité de données. Les expressions génératrices sont préférables dans ce cas.

source: Generator expressions are surrounded by parentheses ("()") and list comprehensions are surrounded by square brackets ("[]"). Generator expressions have the form::
fr: Les expressions génératrices sont écrites entre parenthèses ("()") et les compréhensions de listes entre crochets ("[]"). Les expressions génératrices sont de la forme ::

source: Again, for a list comprehension only the outside brackets are different (square brackets instead of parentheses).
fr: La compréhension de liste équivalente s'écrit de la même à l'exception de l'utilisation des crochets à la place des parenthèses.

source: The elements of the generated output will be the successive values of ``expression``. The ``if`` clauses are all optional; if present, ``expression`` is only evaluated and added to the result when ``condition`` is true.
fr: Les éléments de la sortie sont les valeurs successives de ``expression``. La clause ``if`` est facultative ; si elle est présente, ``expression`` ne sera évaluée et ajoutée au résultat que si ``condition`` est vérifiée.

source: Generator expressions always have to be written inside parentheses, but the parentheses signalling a function call also count. If you want to create an iterator that will be immediately passed to a function you can write::
fr: Les expressions génératrices doivent toujours être écrites entre parenthèses, mais les parenthèses qui encadrent un appel de fonction comptent aussi. Si vous souhaitez créer un itérateur qui soit immédiatement passé à une fonction, vous pouvez écrire ::

source: The ``for...in`` clauses contain the sequences to be iterated over. The sequences do not have to be the same length, because they are iterated over from left to right, **not** in parallel. For each element in ``sequence1``, ``sequence2`` is looped over from the beginning. ``sequence3`` is then looped over for each resulting pair of elements from ``sequence1`` and ``sequence2``.
fr: Les clauses ``for ... in`` indiquent les séquences sur lesquelles itérer. Celles-ci peuvent être de longueurs différentes car l'itération est réalisée de gauche à droite et non en parallèle. ``sequence2`` est parcourue entièrement pour chaque élément de ``sequence1``. ``sequence3`` est ensuite parcourue dans son intégralité pour chaque paire d'éléments de ``sequence1`` et ``sequence2``.

source: To put it another way, a list comprehension or generator expression is equivalent to the following Python code::
fr: Autrement dit, la compréhension de liste ou une expression génératrice est équivalente au code Python ci-dessous ::

source: This means that when there are multiple ``for...in`` clauses but no ``if`` clauses, the length of the resulting output will be equal to the product of the lengths of all the sequences. If you have two lists of length 3, the output list is 9 elements long:
fr: Ainsi lorsque plusieurs clauses ``for ... in`` sont présentes mais sans condition ``if``, la longueur totale de la nouvelle séquence est égale au produit des longueurs des séquences itérées. Si vous travaillez sur deux listes de longueur 3, la sortie contiendra 9 éléments :

source: To avoid introducing an ambiguity into Python's grammar, if ``expression`` is creating a tuple, it must be surrounded with parentheses. The first list comprehension below is a syntax error, while the second one is correct::
fr: Afin d'éviter créer une ambiguïté dans la grammaire de Python, ``expression`` doit être encadrée par des parenthèses si elle produit un n-uplet. La première compréhension de liste ci-dessous n'est pas valide syntaxiquement, tandis que la seconde l'est ::

source: Generators
fr: Générateurs

source: Generators are a special class of functions that simplify the task of writing iterators. Regular functions compute a value and return it, but generators return an iterator that returns a stream of values.
fr: Les générateurs forment une classe spéciale de fonctions qui simplifie la création d'itérateurs. Les fonctions habituelles calculent une valeur et la renvoie, tandis que les générateurs renvoient un itérateur qui produit un flux de valeurs.

source: You're doubtless familiar with how regular function calls work in Python or C. When you call a function, it gets a private namespace where its local variables are created. When the function reaches a ``return`` statement, the local variables are destroyed and the value is returned to the caller. A later call to the same function creates a new private namespace and a fresh set of local variables. But, what if the local variables weren't thrown away on exiting a function? What if you could later resume the function where it left off? This is what generators provide; they can be thought of as resumable functions.
fr: Vous connaissez sans doute le fonctionnement des appels de fonctions en Python ou en C. Lorsqu'une fonction est appelée, un espace de noms privé lui est associé pour ses variables locales. Lorsque le programme atteint une instruction ``return``, les variables locales sont détruites et la valeur est renvoyée à l'appelant. Les appels postérieurs à la même fonction créent un nouvel espace de nom privé et de nouvelles variables locales. Cependant, que se passerait-il si les variables locales n'étaient pas détruites lors de la sortie d'une fonction ? Et s'il était possible de reprendre l'exécution de la fonction là où elle s'était arrêtée ? Les générateurs sont une réponse à ces questions ; vous pouvez considérer qu'il s'agit de fonctions qu'il est possible d'interrompre, puis de relancer sans perdre leur progression.

source: Here's the simplest example of a generator function:
fr: Voici un exemple simple de fonction génératrice :

source: Any function containing a :keyword:`yield` keyword is a generator function; this is detected by Python's :term:`bytecode` compiler which compiles the function specially as a result.
fr: N'importe quelle fonction contenant le mot-clé :keyword:`yield` est un générateur ; le compilateur :term:`bytecode` de Python détecte ce mot-clé prend en compte cette particularité de la fonction.

source: When you call a generator function, it doesn't return a single value; instead it returns a generator object that supports the iterator protocol. On executing the ``yield`` expression, the generator outputs the value of ``i``, similar to a ``return`` statement. The big difference between ``yield`` and a ``return`` statement is that on reaching a ``yield`` the generator's state of execution is suspended and local variables are preserved. On the next call to the generator's :meth:`~generator.__next__` method, the function will resume executing.
fr: Lorsque vous appelez une fonction génératrice, celle-ci ne renvoie pas une unique valeur ; elle renvoie un objet générateur qui implémente le protocole d'itération. Lorsque l'expression ``yield`` est exécutée, le générateur renvoie la valeur de ``i``, d'une façon similaire à un ``return``. La différence principale entre ``yield`` et ``return`` est qu'en atteignant l'instruction ``yield``, l'état du générateur est suspendu et les variables locales sont conservées. Lors de l'appel suivant à la méthode :meth:`~generator.__next__` du générateur, la fonction reprendra son exécution.

source: Here's a sample usage of the ``generate_ints()`` generator:
fr: Voici un exemple d'utilisation du générateur ``generate_ints()`` :

source: You could equally write ``for i in generate_ints(5)``, or ``a, b, c = generate_ints(3)``.
fr: Vous pourriez de façon équivalente écrire ``for i in generate_ints(5)`` ou ``a, b, c = generate_ints(3)``.

source: Inside a generator function, ``return value`` causes ``StopIteration(value)`` to be raised from the :meth:`~generator.__next__` method. Once this happens, or the bottom of the function is reached, the procession of values ends and the generator cannot yield any further values.
fr: Dans une fonction génératrice, l'instruction ``return value`` lève une exception ``StopIteration(value)`` dans la méthode :meth:`~generator.__next__`. Lorsque cela se produit (ou que la fin de la fonction est atteinte), le flot de nouvelles valeurs s'arrête et le générateur ne peut plus rien produire.

source: You could achieve the effect of generators manually by writing your own class and storing all the local variables of the generator as instance variables. For example, returning a list of integers could be done by setting ``self.count`` to 0, and having the :meth:`~iterator.__next__` method increment ``self.count`` and return it. However, for a moderately complicated generator, writing a corresponding class can be much messier.
fr: Vous pouvez obtenir le même comportement que celui des générateurs en écrivant votre propre classe qui stocke les variables locales du générateur comme variables d'instance. Pour renvoyer une liste d'entiers, par exemple, vous pouvez initialiser ``self.count`` à 0 et écrire la méthode :meth:`~iterator.__next__` de telle sorte qu'elle incrémente ``self.count`` puis le renvoie. Cependant, cela devient beaucoup plus complexe pour des générateurs relativement sophistiqués.

source: The test suite included with Python's library, :source:`Lib/test/test_generators.py`, contains a number of more interesting examples. Here's one generator that implements an in-order traversal of a tree using generators recursively. ::
fr: :source:`Lib/test/test_generators.py`, la suite de test de la bibliothèque Python, contient de nombreux exemples intéressants. Voici un générateur qui implémente le parcours d'un arbre dans l'ordre en utilisant des générateurs de façon récursive. ::

source: Two other examples in ``test_generators.py`` produce solutions for the N-Queens problem (placing N queens on an NxN chess board so that no queen threatens another) and the Knight's Tour (finding a route that takes a knight to every square of an NxN chessboard without visiting any square twice).
fr: Deux autres exemples de ``test_generators.py`` permettent de résoudre le problème des N Reines (placer *N* reines sur un échiquier de dimensions *NxN* de telle sorte qu'aucune reine ne soit en position d'en prendre une autre) et le problème du cavalier (trouver un chemin permettant au cavalier de visiter toutes les cases d'un échiquier *NxN* sans jamais visiter la même case deux fois).

source: Passing values into a generator
fr: Transmettre des valeurs au générateur

source: In Python 2.4 and earlier, generators only produced output. Once a generator's code was invoked to create an iterator, there was no way to pass any new information into the function when its execution is resumed. You could hack together this ability by making the generator look at a global variable or by passing in some mutable object that callers then modify, but these approaches are messy.
fr: Avant Python 2.5, les générateurs ne pouvaient que produire des sorties. Une fois le code du générateur exécuté pour créer un itérateur, il était impossible d'introduire de l'information nouvelle dans la fonction mise en pause. Une astuce consistait à reproduire cette fonctionnalité en autorisant le générateur à consulter des variables globales ou en lui passant des objets mutables modifiés hors du générateur, mais ces approches étaient compliquées.

source: In Python 2.5 there's a simple way to pass values into a generator. :keyword:`yield` became an expression, returning a value that can be assigned to a variable or otherwise operated on::
fr: À partir de Python 2.5, il existe une méthode simple pour transmettre des valeurs à un générateur. Le mot-clé :keyword:`yield` est devenu une expression qui renvoie une valeur sur laquelle il est possible d'opérer et que vous pouvez assigner à une variable ::

source: I recommend that you **always** put parentheses around a ``yield`` expression when you're doing something with the returned value, as in the above example. The parentheses aren't always necessary, but it's easier to always add them instead of having to remember when they're needed.
fr: Comme dans l'exemple ci-dessus, je vous recommande de **toujours** encadrer les expressions ``yield`` par des parenthèses lorsque vous utilisez leur valeur de retour. Elles ne sont pas toujours indispensables mais mieux vaut prévenir que guérir : il est plus facile de les ajouter systématiquement que de prendre le risque de les oublier là où elles sont requises.

source: (:pep:`342` explains the exact rules, which are that a ``yield``-expression must always be parenthesized except when it occurs at the top-level expression on the right-hand side of an assignment. This means you can write ``val = yield i`` but have to use parentheses when there's an operation, as in ``val = (yield i) + 12``.)
fr: (les règles exactes de parenthésage sont spécifies dans la :pep:`342` : une expression ``yield`` doit toujours être parenthésée sauf s'il s'agit de l'expression la plus externe du côté droit d'une assignation. Cela signifie que vous pouvez écrire ``val = yield i`` mais que les parenthèses sont requises s'il y a une opération, comme dans ``val = (yield i) + 12``.)

source: Values are sent into a generator by calling its :meth:`send(value) <generator.send>` method. This method resumes the generator's code and the ``yield`` expression returns the specified value. If the regular :meth:`~generator.__next__` method is called, the ``yield`` returns ``None``.
fr: Des valeurs peuvent être transmises à un générateur en appelant sa méthode :meth:`send(value) <generator.send>`. Celle-ci reprend l'exécution du générateur et l'expression ``yield`` renvoie la valeur spécifiée. Si c'est la méthode :meth:`~generator.__next__` habituelle qui est appelée, alors ``yield`` renvoie ``None``.

source: Here's a simple counter that increments by 1 and allows changing the value of the internal counter.
fr: Voici un exemple de compteur qui s'incrémente de 1 mais dont il est possible de modifier le compte interne.

source: And here's an example of changing the counter:
fr: Et voici comment il est possible de modifier le compteur :

source: Because ``yield`` will often be returning ``None``, you should always check for this case. Don't just use its value in expressions unless you're sure that the :meth:`~generator.send` method will be the only method used to resume your generator function.
fr: Puisque ``yield`` renvoie souvent ``None``, vous devez toujours vérifier si c'est le cas. N'utilisez pas la valeur de retour à moins d'être certain que seule la méthode :meth:`~generator.send` sera utilisée pour reprendre l'exécution de la fonction génératrice.

source: In addition to :meth:`~generator.send`, there are two other methods on generators:
fr: En plus de :meth:`~generator.send`, il existe deux autres méthodes s'appliquant aux générateurs :

source: :meth:`throw(type, value=None, traceback=None) <generator.throw>` is used to raise an exception inside the generator; the exception is raised by the ``yield`` expression where the generator's execution is paused.
fr: :meth:`throw(type, value=None, traceback=None) <generator.throw>` permet de lever une exception dans le générateur ; celle-ci est levée par l'expression ``yield`` à l'endroit où l'exécution a été mise en pause.

source: :meth:`~generator.close` raises a :exc:`GeneratorExit` exception inside the generator to terminate the iteration. On receiving this exception, the generator's code must either raise :exc:`GeneratorExit` or :exc:`StopIteration`; catching the exception and doing anything else is illegal and will trigger a :exc:`RuntimeError`. :meth:`~generator.close` will also be called by Python's garbage collector when the generator is garbage-collected.
fr: :meth:`~generator.close` lève une exception :exc:`GeneratorExit` dans le générateur afin de terminer l'itération. Le code du générateur qui reçoit cette exception doit lever à son tour :exc:`GeneratorExit` ou :exc:`StopIteration`. Il est illégal d'attraper cette exception et de faire quoi que ce soit d'autre, ceci déclenche une erreur :exc:`RuntimeError`. Lorsque le ramasse-miette de Python collectera le générateur, il appellera sa méthode :meth:`~generator.close`.

source: If you need to run cleanup code when a :exc:`GeneratorExit` occurs, I suggest using a ``try: ... finally:`` suite instead of catching :exc:`GeneratorExit`.
fr: Si vous devez exécuter du code pour faire le ménage lors d'une :exc:`GeneratorExit`, je vous suggère d'utiliser une structure ``try: ... finally`` plutôt que d'attraper :exc:`GeneratorExit`.

source: The cumulative effect of these changes is to turn generators from one-way producers of information into both producers and consumers.
fr: Ces changements cumulés transforment les générateurs de producteurs unidirectionnels d'information vers un statut hybride à la fois producteur et consommateur.

source: Generators also become **coroutines**, a more generalized form of subroutines. Subroutines are entered at one point and exited at another point (the top of the function, and a ``return`` statement), but coroutines can be entered, exited, and resumed at many different points (the ``yield`` statements).
fr: Les générateurs sont également devenus des **coroutines**, une forme généralisée de sous-routine. L'exécution des sous-routines démarre à un endroit et se termine à un autre (au début de la fonction et au niveau de l'instruction ``return``), tandis qu'il est possible d'entrer, de sortir ou de reprendre une coroutine à différents endroits (les instructions ``yield``).

source: Built-in functions
fr: Fonctions natives
