Repository: python/python-docs-fr
Catalog: howto/functional.po
Languages: fr

source: Math operations: ``add()``, ``sub()``, ``mul()``, ``floordiv()``, ``abs()``, ...
fr: Les opérations mathématiques : ``add()``, ``sub()``, ``mul()``, ``floordiv()``, ``abs()``, ...

source: Logical operations: ``not_()``, ``truth()``.
fr: Les opérations logiques : ``not_()``, ``truth()``.

source: Bitwise operations: ``and_()``, ``or_()``, ``invert()``.
fr: Les opérations bit à bit : ``and_()``, ``or_()``, ``invert()``.

source: Comparisons: ``eq()``, ``ne()``, ``lt()``, ``le()``, ``gt()``, and ``ge()``.
fr: Les comparaisons : ``eq()``, ``ne()``, ``lt()``, ``le()``, ``gt()``, et ``ge()``.

source: Object identity: ``is_()``, ``is_not()``.
fr: L'identification des objets : ``is_()``, ``is_not()``.

source: Consult the operator module's documentation for a complete list.
fr: Veuillez vous référer à la documentation du module *operator* pour une liste complète.

source: Small functions and the lambda expression
fr: Expressions lambda et fonctions courtes

source: When writing functional-style programs, you'll often need little functions that act as predicates or that combine elements in some way.
fr: Dans un style de programmation fonctionnel, il est courant d'avoir besoin de petites fonctions utilisées comme prédicats ou pour combiner des éléments d'une façon ou d'une autre.

source: If there's a Python built-in or a module function that's suitable, you don't need to define a new function at all::
fr: S'il existe une fonction native Python ou une fonction d'un module qui convient, vous n'avez pas besoin de définir de nouvelle fonction ::

source: If the function you need doesn't exist, you need to write it. One way to write small functions is to use the :keyword:`lambda` expression. ``lambda`` takes a number of parameters and an expression combining these parameters, and creates an anonymous function that returns the value of the expression::
fr: Si la fonction dont vous avez besoin n'existe pas, vous devez l'écrire. Une façon d'écrire des fonctions courtes consiste à utiliser les expressions :keyword:`lambda`. ``lambda`` prend plusieurs paramètres et une expression combinant ces derniers afin de créer une fonction anonyme qui renvoie la valeur de cette expression ::

source: An alternative is to just use the ``def`` statement and define a function in the usual way::
fr: Une autre façon de faire est de simplement utiliser l'instruction ``def`` afin de définir une fonction de la manière habituelle ::

source: Which alternative is preferable? That's a style question; my usual course is to avoid using ``lambda``.
fr: La méthode à préférer est une question de style, en général je préfère éviter l'utilisation de ``lambda``.

source: One reason for my preference is that ``lambda`` is quite limited in the functions it can define. The result has to be computable as a single expression, which means you can't have multiway ``if... elif... else`` comparisons or ``try... except`` statements. If you try to do too much in a ``lambda`` statement, you'll end up with an overly complicated expression that's hard to read. Quick, what's the following code doing? ::
fr: Une des raisons pour cela est que ``lambda`` ne peut pas définir toutes les fonctions. Le résultat doit pouvoir se calculer en une seule expression, ce qui signifie qu'il est impossible d'avoir des comparaisons ``if ... elif ... else`` à plusieurs branches ou des structures ``try ... except``. Si vous essayez de trop en faire dans une expression ``lambda``, vous finirez avec une expression illisible. Par exemple, pouvez-vous dire du premier coup d’œil ce que fait le code ci-dessous ? ::

source: You can figure it out, but it takes time to disentangle the expression to figure out what's going on. Using a short nested ``def`` statements makes things a little bit better::
fr: Vous pouvez sûrement comprendre ce que fait ce code mais cela prend du temps de démêler l'expression pour y voir plus clair. Une clause ``def`` concise améliore la situation ::

source: But it would be best of all if I had simply used a ``for`` loop::
fr: Toutefois l'idéal serait de simplement se contenter d'une boucle ``for`` ::

source: Or the :func:`sum` built-in and a generator expression::
fr: Ou de la fonction native :func:`sum` et d'une expression génératrice ::

source: Many uses of :func:`functools.reduce` are clearer when written as ``for`` loops.
fr: Les boucles ``for`` sont souvent plus lisibles que la fonction :func:`functools.reduce`.

source: Fredrik Lundh once suggested the following set of rules for refactoring uses of ``lambda``:
fr: Frederik Lundh a suggéré quelques règles pour le réusinage de code impliquant les expressions ``lambda`` :

source: Write a lambda function.
fr: Écrire une fonction lambda.

source: Write a comment explaining what the heck that lambda does.
fr: Écrire un commentaire qui explique ce que fait cette satanée fonction lambda.

source: Study the comment for a while, and think of a name that captures the essence of the comment.
fr: Scruter le commentaire pendant quelques temps et réfléchir à un nom qui synthétise son essence.

source: Convert the lambda to a def statement, using that name.
fr: Réécrire la fonction lambda en une définition *def* en utilisant ce nom.

source: Remove the comment.
fr: Effacer le commentaire.

source: I really like these rules, but you're free to disagree about whether this lambda-free style is better.
fr: J'aime beaucoup ces règles mais vous êtes libre de ne pas être d'accord et de ne pas préférer ce style sans lambda.

source: Revision History and Acknowledgements
fr: Historique des modifications et remerciements

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Ian Bicking, Nick Coghlan, Nick Efford, Raymond Hettinger, Jim Jewett, Mike Krell, Leandro Lameiro, Jussi Salmela, Collin Winter, Blake Winton.
fr: L'auteur souhaiterait remercier les personnes suivantes pour leurs suggestions, leurs corrections et leur aide sur les premières versions de cet article : Ian Bicking, Nick Coghlan, Nick Efford, Raymond Hettinger, Jim Jewett, Mike Krell, Leandro Lameiro, Jussi Salmela, Collin Winter, Blake Winton.

source: Version 0.1: posted June 30 2006.
fr: Version 0.1 : publiée le 30 juin 2006.

source: Version 0.11: posted July 1 2006. Typo fixes.
fr: Version 0.11 : publiée le 1er juillet 2006. Correction orthographique.

source: Version 0.2: posted July 10 2006. Merged genexp and listcomp sections into one. Typo fixes.
fr: Version 0.2 : publiée le 10 juillet 2006. Fusion des sections *genexp* et *listcomp*. Correction orthographique.

source: Version 0.21: Added more references suggested on the tutor mailing list.
fr: Version 0.21 : ajout de plusieurs références suggérées sur la liste de diffusion *tutor*.

source: Version 0.30: Adds a section on the ``functional`` module written by Collin Winter; adds short section on the operator module; a few other edits.
fr: Version 0.30 : ajout d'une section sur le module ``functional`` écrite par Collin Winter ; ajout d'une courte section sur le module ``operator`` ; quelques autres modifications.

source: References
fr: Références

source: General
fr: Général

source: **Structure and Interpretation of Computer Programs**, by Harold Abelson and Gerald Jay Sussman with Julie Sussman. Full text at https://mitpress.mit.edu/sicp/. In this classic textbook of computer science, chapters 2 and 3 discuss the use of sequences and streams to organize the data flow inside a program. The book uses Scheme for its examples, but many of the design approaches described in these chapters are applicable to functional-style Python code.
fr: **Structure and Interpretation of Computer Programs** par Harold Abelson et Gerald Jay Sussman avec Julie Sussman. Disponible à l'adresse https://mitpress.mit.edu/sicp/. Ce livre est un classique en informatique. Les chapitres 2 et 3 présentent l'utilisation des séquences et des flux pour organiser le flot de données dans un programme. Les exemples du livre utilisent le langage Scheme mais la plupart des approches décrites dans ces chapitres s'appliquent au style fonctionnel de Python.

source: http://www.defmacro.org/ramblings/fp.html: A general introduction to functional programming that uses Java examples and has a lengthy historical introduction.
fr: http://www.defmacro.org/ramblings/fp.html : une présentation générale à la programmation fonctionnelle avec une longue introduction historique et des exemples en Java.

source: https://en.wikipedia.org/wiki/Functional_programming: General Wikipedia entry describing functional programming.
fr: https://fr.wikipedia.org/wiki/Programmation_fonctionnelle : l'entrée Wikipédia qui décrit la programmation fonctionnelle.

source: https://en.wikipedia.org/wiki/Coroutine: Entry for coroutines.
fr: https://fr.wikipedia.org/wiki/Coroutine : l'entrée pour les coroutines.

source: https://en.wikipedia.org/wiki/Currying: Entry for the concept of currying.
fr: https://fr.wikipedia.org/wiki/Curryfication : l'entrée pour de la concept de la curryfication (création d'applications partielles).

source: Python-specific
fr: Spécifique à Python

source: http://gnosis.cx/TPiP/: The first chapter of David Mertz's book :title-reference:`Text Processing in Python` discusses functional programming for text processing, in the section titled "Utilizing Higher-Order Functions in Text Processing".
fr: http://gnosis.cx/TPiP/ : le premier chapitre du livre de David Mertz :title-reference:`Text Processing in Python` présente l'utilisation de la programmation fonctionnelle pour le traitement de texte dans la section « Utilisation des fonctions d'ordre supérieur pour le traitement de texte ».

source: Mertz also wrote a 3-part series of articles on functional programming for IBM's DeveloperWorks site; see `part 1 <https://www.ibm.com/developerworks/linux/library/l-prog/index.html>`__, `part 2 <https://www.ibm.com/developerworks/linux/library/l-prog2/index.html>`__, and `part 3 <https://www.ibm.com/developerworks/linux/library/l-prog3/index.html>`__,
fr: Mertz a également écrit une série de 3 articles (en anglais) sur la programmation fonctionnelle pour le site de IBM *DeveloperWorks*, voir la `partie 1 <https://www.ibm.com/developerworks/linux/library/l-prog/index.html>`__, la `partie 2 <https://www.ibm.com/developerworks/linux/library/l-prog2/index.html>`__ et la `partie 3 <https://www.ibm.com/developerworks/linux/library/l-prog3/index.html>`__.

source: Python documentation
fr: Documentation Python

source: Documentation for the :mod:`itertools` module.
fr: Documentation du module :mod:`itertools`.

source: Documentation for the :mod:`functools` module.
fr: Documentation du module :mod:`functools`.

source: Documentation for the :mod:`operator` module.
fr: Documentation du module :mod:`operator`.

source: :pep:`342`: "Coroutines via Enhanced Generators" describes the new generator features in Python 2.5.
fr: :pep:`342`: *"Coroutines via Enhanced Generators"* décrit les nouvelles fonctionnalités des générateurs en Python 2.5.
