Repository: python/python-docs-fr
Catalog: howto/functional.po
Languages: fr

source: Let's look in more detail at built-in functions often used with iterators.
fr: Voyons un peu plus en détail les fonctions natives souvent utilisées de concert avec les itérateurs.

source: Two of Python's built-in functions, :func:`map` and :func:`filter` duplicate the features of generator expressions:
fr: :func:`map` et :func:`filter` sont deux fonctions natives de Python qui clonent les propriétés des expressions génératrices :

source: :func:`map(f, iterA, iterB, ...) <map>` returns an iterator over the sequence
fr: :func:`map(f, iterA, iterB, ...) <map>` renvoie un itérateur sur une séquence

source: You can of course achieve the same effect with a list comprehension.
fr: Vous pouvez obtenir le même comportement à l'aide d'une compréhension de liste.

source: :func:`filter(predicate, iter) <filter>` returns an iterator over all the sequence elements that meet a certain condition, and is similarly duplicated by list comprehensions. A **predicate** is a function that returns the truth value of some condition; for use with :func:`filter`, the predicate must take a single value.
fr: :func:`filter(predicate, iter) <filter>` renvoie un itérateur sur l'ensemble des éléments de la séquence qui vérifient une certaine condition. Son comportement peut également être reproduit par une compréhension de liste. Un **prédicat** est une fonction qui renvoie vrai ou faux en fonction d'une certaine condition. Dans le cas de :func:`filter`, le prédicat ne doit prendre qu'un seul argument.

source: This can also be written as a list comprehension:
fr: Cela peut se réécrire sous la forme d'une compréhension de liste :

source: :func:`enumerate(iter, start=0) <enumerate>` counts off the elements in the iterable returning 2-tuples containing the count (from *start*) and each element. ::
fr: :func:`enumerate(iter, start=0) <enumerate>` énumère les éléments de l'itérable en renvoyant des paires contenant le nombre d'éléments déjà listés (depuis le *début*) et l'élément en cours. ::

source: :func:`enumerate` is often used when looping through a list and recording the indexes at which certain conditions are met::
fr: :func:`enumerate` est souvent utilisé lorsque l'on souhaite boucler sur une liste tout en listant les indices auxquels une certaine condition est vérifiée ::

source: :func:`sorted(iterable, key=None, reverse=False) <sorted>` collects all the elements of the iterable into a list, sorts the list, and returns the sorted result. The *key* and *reverse* arguments are passed through to the constructed list's :meth:`~list.sort` method. ::
fr: :func:`sorted(iterable, key=None, reverse=False) <sorted>` rassemble tous les éléments de l'itérable dans une liste, les classe et renvoie le résultat classé. Les arguments *key* et *reverse* sont passés à la méthode :meth:`~list.sort` de la liste ainsi construite. ::

source: (For a more detailed discussion of sorting, see the :ref:`sortinghowto`.)
fr: (pour plus de détails sur les algorithmes de tri, se référer à :ref:`sortinghowto`.)

source: The :func:`any(iter) <any>` and :func:`all(iter) <all>` built-ins look at the truth values of an iterable's contents. :func:`any` returns ``True`` if any element in the iterable is a true value, and :func:`all` returns ``True`` if all of the elements are true values:
fr: Les fonctions natives :func:`any(iter) <any>` et :func:`all(iter) <all>` permettent d'observer les valeurs de vérité des éléments d'un itérable. :func:`any` renvoie ``True`` si au moins un élément de l'itérable s'évalue comme vrai et :func:`all` renvoie ``True`` si tous les éléments s'évaluent comme vrai :

source: :func:`zip(iterA, iterB, ...) <zip>` takes one element from each iterable and returns them in a tuple::
fr: :func:`zip(iterA, iterB, ...) <zip>` rassemble un élément de chaque itérable dans un n-uplet ::

source: It doesn't construct an in-memory list and exhaust all the input iterators before returning; instead tuples are constructed and returned only if they're requested. (The technical term for this behaviour is `lazy evaluation <https://en.wikipedia.org/wiki/Lazy_evaluation>`__.)
fr: Cela ne construit pas de liste stockée en mémoire, ni ne vide les itérateurs d'entrée avant de renvoyer sa valeur ; en réalité les tuples sont construits et renvoyés au fur et à mesure (il s'agit techniquement parlant d'un comportement d'`évaluation paresseuse <https://fr.wikipedia.org/wiki/%C3%89valuation_paresseuse>`__).

source: This iterator is intended to be used with iterables that are all of the same length. If the iterables are of different lengths, the resulting stream will be the same length as the shortest iterable. ::
fr: Cet itérateur suppose qu'il opère sur des itérables de même longueur. Si la longueur des itérables diffère, le flux résultant aura la même longueur que le plus court des itérables. ::

source: You should avoid doing this, though, because an element may be taken from the longer iterators and discarded. This means you can't go on to use the iterators further because you risk skipping a discarded element.
fr: Toutefois, vous devez éviter de dépendre de ce comportement. En effet un élément d'un des itérables les plus longs peut être retiré puis jeté (car l'autre itérable est trop court). Cela signifie que vous ne pouvez alors plus utiliser cet itérable car vous allez sauter l'élément qui vient d'être jeté.

source: The itertools module
fr: Le module *itertools*

source: The :mod:`itertools` module contains a number of commonly-used iterators as well as functions for combining several iterators. This section will introduce the module's contents by showing small examples.
fr: Le module :mod:`itertools` contient de nombreux itérateurs très utilisés, ainsi que des fonctions pour combiner différents itérateurs. Cette section présente le contenu du module au travers de quelques exemples.

source: The module's functions fall into a few broad classes:
fr: Les fonctions du module se divisent en quelques grandes catégories :

source: Functions that create a new iterator based on an existing iterator.
fr: Les fonctions qui transforment un itérateur existant en un nouvel itérateur.

source: Functions for treating an iterator's elements as function arguments.
fr: Les fonctions qui traitent les éléments d'un itérateur comme les arguments d'une fonction.

source: Functions for selecting portions of an iterator's output.
fr: Les fonctions qui permettent de sélectionner des portions de la sortie d'un itérateur.

source: A function for grouping an iterator's output.
fr: Une fonction qui permet de grouper la sortie d'un itérateur.

source: Creating new iterators
fr: Créer de nouveaux itérateurs

source: :func:`itertools.count(start, step) <itertools.count>` returns an infinite stream of evenly spaced values. You can optionally supply the starting number, which defaults to 0, and the interval between numbers, which defaults to 1::
fr: :func:`itertools.count(start, step) <itertools.count>` renvoie un flux infini de valeurs régulièrement espacées. Vous pouvez spécifier la valeur de départ (par défaut, 0) et l'intervalle entre les nombres (par défaut, 1) ::

source: :func:`itertools.cycle(iter) <itertools.cycle>` saves a copy of the contents of a provided iterable and returns a new iterator that returns its elements from first to last. The new iterator will repeat these elements infinitely. ::
fr: :func:`itertools.cycle(iter) <itertools.cycle>` sauvegarde une copie du contenu de l'itérable passé en argument et renvoie un nouvel itérateur qui produit tous les éléments du premier au dernier et se répète indéfiniment. ::

source: :func:`itertools.repeat(elem, [n]) <itertools.repeat>` returns the provided element *n* times, or returns the element endlessly if *n* is not provided. ::
fr: :func:`itertools.repeat(elem, [n]) <itertools.repeat>` renvoie l'élément passé en argument *n* fois ou répète l'élément à l'infini si *n* n'est pas spécifié. ::

source: :func:`itertools.chain(iterA, iterB, ...) <itertools.chain>` takes an arbitrary number of iterables as input, and returns all the elements of the first iterator, then all the elements of the second, and so on, until all of the iterables have been exhausted. ::
fr: :func:`itertools.chain(iterA, iterB, ...) <itertools.chain>` reçoit un nombre arbitraire d'itérables en entrée et les concatène, renvoyant tous les éléments du premier itérateur, puis tous ceux du second et ainsi de suite jusqu'à ce que tous les itérables aient été épuisés. ::

source: :func:`itertools.islice(iter, [start], stop, [step]) <itertools.islice>` returns a stream that's a slice of the iterator. With a single *stop* argument, it will return the first *stop* elements. If you supply a starting index, you'll get *stop-start* elements, and if you supply a value for *step*, elements will be skipped accordingly. Unlike Python's string and list slicing, you can't use negative values for *start*, *stop*, or *step*. ::
fr: :func:`itertools.islice(iter, [start], stop, [step]) <itertools.islice>` renvoie une portion de l'itérateur. En passant seulement l'argument *stop*, il renvoie les *stop* premiers éléments. En spécifiant un indice de début, vous récupérez *stop - start* éléments et, en spécifiant une valeur pour *step*, tous les éléments multiples du pas seront sautés. Cependant vous ne pouvez pas utiliser de valeurs négatives pour *start*, *stop* ou *step* (contrairement aux listes et chaînes de caractères de Python). ::

source: :func:`itertools.tee(iter, [n]) <itertools.tee>` replicates an iterator; it returns *n* independent iterators that will all return the contents of the source iterator. If you don't supply a value for *n*, the default is 2. Replicating iterators requires saving some of the contents of the source iterator, so this can consume significant memory if the iterator is large and one of the new iterators is consumed more than the others. ::
fr: :func:`itertools.tee(iter, [n]) <itertools.tee>` duplique un itérateur et renvoie *n* itérateurs indépendants, chacun copiant le contenu de l'itérateur source. La valeur par défaut pour *n* est 2. La réplication des itérateurs nécessite la sauvegarde d'une partie du contenu de l'itérateur source, ce qui peut consommer beaucoup de mémoire si l'itérateur est grand et que l'un des nouveaux itérateurs est plus consommé que les autres. ::

source: Calling functions on elements
fr: Appliquer des fonctions au contenu des itérateurs

source: The :mod:`operator` module contains a set of functions corresponding to Python's operators. Some examples are :func:`operator.add(a, b) <operator.add>` (adds two values), :func:`operator.ne(a, b) <operator.ne>` (same as ``a != b``), and :func:`operator.attrgetter('id') <operator.attrgetter>` (returns a callable that fetches the ``.id`` attribute).
fr: Le module :mod:`operator` rassemble des fonctions équivalentes aux opérateurs Python. Par exemple, :func:`operator.add(a,b) <operator.add>` additionne deux valeurs, :func:`operator.ne(a, b) <operator.ne>` est équivalent à ``a != b`` et :func:`operator.attrgetter('id') <operator.attrgetter>` renvoie un objet appelable qui récupère l'attribut ``.id``.

source: :func:`itertools.starmap(func, iter) <itertools.starmap>` assumes that the iterable will return a stream of tuples, and calls *func* using these tuples as the arguments::
fr: :func:`itertools.starmap(func, iter) <itertools.starmap>` suppose que l'itérable renvoie une séquence de tuples et appelle *func* en utilisant chaque n-uplet comme arguments ::

source: Selecting elements
fr: Sélectionner des éléments

source: Another group of functions chooses a subset of an iterator's elements based on a predicate.
fr: Une autre catégorie de fonctions sont les fonctions permettant de sélectionner un sous-ensemble des éléments de l'itérateur selon un prédicat donné.

source: :func:`itertools.filterfalse(predicate, iter) <itertools.filterfalse>` is the opposite of :func:`filter`, returning all elements for which the predicate returns false::
fr: :func:`itertools.filterfalse(predicate, iter) <itertools.filterfalse>` est l'opposé de :func:`filter` et renvoie tous les éléments pour lesquels le prédicat est faux ::

source: :func:`itertools.takewhile(predicate, iter) <itertools.takewhile>` returns elements for as long as the predicate returns true. Once the predicate returns false, the iterator will signal the end of its results. ::
fr: :func:`itertools.takewhile(predicate, iter) <itertools.takewhile>` renvoie les éléments de l'itérateur tant que ceux-ci vérifient le prédicat. Dès lors que le prédicat renvoie faux, l'itération s'arrête. ::

source: :func:`itertools.dropwhile(predicate, iter) <itertools.dropwhile>` discards elements while the predicate returns true, and then returns the rest of the iterable's results. ::
fr: :func:`itertools.dropwhile(predicate, iter) <itertools.dropwhile>` supprime des éléments tant que le prédicat renvoie vrai puis renvoie le reste des éléments de l'itérable. ::

source: :func:`itertools.compress(data, selectors) <itertools.compress>` takes two iterators and returns only those elements of *data* for which the corresponding element of *selectors* is true, stopping whenever either one is exhausted::
fr: :func:`itertools.compress(data, selectors) <itertools.compress>` prend un itérateur *data* et un itérateur *selectors* et renvoie les éléments de *data* pour lesquels l'élément correspondant de *selectors* évalue à vrai. L'itération s'arrête lorsque l'un des deux itérateurs est épuisé ::

source: Combinatoric functions
fr: Fonctions combinatoires

source: The :func:`itertools.combinations(iterable, r) <itertools.combinations>` returns an iterator giving all possible *r*-tuple combinations of the elements contained in *iterable*. ::
fr: :func:`itertools.combinations(iterable, r) <itertools.combinations>` renvoie un itérateur qui produit toutes les combinaisons possibles de *r*-uplets des éléments de *iterable*. ::

source: The elements within each tuple remain in the same order as *iterable* returned them. For example, the number 1 is always before 2, 3, 4, or 5 in the examples above. A similar function, :func:`itertools.permutations(iterable, r=None) <itertools.permutations>`, removes this constraint on the order, returning all possible arrangements of length *r*::
fr: Les éléments de chaque tuple sont ordonnés dans le même ordre que leur apparition dans *iterable*. Ainsi, dans les exemples ci-dessus, le nombre 1 se trouve toujours avant 2, 3, 4 ou 5. La fonction :func:`itertools.permutations(iterable, r=None) <itertools.permutations>` supprime la contrainte sur l'ordre et renvoie tous les arrangements possibles de longueur *r* ::

source: If you don't supply a value for *r* the length of the iterable is used, meaning that all the elements are permuted.
fr: Si vous ne spécifiez pas de valeur pour *r*, la longueur de l'itérable est utilisée par défaut, c'est-à-dire que toutes les permutations de la séquence sont renvoyées.

source: Note that these functions produce all of the possible combinations by position and don't require that the contents of *iterable* are unique::
fr: Notez que ces fonctions génèrent toutes les combinaisons possibles en se basant sur la position des éléments et ne requièrent pas que les éléments de *iterable* soient uniques ::

source: The identical tuple ``('a', 'a', 'b')`` occurs twice, but the two 'a' strings came from different positions.
fr: Le triplet ``('a', 'a', 'b')`` apparaît deux fois mais les deux chaînes de caractères ``'a'`` proviennent de deux positions différentes.

source: The :func:`itertools.combinations_with_replacement(iterable, r) <itertools.combinations_with_replacement>` function relaxes a different constraint: elements can be repeated within a single tuple. Conceptually an element is selected for the first position of each tuple and then is replaced before the second element is selected. ::
fr: La fonction :func:`itertools.combinations_with_replacement(iterable, r) <itertools.combinations_with_replacement>` assouplit une autre contrainte : les éléments peuvent être répétés au sein du même n-uplet. Il s'agit d'un tirage avec remise : le premier élément sélectionné pour chaque n-uplet est replacé dans la séquence avant le tirage du deuxième. ::

source: Grouping elements
fr: Grouper les éléments

source: The last function I'll discuss, :func:`itertools.groupby(iter, key_func=None) <itertools.groupby>`, is the most complicated. ``key_func(elem)`` is a function that can compute a key value for each element returned by the iterable. If you don't supply a key function, the key is simply each element itself.
fr: La dernière fonction que allons voir, :func:`itertools.groupby(iter, key_func=None) <itertools.groupby>` est la plus complexe. ``key_func(elem)`` est une fonction qui produit une clé pour chaque élément renvoyé par l'itérable. Si vous ne spécifiez pas de fonction *key*, alors celle-ci sera l'identité par défaut (c'est-à-dire que la clé d'un élément sera lui-même).

source: :func:`~itertools.groupby` collects all the consecutive elements from the underlying iterable that have the same key value, and returns a stream of 2-tuples containing a key value and an iterator for the elements with that key.
fr: :func:`~itertools.groupby` rassemble tous éléments consécutifs de l'itérable sous-jacent qui ont la même clé et renvoie un flux de pairs contenant la clé et un itérateur produisant la liste des éléments pour cette clé.

source: :func:`~itertools.groupby` assumes that the underlying iterable's contents will already be sorted based on the key. Note that the returned iterators also use the underlying iterable, so you have to consume the results of iterator-1 before requesting iterator-2 and its corresponding key.
fr: :func:`~itertools.groupby` fait l'hypothèse que le contenu de l'itérable sous-jacent est d'ores et déjà ordonné en fonction de la clé. Notez que les itérateurs générés utilisent également l'itérable sous-jacent. Vous devrez donc consommer l'intégralité des résultats du premier itérateur renvoyé avant de récupérer le deuxième itérateur et la clé correspondante.

source: The functools module
fr: Le module *functools*

source: The :mod:`functools` module in Python 2.5 contains some higher-order functions. A **higher-order function** takes one or more functions as input and returns a new function. The most useful tool in this module is the :func:`functools.partial` function.
fr: Le module :mod:`functools` introduit par Python 2.5 contient diverses fonctions d'ordre supérieur. Une **fonction d'ordre supérieur** prend une ou plusieurs fonctions en entrée et renvoie une fonction. L'outil le plus important de ce module est la fonction :func:`functools.partial`.

source: For programs written in a functional style, you'll sometimes want to construct variants of existing functions that have some of the parameters filled in. Consider a Python function ``f(a, b, c)``; you may wish to create a new function ``g(b, c)`` that's equivalent to ``f(1, b, c)``; you're filling in a value for one of ``f()``'s parameters. This is called "partial function application".
fr: En programmant dans un style fonctionnel, il est courant de vouloir construire des variantes de fonctions existantes dont certaines des paramètres sont préremplis. Par exemple, considérons une fonction Python ``f(a, b, c)``. Il peut arriver de vouloir une nouvelle fonction ``g(b, c)`` équivalente à ``f(1, b, c)``, c'est-à-dire fixer le premier paramètre de ``f()``. La fonction ``g()`` est une appelée « application partielle » de ``f()``.

source: The constructor for :func:`~functools.partial` takes the arguments ``(function, arg1, arg2, ..., kwarg1=value1, kwarg2=value2)``. The resulting object is callable, so you can just call it to invoke ``function`` with the filled-in arguments.
fr: Le constructeur de :func:`~functools.partial` prend en argument ``(fonction, arg1, arg2, ..., kwarg1=value1, kwarg2=value2, ...)``. Un appel à l'objet ainsi créé invoque la fonction ``fonction`` avec les arguments spécifiés.

source: Here's a small but realistic example::
fr: Voici un exemple court mais réaliste ::

source: :func:`functools.reduce(func, iter, [initial_value]) <functools.reduce>` cumulatively performs an operation on all the iterable's elements and, therefore, can't be applied to infinite iterables. *func* must be a function that takes two elements and returns a single value. :func:`functools.reduce` takes the first two elements A and B returned by the iterator and calculates ``func(A, B)``. It then requests the third element, C, calculates ``func(func(A, B), C)``, combines this result with the fourth element returned, and continues until the iterable is exhausted. If the iterable returns no values at all, a :exc:`TypeError` exception is raised. If the initial value is supplied, it's used as a starting point and ``func(initial_value, A)`` is the first calculation. ::
fr: :func:`functools.reduce(func, iter, [initial_value]) <functools.reduce>` applique une opération cumulative à tous les éléments d'un itérable et ne peut donc être appliquée à des itérables infinis. *func* doit être une fonction qui prend deux éléments et renvoie une seule valeur. :func:`functools.reduce` prend les deux premiers éléments A et B renvoyés par l'itérateur et calcule ``func(A, B)``. Elle extrait ensuite le troisième élément C et calcule ``func(func(A, B), C)`` puis combine ce résultat avec le quatrième élément renvoyé etc. jusqu'à épuisement de l'itérable. Une exception :exc:`TypeError` est levée si l'itérable ne renvoie aucune valeur. La valeur initiale *initial_value*, si spécifiée, est utilisée comme point de départ et le premier calcul est alors ``func(inital_value, A)``. ::

source: If you use :func:`operator.add` with :func:`functools.reduce`, you'll add up all the elements of the iterable. This case is so common that there's a special built-in called :func:`sum` to compute it:
fr: Si vous combinez :func:`operator.add` avec :func:`functools.reduce`, vous allez additionner tous les éléments de l'itérable. Ce cas est suffisamment courant pour qu'il existe une fonction native :func:`sum` qui lui est équivalent :

source: For many uses of :func:`functools.reduce`, though, it can be clearer to just write the obvious :keyword:`for` loop::
fr: Cependant, il peut être plus lisible dans de nombreuses situations impliquant :func:`functools.reduce` de simplement écrire la boucle :keyword:`for` ::

source: A related function is :func:`itertools.accumulate(iterable, func=operator.add) <itertools.accumulate>`. It performs the same calculation, but instead of returning only the final result, :func:`accumulate` returns an iterator that also yields each partial result::
fr: :func:`itertools.accumulate(iterable, func=operator.add) <itertools.accumulate>` est une fonction similaire qui réalise le même calcul mais, plutôt que de renvoyer seulement le résultat final, :func:`accumulate` renvoie un itérateur qui génère la séquence de tous les résultats intermédiaires ::

source: The operator module
fr: Le module *operator*

source: The :mod:`operator` module was mentioned earlier. It contains a set of functions corresponding to Python's operators. These functions are often useful in functional-style code because they save you from writing trivial functions that perform a single operation.
fr: Le module :mod:`operator` mentionné précédemment contient un ensemble de fonctions reproduisant les opérateurs de Python. Ces fonctions sont souvent utiles en programmation fonctionnelle car elles permettent de ne pas avoir à écrire des fonctions triviales qui ne réalisent qu'une seule opération.

source: Some of the functions in this module are:
fr: Voici quelques fonctions de ce module :
