Repository: python/python-docs-fr
Catalog: howto/instrumentation.po
Languages: fr

source: Instrumenting CPython with DTrace and SystemTap
fr: Instrumenter CPython avec DTrace et SystemTap

source: author
fr: auteur

source: DTrace and SystemTap are monitoring tools, each providing a way to inspect what the processes on a computer system are doing. They both use domain-specific languages allowing a user to write scripts which:
fr: *DTrace* et *SystemTap* sont des outils de surveillance, chacun fournissant un moyen de d'inspecter ce que font les processus d'un système informatique. Ils utilisent tous les deux des langages dédiés permettant à un utilisateur d'écrire des scripts qui permettent de :

source: filter which processes are to be observed
fr: Filtrer les processus à observer.

source: gather data from the processes of interest
fr: Recueillir des données sur le processus choisi.

source: generate reports on the data
fr: Générer des rapports sur les données.

source: As of Python 3.6, CPython can be built with embedded "markers", also known as "probes", that can be observed by a DTrace or SystemTap script, making it easier to monitor what the CPython processes on a system are doing.
fr: À partir de Python 3.6, CPython peut être compilé avec des « marqueurs » intégrés, aussi appelés « sondes », qui peuvent être observés par un script *DTrace* ou *SystemTap*, ce qui facilite le suivi des processus CPython.

source: DTrace markers are implementation details of the CPython interpreter. No guarantees are made about probe compatibility between versions of CPython. DTrace scripts can stop working or work incorrectly without warning when changing CPython versions.
fr: Les marqueurs DTrace sont des détails d'implémentation de l'interpréteur CPython. Aucune garantie n'est donnée quant à la compatibilité des sondes entre les versions de CPython. Les scripts DTrace peuvent s'arrêter de fonctionner ou fonctionner incorrectement sans avertissement lors du changement de version de CPython.

source: Enabling the static markers
fr: Activer les marqueurs statiques

source: macOS comes with built-in support for DTrace. On Linux, in order to build CPython with the embedded markers for SystemTap, the SystemTap development tools must be installed.
fr: macOS est livré avec un support intégré pour *DTrace*. Sous Linux, pour construire CPython avec les marqueurs embarqués pour *SystemTap*, les outils de développement *SystemTap* doivent être installés.

source: On a Linux machine, this can be done via::
fr: Sur une machine Linux, cela se fait via ::

source: or::
fr: ou ::

source: CPython must then be :option:`configured with the --with-dtrace option <--with-dtrace>`:
fr: CPython doit être configuré avec l'option :option:`--with-dtrace` :

source: On macOS, you can list available DTrace probes by running a Python process in the background and listing all probes made available by the Python provider::
fr: Sous macOS, vous pouvez lister les sondes *DTrace* disponibles en exécutant un processus Python en arrière-plan et en listant toutes les sondes mises à disposition par le fournisseur Python ::

source: On Linux, you can verify if the SystemTap static markers are present in the built binary by seeing if it contains a ".note.stapsdt" section.
fr: Sous Linux, pour vérifier que les marqueurs statiques *SystemTap* sont présents dans le binaire compilé, il suffit de regarder s'il contient une section ``.note.stapsdt``.

source: If you've built Python as a shared library (with the :option:`--enable-shared` configure option), you need to look instead within the shared library. For example::
fr: Si vous avez compilé Python en tant que bibliothèque partagée (avec l'option :option:`--enable-shared` du script ``configure``), vous devez plutôt regarder dans la bibliothèque partagée. Par exemple ::

source: Sufficiently modern readelf can print the metadata::
fr: Une version suffisamment moderne de *readelf* peut afficher les métadonnées ::

source: Static DTrace probes
fr: Sondes DTrace statiques

source: The following example DTrace script can be used to show the call/return hierarchy of a Python script, only tracing within the invocation of a function called "start". In other words, import-time function invocations are not going to be listed:
fr: L'exemple suivant de script *DTrace* montre la hiérarchie d'appel/retour d'un script Python, en ne traçant que l'invocation d'une fonction ``start``. En d'autres termes, les appels de fonctions lors de la phase d'import ne seront pas répertoriées :

source: It can be invoked like this::
fr: Il peut être utilisé de cette manière ::

source: The output looks like this:
fr: La sortie ressemble à ceci :

source: Static SystemTap markers
fr: Marqueurs statiques *SystemTap*

source: The low-level way to use the SystemTap integration is to use the static markers directly. This requires you to explicitly state the binary file containing them.
fr: La façon la plus simple d'utiliser l'intégration *SystemTap* est d'utiliser directement les marqueurs statiques. Pour cela vous devez pointer explicitement le fichier binaire qui les contient.

source: For example, this SystemTap script can be used to show the call/return hierarchy of a Python script:
fr: Par exemple, ce script *SystemTap* peut être utilisé pour afficher la hiérarchie d'appel/retour d'un script Python :

source: where the columns are:
fr: où les colonnes sont :

source: time in microseconds since start of script
fr: temps en microsecondes depuis le début du script

source: name of executable
fr: nom de l'exécutable

source: PID of process
fr: PID du processus

source: and the remainder indicates the call/return hierarchy as the script executes.
fr: et le reste indique la hiérarchie d'appel/retour lorsque le script s'exécute.

source: For a :option:`--enable-shared` build of CPython, the markers are contained within the libpython shared library, and the probe's dotted path needs to reflect this. For example, this line from the above example:
fr: Pour une compilation :option:`--enable-shared` de CPython, les marqueurs sont contenus dans la bibliothèque partagée *libpython*, et le chemin du module de la sonde doit le refléter. Par exemple, la ligne de l'exemple ci-dessus :

source: should instead read:
fr: doit plutôt se lire comme :

source: (assuming a :ref:`debug build <debug-build>` of CPython 3.6)
fr: (en supposant une version de CPython 3.6 compilée avec le :ref:`débogage <debug-build>` activé)

source: Available static markers
fr: Marqueurs statiques disponibles

source: This marker indicates that execution of a Python function has begun. It is only triggered for pure-Python (bytecode) functions.
fr: Ce marqueur indique que l'exécution d'une fonction Python a commencé. Il n'est déclenché que pour les fonctions en Python pur (code intermédiaire).

source: The filename, function name, and line number are provided back to the tracing script as positional arguments, which must be accessed using ``$arg1``, ``$arg2``, ``$arg3``:
fr: Le nom de fichier, le nom de la fonction et le numéro de ligne sont renvoyés au script de traçage sous forme d'arguments positionnels, auxquels il faut accéder en utilisant ``$arg1``, ``$arg2``, ``$arg3`` :

source: ``$arg1`` : ``(const char *)`` filename, accessible using ``user_string($arg1)``
fr: ``$arg1`` : ``(const char *)`` nom de fichier, accessible via ``user_string($arg1)``

source: ``$arg2`` : ``(const char *)`` function name, accessible using ``user_string($arg2)``
fr: ``$arg2`` : ``(const char *)`` nom de la fonction, accessible via ``user_string($arg2)``

source: ``$arg3`` : ``int`` line number
fr: ``$arg3`` : numéro de ligne ``int``

source: This marker indicates a Python line is about to be executed. It is the equivalent of line-by-line tracing with a Python profiler. It is not triggered within C functions.
fr: Ce marqueur indique qu'une ligne Python est sur le point d'être exécutée. C'est l'équivalent du traçage ligne par ligne avec un profileur Python. Il n'est pas déclenché dans les fonctions C.

source: Fires when the Python interpreter finishes a garbage collection cycle. ``arg0`` is the number of collected objects.
fr: Fonction appelée lorsque l'interpréteur Python termine un cycle de collecte du ramasse-miettes. ``Arg0`` est le nombre d'objets collectés.

source: Fires before :mod:`importlib` attempts to find and load the module. ``arg0`` is the module name.
fr: Fonction appelée avant que :mod:`importlib` essaye de trouver et de charger le module. ``arg0`` est le nom du module.

source: Fires after :mod:`importlib`'s find_and_load function is called. ``arg0`` is the module name, ``arg1`` indicates if module was successfully loaded.
fr: Fonction appelée après que la fonction ``find_and_load`` du module :mod:`importlib` soit appelée. ``arg0`` est le nom du module, ``arg1`` indique si le module a été chargé avec succès.

source: Fires when :func:`sys.audit` or :c:func:`PySys_Audit` is called. ``arg0`` is the event name as C string, ``arg1`` is a :c:type:`PyObject` pointer to a tuple object.
fr: Fonction appelée quand les fonctions :func:`sys.audit` ou :c:func:`PySys_Audit` sont appelées. ``arg0`` est le nom de l'évènement de type chaîne de caractère C. ``arg1`` est un pointeur sur un *n*-uplet d'objet de type :c:type:`PyObject`.

source: SystemTap Tapsets
fr: *Tapsets* de *SystemTap*

source: The higher-level way to use the SystemTap integration is to use a "tapset": SystemTap's equivalent of a library, which hides some of the lower-level details of the static markers.
fr: La façon la plus simple d'utiliser l'intégration *SystemTap* est d'utiliser un *« tapset »*. L'équivalent pour *SystemTap* d'une bibliothèque, qui permet de masquer les détails de niveau inférieur des marqueurs statiques.

source: Here is a tapset file, based on a non-shared build of CPython:
fr: Voici un fichier *tapset*, basé sur une version non partagée compilée de CPython :

source: If this file is installed in SystemTap's tapset directory (e.g. ``/usr/share/systemtap/tapset``), then these additional probepoints become available:
fr: Si ce fichier est installé dans le répertoire *tapset* de *SystemTap* (par exemple ``/usr/share/systemtap/tapset``), alors ces sondes supplémentaires deviennent disponibles :

source: This probe point indicates that execution of a Python function has begun. It is only triggered for pure-Python (bytecode) functions.
fr: Cette sonde indique que l'exécution d'une fonction Python a commencé. Elle n'est déclenchée que pour les fonctions en Python pur (code intermédiaire).

source: This probe point is the converse of ``python.function.return``, and indicates that execution of a Python function has ended (either via ``return``, or via an exception). It is only triggered for pure-Python (bytecode) functions.
fr: Cette sonde est l'inverse de ``python.function.return``, et indique que l'exécution d'une fonction Python est terminée (soit via ``return``, soit via une exception). Elle est uniquement déclenchée pour les fonctions en Python pur (code intermédiaire ou *bytecode*).

source: Examples
fr: Exemples

source: This SystemTap script uses the tapset above to more cleanly implement the example given above of tracing the Python function-call hierarchy, without needing to directly name the static markers:
fr: Ce script *SystemTap* utilise le *tapset* ci-dessus pour implémenter plus proprement l'exemple précédent de traçage de la hiérarchie des appels de fonctions Python, sans avoir besoin de nommer directement les marqueurs statiques :
