Repository: python/python-docs-fr
Catalog: howto/ipaddress.po
Languages: fr

source: An introduction to the ipaddress module
fr: Introduction au module ``ipaddress``

source: author
fr: auteur

source: Overview
fr: Aperçu

source: This document aims to provide a gentle introduction to the :mod:`ipaddress` module. It is aimed primarily at users that aren't already familiar with IP networking terminology, but may also be useful to network engineers wanting an overview of how :mod:`ipaddress` represents IP network addressing concepts.
fr: Ce document vise à fournir une introduction rapide au module :mod:`ipaddress`. Il est destiné aux utilisateurs qui ne sont pas familiers avec la terminologie des réseaux IP, mais il peut aussi être utile aux ingénieurs réseaux qui cherchent un aperçu de la représentation des concepts d'adressage IP avec le module :mod:`ipaddress`.

source: Creating Address/Network/Interface objects
fr: Créer un objet Adresse/Réseau/Interface

source: Since :mod:`ipaddress` is a module for inspecting and manipulating IP addresses, the first thing you'll want to do is create some objects. You can use :mod:`ipaddress` to create objects from strings and integers.
fr: Vu que :mod:`ipaddress` est un module pour inspecter et manipuler des adresses IP, la première chose que vous voudrez faire est de créer quelques objets. Vous pouvez utiliser :mod:`ipaddress` pour créer des objets à partir de chaînes de caractères et d'entiers.

source: A Note on IP Versions
fr: Note sur les versions d'IP

source: For readers that aren't particularly familiar with IP addressing, it's important to know that the Internet Protocol is currently in the process of moving from version 4 of the protocol to version 6. This transition is occurring largely because version 4 of the protocol doesn't provide enough addresses to handle the needs of the whole world, especially given the increasing number of devices with direct connections to the internet.
fr: Pour les lecteurs qui ne sont pas particulièrement familiers avec l'adressage IP il est important de savoir que le protocole IP est actuellement en évolution de la version 4 du protocole vers la version 6. Cette transition est largement due au fait que la version 4 du protocole ne fournit pas assez d'adresses pour gérer les besoins du monde entier, particulièrement à cause de la croissance des périphériques directement connectés à Internet.

source: Explaining the details of the differences between the two versions of the protocol is beyond the scope of this introduction, but readers need to at least be aware that these two versions exist, and it will sometimes be necessary to force the use of one version or the other.
fr: Expliquer les détails des différences entre les deux versions du protocole est au-delà du périmètre de cette introduction, mais les lecteurs doivent au moins être avertis de l'existence de ces deux versions et qu'il sera nécessaire de forcer l'utilisation d'une version ou de l'autre.

source: IP Host Addresses
fr: Adresses IP des hôtes

source: Addresses, often referred to as "host addresses" are the most basic unit when working with IP addressing. The simplest way to create addresses is to use the :func:`ipaddress.ip_address` factory function, which automatically determines whether to create an IPv4 or IPv6 address based on the passed in value:
fr: Les adresses, souvent dénommées "adresses hôtes" sont les unités les plus basiques quand on travaille avec l'adressage IP. Le moyen le plus simple de créer des adresses est d'utiliser la fonction de fabrication :func:`ipaddress.ip_address` qui va automatiquement déterminer quoi créer entre une adresse IPv4 ou une adresse IPv6 en fonction de la valeur qui est transmise :

source: Addresses can also be created directly from integers. Values that will fit within 32 bits are assumed to be IPv4 addresses::
fr: Les adresses peuvent être créées directement depuis des entiers. Les valeurs qui correspondent à des entiers 32 bits sont assimilées à des adresses IPv4 ::

source: To force the use of IPv4 or IPv6 addresses, the relevant classes can be invoked directly. This is particularly useful to force creation of IPv6 addresses for small integers::
fr: Pour forcer l'utilisation d'IPv4 ou d'IPv6, la classe appropriée peut être invoquée directement. C'est particulièrement utile pour forcer la création d'adresse IPv6 pour de petits entiers ::

source: Defining Networks
fr: Définir des réseaux

source: Host addresses are usually grouped together into IP networks, so :mod:`ipaddress` provides a way to create, inspect and manipulate network definitions. IP network objects are constructed from strings that define the range of host addresses that are part of that network. The simplest form for that information is a "network address/network prefix" pair, where the prefix defines the number of leading bits that are compared to determine whether or not an address is part of the network and the network address defines the expected value of those bits.
fr: Les adresses hôtes sont souvent regroupées dans des réseaux IP, donc :mod:`ipaddress` fournit un moyen de créer, d'inspecter et de manipuler les définitions des réseaux. Les objets correspondants aux réseaux IP sont construits à partir de chaînes de caractères qui définissent le périmètre des adresses hôtes qui font partie de ce réseau. La forme la plus simple de cette information est un couple "adresse réseau/préfixe réseau" , où le préfixe définit le nombre de bits de tête qui sont comparés pour déterminer si l'adresse fait ou ne fait pas partie de ce réseau et l'adresse réseau définit la valeur attendue pour ces bits.

source: As for addresses, a factory function is provided that determines the correct IP version automatically::
fr: Tout comme pour les adresses, une fonction de fabrication est disponible et détermine automatiquement la version correcte d'IP ::

source: Network objects cannot have any host bits set. The practical effect of this is that ``192.0.2.1/24`` does not describe a network. Such definitions are referred to as interface objects since the ip-on-a-network notation is commonly used to describe network interfaces of a computer on a given network and are described further in the next section.
fr: Il est interdit pour des objets réseaux d'avoir des bits affectés à leurs hôtes mis à 1. Ainsi la chaine de caractère ``192.0.2.1/24`` ne peut définir un réseau. Ces objets réseaux sont aussi appelés objets d'interfaces car la notation ``adresse ip / réseau`` est couramment utilisée pour décrire les interfaces réseau d'un ordinateur sur un réseau donné (nous les détaillons plus loin dans cette section).

source: By default, attempting to create a network object with host bits set will result in :exc:`ValueError` being raised. To request that the additional bits instead be coerced to zero, the flag ``strict=False`` can be passed to the constructor::
fr: Par défaut, tenter de créer un objet réseau avec des bits d'hôtes mis à 1 lève une :exc:`ValueError`. Pour demander que les bits supplémentaires soient plutôt forcés à zéro, l'attribut ``strict=False`` peut être passé au constructeur ::

source: While the string form offers significantly more flexibility, networks can also be defined with integers, just like host addresses. In this case, the network is considered to contain only the single address identified by the integer, so the network prefix includes the entire network address::
fr: Alors que la forme textuelle offre davantage de flexibilité les réseaux peuvent aussi être définis avec des entiers, tout comme les adresses hôtes. Dans ce cas le réseau est considéré comme contenant uniquement l'adresse identifiée par l'entier, donc le préfixe réseau inclut l'adresse du réseau complet ::

source: As with addresses, creation of a particular kind of network can be forced by calling the class constructor directly instead of using the factory function.
fr: Comme avec les adresses, la création d'un type de réseau particulier peut être forcé en appelant directement le constructeur de la classe plutôt que d'utiliser la fonction de fabrication.

source: Host Interfaces
fr: Interfaces des hôtes

source: As mentioned just above, if you need to describe an address on a particular network, neither the address nor the network classes are sufficient. Notation like ``192.0.2.1/24`` is commonly used by network engineers and the people who write tools for firewalls and routers as shorthand for "the host ``192.0.2.1`` on the network ``192.0.2.0/24``", Accordingly, :mod:`ipaddress` provides a set of hybrid classes that associate an address with a particular network. The interface for creation is identical to that for defining network objects, except that the address portion isn't constrained to being a network address.
fr: Comme mentionné ci-dessus, si vous avez besoin de décrire une adresse sur un réseau particulier, ni l'adresse ni les classes réseaux ne sont suffisantes. Les notations comme ``192.0.2.1/24`` sont généralement utilisées par les ingénieurs réseaux et les personnes qui écrivent des outils pour les pare-feu et les routeurs comme raccourci pour " l'hôte ``192.0.2.1`` sur le réseau ``192.0.2.0/24``", par conséquent, :mod:`ipaddress` fournit un ensemble de classes hybrides qui associent une adresse à un réseau particulier. L'interface pour la création est identique à celle pour la définition des objets réseaux, excepté que la partie adresse n'est pas contrainte d'être une adresse réseau.

source: Integer inputs are accepted (as with networks), and use of a particular IP version can be forced by calling the relevant constructor directly.
fr: Les entiers sont acceptés en entrée (comme avec les réseaux), et l'utilisation d'une version d'IP peut être forcée en appelant directement le constructeur adapté.

source: Inspecting Address/Network/Interface Objects
fr: Inspecter les objets Address/Network/Interface

source: You've gone to the trouble of creating an IPv(4|6)(Address|Network|Interface) object, so you probably want to get information about it. :mod:`ipaddress` tries to make doing this easy and intuitive.
fr: Vous vous êtes donné la peine de créer un objet (adresse|réseau|interface)IPv(4|6), donc vous voudrez probablement des informations sur celui-ci. :mod:`ipaddress` essaie de rendre ceci facile et intuitif.

source: Extracting the IP version::
fr: Extraire la version du protocole IP

source: Obtaining the network from an interface::
fr: Obtenir le réseau à partir de l'interface ::

source: Finding out how many individual addresses are in a network::
fr: Trouver combien d'adresses individuelles sont dans un réseau ::

source: Iterating through the "usable" addresses on a network::
fr: Itération sur chacune des adresses "utilisables" d'un réseau ::

source: Obtaining the netmask (i.e. set bits corresponding to the network prefix) or the hostmask (any bits that are not part of the netmask):
fr: Obtenir le masque réseau (définit les bits correspondant au préfixe du réseau) ou le masque de l'hôte (tous les bits qui ne sont pas dans le masque du réseau) :

source: Exploding or compressing the address::
fr: Éclater ou compresser l'adresse ::

source: While IPv4 doesn't support explosion or compression, the associated objects still provide the relevant properties so that version neutral code can easily ensure the most concise or most verbose form is used for IPv6 addresses while still correctly handling IPv4 addresses.
fr: Alors que IPv4 ne gère pas l'éclatement ou la compression, les objets associés fournissent toujours les propriétés adaptées pour que du code, le plus neutre possible vis-à-vis de la version, puisse facilement s'assurer que la forme la plus concise ou la plus verbeuse utilisée pour des adresses IPv6 va aussi fonctionner pour gérer des adresses IPv4.

source: Networks as lists of Addresses
fr: Réseaux en tant que listes d'adresses

source: It's sometimes useful to treat networks as lists. This means it is possible to index them like this::
fr: Il est parfois utile de traiter les réseaux en tant que listes. Cela signifie qu'il est possible de les indexer comme ça ::

source: It also means that network objects lend themselves to using the list membership test syntax like this::
fr: Cela signifie aussi que les objets réseaux se prêtent bien à l'utilisation de la syntaxe suivante pour le test d'appartenance à la liste ::

source: Containment testing is done efficiently based on the network prefix::
fr: En se basant sur le préfixe réseau on peut efficacement tester l'appartenance ::

source: Comparisons
fr: Comparaisons

source: :mod:`ipaddress` provides some simple, hopefully intuitive ways to compare objects, where it makes sense::
fr: :mod:`ipaddress` fournit des moyens simples, et heureusement intuitifs de comparer les objets, quand cela fait sens ::

source: A :exc:`TypeError` exception is raised if you try to compare objects of different versions or different types.
fr: Une exception :exc:`TypeError` est levée si vous tentez de comparer des objets de différentes versions ou de types différents.

source: Using IP Addresses with other modules
fr: Utiliser des adresse IP avec d'autre modules

source: Other modules that use IP addresses (such as :mod:`socket`) usually won't accept objects from this module directly. Instead, they must be coerced to an integer or string that the other module will accept::
fr: Les autres modules qui utilisent des adresses IP (comme :mod:`socket`) n'acceptent généralement pas les objets de ce module directement. Au lieu de cela, ils doivent être convertis en entiers ou en chaînes de caractères que l'autre module va accepter ::

source: Getting more detail when instance creation fails
fr: Obtenir plus de détails lors de l'échec de la création de l'instance

source: When creating address/network/interface objects using the version-agnostic factory functions, any errors will be reported as :exc:`ValueError` with a generic error message that simply says the passed in value was not recognized as an object of that type. The lack of a specific error is because it's necessary to know whether the value is *supposed* to be IPv4 or IPv6 in order to provide more detail on why it has been rejected.
fr: Lors de la création des objets Adresse/Réseau/Interface en utilisant les fonctions de fabrication agnostiques à la version, n'importe quelle erreur va être signalée en tant que :exc:`ValueError` avec un message d'erreur générique qui dit simplement que la valeur entrée n'a pas été reconnue en tant qu'objet de ce type. Le manque de spécificité de l'erreur est dû à la nécessité de de connaitre ce que la valeur est *supposée* être entre une IPv4 ou IPv6 dans le but de fournir plus de détails sur la cause du rejet.

source: To support use cases where it is useful to have access to this additional detail, the individual class constructors actually raise the :exc:`ValueError` subclasses :exc:`ipaddress.AddressValueError` and :exc:`ipaddress.NetmaskValueError` to indicate exactly which part of the definition failed to parse correctly.
fr: Pour gérer les cas d'usage où il est utile d'avoir accès à ces détails, les constructeurs individuels des classes lèvent actuellement les sous-classes de :exc:`ValueError`, :exc:`ipaddress.AddressValueError` et :exc:`ipaddress.NetmaskValueError` pour indiquer précisément quelle partie de la définition n'a pas pu être correctement traitée.

source: The error messages are significantly more detailed when using the class constructors directly. For example::
fr: Les messages d'erreur sont particulièrement plus détaillés lors de l'utilisation directe du constructeur. Par exemple ::

source: However, both of the module specific exceptions have :exc:`ValueError` as their parent class, so if you're not concerned with the particular type of error, you can still write code like the following::
fr: Cependant, les exceptions spécifiques des deux modules ont :exc:`ValueError`, tout comme leur classe parent, donc si vous n'êtes pas concerné par le type particulier de l'erreur vous pouvez écrire votre code comme il suit ::
