Repository: python/python-docs-fr
Catalog: howto/logging.po
Languages: fr

source: The :class:`NullHandler`, :class:`StreamHandler` and :class:`FileHandler` classes are defined in the core logging package. The other handlers are defined in a sub-module, :mod:`logging.handlers`. (There is also another sub-module, :mod:`logging.config`, for configuration functionality.)
fr: Les classes :class:`NullHandler`, :class:`StreamHandler` et :class:`FileHandler` sont définies dans le module de journalisation de base. Les autres gestionnaires sont définis dans un sous-module, :mod:`logging.handlers` (il existe également un autre sous-module, :mod:`logging.config`, pour la fonctionnalité de configuration).

source: Logged messages are formatted for presentation through instances of the :class:`Formatter` class. They are initialized with a format string suitable for use with the % operator and a dictionary.
fr: Les messages journalisés sont mis en forme pour la présentation via des instances de la classe :class:`Formatter`. Ils sont initialisés avec une chaîne de format appropriée pour une utilisation avec l'opérateur % et un dictionnaire.

source: For formatting multiple messages in a batch, instances of :class:`~handlers.BufferingFormatter` can be used. In addition to the format string (which is applied to each message in the batch), there is provision for header and trailer format strings.
fr: Pour formater plusieurs messages dans un lot, des instances de :class:`~handlers.BufferingFormatter` peuvent être utilisées. En plus de la chaîne de format (qui est appliquée à chaque message dans le lot), il existe des dispositions pour les chaînes de format d'en-tête et de fin.

source: When filtering based on logger level and/or handler level is not enough, instances of :class:`Filter` can be added to both :class:`Logger` and :class:`Handler` instances (through their :meth:`~Handler.addFilter` method). Before deciding to process a message further, both loggers and handlers consult all their filters for permission. If any filter returns a false value, the message is not processed further.
fr: Lorsque le filtrage basé sur le niveau de l'enregistreur et/ou le niveau du gestionnaire ne suffit pas, les instances de :class:`Filter` peuvent être ajoutées aux deux instances de :class:`Logger` et :class:`Handler` (par le biais de leur méthode :meth:`~Handler.addFilter`). Avant de décider de traiter un message plus loin, les enregistreurs et les gestionnaires consultent tous leurs filtres pour obtenir l'autorisation. Si un filtre renvoie une valeur ``False``, le traitement du message est arrêté.

source: The basic :class:`Filter` functionality allows filtering by specific logger name. If this feature is used, messages sent to the named logger and its children are allowed through the filter, and all others dropped.
fr: La fonctionnalité de base :class:`Filter` permet de filtrer par nom de *logger* spécifique. Si cette fonctionnalité est utilisée, les messages envoyés à l'enregistreur nommé et à ses enfants sont autorisés via le filtre et tous les autres sont abandonnés.

source: Exceptions raised during logging
fr: Exceptions levées par la journalisation

source: The logging package is designed to swallow exceptions which occur while logging in production. This is so that errors which occur while handling logging events - such as logging misconfiguration, network or other similar errors - do not cause the application using logging to terminate prematurely.
fr: Le paquet de journalisation est conçu pour ne pas faire apparaître les exceptions qui se produisent lors de la journalisation en production. Il s'agit de sorte que les erreurs qui se produisent lors de la gestion des événements de journalisation (telles qu'une mauvaise configuration de la journalisation, une erreur réseau ou d'autres erreurs similaires) ne provoquent pas l'arrêt de l'application utilisant la journalisation.

source: :class:`SystemExit` and :class:`KeyboardInterrupt` exceptions are never swallowed. Other exceptions which occur during the :meth:`~Handler.emit` method of a :class:`Handler` subclass are passed to its :meth:`~Handler.handleError` method.
fr: Les exceptions :class:`SystemExit` et :class:`KeyboardInterrupt` ne sont jamais passées sous silence. Les autres exceptions qui se produisent pendant la méthode :meth:`~Handler.emit` d'une sous classe :class:`Handler` sont passées à sa méthode :meth:`~Handler.handleError`.

source: The default implementation of :meth:`~Handler.handleError` in :class:`Handler` checks to see if a module-level variable, :data:`raiseExceptions`, is set. If set, a traceback is printed to :data:`sys.stderr`. If not set, the exception is swallowed.
fr: L'implémentation par défaut de :meth:`~Handler.handleError` dans la classe :class:`Handler` vérifie si une variable au niveau du module, :data:`raiseExceptions`, est définie. Si cette valeur est définie, la trace de la pile d'appels est affichée sur :data:`sys.stderr`. Si elle n'est pas définie, l'exception est passée sous silence.

source: The default value of :data:`raiseExceptions` is ``True``. This is because during development, you typically want to be notified of any exceptions that occur. It's advised that you set :data:`raiseExceptions` to ``False`` for production usage.
fr: La valeur par défaut de :data:`raiseExceptions` est ``True``. C'est parce que pendant le développement, vous voulez généralement être notifié de toutes les exceptions qui se produisent. Il est conseillé de définir :data:`raiseExceptions` à ``False`` pour une utilisation en production.

source: Using arbitrary objects as messages
fr: Utilisation d'objets arbitraires comme messages

source: In the preceding sections and examples, it has been assumed that the message passed when logging the event is a string. However, this is not the only possibility. You can pass an arbitrary object as a message, and its :meth:`~object.__str__` method will be called when the logging system needs to convert it to a string representation. In fact, if you want to, you can avoid computing a string representation altogether - for example, the :class:`~handlers.SocketHandler` emits an event by pickling it and sending it over the wire.
fr: Dans les sections et exemples précédents, il a été supposé que le message passé lors de la journalisation de l'événement est une chaîne. Cependant, ce n'est pas la seule possibilité. Vous pouvez passer un objet arbitraire en tant que message et sa méthode :meth:`~object.__str__` est appelée lorsque le système de journalisation doit le convertir en une représentation sous forme de chaîne. En fait, si vous le souhaitez, vous pouvez complètement éviter de calculer une représentation sous forme de chaîne. Par exemple, les gestionnaires :class:`~handlers.SocketHandler` émettent un événement en lui appliquant *pickle* et en l'envoyant sur le réseau.

source: Optimization
fr: Optimisation

source: Formatting of message arguments is deferred until it cannot be avoided. However, computing the arguments passed to the logging method can also be expensive, and you may want to avoid doing it if the logger will just throw away your event. To decide what to do, you can call the :meth:`~Logger.isEnabledFor` method which takes a level argument and returns true if the event would be created by the Logger for that level of call. You can write code like this::
fr: La mise en forme des arguments de message est différée jusqu'à ce qu'elle ne puisse pas être évitée. Toutefois, le calcul des arguments passés à la méthode de journalisation peut également être coûteux et vous voudrez peut-être éviter de le faire si l'enregistreur va simplement jeter votre événement. Pour décider de ce qu'il faut faire, vous pouvez appeler la méthode :meth:`~Logger.isEnabledFor` qui prend en argument le niveau et renvoie ``True`` si un événement est créé par l'enregistreur pour ce niveau d'appel. Vous pouvez écrire un code qui ressemble à ça ::

source: so that if the logger's threshold is set above ``DEBUG``, the calls to :func:`expensive_func1` and :func:`expensive_func2` are never made.
fr: de sorte que si le seuil du journaliseur est défini au-dessus de ``DEBUG``, les appels à :func:`expensive_func1` et :func:`expensive_func2` ne sont jamais faits.

source: In some cases, :meth:`~Logger.isEnabledFor` can itself be more expensive than you'd like (e.g. for deeply nested loggers where an explicit level is only set high up in the logger hierarchy). In such cases (or if you want to avoid calling a method in tight loops), you can cache the result of a call to :meth:`~Logger.isEnabledFor` in a local or instance variable, and use that instead of calling the method each time. Such a cached value would only need to be recomputed when the logging configuration changes dynamically while the application is running (which is not all that common).
fr: Dans certains cas, :meth:`~Logger.isEnabledFor` peut être plus coûteux que vous le souhaitez (par exemple pour les enregistreurs profondément imbriqués où un niveau explicite n'est défini que dans la hiérarchie des enregistreurs). Dans de tels cas (ou si vous souhaitez éviter d'appeler une méthode dans des boucles optimisées), vous pouvez mettre en cache le résultat d'un appel à :meth:`~Logger.isEnabledFor` dans une variable locale ou d'instance, et l'utiliser au lieu d'appeler la méthode à chaque fois. Une telle valeur mise en cache ne doit être recalculée que lorsque la configuration de journalisation change dynamiquement pendant l'exécution de l'application (ce qui est rarement le cas).

source: There are other optimizations which can be made for specific applications which need more precise control over what logging information is collected. Here's a list of things you can do to avoid processing during logging which you don't need:
fr: Il existe d'autres optimisations qui peuvent être faites pour des applications spécifiques qui nécessitent un contrôle plus précis sur les informations de journalisation collectées. Voici une liste de choses que vous pouvez faire pour éviter le traitement pendant la journalisation dont vous n'avez pas besoin :

source: What you don't want to collect
fr: Ce que vous ne voulez pas collecter

source: How to avoid collecting it
fr: Comment éviter de le collecter

source: Information about where calls were made from.
fr: Informations sur l'endroit où les appels ont été faits.

source: Set ``logging._srcfile`` to ``None``. This avoids calling :func:`sys._getframe`, which may help to speed up your code in environments like PyPy (which can't speed up code that uses :func:`sys._getframe`), if and when PyPy supports Python 3.x.
fr: Définissez ``logging._srcfile`` à ``None``. Cela évite d'appeler :func:`sys._getframe`, qui peut aider à accélérer votre code dans des environnements comme PyPy (qui ne peut pas accélérer le code qui utilise :func:`sys._getframe`), si et quand PyPy prendra en charge Python 3.x.

source: Threading information.
fr: Informations de *threading*.

source: Set ``logging.logThreads`` to ``0``.
fr: Mettez ``logging.logThreads`` à ``0``.

source: Process information.
fr: Informations sur le processus.

source: Set ``logging.logProcesses`` to ``0``.
fr: Mettez ``logging.logProcesses`` à ``0``.

source: Also note that the core logging module only includes the basic handlers. If you don't import :mod:`logging.handlers` and :mod:`logging.config`, they won't take up any memory.
fr: Notez également que le module de journalisation principale inclut uniquement les gestionnaires de base. Si vous n'importez pas :mod:`logging.handlers` et :mod:`logging.config`, ils ne prendront pas de mémoire.

source: API reference for the logging module.
fr: Référence d'API pour le module de journalisation.

source: Configuration API for the logging module.
fr: API de configuration pour le module de journalisation.

source: Useful handlers included with the logging module.
fr: Gestionnaires utiles inclus avec le module de journalisation.
