Repository: python/python-docs-fr
Catalog: howto/logging.po
Languages: fr

source: Note that the class names referenced in config files need to be either relative to the logging module, or absolute values which can be resolved using normal import mechanisms. Thus, you could use either :class:`~logging.handlers.WatchedFileHandler` (relative to the logging module) or ``mypackage.mymodule.MyHandler`` (for a class defined in package ``mypackage`` and module ``mymodule``, where ``mypackage`` is available on the Python import path).
fr: Notez que les noms de classe référencés dans le fichier de configuration doivent être relatifs au module `logging`, ou des valeurs absolues qui peuvent être résolues à travers les mécanismes d'importation habituels. Ainsi, on peut soit utiliser :class:`~logging.handlers.WatchedFileHandler` (relativement au module `logging`) ou ``mypackage.mymodule.MyHandler`` (pour une classe définie dans le paquet ``mypackage`` et le module ``mymodule``, si ``mypackage`` est disponible dans les chemins d'importation de Python).

source: In Python 3.2, a new means of configuring logging has been introduced, using dictionaries to hold configuration information. This provides a superset of the functionality of the config-file-based approach outlined above, and is the recommended configuration method for new applications and deployments. Because a Python dictionary is used to hold configuration information, and since you can populate that dictionary using different means, you have more options for configuration. For example, you can use a configuration file in JSON format, or, if you have access to YAML processing functionality, a file in YAML format, to populate the configuration dictionary. Or, of course, you can construct the dictionary in Python code, receive it in pickled form over a socket, or use whatever approach makes sense for your application.
fr: Dans Python 3.2, un nouveau moyen de configuration de la journalisation a été introduit, à l'aide de dictionnaires pour contenir les informations de configuration. Cela fournit un sur-ensemble de la fonctionnalité décrite ci-dessus basée sur un fichier de configuration et c’est la méthode recommandée pour les nouvelles applications et les déploiements. Étant donné qu'un dictionnaire Python est utilisé pour contenir des informations de configuration et que vous pouvez remplir ce dictionnaire à l'aide de différents moyens, vous avez plus d'options pour la configuration. Par exemple, vous pouvez utiliser un fichier de configuration au format JSON ou, si vous avez accès à la fonctionnalité de traitement YAML, un fichier au format YAML, pour remplir le dictionnaire de configuration. Ou bien sûr, vous pouvez construire le dictionnaire dans le code Python, le recevoir sous forme de *pickle* sur un connecteur, ou utiliser n'importe quelle approche suivant la logique de votre application.

source: Here's an example of the same configuration as above, in YAML format for the new dictionary-based approach:
fr: Voici un exemple définissant la même configuration que ci-dessus, au format YAML pour le dictionnaire correspondant à cette nouvelle approche :

source: For more information about logging using a dictionary, see :ref:`logging-config-api`.
fr: Pour plus d'informations sur la journalisation à l'aide d'un dictionnaire, consultez :ref:`logging-config-api`.

source: What happens if no configuration is provided
fr: Comportement par défaut (si aucune configuration n'est fournie)

source: If no logging configuration is provided, it is possible to have a situation where a logging event needs to be output, but no handlers can be found to output the event. The behaviour of the logging package in these circumstances is dependent on the Python version.
fr: Si aucune configuration de journalisation n'est fournie, il est possible d'avoir une situation où un événement doit faire l'objet d'une journalisation, mais où aucun gestionnaire ne peut être trouvé pour tracer l'événement. Le comportement du paquet ``logging`` dans ces circonstances dépend de la version Python.

source: For versions of Python prior to 3.2, the behaviour is as follows:
fr: Pour les versions de Python antérieures à 3.2, le comportement est le suivant :

source: If *logging.raiseExceptions* is ``False`` (production mode), the event is silently dropped.
fr: Si *logging.raiseExceptions* vaut ``False`` (mode production), l’événement est silencieusement abandonné.

source: If *logging.raiseExceptions* is ``True`` (development mode), a message 'No handlers could be found for logger X.Y.Z' is printed once.
fr: Si *logging.raiseExceptions* vaut ``True`` (mode de développement), un message *No handlers could be found for logger X.Y.Z* est écrit sur la sortie standard une fois.

source: In Python 3.2 and later, the behaviour is as follows:
fr: Dans Python 3.2 et ultérieur, le comportement est le suivant :

source: The event is output using a 'handler of last resort', stored in ``logging.lastResort``. This internal handler is not associated with any logger, and acts like a :class:`~logging.StreamHandler` which writes the event description message to the current value of ``sys.stderr`` (therefore respecting any redirections which may be in effect). No formatting is done on the message - just the bare event description message is printed. The handler's level is set to ``WARNING``, so all events at this and greater severities will be output.
fr: L'événement est sorti à l'aide d'un « gestionnaire de dernier recours », stocké dans ``logging.lastResort``. Ce gestionnaire interne n'est associé à aucun enregistreur et agit comme un :class:`~logging.StreamHandler` qui écrit le message de description de l'événement vers la valeur actuelle de ``sys.stderr`` (par conséquent, en respectant les redirections qui peuvent être en vigueur). Aucun formatage n'est fait sur le message – juste le message de description de l'événement nu est affiché. Le niveau du gestionnaire est défini sur ``WARNING``, de sorte que tous les événements de cette sévérité et plus seront écrits.

source: To obtain the pre-3.2 behaviour, ``logging.lastResort`` can be set to ``None``.
fr: Pour obtenir un comportement antérieur à 3.2, ``logging.lastResort`` peut être mis à ``None``.

source: Configuring Logging for a Library
fr: Configuration de la journalisation pour une bibliothèque

source: When developing a library which uses logging, you should take care to document how the library uses logging - for example, the names of loggers used. Some consideration also needs to be given to its logging configuration. If the using application does not use logging, and library code makes logging calls, then (as described in the previous section) events of severity ``WARNING`` and greater will be printed to ``sys.stderr``. This is regarded as the best default behaviour.
fr: Lors du développement d'une bibliothèque qui utilise la journalisation, vous devez prendre soin de documenter la façon dont la bibliothèque utilise la journalisation (par exemple, les noms des enregistreurs utilisés). Consacrez aussi un peu de temps à la configuration de la journalisation. Si l'application utilisant votre bibliothèque n'utilise pas la journalisation et que le code de la bibliothèque effectue des appels de journalisation, alors (comme décrit dans la section précédente), les événements de gravité ``WARNING`` et au-dessus seront écrits sur ``sys.stderr``. Cela est considéré comme le meilleur comportement par défaut.

source: If for some reason you *don't* want these messages printed in the absence of any logging configuration, you can attach a do-nothing handler to the top-level logger for your library. This avoids the message being printed, since a handler will always be found for the library's events: it just doesn't produce any output. If the library user configures logging for application use, presumably that configuration will add some handlers, and if levels are suitably configured then logging calls made in library code will send output to those handlers, as normal.
fr: Si, pour une raison quelconque, vous ne voulez *pas* que ces messages soient affichés en l'absence de toute configuration de journalisation, vous pouvez attacher un gestionnaire *ne-fait-rien* à l'enregistreur de niveau supérieur de votre bibliothèque. Cela évite qu’un message ne soit écrit, puisqu’un gestionnaire sera toujours trouvé pour les événements de la bibliothèque, il ne produit tout simplement pas de sortie. Si celui qui utilise la bibliothèque configure la journalisation pour son application, il est vraisemblable que la configuration ajoutera certains gestionnaires et, si les niveaux sont convenablement configurés, alors la journalisation des appels effectués dans le code de bibliothèque enverra la sortie à ces gestionnaires, comme d'habitude.

source: A do-nothing handler is included in the logging package: :class:`~logging.NullHandler` (since Python 3.1). An instance of this handler could be added to the top-level logger of the logging namespace used by the library (*if* you want to prevent your library's logged events being output to ``sys.stderr`` in the absence of logging configuration). If all logging by a library *foo* is done using loggers with names matching 'foo.x', 'foo.x.y', etc. then the code::
fr: Un gestionnaire *ne-fait-rien* est inclus dans le paquet de journalisation : :class:`~logging.NullHandler` (depuis Python 3.1). Une instance de ce gestionnaire peut être ajoutée à l'enregistreur de niveau supérieur de l'espace de nommage de journalisation utilisé par la bibliothèque (*si* vous souhaitez empêcher la copie de la journalisation de votre bibliothèque dans ``sys.stderr`` en l'absence de configuration de journalisation). Si toute la journalisation par une bibliothèque *foo* est effectuée en utilisant des enregistreurs avec des noms correspondant à *foo.x*, *foo.x.y*, etc., alors le code ::

source: should have the desired effect. If an organisation produces a number of libraries, then the logger name specified can be 'orgname.foo' rather than just 'foo'.
fr: doit avoir l'effet désiré. Si une organisation produit un certain nombre de bibliothèques, le nom de l'enregistreur spécifié peut être ``orgname.foo`` plutôt que simplement ``foo``.

source: It is strongly advised that you *do not add any handlers other than* :class:`~logging.NullHandler` *to your library's loggers*. This is because the configuration of handlers is the prerogative of the application developer who uses your library. The application developer knows their target audience and what handlers are most appropriate for their application: if you add handlers 'under the hood', you might well interfere with their ability to carry out unit tests and deliver logs which suit their requirements.
fr: Il est vivement conseillé de ne *pas ajouter de gestionnaires autres que* :class:`~logging.NullHandler` *aux enregistreurs de votre bibliothèque*. Cela est dû au fait que la configuration des gestionnaires est la prérogative du développeur d'applications qui utilise votre bibliothèque. Le développeur d'applications connaît le public cible et les gestionnaires les plus appropriés pour ses applications : si vous ajoutez des gestionnaires « sous le manteau », vous pourriez bien interférer avec les tests unitaires et la journalisation qui convient à ses exigences.

source: Logging Levels
fr: Niveaux de journalisation

source: The numeric values of logging levels are given in the following table. These are primarily of interest if you want to define your own levels, and need them to have specific values relative to the predefined levels. If you define a level with the same numeric value, it overwrites the predefined value; the predefined name is lost.
fr: Les valeurs numériques des niveaux de journalisation sont données dans le tableau suivant. Celles-ci n'ont d'intérêt que si vous voulez définir vos propres niveaux, avec des valeurs spécifiques par rapport aux niveaux prédéfinis. Si vous définissez un niveau avec la même valeur numérique, il écrase la valeur prédéfinie ; le nom prédéfini est perdu.

source: Numeric value
fr: Valeur numérique

source: Levels can also be associated with loggers, being set either by the developer or through loading a saved logging configuration. When a logging method is called on a logger, the logger compares its own level with the level associated with the method call. If the logger's level is higher than the method call's, no logging message is actually generated. This is the basic mechanism controlling the verbosity of logging output.
fr: Les niveaux peuvent également être associés à des enregistreurs, étant définis soit par le développeur, soit par le chargement d'une configuration de journalisation enregistrée. Lorsqu'une méthode de journalisation est appelée sur un enregistreur, l'enregistreur compare son propre niveau avec le niveau associé à l'appel de méthode. Si le niveau de l'enregistreur est supérieur à l'appel de méthode, aucun message de journalisation n'est réellement généré. C'est le mécanisme de base contrôlant la verbosité de la sortie de journalisation.

source: Logging messages are encoded as instances of the :class:`~logging.LogRecord` class. When a logger decides to actually log an event, a :class:`~logging.LogRecord` instance is created from the logging message.
fr: Les messages de journalisation sont codés en tant qu'instances de :class:`~logging.LogRecord`. Lorsqu'un enregistreur décide de réellement enregistrer un événement, une instance de :class:`~logging.LogRecord` est créée à partir du message de journalisation.

source: Logging messages are subjected to a dispatch mechanism through the use of :dfn:`handlers`, which are instances of subclasses of the :class:`Handler` class. Handlers are responsible for ensuring that a logged message (in the form of a :class:`LogRecord`) ends up in a particular location (or set of locations) which is useful for the target audience for that message (such as end users, support desk staff, system administrators, developers). Handlers are passed :class:`LogRecord` instances intended for particular destinations. Each logger can have zero, one or more handlers associated with it (via the :meth:`~Logger.addHandler` method of :class:`Logger`). In addition to any handlers directly associated with a logger, *all handlers associated with all ancestors of the logger* are called to dispatch the message (unless the *propagate* flag for a logger is set to a false value, at which point the passing to ancestor handlers stops).
fr: Les messages de journalisation sont soumis à un mécanisme d'expédition via l'utilisation de :dfn:`handlers`, qui sont des instances de sous-classes de la classe :class:`Handler`. Les gestionnaires sont chargés de s'assurer qu'un message journalisé (sous la forme d'un :class:`LogRecord`) atterrit dans un emplacement particulier (ou un ensemble d'emplacements) qui est utile pour le public cible pour ce message (tels que les utilisateurs finaux, le personnel chargé de l'assistance aux utilisateurs, les administrateurs système ou les développeurs). Des instances de :class:`LogRecord` adaptées à leur destination finale sont passées aux gestionnaires destinées à des destinations particulières. Chaque enregistreur peut avoir zéro, un ou plusieurs gestionnaires associés à celui-ci (via la méthode :meth:`~Logger.addHandler` de :class:`Logger`). En plus de tous les gestionnaires directement associés à un enregistreur, *tous les gestionnaires associés à tous les ancêtres de l'enregistreur* sont appelés pour envoyer le message (à moins que l'indicateur *propager* pour un enregistreur soit défini sur la valeur ``False``, auquel cas le passage à l'ancêtre gestionnaires s'arrête).

source: Just as for loggers, handlers can have levels associated with them. A handler's level acts as a filter in the same way as a logger's level does. If a handler decides to actually dispatch an event, the :meth:`~Handler.emit` method is used to send the message to its destination. Most user-defined subclasses of :class:`Handler` will need to override this :meth:`~Handler.emit`.
fr: Tout comme pour les enregistreurs, les gestionnaires peuvent avoir des niveaux associés. Le niveau d'un gestionnaire agit comme un filtre de la même manière que le niveau d'un enregistreur. Si un gestionnaire décide de réellement distribuer un événement, la méthode :meth:`~Handler.emit` est utilisée pour envoyer le message à sa destination. La plupart des sous-classes définies par l'utilisateur de :class:`Handler` devront remplacer ce :meth:`~Handler.emit`.

source: Custom Levels
fr: Niveaux personnalisés

source: Defining your own levels is possible, but should not be necessary, as the existing levels have been chosen on the basis of practical experience. However, if you are convinced that you need custom levels, great care should be exercised when doing this, and it is possibly *a very bad idea to define custom levels if you are developing a library*. That's because if multiple library authors all define their own custom levels, there is a chance that the logging output from such multiple libraries used together will be difficult for the using developer to control and/or interpret, because a given numeric value might mean different things for different libraries.
fr: La définition de vos propres niveaux est possible, mais ne devrait pas être nécessaire, car les niveaux existants ont été choisis par expérience. Cependant, si vous êtes convaincu que vous avez besoin de niveaux personnalisés, prenez grand soin à leur réalisation et il est pratiquement certain que c’est *une très mauvaise idée de définir des niveaux personnalisés si vous développez une bibliothèque*. Car si plusieurs auteurs de bibliothèque définissent tous leurs propres niveaux personnalisés, il y a une chance que la sortie de journalisation de ces multiples bibliothèques utilisées ensemble sera difficile pour le développeur à utiliser pour contrôler et/ou interpréter, car une valeur numérique donnée peut signifier des choses différentes pour différentes bibliothèques.

source: Useful Handlers
fr: Gestionnaires utiles

source: In addition to the base :class:`Handler` class, many useful subclasses are provided:
fr: En plus de la classe de base :class:`Handler`, de nombreuses sous-classes utiles sont fournies :

source: :class:`StreamHandler` instances send messages to streams (file-like objects).
fr: Les instances :class:`StreamHandler` envoient des messages aux flux (objets de type fichier).

source: :class:`FileHandler` instances send messages to disk files.
fr: Les instances :class:`FileHandler` envoient des messages à des fichiers sur le disque.

source: :class:`~handlers.BaseRotatingHandler` is the base class for handlers that rotate log files at a certain point. It is not meant to be instantiated directly. Instead, use :class:`~handlers.RotatingFileHandler` or :class:`~handlers.TimedRotatingFileHandler`.
fr: :class:`~handlers.BaseRotatingHandler` est la classe de base pour les gestionnaires qui assurent la rotation des fichiers de journalisation à partir d’un certain point. Elle n'est pas destinée à être instanciée directement. Utilisez plutôt :class:`~handlers.RotatingFileHandler` ou :class:`~handlers.TimedRotatingFileHandler`.

source: :class:`~handlers.RotatingFileHandler` instances send messages to disk files, with support for maximum log file sizes and log file rotation.
fr: Les instances :class:`~handlers.RotatingFileHandler` envoient des messages à des fichiers sur le disque, avec la prise en charge des tailles maximales de fichiers de journalisation et de la rotation des fichiers de journalisation.

source: :class:`~handlers.TimedRotatingFileHandler` instances send messages to disk files, rotating the log file at certain timed intervals.
fr: Les instances de :class:`~handlers.TimedRotatingFileHandler` envoient des messages aux fichiers de disque, en permutant le fichier journal à intervalles réguliers.

source: :class:`~handlers.SocketHandler` instances send messages to TCP/IP sockets. Since 3.4, Unix domain sockets are also supported.
fr: Les instances de :class:`~handlers.SocketHandler` envoient des messages aux connecteurs TCP/IP. Depuis 3.4, les connecteurs UNIX sont également pris en charge.

source: :class:`~handlers.DatagramHandler` instances send messages to UDP sockets. Since 3.4, Unix domain sockets are also supported.
fr: Les instances de :class:`~handlers.DatagramHandler` envoient des messages aux connecteurs UDP. Depuis 3.4, les connecteurs UNIX sont également pris en charge.

source: :class:`~handlers.SMTPHandler` instances send messages to a designated email address.
fr: Les instances de :class:`~handlers.SMTPHandler` envoient des messages à une adresse e-mail désignée.

source: :class:`~handlers.SysLogHandler` instances send messages to a Unix syslog daemon, possibly on a remote machine.
fr: Les instances de :class:`~handlers.SysLogHandler` envoient des messages à un *daemon* *syslog* UNIX, éventuellement sur un ordinateur distant.

source: :class:`~handlers.NTEventLogHandler` instances send messages to a Windows NT/2000/XP event log.
fr: Les instances de :class:`~handlers.NTEventLogHandler` envoient des messages à un journal des événements Windows NT/2000/XP.

source: :class:`~handlers.MemoryHandler` instances send messages to a buffer in memory, which is flushed whenever specific criteria are met.
fr: Les instances de :class:`~handlers.MemoryHandler` envoient des messages à un tampon en mémoire, qui est vidé chaque fois que des critères spécifiques sont remplis.

source: :class:`~handlers.HTTPHandler` instances send messages to an HTTP server using either ``GET`` or ``POST`` semantics.
fr: Les instances de :class:`~handlers.HTTPHandler` envoient des messages à un serveur HTTP à l'aide de la sémantique ``GET`` ou ``POST``.

source: :class:`~handlers.WatchedFileHandler` instances watch the file they are logging to. If the file changes, it is closed and reopened using the file name. This handler is only useful on Unix-like systems; Windows does not support the underlying mechanism used.
fr: Les instances de :class:`~handlers.WatchedFileHandler` surveillent le fichier sur lequel elles se connectent. Si le fichier change, il est fermé et rouvert à l'aide du nom de fichier. Ce gestionnaire n'est utile que sur les systèmes de type UNIX ; Windows ne prend pas en charge le mécanisme sous-jacent utilisé.

source: :class:`~handlers.QueueHandler` instances send messages to a queue, such as those implemented in the :mod:`queue` or :mod:`multiprocessing` modules.
fr: Les instances de :class:`~handlers.QueueHandler` envoient des messages à une file d'attente, telles que celles implémentées dans les modules :mod:`queue` ou :mod:`multiprocessing`.

source: :class:`NullHandler` instances do nothing with error messages. They are used by library developers who want to use logging, but want to avoid the 'No handlers could be found for logger XXX' message which can be displayed if the library user has not configured logging. See :ref:`library-config` for more information.
fr: Les instances :class:`NullHandler` ne font rien avec les messages d'erreur. Ils sont utilisés par les développeurs de bibliothèques qui veulent utiliser la journalisation, mais qui veulent éviter les messages de type *No handlers could be found for logger XXX*, affiché si celui qui utilise la bibliothèque n'a pas configuré la journalisation. Voir :ref:`library-config` pour plus d'informations.

source: The :class:`NullHandler` class.
fr: La classe :class:`NullHandler`.

source: The :class:`~handlers.QueueHandler` class.
fr: La classe :class:`~handlers.QueueHandler`.
