Repository: python/python-docs-fr
Catalog: howto/logging.po
Languages: fr

source: By default, no destination is set for any logging messages. You can specify a destination (such as console or file) by using :func:`basicConfig` as in the tutorial examples. If you call the functions :func:`debug`, :func:`info`, :func:`warning`, :func:`error` and :func:`critical`, they will check to see if no destination is set; and if one is not set, they will set a destination of the console (``sys.stderr``) and a default format for the displayed message before delegating to the root logger to do the actual message output.
fr: Par défaut, aucune destination n'est prédéfinie pour les messages de journalisation. Vous pouvez définir une destination (comme la console ou un fichier) en utilisant :func:`basicConfig` comme dans les exemples donnés dans le tutoriel. Si vous appelez les fonctions :func:`debug`, :func:`info`, :func:`warning`, :func:`error` et :func:`critical`, celles-ci vérifient si une destination a été définie ; si ce n'est pas le cas, la destination est assignée à la console (``sys.stderr``) avec un format par défaut pour le message affiché, avant d'être déléguée au *logger* racine, qui sort le message.

source: The default format set by :func:`basicConfig` for messages is:
fr: Le format par défaut des messages est défini par :func:`basicConfig` comme suit ::

source: You can change this by passing a format string to :func:`basicConfig` with the *format* keyword argument. For all options regarding how a format string is constructed, see :ref:`formatter-objects`.
fr: Vous pouvez modifier ce comportement en passant une chaîne de formatage à :func:`basicConfig` par l'argument nommé *format*. Consultez :ref:`formatter-objects` pour toutes les options de construction de cette chaîne de formatage.

source: Logging Flow
fr: Flux du processus de journalisation

source: The flow of log event information in loggers and handlers is illustrated in the following diagram.
fr: Le flux des informations associées à un évènement dans les `loggers` et les `handlers` est illustré dans le diagramme suivant.

source: :class:`Logger` objects have a threefold job. First, they expose several methods to application code so that applications can log messages at runtime. Second, logger objects determine which log messages to act upon based upon severity (the default filtering facility) or filter objects. Third, logger objects pass along relevant log messages to all interested log handlers.
fr: Les objets de classe :class:`Logger` ont un rôle triple. Premièrement, ils exposent plusieurs méthodes au code de l'application, de manière à ce qu'elle puisse enregistrer des messages en cours d'exécution. Deuxièmement, les objets `logger` déterminent sur quel message agir selon leur sévérité (à partir des filtres par défaut) ou selon les objets `filter` associés. Troisièmement, les objets `logger` transmettent les messages pertinents à tous les `handlers` concernés.

source: The most widely used methods on logger objects fall into two categories: configuration and message sending.
fr: Les méthodes des objets `logger` les plus utilisées appartiennent à deux catégories : la configuration et l'envoi de messages.

source: These are the most common configuration methods:
fr: Voici les méthodes de configuration les plus communes :

source: :meth:`Logger.setLevel` specifies the lowest-severity log message a logger will handle, where debug is the lowest built-in severity level and critical is the highest built-in severity. For example, if the severity level is INFO, the logger will handle only INFO, WARNING, ERROR, and CRITICAL messages and will ignore DEBUG messages.
fr: :meth:`Logger.setLevel` spécifie le plus bas niveau de sévérité qu'un `logger` traitera. Ainsi, `debug` est le niveau de sévérité défini par défaut le plus bas et `critical` est le plus haut. Par exemple, si le niveau de sévérité est INFO, le `logger` ne traite que les messages de niveau INFO, WARNING, ERROR et CRITICAL ; il ignore les messages de niveau DEBUG.

source: :meth:`Logger.addHandler` and :meth:`Logger.removeHandler` add and remove handler objects from the logger object. Handlers are covered in more detail in :ref:`handler-basic`.
fr: :meth:`Logger.addHandler` et :meth:`Logger.removeHandler` ajoutent ou enlèvent des objets `handlers` au `logger`. Les objets `handlers` sont expliqués plus en détail dans :ref:`handler-basic`.

source: :meth:`Logger.addFilter` and :meth:`Logger.removeFilter` add and remove filter objects from the logger object. Filters are covered in more detail in :ref:`filter`.
fr: :meth:`Logger.addFilter` et :meth:`Logger.removeFilter` ajoutent ou enlèvent des objets `filter` au `logger`. Les objets `filters` sont expliqués plus en détail dans :ref:`filter`.

source: You don't need to always call these methods on every logger you create. See the last two paragraphs in this section.
fr: Comme nous l'expliquons aux deux derniers paragraphes de cette section, vous n'avez pas besoin de faire appel à ces méthodes à chaque fois que vous créez un `logger`.

source: With the logger object configured, the following methods create log messages:
fr: Une fois que l'objet `logger` est correctement configuré, les méthodes suivantes permettent de créer un message :

source: :meth:`Logger.debug`, :meth:`Logger.info`, :meth:`Logger.warning`, :meth:`Logger.error`, and :meth:`Logger.critical` all create log records with a message and a level that corresponds to their respective method names. The message is actually a format string, which may contain the standard string substitution syntax of ``%s``, ``%d``, ``%f``, and so on. The rest of their arguments is a list of objects that correspond with the substitution fields in the message. With regard to ``**kwargs``, the logging methods care only about a keyword of ``exc_info`` and use it to determine whether to log exception information.
fr: Les méthodes :meth:`Logger.debug`, :meth:`Logger.info`, :meth:`Logger.warning`, :meth:`Logger.error` et :meth:`Logger.critical` créent des entrées de journal avec un message et un niveau correspondant à leur nom. Le message est en fait une chaîne de caractères qui peut contenir la syntaxe standard de substitution de chaînes de caractères : ``%s``, ``%d``, ``%f``, etc. L'argument suivant est une liste des objets correspondant aux champs à substituer dans le message. En ce qui concerne ``**kwargs``, les méthodes de `logging` ne tiennent compte que du mot clef ``exc_info`` et l'utilisent pour déterminer s'il faut enregistrer les informations associées à une exception.

source: :meth:`Logger.exception` creates a log message similar to :meth:`Logger.error`. The difference is that :meth:`Logger.exception` dumps a stack trace along with it. Call this method only from an exception handler.
fr: :meth:`Logger.exception` crée un message similaire à :meth:`Logger.error`. La différence est que :meth:`Logger.exception` ajoute la trace de la pile d'exécution au message. On ne peut appeler cette méthode qu'à l'intérieur d'un bloc de gestion d'exception.

source: :meth:`Logger.log` takes a log level as an explicit argument. This is a little more verbose for logging messages than using the log level convenience methods listed above, but this is how to log at custom log levels.
fr: :meth:`Logger.log` prend le niveau de sévérité comme argument explicite. C'est un peu plus verbeux pour enregistrer des messages que d'utiliser les méthodes plus pratiques décrites si dessus, mais c'est ce qui permet d'enregistrer des messages pour des niveaux de sévérité définis par l'utilisateur.

source: :func:`getLogger` returns a reference to a logger instance with the specified name if it is provided, or ``root`` if not. The names are period-separated hierarchical structures. Multiple calls to :func:`getLogger` with the same name will return a reference to the same logger object. Loggers that are further down in the hierarchical list are children of loggers higher up in the list. For example, given a logger with a name of ``foo``, loggers with names of ``foo.bar``, ``foo.bar.baz``, and ``foo.bam`` are all descendants of ``foo``.
fr: :func:`getLogger` renvoie une référence à un objet `logger` du nom spécifié si celui-ci est donné en argument. Dans le cas contraire, se sera le `logger root`. Ces noms sont des structures hiérarchiques séparées par des points. Des appels répétés à :func:`getLogger` avec le même nom renvoient une référence au même objet `logger`. Les `loggers` qui sont plus bas dans cette liste hiérarchique sont des enfants des `loggers` plus haut dans la liste. Par exemple, si un `logger` a le nom ``foo``, les `loggers` avec les noms ``foo.bar``, ``foo.bar.baz``, et ``foo.bam`` sont tous des descendants de ``foo``.

source: Loggers have a concept of *effective level*. If a level is not explicitly set on a logger, the level of its parent is used instead as its effective level. If the parent has no explicit level set, *its* parent is examined, and so on - all ancestors are searched until an explicitly set level is found. The root logger always has an explicit level set (``WARNING`` by default). When deciding whether to process an event, the effective level of the logger is used to determine whether the event is passed to the logger's handlers.
fr: On associe aux `loggers` un concept de *niveau effectif*. Si aucun niveau n'est explicitement défini pour un `logger`, c'est le niveau du parent qui est utilisé comme niveau effectif. Si le parent n'a pas de niveau défini, c'est celui de *son* parent qui est considéré, et ainsi de suite ; on examine tous les ancêtres jusqu'à ce qu'un niveau explicite soit trouvé. Le `logger root` a toujours un niveau explicite (``WARNING`` par défaut). Quand le `logger` traite un événement, c'est ce niveau effectif qui est utilisé pour déterminer si cet événement est transmis à ses `handlers`.

source: Child loggers propagate messages up to the handlers associated with their ancestor loggers. Because of this, it is unnecessary to define and configure handlers for all the loggers an application uses. It is sufficient to configure handlers for a top-level logger and create child loggers as needed. (You can, however, turn off propagation by setting the *propagate* attribute of a logger to ``False``.)
fr: Les `loggers` fils font remonter leurs messages aux `handlers` associés à leurs `loggers` parents. De ce fait, il n'est pas nécessaire de définir et configurer des `handlers` pour tous les `loggers` employés par une application. Il suffit de configurer les `handlers` pour un `logger` de haut niveau et de créer des `loggers` fils quand c'est nécessaire (on peut cependant empêcher la propagation aux ancêtres des messages en donnant la valeur ``False`` à l'attribut *propagate* d'un `logger`).

source: :class:`~logging.Handler` objects are responsible for dispatching the appropriate log messages (based on the log messages' severity) to the handler's specified destination. :class:`Logger` objects can add zero or more handler objects to themselves with an :meth:`~Logger.addHandler` method. As an example scenario, an application may want to send all log messages to a log file, all log messages of error or higher to stdout, and all messages of critical to an email address. This scenario requires three individual handlers where each handler is responsible for sending messages of a specific severity to a specific location.
fr: Les objets de type :class:`~logging.Handler` sont responsables de la distribution des messages (selon leur niveau de sévérité) vers les destinations spécifiées pour ce `handler`. Les objets :class:`Logger` peuvent ajouter des objets `handler` à eux-mêmes en appelant :meth:`~Logger.addHandler`. Pour donner un exemple, une application peut envoyer tous les messages dans un fichier journal, tous les messages de niveau `error` ou supérieur vers la sortie standard, et tous les messages de niveau `critical` vers une adresse de courriel. Dans ce scenario, nous avons besoin de trois `handlers`, responsable chacun d'envoyer des messages d'une sévérité donnée vers une destination donnée.

source: The standard library includes quite a few handler types (see :ref:`useful-handlers`); the tutorials use mainly :class:`StreamHandler` and :class:`FileHandler` in its examples.
fr: La bibliothèque standard inclut déjà un bon nombre de types de gestionnaires (voir :ref:`useful-handlers`) ; le tutoriel utilise surtout :class:`StreamHandler` et :class:`FileHandler` dans ses exemples.

source: There are very few methods in a handler for application developers to concern themselves with. The only handler methods that seem relevant for application developers who are using the built-in handler objects (that is, not creating custom handlers) are the following configuration methods:
fr: Peu de méthodes des objets `handlers` sont intéressantes pour les développeurs. Les seules méthodes intéressantes lorsqu'on utilise les objets `handlers` natifs (c'est à dire si l'on ne crée pas d'`handler` personnalisé) sont les méthodes de configuration suivantes :

source: The :meth:`~Handler.setLevel` method, just as in logger objects, specifies the lowest severity that will be dispatched to the appropriate destination. Why are there two :func:`setLevel` methods? The level set in the logger determines which severity of messages it will pass to its handlers. The level set in each handler determines which messages that handler will send on.
fr: La méthode :meth:`~Handler.setLevel`, comme celle des objets `logger` permet de spécifier le plus bas niveau de sévérité qui sera distribué à la destination appropriée. Pourquoi y a-t-il deux méthodes :func:`setLevel` ? Le niveau défini dans le `logger` détermine quelle sévérité doit avoir un message pour être transmis à ses `handlers`. Le niveau mis pour chaque `handler` détermine quels messages seront envoyés aux destinations.

source: :meth:`~Handler.setFormatter` selects a Formatter object for this handler to use.
fr: :meth:`~Handler.setFormatter` sélectionne l'objet `Formatter` utilisé par cet `handler`.

source: :meth:`~Handler.addFilter` and :meth:`~Handler.removeFilter` respectively configure and deconfigure filter objects on handlers.
fr: :meth:`~Handler.addFilter` et :meth:`~Handler.removeFilter` configurent et respectivement dé-configurent des objets `filter` sur les `handlers`.

source: Application code should not directly instantiate and use instances of :class:`Handler`. Instead, the :class:`Handler` class is a base class that defines the interface that all handlers should have and establishes some default behavior that child classes can use (or override).
fr: Le code d'une application ne devrait ni instancier, ni utiliser d'instances de la classe :class:`Handler`. La classe :class:`Handler` est plutôt d'une classe de base qui définit l'interface que tous les gestionnaires doivent avoir et établit les comportements par défaut que les classes filles peuvent employer (ou redéfinir).

source: Formatter objects configure the final order, structure, and contents of the log message. Unlike the base :class:`logging.Handler` class, application code may instantiate formatter classes, although you could likely subclass the formatter if your application needs special behavior. The constructor takes three optional arguments -- a message format string, a date format string and a style indicator.
fr: Les objets `formatter` configurent l'ordre final, la structure et le contenu du message. Contrairement à la classe de base :class:`logging.Handler`, le code d'une application peut instancier un objet de classe `formatter`, même si vous pouvez toujours sous-classer `formatter` si vous avez besoin d'un comportement spécial dans votre application. Le constructeur a trois arguments optionnels : une chaîne de formatage du message, un chaîne de formatage de la date et un indicateur de style.

source: If there is no message format string, the default is to use the raw message. If there is no date format string, the default date format is:
fr: S'il n'y a pas de chaîne de formatage, la chaîne brute est utilisée par défaut. S'il n'y a pas de chaîne de formatage de date, le format de date par défaut est :

source: with the milliseconds tacked on at the end. The ``style`` is one of `%`, '{' or '$'. If one of these is not specified, then '%' will be used.
fr: avec les millisecondes en suffixe. Le ``style`` est `%`, `{` ou `$`. Si aucun n'est spécifié, `%` sera utilisé.

source: If the ``style`` is '%', the message format string uses ``%(<dictionary key>)s`` styled string substitution; the possible keys are documented in :ref:`logrecord-attributes`. If the style is '{', the message format string is assumed to be compatible with :meth:`str.format` (using keyword arguments), while if the style is '$' then the message format string should conform to what is expected by :meth:`string.Template.substitute`.
fr: Si l'argument ``style`` est `%`, la chaîne de formatage utilise ``%(<clef de dictionnaire>)s`` comme style de substitution de chaîne de caractères ; les clefs possibles sont documentées dans :ref:`logrecord-attributes`. Si le style est `{`, le message de la chaîne de formatage est compatible avec :meth:`str.format` (en employant des arguments à mots clefs). Enfin si le style est `$` alors la chaîne de formatage du message doit être conforme à ce qui est attendu de :meth:`string.Template.substitute`.

source: Added the ``style`` parameter.
fr: Ajout du paramètre ``style``.

source: The following message format string will log the time in a human-readable format, the severity of the message, and the contents of the message, in that order::
fr: La chaîne de formatage de message suivante enregistrera le temps dans un format lisible par les humains, la sévérité du message et son contenu, dans cet ordre ::

source: Formatters use a user-configurable function to convert the creation time of a record to a tuple. By default, :func:`time.localtime` is used; to change this for a particular formatter instance, set the ``converter`` attribute of the instance to a function with the same signature as :func:`time.localtime` or :func:`time.gmtime`. To change it for all formatters, for example if you want all logging times to be shown in GMT, set the ``converter`` attribute in the Formatter class (to ``time.gmtime`` for GMT display).
fr: Les `formatters` emploient une fonction configurable par l'utilisateur pour convertir le temps de création d'une entrée de journal en un tuple. Par défaut, :func:`time.localtime` est employé ; pour changer cela pour une instance particulière de `formatter`, assignez une fonction avec la même signature que :func:`time.localtime` ou :func:`time.gmtime` à l'attribut ``converter`` de cette instance. Pour changer cela pour tous les `formatters`, par exemple si vous voulez que tous votre horodatage soit affiché en GMT, changez l'attribut ``converter`` de la classe ``Formatter`` en ``time.gmtime``.

source: Configuring Logging
fr: Configuration de `Logging`

source: Programmers can configure logging in three ways:
fr: On peut configurer `logging` de trois façons :

source: Creating loggers, handlers, and formatters explicitly using Python code that calls the configuration methods listed above.
fr: Créer des `loggers`, `handlers` et `formatters` explicitement en utilisant du code Python qui appelle les méthodes de configuration listées ci-dessus.

source: Creating a logging config file and reading it using the :func:`fileConfig` function.
fr: Créer un fichier de configuration de `logging` et le lire en employant la fonction :func:`fileConfig`.

source: Creating a dictionary of configuration information and passing it to the :func:`dictConfig` function.
fr: Créer un dictionnaire d'informations de configuration et le passer à la fonction :func:`dictConfig`.

source: For the reference documentation on the last two options, see :ref:`logging-config-api`. The following example configures a very simple logger, a console handler, and a simple formatter using Python code::
fr: Pour la documentation de référence de ces deux dernières options, voyez :ref:`logging-config-api`. L'exemple suivant configure un `logger` très simple, un `handler` employant la console, et un `formatter` simple en utilisant du code Python ::

source: Running this module from the command line produces the following output:
fr: L'exécution de ce module via la ligne de commande produit la sortie suivante :

source: The following Python module creates a logger, handler, and formatter nearly identical to those in the example listed above, with the only difference being the names of the objects::
fr: Le module Python suivant crée un *logger*, un *handler* et un *formatter* identiques à ceux de l'exemple détaillé au-dessus, au nom des objets près ::

source: Here is the logging.conf file:
fr: Voici le fichier *logging.conf* :

source: The output is nearly identical to that of the non-config-file-based example:
fr: La sortie est presque identique à celle de l'exemple qui n'est pas basé sur un fichier de configuration :

source: You can see that the config file approach has a few advantages over the Python code approach, mainly separation of configuration and code and the ability of noncoders to easily modify the logging properties.
fr: Vous pouvez constatez les avantages de l'approche par fichier de configuration par rapport à celle du code Python, principalement la séparation de la configuration et du code, et la possibilité pour une personne qui ne code pas de modifier facilement les propriétés de `logging`.

source: The :func:`fileConfig` function takes a default parameter, ``disable_existing_loggers``, which defaults to ``True`` for reasons of backward compatibility. This may or may not be what you want, since it will cause any non-root loggers existing before the :func:`fileConfig` call to be disabled unless they (or an ancestor) are explicitly named in the configuration. Please refer to the reference documentation for more information, and specify ``False`` for this parameter if you wish.
fr: La fonction :func:`fileConfig` accepte un paramètre par défaut ``disable_existing_loggers``, qui vaut ``True`` par défaut pour des raisons de compatibilité ascendante. Ce n'est pas forcément ce que vous souhaitez : en effet, tous les *loggers* créés avant l'appel à :func:`fileConfig` seront désactivés sauf si eux-mêmes (ou l'un de leurs parents) sont explicitement nommés dans le fichier de configuration. Veuillez vous rapporter à la documentation pour plus de détails, et donner la valeur ``False`` à ce paramètre si vous le souhaitez.

source: The dictionary passed to :func:`dictConfig` can also specify a Boolean value with key ``disable_existing_loggers``, which if not specified explicitly in the dictionary also defaults to being interpreted as ``True``. This leads to the logger-disabling behaviour described above, which may not be what you want - in which case, provide the key explicitly with a value of ``False``.
fr: Le dictionnaire passé à :func:`dictConfig` peut aussi spécifier une valeur Booléenne pour la clef ``disable_existing_loggers``. Si cette valeur n'est pas donnée, elle est interprétée comme vraie par défaut. Cela conduit au comportement de désactivation des *loggers* décrit ci-dessus, qui n'est pas forcément celui que vous souhaitez ; dans ce cas, donnez explicitement la valeur ``False`` à cette clef.
