Repository: python/python-docs-fr
Catalog: howto/logging-cookbook.po
Languages: fr

source: at module level). It's probably one too many things to think about. Developers could also add the filter to a :class:`~logging.NullHandler` attached to their top-level logger, but this would not be invoked if an application developer attached a handler to a lower-level library logger --- so output from that handler would not reflect the intentions of the library developer.
fr: au niveau des modules). C’est probablement trop de choses auxquelles penser. Les développeurs pourraient également ajouter le filtre à un :class:`~logging.NullHandler` attaché à leur enregistreur de niveau supérieur, mais cela ne serait pas invoqué si un développeur d’application attachait un gestionnaire à un enregistreur de bibliothèque de niveau inférieur — donc la sortie de ce gestionnaire ne refléterait pas les intentions du développeur de la bibliothèque.

source: In Python 3.2 and later, :class:`~logging.LogRecord` creation is done through a factory, which you can specify. The factory is just a callable you can set with :func:`~logging.setLogRecordFactory`, and interrogate with :func:`~logging.getLogRecordFactory`. The factory is invoked with the same signature as the :class:`~logging.LogRecord` constructor, as :class:`LogRecord` is the default setting for the factory.
fr: Dans Python 3.2 et ultérieurs, la création de :class:`~logging.LogRecord` est effectuée via une fabrique, que vous pouvez spécifier. La fabrique est juste un appelable que vous pouvez définir avec :func:`~logging.setLogRecordFactory`, et interroger avec :func:`~logging.getLogRecordFactory`. La fabrique est invoquée avec la même signature que le constructeur :class:`~logging.LogRecord`, car :class:`LogRecord` est le paramètre par défaut de la fabrique.

source: This approach allows a custom factory to control all aspects of LogRecord creation. For example, you could return a subclass, or just add some additional attributes to the record once created, using a pattern similar to this::
fr: Cette approche permet à une fabrique personnalisée de contrôler tous les aspects de la création d’un *LogRecord*. Par exemple, vous pouvez renvoyer une sous-classe ou simplement ajouter des attributs supplémentaires à l’enregistrement une fois créé, en utilisant un modèle similaire à celui-ci :

source: This pattern allows different libraries to chain factories together, and as long as they don't overwrite each other's attributes or unintentionally overwrite the attributes provided as standard, there should be no surprises. However, it should be borne in mind that each link in the chain adds run-time overhead to all logging operations, and the technique should only be used when the use of a :class:`Filter` does not provide the desired result.
fr: Ce modèle permet à différentes bibliothèques d’enchaîner des fabriques, et tant qu’elles n’écrasent pas les attributs des autres ou n’écrasent pas involontairement les attributs fournis en standard, il ne devrait pas y avoir de surprise. Cependant, il faut garder à l’esprit que chaque maillon de la chaîne ajoute une surcharge d’exécution à toutes les opérations de journalisation, et la technique ne doit être utilisée que lorsque l’utilisation d’un :class:`Filter` ne permet pas d’obtenir le résultat souhaité.

source: Subclassing QueueHandler - a ZeroMQ example
fr: Dérivation de *QueueHandler* – un exemple de *ZeroMQ*

source: You can use a :class:`QueueHandler` subclass to send messages to other kinds of queues, for example a ZeroMQ 'publish' socket. In the example below,the socket is created separately and passed to the handler (as its 'queue')::
fr: Vous pouvez utiliser une sous-classe :class:`QueueHandler` pour envoyer des messages à d’autres types de files d’attente, par exemple un connecteur *ZeroMQ publish*. Dans l’exemple ci-dessous, le connecteur est créé séparément et transmis au gestionnaire (en tant que file d’attente) ::

source: Of course there are other ways of organizing this, for example passing in the data needed by the handler to create the socket::
fr: Bien sûr, il existe d’autres manières de faire, par exemple en transmettant les données nécessaires au gestionnaire pour créer le connecteur ::

source: Subclassing QueueListener - a ZeroMQ example
fr: Dérivation de *QueueListener* – un exemple de *ZeroMQ*

source: You can also subclass :class:`QueueListener` to get messages from other kinds of queues, for example a ZeroMQ 'subscribe' socket. Here's an example::
fr: Vous pouvez également dériver :class:`QueueListener` pour obtenir des messages d’autres types de files d’attente, par exemple un connecteur *ZeroMQ subscribe*. Voici un exemple ::

source: API reference for the logging module.
fr: Référence d'API pour le module de journalisation.

source: Configuration API for the logging module.
fr: API de configuration pour le module de journalisation.

source: Useful handlers included with the logging module.
fr: Gestionnaires utiles inclus avec le module de journalisation.

source: :ref:`A basic logging tutorial <logging-basic-tutorial>`
fr: :ref:`Les bases de l’utilisation du module de journalisation <logging-basic-tutorial>`

source: :ref:`A more advanced logging tutorial <logging-advanced-tutorial>`
fr: :ref:`Utilisation avancée du module de journalisation <logging-advanced-tutorial>`

source: An example dictionary-based configuration
fr: Exemple de configuration basée sur un dictionnaire

source: Below is an example of a logging configuration dictionary - it's taken from the `documentation on the Django project <https://docs.djangoproject.com/en/stable/topics/logging/#configuring-logging>`_. This dictionary is passed to :func:`~config.dictConfig` to put the configuration into effect::
fr: Vous trouverez ci-dessous un exemple de dictionnaire de configuration de journalisation ­– il est tiré de la `documentation du projet Django <https://docs.djangoproject.com/fr/stable/topics/logging/#configuring-logging>`_. Ce dictionnaire est passé à :func:`~config.dictConfig` pour activer la configuration ::

source: For more information about this configuration, you can see the `relevant section <https://docs.djangoproject.com/en/stable/topics/logging/#configuring-logging>`_ of the Django documentation.
fr: Pour plus d’informations sur cette configuration, vous pouvez consulter la `section correspondante <https://docs.djangoproject.com/fr/stable/topics/logging/#configuring-logging>`_ de la documentation de *Django*.

source: Using a rotator and namer to customize log rotation processing
fr: Utilisation d’un rotateur et d’un nom pour personnaliser la rotation des journaux

source: A more elaborate multiprocessing example
fr: Exemple plus élaboré avec traitement en parallèle

source: The following working example shows how logging can be used with multiprocessing using configuration files. The configurations are fairly simple, but serve to illustrate how more complex ones could be implemented in a real multiprocessing scenario.
fr: L’exemple suivant que nous allons étudier montre comment la journalisation peut être utilisée, à l’aide de fichiers de configuration, pour un programme effectuant des traitements parallèles. Les configurations sont assez simples, mais servent à illustrer comment des configurations plus complexes pourraient être implémentées dans un scénario multi-processus réel.

source: In the example, the main process spawns a listener process and some worker processes. Each of the main process, the listener and the workers have three separate configurations (the workers all share the same configuration). We can see logging in the main process, how the workers log to a QueueHandler and how the listener implements a QueueListener and a more complex logging configuration, and arranges to dispatch events received via the queue to the handlers specified in the configuration. Note that these configurations are purely illustrative, but you should be able to adapt this example to your own scenario.
fr: Dans l’exemple, le processus principal génère un processus d’écoute et des processus de travail. Chacun des processus, le principal, l’auditeur (*listener_process* dans l’exemple) et les processus de travail (*worker_process* dans l’exemple) ont trois configurations distinctes (les processus de travail partagent tous la même configuration). Nous pouvons voir la journalisation dans le processus principal, comment les processus de travail se connectent à un *QueueHandler* et comment l’auditeur implémente un *QueueListener* avec une configuration de journalisation plus complexe, et s’arrange pour envoyer les événements reçus *via* la file d’attente aux gestionnaires spécifiés dans la configuration. Notez que ces configurations sont purement illustratives, mais vous devriez pouvoir adapter cet exemple à votre propre scénario.

source: Here's the script - the docstrings and the comments hopefully explain how it works::
fr: Voici le script – les chaines de documentation et les commentaires expliquent (en anglais), le principe de fonctionnement ::

source: Inserting a BOM into messages sent to a SysLogHandler
fr: Insertion d’une *BOM* dans les messages envoyés à un *SysLogHandler*

source: :rfc:`5424` requires that a Unicode message be sent to a syslog daemon as a set of bytes which have the following structure: an optional pure-ASCII component, followed by a UTF-8 Byte Order Mark (BOM), followed by Unicode encoded using UTF-8. (See the :rfc:`relevant section of the specification <5424#section-6>`.)
fr: La :rfc:`5424` requiert qu’un message Unicode soit envoyé à un démon *syslog* sous la forme d’un ensemble d’octets ayant la structure suivante : un composant ASCII pur facultatif, suivi d’une marque d’ordre d’octet (*BOM* pour *Byte Order Mark* en anglais) UTF-8, suivie de contenu Unicode UTF-8 (voir la :rfc:`la spécification correspondante <5424#section-6>`).

source: In Python 3.1, code was added to :class:`~logging.handlers.SysLogHandler` to insert a BOM into the message, but unfortunately, it was implemented incorrectly, with the BOM appearing at the beginning of the message and hence not allowing any pure-ASCII component to appear before it.
fr: Dans Python 3.1, du code a été ajouté à :class:`~logging.handlers.SysLogHandler` pour insérer une *BOM* dans le message mais, malheureusement, il a été implémenté de manière incorrecte, la *BOM* apparaissant au début du message et n’autorisant donc aucun composant ASCII pur à être placé devant.

source: As this behaviour is broken, the incorrect BOM insertion code is being removed from Python 3.2.4 and later. However, it is not being replaced, and if you want to produce :rfc:`5424`-compliant messages which include a BOM, an optional pure-ASCII sequence before it and arbitrary Unicode after it, encoded using UTF-8, then you need to do the following:
fr: Comme ce comportement est inadéquat, le code incorrect d’insertion de la *BOM* a été supprimé de Python 3.2.4 et ultérieurs. Cependant, il n’est pas remplacé et, si vous voulez produire des messages conformes :rfc:`5424` qui incluent une *BOM*, une séquence facultative en ASCII pur avant et un Unicode arbitraire après, encodé en UTF-8, alors vous devez appliquer ce qui suit :

source: Attach a :class:`~logging.Formatter` instance to your :class:`~logging.handlers.SysLogHandler` instance, with a format string such as::
fr: Adjoignez une instance :class:`~logging.Formatter` à votre instance :class:`~logging.handlers.SysLogHandler`, avec une chaîne de format telle que ::

source: The Unicode code point U+FEFF, when encoded using UTF-8, will be encoded as a UTF-8 BOM -- the byte-string ``b'\xef\xbb\xbf'``.
fr: Le point de code Unicode U+FEFF, lorsqu’il est encodé en UTF-8, est encodé comme une *BOM* UTF-8 – la chaîne d’octets ``b'\xef\xbb\xbf'``.

source: Replace the ASCII section with whatever placeholders you like, but make sure that the data that appears in there after substitution is always ASCII (that way, it will remain unchanged after UTF-8 encoding).
fr: Remplacez la section ASCII par les caractères de votre choix, mais assurez-vous que les données qui y apparaissent après la substitution sont toujours ASCII (ainsi elles resteront inchangées après l’encodage UTF-8).

source: Replace the Unicode section with whatever placeholders you like; if the data which appears there after substitution contains characters outside the ASCII range, that's fine -- it will be encoded using UTF-8.
fr: Remplacez la section Unicode par le contenu de votre choix ; si les données qui y apparaissent après la substitution contiennent des caractères en dehors de la plage ASCII, c’est pris en charge – elles seront encodées en UTF-8.

source: The formatted message *will* be encoded using UTF-8 encoding by ``SysLogHandler``. If you follow the above rules, you should be able to produce :rfc:`5424`-compliant messages. If you don't, logging may not complain, but your messages will not be RFC 5424-compliant, and your syslog daemon may complain.
fr: Le message formaté *sera* encodé en UTF-8 par ``SysLogHandler``. Si vous suivez les règles ci-dessus, vous devriez pouvoir produire des messages conformes à la :rfc:`5424`. Si vous ne le faites pas, la journalisation ne se plaindra peut-être pas, mais vos messages ne seront pas conformes à la RFC 5424 et votre démon *syslog* est susceptible de se plaindre.

source: Implementing structured logging
fr: Journalisation structurée

source: Although most logging messages are intended for reading by humans, and thus not readily machine-parseable, there might be circumstances where you want to output messages in a structured format which *is* capable of being parsed by a program (without needing complex regular expressions to parse the log message). This is straightforward to achieve using the logging package. There are a number of ways in which this could be achieved, but the following is a simple approach which uses JSON to serialise the event in a machine-parseable manner::
fr: Bien que la plupart des messages de journalisation soient destinés à être lus par des humains, et donc difficilement analysables par la machine, il peut arriver que vous souhaitiez produire des messages dans un format structuré dans le but d’être analysé par un programme (sans avoir besoin d’expressions régulières complexes pour analyser le message du journal). C’est simple à réaliser en utilisant le paquet de journalisation. Il existe plusieurs façons d’y parvenir et voici une approche simple qui utilise JSON pour sérialiser l’événement de manière à être analysable par une machine ::

source: If the above script is run, it prints:
fr: Si vous lancez le script ci-dessus, il imprime :

source: Note that the order of items might be different according to the version of Python used.
fr: Notez que l’ordre des éléments peut être différent en fonction de la version de Python utilisée.

source: If you need more specialised processing, you can use a custom JSON encoder, as in the following complete example::
fr: Si vous avez besoin d’un traitement plus spécifique, vous pouvez utiliser un encodeur JSON personnalisé, comme dans l’exemple complet suivant :

source: When the above script is run, it prints:
fr: Quand vous exécutez le script ci-dessus, il imprime :

source: Customizing handlers with :func:`dictConfig`
fr: Personnalisation des gestionnaires avec :func:`dictConfig`

source: There are times when you want to customize logging handlers in particular ways, and if you use :func:`dictConfig` you may be able to do this without subclassing. As an example, consider that you may want to set the ownership of a log file. On POSIX, this is easily done using :func:`shutil.chown`, but the file handlers in the stdlib don't offer built-in support. You can customize handler creation using a plain function such as::
fr: Il arrive de souhaiter personnaliser les gestionnaires de journalisation d’une manière particulière et, en utilisant :func:`dictConfig`, vous pourrez peut-être le faire sans avoir à dériver les classes mères. Par exemple, supposons que vous souhaitiez définir le propriétaire d’un fichier journal. Dans un environnement POSIX, cela se fait facilement en utilisant :func:`shutil.chown`, mais les gestionnaires de fichiers de la bibliothèque standard n’offrent pas cette gestion nativement. Vous pouvez personnaliser la création du gestionnaire à l’aide d’une fonction simple telle que ::

source: You can then specify, in a logging configuration passed to :func:`dictConfig`, that a logging handler be created by calling this function::
fr: Vous pouvez ensuite spécifier, dans une configuration de journalisation transmise à :func:`dictConfig`, qu’un gestionnaire de journalisation soit créé en appelant cette fonction ::

source: In this example I am setting the ownership using the ``pulse`` user and group, just for the purposes of illustration. Putting it together into a working script, ``chowntest.py``::
fr: Dans cet exemple, nous définissons le propriétaire à l’utilisateur et au groupe ``pulse``, uniquement à des fins d’illustration. Rassemblons le tout dans un script ``chowntest.py`` ::

source: To run this, you will probably need to run as ``root``:
fr: Pour l’exécuter, vous devrez probablement le faire en tant que ``root`` :

source: Note that this example uses Python 3.3 because that's where :func:`shutil.chown` makes an appearance. This approach should work with any Python version that supports :func:`dictConfig` - namely, Python 2.7, 3.2 or later. With pre-3.3 versions, you would need to implement the actual ownership change using e.g. :func:`os.chown`.
fr: Notez que cet exemple utilise Python 3.3 car c’est là que :func:`shutil.chown` fait son apparition. Cette approche devrait fonctionner avec n’importe quelle version de Python prenant en charge :func:`dictConfig` – à savoir, Python 2.7, 3.2 ou version ultérieure. Avec les versions antérieures à la 3.3, vous devrez implémenter le changement de propriétaire réel en utilisant par exemple :func:`os.chown`.

source: In practice, the handler-creating function may be in a utility module somewhere in your project. Instead of the line in the configuration::
fr: En pratique, la fonction de création de gestionnaire peut être située dans un module utilitaire ailleurs dans votre projet. Au lieu de cette ligne dans la configuration ::

source: you could use e.g.::
fr: vous pouvez écrire par exemple ::

source: where ``project.util`` can be replaced with the actual name of the package where the function resides. In the above working script, using ``'ext://__main__.owned_file_handler'`` should work. Here, the actual callable is resolved by :func:`dictConfig` from the ``ext://`` specification.
fr: où ``project.util`` peut être remplacé par le nom réel du paquet où réside la fonction. Dans le script étudié ci-dessus, l’utilisation de ``'ext://__main__.owned_file_handler'`` devrait fonctionner. Dans le cas présent, l’appelable réel est résolu par :func:`dictConfig` à partir de la spécification ``ext://``.

source: This example hopefully also points the way to how you could implement other types of file change - e.g. setting specific POSIX permission bits - in the same way, using :func:`os.chmod`.
fr: Nous espérons qu'à partir de cet exemple vous saurez implémenter d’autres types de modification de fichier – par ex. définir des bits d’autorisation POSIX spécifiques – de la même manière, en utilisant :func:`os.chmod`.

source: Of course, the approach could also be extended to types of handler other than a :class:`~logging.FileHandler` - for example, one of the rotating file handlers, or a different type of handler altogether.
fr: Bien sûr, l’approche pourrait également être étendue à des types de gestionnaires autres qu’un :class:`~logging.FileHandler` – par exemple, l’un des gestionnaires à roulement de fichiers ou un autre type de gestionnaire complètement différent.
