Repository: python/python-docs-fr
Catalog: howto/logging-cookbook.po
Languages: fr

source: Logging Cookbook
fr: Recettes pour la journalisation

source: Author
fr: Auteur

source: Using logging in multiple modules
fr: Journalisation dans plusieurs modules

source: Multiple calls to ``logging.getLogger('someLogger')`` return a reference to the same logger object. This is true not only within the same module, but also across modules as long as it is in the same Python interpreter process. It is true for references to the same object; additionally, application code can define and configure a parent logger in one module and create (but not configure) a child logger in a separate module, and all logger calls to the child will pass up to the parent. Here is a main module::
fr: Deux appels à ``logging.getLogger('unLogger')`` renvoient toujours une référence vers le même objet de journalisation. C’est valable à l’intérieur d’un module, mais aussi dans des modules différents pour autant que ce soit le même processus de l’interpréteur Python. En plus, le code d’une application peut définir et configurer une journalisation parente dans un module et créer (mais pas configurer) une journalisation fille dans un module séparé. Les appels à la journalisation fille passeront alors à la journalisation parente. Voici un module principal ::

source: Here is the auxiliary module::
fr: Voici un module auxiliaire ::

source: The output looks like this:
fr: La sortie ressemble à ceci ::

source: Logging from multiple threads
fr: Journalisation avec des fils d’exécution multiples

source: Logging from multiple threads requires no special effort. The following example shows logging from the main (initial) thread and another thread::
fr: La journalisation avec des fils d’exécution multiples ne requiert pas d’effort particulier. L’exemple suivant montre comment journaliser depuis le fil principal (c.-à-d. initial) et un autre fil ::

source: When run, the script should print something like the following:
fr: À l’exécution, le script doit afficher quelque chose comme ça ::

source: This shows the logging output interspersed as one might expect. This approach works for more threads than shown here, of course.
fr: Les entrées de journalisation sont entrelacées, comme on pouvait s’y attendre. Cette approche fonctionne aussi avec plus de fils que dans l’exemple, bien sûr.

source: Multiple handlers and formatters
fr: Plusieurs gestionnaires et formateurs

source: Loggers are plain Python objects. The :meth:`~Logger.addHandler` method has no minimum or maximum quota for the number of handlers you may add. Sometimes it will be beneficial for an application to log all messages of all severities to a text file while simultaneously logging errors or above to the console. To set this up, simply configure the appropriate handlers. The logging calls in the application code will remain unchanged. Here is a slight modification to the previous simple module-based configuration example::
fr: Les gestionnaires de journalisation sont des objets Python ordinaires. La méthode :meth:`~Logger.addHandler` n’est pas limitée, en nombre minimum ou maximum, en gestionnaires que vous pouvez ajouter. Parfois, il peut être utile pour une application de journaliser tous les messages quels que soient leurs niveaux vers un fichier texte, tout en journalisant les erreurs (et plus grave) dans la console. Pour ce faire, configurez simplement les gestionnaires de manière adéquate. Les appels de journalisation dans le code de l’application resteront les mêmes. Voici une légère modification de l’exemple précédent dans une configuration au niveau du module ::

source: Notice that the 'application' code does not care about multiple handlers. All that changed was the addition and configuration of a new handler named *fh*.
fr: Notez que le code de « l’application » ignore la multiplicité des gestionnaires. Les modifications consistent simplement en l’ajout et la configuration d’un nouveau gestionnaire appelé *fh*.

source: The ability to create new handlers with higher- or lower-severity filters can be very helpful when writing and testing an application. Instead of using many ``print`` statements for debugging, use ``logger.debug``: Unlike the print statements, which you will have to delete or comment out later, the logger.debug statements can remain intact in the source code and remain dormant until you need them again. At that time, the only change that needs to happen is to modify the severity level of the logger and/or handler to debug.
fr: La possibilité de créer de nouveaux gestionnaires avec des filtres sur un niveau de gravité supérieur ou inférieur peut être très utile lors de l’écriture ou du test d’une application. Au lieu d’utiliser de nombreuses instructions ``print`` pour le débogage, utilisez ``logger.debug`` : contrairement aux instructions ``print``, que vous devrez supprimer ou commenter plus tard, les instructions ``logger.debug`` peuvent demeurer telles quelles dans le code source et restent dormantes jusqu’à ce que vous en ayez à nouveau besoin. À ce moment-là, il suffit de modifier le niveau de gravité de la journalisation ou du gestionnaire pour déboguer.

source: Logging to multiple destinations
fr: Journalisation vers plusieurs destinations

source: Let's say you want to log to console and file with different message formats and in differing circumstances. Say you want to log messages with levels of DEBUG and higher to file, and those messages at level INFO and higher to the console. Let's also assume that the file should contain timestamps, but the console messages should not. Here's how you can achieve this::
fr: Supposons que vous souhaitiez journaliser dans la console et dans un fichier avec différents formats de messages et avec différents critères. Supposons que vous souhaitiez consigner les messages de niveau DEBUG et supérieur dans le fichier, et les messages de niveau INFO et supérieur dans la console. Supposons également que le fichier doive contenir des horodatages, mais pas les messages de la console. Voici comment y parvenir ::

source: When you run this, on the console you will see
fr: Quand vous le lancez, vous devez voir

source: and in the file you will see something like
fr: et, dans le fichier, vous devez trouver

source: As you can see, the DEBUG message only shows up in the file. The other messages are sent to both destinations.
fr: Comme vous pouvez le constater, le message DEBUG n’apparaît que dans le fichier. Les autres messages sont envoyés vers les deux destinations.

source: This example uses console and file handlers, but you can use any number and combination of handlers you choose.
fr: Cet exemple utilise la console et des gestionnaires de fichier, mais vous pouvez utiliser et combiner autant de gestionnaires que de besoin.

source: Configuration server example
fr: Exemple d’un serveur de configuration

source: Here is an example of a module using the logging configuration server::
fr: Voici un exemple de module mettant en œuvre la configuration de la journalisation *via* un serveur ::

source: And here is a script that takes a filename and sends that file to the server, properly preceded with the binary-encoded length, as the new logging configuration::
fr: Et voici un script qui, à partir d’un nom de fichier, commence par envoyer la taille du fichier encodée en binaire (comme il se doit), puis envoie ce fichier au serveur pour définir la nouvelle configuration de journalisation ::

source: Dealing with handlers that block
fr: Utilisation de gestionnaires bloquants

source: A common culprit which demonstrates sluggish behaviour is the :class:`SMTPHandler`: sending emails can take a long time, for a number of reasons outside the developer's control (for example, a poorly performing mail or network infrastructure). But almost any network-based handler can block: Even a :class:`SocketHandler` operation may do a DNS query under the hood which is too slow (and this query can be deep in the socket library code, below the Python layer, and outside your control).
fr: Un gestionnaire classiquement lent est le :class:`SMTPHandler` : l’envoi d’e-mails peut prendre beaucoup de temps, pour un certain nombre de raisons indépendantes du développeur (par exemple, une infrastructure de messagerie ou de réseau peu performante). Mais n’importe quel autre gestionnaire utilisant le réseau ou presque peut aussi s’avérer bloquant : même une simple opération :class:`SocketHandler` peut faire une requête DNS implicite et être ainsi très lente (cette requête peut être enfouie profondément dans le code de la bibliothèque d’accès réseau, sous la couche Python, et hors de votre contrôle).

source: One solution is to use a two-part approach. For the first part, attach only a :class:`QueueHandler` to those loggers which are accessed from performance-critical threads. They simply write to their queue, which can be sized to a large enough capacity or initialized with no upper bound to their size. The write to the queue will typically be accepted quickly, though you will probably need to catch the :exc:`queue.Full` exception as a precaution in your code. If you are a library developer who has performance-critical threads in their code, be sure to document this (together with a suggestion to attach only ``QueueHandlers`` to your loggers) for the benefit of other developers who will use your code.
fr: Une solution consiste à utiliser une approche en deux parties. Pour la première partie, affectez un seul :class:`QueueHandler` à la journalisation des fils d’exécution critiques pour les performances. Ils écrivent simplement dans leur file d’attente, qui peut être dimensionnée à une capacité suffisamment grande ou initialisée sans limite supérieure en taille. L’écriture dans la file d’attente est généralement acceptée rapidement, mais nous vous conseillons quand même de prévoir d’intercepter l’exception :exc:`queue.Full` par précaution dans votre code. Si vous développez une bibliothèque avec des fils d’exécution critiques pour les performances, documentez-le bien (avec une suggestion de n’affecter que des ``QueueHandlers`` à votre journalisation) pour faciliter le travail des développeurs qui utilisent votre code.

source: The second part of the solution is :class:`QueueListener`, which has been designed as the counterpart to :class:`QueueHandler`. A :class:`QueueListener` is very simple: it's passed a queue and some handlers, and it fires up an internal thread which listens to its queue for LogRecords sent from ``QueueHandlers`` (or any other source of ``LogRecords``, for that matter). The ``LogRecords`` are removed from the queue and passed to the handlers for processing.
fr: La deuxième partie de la solution est la classe :class:`QueueListener`, conçue comme l’homologue de :class:`QueueHandler`. Un :class:`QueueListener` est très simple : vous lui passez une file d’attente et des gestionnaires, et il lance un fil d’exécution interne qui scrute la file d’attente pour récupérer les événements envoyés par les ``QueueHandlers`` (ou toute autre source de ``LogRecords``, d’ailleurs). Les ``LogRecords`` sont supprimés de la file d’attente et transmis aux gestionnaires pour traitement.

source: The advantage of having a separate :class:`QueueListener` class is that you can use the same instance to service multiple ``QueueHandlers``. This is more resource-friendly than, say, having threaded versions of the existing handler classes, which would eat up one thread per handler for no particular benefit.
fr: L’avantage d’avoir une classe :class:`QueueListener` séparée est que vous pouvez utiliser la même instance pour servir plusieurs ``QueueHandlers``. Cela consomme moins de ressources que des instances de gestionnaires réparties chacune dans un fil d’exécution séparé.

source: An example of using these two classes follows (imports omitted)::
fr: Voici un exemple d’utilisation de ces deux classes (les importations sont omises) ::

source: which, when run, will produce:
fr: ce qui produit ceci à l’exécution :

source: Prior to Python 3.5, the :class:`QueueListener` always passed every message received from the queue to every handler it was initialized with. (This was because it was assumed that level filtering was all done on the other side, where the queue is filled.) From 3.5 onwards, this behaviour can be changed by passing a keyword argument ``respect_handler_level=True`` to the listener's constructor. When this is done, the listener compares the level of each message with the handler's level, and only passes a message to a handler if it's appropriate to do so.
fr: avant Python 3.5, la classe :class:`QueueListener` passait chaque message reçu de la file d’attente à chaque gestionnaire avec lequel l’instance avait été initialisée (on supposait que le filtrage de niveau était entièrement effectué de l’autre côté, au niveau de l’alimentation de la file d’attente). Depuis Python 3.5, le comportement peut être modifié en passant l’argument par mot-clé ``respect_handler_level=True`` au constructeur. Dans ce cas, la ``QueueListener`` compare le niveau de chaque message avec le niveau défini dans chaque gestionnaire et ne transmet le message que si c’est opportun.

source: Sending and receiving logging events across a network
fr: Envoi et réception d’événements de journalisation à travers le réseau

source: Let's say you want to send logging events across a network, and handle them at the receiving end. A simple way of doing this is attaching a :class:`SocketHandler` instance to the root logger at the sending end::
fr: Supposons que vous souhaitiez envoyer des événements de journalisation sur un réseau et les traiter à la réception. Une façon simple de faire est d’attacher une instance :class:`SocketHandler` à la journalisation racine de l’émetteur ::

source: At the receiving end, you can set up a receiver using the :mod:`socketserver` module. Here is a basic working example::
fr: Vous pouvez configurer le récepteur en utilisant le module :mod:`socketserver`. Voici un exemple élémentaire ::

source: First run the server, and then the client. On the client side, nothing is printed on the console; on the server side, you should see something like:
fr: Lancez d’abord le serveur, puis le client. Côté client, rien ne s’affiche sur la console ; côté serveur, vous devez voir quelque chose comme ça :

source: Note that there are some security issues with pickle in some scenarios. If these affect you, you can use an alternative serialization scheme by overriding the :meth:`~handlers.SocketHandler.makePickle` method and implementing your alternative there, as well as adapting the above script to use your alternative serialization.
fr: Notez que ``pickle`` introduit des problèmes de sécurité dans certains scénarios. Si vous êtes concerné, vous pouvez utiliser une sérialisation alternative en surchargeant la méthode :meth:`~handlers.SocketHandler.makePickle` par votre propre implémentation, ainsi qu’en adaptant le script ci-dessus pour utiliser votre sérialisation.

source: Adding contextual information to your logging output
fr: Ajout d’informations contextuelles dans la journalisation

source: Sometimes you want logging output to contain contextual information in addition to the parameters passed to the logging call. For example, in a networked application, it may be desirable to log client-specific information in the log (e.g. remote client's username, or IP address). Although you could use the *extra* parameter to achieve this, it's not always convenient to pass the information in this way. While it might be tempting to create :class:`Logger` instances on a per-connection basis, this is not a good idea because these instances are not garbage collected. While this is not a problem in practice, when the number of :class:`Logger` instances is dependent on the level of granularity you want to use in logging an application, it could be hard to manage if the number of :class:`Logger` instances becomes effectively unbounded.
fr: Dans certains cas, vous pouvez souhaiter que la journalisation contienne des informations contextuelles en plus des paramètres transmis à l’appel de journalisation. Par exemple, dans une application réseau, il peut être souhaitable de consigner des informations spécifiques au client dans le journal (par exemple, le nom d’utilisateur ou l’adresse IP du client distant). Bien que vous puissiez utiliser le paramètre *extra* pour y parvenir, il n’est pas toujours pratique de transmettre les informations de cette manière. Il peut être aussi tentant de créer des instances :class:`Logger` connexion par connexion, mais ce n’est pas une bonne idée car ces instances :class:`Logger` ne sont pas éliminées par le ramasse-miettes. Même si ce point n’est pas problématique en soi si la journalisation est configurée avec plusieurs niveaux de granularité, cela peut devenir difficile de gérer un nombre potentiellement illimité d’instances de :class:`Logger`.

source: Using LoggerAdapters to impart contextual information
fr: Utilisation d’adaptateurs de journalisation pour transmettre des informations contextuelles

source: An easy way in which you can pass contextual information to be output along with logging event information is to use the :class:`LoggerAdapter` class. This class is designed to look like a :class:`Logger`, so that you can call :meth:`debug`, :meth:`info`, :meth:`warning`, :meth:`error`, :meth:`exception`, :meth:`critical` and :meth:`log`. These methods have the same signatures as their counterparts in :class:`Logger`, so you can use the two types of instances interchangeably.
fr: Un moyen simple de transmettre des informations contextuelles accompagnant les informations de journalisation consiste à utiliser la classe :class:`LoggerAdapter`. Cette classe est conçue pour ressembler à un :class:`Logger`, de sorte que vous pouvez appeler :meth:`debug`, :meth:`info`, :meth:`warning`, :meth:`error`, :meth:`exception`, :meth:`critical` et :meth:`log`. Ces méthodes ont les mêmes signatures que leurs homologues dans :class:`Logger`, vous pouvez donc utiliser les deux types d’instances de manière interchangeable.

source: When you create an instance of :class:`LoggerAdapter`, you pass it a :class:`Logger` instance and a dict-like object which contains your contextual information. When you call one of the logging methods on an instance of :class:`LoggerAdapter`, it delegates the call to the underlying instance of :class:`Logger` passed to its constructor, and arranges to pass the contextual information in the delegated call. Here's a snippet from the code of :class:`LoggerAdapter`::
fr: Lorsque vous créez une instance de :class:`LoggerAdapter`, vous lui transmettez une instance de :class:`Logger` et un objet dictionnaire qui contient vos informations contextuelles. Lorsque vous appelez l’une des méthodes de journalisation sur une instance de :class:`LoggerAdapter`, elle délègue l’appel à l’instance sous-jacente de :class:`Logger` transmise à son constructeur et s’arrange pour intégrer les informations contextuelles dans l’appel délégué. Voici un extrait du code de :class:`LoggerAdapter` ::

source: The :meth:`~LoggerAdapter.process` method of :class:`LoggerAdapter` is where the contextual information is added to the logging output. It's passed the message and keyword arguments of the logging call, and it passes back (potentially) modified versions of these to use in the call to the underlying logger. The default implementation of this method leaves the message alone, but inserts an 'extra' key in the keyword argument whose value is the dict-like object passed to the constructor. Of course, if you had passed an 'extra' keyword argument in the call to the adapter, it will be silently overwritten.
fr: Les informations contextuelles sont ajoutées dans la méthode :meth:`~LoggerAdapter.process` de :class:`LoggerAdapter`. On lui passe le message et les arguments par mot-clé de l’appel de journalisation, et elle en renvoie des versions (potentiellement) modifiées à utiliser pour la journalisation sous-jacente. L’implémentation par défaut de cette méthode laisse le message seul, mais insère une clé ``extra`` dans l’argument par mot-clé dont la valeur est l’objet dictionnaire passé au constructeur. Bien sûr, si vous avez passé un argument par mot-clé ``extra`` dans l’appel à l’adaptateur, il est écrasé silencieusement.

source: The advantage of using 'extra' is that the values in the dict-like object are merged into the :class:`LogRecord` instance's __dict__, allowing you to use customized strings with your :class:`Formatter` instances which know about the keys of the dict-like object. If you need a different method, e.g. if you want to prepend or append the contextual information to the message string, you just need to subclass :class:`LoggerAdapter` and override :meth:`~LoggerAdapter.process` to do what you need. Here is a simple example::
fr: L’avantage d’utiliser ``extra`` est que les valeurs de l’objet dictionnaire sont fusionnées dans le ``__dict__`` de l’instance :class:`LogRecord`, ce qui vous permet d’utiliser des chaînes personnalisées avec vos instances :class:`Formatter` qui connaissent les clés de l’objet dictionnaire. Si vous avez besoin d’une méthode différente, par exemple si vous souhaitez ajouter des informations contextuelles avant ou après la chaîne de message, il vous suffit de surcharger :class:`LoggerAdapter` et de remplacer :meth:`~LoggerAdapter.process` pour faire ce dont vous avez besoin. Voici un exemple simple ::

source: which you can use like this::
fr: que vous pouvez utiliser comme ceci ::

source: Then any events that you log to the adapter will have the value of ``some_conn_id`` prepended to the log messages.
fr: Ainsi, tout événement journalisé aura la valeur de ``some_conn_id`` insérée en début de message de journalisation.

source: Using objects other than dicts to pass contextual information
fr: Utilisation d’objets autres que les dictionnaires pour passer des informations contextuelles

source: You don't need to pass an actual dict to a :class:`LoggerAdapter` - you could pass an instance of a class which implements ``__getitem__`` and ``__iter__`` so that it looks like a dict to logging. This would be useful if you want to generate values dynamically (whereas the values in a dict would be constant).
fr: Il n’est pas obligatoire de passer un dictionnaire réel à un :class:`LoggerAdapter`, vous pouvez passer une instance d’une classe qui implémente ``__getitem__`` et ``__iter__`` pour qu’il ressemble à un dictionnaire du point de vue de la journalisation. C’est utile si vous souhaitez générer des valeurs de manière dynamique (alors que les valeurs d’un dictionnaire seraient constantes).

source: Using Filters to impart contextual information
fr: Utilisation de filtres pour transmettre des informations contextuelles

source: You can also add contextual information to log output using a user-defined :class:`Filter`. ``Filter`` instances are allowed to modify the ``LogRecords`` passed to them, including adding additional attributes which can then be output using a suitable format string, or if needed a custom :class:`Formatter`.
fr: Un :class:`Filter` défini par l’utilisateur peut aussi ajouter des informations contextuelles à la journalisation. Les instances de ``Filter`` sont autorisées à modifier les ``LogRecords`` qui leur sont transmis, y compris par l’ajout d’attributs supplémentaires qui peuvent ensuite être intégrés à la journalisation en utilisant une chaîne de formatage appropriée ou, si nécessaire, un :class:`Formatter` personnalisé.
