Repository: python/python-docs-fr
Catalog: howto/logging.po
Languages: fr

source: Logging HOWTO
fr: Tutoriel sur la journalisation

source: Author
fr: Auteur

source: Basic Logging Tutorial
fr: Les bases de l'utilisation du module `logging`

source: Logging is a means of tracking events that happen when some software runs. The software's developer adds logging calls to their code to indicate that certain events have occurred. An event is described by a descriptive message which can optionally contain variable data (i.e. data that is potentially different for each occurrence of the event). Events also have an importance which the developer ascribes to the event; the importance can also be called the *level* or *severity*.
fr: La journalisation (*logging* en anglais) est une façon de suivre les événements qui ont lieu durant le fonctionnement d'un logiciel. Le développeur du logiciel ajoute des appels à l'outil de journalisation dans son code pour indiquer que certains événements ont eu lieu. Un événement est décrit par un message descriptif, qui peut éventuellement contenir des données variables (c'est-à-dire qui peuvent être différentes pour chaque occurrence de l'événement). Un événement a aussi une importance que le développeur lui attribue ; cette importance peut aussi être appelée *niveau* ou *sévérité*.

source: When to use logging
fr: Quand utiliser `logging`

source: Logging provides a set of convenience functions for simple logging usage. These are :func:`debug`, :func:`info`, :func:`warning`, :func:`error` and :func:`critical`. To determine when to use logging, see the table below, which states, for each of a set of common tasks, the best tool to use for it.
fr: Le module *logging* fournit un ensemble de fonctions de commodités pour une utilisation simple du module. Ce sont les fonctions :func:`debug`, :func:`info`, :func:`warning`, :func:`error` et :func:`critical`. Pour déterminer quand employer la journalisation, voyez la table ci-dessous, qui vous indique, pour chaque tâche parmi les plus communes, l'outil approprié.

source: Task you want to perform
fr: Tâche que vous souhaitez mener

source: The best tool for the task
fr: Le meilleur outil pour cette tâche

source: Display console output for ordinary usage of a command line script or program
fr: Affiche la sortie console d'un script en ligne de commande ou d'un programme lors de son utilisation ordinaire

source: Report events that occur during normal operation of a program (e.g. for status monitoring or fault investigation)
fr: Rapporter des évènements qui ont lieu au cours du fonctionnement normal d'un programme (par exemple pour suivre un statut ou examiner des dysfonctionnements)

source: :func:`logging.info` (or :func:`logging.debug` for very detailed output for diagnostic purposes)
fr: :func:`logging.info` (ou :func:`logging.debug` pour une sortie très détaillée à visée diagnostique)

source: Issue a warning regarding a particular runtime event
fr: Émettre un avertissement (*warning* en anglais) en relation avec un évènement particulier au cours du fonctionnement d’un programme

source: :func:`warnings.warn` in library code if the issue is avoidable and the client application should be modified to eliminate the warning
fr: :func:`warnings.warn` dans le code de la bibliothèque si le problème est évitable et l'application cliente doit être modifiée pour éliminer cet avertissement

source: :func:`logging.warning` if there is nothing the client application can do about the situation, but the event should still be noted
fr: :func:`logging.warning` si l'application cliente ne peut rien faire pour corriger la situation mais l'évènement devrait quand même être noté

source: Report an error regarding a particular runtime event
fr: Rapporter une erreur lors d'un évènement particulier en cours d'exécution

source: Raise an exception
fr: Lever une exception

source: Report suppression of an error without raising an exception (e.g. error handler in a long-running server process)
fr: Rapporter la suppression d'une erreur sans lever d'exception (par exemple pour la gestion d'erreur d'un processus de long terme sur un serveur)

source: :func:`logging.error`, :func:`logging.exception` or :func:`logging.critical` as appropriate for the specific error and application domain
fr: :func:`logging.error`, :func:`logging.exception` ou :func:`logging.critical`, au mieux, selon l'erreur spécifique et le domaine d'application

source: The logging functions are named after the level or severity of the events they are used to track. The standard levels and their applicability are described below (in increasing order of severity):
fr: Les fonctions de journalisation sont nommées d'après le niveau ou la sévérité des évènements qu'elles suivent. Les niveaux standards et leurs applications sont décrits ci-dessous (par ordre croissant de sévérité) :

source: Level
fr: Niveau

source: When it's used
fr: Quand il est utilisé

source: Detailed information, typically of interest only when diagnosing problems.
fr: Information détaillée, intéressante seulement lorsqu'on diagnostique un problème.

source: Confirmation that things are working as expected.
fr: Confirmation que tout fonctionne comme prévu.

source: An indication that something unexpected happened, or indicative of some problem in the near future (e.g. 'disk space low'). The software is still working as expected.
fr: L'indication que quelque chose d'inattendu a eu lieu, ou de la possibilité d'un problème dans un futur proche (par exemple « espace disque faible »). Le logiciel fonctionne encore normalement.

source: Due to a more serious problem, the software has not been able to perform some function.
fr: Du fait d'un problème plus sérieux, le logiciel n'a pas été capable de réaliser une tâche.

source: A serious error, indicating that the program itself may be unable to continue running.
fr: Une erreur sérieuse, indiquant que le programme lui-même pourrait être incapable de continuer à fonctionner.

source: The default level is ``WARNING``, which means that only events of this level and above will be tracked, unless the logging package is configured to do otherwise.
fr: Le niveau par défaut est ``WARNING``, ce qui signifie que seuls les évènements de ce niveau et au-dessus sont suivis, sauf si le paquet *logging* est configuré pour faire autrement.

source: Events that are tracked can be handled in different ways. The simplest way of handling tracked events is to print them to the console. Another common way is to write them to a disk file.
fr: Les évènements suivis peuvent être gérés de différentes façons. La manière la plus simple est de les afficher dans la console. Une autre méthode commune est de les écrire dans un fichier.

source: A simple example
fr: Un exemple simple

source: A very simple example is::
fr: Un exemple très simple est ::

source: If you type these lines into a script and run it, you'll see:
fr: Si vous entrez ces lignes dans un script que vous exécutez, vous verrez :

source: printed out on the console. The ``INFO`` message doesn't appear because the default level is ``WARNING``. The printed message includes the indication of the level and the description of the event provided in the logging call, i.e. 'Watch out!'. Don't worry about the 'root' part for now: it will be explained later. The actual output can be formatted quite flexibly if you need that; formatting options will also be explained later.
fr: affiché dans la console. Le message ``INFO`` n'apparaît pas parce que le niveau par défaut est ``WARNING``. Le message affiché inclut l'indication du niveau et la description de l'évènement fournie dans l'appel à *logging*, ici « Watch out! ». Ne vous préoccupez pas de la partie « *root* » pour le moment : nous détaillerons ce point plus bas. La sortie elle-même peut être formatée de multiples manières si besoin. Les options de formatage seront aussi expliquées plus bas.

source: Logging to a file
fr: Enregistrer les évènements dans un fichier

source: A very common situation is that of recording logging events in a file, so let's look at that next. Be sure to try the following in a newly-started Python interpreter, and don't just continue from the session described above::
fr: Il est très commun d'enregistrer les évènements dans un fichier, c'est donc ce que nous allons regarder maintenant. Il faut essayer ce qui suit avec un interpréteur Python nouvellement démarré, ne poursuivez pas la session commencée ci-dessus ::

source: And now if we open the file and look at what we have, we should find the log messages:
fr: Maintenant, si nous ouvrons le fichier et lisons ce qui s'y trouve, on trouvera les messages de log :

source: This example also shows how you can set the logging level which acts as the threshold for tracking. In this case, because we set the threshold to ``DEBUG``, all of the messages were printed.
fr: Cet exemple montre aussi comment on peut régler le niveau de journalisation qui sert de seuil pour le suivi. Dans ce cas, comme nous avons réglé le seuil à ``DEBUG``, tous les messages ont été écrits.

source: If you want to set the logging level from a command-line option such as:
fr: Si vous souhaitez régler le niveau de journalisation à partir d'une option de la ligne de commande comme :

source: and you have the value of the parameter passed for ``--log`` in some variable *loglevel*, you can use::
fr: et que vous passez ensuite la valeur du paramètre donné à l'option `--log` dans une variable *loglevel*, vous pouvez utiliser ::

source: to get the value which you'll pass to :func:`basicConfig` via the *level* argument. You may want to error check any user input value, perhaps as in the following example::
fr: de manière à obtenir la valeur à passer à :func:`basicConfig` à travers l'argument *level*. Vous pouvez vérifier que l'utilisateur n'a fait aucune erreur pour la valeur de ce paramètre, comme dans l'exemple ci-dessous ::

source: The call to :func:`basicConfig` should come *before* any calls to :func:`debug`, :func:`info` etc. As it's intended as a one-off simple configuration facility, only the first call will actually do anything: subsequent calls are effectively no-ops.
fr: L'appel à :func:`basicConfig` doit être fait *avant* un appel à :func:`debug`, :func:`info`, etc. Comme l'objectif est d'avoir un outil de configuration simple et d'usage unique, seul le premier appel aura un effet, les appels suivants ne font rien.

source: If you run the above script several times, the messages from successive runs are appended to the file *example.log*. If you want each run to start afresh, not remembering the messages from earlier runs, you can specify the *filemode* argument, by changing the call in the above example to::
fr: Si vous exécutez le script plusieurs fois, les messages des exécutions successives sont ajoutés au fichier *example.log*. Si vous voulez que chaque exécution reprenne un fichier vierge, sans conserver les messages des exécutions précédentes, vous pouvez spécifier l'argument *filemode*, en changeant l'appel à l'exemple précédent par ::

source: The output will be the same as before, but the log file is no longer appended to, so the messages from earlier runs are lost.
fr: La sortie est identique à la précédente, mais le texte n'est plus ajouté au fichier de log, donc les messages des exécutions précédentes sont perdus.

source: Logging from multiple modules
fr: Employer *logging* à partir de différents modules

source: If your program consists of multiple modules, here's an example of how you could organize logging in it::
fr: Si votre programme est composé de plusieurs modules, voici une façon d'organiser l'outil de journalisation ::

source: If you run *myapp.py*, you should see this in *myapp.log*:
fr: Si vous exécutez *myapp.py*, vous verrez ceci dans *myapp.log* :

source: which is hopefully what you were expecting to see. You can generalize this to multiple modules, using the pattern in *mylib.py*. Note that for this simple usage pattern, you won't know, by looking in the log file, *where* in your application your messages came from, apart from looking at the event description. If you want to track the location of your messages, you'll need to refer to the documentation beyond the tutorial level -- see :ref:`logging-advanced-tutorial`.
fr: ce qui est normalement ce à quoi vous vous attendiez. Vous pouvez généraliser cela à plusieurs modules, en employant le motif de *mylib.py*. Remarquez qu'avec cette méthode simple, vous ne pourrez pas savoir, en lisant le fichier de log, *d'où* viennent les messages dans votre application, sauf dans la description de l'évènement. Si vous voulez suivre la localisation des messages, référerez-vous à la documentation avancée :ref:`logging-advanced-tutorial`.

source: Logging variable data
fr: Journalisation de données variables

source: To log variable data, use a format string for the event description message and append the variable data as arguments. For example::
fr: Pour enregistrer des données variables, utilisez une chaîne formatée dans le message de description de l'évènement et ajoutez les données variables comme argument. Par exemple ::

source: will display:
fr: affichera :

source: As you can see, merging of variable data into the event description message uses the old, %-style of string formatting. This is for backwards compatibility: the logging package pre-dates newer formatting options such as :meth:`str.format` and :class:`string.Template`. These newer formatting options *are* supported, but exploring them is outside the scope of this tutorial: see :ref:`formatting-styles` for more information.
fr: Comme vous pouvez le voir, l'inclusion des données variables dans le message de description de l'évènement emploie le vieux style de formatage avec %. C'est pour assurer la rétrocompatibilité : le module `logging` est antérieur aux nouvelles options de formatage comme :meth:`str.format` ou :class:`string.Template`. Ces nouvelles options de formatage *sont* gérées, mais leur exploration sort du cadre de ce tutoriel, voyez :ref:`formatting-styles` pour plus d'information.

source: Changing the format of displayed messages
fr: Modifier le format du message affiché

source: To change the format which is used to display messages, you need to specify the format you want to use::
fr: Pour changer le format utilisé pour afficher le message, vous devez préciser le format que vous souhaitez employer ::

source: which would print:
fr: ce qui affiche :

source: Notice that the 'root' which appeared in earlier examples has disappeared. For a full set of things that can appear in format strings, you can refer to the documentation for :ref:`logrecord-attributes`, but for simple usage, you just need the *levelname* (severity), *message* (event description, including variable data) and perhaps to display when the event occurred. This is described in the next section.
fr: Notez que le `root` qui apparaissait dans les exemples précédents a disparu. Pour voir l'ensemble des éléments qui peuvent apparaître dans la chaîne de format, référez-vous à la documentation pour :ref:`logrecord-attributes`. Pour une utilisation simple, vous avez seulement besoin du *levelname* (la sévérité), du *message* (la description de l'évènement, avec les données variables) et peut-être du moment auquel l'évènement a eu lieu. Nous décrivons ces points dans la prochaine section.

source: Displaying the date/time in messages
fr: Afficher l'horodatage dans les messages

source: To display the date and time of an event, you would place '%(asctime)s' in your format string::
fr: Pour afficher la date ou le temps d'un évènement, ajoutez `%(asctime)` dans votre chaîne de formatage ::

source: which should print something like this:
fr: ce qui affichera quelque chose comme :

source: The default format for date/time display (shown above) is like ISO8601 or :rfc:`3339`. If you need more control over the formatting of the date/time, provide a *datefmt* argument to ``basicConfig``, as in this example::
fr: Le format par défaut de l'horodatage (comme ci-dessus) est donné par la norme ISO8601 ou :rfc:`3339`. Pour plus de contrôle sur le formatage de l'horodatage, vous pouvez fournir à ``basicConfig`` un argument *datefmt*, comme dans l'exemple suivant ::

source: which would display something like this:
fr: ce qui affichera quelque chose comme :

source: The format of the *datefmt* argument is the same as supported by :func:`time.strftime`.
fr: Le format de *datefmt* est le même que celui de :func:`time.strftime`.

source: Next Steps
fr: Étapes suivantes

source: That concludes the basic tutorial. It should be enough to get you up and running with logging. There's a lot more that the logging package offers, but to get the best out of it, you'll need to invest a little more of your time in reading the following sections. If you're ready for that, grab some of your favourite beverage and carry on.
fr: Nous concluons ainsi le tutoriel basique. Il devrait suffire à vous mettre le pied à l'étrier pour utiliser `logging`. Le module `logging` a beaucoup d'autre cordes à son arc, mais pour en profiter au maximum, vous devez prendre le temps de lire les sections suivantes. Si vous êtes prêt, servez-vous votre boisson préférée et poursuivons.

source: If your logging needs are simple, then use the above examples to incorporate logging into your own scripts, and if you run into problems or don't understand something, please post a question on the comp.lang.python Usenet group (available at https://groups.google.com/forum/#!forum/comp.lang.python) and you should receive help before too long.
fr: Si vos besoins avec `logging` sont simples, vous pouvez incorporer les exemples ci-dessus dans vos scripts. Si vous rencontrez des difficultés ou s'il y a quelque chose que vous ne comprenez pas, vous pouvez poser une question sur le groupe Usenet `comp.lang.python` (accessible à https://groups.google.com/forum/#!forum/comp.lang.python), on vous répondra rapidement.

source: Still here? You can carry on reading the next few sections, which provide a slightly more advanced/in-depth tutorial than the basic one above. After that, you can take a look at the :ref:`logging-cookbook`.
fr: Vous êtes encore là ? Vous pouvez lire les prochaines sections, qui donnent un peu plus de détails que l'introduction ci-dessus. Après ça, vous pouvez jeter un œil à :ref:`logging-cookbook`.

source: Advanced Logging Tutorial
fr: Usage avancé de Logging

source: The logging library takes a modular approach and offers several categories of components: loggers, handlers, filters, and formatters.
fr: La bibliothèque de journalisation adopte une approche modulaire et offre différentes catégories de composants : *loggers*, *handlers*, *filters* et *formatters*.

source: Loggers expose the interface that application code directly uses.
fr: Les enregistreurs (*loggers* en anglais) exposent l'interface que le code de l'application utilise directement.

source: Handlers send the log records (created by loggers) to the appropriate destination.
fr: Les gestionnaires (*handlers*) envoient les entrées de journal (créés par les *loggers*) vers les destinations voulues.

source: Filters provide a finer grained facility for determining which log records to output.
fr: Les filtres (*filters*) fournissent un moyen de choisir finement quelles entrées de journal doivent être sorties.

source: Formatters specify the layout of log records in the final output.
fr: Les formateurs (*formatters*) spécifient la structure de l'entrée de journal dans la sortie finale.

source: Log event information is passed between loggers, handlers, filters and formatters in a :class:`LogRecord` instance.
fr: L'information relative à un événement est passée entre *loggers*, *handlers* et *formatters* dans une instance de la classe :class:`LogRecord`.

source: Logging is performed by calling methods on instances of the :class:`Logger` class (hereafter called :dfn:`loggers`). Each instance has a name, and they are conceptually arranged in a namespace hierarchy using dots (periods) as separators. For example, a logger named 'scan' is the parent of loggers 'scan.text', 'scan.html' and 'scan.pdf'. Logger names can be anything you want, and indicate the area of an application in which a logged message originates.
fr: La journalisation est réalisée en appelant les méthodes d'instance de la classe :class:`Logger` (que l'on appelle ci-dessous :dfn:`loggers`). Chaque instance a un nom et les instances sont organisées conceptuellement comme des hiérarchies dans l'espace de nommage, en utilisant un point comme séparateur. Par exemple, un `logger` appelé `scan` est le parent des `loggers` `scan.text`, `scan.html` et `scan.pdf`. Les noms des `loggers` peuvent être ce que vous voulez et indiquent le sous-domaine d'une application depuis lequel le message enregistré a été émis.

source: A good convention to use when naming loggers is to use a module-level logger, in each module which uses logging, named as follows::
fr: Une bonne convention lorsqu'on nomme les *loggers* est d'utiliser un *logger* au niveau du module, dans chaque module qui emploie `logging`, nommé de la façon suivante ::

source: This means that logger names track the package/module hierarchy, and it's intuitively obvious where events are logged just from the logger name.
fr: Cela signifie que le nom d'un `logger` se rapporte à la hiérarchie du paquet et des modules, et il est évident de voir où un événement a été enregistré simplement en regardant le nom du `logger`.

source: The root of the hierarchy of loggers is called the root logger. That's the logger used by the functions :func:`debug`, :func:`info`, :func:`warning`, :func:`error` and :func:`critical`, which just call the same-named method of the root logger. The functions and the methods have the same signatures. The root logger's name is printed as 'root' in the logged output.
fr: La racine de la hiérarchie des `loggers` est appelée le *root logger*. C'est le `logger` utilisé par les fonctions :func:`debug`, :func:`info`, :func:`warning`, :func:`error` et :func:`critical`, qui appelle en fait les méthodes du même nom de l'objet *root logger*. Les fonctions et les méthodes ont la même signature. Le nom du *root logger* est affiché comme « `root` » dans la sortie.

source: It is, of course, possible to log messages to different destinations. Support is included in the package for writing log messages to files, HTTP GET/POST locations, email via SMTP, generic sockets, queues, or OS-specific logging mechanisms such as syslog or the Windows NT event log. Destinations are served by :dfn:`handler` classes. You can create your own log destination class if you have special requirements not met by any of the built-in handler classes.
fr: Il est bien sûr possible d'enregistrer des messages pour des destinations différentes. Ce paquet permet d'écrire des entrées de journal dans des fichiers, des ressources HTTP GET/POST, par courriel via SMTP, des connecteurs (*socket* en anglais) génériques, des files d'attente, ou des mécanismes d'enregistrement spécifiques au système d'exploitation, comme *syslog* ou le journal d'événements de Windows NT. Les destinations sont servies par des classes :dfn:`handler`. Vous pouvez créer votre propre classe de destination si vous avez des besoins spéciaux qui ne sont couverts par aucune classe *handler* prédéfinie.
