Repository: python/python-docs-fr
Catalog: howto/logging-cookbook.po
Languages: fr

source: For example in a web application, the request being processed (or at least, the interesting parts of it) can be stored in a threadlocal (:class:`threading.local`) variable, and then accessed from a ``Filter`` to add, say, information from the request - say, the remote IP address and remote user's username - to the ``LogRecord``, using the attribute names 'ip' and 'user' as in the ``LoggerAdapter`` example above. In that case, the same format string can be used to get similar output to that shown above. Here's an example script::
fr: Par exemple, dans une application Web, la requête en cours de traitement (ou du moins ce qu’elle contient d’intéressant) peut être stockée dans une variable locale au fil d’exécution (:class:`threading.local`), puis utilisée dans un ``Filter`` pour ajouter, par exemple, des informations relatives à la requête (par exemple, l’adresse IP distante et le nom de l’utilisateur) au ``LogRecord``, en utilisant les noms d’attribut ``ip`` et ``user`` comme dans l’exemple ``LoggerAdapter`` ci-dessus. Dans ce cas, la même chaîne de formatage peut être utilisée pour obtenir une sortie similaire à celle indiquée ci-dessus. Voici un exemple de script ::

source: which, when run, produces something like:
fr: qui, à l’exécution, produit quelque chose comme ça ::

source: Logging to a single file from multiple processes
fr: Journalisation vers un fichier unique à partir de plusieurs processus

source: Although logging is thread-safe, and logging to a single file from multiple threads in a single process *is* supported, logging to a single file from *multiple processes* is *not* supported, because there is no standard way to serialize access to a single file across multiple processes in Python. If you need to log to a single file from multiple processes, one way of doing this is to have all the processes log to a :class:`~handlers.SocketHandler`, and have a separate process which implements a socket server which reads from the socket and logs to file. (If you prefer, you can dedicate one thread in one of the existing processes to perform this function.) :ref:`This section <network-logging>` documents this approach in more detail and includes a working socket receiver which can be used as a starting point for you to adapt in your own applications.
fr: La journalisation est fiable avec les programmes à fils d’exécution multiples (*thread-safe*) : rien n’empêche plusieurs fils d’exécution de journaliser dans le même fichier, du moment que ces fils d’exécution font partie du même processus. En revanche, il n’existe aucun moyen standard de sérialiser l’accès à un seul fichier sur plusieurs processus en Python. Si vous avez besoin de vous connecter à un seul fichier à partir de plusieurs processus, une façon de le faire est de faire en sorte que tous les processus se connectent à un :class:`~handlers.SocketHandler`, et d’avoir un processus séparé qui implémente un serveur qui lit à partir de ce connecteur et écrit les journaux dans le fichier (si vous préférez, vous pouvez dédier un fil d’exécution dans l’un des processus existants pour exécuter cette tâche). :ref:`Cette section <network-logging>` documente cette approche plus en détail et inclut un connecteur en écoute réseau fonctionnel qui peut être utilisé comme point de départ pour l’adapter à vos propres applications.

source: You could also write your own handler which uses the :class:`~multiprocessing.Lock` class from the :mod:`multiprocessing` module to serialize access to the file from your processes. The existing :class:`FileHandler` and subclasses do not make use of :mod:`multiprocessing` at present, though they may do so in the future. Note that at present, the :mod:`multiprocessing` module does not provide working lock functionality on all platforms (see https://bugs.python.org/issue3770).
fr: Vous pouvez également écrire votre propre gestionnaire en utilisant la classe :class:`~multiprocessing.Lock` du module :mod:`multiprocessing` pour sérialiser l’accès au fichier depuis vos processus. Les actuels :class:`FileHandler` et sous-classes n’utilisent pas :mod:`multiprocessing` pour le moment, même s’ils pourraient le faire à l’avenir. Notez qu’à l’heure actuelle, le module :mod:`multiprocessing` ne fournit pas un verrouillage fonctionnel pour toutes les plates-formes (voir https://bugs.python.org/issue3770).

source: Alternatively, you can use a ``Queue`` and a :class:`QueueHandler` to send all logging events to one of the processes in your multi-process application. The following example script demonstrates how you can do this; in the example a separate listener process listens for events sent by other processes and logs them according to its own logging configuration. Although the example only demonstrates one way of doing it (for example, you may want to use a listener thread rather than a separate listener process -- the implementation would be analogous) it does allow for completely different logging configurations for the listener and the other processes in your application, and can be used as the basis for code meeting your own specific requirements::
fr: Autrement, vous pouvez utiliser une ``Queue`` et un :class:`QueueHandler` pour envoyer tous les événements de journalisation à l’un des processus de votre application multi-processus. L’exemple de script suivant montre comment procéder ; dans l’exemple, un processus d’écoute distinct écoute les événements envoyés par les autres processus et les journalise en fonction de sa propre configuration de journalisation. Bien que l’exemple ne montre qu’une seule façon de faire (par exemple, vous pouvez utiliser un fil d’exécution d’écoute plutôt qu’un processus d’écoute séparé – l’implémentation serait analogue), il permet des configurations de journalisation complètement différentes pour celui qui écoute ainsi que pour les autres processus de votre application, et peut être utilisé comme base pour répondre à vos propres exigences ::

source: A variant of the above script keeps the logging in the main process, in a separate thread::
fr: Une variante du script ci-dessus conserve la journalisation dans le processus principal, dans un fil séparé ::

source: This variant shows how you can e.g. apply configuration for particular loggers - e.g. the ``foo`` logger has a special handler which stores all events in the ``foo`` subsystem in a file ``mplog-foo.log``. This will be used by the logging machinery in the main process (even though the logging events are generated in the worker processes) to direct the messages to the appropriate destinations.
fr: Cette variante montre comment appliquer la configuration pour des enregistreurs particuliers – par exemple l’enregistreur ``foo`` a un gestionnaire spécial qui stocke tous les événements du sous-système ``foo`` dans un fichier ``mplog-foo.log``. C’est utilisé par le mécanisme de journalisation dans le processus principal (même si les événements de journalisation sont générés dans les processus de travail) pour diriger les messages vers les destinations appropriées.

source: Using concurrent.futures.ProcessPoolExecutor
fr: Utilisation de concurrent.futures.ProcessPoolExecutor

source: If you want to use :class:`concurrent.futures.ProcessPoolExecutor` to start your worker processes, you need to create the queue slightly differently. Instead of
fr: Si vous souhaitez utiliser :class:`concurrent.futures.ProcessPoolExecutor` pour démarrer vos processus de travail, vous devez créer la file d’attente légèrement différemment. À la place de

source: you should use
fr: vous devez écrire

source: and you can then replace the worker creation from this::
fr: et vous pouvez alors remplacer la création du processus de travail telle que ::

source: to this (remembering to first import :mod:`concurrent.futures`)::
fr: par celle-ci (souvenez-vous d’importer au préalable :mod:`concurrent.futures`) ::

source: Using file rotation
fr: Utilisation du roulement de fichiers

source: Sometimes you want to let a log file grow to a certain size, then open a new file and log to that. You may want to keep a certain number of these files, and when that many files have been created, rotate the files so that the number of files and the size of the files both remain bounded. For this usage pattern, the logging package provides a :class:`~handlers.RotatingFileHandler`::
fr: Parfois, vous souhaitez laisser un fichier de journalisation grossir jusqu’à une certaine taille, puis ouvrir un nouveau fichier et vous y enregistrer les nouveaux événements. Vous souhaitez peut-être conserver un certain nombre de ces fichiers et, lorsque ce nombre de fichiers aura été créé, faire rouler les fichiers afin que le nombre de fichiers et la taille des fichiers restent tous deux limités. Pour ce cas d’usage, :class:`~handlers.RotatingFileHandler` est inclus dans le paquet de journalisation ::

source: The result should be 6 separate files, each with part of the log history for the application:
fr: Vous devez obtenir 6 fichiers séparés, chacun contenant une partie de l’historique de journalisation de l’application :

source: The most current file is always :file:`logging_rotatingfile_example.out`, and each time it reaches the size limit it is renamed with the suffix ``.1``. Each of the existing backup files is renamed to increment the suffix (``.1`` becomes ``.2``, etc.) and the ``.6`` file is erased.
fr: Le fichier de journalisation actuel est toujours :file:`logging_rotatingfile_example.out`, et chaque fois qu’il atteint la taille limite, il est renommé avec le suffixe ``.1``. Chacun des fichiers de sauvegarde existants est renommé pour incrémenter le suffixe (``.1`` devient ``.2``, etc.) et le fichier ``.6`` est effacé.

source: Obviously this example sets the log length much too small as an extreme example. You would want to set *maxBytes* to an appropriate value.
fr: De toute évidence, la longueur du journal définie dans cet exemple est beaucoup trop petite. À vous de définir *maxBytes* à une valeur appropriée.

source: Use of alternative formatting styles
fr: Utilisation d’autres styles de formatage

source: When logging was added to the Python standard library, the only way of formatting messages with variable content was to use the %-formatting method. Since then, Python has gained two new formatting approaches: :class:`string.Template` (added in Python 2.4) and :meth:`str.format` (added in Python 2.6).
fr: Lorsque la journalisation a été ajoutée à la bibliothèque standard Python, la seule façon de formater les messages avec un contenu variable était d’utiliser la méthode de formatage avec « % ». Depuis, Python s’est enrichi de deux nouvelles méthode de formatage : :class:`string.Template` (ajouté dans Python 2.4) et :meth:`str.format` (ajouté dans Python 2.6).

source: Logging (as of 3.2) provides improved support for these two additional formatting styles. The :class:`Formatter` class been enhanced to take an additional, optional keyword parameter named ``style``. This defaults to ``'%'``, but other possible values are ``'{'`` and ``'$'``, which correspond to the other two formatting styles. Backwards compatibility is maintained by default (as you would expect), but by explicitly specifying a style parameter, you get the ability to specify format strings which work with :meth:`str.format` or :class:`string.Template`. Here's an example console session to show the possibilities:
fr: La journalisation (à partir de la version 3.2) offre une meilleure prise en charge de ces deux styles de formatage supplémentaires. La classe :class:`Formatter` a été améliorée pour accepter un paramètre par mot-clé facultatif supplémentaire nommé ``style``. La valeur par défaut est ``'%'``, les autres valeurs possibles étant ``'{'`` et ``'$'``, qui correspondent aux deux autres styles de formatage. La rétrocompatibilité est maintenue par défaut (comme vous vous en doutez) mais, en spécifiant explicitement un paramètre de style, vous avez la possibilité de spécifier des chaînes de format qui fonctionnent avec :meth:`str.format` ou :class:`string.Template`. Voici un exemple de session interactive en console pour montrer les possibilités :

source: Note that the formatting of logging messages for final output to logs is completely independent of how an individual logging message is constructed. That can still use %-formatting, as shown here::
fr: Notez que le formatage des messages de journalisation est, au final, complètement indépendant de la façon dont un message de journalisation individuel est construit. Vous pouvez toujours utiliser formatage *via* « % », comme ici ::

source: Logging calls (``logger.debug()``, ``logger.info()`` etc.) only take positional parameters for the actual logging message itself, with keyword parameters used only for determining options for how to handle the actual logging call (e.g. the ``exc_info`` keyword parameter to indicate that traceback information should be logged, or the ``extra`` keyword parameter to indicate additional contextual information to be added to the log). So you cannot directly make logging calls using :meth:`str.format` or :class:`string.Template` syntax, because internally the logging package uses %-formatting to merge the format string and the variable arguments. There would be no changing this while preserving backward compatibility, since all logging calls which are out there in existing code will be using %-format strings.
fr: Les appels de journalisation (``logger.debug()``, ``logger.info()`` etc.) ne prennent que des paramètres positionnels pour le message de journalisation lui-même, les paramètres par mots-clés étant utilisés uniquement pour déterminer comment gérer le message réel (par exemple, le paramètre par mot-clé ``exc_info`` indique que les informations de trace doivent être enregistrées, ou le paramètre par mot-clé ``extra`` indique des informations contextuelles supplémentaires à ajouter au journal). Vous ne pouvez donc pas inclure dans les appels de journalisation à l’aide de la syntaxe :meth:`str.format` ou :class:`string.Template`, car le paquet de journalisation utilise le formatage via « % » en interne pour fusionner la chaîne de format et les arguments de variables. Il n’est pas possible de changer ça tout en préservant la rétrocompatibilité puisque tous les appels de journalisation dans le code pré-existant utilisent des chaînes au format « % ».

source: There is, however, a way that you can use {}- and $- formatting to construct your individual log messages. Recall that for a message you can use an arbitrary object as a message format string, and that the logging package will call ``str()`` on that object to get the actual format string. Consider the following two classes::
fr: Il existe cependant un moyen d’utiliser le formatage *via* « {} » et « $ » pour vos messages de journalisation. Rappelez-vous que, pour un message, vous pouvez utiliser un objet arbitraire comme chaîne de format de message, et que le package de journalisation appelle ``str()`` sur cet objet pour fabriquer la chaîne finale. Considérez les deux classes suivantes ::

source: Either of these can be used in place of a format string, to allow {}- or $-formatting to be used to build the actual "message" part which appears in the formatted log output in place of "%(message)s" or "{message}" or "$message". It's a little unwieldy to use the class names whenever you want to log something, but it's quite palatable if you use an alias such as __ (double underscore --- not to be confused with _, the single underscore used as a synonym/alias for :func:`gettext.gettext` or its brethren).
fr: L’une ou l’autre peut être utilisée à la place d’une chaîne de format "%(message)s" ou "{message}" ou "$message", afin de mettre en forme *via* « { } » ou « $ » la partie « message réel » qui apparaît dans la sortie de journal formatée. Il est un peu lourd d’utiliser les noms de classe chaque fois que vous voulez journaliser quelque chose, mais ça devient acceptable si vous utilisez un alias tel que __ (double trait de soulignement — à ne pas confondre avec _, le trait de soulignement unique utilisé comme alias pour :func:`gettext.gettext` ou ses homologues).

source: The above classes are not included in Python, though they're easy enough to copy and paste into your own code. They can be used as follows (assuming that they're declared in a module called ``wherever``):
fr: Les classes ci-dessus ne sont pas incluses dans Python, bien qu’elles soient assez faciles à copier et coller dans votre propre code. Elles peuvent être utilisées comme suit (en supposant qu’elles soient déclarées dans un module appelé ``wherever``) :

source: While the above examples use ``print()`` to show how the formatting works, you would of course use ``logger.debug()`` or similar to actually log using this approach.
fr: Alors que les exemples ci-dessus utilisent ``print()`` pour montrer comment fonctionne le formatage, utilisez bien sûr ``logger.debug()`` ou similaire pour journaliser avec cette approche.

source: One thing to note is that you pay no significant performance penalty with this approach: the actual formatting happens not when you make the logging call, but when (and if) the logged message is actually about to be output to a log by a handler. So the only slightly unusual thing which might trip you up is that the parentheses go around the format string and the arguments, not just the format string. That's because the __ notation is just syntax sugar for a constructor call to one of the XXXMessage classes.
fr: Une chose à noter est qu’il n’y a pas de perte de performance significative avec cette approche : le formatage réel ne se produit pas lorsque vous effectuez l’appel de journalisation, mais lorsque (et si) le message journalisé est réellement sur le point d’être écrit dans un journal par un gestionnaire. Ainsi, la seule chose légèrement inhabituelle qui pourrait vous perturber est que les parenthèses entourent la chaîne de format et les arguments, pas seulement la chaîne de format. C’est parce que la notation __ n’est que du sucre syntaxique pour un appel de constructeur à l’une des classes ``XXXMessage``.

source: If you prefer, you can use a :class:`LoggerAdapter` to achieve a similar effect to the above, as in the following example::
fr: Si vous préférez, vous pouvez utiliser un :class:`LoggerAdapter` pour obtenir un effet similaire à ce qui précède, comme dans l’exemple suivant ::

source: The above script should log the message ``Hello, world!`` when run with Python 3.2 or later.
fr: Le script ci-dessus journalise le message ``Hello, world!`` quand il est lancé avec Python 3.2 ou ultérieur.

source: Customizing ``LogRecord``
fr: Personnalisation de ``LogRecord``

source: Every logging event is represented by a :class:`LogRecord` instance. When an event is logged and not filtered out by a logger's level, a :class:`LogRecord` is created, populated with information about the event and then passed to the handlers for that logger (and its ancestors, up to and including the logger where further propagation up the hierarchy is disabled). Before Python 3.2, there were only two places where this creation was done:
fr: Chaque événement de journalisation est représenté par une instance :class:`LogRecord`. Lorsqu’un événement est enregistré et non filtré en raison du niveau d’un enregistreur, un :class:`LogRecord` est créé, rempli avec les informations de l’événement, puis transmis aux gestionnaires de cet enregistreur (et ses ancêtres, jusqu’à et y compris l’enregistreur où la propagation vers le haut de la hiérarchie est désactivée). Avant Python 3.2, il n’y avait que deux endroits où cette création était effectuée :

source: :meth:`Logger.makeRecord`, which is called in the normal process of logging an event. This invoked :class:`LogRecord` directly to create an instance.
fr: :meth:`Logger.makeRecord`, qui est appelée dans le processus normal de journalisation d’un événement. Elle appelait :class:`LogRecord` directement pour créer une instance.

source: :func:`makeLogRecord`, which is called with a dictionary containing attributes to be added to the LogRecord. This is typically invoked when a suitable dictionary has been received over the network (e.g. in pickle form via a :class:`~handlers.SocketHandler`, or in JSON form via an :class:`~handlers.HTTPHandler`).
fr: :func:`makeLogRecord`, qui est appelée avec un dictionnaire contenant des attributs à ajouter au *LogRecord*. Elle est généralement invoquée lorsqu’un dictionnaire approprié a été reçu par le réseau (par exemple, sous forme de *pickle* *via* un :class:`~handlers.SocketHandler`, ou sous format JSON *via* un :class:`~handlers.HTTPHandler`).

source: This has usually meant that if you need to do anything special with a :class:`LogRecord`, you've had to do one of the following.
fr: Cela signifiait généralement que, si vous deviez faire quelque chose de spécial avec un :class:`LogRecord`, vous deviez faire l’une des choses suivantes.

source: Create your own :class:`Logger` subclass, which overrides :meth:`Logger.makeRecord`, and set it using :func:`~logging.setLoggerClass` before any loggers that you care about are instantiated.
fr: Créer votre propre sous-classe :class:`Logger`, surchargeant :meth:`Logger.makeRecord`, et la personnaliser à l’aide de :func:`~logging.setLoggerClass` avant que les enregistreurs qui vous intéressaient ne soient instanciés.

source: Add a :class:`Filter` to a logger or handler, which does the necessary special manipulation you need when its :meth:`~Filter.filter` method is called.
fr: Ajouter un :class:`Filter` à un enregistreur ou un gestionnaire, qui effectuait la manipulation spéciale nécessaire dont vous aviez besoin lorsque sa méthode :meth:`~Filter.filter` était appelée.

source: The first approach would be a little unwieldy in the scenario where (say) several different libraries wanted to do different things. Each would attempt to set its own :class:`Logger` subclass, and the one which did this last would win.
fr: La première approche est un peu lourde dans le scénario où (disons) plusieurs bibliothèques différentes veulent faire des choses différentes. Chacun essaie de définir sa propre sous-classe :class:`Logger`, et celui qui l’a fait en dernier gagne.

source: The second approach works reasonably well for many cases, but does not allow you to e.g. use a specialized subclass of :class:`LogRecord`. Library developers can set a suitable filter on their loggers, but they would have to remember to do this every time they introduced a new logger (which they would do simply by adding new packages or modules and doing ::
fr: La seconde approche fonctionne raisonnablement bien dans de nombreux cas, mais ne vous permet pas, par exemple, d’utiliser une sous-classe spécialisée de :class:`LogRecord`. Les développeurs de bibliothèques peuvent définir un filtre approprié sur leurs enregistreurs, mais ils doivent se rappeler de le faire chaque fois qu’ils introduisent un nouvel enregistreur (ce qu’ils font simplement en ajoutant de nouveaux paquets ou modules et en écrivant ::
