Repository: python/python-docs-fr
Catalog: howto/pyporting.po
Languages: fr

source: To start, you will need to decide which APIs take text and which take binary (it is **highly** recommended you don't design APIs that can take both due to the difficulty of keeping the code working; as stated earlier it is difficult to do well). In Python 2 this means making sure the APIs that take text can work with ``unicode`` and those that work with binary data work with the ``bytes`` type from Python 3 (which is a subset of ``str`` in Python 2 and acts as an alias for ``bytes`` type in Python 2). Usually the biggest issue is realizing which methods exist on which types in Python 2 & 3 simultaneously (for text that's ``unicode`` in Python 2 and ``str`` in Python 3, for binary that's ``str``/``bytes`` in Python 2 and ``bytes`` in Python 3). The following table lists the **unique** methods of each data type across Python 2 & 3 (e.g., the ``decode()`` method is usable on the equivalent binary data type in either Python 2 or 3, but it can't be used by the textual data type consistently between Python 2 and 3 because ``str`` in Python 3 doesn't have the method). Do note that as of Python 3.5 the ``__mod__`` method was added to the bytes type.
fr: Pour commencer, vous devrez choisir quelles API travaillent sur du texte et lesquelles travaillent avec des données binaires (il est **fortement** recommandé de ne pas concevoir d'API qui gèrent les deux types compte-tenu de la difficulté supplémentaire que cela induit). Dans Python 2, cela signifie s'assurer que les API recevant du texte en entrée peuvent gérer ``unicode`` et celles qui reçoivent des données binaires fonctionnent avec le type ``bytes`` de Python 3 (qui est un sous-ensemble de ``str`` dans Python 2 et opère comme un alias du type ``bytes`` de Python 2). En général, le principal problème consiste à inventorier quelles méthodes existent et opèrent sur quel type dans Python & 3 simultanément (pour le texte, il s'agit de ``unicode`` dans Python 2 et ``str`` dans Python 3, pour le binaire il s'agit de ``str``/``bytes`` dans Python 2 et ``bytes`` dans Python 3). Le tableau ci-dessous liste les méthodes **spécifiques** à chaque type de données dans Python 2 et 3 (par exemple, la méthode ``decode()`` peut être utilisée sur des données binaires équivalentes en Python 2 et 3, mais ne peut pas être utilisée de la même façon sur le type texte en Python 2 et 3 car le type ``str`` de Python 3 ne possède pas de telle méthode). Notez que depuis Python 3.5, la méthode ``__mod__`` a été ajoutée au type *bytes*.

source: **Text data**
fr: **Format texte**

source: **Binary data**
fr: **Format binaire**

source: Making the distinction easier to handle can be accomplished by encoding and decoding between binary data and text at the edge of your code. This means that when you receive text in binary data, you should immediately decode it. And if your code needs to send text as binary data then encode it as late as possible. This allows your code to work with only text internally and thus eliminates having to keep track of what type of data you are working with.
fr: Vous pouvez rendre le problème plus simple à gérer en réalisant les opérations d'encodage et de décodage entre données binaires et texte aux extrémités de votre code. Cela signifie que lorsque vous recevez du texte dans un format binaire, vous devez immédiatement le décoder. À l'inverse si votre code doit transmettre du texte sous forme binaire, encodez-le le plus tard possible. Cela vous permet de ne manipuler que du texte à l'intérieur de votre code et permet de ne pas se préoccuper du type des données sur lesquelles vous travaillez.

source: The next issue is making sure you know whether the string literals in your code represent text or binary data. You should add a ``b`` prefix to any literal that presents binary data. For text you should add a ``u`` prefix to the text literal. (there is a :mod:`__future__` import to force all unspecified literals to be Unicode, but usage has shown it isn't as effective as adding a ``b`` or ``u`` prefix to all literals explicitly)
fr: Le point suivant est de s'assurer que vous savez quelles chaînes de caractères littérales de votre code correspondent à du texte ou à du binaire. Vous devez préfixer par ``b`` tous les littéraux qui représentent des données binaires et par ``u`` les littéraux qui représentent du texte (il existe une importation du module :mod:`__future__` permettant de forcer l'encodage de toutes les chaînes de caractères littérales non spécifiées en Unicode, mais cette pratique s'est avérée moins efficace que l'ajout explicite des préfixe ``b`` et ``u``).

source: As part of this dichotomy you also need to be careful about opening files. Unless you have been working on Windows, there is a chance you have not always bothered to add the ``b`` mode when opening a binary file (e.g., ``rb`` for binary reading). Under Python 3, binary files and text files are clearly distinct and mutually incompatible; see the :mod:`io` module for details. Therefore, you **must** make a decision of whether a file will be used for binary access (allowing binary data to be read and/or written) or textual access (allowing text data to be read and/or written). You should also use :func:`io.open` for opening files instead of the built-in :func:`open` function as the :mod:`io` module is consistent from Python 2 to 3 while the built-in :func:`open` function is not (in Python 3 it's actually :func:`io.open`). Do not bother with the outdated practice of using :func:`codecs.open` as that's only necessary for keeping compatibility with Python 2.5.
fr: Une conséquence de cette dichotomie est que vous devez être prudents lors de l'ouverture d'un fichier. À moins que vous travailliez sous Windows, il y a des chances pour que vous ne vous soyez jamais préoccupé de spécifier le mode ``b`` lorsque vous ouvrez des fichiers binaires (par exemple ``rb`` pour lire un fichier binaire). Sous Python 3, les fichiers binaire et texte sont distincts et mutuellement incompatibles ; se référer au module :mod:`io` pour plus de détails. Ainsi vous **devez** décider lorsque vous ouvrez un fichier si vous y accéderez en mode binaire (ce qui permet de lire et écrire des données binaires) ou en mode texte (ce qui permet de lire et écrire du texte). Vous devez également utiliser :func:`io.open` pour ouvrir des fichiers plutôt que la fonction native :func:`open` étant donné que le module :mod:`io` est cohérent de Python 2 à 3, ce qui n'est pas vrai pour la fonction :func:`open` (en Python 3, il s'agit en réalité de :func:`io.open`). Ne cherchez pas à appliquer l'ancienne pratique consistant à utiliser :func:`codecs.open` qui n'est nécessaire que pour préserver une compatibilité avec Python 2.5.

source: The constructors of both ``str`` and ``bytes`` have different semantics for the same arguments between Python 2 & 3. Passing an integer to ``bytes`` in Python 2 will give you the string representation of the integer: ``bytes(3) == '3'``. But in Python 3, an integer argument to ``bytes`` will give you a bytes object as long as the integer specified, filled with null bytes: ``bytes(3) == b'\x00\x00\x00'``. A similar worry is necessary when passing a bytes object to ``str``. In Python 2 you just get the bytes object back: ``str(b'3') == b'3'``. But in Python 3 you get the string representation of the bytes object: ``str(b'3') == "b'3'"``.
fr: Les constructeurs des types ``str`` et ``bytes`` possèdent une sémantique différente pour les mêmes arguments sous Python 2 et 3. Passer un entier à ``bytes`` sous Python 2 produit une représentation de cet entier en chaîne de caractères : ``bytes(3) == '3'``. Mais sous Python 3, fournir un argument entier à ``bytes`` produit un objet *bytes* de la longueur de l'entier spécifié, rempli par des octets nuls : ``bytes(3) == b'\x00\x00\x00'``. La même prudence est nécessaire lorsque vous passez un objet *bytes* à ``str``. En Python 2, vous récupérez simplement l'objet *bytes* initial : ``str(b'3') == b'3'``. Mais en Python 3, vous récupérez la représentation en chaîne de caractères de l'objet *bytes* : ``str(b'3') == "b'3'"``.

source: Finally, the indexing of binary data requires careful handling (slicing does **not** require any special handling). In Python 2, ``b'123'[1] == b'2'`` while in Python 3 ``b'123'[1] == 50``. Because binary data is simply a collection of binary numbers, Python 3 returns the integer value for the byte you index on. But in Python 2 because ``bytes == str``, indexing returns a one-item slice of bytes. The six_ project has a function named ``six.indexbytes()`` which will return an integer like in Python 3: ``six.indexbytes(b'123', 1)``.
fr: Enfin, l'indiçage des données binaires exige une manipulation prudente (bien que le découpage, ou *slicing* en anglais, ne nécessite pas d'attention particulière). En Python 2, ``b'123'[1] == b'2'`` tandis qu'en Python 3 ``b'123'[1] == 50``. Puisque les données binaires ne sont simplement qu'une collection de nombres en binaire, Python 3 renvoie la valeur entière de l'octet indicé. Mais en Python 2, étant donné que ``bytes == str``, l'indiçage renvoie une tranche de longueur 1 de *bytes*. Le projet six_ dispose d'une fonction appelée ``six.indexbytes()`` qui renvoie un entier comme en Python 3 : ``six.indexbytes(b'123', 1)``.

source: To summarize:
fr: Pour résumer :

source: Decide which of your APIs take text and which take binary data
fr: Décidez lesquelles de vos API travaillent sur du texte et lesquelles travaillent sur des données binaires

source: Make sure that your code that works with text also works with ``unicode`` and code for binary data works with ``bytes`` in Python 2 (see the table above for what methods you cannot use for each type)
fr: Assurez vous que votre code travaillant sur du texte fonctionne aussi avec le type ``unicode`` et que le code travaillant sur du binaire fonctionne avec le type ``bytes`` en Python 2 (voir le tableau ci-dessus pour la liste des méthodes utilisables par chaque type)

source: Mark all binary literals with a ``b`` prefix, textual literals with a ``u`` prefix
fr: Préfixez tous vos littéraux binaires par ``b`` et toutes vos chaînes de caractères littérales par ``u``

source: Decode binary data to text as soon as possible, encode text as binary data as late as possible
fr: Décodez les données binaires en texte dès que possible, encodez votre texte au format binaire le plus tard possible

source: Open files using :func:`io.open` and make sure to specify the ``b`` mode when appropriate
fr: Ouvrez les fichiers avec la fonction :func:`io.open` et assurez-vous de spécifier le mode ``b`` le cas échéant

source: Be careful when indexing into binary data
fr: Utilisez avec prudence l'indiçage sur des données binaires

source: Use feature detection instead of version detection
fr: Utilisez la détection de fonctionnalités plutôt que la détection de version

source: Inevitably you will have code that has to choose what to do based on what version of Python is running. The best way to do this is with feature detection of whether the version of Python you're running under supports what you need. If for some reason that doesn't work then you should make the version check be against Python 2 and not Python 3. To help explain this, let's look at an example.
fr: Vous rencontrerez inévitablement du code devant décider quoi faire en fonction de la version de Python qui s'exécute. La meilleure façon de gérer ce cas est de détecter si les fonctionnalités dont vous avez besoin sont gérées par la version de Python sous laquelle le code s'exécute. Si pour certaines raisons cela ne fonctionne pas, alors vous devez tester si votre version est Python 2 et non Python 3. Afin de clarifier cette pratique, voici un exemple.

source: Let's pretend that you need access to a feature of :mod:`importlib` that is available in Python's standard library since Python 3.3 and available for Python 2 through importlib2_ on PyPI. You might be tempted to write code to access e.g. the :mod:`importlib.abc` module by doing the following::
fr: Supposons que vous avez besoin d'accéder à une fonctionnalité de :mod:`importlib` qui est disponible dans la bibliothèque standard de Python depuis la version 3.3, dans celle de Python 2 via le module importlib2_ sur *PyPI*. Vous pourriez être tenté d'écrire un code qui accède, par exemple, au module :mod:`importlib.abc` avec l'approche suivante ::

source: The problem with this code is what happens when Python 4 comes out? It would be better to treat Python 2 as the exceptional case instead of Python 3 and assume that future Python versions will be more compatible with Python 3 than Python 2::
fr: Le problème est le suivant : que se passe-t-il lorsque Python 4 est publié ? Il serait préférable de traiter le cas Python 2 comme l'exception plutôt que Python 3 et de supposer que les versions futures de Python 2 seront plus compatibles avec Python 3 qu'avec Python 2 ::

source: The best solution, though, is to do no version detection at all and instead rely on feature detection. That avoids any potential issues of getting the version detection wrong and helps keep you future-compatible::
fr: Néanmoins la meilleure solution est de ne pas chercher à déterminer la version de Python mais plutôt à détecter les fonctionnalités disponibles. Cela évite les problèmes potentiels liés aux erreurs de détection de version et facilite la compatibilité future ::

source: Prevent compatibility regressions
fr: Prévenir les régressions de compatibilité

source: Once you have fully translated your code to be compatible with Python 3, you will want to make sure your code doesn't regress and stop working under Python 3. This is especially true if you have a dependency which is blocking you from actually running under Python 3 at the moment.
fr: Une fois votre code traduit pour être compatible avec Python 3, vous devez vous assurer que votre code n'a pas régressé ou qu'il ne fonctionne pas sous Python 3. Ceci est particulièrement important si une de vos dépendances vous empêche de réellement exécuter le code sous Python 3 pour le moment.

source: To help with staying compatible, any new modules you create should have at least the following block of code at the top of it::
fr: Afin de vous aider à maintenir la compatibilité, nous préconisons que tous les nouveaux modules que vous créez aient au moins le bloc de code suivant en en-tête ::

source: You can also run Python 2 with the ``-3`` flag to be warned about various compatibility issues your code triggers during execution. If you turn warnings into errors with ``-Werror`` then you can make sure that you don't accidentally miss a warning.
fr: Vous pouvez également lancer Python 2 avec le paramètre ``-3`` afin d'être alerté en cas de divers problèmes de compatibilité que votre code déclenche durant son exécution. Si vous transformez les avertissements en erreur avec ``-Werror``, vous pouvez être certain que ne passez pas accidentellement à côté d'un avertissement.

source: You can also use the Pylint_ project and its ``--py3k`` flag to lint your code to receive warnings when your code begins to deviate from Python 3 compatibility. This also prevents you from having to run Modernize_ or Futurize_ over your code regularly to catch compatibility regressions. This does require you only support Python 2.7 and Python 3.4 or newer as that is Pylint's minimum Python version support.
fr: Vous pouvez également utiliser le projet Pylint_ et son option ``--py3k`` afin de modifier votre code pour recevoir des avertissements lorsque celui-ci dévie de la compatibilité Python 3. Cela vous évite par ailleurs d'appliquer Modernize_ ou Futurize_ sur votre code régulièrement pour détecter des régressions liées à la compatibilité. Cependant cela nécessite de votre part le support de Python 2.7 et Python 3.4 ou ultérieur étant donné qu'il s'agit de la version minimale gérée par Pylint.

source: Check which dependencies block your transition
fr: Vérifier quelles dépendances empêchent la migration

source: **After** you have made your code compatible with Python 3 you should begin to care about whether your dependencies have also been ported. The caniusepython3_ project was created to help you determine which projects -- directly or indirectly -- are blocking you from supporting Python 3. There is both a command-line tool as well as a web interface at https://caniusepython3.com.
fr: **Après** avoir rendu votre code compatible avec Python 3, vous devez commencer à vous intéresser au portage de vos dépendances. Le projet `caniusepython3`_ a été créé afin de vous aider à déterminer quels projets sont bloquants dans votre support de Python 3, directement ou indirectement. Il existe un outil en ligne de commande ainsi qu'une interface web : https://caniusepython3.com.

source: The project also provides code which you can integrate into your test suite so that you will have a failing test when you no longer have dependencies blocking you from using Python 3. This allows you to avoid having to manually check your dependencies and to be notified quickly when you can start running on Python 3.
fr: Le projet fournit également du code intégrable dans votre suite de test qui déclenchera un échec de test lorsque plus aucune de vos dépendances n'est bloquante pour l'utilisation de Python 3. Cela vous permet de ne pas avoir à vérifier manuellement vos dépendances et d'être notifié rapidement quand vous pouvez exécuter votre application avec Python 3.

source: Update your ``setup.py`` file to denote Python 3 compatibility
fr: Mettre à jour votre fichier ``setup.py`` pour spécifier la compatibilité avec Python 3

source: Once your code works under Python 3, you should update the classifiers in your ``setup.py`` to contain ``Programming Language :: Python :: 3`` and to not specify sole Python 2 support. This will tell anyone using your code that you support Python 2 **and** 3. Ideally you will also want to add classifiers for each major/minor version of Python you now support.
fr: Une fois que votre code fonctionne sous Python 3, vous devez mettre à jour vos classeurs dans votre ``setup.py`` pour inclure ``Programming Language :: Python :: 3`` et non seulement le support de Python 2. Cela signifiera à quiconque utilise votre code que vous gérez Python 2 **et** 3. Dans l'idéal vous devrez aussi ajouter une mention pour chaque version majeure/mineure de Python que vous supportez désormais.

source: Use continuous integration to stay compatible
fr: Utiliser l'intégration continue pour maintenir la compatibilité

source: Once you are able to fully run under Python 3 you will want to make sure your code always works under both Python 2 & 3. Probably the best tool for running your tests under multiple Python interpreters is tox_. You can then integrate tox with your continuous integration system so that you never accidentally break Python 2 or 3 support.
fr: Une fois que vous êtes en mesure d'exécuter votre code sous Python 3, vous devrez vous assurer que celui-ci fonctionne toujours pour Python 2 & 3. tox_ est vraisemblablement le meilleur outil pour exécuter vos tests avec plusieurs interpréteurs Python. Vous pouvez alors intégrer *tox* à votre système d'intégration continue afin de ne jamais accidentellement casser votre gestion de Python 2 ou 3.

source: You may also want to use the ``-bb`` flag with the Python 3 interpreter to trigger an exception when you are comparing bytes to strings or bytes to an int (the latter is available starting in Python 3.5). By default type-differing comparisons simply return ``False``, but if you made a mistake in your separation of text/binary data handling or indexing on bytes you wouldn't easily find the mistake. This flag will raise an exception when these kinds of comparisons occur, making the mistake much easier to track down.
fr: Vous pouvez également utiliser l'option ``-bb`` de l'interpréteur Python 3 afin de déclencher une exception lorsque vous comparez des *bytes* à des chaînes de caractères ou à un entier (cette deuxième possibilité est disponible à partir de Python 3.5). Par défaut, des comparaisons entre types différents renvoient simplement ``False`` mais si vous avez fait une erreur dans votre séparation de la gestion texte/données binaires ou votre indiçage des *bytes*, vous ne trouverez pas facilement le bogue. Ce drapeau lève une exception lorsque ce genre de comparaison apparaît, facilitant ainsi son identification et sa localisation.

source: And that's mostly it! At this point your code base is compatible with both Python 2 and 3 simultaneously. Your testing will also be set up so that you don't accidentally break Python 2 or 3 compatibility regardless of which version you typically run your tests under while developing.
fr: Et c'est à peu près tout ! Une fois ceci fait, votre code source est compatible avec Python 2 et 3 simultanément. Votre suite de test est également en place de telle sorte que vous ne cassiez pas la compatibilité Python 2 ou 3 indépendamment de la version que vous utilisez pendant le développement.

source: Consider using optional static type checking
fr: Envisager l'utilisation d'un vérificateur de type statique optionnel

source: Another way to help port your code is to use a static type checker like mypy_ or pytype_ on your code. These tools can be used to analyze your code as if it's being run under Python 2, then you can run the tool a second time as if your code is running under Python 3. By running a static type checker twice like this you can discover if you're e.g. misusing binary data type in one version of Python compared to another. If you add optional type hints to your code you can also explicitly state whether your APIs use textual or binary data, helping to make sure everything functions as expected in both versions of Python.
fr: Une autre façon de faciliter le portage de votre code est d'utiliser un vérificateur de type statique comme mypy_ ou pytype_. Ces outils peuvent être utilisés pour analyser votre code comme s'il était exécuté sous Python 2, puis une seconde fois comme s'il était exécuté sous Python 3. L'utilisation double d'un vérificateur de type statique de cette façon permet de détecter si, par exemple, vous faites une utilisation inappropriée des types de données binaires dans une version de Python par rapport à l'autre. Si vous ajoutez les indices optionnels de typage à votre code, vous pouvez alors explicitement déclarer que vos API attendent des données binaires ou du texte, ce qui facilite alors la vérification du comportement de votre code dans les deux versions de Python.
