Repository: python/python-docs-fr
Catalog: howto/pyporting.po
Languages: fr

source: Porting Python 2 Code to Python 3
fr: Portage de code Python 2 vers Python 3

source: author
fr: auteur

source: Abstract
fr: Résumé

source: With Python 3 being the future of Python while Python 2 is still in active use, it is good to have your project available for both major releases of Python. This guide is meant to help you figure out how best to support both Python 2 & 3 simultaneously.
fr: Python 3 étant le futur de Python tandis que Python 2 est encore activement utilisé, il est préférable de faire en sorte que votre projet soit disponible pour les deux versions majeures de Python. Ce guide est destiné à vous aider à comprendre comment gérer simultanément Python 2 & 3.

source: If you are looking to port an extension module instead of pure Python code, please see :ref:`cporting-howto`.
fr: Si vous cherchez à porter un module d'extension plutôt que du pur Python, veuillez consulter :ref:`cporting-howto`.

source: If you would like to read one core Python developer's take on why Python 3 came into existence, you can read Nick Coghlan's `Python 3 Q & A`_ or Brett Cannon's `Why Python 3 exists`_.
fr: Si vous souhaitez lire l'avis d'un développeur principal de Python sur ce qui a motivé la création de Python 3, vous pouvez lire le `Python 3 Q & A`_ de Nick Coghlan ou bien `Why Python 3 exists`_ de Brett Cannon.

source: For help with porting, you can email the python-porting_ mailing list with questions.
fr: Vous pouvez solliciter par courriel l'aide de la liste de diffusion python-porting_ pour vos questions liées au portage.

source: The Short Explanation
fr: La version courte

source: To make your project be single-source Python 2/3 compatible, the basic steps are:
fr: Afin de rendre votre projet compatible Python 2/3 avec le même code source, les étapes de base sont :

source: Only worry about supporting Python 2.7
fr: Ne se préoccuper que du support de Python 2.7

source: Make sure you have good test coverage (coverage.py_ can help; ``pip install coverage``)
fr: S'assurer d'une bonne couverture des tests (coverage.py_ peut aider ; ``pip install coverage``)

source: Learn the differences between Python 2 & 3
fr: Apprendre les différences entre Python 2 et 3

source: Use Futurize_ (or Modernize_) to update your code (e.g. ``pip install future``)
fr: Utiliser Futurize_ (ou Modernize_) pour mettre à jour votre code (par exemple ``pip install future``)

source: Use Pylint_ to help make sure you don't regress on your Python 3 support (``pip install pylint``)
fr: Utilisez Pylint_ pour vous assurer que vous ne régressez pas sur votre prise en charge de Python 3 (``pip install pylint``)

source: Use caniusepython3_ to find out which of your dependencies are blocking your use of Python 3 (``pip install caniusepython3``)
fr: Utiliser `caniusepython3`_ pour déterminer quelles sont, parmi les dépendances que vous utilisez, celles qui bloquent votre utilisation de Python 3 (``pip install caniusepython3``)

source: Once your dependencies are no longer blocking you, use continuous integration to make sure you stay compatible with Python 2 & 3 (tox_ can help test against multiple versions of Python; ``pip install tox``)
fr: Une fois que vos dépendances ne sont plus un obstacle, utiliser l'intégration continue pour s'assurer que votre code demeure compatible Python 2 & 3 (tox_ peut aider à tester la comptabilité de sources avec plusieurs versions de Python; ``pip install tox``)

source: Consider using optional static type checking to make sure your type usage works in both Python 2 & 3 (e.g. use mypy_ to check your typing under both Python 2 & Python 3).
fr: Envisager l'utilisation d'un vérifieur de type statique afin de vous assurer que votre façon d'utiliser les types est compatible avec Python 2 et 3 (par exemple en utilisant mypy_ pour vérifier votre typage sous Python 2 et 3).

source: Details
fr: Détails

source: A key point about supporting Python 2 & 3 simultaneously is that you can start **today**! Even if your dependencies are not supporting Python 3 yet that does not mean you can't modernize your code **now** to support Python 3. Most changes required to support Python 3 lead to cleaner code using newer practices even in Python 2 code.
fr: Un point clé du support simultané de Python 2 et 3 est qu'il vous est possible de commencer **dès aujourd'hui** ! Même si vos dépendances ne sont pas encore compatibles Python 3, vous pouvez moderniser votre code **dès maintenant** pour gérer Python 3. La plupart des modifications nécessaires à la compatibilité Python 3 donnent un code plus propre utilisant une syntaxe plus récente, même dans du code Python 2.

source: Another key point is that modernizing your Python 2 code to also support Python 3 is largely automated for you. While you might have to make some API decisions thanks to Python 3 clarifying text data versus binary data, the lower-level work is now mostly done for you and thus can at least benefit from the automated changes immediately.
fr: Un autre point important est que la modernisation de votre code Python 2 pour le rendre compatible Python 3 est pratiquement automatique. Bien qu'il soit possible d'avoir à effectuer des changements d'API compte-tenu de la clarification de la gestion des données textuelles et binaires dans Python 3, le travail de bas niveau est en grande partie fait pour vous et vous pouvez ainsi bénéficiez de ces modifications automatiques immédiatement.

source: Keep those key points in mind while you read on about the details of porting your code to support Python 2 & 3 simultaneously.
fr: Gardez ces points-clés en tête pendant que vous lisez les détails ci-dessous concernant le portage de votre code vers une compatibilité simultanée Python 2 et 3.

source: Drop support for Python 2.6 and older
fr: Abandon de la compatibilité Python 2.6 et antérieures

source: While you can make Python 2.5 work with Python 3, it is **much** easier if you only have to work with Python 2.7. If dropping Python 2.5 is not an option then the six_ project can help you support Python 2.5 & 3 simultaneously (``pip install six``). Do realize, though, that nearly all the projects listed in this HOWTO will not be available to you.
fr: Bien qu'il soit possible de rendre Python 2.5 compatible avec Python 3, il est **beaucoup** plus simple de n'avoir qu'à travailler avec Python 2.7. Si abandonner Python 2.5 n'est pas une option, alors le projet six_ peut vous aider à gérer simultanément Python 2.5 et 3 (``pip install six``). Néanmoins, soyez conscient que la quasi-totalité des projets listés dans ce guide pratique ne seront pas applicables à votre situation.

source: If you are able to skip Python 2.5 and older, then the required changes to your code should continue to look and feel like idiomatic Python code. At worst you will have to use a function instead of a method in some instances or have to import a function instead of using a built-in one, but otherwise the overall transformation should not feel foreign to you.
fr: Si vous pouvez ignorer Python 2.5 et antérieur, les changements nécessaires à appliquer à votre code devraient encore ressembler à vos yeux à du code Python idiomatique. Dans le pire cas, vous devrez utiliser une fonction plutôt qu'une méthode dans certains cas, ou bien vous devrez importer une fonction plutôt qu'utiliser une fonction native, mais le reste du temps le code transformé devrait vous rester familier.

source: But you should aim for only supporting Python 2.7. Python 2.6 is no longer freely supported and thus is not receiving bugfixes. This means **you** will have to work around any issues you come across with Python 2.6. There are also some tools mentioned in this HOWTO which do not support Python 2.6 (e.g., Pylint_), and this will become more commonplace as time goes on. It will simply be easier for you if you only support the versions of Python that you have to support.
fr: Mais nous vous conseillons de viser seulement un support de Python 2.7. Python 2.6 n'est plus supporté gratuitement et par conséquent ne reçoit plus aucun correctif. Cela signifie que **vous** devrez trouver des solutions de contournement aux problèmes que vous rencontrez avec Python 2.6. Il existe en outre des outils mentionnés dans ce guide pratique qui ne supportent pas Python 2.6 (par exemple Pylint_), ce qui sera de plus en plus courant au fil du temps. Il est simplement plus facile pour vous de n'assurer une compatibilité qu'avec les versions de Python que vous avez l'obligation de gérer.

source: Make sure you specify the proper version support in your ``setup.py`` file
fr: Assurez vous de spécifier la bonne version supportée dans le fichier ``setup.py``

source: In your ``setup.py`` file you should have the proper `trove classifier`_ specifying what versions of Python you support. As your project does not support Python 3 yet you should at least have ``Programming Language :: Python :: 2 :: Only`` specified. Ideally you should also specify each major/minor version of Python that you do support, e.g. ``Programming Language :: Python :: 2.7``.
fr: Votre fichier ``setup.py`` devrait contenir le bon `trove classifier`_ spécifiant les versions de Python avec lesquelles vous êtes compatible. Comme votre projet ne supporte pas encore Python 3, vous devriez au moins spécifier ``Programming Language :: Python :: 2 :: Only``. Dans l'idéal vous devriez indiquer chaque version majeure/mineure de Python que vous gérez, par exemple ``Programming Language :: Python :: 2.7``.

source: Have good test coverage
fr: Obtenir une bonne couverture de code

source: Once you have your code supporting the oldest version of Python 2 you want it to, you will want to make sure your test suite has good coverage. A good rule of thumb is that if you want to be confident enough in your test suite that any failures that appear after having tools rewrite your code are actual bugs in the tools and not in your code. If you want a number to aim for, try to get over 80% coverage (and don't feel bad if you find it hard to get better than 90% coverage). If you don't already have a tool to measure test coverage then coverage.py_ is recommended.
fr: Une fois que votre code est compatible avec la plus ancienne version de Python 2 que vous souhaitez, vous devez vous assurer que votre suite de test a une couverture suffisante. Une bonne règle empirique consiste à avoir suffisamment confiance en la suite de test pour qu'une erreur apparaissant après la réécriture du code par les outils automatiques résulte de bogues de ces derniers et non de votre code. Si vous souhaitez une valeur cible, essayez de dépasser les 80 % de couverture (et ne vous sentez pas coupable si vous trouvez difficile de faire mieux que 90 % de couverture). Si vous ne disposez pas encore d'un outil pour mesurer la couverture de code, coverage.py_ est recommandé.

source: Once you have your code well-tested you are ready to begin porting your code to Python 3! But to fully understand how your code is going to change and what you want to look out for while you code, you will want to learn what changes Python 3 makes in terms of Python 2. Typically the two best ways of doing that is reading the :ref:`"What's New" <whatsnew-index>` doc for each release of Python 3 and the `Porting to Python 3`_ book (which is free online). There is also a handy `cheat sheet`_ from the Python-Future project.
fr: Une fois que votre code est bien testé, vous êtes prêt à démarrer votre portage vers Python 3 ! Mais afin de comprendre comment votre code va changer et à quoi s'intéresser spécifiquement pendant que vous codez, vous aurez sûrement envie de découvrir quels sont les changements introduits par Python 3 par rapport à Python 2. Pour atteindre cet objectif, les deux meilleurs moyens sont de lire le document :ref:`whatsnew-index` de chaque version de Python 3 et le livre `Porting to Python 3`_ (gratuit en ligne, en anglais). Il y a également une « anti-sèche » (`cheat sheet`_, ressource en anglais) très pratique du projet Python-Future.

source: Update your code
fr: Mettre à jour votre code

source: Once you feel like you know what is different in Python 3 compared to Python 2, it's time to update your code! You have a choice between two tools in porting your code automatically: Futurize_ and Modernize_. Which tool you choose will depend on how much like Python 3 you want your code to be. Futurize_ does its best to make Python 3 idioms and practices exist in Python 2, e.g. backporting the ``bytes`` type from Python 3 so that you have semantic parity between the major versions of Python. Modernize_, on the other hand, is more conservative and targets a Python 2/3 subset of Python, directly relying on six_ to help provide compatibility. As Python 3 is the future, it might be best to consider Futurize to begin adjusting to any new practices that Python 3 introduces which you are not accustomed to yet.
fr: Une fois que vous pensez en savoir suffisamment sur les différences entre Python 3 et Python 2, il est temps de mettre à jour votre code ! Vous avez le choix entre deux outils pour porter votre code automatiquement : Futurize_ et Modernize_. Le choix de l'outil dépend de la dose de Python 3 que vous souhaitez introduire dans votre code. Futurize_ s'efforce d'introduire les idiomes et pratiques de Python 3 dans Python 2, par exemple en réintroduisant le type ``bytes`` de Python 3 de telle sorte que la sémantique soit identique entre les deux versions majeures de Python. En revanche, Modernize_ est plus conservateur et vise un sous-ensemble d'instructions Python 2/3, en s'appuyant directement sur six_ pour la compatibilité. Python 3 étant le futur de Python, il pourrait être préférable d'utiliser *Futurize* afin de commencer à s'ajuster aux nouvelles pratiques introduites par Python 3 avec lesquelles vous n'êtes pas encore habitué.

source: Regardless of which tool you choose, they will update your code to run under Python 3 while staying compatible with the version of Python 2 you started with. Depending on how conservative you want to be, you may want to run the tool over your test suite first and visually inspect the diff to make sure the transformation is accurate. After you have transformed your test suite and verified that all the tests still pass as expected, then you can transform your application code knowing that any tests which fail is a translation failure.
fr: Indépendamment de l'outil sur lequel se porte votre choix, celui-ci mettra à jour votre code afin qu'il puisse être exécuté par Python 3 tout en maintenant sa compatibilité avec la version de Python 2 dont vous êtes parti. En fonction du niveau de prudence que vous visez, vous pouvez exécuter l'outil sur votre suite de test d'abord puis inspecter visuellement la différence afin de vous assurer que la transformation est exacte. Après avoir transformé votre suite de test et vérifié que tous les tests s'exécutent comme attendu, vous pouvez transformer le code de votre application avec l'assurance que chaque test qui échoue correspond à un échec de traduction.

source: Unfortunately the tools can't automate everything to make your code work under Python 3 and so there are a handful of things you will need to update manually to get full Python 3 support (which of these steps are necessary vary between the tools). Read the documentation for the tool you choose to use to see what it fixes by default and what it can do optionally to know what will (not) be fixed for you and what you may have to fix on your own (e.g. using ``io.open()`` over the built-in ``open()`` function is off by default in Modernize). Luckily, though, there are only a couple of things to watch out for which can be considered large issues that may be hard to debug if not watched for.
fr: Malheureusement les outils ne peuvent pas automatiser tous les changements requis pour permettre à votre code de s'exécuter sous Python 3 et il y a donc quelques points sur lesquels vous devrez travailler manuellement afin d'atteindre la compatibilité totale Python 3 (les étapes nécessaires peuvent varier en fonction de l'outil utilisé). Lisez la documentation de l'outil que vous avez choisi afin d'identifier ce qu'il corrige par défaut et ce qui peut être appliqué de façon optionnelle afin de savoir ce qui sera (ou non) corrigé pour vous ou ce que vous devrez modifier vous-même (par exemple, le remplacement ``io.open()`` plutôt que la fonction native ``open()`` est inactif par défaut dans *Modernize*). Heureusement, il n'y a que quelques points à surveiller qui peuvent réellement être considérés comme des problèmes difficiles à déboguer si vous n'y prêtez pas attention.

source: In Python 3, ``5 / 2 == 2.5`` and not ``2``; all division between ``int`` values result in a ``float``. This change has actually been planned since Python 2.2 which was released in 2002. Since then users have been encouraged to add ``from __future__ import division`` to any and all files which use the ``/`` and ``//`` operators or to be running the interpreter with the ``-Q`` flag. If you have not been doing this then you will need to go through your code and do two things:
fr: Dans Python 3, ``5 / 2 == 2.5`` et non ``2``; toutes les divisions entre des valeurs ``int`` renvoient un ``float``. Ce changement était en réalité planifié depuis Python 2.2, publié en 2002. Depuis cette date, les utilisateurs ont été encouragés à ajouter ``from __future__ import division`` à tous les fichiers utilisant les opérateurs ``/`` et ``//`` ou à exécuter l'interpréteur avec l'option ``-Q``. Si vous n'avez pas suivi cette recommandation, vous devrez manuellement modifier votre code et effectuer deux changements :

source: Add ``from __future__ import division`` to your files
fr: Ajouter ``from __future__ import division`` à vos fichiers

source: Update any division operator as necessary to either use ``//`` to use floor division or continue using ``/`` and expect a float
fr: Remplacer tous les opérateurs de division par ``//`` pour la division entière, le cas échant, ou utiliser ``/`` et vous attendre à un résultat flottant

source: The reason that ``/`` isn't simply translated to ``//`` automatically is that if an object defines a ``__truediv__`` method but not ``__floordiv__`` then your code would begin to fail (e.g. a user-defined class that uses ``/`` to signify some operation but not ``//`` for the same thing or at all).
fr: La raison pour laquelle ``/`` n'est pas simplement remplacé par ``//`` automatiquement est que si un objet définit une méthode ``__truediv__`` mais pas de méthode ``__floordiv__``, alors votre code pourrait produire une erreur (par exemple, une classe définie par l'utilisateur qui utilise ``/`` pour définir une opération quelconque mais pour laquelle ``//`` n'a pas du tout la même signification, voire n'est pas utilisé du tout).

source: Text versus binary data
fr: Texte et données binaires

source: In Python 2 you could use the ``str`` type for both text and binary data. Unfortunately this confluence of two different concepts could lead to brittle code which sometimes worked for either kind of data, sometimes not. It also could lead to confusing APIs if people didn't explicitly state that something that accepted ``str`` accepted either text or binary data instead of one specific type. This complicated the situation especially for anyone supporting multiple languages as APIs wouldn't bother explicitly supporting ``unicode`` when they claimed text data support.
fr: Dans Python 2, il était possible d'utiliser le type ``str`` pour du texte et pour des données binaires. Malheureusement cet amalgame entre deux concepts différents peut conduire à du code fragile pouvant parfois fonctionner pour les deux types de données et parfois non. Cela a également conduit à des API confuses si les auteurs ne déclaraient pas explicitement que quelque chose qui acceptait ``str`` était compatible avec du texte ou des données binaires et pas un seul des deux types. Cela a compliqué la situation pour les personnes devant gérer plusieurs langages avec des API qui ne se préoccupaient pas de la gestion de ``unicode`` lorsqu'elles affirmaient être compatibles avec des données au format texte.

source: To make the distinction between text and binary data clearer and more pronounced, Python 3 did what most languages created in the age of the internet have done and made text and binary data distinct types that cannot blindly be mixed together (Python predates widespread access to the internet). For any code that deals only with text or only binary data, this separation doesn't pose an issue. But for code that has to deal with both, it does mean you might have to now care about when you are using text compared to binary data, which is why this cannot be entirely automated.
fr: Afin de rendre la distinction entre texte et données binaires claire et prononcée, Python 3 a suivi la voie pavée par la plupart des langages créés à l'ère d'Internet et a séparé les types texte et données binaires de telle sorte qu'il ne soit plus possible de les confondre (Python est antérieur à la démocratisation de l'accès à Internet). Cette séparation ne pose pas de problème pour du code ne gérant soit que du texte, soit que des données binaires. Cependant un code source devant gérer les deux doit désormais se préoccuper du type des données manipulées, ce qui explique que ce processus ne peut pas être entièrement automatisé.
