Repository: python/python-docs-fr
Catalog: howto/regex.po
Languages: fr

source: Python supports several of Perl's extensions and adds an extension syntax to Perl's extension syntax. If the first character after the question mark is a ``P``, you know that it's an extension that's specific to Python.
fr: Python gère plusieurs des extensions Perl et rajoute une extension à la syntaxe des extensions Perl. Si le premier caractère après le point d'interrogation est ``P``, cela signifie que c'est une extension spécifique à Python.

source: Now that we've looked at the general extension syntax, we can return to the features that simplify working with groups in complex REs.
fr: Après avoir vu la syntaxe générale d'extension des RE, nous pouvons revenir aux fonctionnalités qui simplifient le travail avec les groupes dans des RE complexes.

source: Sometimes you'll want to use a group to denote a part of a regular expression, but aren't interested in retrieving the group's contents. You can make this fact explicit by using a non-capturing group: ``(?:...)``, where you can replace the ``...`` with any other regular expression. ::
fr: Parfois, vous souhaitez utiliser un groupe pour marquer une partie de l'expression régulière mais le contenu de ce groupe ne vous intéresse pas vraiment. Vous pouvez l'indiquer explicitement en utilisant la syntaxe de groupe, mais sans indiquer que vous voulez en capturer le contenu : ``(?:...)``, où vous remplacez les ``...`` par n'importe quelle expression régulière. ::

source: Except for the fact that you can't retrieve the contents of what the group matched, a non-capturing group behaves exactly the same as a capturing group; you can put anything inside it, repeat it with a repetition metacharacter such as ``*``, and nest it within other groups (capturing or non-capturing). ``(?:...)`` is particularly useful when modifying an existing pattern, since you can add new groups without changing how all the other groups are numbered. It should be mentioned that there's no performance difference in searching between capturing and non-capturing groups; neither form is any faster than the other.
fr: À part le fait que vous n'avez pas accès au contenu du groupe, un groupe se comporte exactement de la même manière qu'un groupe de capture ; vous pouvez placer n'importe quoi dedans, spécifier une répétition avec un métacaractère tel que ``*`` et l'imbriquer dans un autre groupe (de capture ou pas). ``(?:...)`` est particulièrement utile quand vous modifiez des motifs existants, puisque vous pouvez ajouter de nouveaux groupes sans changer la façon dont les autres groupes sont numérotés. Nous devons mentionner ici qu'il n'y a aucune différence de performance dans la recherche de groupes, de capture ou non ; les deux formes travaillent à la même vitesse.

source: A more significant feature is named groups: instead of referring to them by numbers, groups can be referenced by a name.
fr: Une fonctionnalité plus importante est le nommage des groupes : au lieu d'y faire référence par des nombres, vous pouvez référencer des groupes par leur nom.

source: The syntax for a named group is one of the Python-specific extensions: ``(?P<name>...)``. *name* is, obviously, the name of the group. Named groups behave exactly like capturing groups, and additionally associate a name with a group. The :ref:`match object <match-objects>` methods that deal with capturing groups all accept either integers that refer to the group by number or strings that contain the desired group's name. Named groups are still given numbers, so you can retrieve information about a group in two ways::
fr: La syntaxe pour nommer les groupes est l'une des extensions spécifiques à Python : ``(?P<nom>....)```. *nom* est, vous vous en doutez, le nom du groupe. Les groupes nommés se comportent exactement comme des groupes de capture, sauf qu'ils associent en plus un nom à un groupe. Les méthodes des :ref:`objets correspondances <match-objects>` qui gèrent les groupes de capture acceptent soit des entiers qui font référence aux numéros des groupes, soit des chaînes de caractères qui désignent les noms des groupes désirés. Les groupes nommés se voient toujours attribuer un numéro, vous pouvez ainsi récupérer les informations d'un groupe de deux façons ::

source: Additionally, you can retrieve named groups as a dictionary with :meth:`~re.Match.groupdict`::
fr: De plus, vous pouvez récupérer les groupes nommés comme dictionnaire avec :meth:`~re.Match.groupdict` ::

source: Named groups are handy because they let you use easily-remembered names, instead of having to remember numbers. Here's an example RE from the :mod:`imaplib` module::
fr: Les groupes nommés sont pratiques car il est plus facile de se rappeler un nom qu'un numéro. Voici un exemple de RE tirée du module :mod:`imaplib` ::

source: It's obviously much easier to retrieve ``m.group('zonem')``, instead of having to remember to retrieve group 9.
fr: Il est évidemment plus facile de récupérer ``m.group('zonem')`` que de se rappeler de récupérer le groupe 9.

source: The syntax for backreferences in an expression such as ``(...)\1`` refers to the number of the group. There's naturally a variant that uses the group name instead of the number. This is another Python extension: ``(?P=name)`` indicates that the contents of the group called *name* should again be matched at the current point. The regular expression for finding doubled words, ``\b(\w+)\s+\1\b`` can also be written as ``\b(?P<word>\w+)\s+(?P=word)\b``::
fr: La syntaxe des renvois dans une expression telle que ``(....)\1`` fait référence au numéro du groupe. Il y a naturellement une variante qui utilise le nom du groupe au lieu du numéro. C'est une autre extension Python : ``(?P=nom)`` indique que le contenu du groupe appelé *nom* doit correspondre à nouveau avec l'emplacement courant. L'expression régulière pour trouver des mots doublés, ``\b(\w+)\s+\1\b`` peut ainsi être ré-écrite en ``\b(?P<mot>\w+)\s+(?P=mot)\b`` ::

source: Lookahead Assertions
fr: Assertions prédictives

source: Another zero-width assertion is the lookahead assertion. Lookahead assertions are available in both positive and negative form, and look like this:
fr: Une autre assertion de largeur zéro est l'assertion prédictive. Une assertion prédictive peut s'exprimer sous deux formes, la positive et la négative, comme ceci :

source: Positive lookahead assertion. This succeeds if the contained regular expression, represented here by ``...``, successfully matches at the current location, and fails otherwise. But, once the contained expression has been tried, the matching engine doesn't advance at all; the rest of the pattern is tried right where the assertion started.
fr: Assertion prédictive positive. Elle réussit si l'expression régulière contenue, représentée ici par ``...``, correspond effectivement à l'emplacement courant ; dans le cas contraire, elle échoue. Mais, une fois que l'expression contenue a été essayée, le moteur de correspondance n'avance pas ; le reste du motif est testé à l'endroit même où l'assertion a commencé.

source: Negative lookahead assertion. This is the opposite of the positive assertion; it succeeds if the contained expression *doesn't* match at the current position in the string.
fr: Assertion prédictive négative. C'est l'opposée de l'assertion positive ; elle réussit si l'expression régulière contenue *ne* correspond *pas* à l'emplacement courant dans la chaine.

source: To make this concrete, let's look at a case where a lookahead is useful. Consider a simple pattern to match a filename and split it apart into a base name and an extension, separated by a ``.``. For example, in ``news.rc``, ``news`` is the base name, and ``rc`` is the filename's extension.
fr: Pour rendre ceci plus concret, regardons le cas où une prédiction est utile. Considérons un motif simple qui doit faire correspondre un nom de fichier et le diviser en un nom de base et une extension, séparés par un ``.``. Par exemple, dans ``news.rc``, ``news`` est le nom de base et ``rc`` est l'extension du nom de fichier.

source: The pattern to match this is quite simple:
fr: Le motif de correspondance est plutôt simple :

source: Notice that the ``.`` needs to be treated specially because it's a metacharacter, so it's inside a character class to only match that specific character. Also notice the trailing ``$``; this is added to ensure that all the rest of the string must be included in the extension. This regular expression matches ``foo.bar`` and ``autoexec.bat`` and ``sendmail.cf`` and ``printers.conf``.
fr: Notez que le ``.`` doit être traité spécialement car c'est un métacaractère, nous le plaçons donc à l'intérieur d'une classe de caractères pour ne faire correspondre que ce caractère spécifique. Notez également le ``$`` en fin ; nous l'avons ajouté pour nous assurer que tout le reste de la chaîne est bien inclus dans l'extension. Cette expression régulière fait correspondre ``truc.bar``, ``autoexec.bat``, ``sendmail.cf`` et ``printers.conf``.

source: Now, consider complicating the problem a bit; what if you want to match filenames where the extension is not ``bat``? Some incorrect attempts:
fr: Maintenant, compliquons un peu le problème ; si nous voulons faire correspondre les noms de fichiers dont l'extension n'est pas ``bat`` ? voici quelques tentatives incorrectes :

source: ``.*[.][^b].*$`` The first attempt above tries to exclude ``bat`` by requiring that the first character of the extension is not a ``b``. This is wrong, because the pattern also doesn't match ``foo.bar``.
fr: ``.*[.][^b].*$`` Le premier essai ci-dessus tente d'exclure ``bat`` en spécifiant que le premier caractère de l'extension ne doit pas être ``b``. Cela ne fonctionne pas, car le motif n'accepte pas ``truc.bar``.

source: The expression gets messier when you try to patch up the first solution by requiring one of the following cases to match: the first character of the extension isn't ``b``; the second character isn't ``a``; or the third character isn't ``t``. This accepts ``foo.bar`` and rejects ``autoexec.bat``, but it requires a three-letter extension and won't accept a filename with a two-letter extension such as ``sendmail.cf``. We'll complicate the pattern again in an effort to fix it.
fr: L'expression devient plus confuse si nous essayons de réparer la première solution en spécifiant l'un des cas suivants : le premier caractère de l'extension n'est pas ``b`` ; le deuxième caractère n'est pas ``a`` ; ou le troisième caractère n'est pas ``t```. Ce motif accepte ``truc.bar`` et rejette ``autoexec.bat``, mais elle nécessite une extension de trois lettres et n'accepte pas un nom de fichier avec une extension de deux lettres comme ``sendmail.cf``. Compliquons encore une fois le motif pour essayer de le réparer.

source: In the third attempt, the second and third letters are all made optional in order to allow matching extensions shorter than three characters, such as ``sendmail.cf``.
fr: Pour cette troisième tentative, les deuxième et troisième lettres sont devenues facultatives afin de permettre la correspondance avec des extensions plus courtes que trois caractères, comme ``sendmail.cf``.

source: The pattern's getting really complicated now, which makes it hard to read and understand. Worse, if the problem changes and you want to exclude both ``bat`` and ``exe`` as extensions, the pattern would get even more complicated and confusing.
fr: Le motif devient vraiment compliqué maintenant, ce qui le rend difficile à lire et à comprendre. Pire, si le problème change et que vous voulez exclure à la fois ``bat`` et ``exe`` en tant qu'extensions, le modèle deviendra encore plus compliqué et confus.

source: A negative lookahead cuts through all this confusion:
fr: Une assertion prédictive négative supprime toute cette confusion :

source: ``.*[.](?!bat$)[^.]*$`` The negative lookahead means: if the expression ``bat`` doesn't match at this point, try the rest of the pattern; if ``bat$`` does match, the whole pattern will fail. The trailing ``$`` is required to ensure that something like ``sample.batch``, where the extension only starts with ``bat``, will be allowed. The ``[^.]*`` makes sure that the pattern works when there are multiple dots in the filename.
fr: ``.*[.](?!bat$)[^.]*$`` Cette assertion prédictive négative signifie : si l'expression ``bat`` ne correspond pas à cet emplacement, essaie le reste du motif ; si ``bat$`` correspond, tout le motif échoue. Le ``$`` est nécessaire pour s'assurer que quelque chose comme ``sample.batch``, où c'est seulement le début de l'extension qui vaut ``bat``, est autorisé. Le ``[^...]*`` s'assure que le motif fonctionne lorsqu'il y a plusieurs points dans le nom de fichier.

source: Excluding another filename extension is now easy; simply add it as an alternative inside the assertion. The following pattern excludes filenames that end in either ``bat`` or ``exe``:
fr: Exclure une autre extension de nom de fichier est maintenant facile ; il suffit de l'ajouter comme alternative à l'intérieur de l'assertion. Le motif suivant exclut les noms de fichiers qui se terminent par ``bat`` ou ``exe`` :

source: Modifying Strings
fr: Modification de chaînes

source: Up to this point, we've simply performed searches against a static string. Regular expressions are also commonly used to modify strings in various ways, using the following pattern methods:
fr: Jusqu'à présent, nous avons simplement effectué des recherches dans une chaîne statique. Les expressions régulières sont aussi couramment utilisées pour modifier les chaînes de caractères de diverses manières, en utilisant les méthodes suivantes des motifs :

source: Split the string into a list, splitting it wherever the RE matches
fr: Découpe la chaîne de caractère en liste, la découpant partout où la RE correspond

source: Find all substrings where the RE matches, and replace them with a different string
fr: Recherche toutes les sous-chaînes de caractères où la RE correspond et les substitue par une chaîne de caractères différente

source: Does the same thing as :meth:`!sub`, but returns the new string and the number of replacements
fr: Fait la même chose que :meth:`!sub`, mais renvoie la nouvelle chaîne et le nombre de remplacements effectués

source: Splitting Strings
fr: Découpage de chaînes

source: The :meth:`~re.Pattern.split` method of a pattern splits a string apart wherever the RE matches, returning a list of the pieces. It's similar to the :meth:`~str.split` method of strings but provides much more generality in the delimiters that you can split by; string :meth:`!split` only supports splitting by whitespace or by a fixed string. As you'd expect, there's a module-level :func:`re.split` function, too.
fr: La méthode :meth:`~re.Pattern.Pattern.split` d'un motif divise une chaîne de caractères à chaque fois que la RE correspond, retournant la liste des morceaux. C'est similaire à la méthode :meth:`~str.split` mais est beaucoup plus générale par les délimiteurs que vous pouvez spécifier ; la méthode :meth:`!split` du type *string* ne gère que les découpages en suivant les "blancs" ou suivant une chaîne définie. Comme vous pouvez vous y attendre, il y a aussi une fonction :func:`re.split` de niveau module.

source: Split *string* by the matches of the regular expression. If capturing parentheses are used in the RE, then their contents will also be returned as part of the resulting list. If *maxsplit* is nonzero, at most *maxsplit* splits are performed.
fr: Découpe *string* en suivant les correspondances de l'expression régulière. Si des parenthèses de capture sont utilisées dans la RE, leur contenu est également renvoyé dans la liste résultante. Si *maxsplit* n'est pas nul, au plus *maxsplit* découpages sont effectués.

source: You can limit the number of splits made, by passing a value for *maxsplit*. When *maxsplit* is nonzero, at most *maxsplit* splits will be made, and the remainder of the string is returned as the final element of the list. In the following example, the delimiter is any sequence of non-alphanumeric characters. ::
fr: Vous pouvez limiter le nombre de découpages effectués en passant une valeur pour *maxsplit*. Quand *maxsplit* n'est pas nul, au plus *maxsplit* découpages sont effectués et le reste de la chaîne est renvoyé comme dernier élément de la liste. Dans l'exemple suivant, le délimiteur est toute séquence de caractères non alphanumériques. ::

source: Sometimes you're not only interested in what the text between delimiters is, but also need to know what the delimiter was. If capturing parentheses are used in the RE, then their values are also returned as part of the list. Compare the following calls::
fr: Parfois, vous voulez récupérer le texte entre les délimiteurs mais aussi quel était le délimiteur. Si des parenthèses de capture sont utilisées dans la RE, leurs valeurs sont également renvoyées dans la liste. Comparons les appels suivants ::

source: The module-level function :func:`re.split` adds the RE to be used as the first argument, but is otherwise the same. ::
fr: La fonction de niveau module :func:`re.split` ajoute la RE à utiliser comme premier argument, mais est par ailleurs identique. ::

source: Search and Replace
fr: Recherche et substitution

source: Another common task is to find all the matches for a pattern, and replace them with a different string. The :meth:`~re.Pattern.sub` method takes a replacement value, which can be either a string or a function, and the string to be processed.
fr: Une autre tâche classique est de trouver toutes les correspondances d'un motif et de les remplacer par une autre chaîne. La méthode :meth:`~re.Pattern.sub` prend une valeur de substitution, qui peut être une chaîne de caractères ou une fonction, et la chaîne à traiter.

source: Returns the string obtained by replacing the leftmost non-overlapping occurrences of the RE in *string* by the replacement *replacement*. If the pattern isn't found, *string* is returned unchanged.
fr: Renvoie la chaîne obtenue en remplaçant les occurrences sans chevauchement les plus à gauche de la RE dans *string* par la substitution *replacement*. Si le motif n'est pas trouvé, *string* est renvoyée inchangée.

source: The optional argument *count* is the maximum number of pattern occurrences to be replaced; *count* must be a non-negative integer. The default value of 0 means to replace all occurrences.
fr: L'argument optionnel *count* est le nombre maximum d'occurrences du motif à remplacer ; *count* doit être un entier positif ou nul. La valeur par défaut de 0 signifie qu'il faut remplacer toutes les occurrences.

source: Here's a simple example of using the :meth:`~re.Pattern.sub` method. It replaces colour names with the word ``colour``::
fr: Voici un exemple simple utilisant la méthode :meth:`~re.Pattern.sub`. Nous remplaçons les noms des couleurs par le mot ``colour`` ::

source: The :meth:`~re.Pattern.subn` method does the same work, but returns a 2-tuple containing the new string value and the number of replacements that were performed::
fr: La méthode :meth:`~re.Pattern.subn.subn` fait la même chose mais renvoie un couple contenant la nouvelle valeur de la chaîne de caractères et le nombre de remplacements effectués ::

source: Empty matches are replaced only when they're not adjacent to a previous empty match. ::
fr: Les correspondances vides ne sont remplacées que lorsqu'elles ne sont pas adjacentes à une correspondance vide précédente. ::

source: If *replacement* is a string, any backslash escapes in it are processed. That is, ``\n`` is converted to a single newline character, ``\r`` is converted to a carriage return, and so forth. Unknown escapes such as ``\&`` are left alone. Backreferences, such as ``\6``, are replaced with the substring matched by the corresponding group in the RE. This lets you incorporate portions of the original text in the resulting replacement string.
fr: Si *replacement* est une chaîne de caractères, toute barre oblique inverse d'échappement est traitée. C'est-à-dire que ```\n`` est converti en caractère de nouvelle ligne, ``\r`` est converti en retour chariot, et ainsi de suite. Les échappements inconnus comme ``\&`` sont laissés tels quels. Les renvois, tels que ``\6``, sont remplacés par la sous-chaîne correspondante au groupe dans le RE. Ceci vous permet d'incorporer des parties du texte original dans la chaîne de remplacement résultante.

source: This example matches the word ``section`` followed by a string enclosed in ``{``, ``}``, and changes ``section`` to ``subsection``::
fr: Cet exemple fait correspondre le mot ``section`` suivi par une chaîne encadrée par ``{`` et ``}``, et modifie ``section`` en ``subsection`` ::

source: There's also a syntax for referring to named groups as defined by the ``(?P<name>...)`` syntax. ``\g<name>`` will use the substring matched by the group named ``name``, and ``\g<number>`` uses the corresponding group number. ``\g<2>`` is therefore equivalent to ``\2``, but isn't ambiguous in a replacement string such as ``\g<2>0``. (``\20`` would be interpreted as a reference to group 20, not a reference to group 2 followed by the literal character ``'0'``.) The following substitutions are all equivalent, but use all three variations of the replacement string. ::
fr: Il existe aussi une syntaxe pour faire référence aux groupes nommés définis par la syntaxe ``(?P<nom>....)``. ``\g<nom>`` utilise la sous-chaîne correspondante au groupe nommé ``nom`` et ``\g<numéro>`` utilise le numéro de groupe correspondant. ``\g<2>`` est donc l'équivalent de ``\2``, mais n'est pas ambigu dans une chaîne de substitution telle que ``\g<2>0`` (``\20`` serait interprété comme une référence au groupe 20 et non comme une référence au groupe 2 suivie du caractère littéral ``'0'``). Les substitutions suivantes sont toutes équivalentes mais utilisent les trois variantes de la chaîne de remplacement. ::

source: *replacement* can also be a function, which gives you even more control. If *replacement* is a function, the function is called for every non-overlapping occurrence of *pattern*. On each call, the function is passed a :ref:`match object <match-objects>` argument for the match and can use this information to compute the desired replacement string and return it.
fr: *replacement* peut aussi être une fonction, ce qui vous donne encore plus de contrôle. Si *replacement* est une fonction, la fonction est appelée pour chaque occurrence non chevauchante de *pattern*. À chaque appel, un argument :ref:`objet correspondance <match-objects>` est passé à la fonction, qui peut utiliser cette information pour calculer la chaîne de remplacement désirée et la renvoyer.

source: In the following example, the replacement function translates decimals into hexadecimal::
fr: Dans l'exemple suivant, la fonction de substitution convertit un nombre décimal en hexadécimal ::

source: When using the module-level :func:`re.sub` function, the pattern is passed as the first argument. The pattern may be provided as an object or as a string; if you need to specify regular expression flags, you must either use a pattern object as the first parameter, or use embedded modifiers in the pattern string, e.g. ``sub("(?i)b+", "x", "bbbb BBBB")`` returns ``'x x'``.
fr: Quand vous utilisez la fonction de niveau module :func:`re.sub`, le motif est passé comme premier argument. Vous pouvez fournir le motif sous forme d'objet ou de chaîne de caractères ; si vous avez besoin de spécifier des options pour l'expression régulière, vous devez soit utiliser un objet motif comme premier paramètre, soit utiliser des modificateurs intégrés dans la chaîne de caractères, par exemple ``sub("(?i)b+", "x", "bbbb BBBBB")```renvoie ``'x x'``.

source: Common Problems
fr: Problèmes classiques
