Repository: python/python-docs-fr
Catalog: howto/regex.po
Languages: fr

source: Regular Expression HOWTO
fr: Guide des expressions régulières

source: Author
fr: Auteur

source: Abstract
fr: Résumé

source: This document is an introductory tutorial to using regular expressions in Python with the :mod:`re` module. It provides a gentler introduction than the corresponding section in the Library Reference.
fr: Ce document constitue un guide d'introduction à l'utilisation des expressions régulières en Python avec le module :mod:`re`. Il fournit une introduction plus abordable que la section correspondante dans le guide de référence de la bibliothèque.

source: Regular expressions (called REs, or regexes, or regex patterns) are essentially a tiny, highly specialized programming language embedded inside Python and made available through the :mod:`re` module. Using this little language, you specify the rules for the set of possible strings that you want to match; this set might contain English sentences, or e-mail addresses, or TeX commands, or anything you like. You can then ask questions such as "Does this string match the pattern?", or "Is there a match for the pattern anywhere in this string?". You can also use REs to modify a string or to split it apart in various ways.
fr: Les expressions régulières (notées RE ou motifs *regex* dans ce document) sont essentiellement un petit langage de programmation hautement spécialisé embarqué dans Python et dont la manipulation est rendue possible par l'utilisation du module :mod:`re`. En utilisant ce petit langage, vous définissez des règles pour spécifier une correspondance avec un ensemble souhaité de chaînes de caractères ; ces chaînes peuvent être des phrases, des adresses de courriel, des commandes TeX ou tout ce que vous voulez. Vous pouvez ensuite poser des questions telles que "Est-ce que cette chaîne de caractères correspond au motif ?" ou "Y a-t-il une correspondance pour ce motif à l'intérieur de la chaîne de caractères ?". Vous pouvez aussi utiliser les RE pour modifier une chaîne de caractères ou la découper de différentes façons.

source: Regular expression patterns are compiled into a series of bytecodes which are then executed by a matching engine written in C. For advanced use, it may be necessary to pay careful attention to how the engine will execute a given RE, and write the RE in a certain way in order to produce bytecode that runs faster. Optimization isn't covered in this document, because it requires that you have a good understanding of the matching engine's internals.
fr: Un motif d'expression régulière est compilé en code intermédiaire (*bytecode* en anglais) qui est ensuite exécuté par un moteur de correspondance écrit en C. Pour une utilisation plus poussée, il peut s'avérer nécessaire de s'intéresser à la manière dont le moteur exécute la RE afin d'écrire une expression dont le code intermédiaire est plus rapide. L'optimisation n'est pas traitée dans ce document, parce qu'elle nécessite d'avoir une bonne compréhension des mécanismes internes du moteur de correspondance.

source: The regular expression language is relatively small and restricted, so not all possible string processing tasks can be done using regular expressions. There are also tasks that *can* be done with regular expressions, but the expressions turn out to be very complicated. In these cases, you may be better off writing Python code to do the processing; while Python code will be slower than an elaborate regular expression, it will also probably be more understandable.
fr: Le langage des expressions régulières est relativement petit et restreint, donc toutes les tâches de manipulation de chaînes de caractères ne peuvent pas être réalisées à l'aide d'expressions régulières. Il existe aussi des tâches qui *peuvent* être réalisées à l'aide d'expressions régulières mais qui ont tendance à produire des expressions régulières très compliquées. Dans ces cas, il est plus utile d'écrire du code Python pour réaliser le traitement ; même si le code Python est plus lent qu'une expression régulière élaborée, il sera probablement plus compréhensible.

source: Simple Patterns
fr: Motifs simples

source: We'll start by learning about the simplest possible regular expressions. Since regular expressions are used to operate on strings, we'll begin with the most common task: matching characters.
fr: Nous commençons par étudier les expressions régulières les plus simples. Dans la mesure où les expressions régulières sont utilisées pour manipuler des chaînes de caractères, nous commençons par l'action la plus courante : la correspondance de caractères.

source: For a detailed explanation of the computer science underlying regular expressions (deterministic and non-deterministic finite automata), you can refer to almost any textbook on writing compilers.
fr: Pour une explication détaillée sur le concept informatique sous-jacent aux expressions régulières (automate à états déterministe ou non-déterministe), vous pouvez vous référer à n'importe quel manuel sur l'écriture de compilateurs.

source: Matching Characters
fr: Correspondance de caractères

source: Most letters and characters will simply match themselves. For example, the regular expression ``test`` will match the string ``test`` exactly. (You can enable a case-insensitive mode that would let this RE match ``Test`` or ``TEST`` as well; more about this later.)
fr: La plupart des lettres ou caractères correspondent simplement à eux-mêmes. Par exemple, l'expression régulière ``test`` correspond à la chaîne de caractères ``test``, précisément. Vous pouvez activer le mode non-sensible à la casse qui permet à cette RE de correspondre également à ``Test`` ou ``TEST`` (ce sujet est traité par la suite).

source: There are exceptions to this rule; some characters are special :dfn:`metacharacters`, and don't match themselves. Instead, they signal that some out-of-the-ordinary thing should be matched, or they affect other portions of the RE by repeating them or changing their meaning. Much of this document is devoted to discussing various metacharacters and what they do.
fr: Il existe des exceptions à cette règle ; certains caractères sont des :dfn:`métacaractères` spéciaux et ne correspondent pas à eux-mêmes. Au lieu de cela, ils signalent que certaines choses non ordinaires doivent correspondre, ou ils affectent d'autre portions de la RE en les répétant ou en changeant leur sens. Une grande partie de ce document est consacrée au fonctionnement de ces métacaractères.

source: Here's a complete list of the metacharacters; their meanings will be discussed in the rest of this HOWTO.
fr: Voici une liste complète des métacaractères ; leur sens est décrit dans la suite de ce guide.

source: The first metacharacters we'll look at are ``[`` and ``]``. They're used for specifying a character class, which is a set of characters that you wish to match. Characters can be listed individually, or a range of characters can be indicated by giving two characters and separating them by a ``'-'``. For example, ``[abc]`` will match any of the characters ``a``, ``b``, or ``c``; this is the same as ``[a-c]``, which uses a range to express the same set of characters. If you wanted to match only lowercase letters, your RE would be ``[a-z]``.
fr: Les premiers métacaractères que nous étudions sont ``[`` et ``]``. Ils sont utilisés pour spécifier une classe de caractères, qui forme un ensemble de caractères dont vous souhaitez trouver la correspondance. Les caractères peuvent être listés individuellement, ou une plage de caractères peut être indiquée en fournissant deux caractères séparés par un `'-'``. Par exemple, ``[abc]`` correspond à n'importe quel caractère parmi ``a``, ``b``, ou ``c`` ; c'est équivalent à ``[a-c]``, qui utilise une plage pour exprimer le même ensemble de caractères. Si vous voulez trouver une chaîne qui ne contient que des lettres en minuscules, la RE est ``[a-z]``.

source: Metacharacters are not active inside classes. For example, ``[akm$]`` will match any of the characters ``'a'``, ``'k'``, ``'m'``, or ``'$'``; ``'$'`` is usually a metacharacter, but inside a character class it's stripped of its special nature.
fr: Les métacaractères ne sont pas actifs dans les classes. Par exemple, ``[akm$]`` correspond à n'importe quel caractère parmi ``'a'``, ``'k'``, ``'m'`` ou ``'$'`` ; ``'$'`` est habituellement un métacaractère mais dans une classe de caractères, il est dépourvu de sa signification spéciale.

source: You can match the characters not listed within the class by :dfn:`complementing` the set. This is indicated by including a ``'^'`` as the first character of the class. For example, ``[^5]`` will match any character except ``'5'``. If the caret appears elsewhere in a character class, it does not have special meaning. For example: ``[5^]`` will match either a ``'5'`` or a ``'^'``.
fr: Vous pouvez trouver une correspondance avec les caractères non listés dans une classe en spécifiant le :dfn:`complément` de l'ensemble. Ceci est indiqué en plaçant un ``'^'`` en tant que premier caractère de la classe. Par exemple, ``[^5]`` correspond à tous les caractères, sauf ``'5'``. Si le caret se trouve ailleurs dans la classe de caractères, il ne possède pas de signification spéciale. Ainsi, ``[5^]`` correspond au ``'5'`` ou au caractère ``'^'``.

source: Perhaps the most important metacharacter is the backslash, ``\``. As in Python string literals, the backslash can be followed by various characters to signal various special sequences. It's also used to escape all the metacharacters so you can still match them in patterns; for example, if you need to match a ``[`` or ``\``, you can precede them with a backslash to remove their special meaning: ``\[`` or ``\\``.
fr: Le métacaractère le plus important est probablement la barre oblique inverse ( *backslash* en anglais), ``\``. Comme dans les chaînes de caractères en Python, la barre oblique inverse peut être suivie par différents caractères pour signaler différentes séquences spéciales. Elle est aussi utilisée pour échapper tous les métacaractères afin d'en trouver les correspondances dans les motifs ; par exemple, si vous devez trouver une correspondance pour ``[`` ou ``\``, vous pouvez les précéder avec une barre oblique inverse pour annuler leur signification spéciale : ``\[`` ou ``\\``.

source: Some of the special sequences beginning with ``'\'`` represent predefined sets of characters that are often useful, such as the set of digits, the set of letters, or the set of anything that isn't whitespace.
fr: Certaines séquences spéciales commençant par ``'\'`` représentent des ensembles de caractères prédéfinis qui sont souvent utiles, tels que l'ensemble des chiffres, l'ensemble des lettres ou l'ensemble des caractères qui ne sont pas des "blancs".

source: Let's take an example: ``\w`` matches any alphanumeric character. If the regex pattern is expressed in bytes, this is equivalent to the class ``[a-zA-Z0-9_]``. If the regex pattern is a string, ``\w`` will match all the characters marked as letters in the Unicode database provided by the :mod:`unicodedata` module. You can use the more restricted definition of ``\w`` in a string pattern by supplying the :const:`re.ASCII` flag when compiling the regular expression.
fr: Prenons un exemple : ``\w`` correspond à n'importe quel caractère alphanumérique. Si l'expression régulière est exprimée en *bytes*, c'est équivalent à la classe ``[a-zA-Z0-9_]``. Si l'expression régulière est une chaîne de caractères, ``\w`` correspond à tous les caractères identifiés comme lettre dans la base de données Unicode fournie par le module :mod:`unicodedata`. Vous pouvez utiliser la définition plus restrictive de ``\w`` dans un motif exprimé en chaîne de caractères en spécifiant l'option :const:`re.ASCII` lors de la compilation de l'expression régulière.

source: The following list of special sequences isn't complete. For a complete list of sequences and expanded class definitions for Unicode string patterns, see the last part of :ref:`Regular Expression Syntax <re-syntax>` in the Standard Library reference. In general, the Unicode versions match any character that's in the appropriate category in the Unicode database.
fr: La liste de séquences spéciales suivante est incomplète. Pour une liste complète des séquences et définitions de classes étendues relatives aux motifs de chaînes de caractères Unicode, reportez-vous à la dernière partie de la référence :ref:`Syntaxe d'Expressions Régulières <re-syntax>` de la bibliothèque standard. En général, les versions Unicode trouvent une correspondance avec n'importe quel caractère présent dans la catégorie appropriée de la base de données Unicode.

source: Matches any decimal digit; this is equivalent to the class ``[0-9]``.
fr: Correspond à n'importe quel caractère numérique ; équivalent à la classe ``[0-9]``.

source: Matches any non-digit character; this is equivalent to the class ``[^0-9]``.
fr: Correspond à n'importe caractère non numérique ; équivalent à la classe ``[^0-9]``.

source: Matches any whitespace character; this is equivalent to the class ``[ \t\n\r\f\v]``.
fr: Correspond à n'importe quel caractère "blanc" ; équivalent à la classe ``[ \t\n\r\f\v]``.

source: Matches any non-whitespace character; this is equivalent to the class ``[^ \t\n\r\f\v]``.
fr: Correspond à n'importe caractère autre que "blanc" ; équivalent à la classe ``[^ \t\n\r\f\v]``.

source: Matches any alphanumeric character; this is equivalent to the class ``[a-zA-Z0-9_]``.
fr: Correspond à n'importe caractère alphanumérique ; équivalent à la classe ``[a-zA-Z0-9_]``.

source: Matches any non-alphanumeric character; this is equivalent to the class ``[^a-zA-Z0-9_]``.
fr: Correspond à n'importe caractère non-alphanumérique ; équivalent à la classe ``[^a-zA-Z0-9_]``.

source: These sequences can be included inside a character class. For example, ``[\s,.]`` is a character class that will match any whitespace character, or ``','`` or ``'.'``.
fr: Ces séquences peuvent être incluses dans une classe de caractères. Par exemple, ``[\s,.]`` est une classe de caractères qui correspond à tous les caractères "blancs" ou ``','`` ou ``'.'``.

source: The final metacharacter in this section is ``.``. It matches anything except a newline character, and there's an alternate mode (:const:`re.DOTALL`) where it will match even a newline. ``.`` is often used where you want to match "any character".
fr: Le dernier métacaractère de cette section est ``.``. Il correspond à tous les caractères, à l'exception du caractère de retour à la ligne ; il existe un mode alternatif (:const:`re.DOTALL`) dans lequel il correspond également eu caractère de retour à la ligne. ``.`` est souvent utilisé lorsque l'on veut trouver une correspondance avec "n'importe quel caractère".

source: Repeating Things
fr: Répétitions

source: Being able to match varying sets of characters is the first thing regular expressions can do that isn't already possible with the methods available on strings. However, if that was the only additional capability of regexes, they wouldn't be much of an advance. Another capability is that you can specify that portions of the RE must be repeated a certain number of times.
fr: Trouver des correspondances de divers ensembles de caractères est la première utilisation des expressions régulières, ce que l'on ne peut pas faire avec les méthodes des chaînes. Cependant, si c'était la seule possibilité des expressions régulières, le gain ne serait pas significatif. Une autre utilisation consiste à spécifier des portions d'une RE qui peuvent être répétées un certain nombre de fois.

source: The first metacharacter for repeating things that we'll look at is ``*``. ``*`` doesn't match the literal character ``'*'``; instead, it specifies that the previous character can be matched zero or more times, instead of exactly once.
fr: Le premier métacaractère pour la répétition que nous abordons est ``*``. ``*`` ne correspond pas au caractère littéral ``'*'`` ; à la place, il spécifie que le caractère précédent peut correspondre zéro, une ou plusieurs fois (au lieu d'une seule fois).

source: For example, ``ca*t`` will match ``'ct'`` (0 ``'a'`` characters), ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'`` characters), and so forth.
fr: Par exemple, ``cha*t`` correspond à ``'cht'`` (0 caractère ``'a'``), ``'chat'`` (1 ``'a'``), ``'chaaat'`` (3 caractères ``'a'``) et ainsi de suite.

source: Repetitions such as ``*`` are :dfn:`greedy`; when repeating a RE, the matching engine will try to repeat it as many times as possible. If later portions of the pattern don't match, the matching engine will then back up and try again with fewer repetitions.
fr: Les répétitions telles que ``*`` sont :dfn:`gloutonnes` ; quand vous répétez une RE, le moteur de correspondance essaie de trouver la correspondance la plus longue en répétant le motif tant qu'il le peut. Si la suite du motif ne correspond pas, le moteur de correspondance revient en arrière et essaie avec moins de répétitions.

source: A step-by-step example will make this more obvious. Let's consider the expression ``a[bcd]*b``. This matches the letter ``'a'``, zero or more letters from the class ``[bcd]``, and finally ends with a ``'b'``. Now imagine matching this RE against the string ``'abcbd'``.
fr: Un exemple étape par étape mettra les choses au clair. Considérons l'expression ``a[bcd]*b``. Elle correspond à la lettre ``'a'``, suivi d'aucune ou plusieurs lettres de la classe `[bcd]`` et finit par un ``'b'``. Maintenant, supposons que nous cherchons une correspondance de cette RE avec la chaîne de caractères ``'abcbd'``.

source: Step
fr: Étape

source: Matched
fr: Correspond

source: Explanation
fr: Explication

source: The ``a`` in the RE matches.
fr: Le ``a`` correspond dans la RE.

source: The engine matches ``[bcd]*``, going as far as it can, which is to the end of the string.
fr: Le moteur de correspondance trouve ``[bcd]*``, va aussi loin qu'il le peut, ce qui n'est pas la fin de la chaîne.

source: *Failure*
fr: *échec*

source: The engine tries to match ``b``, but the current position is at the end of the string, so it fails.
fr: Le moteur essaie de trouver une correspondance avec ``b`` mais la position courante est à la fin de la chaîne de caractères, donc il échoue.

source: Back up, so that ``[bcd]*`` matches one less character.
fr: Retour en arrière, de manière à ce que ``[bcd]*`` corresponde avec un caractère de moins.

source: Try ``b`` again, but the current position is at the last character, which is a ``'d'``.
fr: Essaie encore ``b``, mais la position courante est le dernier caractère, qui est ``'d'``.

source: Back up again, so that ``[bcd]*`` is only matching ``bc``.
fr: Encore un retour en arrière, de manière à ce que ``[bcd]*`` ne corresponde qu'à ``bc``.

source: Try ``b`` again. This time the character at the current position is ``'b'``, so it succeeds.
fr: Essaie ``b`` encore une fois. Cette fois, le caractère à la position courante est ``'b'``, donc cela fonctionne.

source: The end of the RE has now been reached, and it has matched ``'abcb'``. This demonstrates how the matching engine goes as far as it can at first, and if no match is found it will then progressively back up and retry the rest of the RE again and again. It will back up until it has tried zero matches for ``[bcd]*``, and if that subsequently fails, the engine will conclude that the string doesn't match the RE at all.
fr: La fin de la RE est maintenant atteinte et la correspondance trouvée est ``'abcb'``. Ceci démontre comment le moteur de correspondance essaie d'aller le plus loin possible en premier et, si la correspondance échoue, il revient progressivement en arrière et ré-essaie avec le reste de la RE encore et encore. Il revient en arrière jusqu'à qu'il n'y ait aucune correspondance pour ``[bcd]*`` et, si cela échoue toujours, le moteur conclut que la chaîne de caractères et la RE ne correspondent pas du tout.

source: Another repeating metacharacter is ``+``, which matches one or more times. Pay careful attention to the difference between ``*`` and ``+``; ``*`` matches *zero* or more times, so whatever's being repeated may not be present at all, while ``+`` requires at least *one* occurrence. To use a similar example, ``ca+t`` will match ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'``\ s), but won't match ``'ct'``.
fr: Un autre métacaractère de répétition est ``+``, qui fait correspondre une ou plusieurs fois. Faites bien attention à la différence entre ``*`` et ``+`` ; ``*`` fait correspondre *zéro* fois ou plus, ainsi ce qui doit être répété peut ne pas être présent du tout, alors que ``+`` requiert au moins *une* occurrence. Pour continuer avec le même exemple, ``cha+t`` correspond avec ``'chat'`` (1 ``'a'``), ``'chaaat'`` (3 ``'a'``) mais ne correspond pas avec ``'ct'``.

source: There are two more repeating qualifiers. The question mark character, ``?``, matches either once or zero times; you can think of it as marking something as being optional. For example, ``home-?brew`` matches either ``'homebrew'`` or ``'home-brew'``.
fr: Il existe deux autres quantificateurs pour les répétitions. Le point d'interrogation, ``?``, fait correspondre zéro ou une fois ; vous pouvez vous le représenter comme indiquant une option. Par exemple, ``méta-?caractère`` fait correspondre soit ``métacaractère``, soit ``méta-caractère``.

source: The most complicated repeated qualifier is ``{m,n}``, where *m* and *n* are decimal integers. This qualifier means there must be at least *m* repetitions, and at most *n*. For example, ``a/{1,3}b`` will match ``'a/b'``, ``'a//b'``, and ``'a///b'``. It won't match ``'ab'``, which has no slashes, or ``'a////b'``, which has four.
fr: Le plus compliqué des quantificateurs est ``{m,n}`` où *m* et *n* sont des entiers décimaux. Ce quantificateur indique qu'il faut au moins *m* répétitions et au plus *n*. Par exemple, ``a/{1,3}b`` fait correspondre ``'a/b'``, ``'a//b'`` et ``'a///b'``. Elle ne fait pas correspondre ``'ab'`` (pas de barre oblique) ni ``'a////b'`` (quatre barres obliques).

source: You can omit either *m* or *n*; in that case, a reasonable value is assumed for the missing value. Omitting *m* is interpreted as a lower limit of 0, while omitting *n* results in an upper bound of infinity.
fr: Vous pouvez omettre soit *m*, soit *n* ; dans ce cas, une valeur raisonnable est prise pour la valeur manquante. Omettre *m* considère que la borne basse est 0 alors qu'omettre *n* signifie qu'il n'y a pas de borne supérieure.

source: Readers of a reductionist bent may notice that the three other qualifiers can all be expressed using this notation. ``{0,}`` is the same as ``*``, ``{1,}`` is equivalent to ``+``, and ``{0,1}`` is the same as ``?``. It's better to use ``*``, ``+``, or ``?`` when you can, simply because they're shorter and easier to read.
fr: Le lecteur attentif aura noté que les trois premiers quantificateurs peuvent être exprimés en utilisant cette notation. ``{0,}`` est la même chose que ``*``, ``{1,}`` est équivalent à ``+`` et ``{0,1}`` se comporte comme ``?``. Il est préférable d'utiliser ``*``, ``+`` ou ``?`` quand vous le pouvez, simplement parce qu'ils sont plus courts et plus faciles à lire.

source: Using Regular Expressions
fr: Utilisation des expressions régulières

source: Now that we've looked at some simple regular expressions, how do we actually use them in Python? The :mod:`re` module provides an interface to the regular expression engine, allowing you to compile REs into objects and then perform matches with them.
fr: Maintenant que nous avons vu quelques expressions régulières simples, utilisons-les concrètement. Le module :mod:`re` fournit une interface pour le moteur de correspondance, ce qui permet de compiler les RE en objets et d'effectuer des correspondances avec.
