Repository: python/python-docs-fr
Catalog: howto/regex.po
Languages: fr

source: Regular expressions are a powerful tool for some applications, but in some ways their behaviour isn't intuitive and at times they don't behave the way you may expect them to. This section will point out some of the most common pitfalls.
fr: Les expressions régulières constituent un outil puissant pour certaines applications mais, à certains égards, leur comportement n'est pas intuitif et, parfois, elles ne se comportent pas comme vous pouvez vous y attendre. Cette section met en évidence certains des pièges les plus courants.

source: Use String Methods
fr: Utilisez les méthodes du type *string*

source: Sometimes using the :mod:`re` module is a mistake. If you're matching a fixed string, or a single character class, and you're not using any :mod:`re` features such as the :const:`~re.IGNORECASE` flag, then the full power of regular expressions may not be required. Strings have several methods for performing operations with fixed strings and they're usually much faster, because the implementation is a single small C loop that's been optimized for the purpose, instead of the large, more generalized regular expression engine.
fr: Parfois, il ne faut pas utiliser le module :mod:`re`. Si vous faites correspondre une chaîne fixe, ou une classe à un seul caractère, et que vous n'utilisez pas les fonctionnalités de :mod:`re` telles que l'option :const:`~re.IGNORECASE`, alors la puissance des expressions régulières n'est pas nécessaire. Les chaînes de caractères ont plusieurs méthodes pour opérer sur des chaînes fixes et elles sont généralement beaucoup plus rapides, parce que l'implémentation est une seule petite boucle C qui a été optimisée, au lieu du gros moteur d'expressions régulières plus généraliste.

source: One example might be replacing a single fixed string with another one; for example, you might replace ``word`` with ``deed``. :func:`re.sub` seems like the function to use for this, but consider the :meth:`~str.replace` method. Note that :meth:`!replace` will also replace ``word`` inside words, turning ``swordfish`` into ``sdeedfish``, but the naive RE ``word`` would have done that, too. (To avoid performing the substitution on parts of words, the pattern would have to be ``\bword\b``, in order to require that ``word`` have a word boundary on either side. This takes the job beyond :meth:`!replace`'s abilities.)
fr: Nous pouvons prendre l'exemple du remplacement d'une seule chaîne fixe par une autre ; vous souhaitez remplacer ``mot`` par ``acte``. :func:`re.sub` semble être faite pour cela, mais regardons la méthode :meth:`~str.replace`. Notons que :meth:`!replace` remplace aussi ``mot`` à l'intérieur des mots, transformant ``moteur`` en ``acteeur``, mais la RE naïve ``mot`` aurait aussi fait cela (pour éviter d'effectuer la substitution sur des parties de mots, le motif doit être ``\bmot\b``, qui exige que ``mot`` soit en limite de mot d'un côté et de l'autre ; c'est au-delà des capacités de la méthode :meth:`!replace`).

source: Another common task is deleting every occurrence of a single character from a string or replacing it with another single character. You might do this with something like ``re.sub('\n', ' ', S)``, but :meth:`~str.translate` is capable of doing both tasks and will be faster than any regular expression operation can be.
fr: Une autre tâche classique est de supprimer chaque occurrence d'un seul caractère d'une chaîne de caractères ou de le remplacer par un autre caractère unique. Vous pouvez le faire avec quelque chose comme ``re.sub('\n', ' ', S)``, mais :meth:`~str.translate` en est capable et est plus rapide que n'importe quelle opération d'expression régulière.

source: In short, before turning to the :mod:`re` module, consider whether your problem can be solved with a faster and simpler string method.
fr: Bref, avant de passer au module :mod:`re`, évaluez d'abord si votre problème peut être résolu avec une méthode de chaîne plus rapide et plus simple.

source: match() versus search()
fr: *match()* contre *search()*

source: The :func:`~re.match` function only checks if the RE matches at the beginning of the string while :func:`~re.search` will scan forward through the string for a match. It's important to keep this distinction in mind. Remember, :func:`!match` will only report a successful match which will start at 0; if the match wouldn't start at zero, :func:`!match` will *not* report it. ::
fr: La fonction :func:`~re.match` vérifie seulement si la RE correspond au début de la chaîne de caractères tandis que :func:`~re.search` parcourt la chaîne de caractères pour trouver une correspondance. Il est important de garder cette distinction à l'esprit. Rappelez-vous, :func:`!match` ne trouve qu'une correspondance qui commence à 0 ; si la correspondance commence plus loin, :func:`!match` *ne la trouve pas*. ::

source: On the other hand, :func:`~re.search` will scan forward through the string, reporting the first match it finds. ::
fr: D'un autre côté, :func:`~re.search` balaie la chaîne de caractères, rapportant la première correspondance qu'elle trouve. ::

source: Sometimes you'll be tempted to keep using :func:`re.match`, and just add ``.*`` to the front of your RE. Resist this temptation and use :func:`re.search` instead. The regular expression compiler does some analysis of REs in order to speed up the process of looking for a match. One such analysis figures out what the first character of a match must be; for example, a pattern starting with ``Crow`` must match starting with a ``'C'``. The analysis lets the engine quickly scan through the string looking for the starting character, only trying the full match if a ``'C'`` is found.
fr: Vous pouvez être tenté d'utiliser :func:`re.match` en ajoutant simplement ``.*`` au début de votre RE. Ce n'est pas une bonne idée, utilisez plutôt :func:`re.search`. Le compilateur d'expressions régulières analyse les REs pour optimiser le processus de recherche d'une correspondance. Cette analyse permet de déterminer ce que doit être le premier caractère d'une correspondance ; par exemple, un motif commençant par ``Corbeau`` doit faire correspondre un ``'C'`` en tête. L'analyse permet au moteur de parcourir rapidement la chaîne de caractères à la recherche du caractère de départ, n'essayant la correspondance complète que si un "C" a déjà été trouvé.

source: Adding ``.*`` defeats this optimization, requiring scanning to the end of the string and then backtracking to find a match for the rest of the RE. Use :func:`re.search` instead.
fr: Ajouter ``.*`` annihile cette optimisation, nécessitant un balayage jusqu'à la fin de la chaîne de caractères, puis un retour en arrière pour trouver une correspondance pour le reste de la RE. Préférez l'utilisation :func:`re.search`.

source: Greedy versus Non-Greedy
fr: Glouton contre non-glouton

source: When repeating a regular expression, as in ``a*``, the resulting action is to consume as much of the pattern as possible. This fact often bites you when you're trying to match a pair of balanced delimiters, such as the angle brackets surrounding an HTML tag. The naive pattern for matching a single HTML tag doesn't work because of the greedy nature of ``.*``. ::
fr: Si vous répétez un motif dans une expression régulière, comme ``a*``, l'action résultante est de consommer autant de motifs que possible. C'est un problème lorsque vous essayez de faire correspondre une paire de délimiteurs, comme des chevrons encadrant une balise HTML. Le motif naïf pour faire correspondre une seule balise HTML ne fonctionne pas en raison de la nature gloutonne de ``.*``. ::

source: The RE matches the ``'<'`` in ``'<html>'``, and the ``.*`` consumes the rest of the string. There's still more left in the RE, though, and the ``>`` can't match at the end of the string, so the regular expression engine has to backtrack character by character until it finds a match for the ``>``. The final match extends from the ``'<'`` in ``'<html>'`` to the ``'>'`` in ``'</title>'``, which isn't what you want.
fr: La RE correspond au ``'<'`` de ``'<html>'`` et le ``.*``` consomme le reste de la chaîne. Mais, comme il reste des éléments du motif dans la RE et que le ``>`` ne peut pas correspondre à la fin de la chaîne de caractères, le moteur d'expression régulière doit faire marche arrière caractère par caractère jusqu'à ce qu'il trouve une correspondance pour le ``>``. La correspondance finale s'étend du ``'<'`` de ``'<html>'`` au ``'>'`` de ``'</title>'``, ce qui n'est pas ce que vous voulez.

source: In this case, the solution is to use the non-greedy qualifiers ``*?``, ``+?``, ``??``, or ``{m,n}?``, which match as *little* text as possible. In the above example, the ``'>'`` is tried immediately after the first ``'<'`` matches, and when it fails, the engine advances a character at a time, retrying the ``'>'`` at every step. This produces just the right result::
fr: Dans ce cas, la solution consiste à utiliser des quantificateurs non gloutons tels que ``*?``, ``+?``, ``??`` ou ``{m,n}?``, qui effectuent une correspondance aussi *petite* que possible. Dans l'exemple ci-dessus, le ``'>'`` est essayé immédiatement après que le ``'<'`` corresponde et, s'il échoue, le moteur avance caractère par caractère, ré-essayant ``'>'`` à chaque pas. Nous obtenons alors le bon résultat ::

source: (Note that parsing HTML or XML with regular expressions is painful. Quick-and-dirty patterns will handle common cases, but HTML and XML have special cases that will break the obvious regular expression; by the time you've written a regular expression that handles all of the possible cases, the patterns will be *very* complicated. Use an HTML or XML parser module for such tasks.)
fr: Note : l'analyse du HTML ou du XML avec des expressions régulières est tout sauf une sinécure. Les motifs écrits à la va-vite traiteront les cas communs, mais HTML et XML ont des cas spéciaux qui font planter l'expression régulière évidente ; quand vous aurez écrit une expression régulière qui traite tous les cas possibles, les motifs seront *très* compliqués. Utilisez un module d'analyse HTML ou XML pour de telles tâches.

source: Using re.VERBOSE
fr: Utilisez *re.VERBOSE*

source: By now you've probably noticed that regular expressions are a very compact notation, but they're not terribly readable. REs of moderate complexity can become lengthy collections of backslashes, parentheses, and metacharacters, making them difficult to read and understand.
fr: À présent, vous vous êtes rendu compte que les expressions régulières sont une notation très compacte, mais qu'elles ne sont pas très lisibles. Une RE modérément complexe peut rapidement devenir une longue collection de barres obliques inverses, de parenthèses et de métacaractères, ce qui la rend difficile à lire et à comprendre.

source: For such REs, specifying the :const:`re.VERBOSE` flag when compiling the regular expression can be helpful, because it allows you to format the regular expression more clearly.
fr: Pour de telles RE, activer l'option :const:`re.VERBOSE` à la compilation de l'expression régulière peut être utile ; cela vous permet de formater l'expression régulière de manière plus claire.

source: The ``re.VERBOSE`` flag has several effects. Whitespace in the regular expression that *isn't* inside a character class is ignored. This means that an expression such as ``dog | cat`` is equivalent to the less readable ``dog|cat``, but ``[a b]`` will still match the characters ``'a'``, ``'b'``, or a space. In addition, you can also put comments inside a RE; comments extend from a ``#`` character to the next newline. When used with triple-quoted strings, this enables REs to be formatted more neatly::
fr: L'option ``re.VERBOSE`` a plusieurs effets. Les espaces dans l'expression régulière qui *ne sont pas* à l'intérieur d'une classe de caractères sont ignorées. Cela signifie qu'une expression comme ``chien | chat`` est équivalente à ``chien|chat`` qui est moins lisible, mais ``[a b]`` correspond toujours aux caractères ``'a'``, ``'b'`` ou à une espace. En outre, vous avez la possibilité de mettre des commentaires à l'intérieur d'une RE ; les commentaires s'étendent du caractère ``#`` à la nouvelle ligne suivante. Lorsque vous l'utilisez avec des chaînes à triple guillemets, cela permet aux RE d'être formatées plus proprement ::

source: This is far more readable than::
fr: Ceci est beaucoup plus lisible que ::

source: Feedback
fr: Vos commentaires

source: Regular expressions are a complicated topic. Did this document help you understand them? Were there parts that were unclear, or Problems you encountered that weren't covered here? If so, please send suggestions for improvements to the author.
fr: Les expressions régulières sont un sujet compliqué. Est-ce que ce document vous a aidé à les comprendre ? Des parties ne sont pas claires, ou des problèmes que vous avez rencontrés ne sont pas traités ici ? Si tel est le cas, merci d'envoyer vos suggestions d'améliorations à l'auteur.

source: The most complete book on regular expressions is almost certainly Jeffrey Friedl's Mastering Regular Expressions, published by O'Reilly. Unfortunately, it exclusively concentrates on Perl and Java's flavours of regular expressions, and doesn't contain any Python material at all, so it won't be useful as a reference for programming in Python. (The first edition covered Python's now-removed :mod:`!regex` module, which won't help you much.) Consider checking it out from your library.
fr: Le livre le plus complet sur les expressions régulières est certainement Mastering Regular Expressions de Jeffrey Friedl, publié par O'Reilly. Malheureusement, il se concentre sur les déclinaisons Perl et Java des expressions régulières et ne contient aucun contenu pour Python ; il n'est donc pas utile d'en faire référence pour la programmation Python. (La première édition traitait du module Python :mod:`!regex`, maintenant supprimé, ce qui ne vous aidera pas beaucoup.) Pensez à le retirer de votre bibliothèque.
