Repository: python/python-docs-fr
Catalog: howto/regex.po
Languages: fr

source: Compiling Regular Expressions
fr: Compilation des expressions régulières

source: Regular expressions are compiled into pattern objects, which have methods for various operations such as searching for pattern matches or performing string substitutions. ::
fr: Les expressions régulières sont compilées en objets motifs, qui possèdent des méthodes pour diverses opérations telles que la recherche de correspondances ou les substitutions dans les chaînes. ::

source: :func:`re.compile` also accepts an optional *flags* argument, used to enable various special features and syntax variations. We'll go over the available settings later, but for now a single example will do::
fr: :func:`re.compile` accepte aussi une option *flags*, utilisée pour activer des fonctionnalités particulières et des variations de syntaxe. Nous étudierons la définition des variables plus tard et, pour l'instant, un seul exemple suffit ::

source: The RE is passed to :func:`re.compile` as a string. REs are handled as strings because regular expressions aren't part of the core Python language, and no special syntax was created for expressing them. (There are applications that don't need REs at all, so there's no need to bloat the language specification by including them.) Instead, the :mod:`re` module is simply a C extension module included with Python, just like the :mod:`socket` or :mod:`zlib` modules.
fr: La RE passée à :func:`re.compile` est une chaîne. Les RE sont des chaînes car les expressions régulières ne font pas partie intrinsèque du langage Python et aucune syntaxe particulière n'a été créée pour les exprimer (il existe des applications qui ne nécessitent aucune RE et il n'a donc aucune raison de grossir les spécifications du langage en incluant les RE). Ainsi, le module :mod:`re` est simplement un module d'extension en C inclus dans Python, tout comme les modules :mod:`socket` ou :mod:`zlib`.

source: Putting REs in strings keeps the Python language simpler, but has one disadvantage which is the topic of the next section.
fr: Exprimer les RE comme des chaînes de caractères garde le langage Python plus simple mais introduit un inconvénient qui fait l'objet de la section suivante.

source: The Backslash Plague
fr: La maudite barre oblique inverse

source: As stated earlier, regular expressions use the backslash character (``'\'``) to indicate special forms or to allow special characters to be used without invoking their special meaning. This conflicts with Python's usage of the same character for the same purpose in string literals.
fr: Comme indiqué précédemment, les expressions régulières utilisent la barre oblique inverse (*backslash* en anglais) pour indiquer des constructions particulières ou pour autoriser des caractères spéciaux sans que leur signification spéciale ne soit invoquée. C'est en contradiction avec l'usage de Python qui est qu'un caractère doit avoir la même signification dans les littéraux de chaînes de caractères.

source: Let's say you want to write a RE that matches the string ``\section``, which might be found in a LaTeX file. To figure out what to write in the program code, start with the desired string to be matched. Next, you must escape any backslashes and other metacharacters by preceding them with a backslash, resulting in the string ``\\section``. The resulting string that must be passed to :func:`re.compile` must be ``\\section``. However, to express this as a Python string literal, both backslashes must be escaped *again*.
fr: Considérons que vous voulez écrire une RE qui fait correspondre la chaîne de caractères ``\section`` (on en trouve dans un fichier LaTeX). Pour savoir ce qu'il faut coder dans votre programme, commençons par la chaîne de caractères cherchée. Ensuite, nous devons échapper chaque barre oblique inverse et tout autre métacaractère en les précédant d'une barre oblique inverse, ce qui donne la chaîne de caractères ``\\section``. La chaîne résultante qui doit être passée à :func:`re.compile` est donc ``\\section``. Comme nous devons l'exprimer sous la forme d'une chaîne littérale Python, nous devons échapper les deux barres obliques inverses *encore une fois*.

source: Characters
fr: Caractères

source: Stage
fr: Niveau

source: Text string to be matched
fr: Chaîne de caractère à chercher

source: Escaped backslash for :func:`re.compile`
fr: Barre oblique inverse échappée pour :func:`re.compile`

source: Escaped backslashes for a string literal
fr: Barres obliques inverses échappées pour un littéral de chaîne de caractères

source: In short, to match a literal backslash, one has to write ``'\\\\'`` as the RE string, because the regular expression must be ``\\``, and each backslash must be expressed as ``\\`` inside a regular Python string literal. In REs that feature backslashes repeatedly, this leads to lots of repeated backslashes and makes the resulting strings difficult to understand.
fr: Pour faire court, si vous cherchez une correspondance pour une barre oblique inverse littérale, écrivez ``'\\\\'`` dans votre chaîne RE, car l'expression régulière doit être ``\\`` et que chaque barre oblique inverse doit être exprimée comme ``\\`` dans un littéral chaîne de caractères Python. Dans les RE qui comportent plusieurs barres obliques inverses, cela conduit à beaucoup de barres obliques inverses et rend la chaîne résultante difficile à comprendre.

source: The solution is to use Python's raw string notation for regular expressions; backslashes are not handled in any special way in a string literal prefixed with ``'r'``, so ``r"\n"`` is a two-character string containing ``'\'`` and ``'n'``, while ``"\n"`` is a one-character string containing a newline. Regular expressions will often be written in Python code using this raw string notation.
fr: La solution consiste à utiliser les chaînes brutes Python pour les expressions régulières ; les barres obliques inverses ne sont pas gérées d'une manière particulière dans les chaînes littérales préfixées avec ``'r'``. Ainsi, ``r"\n"`` est la chaîne de deux caractères contenant ``'\'`` et ``'n'`` alors que ``"\n"`` est la chaîne contenant uniquement le caractère retour à la ligne. Les expressions régulières sont souvent écrites dans le code Python en utilisant la notation "chaînes brutes".

source: In addition, special escape sequences that are valid in regular expressions, but not valid as Python string literals, now result in a :exc:`DeprecationWarning` and will eventually become a :exc:`SyntaxError`, which means the sequences will be invalid if raw string notation or escaping the backslashes isn't used.
fr: En complément, les séquences d'échappement valides dans les expressions régulières, mais non valides dans les littéraux chaînes classiques, produisent dorénavant un :exc:`DeprecationWarning` et, possiblement, deviendront une :exc:`SyntaxError`, ce qui signifie que les séquences seront invalides si la notation "chaîne brute" ou l'échappement des barres obliques inverses ne sont pas utilisés.

source: Regular String
fr: Chaîne normale

source: Raw string
fr: Chaîne de caractères brute

source: Performing Matches
fr: Recherche de correspondances

source: Once you have an object representing a compiled regular expression, what do you do with it? Pattern objects have several methods and attributes. Only the most significant ones will be covered here; consult the :mod:`re` docs for a complete listing.
fr: Une fois que nous avons un objet représentant une expression régulière compilée, qu'en faisons-nous ? Les objets motifs ont plusieurs méthodes et attributs. Seuls les plus significatifs seront couverts ici ; consultez la documentation :mod:`re` pour la liste complète.

source: Method/Attribute
fr: Méthode/Attribut

source: Purpose
fr: Objectif

source: Determine if the RE matches at the beginning of the string.
fr: Détermine si la RE fait correspond dès le début de la chaîne.

source: Scan through a string, looking for any location where this RE matches.
fr: Analyse la chaîne à la recherche d'une position où la RE correspond.

source: Find all substrings where the RE matches, and returns them as a list.
fr: Trouve toutes les sous-chaînes qui correspondent à la RE et les renvoie sous la forme d'une liste.

source: Find all substrings where the RE matches, and returns them as an :term:`iterator`.
fr: Trouve toutes les sous-chaînes qui correspondent à la RE et les renvoie sous la forme d'un :term:`itérateur <iterator>`.

source: :meth:`~re.Pattern.match` and :meth:`~re.Pattern.search` return ``None`` if no match can be found. If they're successful, a :ref:`match object <match-objects>` instance is returned, containing information about the match: where it starts and ends, the substring it matched, and more.
fr: :meth:`~re.Pattern.match` et :meth:`~re.Pattern.search` renvoient ``None`` si aucune correspondance ne peut être trouvée. Si elles trouvent une correspondance, une instance d'objet :ref:`correspondance <match-objects>` est renvoyée, contenant les informations relatives à la correspondance : position de départ et de fin, la sous-chaîne qui correspond et d'autres informations.

source: You can learn about this by interactively experimenting with the :mod:`re` module. If you have :mod:`tkinter` available, you may also want to look at :source:`Tools/demo/redemo.py`, a demonstration program included with the Python distribution. It allows you to enter REs and strings, and displays whether the RE matches or fails. :file:`redemo.py` can be quite useful when trying to debug a complicated RE.
fr: Vous pouvez apprendre leur fonctionnement en expérimentant de manière interactive avec le module :mod:`re`. Si vous disposez de :mod:`tkinter`, vous pouvez aussi regarder les sources de :source:`Tools/demo/redemo.py`, un programme de démonstration inclus dans la distribution Python. Ce programme vous permet de rentrer des RE et des chaînes, affichant si la RE correspond ou pas. :file:`redemo.py` peut s'avérer particulièrement utile quand vous devez déboguer une RE compliquée.

source: This HOWTO uses the standard Python interpreter for its examples. First, run the Python interpreter, import the :mod:`re` module, and compile a RE::
fr: Ce guide utilise l'interpréteur standard de Python pour ses exemples. Commencez par lancer l'interpréteur Python, importez le module :mod:`re` et compilez une RE ::

source: Now, you can try matching various strings against the RE ``[a-z]+``. An empty string shouldn't match at all, since ``+`` means 'one or more repetitions'. :meth:`~re.Pattern.match` should return ``None`` in this case, which will cause the interpreter to print no output. You can explicitly print the result of :meth:`!match` to make this clear. ::
fr: Maintenant, vous pouvez tester des correspondances de la RE ``[a-z]+`` avec différentes chaînes. Une chaîne vide ne doit pas correspondre, puisque ``+`` indique "une ou plusieurs occurrences". :meth:`~re.Pattern.match` doit renvoyer ``None`` dans ce cas, ce qui fait que l'interpréteur n'affiche rien. Vous pouvez afficher le résultat de :meth:`!match` explicitement pour que ce soit clair. ::

source: Now, let's try it on a string that it should match, such as ``tempo``. In this case, :meth:`~re.Pattern.match` will return a :ref:`match object <match-objects>`, so you should store the result in a variable for later use. ::
fr: Maintenant, essayons sur une chaîne qui doit correspondre, par exemple ``tempo``. Dans ce cas, :meth:`~re.Pattern.match` renvoie un :ref:`objet correspondance <match-objects>`, vous pouvez ainsi stocker le résultat dans une variable pour une utilisation ultérieure. ::

source: Now you can query the :ref:`match object <match-objects>` for information about the matching string. Match object instances also have several methods and attributes; the most important ones are:
fr: Maintenant, vous pouvez interroger :ref:`l'objet correspondance <match-objects>` pour obtenir des informations sur la chaîne qui correspond. Les instances d'objets correspondances possèdent plusieurs méthodes et attributs ; les plus importants sont :

source: Return the string matched by the RE
fr: Renvoie la chaîne de caractères correspondant à la RE

source: Return the starting position of the match
fr: Renvoie la position de début de la correspondance

source: Return the ending position of the match
fr: Renvoie la position de fin de la correspondance

source: Return a tuple containing the (start, end) positions of the match
fr: Renvoie un *tuple* contenant les positions (début, fin) de la correspondance

source: Trying these methods will soon clarify their meaning::
fr: Essayons ces méthodes pour clarifier leur signification ::

source: :meth:`~re.Match.group` returns the substring that was matched by the RE. :meth:`~re.Match.start` and :meth:`~re.Match.end` return the starting and ending index of the match. :meth:`~re.Match.span` returns both start and end indexes in a single tuple. Since the :meth:`~re.Pattern.match` method only checks if the RE matches at the start of a string, :meth:`!start` will always be zero. However, the :meth:`~re.Pattern.search` method of patterns scans through the string, so the match may not start at zero in that case. ::
fr: :meth:`~re.Match.group` renvoie la sous-chaîne qui correspond à la RE. :meth:`~re.Match.start` et :meth:`~re.Match.end` renvoient les indices de début et de fin de la correspondance. :meth:`~re.Match.span` renvoie les indices de début et de fin dans un seul *tuple*. Comme la méthode :meth:`~re.Pattern.match` ne fait que vérifier si la RE correspond au début de la chaîne, :meth:`!start` vaut toujours zéro. Cependant, la méthode :meth:`~re.Pattern.search` d'un motif analyse toute la chaîne, afin de trouver une correspondance potentielle qui ne commence pas à zéro. ::

source: In actual programs, the most common style is to store the :ref:`match object <match-objects>` in a variable, and then check if it was ``None``. This usually looks like::
fr: Dans les programmes réels, la façon de faire la plus courante consiste à stocker :ref:`l'objet correspondance <match-objects>` dans une variable, puis à vérifier s'il vaut ``None``. Généralement, cela ressemble à ceci ::

source: Two pattern methods return all of the matches for a pattern. :meth:`~re.Pattern.findall` returns a list of matching strings::
fr: Deux méthodes de motifs renvoient toutes les correspondances pour un motif. :meth:`~re.Pattern.findall` renvoie une liste des chaînes qui correspondent ::

source: The ``r`` prefix, making the literal a raw string literal, is needed in this example because escape sequences in a normal "cooked" string literal that are not recognized by Python, as opposed to regular expressions, now result in a :exc:`DeprecationWarning` and will eventually become a :exc:`SyntaxError`. See :ref:`the-backslash-plague`.
fr: Le préfixe ``r``, qui indique une chaîne brute littérale, est nécessaire dans cet exemple car les séquences d'échappement dans une chaîne littérale qui ne sont pas reconnues par Python, alors qu'elles le sont par les expressions régulières, induisent maintenant un :exc:`DeprecationWarning` et deviendront possiblement des :exc:`SyntaxError`. Reportez-vous à :ref:`the-backslash-plague`.

source: :meth:`~re.Pattern.findall` has to create the entire list before it can be returned as the result. The :meth:`~re.Pattern.finditer` method returns a sequence of :ref:`match object <match-objects>` instances as an :term:`iterator`::
fr: :meth:`~re.Pattern.findall` doit créer la liste entière avant d'être renvoyé comme résultat. La méthode :meth:`~re.Pattern.finditer` renvoie une séquence d'instances :ref:`d'objets correspondances <match-objects>` en tant :term:`qu'itérateur <iterator>` ::

source: Module-Level Functions
fr: Fonctions de niveau module

source: You don't have to create a pattern object and call its methods; the :mod:`re` module also provides top-level functions called :func:`~re.match`, :func:`~re.search`, :func:`~re.findall`, :func:`~re.sub`, and so forth. These functions take the same arguments as the corresponding pattern method with the RE string added as the first argument, and still return either ``None`` or a :ref:`match object <match-objects>` instance. ::
fr: Vous n'avez pas besoin de créer un objet motif et d'appeler ses méthodes ; le module :mod:`re` fournit des fonctions à son niveau, ce sont :func:`~re.match`, :func:`~re.search`, :func:`~re.findall`, :func:`~re.sub` et ainsi de suite. Ces fonctions prennent les mêmes arguments que les méthodes correspondantes des objets motifs, avec la chaîne RE ajoutée en tant que premier argument. Elles renvoient toujours ``None`` ou une instance :ref:`d'objet correspondance <match-objects>`. ::

source: Under the hood, these functions simply create a pattern object for you and call the appropriate method on it. They also store the compiled object in a cache, so future calls using the same RE won't need to parse the pattern again and again.
fr: En interne, ces fonctions créent simplement un objet motif pour vous et appellent la méthode appropriée de cet objet. Elles stockent également l'objet compilé dans un cache afin que les appels suivants qui utilisent la même RE n'aient pas besoin d'analyser le motif une nouvelle fois.

source: Should you use these module-level functions, or should you get the pattern and call its methods yourself? If you're accessing a regex within a loop, pre-compiling it will save a few function calls. Outside of loops, there's not much difference thanks to the internal cache.
fr: Devez-vous utiliser ces fonctions au niveau des modules ou devez-vous calculer le motif et appeler vous-même ses méthodes ? Si vous utilisez l'expression régulière à l'intérieur d'une boucle, la pré-compilation permet d'économiser quelques appels de fonctions. En dehors des boucles, il n'y a pas beaucoup de différence grâce au cache interne.

source: Compilation Flags
fr: Options de compilation

source: Compilation flags let you modify some aspects of how regular expressions work. Flags are available in the :mod:`re` module under two names, a long name such as :const:`IGNORECASE` and a short, one-letter form such as :const:`I`. (If you're familiar with Perl's pattern modifiers, the one-letter forms use the same letters; the short form of :const:`re.VERBOSE` is :const:`re.X`, for example.) Multiple flags can be specified by bitwise OR-ing them; ``re.I | re.M`` sets both the :const:`I` and :const:`M` flags, for example.
fr: Les options de compilation vous permettent de modifier le comportement des expressions régulières. Ces options sont accessibles dans le module :mod:`re` par deux noms, un long du type :const:`IGNORECASE` et un court (une seule lettre) tel que :const:`I` (si vous êtes habitués aux modificateurs de motifs Perl, la version courte utilise les mêmes lettres que Perl, par exemple la version courte de :const:`re.VERBOSE` est :const:`re.X`). Plusieurs options peuvent être spécifiées en appliquant l'opérateur bit-à-bit *OR* ; par exemple, ``re.I | re.M`` active à la fois les options :const:`I` et :const:`M`.

source: Here's a table of the available flags, followed by a more detailed explanation of each one.
fr: Vous trouvez ci-dessous le tableau des options disponibles, suivies d'explications détaillées.

source: Flag
fr: Option

source: Meaning
fr: Signification

source: Makes several escapes like ``\w``, ``\b``, ``\s`` and ``\d`` match only on ASCII characters with the respective property.
fr: Transforme plusieurs échappements tels que ``\w``, ``\b``, ``\s`` et ``\d`` de manière à ce qu'ils ne correspondent qu'à des caractères ASCII ayant la propriété demandée.

source: Make ``.`` match any character, including newlines.
fr: Fait en sorte que ``.`` corresponde à n'importe quel caractère, caractère de retour à la ligne inclus.

source: Do case-insensitive matches.
fr: Recherche une correspondance sans tenir compte de la casse.

source: Do a locale-aware match.
fr: Recherche une correspondance en tenant compte de la configuration de la région.

source: Multi-line matching, affecting ``^`` and ``$``.
fr: Correspondance multi-lignes, affecte ``^`` et ``$``.

source: :const:`VERBOSE`, :const:`X` (for 'extended')
fr: :const:`VERBOSE`, :const:`X` (pour *extended*, c-à-d étendu en anglais)

source: Enable verbose REs, which can be organized more cleanly and understandably.
fr: Active les RE verbeuses, qui peuvent être organisées de manière plus propre et compréhensible.

source: Perform case-insensitive matching; character class and literal strings will match letters by ignoring case. For example, ``[A-Z]`` will match lowercase letters, too. Full Unicode matching also works unless the :const:`ASCII` flag is used to disable non-ASCII matches. When the Unicode patterns ``[a-z]`` or ``[A-Z]`` are used in combination with the :const:`IGNORECASE` flag, they will match the 52 ASCII letters and 4 additional non-ASCII letters: 'İ' (U+0130, Latin capital letter I with dot above), 'ı' (U+0131, Latin small letter dotless i), 'ſ' (U+017F, Latin small letter long s) and 'K' (U+212A, Kelvin sign). ``Spam`` will match ``'Spam'``, ``'spam'``, ``'spAM'``, or ``'ſpam'`` (the latter is matched only in Unicode mode). This lowercasing doesn't take the current locale into account; it will if you also set the :const:`LOCALE` flag.
fr: Effectue une correspondance insensible à la casse ; les classes de caractères et les littéraux de chaînes de caractères ignorent la casse pour la correspondance. Par exemple, ``[A-Z]`` correspond aussi aux lettres minuscules. La correspondance Unicode complète fonctionne également, sauf si l'option :const:`ASCII` est utilisée pour désactiver les correspondances non ASCII. Lorsque les motifs Unicode ``[a-z]`` ou ``[A-Z]`` sont utilisés en combinaison avec l'option :const:`IGNORECASE`, ils correspondent avec les 52 lettres ASCII et 4 lettres non ASCII supplémentaires : 'İ' (U+0130, lettre I en majuscule latine avec un point au-dessus), 'ı' (U+0131, lettre minuscule latine i sans point au-dessus), 'ſ' (U+017F, lettre minuscule latine longue s) et 'K' (U+212A, signe du Kelvin). ``Spam`` correspond ainsi à ``'Spam'``, ``'spam'``, ``'spAM'`` ou ``'ſpam'`` (ce dernier ne correspond qu'en mode Unicode). Le passage en minuscules ne prend pas en compte la configuration de région courante ; elle le fait si vous mettez aussi l'option :const:`LOCALE`.

source: Make ``\w``, ``\W``, ``\b``, ``\B`` and case-insensitive matching dependent on the current locale instead of the Unicode database.
fr: Rend ``\w``, ``\W``, ``\b``, ``\B`` et les correspondances non sensibles à la casse dépendants de la configuration de la région courante au lieu de la base de données Unicode.
