Repository: python/python-docs-fr
Catalog: howto/regex.po
Languages: fr

source: Locales are a feature of the C library intended to help in writing programs that take account of language differences. For example, if you're processing encoded French text, you'd want to be able to write ``\w+`` to match words, but ``\w`` only matches the character class ``[A-Za-z]`` in bytes patterns; it won't match bytes corresponding to ``é`` or ``ç``. If your system is configured properly and a French locale is selected, certain C functions will tell the program that the byte corresponding to ``é`` should also be considered a letter. Setting the :const:`LOCALE` flag when compiling a regular expression will cause the resulting compiled object to use these C functions for ``\w``; this is slower, but also enables ``\w+`` to match French words as you'd expect. The use of this flag is discouraged in Python 3 as the locale mechanism is very unreliable, it only handles one "culture" at a time, and it only works with 8-bit locales. Unicode matching is already enabled by default in Python 3 for Unicode (str) patterns, and it is able to handle different locales/languages.
fr: Les *locales* sont une caractéristique de la bibliothèque C destinées à favoriser une programmation qui tient compte des différences linguistiques (NdT : nous utilisons *configuration de région* dans cette page pour désigner ce concept de la bibliothèque C). Par exemple, si vous traitez du texte français, vous souhaitez pouvoir écrire ``\w+`` pour faire correspondre les mots, mais ``\w`` ne correspond qu'à la classe de caractères ``[A-Za-za-z]`` en octets ; cette classe ne correspond pas avec les octets codant ``é`` ou ``ç``. Si votre système est configuré correctement et que la configuration de région est définie sur 'français', certaines fonctions C diront à votre programme que l'octet codant ``é`` doit être considéré comme une lettre. Définir l'option :const:`LOCALE` lors de la compilation d'une expression régulière fait que l'objet compilé résultant utilise ces fonctions C pour ``\w`` ; c'est plus lent mais cela permet à ``\w+`` de correspondre avec les mots français tel qu'attendu. L'utilisation de cette option est déconseillée en Python 3 car le mécanisme de locale est très peu fiable, il ne gère qu'une seule "culture" à la fois et il ne fonctionne qu'avec des locales 8 bits. La correspondance Unicode est déjà activée par défaut dans Python 3 pour les motifs Unicode (type *str*) et elle est capable de gérer différentes configurations de régions.

source: (``^`` and ``$`` haven't been explained yet; they'll be introduced in section :ref:`more-metacharacters`.)
fr: Nota : ``^`` et ``$`` n'ont pas encore été expliqués ; ils sont introduits dans la section :ref:`more-metacharacters`.

source: Usually ``^`` matches only at the beginning of the string, and ``$`` matches only at the end of the string and immediately before the newline (if any) at the end of the string. When this flag is specified, ``^`` matches at the beginning of the string and at the beginning of each line within the string, immediately following each newline. Similarly, the ``$`` metacharacter matches either at the end of the string and at the end of each line (immediately preceding each newline).
fr: Normalement, ``^`` correspond uniquement au début de la chaîne, et ``$`` correspond uniquement à la fin de la chaîne et immédiatement avant la nouvelle ligne (s'il y en a une) à la fin de la chaîne. Lorsque cette option est spécifiée, ``^`` correspond au début de la chaîne de caractères et au début de chaque ligne de la chaîne de caractères, immédiatement après le début de la nouvelle ligne. De même, le métacaractère ``$`` correspond à la fin de la chaîne de caractères ou à la fin de chaque ligne (précédant immédiatement chaque nouvelle ligne).

source: Makes the ``'.'`` special character match any character at all, including a newline; without this flag, ``'.'`` will match anything *except* a newline.
fr: Fait que le caractère spécial ``'.'`` corresponde avec n'importe quel caractère, y compris le retour à la ligne ; sans cette option, ``'.'`` correspond avec tout, *sauf* le retour à la ligne.

source: Make ``\w``, ``\W``, ``\b``, ``\B``, ``\s`` and ``\S`` perform ASCII-only matching instead of full Unicode matching. This is only meaningful for Unicode patterns, and is ignored for byte patterns.
fr: Fait que ``\w``, ``\W``, ``\b``, ``\B``, ``\s`` et ``\S`` ne correspondent qu'avec des caractères ASCII au lieu de l'ensemble des caractères Unicode. Cette option n'a de sens que pour des motifs Unicode, elle est ignorée pour les motifs *bytes*.

source: This flag allows you to write regular expressions that are more readable by granting you more flexibility in how you can format them. When this flag has been specified, whitespace within the RE string is ignored, except when the whitespace is in a character class or preceded by an unescaped backslash; this lets you organize and indent the RE more clearly. This flag also lets you put comments within a RE that will be ignored by the engine; comments are marked by a ``'#'`` that's neither in a character class or preceded by an unescaped backslash.
fr: Cette option vous permet d'écrire des expressions régulières plus lisibles en vous permettant plus de flexibilité pour le formatage. Lorsque cette option est activée, les "blancs" dans la chaîne RE sont ignorés, sauf lorsque le "blanc" se trouve dans une classe de caractères ou est précédé d'une barre oblique inverse ; ceci vous permet d'organiser et d'indenter vos RE plus clairement. Cette option vous permet également de placer des commentaires dans une RE, ils seront ignorés par le moteur ; les commentaires commencent par un ``'#'`` qui n'est ni dans une classe de caractères, ni précédé d'une barre oblique inverse.

source: For example, here's a RE that uses :const:`re.VERBOSE`; see how much easier it is to read? ::
fr: Par exemple, voici une RE qui utilise :const:`re.VERBOSE` ; vous pouvez constater qu'elle est beaucoup plus facile à lire ::

source: Without the verbose setting, the RE would look like this::
fr: Sans l'option verbeuse, cette RE ressemble à ceci ::

source: In the above example, Python's automatic concatenation of string literals has been used to break up the RE into smaller pieces, but it's still more difficult to understand than the version using :const:`re.VERBOSE`.
fr: Dans l'exemple ci-dessus, Python concatène automatiquement les littéraux chaînes de caractères qui ont été utilisés pour séparer la RE en petits morceaux, mais la RE reste plus difficile à comprendre que sa version utilisant :const:`re.VERBOSE`.

source: More Pattern Power
fr: Des motifs plus puissants

source: So far we've only covered a part of the features of regular expressions. In this section, we'll cover some new metacharacters, and how to use groups to retrieve portions of the text that was matched.
fr: Jusqu'à présent nous avons seulement couvert une partie des fonctionnalités des expressions régulières. Dans cette section, nous couvrirons quelques nouveaux métacaractères et l'utilisation des groupes pour récupérer des portions de textes correspondantes.

source: More Metacharacters
fr: Plus de métacaractères

source: There are some metacharacters that we haven't covered yet. Most of them will be covered in this section.
fr: Nous n'avons pas encore couvert tous les métacaractères. Cette section traite de la plupart de ceux que nous n'avons pas abordés.

source: Some of the remaining metacharacters to be discussed are :dfn:`zero-width assertions`. They don't cause the engine to advance through the string; instead, they consume no characters at all, and simply succeed or fail. For example, ``\b`` is an assertion that the current position is located at a word boundary; the position isn't changed by the ``\b`` at all. This means that zero-width assertions should never be repeated, because if they match once at a given location, they can obviously be matched an infinite number of times.
fr: Certains métacaractères restants sont des :dfn:`assertions de largeur zéro` (*zero-width assertions* en anglais). Ils ne font pas avancer le moteur dans la chaîne de caractères ; ils ne consomment aucun caractère et ils réussissent ou échouent tout simplement. Par exemple, ``\b`` est une assertion selon laquelle la position actuelle est située à la limite d'un mot ; la position n'est pas modifiée par le " \b ". Cela signifie que les assertions de largeur zéro ne doivent pas être répétées car, si elles correspondent à un endroit donné, elles correspondent automatiquement un nombre infini de fois.

source: Alternation, or the "or" operator. If *A* and *B* are regular expressions, ``A|B`` will match any string that matches either *A* or *B*. ``|`` has very low precedence in order to make it work reasonably when you're alternating multi-character strings. ``Crow|Servo`` will match either ``'Crow'`` or ``'Servo'``, not ``'Cro'``, a ``'w'`` or an ``'S'``, and ``'ervo'``.
fr: Union ensembliste ou opérateur "ou". Si *A* et *B* sont des expressions régulières, ``A|B`` correspond à toute chaine qui correspond à A ou à B. La priorité de ``|`` est très faible afin de pouvoir effectuer simplement des unions de chaînes de plusieurs caractères. ``Crow|Servo`` correspond avec ``'Crow'`` ou ``'Servo'``, mais pas avec ``'Cro'``, un ``'w'`` ou un ``'S'``, ou encore ``'ervo'``.

source: To match a literal ``'|'``, use ``\|``, or enclose it inside a character class, as in ``[|]``.
fr: Pour correspondre avec un ``'|'`` littéral, utilisez ``\|`` ou placez-le dans une classe de caractères, comme ceci ``[|]``.

source: Matches at the beginning of lines. Unless the :const:`MULTILINE` flag has been set, this will only match at the beginning of the string. In :const:`MULTILINE` mode, this also matches immediately after each newline within the string.
fr: Correspond à un début de ligne. À moins que l'option :const:`MULTILINE` ne soit activée, cela ne fait correspondre que le début de la chaîne. Dans le mode :const:`MULTILINE`, cela fait aussi correspondre immédiatement après chaque nouvelle ligne à l'intérieur de la chaîne.

source: For example, if you wish to match the word ``From`` only at the beginning of a line, the RE to use is ``^From``. ::
fr: Par exemple, si vous voulez trouver le mot ``From`` uniquement quand il est en début de ligne, la RE à utiliser est ``^From``. ::

source: To match a literal ``'^'``, use ``\^``.
fr: Pour trouver un ``'^'`` littéral, utilisez ``\^``.

source: Matches at the end of a line, which is defined as either the end of the string, or any location followed by a newline character. ::
fr: Correspond à une fin de ligne, ce qui veut dire soit la fin de la chaîne, soit tout emplacement qui est suivi du caractère de nouvelle ligne. ::

source: To match a literal ``'$'``, use ``\$`` or enclose it inside a character class, as in ``[$]``.
fr: Pour trouver un ``'$'`` littéral, utilisez ``\$`` ou placez-le à l'intérieur d'une classe de caractères, comme ceci ``[$]``.

source: Matches only at the start of the string. When not in :const:`MULTILINE` mode, ``\A`` and ``^`` are effectively the same. In :const:`MULTILINE` mode, they're different: ``\A`` still matches only at the beginning of the string, but ``^`` may match at any location inside the string that follows a newline character.
fr: Correspond au début de la chaîne de caractère, uniquement. Si l'option :const:`MULTILINE` n'est pas activée, ``\A`` et ``^`` sont équivalents. Dans le mode :const:`MULTILINE`, ils sont différents : ``\A`` ne correspond toujours qu'au début de la chaîne alors que ``^`` correspond aussi aux emplacements situés immédiatement après une nouvelle ligne à l'intérieur de la chaîne.

source: Matches only at the end of the string.
fr: Correspond uniquement à la fin d'une chaîne de caractères.

source: Word boundary. This is a zero-width assertion that matches only at the beginning or end of a word. A word is defined as a sequence of alphanumeric characters, so the end of a word is indicated by whitespace or a non-alphanumeric character.
fr: Limite de mot. C'est une assertion de largeur zéro qui correspond uniquement aux positions de début et de fin de mot. Un mot est défini comme une séquence de caractères alphanumériques ; ainsi, la fin d'un mot est indiquée par un "blanc" ou un caractère non-alphanumérique.

source: The following example matches ``class`` only when it's a complete word; it won't match when it's contained inside another word. ::
fr: L'exemple suivant fait correspondre ``class`` seulement si c'est un mot complet ; il n'y a pas de correspondance quand il est à l'intérieur d'un autre mot. ::

source: There are two subtleties you should remember when using this special sequence. First, this is the worst collision between Python's string literals and regular expression sequences. In Python's string literals, ``\b`` is the backspace character, ASCII value 8. If you're not using raw strings, then Python will convert the ``\b`` to a backspace, and your RE won't match as you expect it to. The following example looks the same as our previous RE, but omits the ``'r'`` in front of the RE string. ::
fr: Quand vous utilisez cette séquence spéciale, gardez deux choses à l'esprit. Tout d'abord, c'est la pire collision entre les littéraux des chaînes Python et les séquences d'expressions régulières. Dans les littéraux de chaîne de caractères Python, ``\b``` est le caractère de retour-arrière (*backspace* en anglais), dont la valeur ASCII est 8. Si vous n'utilisez pas les chaînes de caractères brutes, alors Python convertit le ``\b`` en retour-arrière, et votre RE ne correspond pas à ce que vous attendez. L'exemple suivant ressemble à notre RE précédente, mais nous avons omis le ```'r'`` devant la chaîne RE. ::

source: Second, inside a character class, where there's no use for this assertion, ``\b`` represents the backspace character, for compatibility with Python's string literals.
fr: Ensuite, dans une classe de caractères, où cette assertion n'a pas lieu d'être, ``\b`` représente le caractère retour-arrière, afin d'être compatible avec les littéraux de chaînes de caractères.

source: Another zero-width assertion, this is the opposite of ``\b``, only matching when the current position is not at a word boundary.
fr: Encore une assertion de largeur zéro, qui est l'opposée de ``\b``, c'est-à-dire qu'elle fait correspondre uniquement les emplacements qui ne sont pas à la limite d'un mot.

source: Grouping
fr: Regroupement

source: Frequently you need to obtain more information than just whether the RE matched or not. Regular expressions are often used to dissect strings by writing a RE divided into several subgroups which match different components of interest. For example, an RFC-822 header line is divided into a header name and a value, separated by a ``':'``, like this:
fr: Souvent, vous avez besoin d'obtenir plus d'informations que le simple fait que la RE corresponde ou non. Ainsi, les expressions régulières sont souvent utilisées pour analyser des chaînes de caractères en écrivant une RE qui divise une chaîne en plusieurs sous-groupes, correspondant chacun à une information particulière. Par exemple, une ligne d'en-tête RFC-822 peut se diviser en un nom d'en-tête et une valeur associée, séparés par un ``':'``, comme ceci :

source: This can be handled by writing a regular expression which matches an entire header line, and has one group which matches the header name, and another group which matches the header's value.
fr: Vous pouvez alors écrire une expression régulière qui fait correspondre une ligne d'en-tête entière et qui comporte un groupe correspondant au nom de l'en-tête, et un autre groupe correspondant à la valeur de l'en-tête.

source: Groups are marked by the ``'('``, ``')'`` metacharacters. ``'('`` and ``')'`` have much the same meaning as they do in mathematical expressions; they group together the expressions contained inside them, and you can repeat the contents of a group with a repeating qualifier, such as ``*``, ``+``, ``?``, or ``{m,n}``. For example, ``(ab)*`` will match zero or more repetitions of ``ab``. ::
fr: Les groupes sont délimités par les métacaractères marqueurs ``'('``et ``')'``. ``'('`` et ``')'`` ont à peu près le même sens que dans les expressions mathématiques ; ils forment un groupe à partir des expressions qu'ils encadrent ; vous pouvez répéter le contenu d'un groupe à l'aide d'un quantificateur, comme ``*``, ``+``, ``?`` ou ``{m,n}``. Par exemple, ``(ab)*`` correspond à zéro, une ou plusieurs fois ``ab``. ::

source: Groups indicated with ``'('``, ``')'`` also capture the starting and ending index of the text that they match; this can be retrieved by passing an argument to :meth:`~re.Match.group`, :meth:`~re.Match.start`, :meth:`~re.Match.end`, and :meth:`~re.Match.span`. Groups are numbered starting with 0. Group 0 is always present; it's the whole RE, so :ref:`match object <match-objects>` methods all have group 0 as their default argument. Later we'll see how to express groups that don't capture the span of text that they match. ::
fr: Les groupes délimités par ``'('``et ``')'`` capturent également les indices de début et de fin du texte avec lequel ils correspondent ; ces indices peuvent être récupérés en passant un argument à :meth:`~re.Match.group`, :meth:`~re.Match.start`, :meth:`~re.Match.end` ou :meth:`~re.Match.span`. Les groupes sont numérotés à partir de 0, le groupe 0 est toujours présent ; c'est l'ensemble de la RE, donc les méthodes de :ref:`l'objet correspondance <match-objects>` ont le groupe 0 comme argument par défaut. Plus loin, nous voyons comment exprimer les groupes qui ne capturent pas l'étendue du texte avec lequel ils correspondent. ::

source: Subgroups are numbered from left to right, from 1 upward. Groups can be nested; to determine the number, just count the opening parenthesis characters, going from left to right. ::
fr: Les sous-groupes sont numérotés de la gauche vers la droite, à partir de 1. Les groupes peuvent être imbriqués ; pour déterminer le numéro, il vous suffit de compter le nombre de parenthèses ouvrantes de la gauche vers la droite. ::

source: :meth:`~re.Match.group` can be passed multiple group numbers at a time, in which case it will return a tuple containing the corresponding values for those groups. ::
fr: Vous pouvez passer plusieurs numéros de groupes à :meth:`~re.Match.group` en même temps, elle vous renvoie alors un *tuple* contenant les valeurs correspondantes pour ces groupes. ::

source: The :meth:`~re.Match.groups` method returns a tuple containing the strings for all the subgroups, from 1 up to however many there are. ::
fr: La méthode :meth:`~re.Match.groups` renvoie un *tuple* contenant les chaînes pour tous les sous-groupes, en commençant par le numéro 1 jusqu'au dernier. ::

source: Backreferences in a pattern allow you to specify that the contents of an earlier capturing group must also be found at the current location in the string. For example, ``\1`` will succeed if the exact contents of group 1 can be found at the current position, and fails otherwise. Remember that Python's string literals also use a backslash followed by numbers to allow including arbitrary characters in a string, so be sure to use a raw string when incorporating backreferences in a RE.
fr: Les renvois dans un motif vous permettent de spécifier que le contenu d'un groupe précédent doit aussi être trouvé à l'emplacement actuel dans la chaîne. Par exemple, ``\1`` réussit si le contenu du premier groupe se trouve aussi à la position courante, sinon il échoue. Rappelez-vous que les littéraux de chaînes Python utilisent aussi la barre oblique inverse suivie d'un nombre pour insérer des caractères arbitraires dans une chaîne ; soyez sûr d'utiliser une chaîne brute quand vous faites des renvois dans une RE.

source: For example, the following RE detects doubled words in a string. ::
fr: Par exemple, la RE suivante détecte les mots doublés dans une chaîne. ::

source: Backreferences like this aren't often useful for just searching through a string --- there are few text formats which repeat data in this way --- but you'll soon find out that they're *very* useful when performing string substitutions.
fr: Les renvois tels que celui-ci ne sont pas très utiles pour effectuer une simple recherche dans une chaîne --- il n'y a que peu de formats de textes qui répètent des données ainsi --- mais vous verrez bientôt qu'ils sont *très* utiles pour effectuer des substitutions dans les chaînes.

source: Non-capturing and Named Groups
fr: Groupes non de capture et groupes nommés

source: Elaborate REs may use many groups, both to capture substrings of interest, and to group and structure the RE itself. In complex REs, it becomes difficult to keep track of the group numbers. There are two features which help with this problem. Both of them use a common syntax for regular expression extensions, so we'll look at that first.
fr: Les RE élaborées peuvent utiliser de nombreux groupes, à la fois pour capturer des sous-chaînes intéressantes ainsi que pour regrouper et structurer la RE elle-même. Dans les RE complexes, il devient difficile de garder la trace des numéros de groupes. Deux caractéristiques aident à résoudre ce problème, toutes deux utilisant la même syntaxe d'extension des expressions régulières. Nous allons donc commencer en examinant cette syntaxe.

source: Perl 5 is well known for its powerful additions to standard regular expressions. For these new features the Perl developers couldn't choose new single-keystroke metacharacters or new special sequences beginning with ``\`` without making Perl's regular expressions confusingly different from standard REs. If they chose ``&`` as a new metacharacter, for example, old expressions would be assuming that ``&`` was a regular character and wouldn't have escaped it by writing ``\&`` or ``[&]``.
fr: Les puissantes extensions des expressions régulières de Perl 5 sont réputées. Pour les mettre en œuvre, les développeurs Perl ne pouvaient pas utiliser de nouveaux métacaractères simples ou de nouvelles séquences commençant par ``\`` sans que les RE Perl ne deviennent trop différentes des RE standards au point de créer de la confusion. S'ils avaient choisi ``&`` comme nouveau métacaractère, par exemple, les expressions déjà écrites auraient considéré que ``&`` était un caractère standard et ne l'aurait pas échappé en écrivant ``\&`` ou ``[&]``.

source: The solution chosen by the Perl developers was to use ``(?...)`` as the extension syntax. ``?`` immediately after a parenthesis was a syntax error because the ``?`` would have nothing to repeat, so this didn't introduce any compatibility problems. The characters immediately after the ``?`` indicate what extension is being used, so ``(?=foo)`` is one thing (a positive lookahead assertion) and ``(?:foo)`` is something else (a non-capturing group containing the subexpression ``foo``).
fr: La solution adoptée par les développeurs Perl a été d'utiliser ``(?...)`` comme syntaxe d'extension. Placer ``?`` immédiatement après une parenthèse était une erreur de syntaxe, parce que le ``?`` n'a alors rien à répéter. Ainsi, cela n'a pas introduit de problème de compatibilité. Les caractères qui suivent immédiatement le ``?`` indiquent quelle extension est utilisée, donc ``(?=truc)`` est une chose (une assertion positive anticipée) et ``(?:truc)`` est une autre chose (la sous-expression ``truc`` que l'on groupe).
