Repository: python/python-docs-fr
Catalog: howto/unicode.po
Languages: fr

source: The :func:`os.listdir` function returns filenames, which raises an issue: should it return the Unicode version of filenames, or should it return bytes containing the encoded versions? :func:`os.listdir` can do both, depending on whether you provided the directory path as bytes or a Unicode string. If you pass a Unicode string as the path, filenames will be decoded using the filesystem's encoding and a list of Unicode strings will be returned, while passing a byte path will return the filenames as bytes. For example, assuming the default filesystem encoding is UTF-8, running the following program::
fr: La fonction :func:`os.listdir` renvoie des noms de fichiers, ce qui soulève un problème : doit-elle renvoyer la version Unicode des noms de fichiers ou doit-elle renvoyer des chaînes d'octets contenant les versions encodées ? :func:`os.listdir` peut faire les deux, selon que vous fournissez le chemin du répertoire en chaîne d'octets ou en chaîne Unicode. Si vous passez une chaîne Unicode comme chemin d'accès, les noms de fichiers sont décodés en utilisant l'encodage du système de fichiers et une liste de chaînes Unicode est renvoyée, tandis que passer un chemin d'accès en chaîne d'octets renvoie les noms de fichiers comme chaîne d'octets. Par exemple, en supposant que l'encodage par défaut du système de fichiers est UTF-8, exécuter le programme suivant ::

source: will produce the following output:
fr: produit la sortie suivante :

source: The first list contains UTF-8-encoded filenames, and the second list contains the Unicode versions.
fr: La première liste contient les noms de fichiers encodés en UTF-8 et la seconde contient les versions Unicode.

source: Note that on most occasions, you should can just stick with using Unicode with these APIs. The bytes APIs should only be used on systems where undecodable file names can be present; that's pretty much only Unix systems now.
fr: Notez que, dans la plupart des cas, il convient de vous en tenir à l'utilisation d'Unicode avec ces *APIs*. Les *API* d'octets ne devraient être utilisées que sur les systèmes où des noms de fichiers non décodables peuvent être présents. Cela ne concerne pratiquement que des systèmes Unix maintenant.

source: Tips for Writing Unicode-aware Programs
fr: Conseils pour écrire des programmes compatibles Unicode

source: This section provides some suggestions on writing software that deals with Unicode.
fr: Cette section fournit quelques suggestions sur l'écriture de logiciels qui traitent de l'Unicode.

source: The most important tip is:
fr: Le conseil le plus important est :

source: Software should only work with Unicode strings internally, decoding the input data as soon as possible and encoding the output only at the end.
fr: Il convient que le logiciel ne traite que des chaînes Unicode en interne, décodant les données d'entrée dès que possible et encodant la sortie uniquement à la fin.

source: If you attempt to write processing functions that accept both Unicode and byte strings, you will find your program vulnerable to bugs wherever you combine the two different kinds of strings. There is no automatic encoding or decoding: if you do e.g. ``str + bytes``, a :exc:`TypeError` will be raised.
fr: Si vous essayez d'écrire des fonctions de traitement qui acceptent à la fois les chaînes Unicode et les chaînes d'octets, les possibilités d'occurrences de bogues dans votre programme augmentent partout où vous combinez les deux différents types de chaînes. Il n'y a pas d'encodage ou de décodage automatique : si vous faites par exemple ``str + octets``, une :exc:`TypeError` est levée.

source: When using data coming from a web browser or some other untrusted source, a common technique is to check for illegal characters in a string before using the string in a generated command line or storing it in a database. If you're doing this, be careful to check the decoded string, not the encoded bytes data; some encodings may have interesting properties, such as not being bijective or not being fully ASCII-compatible. This is especially true if the input data also specifies the encoding, since the attacker can then choose a clever way to hide malicious text in the encoded bytestream.
fr: Lors de l'utilisation de données provenant d'un navigateur Web ou d'une autre source non fiable, une technique courante consiste à vérifier la présence de caractères illégaux dans une chaîne de caractères avant de l'utiliser pour générer une ligne de commande ou de la stocker dans une base de données. Si vous le faites, vérifiez bien la chaîne décodée, pas les données d'octets codés ; certains encodages peuvent avoir des propriétés intéressantes, comme ne pas être bijectifs ou ne pas être entièrement compatibles avec l'ASCII. C'est particulièrement vrai si l'encodage est spécifié explicitement dans vos données d'entrée, car l'attaquant peut alors choisir un moyen intelligent de cacher du texte malveillant dans le flux de données encodé.

source: Converting Between File Encodings
fr: Conversion entre les encodages de fichiers

source: The :class:`~codecs.StreamRecoder` class can transparently convert between encodings, taking a stream that returns data in encoding #1 and behaving like a stream returning data in encoding #2.
fr: La classe :class:`~codecs.StreamRecoder` peut convertir de manière transparente entre les encodages : prenant un flux qui renvoie des données dans l'encodage #1, elle se comporte comme un flux qui renvoie des données dans l'encodage #2.

source: For example, if you have an input file *f* that's in Latin-1, you can wrap it with a :class:`~codecs.StreamRecoder` to return bytes encoded in UTF-8::
fr: Par exemple, si vous avez un fichier d'entrée *f* qui est en Latin-1, vous pouvez l'encapsuler dans un :class:`~codecs.StreamRecoder` pour qu'il renvoie des octets encodés en UTF-8 ::

source: Files in an Unknown Encoding
fr: Fichiers dans un encodage inconnu

source: What can you do if you need to make a change to a file, but don't know the file's encoding? If you know the encoding is ASCII-compatible and only want to examine or modify the ASCII parts, you can open the file with the ``surrogateescape`` error handler::
fr: Vous avez besoin de modifier un fichier, mais vous ne connaissez pas son encodage ? Si vous savez que l'encodage est compatible ASCII et que vous voulez seulement examiner ou modifier les parties ASCII, vous pouvez ouvrir le fichier avec le gestionnaire d'erreurs ``surrogateescape`` ::

source: The ``surrogateescape`` error handler will decode any non-ASCII bytes as code points in a special range running from U+DC80 to U+DCFF. These code points will then turn back into the same bytes when the ``surrogateescape`` error handler is used to encode the data and write it back out.
fr: Le gestionnaire d'erreurs ``surrogateescape`` décode tous les octets non-ASCII comme points de code dans une plage spéciale allant de ``U+DC80`` à ``U+DCFF``. Ces points de code redeviennent alors les mêmes octets lorsque le gestionnaire d'erreurs ``surrogateescape`` est utilisé pour encoder les données et les réécrire.

source: One section of `Mastering Python 3 Input/Output <http://pyvideo.org/video/289/pycon-2010--mastering-python-3-i-o>`_, a PyCon 2010 talk by David Beazley, discusses text processing and binary data handling.
fr: Une partie de la conférence `*Mastering Python 3 Input/Output* <http://pyvideo.org/video/289/pycon-2010--mastering-python-3-i-o>`_ (ressource en anglais), donnée lors de *PyCon* 2010 de David Beazley, parle du traitement de texte et du traitement des données binaires.

source: The `PDF slides for Marc-André Lemburg's presentation "Writing Unicode-aware Applications in Python" <https://downloads.egenix.com/python/LSM2005-Developing-Unicode-aware-applications-in-Python.pdf>`_ discuss questions of character encodings as well as how to internationalize and localize an application. These slides cover Python 2.x only.
fr: Le `PDF du diaporama de la présentation de Marc-André Lemburg "Writing Unicodeaware Applications in Python" <https://downloads.egenix.com/python/LSM2005-Developing-Unicode-aware-applications-in-Python.pdf>`_ (ressource en anglais) traite des questions d'encodage de caractères ainsi que de l'internationalisation et de la localisation d'une application. Ces diapositives ne couvrent que Python 2.x.

source: `The Guts of Unicode in Python <http://pyvideo.org/video/1768/the-guts-of-unicode-in-python>`_ is a PyCon 2013 talk by Benjamin Peterson that discusses the internal Unicode representation in Python 3.3.
fr: `*The Guts of Unicode in Python* <http://pyvideo.org/video/1768/the-guts-of-unicode-in-python>`_ (ressource en anglais) est une conférence *PyCon* 2013 donnée par Benjamin Peterson qui traite de la représentation interne Unicode en Python 3.3.

source: Acknowledgements
fr: Remerciements

source: The initial draft of this document was written by Andrew Kuchling. It has since been revised further by Alexander Belopolsky, Georg Brandl, Andrew Kuchling, and Ezio Melotti.
fr: La première ébauche de ce document a été rédigée par Andrew Kuchling. Il a depuis été révisé par Alexander Belopolsky, Georg Brandl, Andrew Kuchling et Ezio Melotti.

source: Thanks to the following people who have noted errors or offered suggestions on this article: Éric Araujo, Nicholas Bastin, Nick Coghlan, Marius Gedminas, Kent Johnson, Ken Krugler, Marc-André Lemburg, Martin von Löwis, Terry J. Reedy, Serhiy Storchaka, Eryk Sun, Chad Whitacre, Graham Wideman.
fr: Merci aux personnes suivantes qui ont noté des erreurs ou qui ont fait des suggestions sur cet article : Éric Araujo, Nicholas Bastin, Nick Coghlan, Marius Gedminas, Kent Johnson, Ken Krugler, Marc-André Lemburg, Martin von Löwis, Terry J. Reedy, Serhiy Storchaka, Eryk Sun, Chad Whitacre, Graham Wideman.
