Repository: python/python-docs-fr
Catalog: howto/unicode.po
Languages: fr

source: Using escape sequences for code points greater than 127 is fine in small doses, but becomes an annoyance if you're using many accented characters, as you would in a program with messages in French or some other accent-using language. You can also assemble strings using the :func:`chr` built-in function, but this is even more tedious.
fr: L'utilisation de séquences d'échappement pour des points de code supérieurs à 127 est acceptable à faible dose, mais devient gênante si vous utilisez beaucoup de caractères accentués, comme c'est le cas dans un programme avec des messages en français ou dans une autre langue utilisant des lettres accentuées. Vous pouvez également assembler des chaînes de caractères à l'aide de la fonction native :func:`chr`, mais c'est encore plus fastidieux.

source: Ideally, you'd want to be able to write literals in your language's natural encoding. You could then edit Python source code with your favorite editor which would display the accented characters naturally, and have the right characters used at runtime.
fr: Idéalement, vous devriez être capable d'écrire des littéraux dans l'encodage naturel de votre langue. Vous pourriez alors éditer le code source de Python avec votre éditeur favori qui affiche les caractères accentués naturellement, et a les bons caractères utilisés au moment de l'exécution.

source: Python supports writing source code in UTF-8 by default, but you can use almost any encoding if you declare the encoding being used. This is done by including a special comment as either the first or second line of the source file::
fr: Python considère que le code source est écrit en UTF-8 par défaut, mais vous pouvez utiliser presque n'importe quel encodage si vous déclarez l'encodage utilisé. Cela se fait en incluant un commentaire spécial sur la première ou la deuxième ligne du fichier source ::

source: The syntax is inspired by Emacs's notation for specifying variables local to a file. Emacs supports many different variables, but Python only supports 'coding'. The ``-*-`` symbols indicate to Emacs that the comment is special; they have no significance to Python but are a convention. Python looks for ``coding: name`` or ``coding=name`` in the comment.
fr: La syntaxe s'inspire de la notation d'*Emacs* pour spécifier les variables locales à un fichier. *Emacs* supporte de nombreuses variables différentes, mais Python ne gère que *coding*. Les symboles ``-*-`` indiquent à *Emacs* que le commentaire est spécial ; ils n'ont aucune signification pour Python mais sont une convention. Python cherche ``coding: name`` ou ``coding=name`` dans le commentaire.

source: If you don't include such a comment, the default encoding used will be UTF-8 as already mentioned. See also :pep:`263` for more information.
fr: Si vous n'incluez pas un tel commentaire, l'encodage par défaut est UTF-8 comme déjà mentionné. Voir aussi la :pep:`263` pour plus d'informations.

source: Unicode Properties
fr: Propriétés Unicode

source: The Unicode specification includes a database of information about code points. For each defined code point, the information includes the character's name, its category, the numeric value if applicable (for characters representing numeric concepts such as the Roman numerals, fractions such as one-third and four-fifths, etc.). There are also display-related properties, such as how to use the code point in bidirectional text.
fr: La spécification Unicode inclut une base de données d'informations sur les points de code. Pour chaque point de code défini, l'information comprend le nom du caractère, sa catégorie, la valeur numérique s'il y a lieu (pour les caractères représentant des concepts numériques tels que les chiffres romains, les fractions telles qu'un tiers et quatre cinquièmes, etc.). Il existe également des propriétés liées à l'affichage, telles que l'utilisation du point de code dans un texte bidirectionnel.

source: The following program displays some information about several characters, and prints the numeric value of one particular character::
fr: Le programme suivant affiche des informations sur plusieurs caractères et affiche la valeur numérique d'un caractère particulier ::

source: When run, this prints:
fr: Si vous l'exécutez, cela affiche :

source: The category codes are abbreviations describing the nature of the character. These are grouped into categories such as "Letter", "Number", "Punctuation", or "Symbol", which in turn are broken up into subcategories. To take the codes from the above output, ``'Ll'`` means 'Letter, lowercase', ``'No'`` means "Number, other", ``'Mn'`` is "Mark, nonspacing", and ``'So'`` is "Symbol, other". See `the General Category Values section of the Unicode Character Database documentation <http://www.unicode.org/reports/tr44/#General_Category_Values>`_ for a list of category codes.
fr: Les codes de catégorie sont des abréviations décrivant la nature du caractère. Celles-ci sont regroupées en catégories telles que « Lettre », « Nombre », « Ponctuation » ou « Symbole », qui sont à leur tour divisées en sous-catégories. Pour prendre par exemple les codes de la sortie ci-dessus, ``'Ll'`` signifie « Lettre, minuscules », ``'No'`` signifie « Nombre, autre », ``'Mn'`` est « Marque, non-espaçant », et ``'So'`` est « Symbole, autre ». Voir la section `Valeurs générales des catégories de la documentation de la base de données de caractères Unicode <http://www.unicode.org/reports/tr44/#General_Category_Values>`_ (ressource en anglais) pour une liste de codes de catégories.

source: Comparing Strings
fr: Comparaison de chaînes de caractères

source: Unicode adds some complication to comparing strings, because the same set of characters can be represented by different sequences of code points. For example, a letter like 'ê' can be represented as a single code point U+00EA, or as U+0065 U+0302, which is the code point for 'e' followed by a code point for 'COMBINING CIRCUMFLEX ACCENT'. These will produce the same output when printed, but one is a string of length 1 and the other is of length 2.
fr: Unicode ajoute une certaine complication à la comparaison des chaînes de caractères, car le même jeu de caractères peut être représenté par différentes séquences de points de code. Par exemple, une lettre comme « ê » peut être représentée comme un point de code unique ``U+00EA``, ou comme ``U+0065 U+0302``, qui est le point de code pour « e » suivi d'un point de code pour ``COMBINING CIRCUMFLEX ACCENT``. Celles-ci produisent le même résultat lorsqu'elles sont affichées, mais l'une est une chaîne de caractères de longueur 1 et l'autre de longueur 2.

source: One tool for a case-insensitive comparison is the :meth:`~str.casefold` string method that converts a string to a case-insensitive form following an algorithm described by the Unicode Standard. This algorithm has special handling for characters such as the German letter 'ß' (code point U+00DF), which becomes the pair of lowercase letters 'ss'.
fr: Un outil pour une comparaison insensible à la casse est la méthode :meth:`~str.casefold` qui convertit une chaîne en une forme insensible à la casse suivant un algorithme décrit par le standard Unicode. Cet algorithme a un traitement spécial pour les caractères tels que la lettre allemande « *ß* » (point de code ``U+00DF``), qui devient la paire de lettres minuscules « *ss* ».

source: A second tool is the :mod:`unicodedata` module's :func:`~unicodedata.normalize` function that converts strings to one of several normal forms, where letters followed by a combining character are replaced with single characters. :func:`normalize` can be used to perform string comparisons that won't falsely report inequality if two strings use combining characters differently:
fr: Un deuxième outil est la fonction :mod:`unicodedata` du module :func:`~unicodedata.normalize` qui convertit les chaînes de caractères en l'une de plusieurs formes normales, où les lettres suivies d'un caractère de combinaison sont remplacées par des caractères simples. :func:`normalize` peut être utilisée pour effectuer des comparaisons qui ne rapportent pas faussement les inégalités si deux chaînes utilisent différents caractères de combinaison :

source: When run, this outputs:
fr: Si vous l'exécutez, cela affiche :

source: The first argument to the :func:`~unicodedata.normalize` function is a string giving the desired normalization form, which can be one of 'NFC', 'NFKC', 'NFD', and 'NFKD'.
fr: Le premier argument de la fonction :func:`~unicodedata.normalize` est une chaîne de caractères donnant la forme de normalisation désirée, qui peut être une de celles-ci : ``'NFC'``, ``'NFKC'``, ``'NFD'`` et ``'NFKD'``.

source: The Unicode Standard also specifies how to do caseless comparisons::
fr: La norme Unicode spécifie également comment faire des comparaisons insensibles à la casse ::

source: This will print ``True``. (Why is :func:`NFD` invoked twice? Because there are a few characters that make :meth:`casefold` return a non-normalized string, so the result needs to be normalized again. See section 3.13 of the Unicode Standard for a discussion and an example.)
fr: Ceci affiche ``True``. (Pourquoi :func:`NFD` est-il invoqué deux fois ? Parce qu'il y a quelques caractères qui font que :meth:`casefold` renvoie une chaîne non normalisée, donc le résultat doit être normalisé à nouveau. Voir la section 3.13 du standard Unicode pour une discussion et un exemple).

source: Unicode Regular Expressions
fr: Expressions régulières Unicode

source: The regular expressions supported by the :mod:`re` module can be provided either as bytes or strings. Some of the special character sequences such as ``\d`` and ``\w`` have different meanings depending on whether the pattern is supplied as bytes or a string. For example, ``\d`` will match the characters ``[0-9]`` in bytes but in strings will match any character that's in the ``'Nd'`` category.
fr: Les expressions régulières gérées par le module :mod:`re` peuvent être fournies sous forme de chaîne d'octets ou de texte. Certaines séquences de caractères spéciaux telles que ``\d`` et ``\w`` ont des significations différentes selon que le motif est fourni en octets ou en texte. Par exemple, ``\d`` correspond aux caractères ``[0-9]`` en octets mais dans les chaînes de caractères correspond à tout caractère de la catégorie ``'Nd'``.

source: The string in this example has the number 57 written in both Thai and Arabic numerals::
fr: Dans cet exemple, la chaîne contient le nombre 57 écrit en chiffres arabes et thaïlandais ::

source: When executed, ``\d+`` will match the Thai numerals and print them out. If you supply the :const:`re.ASCII` flag to :func:`~re.compile`, ``\d+`` will match the substring "57" instead.
fr: Une fois exécuté, ``\d+`` correspond aux chiffres thaïlandais et les affiche. Si vous fournissez le drapeau :const:`re.ASCII` à :func:`~re.compile`, ``\d+`` correspond cette fois à la chaîne "57".

source: Similarly, ``\w`` matches a wide variety of Unicode characters but only ``[a-zA-Z0-9_]`` in bytes or if :const:`re.ASCII` is supplied, and ``\s`` will match either Unicode whitespace characters or ``[ \t\n\r\f\v]``.
fr: De même, ``\w`` correspond à une grande variété de caractères Unicode mais seulement ``[a-zA-Z0-9_]`` en octets (ou si :const:`re.ASCII` est fourni) et ``\s`` correspond soit aux caractères blancs Unicode soit aux caractères ``[ \t\n\r\f\v]``.

source: Some good alternative discussions of Python's Unicode support are:
fr: Quelques bonnes discussions alternatives sur la gestion d'Unicode par Python sont :

source: `Processing Text Files in Python 3 <http://python-notes.curiousefficiency.org/en/latest/python3/text_file_processing.html>`_, by Nick Coghlan.
fr: `*Processing Text Files in Python 3* <http://python-notes.curiousefficiency.org/en/latest/python3/text_file_processing.html>`_, par Nick Coghlan.

source: `Pragmatic Unicode <https://nedbatchelder.com/text/unipain.html>`_, a PyCon 2012 presentation by Ned Batchelder.
fr: `*Pragmatic Unicode* <https://nedbatchelder.com/text/unipain.html>`_, une présentation *PyCon* 2012 par Ned Batchelder.

source: The :class:`str` type is described in the Python library reference at :ref:`textseq`.
fr: Le type :class:`str` est décrit dans la référence de la bibliothèque Python à :ref:`textseq`.

source: The documentation for the :mod:`unicodedata` module.
fr: La documentation du module :mod:`unicodedata`.

source: The documentation for the :mod:`codecs` module.
fr: La documentation du module :mod:`codecs`.

source: Marc-André Lemburg gave `a presentation titled "Python and Unicode" (PDF slides) <https://downloads.egenix.com/python/Unicode-EPC2002-Talk.pdf>`_ at EuroPython 2002. The slides are an excellent overview of the design of Python 2's Unicode features (where the Unicode string type is called ``unicode`` and literals start with ``u``).
fr: Marc-André Lemburg a donné une présentation intitulée `« Python et Unicode » (diapositives PDF) <https://downloads.egenix.com/python/Unicode-EPC2002-Talk.pdf>`_ à *EuroPython* 2002. Les diapositives sont un excellent aperçu de la conception des fonctionnalités Unicode de Python 2 (où le type de chaîne Unicode est appelé ``unicode`` et les littéraux commencent par ``u``).

source: Reading and Writing Unicode Data
fr: Lecture et écriture de données Unicode

source: Once you've written some code that works with Unicode data, the next problem is input/output. How do you get Unicode strings into your program, and how do you convert Unicode into a form suitable for storage or transmission?
fr: Une fois que vous avez écrit du code qui fonctionne avec des données Unicode, le problème suivant concerne les entrées/sorties. Comment obtenir des chaînes Unicode dans votre programme et comment convertir les chaînes Unicode dans une forme appropriée pour le stockage ou la transmission ?

source: It's possible that you may not need to do anything depending on your input sources and output destinations; you should check whether the libraries used in your application support Unicode natively. XML parsers often return Unicode data, for example. Many relational databases also support Unicode-valued columns and can return Unicode values from an SQL query.
fr: Il est possible que vous n'ayez rien à faire en fonction de vos sources d'entrée et des destinations de vos données de sortie ; il convient de vérifier si les bibliothèques utilisées dans votre application gèrent l'Unicode nativement. Par exemple, les analyseurs XML renvoient souvent des données Unicode. De nombreuses bases de données relationnelles prennent également en charge les colonnes encodées en Unicode et peuvent renvoyer des valeurs Unicode à partir d'une requête SQL.

source: Unicode data is usually converted to a particular encoding before it gets written to disk or sent over a socket. It's possible to do all the work yourself: open a file, read an 8-bit bytes object from it, and convert the bytes with ``bytes.decode(encoding)``. However, the manual approach is not recommended.
fr: Les données Unicode sont généralement converties en un encodage particulier avant d'être écrites sur le disque ou envoyées sur un connecteur réseau. Il est possible de faire tout le travail vous-même : ouvrir un fichier, lire un élément 8-bits, puis convertir les octets avec ``bytes.decode(encoding)``. Cependant, l'approche manuelle n'est pas recommandée.

source: One problem is the multi-byte nature of encodings; one Unicode character can be represented by several bytes. If you want to read the file in arbitrary-sized chunks (say, 1024 or 4096 bytes), you need to write error-handling code to catch the case where only part of the bytes encoding a single Unicode character are read at the end of a chunk. One solution would be to read the entire file into memory and then perform the decoding, but that prevents you from working with files that are extremely large; if you need to read a 2 GiB file, you need 2 GiB of RAM. (More, really, since for at least a moment you'd need to have both the encoded string and its Unicode version in memory.)
fr: La nature multi-octets des encodages pose problème ; un caractère Unicode peut être représenté par plusieurs octets. Si vous voulez lire le fichier par morceaux de taille arbitraire (disons 1024 ou 4096 octets), vous devez écrire un code de gestion des erreurs pour détecter le cas où une partie seulement des octets codant un seul caractère Unicode est lue à la fin d'un morceau. Une solution serait de lire le fichier entier en mémoire et d'effectuer le décodage, mais cela vous empêche de travailler avec des fichiers extrêmement volumineux ; si vous avez besoin de lire un fichier de 2 Gio, vous avez besoin de 2 Gio de RAM (plus que ça, en fait, puisque pendant un moment, vous aurez besoin d'avoir à la fois la chaîne encodée et sa version Unicode en mémoire).

source: The solution would be to use the low-level decoding interface to catch the case of partial coding sequences. The work of implementing this has already been done for you: the built-in :func:`open` function can return a file-like object that assumes the file's contents are in a specified encoding and accepts Unicode parameters for methods such as :meth:`~io.TextIOBase.read` and :meth:`~io.TextIOBase.write`. This works through :func:`open`\'s *encoding* and *errors* parameters which are interpreted just like those in :meth:`str.encode` and :meth:`bytes.decode`.
fr: La solution serait d'utiliser l'interface de décodage de bas-niveau pour intercepter le cas des séquences d'encodage incomplètes. Ce travail d'implémentation a déjà été fait pour vous : la fonction native :func:`open` peut renvoyer un objet de type fichier qui suppose que le contenu du fichier est dans un encodage spécifié et accepte les paramètres Unicode pour des méthodes telles que :meth:`~io.TextIOBase.read` et :meth:`~io.TextIOBase.write`. Ceci fonctionne grâce aux paramètres *encoding* et *errors* de :func:`open` qui sont interprétés comme ceux de :meth:`str.encode` et :meth:`bytes.decode`.

source: Reading Unicode from a file is therefore simple::
fr: Lire de l'Unicode à partir d'un fichier est donc simple ::

source: It's also possible to open files in update mode, allowing both reading and writing::
fr: Il est également possible d'ouvrir des fichiers en mode « mise à jour », permettant à la fois la lecture et l'écriture ::

source: The Unicode character ``U+FEFF`` is used as a byte-order mark (BOM), and is often written as the first character of a file in order to assist with autodetection of the file's byte ordering. Some encodings, such as UTF-16, expect a BOM to be present at the start of a file; when such an encoding is used, the BOM will be automatically written as the first character and will be silently dropped when the file is read. There are variants of these encodings, such as 'utf-16-le' and 'utf-16-be' for little-endian and big-endian encodings, that specify one particular byte ordering and don't skip the BOM.
fr: Le caractère Unicode ``U+FEFFF`` est utilisé comme marque pour indiquer le boutisme (c'est-à-dire l'ordre dans lequel les octets sont placés pour indiquer une valeur sur plusieurs octets, *byte-order mark* en anglais ou *BOM*), et est souvent écrit en tête (premier caractère) d'un fichier afin d'aider à l'auto-détection du boutisme du fichier. Certains encodages, comme UTF-16, s'attendent à ce qu'une *BOM* soit présente au début d'un fichier ; lorsqu'un tel encodage est utilisé, la *BOM* sera automatiquement écrite comme premier caractère et sera silencieusement retirée lorsque le fichier sera lu. Il existe des variantes de ces encodages, comme ``utf-16-le`` et ``utf-16-be`` pour les encodages petit-boutiste et gros-boutiste, qui spécifient un ordre d'octets donné et ne sautent pas la *BOM*.

source: In some areas, it is also convention to use a "BOM" at the start of UTF-8 encoded files; the name is misleading since UTF-8 is not byte-order dependent. The mark simply announces that the file is encoded in UTF-8. For reading such files, use the 'utf-8-sig' codec to automatically skip the mark if present.
fr: Dans certains cas, il est également d'usage d'utiliser une *BOM* au début des fichiers encodés en UTF-8 ; le nom est trompeur puisque l'UTF-8 ne dépend pas de l'ordre des octets. La marque annonce simplement que le fichier est encodé en UTF-8. Pour lire ces fichiers, utilisez le codec ``utf-8-sig`` pour sauter automatiquement la marque si elle est présente.

source: Unicode filenames
fr: Noms de fichiers Unicode

source: Most of the operating systems in common use today support filenames that contain arbitrary Unicode characters. Usually this is implemented by converting the Unicode string into some encoding that varies depending on the system. Today Python is converging on using UTF-8: Python on MacOS has used UTF-8 for several versions, and Python 3.6 switched to using UTF-8 on Windows as well. On Unix systems, there will only be a filesystem encoding if you've set the ``LANG`` or ``LC_CTYPE`` environment variables; if you haven't, the default encoding is again UTF-8.
fr: La plupart des systèmes d'exploitation couramment utilisés aujourd'hui prennent en charge les noms de fichiers qui contiennent des caractères Unicode arbitraires. Habituellement, ceci est implémenté en convertissant la chaîne Unicode en un encodage qui varie en fonction du système. Aujourd'hui, Python converge vers l'utilisation d'UTF-8 : Python sous MacOS utilise UTF-8 depuis plusieurs versions et Python 3.6 sous Windows est passé à UTF-8 également. Sur les systèmes Unix, il n'y aura un encodage pour le système de fichiers que si vous avez défini les variables d'environnement ``LANG`` ou ``LC_CTYPE`` ; sinon, l'encodage par défaut est UTF-8.

source: The :func:`sys.getfilesystemencoding` function returns the encoding to use on your current system, in case you want to do the encoding manually, but there's not much reason to bother. When opening a file for reading or writing, you can usually just provide the Unicode string as the filename, and it will be automatically converted to the right encoding for you::
fr: La fonction :func:`sys.getfilesystemencoding` renvoie l'encodage à utiliser sur votre système actuel, au cas où vous voudriez faire l'encodage manuellement, mais il n'y a pas vraiment de raisons de s'embêter avec ça. Lors de l'ouverture d'un fichier pour la lecture ou l'écriture, vous pouvez généralement simplement fournir la chaîne Unicode comme nom de fichier et elle est automatiquement convertie à l'encodage qui convient ::

source: Functions in the :mod:`os` module such as :func:`os.stat` will also accept Unicode filenames.
fr: Les fonctions du module :mod:`os` telles que :func:`os.stat` acceptent également les noms de fichiers Unicode.
