Repository: python/python-docs-fr
Catalog: howto/unicode.po
Languages: fr

source: Unicode HOWTO
fr: Guide Unicode

source: Release
fr: Version

source: This HOWTO discusses Python's support for the Unicode specification for representing textual data, and explains various problems that people commonly encounter when trying to work with Unicode.
fr: Ce *HOWTO* décrit la gestion de la spécification Unicode par Python pour les données textuelles et explique les différents problèmes généralement rencontrés par les utilisateurs qui travaillent avec Unicode.

source: Introduction to Unicode
fr: Introduction à Unicode

source: Definitions
fr: Définitions

source: Today's programs need to be able to handle a wide variety of characters. Applications are often internationalized to display messages and output in a variety of user-selectable languages; the same program might need to output an error message in English, French, Japanese, Hebrew, or Russian. Web content can be written in any of these languages and can also include a variety of emoji symbols. Python's string type uses the Unicode Standard for representing characters, which lets Python programs work with all these different possible characters.
fr: Les programmes d'aujourd'hui doivent être capables de traiter une grande variété de caractères. Les applications sont souvent internationalisées pour afficher les messages et les résultats dans une variété de langues sélectionnables par l'utilisateur ; le même programme peut avoir besoin d'afficher un message d'erreur en anglais, français, japonais, hébreu ou russe. Le contenu Web peut être écrit dans n'importe laquelle de ces langues et peut également inclure une variété de symboles émoji. Le type de chaîne de caractères de Python utilise le standard Unicode pour représenter les caractères, ce qui permet aux programmes Python de travailler avec tous ces différents caractères possibles.

source: Unicode (https://www.unicode.org/) is a specification that aims to list every character used by human languages and give each character its own unique code. The Unicode specifications are continually revised and updated to add new languages and symbols.
fr: Unicode (https://www.unicode.org/) est une spécification qui vise à lister tous les caractères utilisés par les langues humaines et à donner à chaque caractère son propre code unique. Les spécifications Unicode sont continuellement révisées et mises à jour pour ajouter de nouvelles langues et de nouveaux symboles.

source: A **character** is the smallest possible component of a text. 'A', 'B', 'C', etc., are all different characters. So are 'È' and 'Í'. Characters vary depending on the language or context you're talking about. For example, there's a character for "Roman Numeral One", 'Ⅰ', that's separate from the uppercase letter 'I'. They'll usually look the same, but these are two different characters that have different meanings.
fr: Un **caractère** est le plus petit composant possible d'un texte. « A », « B », « C », etc. sont tous des caractères différents. Il en va de même pour « È » et « Í ». Les caractères varient selon la langue ou le contexte dont vous parlez. Par exemple, il y a un caractère pour « Chiffre Romain Un » (*Roman Numeral One*), « Ⅰ », qui est séparé de la lettre majuscule « I ». Ils se ressemblent généralement, mais ce sont deux caractères différents qui ont des significations différentes.

source: The Unicode standard describes how characters are represented by **code points**. A code point value is an integer in the range 0 to 0x10FFFF (about 1.1 million values, with some 110 thousand assigned so far). In the standard and in this document, a code point is written using the notation ``U+265E`` to mean the character with value ``0x265e`` (9,822 in decimal).
fr: Le standard Unicode décrit comment les caractères sont représentés par les **points de code**. Une valeur de point de code est un nombre entier compris entre ``0`` et ``0x10FFFF`` (environ 1,1 million de valeurs, avec environ 110 000 valeurs attribuées à ce jour). Dans le standard et dans le présent document, un point de code est écrit en utilisant la notation ``U+265E`` pour désigner le caractère avec la valeur ``0x265e`` (9 822 en décimal).

source: The Unicode standard contains a lot of tables listing characters and their corresponding code points:
fr: La standard Unicode contient de nombreux tableaux contenant la liste des caractères et des points de code correspondants :

source: Strictly, these definitions imply that it's meaningless to say 'this is character ``U+265E``'. ``U+265E`` is a code point, which represents some particular character; in this case, it represents the character 'BLACK CHESS KNIGHT', '♞'. In informal contexts, this distinction between code points and characters will sometimes be forgotten.
fr: À proprement parler, ces définitions laissent entendre qu'il est inutile de dire « c'est le caractère ``U+265E`` ». ``U+265E`` est un point de code, qui représente un caractère particulier ; dans ce cas, il représente le caractère « BLACK CHESS KNIGHT », « ♞ ». Dans des contextes informels, cette distinction entre les points de code et les caractères sera parfois oubliée.

source: A character is represented on a screen or on paper by a set of graphical elements that's called a **glyph**. The glyph for an uppercase A, for example, is two diagonal strokes and a horizontal stroke, though the exact details will depend on the font being used. Most Python code doesn't need to worry about glyphs; figuring out the correct glyph to display is generally the job of a GUI toolkit or a terminal's font renderer.
fr: Un caractère est représenté sur un écran ou sur papier par un ensemble d’éléments graphiques appelé **glyphe**. Le glyphe d’un A majuscule, par exemple, est deux traits diagonaux et un trait horizontal, bien que les détails exacts dépendent de la police utilisée. La plupart du code Python n’a pas besoin de s’inquiéter des glyphes ; trouver le bon glyphe à afficher est généralement le travail d’une boîte à outils GUI ou du moteur de rendu des polices d’un terminal.

source: Encodings
fr: Encodages

source: To summarize the previous section: a Unicode string is a sequence of code points, which are numbers from 0 through ``0x10FFFF`` (1,114,111 decimal). This sequence of code points needs to be represented in memory as a set of **code units**, and **code units** are then mapped to 8-bit bytes. The rules for translating a Unicode string into a sequence of bytes are called a **character encoding**, or just an **encoding**.
fr: Pour résumer la section précédente : une chaîne Unicode est une séquence de points de code, qui sont des nombres de ``0`` à ``0x10FFFF`` (1 114 111 en décimal). Cette séquence de points de code doit être stockée en mémoire sous la forme d'un ensemble de **unités de code**, et les **unités de code** sont ensuite transposées en octets de 8 bits. Les règles de traduction d'une chaîne Unicode en une séquence d'octets sont appelées un **encodage de caractères** ou simplement un **encodage**.

source: The first encoding you might think of is using 32-bit integers as the code unit, and then using the CPU's representation of 32-bit integers. In this representation, the string "Python" might look like this:
fr: Le premier encodage auquel vous pouvez penser est l'utilisation d'entiers 32 bits comme unité de code, puis l'utilisation de la représentation des entiers 32 bits par le CPU. Dans cette représentation, la chaîne « Python » ressemblerait à ceci :

source: This representation is straightforward but using it presents a number of problems.
fr: Cette représentation est simple mais son utilisation pose un certain nombre de problèmes.

source: It's not portable; different processors order the bytes differently.
fr: Elle n’est pas portable ; des processeurs différents ordonnent les octets différemment.

source: It's very wasteful of space. In most texts, the majority of the code points are less than 127, or less than 255, so a lot of space is occupied by ``0x00`` bytes. The above string takes 24 bytes compared to the 6 bytes needed for an ASCII representation. Increased RAM usage doesn't matter too much (desktop computers have gigabytes of RAM, and strings aren't usually that large), but expanding our usage of disk and network bandwidth by a factor of 4 is intolerable.
fr: Elle gâche beaucoup d'espace. Dans la plupart des textes, la majorité des points de code sont inférieurs à 127, ou à 255, donc beaucoup d'espace est occupé par des octets ``0x00``. La chaîne ci-dessus occupe 24 octets, à comparer aux 6 octets nécessaires pour une représentation en ASCII. L'utilisation supplémentaire de RAM n'a pas trop d'importance (les ordinateurs de bureau ont des gigaoctets de RAM et les chaînes ne sont généralement pas si grandes que ça), mais l'accroissement de notre utilisation du disque et de la bande passante réseau par un facteur de 4 est intolérable.

source: It's not compatible with existing C functions such as ``strlen()``, so a new family of wide string functions would need to be used.
fr: Elle n’est pas compatible avec les fonctions C existantes telles que ``strlen()``, il faudrait donc utiliser une nouvelle famille de fonctions, celle des chaînes larges (*wide strings*).

source: Therefore this encoding isn't used very much, and people instead choose other encodings that are more efficient and convenient, such as UTF-8.
fr: Par conséquent, cet encodage n'est pas très utilisé et d'autres encodages, plus efficaces et pratiques comme UTF-8, sont plutôt choisis.

source: UTF-8 is one of the most commonly used encodings, and Python often defaults to using it. UTF stands for "Unicode Transformation Format", and the '8' means that 8-bit values are used in the encoding. (There are also UTF-16 and UTF-32 encodings, but they are less frequently used than UTF-8.) UTF-8 uses the following rules:
fr: UTF-8 est l’un des encodages les plus couramment utilisés et Python l’utilise souvent par défaut. UTF signifie « Unicode Transformation Format » (format de transformation Unicode) et « 8 » signifie que des nombres à 8 bits sont utilisés dans l'encodage (il existe également des codages UTF-16 et UTF-32, mais ils sont moins souvent utilisés que UTF-8). UTF-8 utilise les règles suivantes :

source: If the code point is < 128, it's represented by the corresponding byte value.
fr: Si le point de code est < 128, il est représenté par la valeur de l'octet correspondant.

source: If the code point is >= 128, it's turned into a sequence of two, three, or four bytes, where each byte of the sequence is between 128 and 255.
fr: Si le point de code est ≥ 128, il est transformé en une séquence de deux, trois ou quatre octets, où chaque octet de la séquence est compris entre 128 et 255.

source: UTF-8 has several convenient properties:
fr: UTF-8 a plusieurs propriétés intéressantes :

source: It can handle any Unicode code point.
fr: Il peut gérer n'importe quel point de code Unicode.

source: A Unicode string is turned into a sequence of bytes that contains embedded zero bytes only where they represent the null character (U+0000). This means that UTF-8 strings can be processed by C functions such as ``strcpy()`` and sent through protocols that can't handle zero bytes for anything other than end-of-string markers.
fr: Une chaîne Unicode est transformée en une séquence d’octets qui contient des octets zéro uniquement lorsqu’ils représentent le caractère nul (U+0000). Cela signifie que les chaînes UTF-8 peuvent être traitées par des fonctions C telles que ``strcpy()`` et envoyées par des protocoles pour qui les octets zéro signifient forcément la fin de chaîne.

source: A string of ASCII text is also valid UTF-8 text.
fr: Une chaîne de texte ASCII est également un texte UTF-8 valide.

source: UTF-8 is fairly compact; the majority of commonly used characters can be represented with one or two bytes.
fr: UTF-8 est assez compact. La majorité des caractères couramment utilisés peuvent être représentés avec un ou deux octets.

source: If bytes are corrupted or lost, it's possible to determine the start of the next UTF-8-encoded code point and resynchronize. It's also unlikely that random 8-bit data will look like valid UTF-8.
fr: Si des octets sont corrompus ou perdus, il est possible de déterminer le début du prochain point de code encodé en UTF-8 et de se resynchroniser. Il est également improbable que des données 8-bits aléatoires ressemblent à du UTF-8 valide.

source: UTF-8 is a byte oriented encoding. The encoding specifies that each character is represented by a specific sequence of one or more bytes. This avoids the byte-ordering issues that can occur with integer and word oriented encodings, like UTF-16 and UTF-32, where the sequence of bytes varies depending on the hardware on which the string was encoded.
fr: UTF-8 est un encodage orienté octet. L'encodage spécifie que chaque caractère est représenté par une séquence spécifique d'un ou plusieurs octets. Ceci permet d'éviter les problèmes d'ordre des octets qui peuvent survenir avec les encodages orientés entiers (*integer*) ou orientés mots processeurs (*words*), comme UTF-16 et UTF-32, où la séquence des octets varie en fonction du matériel sur lequel la chaîne a été encodée.

source: References
fr: Références

source: The `Unicode Consortium site <http://www.unicode.org>`_ has character charts, a glossary, and PDF versions of the Unicode specification. Be prepared for some difficult reading. `A chronology <http://www.unicode.org/history/>`_ of the origin and development of Unicode is also available on the site.
fr: Le site du `Consortium Unicode <http://www.unicode.org>`_, en anglais, a des diagrammes de caractères, un glossaire et des versions PDF de la spécification Unicode. Préparez-vous à une lecture difficile. Une `chronologie <http://www.unicode.org/history/>`_ de l’origine et du développement de l’Unicode est également disponible sur le site.

source: On the Computerphile Youtube channel, Tom Scott briefly `discusses the history of Unicode and UTF-8 <https://www.youtube.com/watch?v=MijmeoH9LT4>`_ (9 minutes 36 seconds).
fr: Sur la chaîne Youtube *Computerphile*, Tom Scott, en anglais, `parle brièvement de l'histoire d'Unicode et d'UTF-8 <https://www.youtube.com/watch?v=MijmeoH9LT4>`_ (9 minutes et 36 secondes).

source: To help understand the standard, Jukka Korpela has written `an introductory guide <http://jkorpela.fi/unicode/guide.html>`_ to reading the Unicode character tables.
fr: Pour aider à comprendre le standard, Jukka Korpela a écrit `un guide d’introduction <http://jkorpela.fi/unicode/guide.html>`_ à la lecture des tables de caractères Unicode (ressource en anglais).

source: Another `good introductory article <https://www.joelonsoftware.com/2003/10/08/the-absolute-minimum-every-software-developer-absolutely-positively-must-know-about-unicode-and-character-sets-no-excuses/>`_ was written by Joel Spolsky. If this introduction didn't make things clear to you, you should try reading this alternate article before continuing.
fr: Un autre `bon article d'introduction <https://www.joelonsoftware.com/2003/10/08/the-absolute-minimum-every-software-developer-absolutely-positively-must-know-about-unicode-and-character-sets-no-excuses/>`_ a été écrit par Joel Spolsky. Si cette présente introduction ne vous a pas clarifié les choses, vous devriez essayer de lire cet article-là avant de continuer.

source: Wikipedia entries are often helpful; see the entries for "`character encoding <https://en.wikipedia.org/wiki/Character_encoding>`_" and `UTF-8 <https://en.wikipedia.org/wiki/UTF-8>`_, for example.
fr: Les pages Wikipédia sont souvent utiles ; voir les pages pour « `Codage des caractères <https://fr.wikipedia.org/wiki/Codage_des_caract%C3%A8res>`_ » et `UTF-8 <https://fr.wikipedia.org/wiki/UTF-8>`_, par exemple.

source: Python's Unicode Support
fr: Prise en charge Unicode de Python

source: Now that you've learned the rudiments of Unicode, we can look at Python's Unicode features.
fr: Maintenant que vous avez appris les rudiments de l'Unicode, nous pouvons regarder les fonctionnalités Unicode de Python.

source: The String Type
fr: Le type *String*

source: Since Python 3.0, the language's :class:`str` type contains Unicode characters, meaning any string created using ``"unicode rocks!"``, ``'unicode rocks!'``, or the triple-quoted string syntax is stored as Unicode.
fr: Depuis Python 3.0, le type :class:`str` du langage contient des caractères Unicode, c'est-à-dire n'importe quelle chaîne créée à l'aide de ``"unicode déchire !"``, ``'unicode déchire !'`` ou la syntaxe à triples guillemets est enregistrée comme Unicode.

source: The default encoding for Python source code is UTF-8, so you can simply include a Unicode character in a string literal::
fr: L'encodage par défaut pour le code source Python est UTF-8, il est donc facile d'inclure des caractères Unicode dans une chaîne littérale ::

source: Side note: Python 3 also supports using Unicode characters in identifiers::
fr: Note : Python 3 sait gérer les caractères Unicode dans les identifiants ::

source: If you can't enter a particular character in your editor or want to keep the source code ASCII-only for some reason, you can also use escape sequences in string literals. (Depending on your system, you may see the actual capital-delta glyph instead of a \u escape.) ::
fr: Si vous ne pouvez pas entrer un caractère particulier dans votre éditeur ou si vous voulez garder le code source uniquement en ASCII pour une raison quelconque, vous pouvez également utiliser des séquences d'échappement dans les littéraux de chaîne (en fonction de votre système, il se peut que vous voyiez le glyphe réel du *delta majuscule* au lieu d'une séquence d'échappement ``\u...``) ::

source: In addition, one can create a string using the :func:`~bytes.decode` method of :class:`bytes`. This method takes an *encoding* argument, such as ``UTF-8``, and optionally an *errors* argument.
fr: De plus, une chaîne de caractères peut être créée en utilisant la méthode :func:`~bytes.decode` de la classe :class:`bytes`. Cette méthode prend un argument *encoding*, ``UTF-8`` par exemple, et optionnellement un argument *errors*.

source: The *errors* argument specifies the response when the input string can't be converted according to the encoding's rules. Legal values for this argument are ``'strict'`` (raise a :exc:`UnicodeDecodeError` exception), ``'replace'`` (use ``U+FFFD``, ``REPLACEMENT CHARACTER``), ``'ignore'`` (just leave the character out of the Unicode result), or ``'backslashreplace'`` (inserts a ``\xNN`` escape sequence). The following examples show the differences::
fr: L'argument *errors* détermine la réponse lorsque la chaîne en entrée ne peut pas être convertie selon les règles de l'encodage. Les valeurs autorisées pour cet argument sont ``'strict'`` (« strict » : lève une exception :exc:`UnicodeDecodeError`), ``'replace'`` (« remplacer » : utilise ``U+FFFD``, ``REPLACEMENT CARACTER``), ``'ignore'`` (« ignorer » : n'inclut pas le caractère dans le résultat Unicode) ou ``'backslashreplace'`` (« remplacer avec antislash » : insère une séquence d’échappement ``\xNN``). Les exemples suivants illustrent les différences ::

source: Encodings are specified as strings containing the encoding's name. Python comes with roughly 100 different encodings; see the Python Library Reference at :ref:`standard-encodings` for a list. Some encodings have multiple names; for example, ``'latin-1'``, ``'iso_8859_1'`` and ``'8859``' are all synonyms for the same encoding.
fr: Les encodages sont spécifiés sous forme de chaînes de caractères contenant le nom de l'encodage. Python est livré avec une centaine d'encodages différents ; voir la référence de la bibliothèque Python sur les :ref:`encodages standards <standard-encodings>` pour une liste. Certains encodages ont plusieurs noms ; par exemple, ``'latin-1'``, ``'iso_8859_1'`` et ``'8859'`` sont tous synonymes du même encodage.

source: One-character Unicode strings can also be created with the :func:`chr` built-in function, which takes integers and returns a Unicode string of length 1 that contains the corresponding code point. The reverse operation is the built-in :func:`ord` function that takes a one-character Unicode string and returns the code point value::
fr: Des chaînes Unicode à un caractère peuvent également être créées avec la fonction native :func:`chr`, qui prend des entiers et renvoie une chaîne Unicode de longueur 1 qui contient le point de code correspondant. L'opération inverse est la fonction native :func:`ord` qui prend une chaîne Unicode d'un caractère et renvoie la valeur du point de code ::

source: Converting to Bytes
fr: Conversion en octets

source: The opposite method of :meth:`bytes.decode` is :meth:`str.encode`, which returns a :class:`bytes` representation of the Unicode string, encoded in the requested *encoding*.
fr: La méthode inverse de :meth:`bytes.decode` est :meth:`str.encode`, qui renvoie une représentation :class:`bytes` de la chaîne Unicode, codée dans l’encodage *encoding* demandé.

source: The *errors* parameter is the same as the parameter of the :meth:`~bytes.decode` method but supports a few more possible handlers. As well as ``'strict'``, ``'ignore'``, and ``'replace'`` (which in this case inserts a question mark instead of the unencodable character), there is also ``'xmlcharrefreplace'`` (inserts an XML character reference), ``backslashreplace`` (inserts a ``\uNNNN`` escape sequence) and ``namereplace`` (inserts a ``\N{...}`` escape sequence).
fr: Le paramètre *errors* est le même que le paramètre de la méthode :meth:`~bytes.decode` mais possède quelques gestionnaires supplémentaires. En plus de ``'strict'``, ``'ignore'`` et ``'remplace'`` (qui dans ce cas insère un point d'interrogation au lieu du caractère non codable), il y a aussi ``'xmlcharrefreplace'`` (insère une référence XML), ``backslashreplace`` (insère une séquence ``\uNNNN``) et ``namereplace`` (insère une séquence ``\N{...}``).

source: The following example shows the different results::
fr: L'exemple suivant montre les différents résultats ::

source: The low-level routines for registering and accessing the available encodings are found in the :mod:`codecs` module. Implementing new encodings also requires understanding the :mod:`codecs` module. However, the encoding and decoding functions returned by this module are usually more low-level than is comfortable, and writing new encodings is a specialized task, so the module won't be covered in this HOWTO.
fr: Les routines de bas niveau pour enregistrer et accéder aux encodages disponibles se trouvent dans le module :mod:`codecs`. L'implémentation de nouveaux encodages nécessite également de comprendre le module :mod:`codecs`. Cependant, les fonctions d'encodage et de décodage renvoyées par ce module sont généralement de bas-niveau pour être facilement utilisées et l'écriture de nouveaux encodages est une tâche très spécialisée, donc le module ne sera pas couvert dans ce guide.

source: Unicode Literals in Python Source Code
fr: Littéraux Unicode dans le code source Python

source: In Python source code, specific Unicode code points can be written using the ``\u`` escape sequence, which is followed by four hex digits giving the code point. The ``\U`` escape sequence is similar, but expects eight hex digits, not four::
fr: Dans le code source Python, des points de code Unicode spécifiques peuvent être écrits en utilisant la séquence d'échappement ``\u``, suivie de quatre chiffres hexadécimaux donnant le point de code. La séquence d'échappement ``\U`` est similaire, mais attend huit chiffres hexadécimaux, pas quatre ::
