Repository: python/python-docs-fr
Catalog: c-api/bytearray.po
Languages: fr

source: Byte Array Objects
fr: Objets tableau d'octets

source: This subtype of :c:type:`PyObject` represents a Python bytearray object.
fr: Ce sous-type e :c:type:`PyObject` représente un objet bytearray Python.

source: This instance of :c:type:`PyTypeObject` represents the Python bytearray type; it is the same object as :class:`bytearray` in the Python layer.
fr: Cette instance de :c:type:`PyTypeObject` représente le type Python *bytearray*, c'est le même que :class:`bytearray` côté Python.

source: Type check macros
fr: Macros de vérification de type

source: Return true if the object *o* is a bytearray object or an instance of a subtype of the bytearray type.
fr: Renvoie la valeur true (vrai) si l'objet *o* est un objet bytearray ou une instance d'un sous-type du type bytearray.

source: Return true if the object *o* is a bytearray object, but not an instance of a subtype of the bytearray type.
fr: Renvoie la valeur true si l'objet *o* est un objet bytearray, mais pas une instance d'un sous-type du type bytearray.

source: Direct API functions
fr: Fonctions directes sur l'API

source: Return a new bytearray object from any object, *o*, that implements the :ref:`buffer protocol <bufferobjects>`.
fr: Renvoie un nouvel objet *bytearray* depuis n'importe quel objet, *o*, qui implémente le :ref:`protocole buffer <bufferobjects>`.

source: Create a new bytearray object from *string* and its length, *len*. On failure, *NULL* is returned.
fr: Crée un nouvel objet bytearray à partir d'un objet *string* et de sa longueur, *len*. En cas d'échec, *NULL* est renvoyé.

source: Concat bytearrays *a* and *b* and return a new bytearray with the result.
fr: Concatène les bytearrays *a* et *b* et renvoit un nouveau bytearray avec le résultat.

source: Return the size of *bytearray* after checking for a *NULL* pointer.
fr: Renvoit la taille de *bytearray* après vérification de la présence d'un pointeur *NULL*.

source: Return the contents of *bytearray* as a char array after checking for a *NULL* pointer. The returned array always has an extra null byte appended.
fr: Renvoie le contenu de *bytearray* sous forme d'un tableau de caractères, en vérifiant que ce n'est pas un pointeur *NULL*. Le tableau renvoyé se termine toujours par un octet *null*.

source: Resize the internal buffer of *bytearray* to *len*.
fr: Redimensionne le buffer interne de *bytearray* à la taille *len*.

source: These macros trade safety for speed and they don't check pointers.
fr: Ces macros sont taillées pour la vitesse d'exécution et ne vérifient pas les pointeurs.

source: Macro version of :c:func:`PyByteArray_AsString`.
fr: Version macro de :c:func:`PyByteArray_AsString`.

source: Macro version of :c:func:`PyByteArray_Size`.
fr: Version macro de :c:func:`PyByteArray_Size`.
