Repository: python/python-docs-fr
Catalog: c-api/cell.po
Languages: fr

source: Cell Objects
fr: Objets Cellules

source: "Cell" objects are used to implement variables referenced by multiple scopes. For each such variable, a cell object is created to store the value; the local variables of each stack frame that references the value contains a reference to the cells from outer scopes which also use that variable. When the value is accessed, the value contained in the cell is used instead of the cell object itself. This de-referencing of the cell object requires support from the generated byte-code; these are not automatically de-referenced when accessed. Cell objects are not likely to be useful elsewhere.
fr: Les objets "Cellules" (*cell* en anglais) sont utilisés pour implémenter des variables référencées dans de multiples environnements. Pour chacune de ces variables, un objet cellule est créé pour stocker sa valeur ; les variables locales de chaque pile d'exécution qui référence cette valeur contiennent une référence sur les cellules des autres environnements qui utilisent aussi cette variable. Quand la valeur est accédée, la valeur de la cellule est utilisée, au lei de celle de l'objet cellule proprement dit. Ce dé-référencement de l'objet cellule requiert l'intervention du *bytecode* généré ; il n'est pas automatiquement dé-référencé quand il est accédé. Il est plausible que les objets cellules ne soit utilisés ailleurs.

source: The C structure used for cell objects.
fr: Structure C utilisée pour les objets *Cellules*.

source: The type object corresponding to cell objects.
fr: Type objet correspondant aux objets *Cellules*.

source: Return true if *ob* is a cell object; *ob* must not be *NULL*.
fr: Renvoie ``True`` si *ob* est un objet cellule ; *ob* ne doit pas être à *NULL*.

source: Create and return a new cell object containing the value *ob*. The parameter may be *NULL*.
fr: Crée et retourne un nouvel objet *Cellule* contenant la valeur *ob*. Le paramètre peut être mis à *NULL*.

source: Return the contents of the cell *cell*.
fr: Renvoie le contenu de la cellule *cell*.

source: Return the contents of the cell *cell*, but without checking that *cell* is non-*NULL* and a cell object.
fr: Renvoie le contenu de la cellule *cell*, mais sans vérifier si *cell* est non *NULL* et sans vérifier si c'est un objet *Cellule*.

source: Set the contents of the cell object *cell* to *value*. This releases the reference to any current content of the cell. *value* may be *NULL*. *cell* must be non-*NULL*; if it is not a cell object, ``-1`` will be returned. On success, ``0`` will be returned.
fr: Définit le contenu de l'objet *Cellule* à *value*. Cela libère la référence à toute valeur de la *celulle*. *value* peut être fixé à *NULL*. La *cellule* ne doit pas être *NULL* ; si ce n'est pas un objet *Cellule*, ``-1`` est renvoyé. Si c'est un objet *Cellule*, renvoie ``0``.

source: Sets the value of the cell object *cell* to *value*. No reference counts are adjusted, and no checks are made for safety; *cell* must be non-*NULL* and must be a cell object.
fr: Définit la valeur de l'objet *Cellule* à *value*. Pas de comptage de références n'est ajusté et il n'y' a pas de contrôle effectué pour vérifier la sûreté; *cell* doit être à non *NULL* et doit être un objet *Cellule*.
