Repository: python/python-docs-fr
Catalog: c-api/complex.po
Languages: fr

source: Complex Number Objects
fr: Objets représentant des nombres complexes

source: Python's complex number objects are implemented as two distinct types when viewed from the C API: one is the Python object exposed to Python programs, and the other is a C structure which represents the actual complex number value. The API provides functions for working with both.
fr: Les nombres complexes Python sont implémentés comme deux types distincts, lorsqu'ils sont vus de l'API C : l'un est l'objet Python tel qu'il est vu par les programmes Python, et l'autre est une structure C qui représente la valeur exacte du nombre complexe. L'API fournit des fonctions pour travailler avec ces deux représentations.

source: Complex Numbers as C Structures
fr: Nombres complexes en tant que structures C

source: Note that the functions which accept these structures as parameters and return them as results do so *by value* rather than dereferencing them through pointers. This is consistent throughout the API.
fr: Les fonctions qui acceptent ces structures comme paramètres et les renvoient comme résultats le font en fonction de leur *valeur* au lieu de les dé-référencer en utilisant des pointeurs. C'est constant dans toute l'API.

source: The C structure which corresponds to the value portion of a Python complex number object. Most of the functions for dealing with complex number objects use structures of this type as input or output values, as appropriate. It is defined as::
fr: Structure C représentant la valeur d'un nombre complexe Python. La majorité des fonctions qui traitent des nombres complexes utilisent cette structure en entrée ou en sortie, selon le cas. Elle est définie par ::

source: Return the sum of two complex numbers, using the C :c:type:`Py_complex` representation.
fr: Renvoie la somme de deux nombres complexes, sous la forme d'un :c:type:`Py_complex` en C.

source: Return the difference between two complex numbers, using the C :c:type:`Py_complex` representation.
fr: Renvoie la différence de deux nombres complexes, sous la forme d'un :c:type:`Py_complex` en C.

source: Return the negation of the complex number *complex*, using the C :c:type:`Py_complex` representation.
fr: Renvoie l'opposé du nombre complexe *complex*, sous la forme d'un :c:type:`Py_complex` en C.

source: Return the product of two complex numbers, using the C :c:type:`Py_complex` representation.
fr: Renvoie le produit de deux nombres complexes, sous la forme d'un :c:type:`Py_complex` en C.

source: Return the quotient of two complex numbers, using the C :c:type:`Py_complex` representation.
fr: Renvoie le quotient de deux nombres complexes, sous la forme d'un :c:type:`Py_complex` en C.

source: If *divisor* is null, this method returns zero and sets :c:data:`errno` to :c:data:`EDOM`.
fr: Si *divisor* est nul, cette méthode renvoie zéro et assigne :c:data:`EDOM` à :c:data:`errno`.

source: Return the exponentiation of *num* by *exp*, using the C :c:type:`Py_complex` representation.
fr: Renvoie *num* à la puissance *exp*, sous la forme d'un :c:type:`Py_complex` en C.

source: If *num* is null and *exp* is not a positive real number, this method returns zero and sets :c:data:`errno` to :c:data:`EDOM`.
fr: Si *num* est nul et *exp* n'est pas un nombre réel positif, cette méthode renvoie zéro et assigne :c:data:`EDOM` à :c:data:`errno`.

source: Complex Numbers as Python Objects
fr: Nombres complexes en tant qu'objets Python

source: This subtype of :c:type:`PyObject` represents a Python complex number object.
fr: Ce sous-type de l'objet :c:type:`PyObject` représente un nombre complexe en Python.

source: This instance of :c:type:`PyTypeObject` represents the Python complex number type. It is the same object as :class:`complex` in the Python layer.
fr: Cette instance de :c:type:`PyTypeObject` représente le type nombre complexe Python. C'est le même objet que la classe :class:`complex` de la couche Python.

source: Return true if its argument is a :c:type:`PyComplexObject` or a subtype of :c:type:`PyComplexObject`.
fr: Renvoie vrai si l'argument est de type :c:type:`PyComplexObject` ou un sous-type de :c:type:`PyComplexObject`.

source: Return true if its argument is a :c:type:`PyComplexObject`, but not a subtype of :c:type:`PyComplexObject`.
fr: Renvoie vrai si l'argument est de type :c:type:`PyComplexObject`, mais pas un sous-type de :c:type:`PyComplexObject`.

source: Create a new Python complex number object from a C :c:type:`Py_complex` value.
fr: Crée un nouveau nombre complexe à partir de la valeur d'un :c:type:`Py_complex` en C.

source: Return a new :c:type:`PyComplexObject` object from *real* and *imag*.
fr: Renvoie un nouveau :c:type:`PyComplexObject` à partir de *real* et de *imag*.

source: Return the real part of *op* as a C :c:type:`double`.
fr: Renvoie la partie réelle du nombre complexe *op* sous la forme d'un :c:type:`double` en C.

source: Return the imaginary part of *op* as a C :c:type:`double`.
fr: Renvoie la partie imaginaire du nombre complexe *op* sous la forme d'un :c:type:`double` en C.

source: Return the :c:type:`Py_complex` value of the complex number *op*.
fr: Renvoie la valeur du nombre complexe *op* sous la forme d'un :c:type:`Py_complex` en C.
