Repository: python/python-docs-fr
Catalog: c-api/concrete.po
Languages: fr

source: Concrete Objects Layer
fr: Couche des objets concrets

source: The functions in this chapter are specific to certain Python object types. Passing them an object of the wrong type is not a good idea; if you receive an object from a Python program and you are not sure that it has the right type, you must perform a type check first; for example, to check that an object is a dictionary, use :c:func:`PyDict_Check`. The chapter is structured like the "family tree" of Python object types.
fr: Les fonctions de ce chapitre sont spécifiques à certains types d'objets Python. Leur donner un objet du mauvais type n'est pas une bonne idée, si vous recevez un objet d'un programme Python, et que vous n'êtes pas sûr qu'il soit du bon type, vous devez vérifier son type en premier. Par exemple, pour vérifier qu'un objet est un dictionnaire, utilisez :c:func:`PyDict_Check`. Ce chapitre est organisé comme un arbre généalogique de types d'objets Python.

source: Fundamental Objects
fr: Objets fondamentaux

source: This section describes Python type objects and the singleton object ``None``.
fr: Cette section décrit les objets de type Python et l'objet singleton ``None``.

source: Numeric Objects
fr: Objets numériques

source: Sequence Objects
fr: Objets séquences

source: Generic operations on sequence objects were discussed in the previous chapter; this section deals with the specific kinds of sequence objects that are intrinsic to the Python language.
fr: Les opérations génériques sur les objets séquences ont été discutées dans le chapitre précédent. Cette section traite des genres spécifiques d'objets séquences qui sont intrinsèques au langage Python.

source: Container Objects
fr: Objets conteneurs

source: Function Objects
fr: Objets fonctions

source: Other Objects
fr: Autres objets
