Repository: python/python-docs-fr
Catalog: c-api/datetime.po
Languages: fr

source: DateTime Objects
fr: Objets DateTime

source: Various date and time objects are supplied by the :mod:`datetime` module. Before using any of these functions, the header file :file:`datetime.h` must be included in your source (note that this is not included by :file:`Python.h`), and the macro :c:macro:`PyDateTime_IMPORT` must be invoked, usually as part of the module initialisation function. The macro puts a pointer to a C structure into a static variable, :c:data:`PyDateTimeAPI`, that is used by the following macros.
fr: De nombreux objets *date* et *time* sont exposés par le module :mod:`DateTime`. Avant d'utiliser une de ces fonctions, le fichier d'en-tête :file:`datetime.h` doit être inclus dans vos sources (veuillez noter qu'il n'est pas inclus par le fichier :file:`Python.h`) et la macro :c:macro:`PyDateTime_IMPORT` doit être invoquée, généralement lors de la fonction d'initialisation du module. La macro crée un pointeur vers une structure C et place celui-ci dans une variable statique, :c:data:`PyDateTimeAPI`, qui est utilisée par les macros suivantes.

source: Macro for access to the UTC singleton:
fr: Macro pour accéder au singleton UTC :

source: Returns the time zone singleton representing UTC, the same object as :attr:`datetime.timezone.utc`.
fr: Renvoie le singleton du fuseau horaire UTC, qui est le même objet que :attr:`datetime.timezone.utc`.

source: Type-check macros:
fr: Macros pour vérifier les types :

source: Macros to create objects:
fr: Macros pour créer des objets :

source: Return a :class:`datetime.date` object with the specified year, month and day.
fr: Renvoie un objet :class:`datetime.date` avec l'année, le mois et le jour spécifiés.

source: Return a :class:`datetime.datetime` object with the specified year, month, day, hour, minute, second and microsecond.
fr: Renvoie un objet :class:`datetime.datetime` avec l'année, le mois, le jour, l'heure, la minute, la seconde et la microseconde spécifiés.

source: Return a :class:`datetime.datetime` object with the specified year, month, day, hour, minute, second, microsecond and fold.
fr: Renvoie un objet :class:`datetime.datetime` avec l'année, le mois, le jour, l'heure, la minute, la seconde, la microseconde et le pli (*fold* en anglais) spécifiés.

source: Return a :class:`datetime.time` object with the specified hour, minute, second and microsecond.
fr: Renvoie un objet :class:`datetime.time` avec l'heure, la minute, la seconde et la microseconde spécifiées.

source: Return a :class:`datetime.time` object with the specified hour, minute, second, microsecond and fold.
fr: Renvoie un objet :class:`datetime.time` avec l'heure, la minute, la seconde, la microseconde et le pli (*fold* en anglais) spécifiés.

source: Return a :class:`datetime.timedelta` object representing the given number of days, seconds and microseconds. Normalization is performed so that the resulting number of microseconds and seconds lie in the ranges documented for :class:`datetime.timedelta` objects.
fr: Renvoie un objet :class:`datetime.timedelta` représentant le nombre passé en paramètre de jours, de secondes et de microsecondes. Le résultat est normalisé pour que le nombre de microsecondes et de secondes tombe dans la plage documentée pour les objets :class:`datetime.timedelta`.

source: Return a :class:`datetime.timezone` object with an unnamed fixed offset represented by the *offset* argument.
fr: Renvoie un objet :class:`datetime.timezone` avec un décalage anonyme fixe représenté par l'argument *offset*.

source: Return a :class:`datetime.timezone` object with a fixed offset represented by the *offset* argument and with tzname *name*.
fr: Renvoie un objet :class:`datetime.timezone` avec un décalage fixe représenté par l'argument *offset* et avec le nom de fuseau horaire *name*.

source: Return the year, as a positive int.
fr: Renvoie l'année, sous forme d'entier positif.

source: Return the month, as an int from 1 through 12.
fr: Renvoie le mois, sous forme d'entier allant de 1 à 12.

source: Return the day, as an int from 1 through 31.
fr: Renvoie le jour, sous forme d'entier allant de 1 à 31.

source: Return the hour, as an int from 0 through 23.
fr: Renvoie l'heure, sous forme d'entier allant de 0 à 23.

source: Return the minute, as an int from 0 through 59.
fr: Renvoie la minute, sous forme d'entier allant de 0 à 59.

source: Return the second, as an int from 0 through 59.
fr: Renvoie la seconde, sous forme d'entier allant de 0 à 59.

source: Return the microsecond, as an int from 0 through 999999.
fr: Renvoie la microseconde, sous forme d'entier allant de 0 à 999999.

source: Return the number of days, as an int from -999999999 to 999999999.
fr: Renvoie le nombre de jours, sous forme d'entier allant de ``-999999999`` à ``999999999``.

source: Return the number of seconds, as an int from 0 through 86399.
fr: Renvoie le nombre de secondes sous forme d'entier allant de 0 à 86399.

source: Return the number of microseconds, as an int from 0 through 999999.
fr: Renvoie le nombre de microsecondes, sous forme d'entier allant de 0 à 999999.

source: Macros for the convenience of modules implementing the DB API:
fr: Macros de confort pour les modules implémentant l'API DB :

source: Create and return a new :class:`datetime.datetime` object given an argument tuple suitable for passing to :meth:`datetime.datetime.fromtimestamp()`.
fr: Crée et renvoie un nouvel objet :class:`datetime.datetime` à partir d'un n-uplet qui peut être passé à :meth:`datetime.datetime.fromtimestamp()`.

source: Create and return a new :class:`datetime.date` object given an argument tuple suitable for passing to :meth:`datetime.date.fromtimestamp()`.
fr: Crée et renvoie un nouvel objet :class:`datetime.date` à partir d'un *n*-uplet qui peut être passé à :meth:`datetime.date.fromtimestamp()`.
