Repository: python/python-docs-fr
Catalog: c-api/float.po
Languages: fr

source: Floating Point Objects
fr: Objets Nombres à Virgule Flottante

source: This subtype of :c:type:`PyObject` represents a Python floating point object.
fr: Ce sous-type de l'objet :c:type:`PyObject` représente un objet d'un nombre à virgule flottante en Python

source: This instance of :c:type:`PyTypeObject` represents the Python floating point type. This is the same object as :class:`float` in the Python layer.
fr: Cette instance de l'objet :c:type:`PyTypeObject représente le type nombre à virgule flottante en Python. C'est le même objet que la class :class:`float` de la couche Python.

source: Return true if its argument is a :c:type:`PyFloatObject` or a subtype of :c:type:`PyFloatObject`.
fr: Renvoie vrai dans le cas ou l'argument est de type :c:type:`PyFloatObject` ou un sous-type de :c:type:`PyFloatObject`.

source: Return true if its argument is a :c:type:`PyFloatObject`, but not a subtype of :c:type:`PyFloatObject`.
fr: Renvoie vrai dans le cas ou l'argument est de type :c:type:`PyFloatObject`, mais pas un sous-type de :c:type:`PyFloatObject`.

source: Create a :c:type:`PyFloatObject` object based on the string value in *str*, or *NULL* on failure.
fr: Créer un objet :c:type:PyFloatObject à partir de la valeur de la chaine de charactères *str*, ou *NULL* en cas d'échec.

source: Create a :c:type:`PyFloatObject` object from *v*, or *NULL* on failure.
fr: Créer un objet :c:type:`PyFloatObject` à partir de *v*, ou *NULL* en cas d'échec.

source: Return a C :c:type:`double` representation of the contents of *pyfloat*. If *pyfloat* is not a Python floating point object but has a :meth:`__float__` method, this method will first be called to convert *pyfloat* into a float. This method returns ``-1.0`` upon failure, so one should call :c:func:`PyErr_Occurred` to check for errors.
fr: Renvoie une représentation du contenu d'un *pyfloat* sous la forme d'un :c:type:`double` en C. Si le *pyfloat* n'est pas un nombre à virgule flottante mais contient une méthode :meth:`__float__`, elle sera d'abbord appelée pour convertir le *pyfloat* en nombre à virgule flottante. Cette méthode renvoie ``-1.0`` en cas d'échec, il faut appeler :c:func:`PyErr_Occurred` pour vérifier les erreurs.

source: Return a C :c:type:`double` representation of the contents of *pyfloat*, but without error checking.
fr: Renvoie une représentation du contenu d'un *pyfloat* sous la forme d'un :c:type:`double` en C, sans vérifier les erreurs.

source: Return a structseq instance which contains information about the precision, minimum and maximum values of a float. It's a thin wrapper around the header file :file:`float.h`.
fr: Renvoie une instance *structseq* qui contient les informations de la précision minimale et maximale pour un nombre à virgule flottante. C'est une enveloppe autour du fichier d'entête :file:`float.h`.

source: Return the maximum representable finite float *DBL_MAX* as C :c:type:`double`.
fr: Renvoie la representation finie maximale du nombre à virgule flottante *DBL_MAX* sous la forme d'un :c:type:`double` en C.

source: Return the minimum normalized positive float *DBL_MIN* as C :c:type:`double`.
fr: Renvoie la représentation normalizée minimale du nombre à virgule flottante *DBL_MIN* sous la forme :c:type:`double` en C.

source: Clear the float free list. Return the number of items that could not be freed.
fr: Libère la mémoire de la *free list* des nombres à virgule flottante. Renvoie le nombre d'éléments dont la mémoire n'a pas pas pu être libérée.
