Repository: python/python-docs-fr
Catalog: c-api/frame.po
Languages: fr

source: Frame Objects
fr: Objets décrivant les *frames*

source: The C structure of the objects used to describe frame objects.
fr: Structure des objets C utilisée pour décrire les objets *frame*.

source: There are no public members in this structure.
fr: Il n'y a pas de membres publics dans cette structure.

source: The members of this structure were removed from the public C API. Refer to the :ref:`What's New entry <pyframeobject-3.11-hiding>` for details.
fr: Les membres de la structure API publique ont été retirés de l'API publique de C. Visiter :ref:`l'entrée dans la page des nouveautés de Python <pyframeobject-3.11-hiding>` pour plus détails.

source: The :c:func:`PyEval_GetFrame` and :c:func:`PyThreadState_GetFrame` functions can be used to get a frame object.
fr: Les fonctions :func:`PyEval_GetFrame` et :c:func:`PyThreadState_GetFrame` peuvent être utilisées pour avoir un objet de *frame*.

source: See also :ref:`Reflection <reflection>`.
fr: Voir aussi :ref:`reflection`

source: The type of frame objects. It is the same object as :py:class:`types.FrameType` in the Python layer.
fr: Le type des objets de *frame*. C'est le même objet que :py:class:`types.FrameType` dans la couche de Python.

source: Previously, this type was only available after including ``<frameobject.h>``.
fr: Précédemment, ce type était disponible uniquement après l'inclusion de ``<frameobject.h>``.

source: Return non-zero if *obj* is a frame object.
fr: Renvoie un entier non nul si *obj* est un objet *frame*.

source: Previously, this function was only available after including ``<frameobject.h>``.
fr: Précédemment, ce type était disponible uniquement après l'inclusion de ``<frameobject.h>``.

source: Get the *frame* next outer frame.
fr: Renvoie la *frame* encadrant immédiatement à *frame*.

source: Return a :term:`strong reference`, or ``NULL`` if *frame* has no outer frame.
fr: Renvoie un :term:`strong reference`, ou ``NULL`` si *frame* n'a pas de *frame* encadrante.

source: Get the *frame*'s ``f_builtins`` attribute.
fr: Obtenir l'attribut ``f_buitins`` de *frame*.

source: Return a :term:`strong reference`. The result cannot be ``NULL``.
fr: Renvoie un :term:`strong reference`. Le résultat ne peut être ``NULL``.

source: Get the *frame* code.
fr: Obtenir le code *frame*.

source: Return a :term:`strong reference`.
fr: Renvoie un :term:`strong reference`.

source: The result (frame code) cannot be ``NULL``.
fr: Le résultat (code *frame*) ne peut être ``NULL``.

source: Get the generator, coroutine, or async generator that owns this frame, or ``NULL`` if this frame is not owned by a generator. Does not raise an exception, even if the return value is ``NULL``.
fr: Obtenir le générateur, coroutine, ou un générateur asynchrone qui maintient cette *frame*, ou ``NULL`` si cette *frame* n'est pas maintenu par un générateur. Il ne lève pas d'exception, même si la valeur renvoyée est ``NULL``.

source: Return a :term:`strong reference`, or ``NULL``.
fr: Renvoie un :term:`strong reference`, ou ``NULL``.

source: Get the *frame*'s ``f_globals`` attribute.
fr: Obtenir l'attribut ``f_globals`` de *frame*.

source: Get the *frame*'s ``f_lasti`` attribute.
fr: Obtenir l'attribut ``f_lasti`` de *frame*.

source: Returns -1 if ``frame.f_lasti`` is ``None``.
fr: Renvoie -1 si ``frame.f_lasti`` est ``None``.

source: Get the *frame*'s ``f_locals`` attribute (:class:`dict`).
fr: Obtenir l'attribut (:class:`dict`) ``f_locals`` de *frame*.

source: Return the line number that *frame* is currently executing.
fr: Renvoie le numéro de ligne que cette *frame* est en train d'exécuter.
