Repository: python/python-docs-fr
Catalog: c-api/function.po
Languages: fr

source: Function Objects
fr: Objets fonction

source: There are a few functions specific to Python functions.
fr: Certaines fonctions sont spécifiques aux fonctions Python.

source: The C structure used for functions.
fr: La structure C utilisée pour les fonctions.

source: This is an instance of :c:type:`PyTypeObject` and represents the Python function type. It is exposed to Python programmers as ``types.FunctionType``.
fr: C'est une instance de :c:type:`PyTypeObject` et représente le type fonction en Python. Il est exposé aux développeurs comme ``types.FunctionType``.

source: Return true if *o* is a function object (has type :c:data:`PyFunction_Type`). The parameter must not be ``NULL``. This function always succeeds.
fr: Renvoie vrai si *o* est un objet de type fonction (a comme type :c:data:`PyFunction_Type`). Le paramètre ne doit pas être ``NULL``. Cette fonction réussit toujours.

source: Return a new function object associated with the code object *code*. *globals* must be a dictionary with the global variables accessible to the function.
fr: Renvoie une nouvelle fonction associée avec l'objet *code*. *globals* doit être un dictionnaire avec les variables globales accessibles à la fonction.

source: The function's docstring and name are retrieved from the code object. *__module__* is retrieved from *globals*. The argument defaults, annotations and closure are set to ``NULL``. *__qualname__* is set to the same value as the code object's ``co_qualname`` field.
fr: La *docstring* et le nom de la fonction sont récupérés à partir de l'objet code. *__module__* est récupéré à partir de *globals*. Les arguments par défaut, les annotations et la fermeture sont mis à ``NULL``. *__qualname__* est mis à la même valeur que celle du champ ``co_qualname`` de l'objet code.

source: As :c:func:`PyFunction_New`, but also allows setting the function object's ``__qualname__`` attribute. *qualname* should be a unicode object or ``NULL``; if ``NULL``, the ``__qualname__`` attribute is set to the same value as the code object's ``co_qualname`` field.
fr: Comme :c:func:`PyFunction_New`, mais accepte aussi une valeur à utiliser pour l'attribut ``__qualname__`` de l'objet fonction. *qualname* doit être un objet Unicode ou ``NULL``; s'il est ``NULL``, l'attribut ``__qualname__`` de l'objet fonction prend la valeur de l'attribut ``co_qualname`` de l'objet code.

source: Return the code object associated with the function object *op*.
fr: Renvoie l'objet code associé avec l'objet de la fonction *op*.

source: Return the globals dictionary associated with the function object *op*.
fr: Renvoie le dictionnaire global associé avec l'objet de la fonction *op*.

source: Return a :term:`borrowed reference` to the *__module__* attribute of the function object *op*. It can be *NULL*.
fr: Renvoie un :term:`borrowed reference` à l'attribut ``__module__`` de l'objet fonction *op*. Il peut être *NULL*.

source: This is normally a string containing the module name, but can be set to any other object by Python code.
fr: C'est typiquement une chaîne de caractère contenant le nom du module, mais il peut être changé par du code Python pour n'importe quel autre objet.

source: Return the argument default values of the function object *op*. This can be a tuple of arguments or ``NULL``.
fr: Renvoie les valeurs par défaut de l'argument de l'objet de la fonction *op*. Cela peut être un tuple d'arguments ou ``NULL``.

source: Set the argument default values for the function object *op*. *defaults* must be ``Py_None`` or a tuple.
fr: Définir les valeurs par défaut de l'argument pour l'objet de la fonction *op*. *defaults* doit être ``Py_None`` ou un tuple.

source: Raises :exc:`SystemError` and returns ``-1`` on failure.
fr: Lève :exc:`SystemError` et renvoie ``-1`` en cas de d'échec.

source: Return the closure associated with the function object *op*. This can be ``NULL`` or a tuple of cell objects.
fr: Renvoie la fermeture associée avec l'objet de la fonction *op*. Cela peut être ``NULL`` ou un tuple d'objets cellule.

source: Set the closure associated with the function object *op*. *closure* must be ``Py_None`` or a tuple of cell objects.
fr: Définir la fermeture associée avec l'objet de la fonction *op*. *closure* doit être ``Py_None`` ou un tuple d'objets cellule.

source: Return the annotations of the function object *op*. This can be a mutable dictionary or ``NULL``.
fr: Renvoie les annotations de l'objet de la fonction *op*. Cela peut être un dictionnaire mutable ou ``NULL``.

source: Set the annotations for the function object *op*. *annotations* must be a dictionary or ``Py_None``.
fr: Définir les annotations pour l'objet de la fonction *op*. *annotations* doit être un dictionnaire ou ``Py_None``.
