Repository: python/python-docs-fr
Catalog: c-api/mapping.po
Languages: fr

source: Mapping Protocol
fr: Protocole de correspondance

source: See also :c:func:`PyObject_GetItem`, :c:func:`PyObject_SetItem` and :c:func:`PyObject_DelItem`.
fr: Voir aussi :c:func:`PyObject_GetItem`, :c:func:`PyObject_SetItem` et :c:func:`PyObject_DelItem`.

source: Return ``1`` if the object provides mapping protocol or supports slicing, and ``0`` otherwise. Note that it returns ``1`` for Python classes with a :meth:`__getitem__` method since in general case it is impossible to determine what the type of keys it supports. This function always succeeds.
fr: Renvoie ``1`` si l'objet prend en charge le protocole de correspondance ou l'indexation et ``0`` sinon. Notez qu'elle renvoie ``1`` pour les classes Python avec un méthode :meth:`__getitem__` puisque, dans le cas général, il est impossible de déterminer quel type de clef est pris en charge. Cette fonction ne provoque jamais d'erreur.

source: Returns the number of keys in object *o* on success, and ``-1`` on failure. This is equivalent to the Python expression ``len(o)``.
fr: Renvoie le nombre de clefs dans l'objet *o* et ``-1`` en cas d'échec. C'est l'équivalent de l'expression Python ``len(o)``.

source: Return element of *o* corresponding to the string *key* or *NULL* on failure. This is the equivalent of the Python expression ``o[key]``. See also :c:func:`PyObject_GetItem`.
fr: Renvoie les éléments de *o* qui correspondent à la chaîne *key* ou *NULL* en cas d'échec. C'est l'équivalent de l'expression Python ``o[key]``. Voir aussi :c:func:`PyObject_GetItem`.

source: Map the string *key* to the value *v* in object *o*. Returns ``-1`` on failure. This is the equivalent of the Python statement ``o[key] = v``. See also :c:func:`PyObject_SetItem`.
fr: Fait correspondre la chaîne *key* à la valeur *v* dans l'objet *o*. Renvoie ``-1`` en cas d'échec. C'est l'équivalent de la commande Python ``o[key] = v``. Voir aussi :c:func:`PyObject_SetItem`.

source: Remove the mapping for the object *key* from the object *o*. Return ``-1`` on failure. This is equivalent to the Python statement ``del o[key]``. This is an alias of :c:func:`PyObject_DelItem`.
fr: Supprime la correspondance associée à l'objet *key* dans l'objet *o*. Renvoie ``-1`` en cas d'échec. C'est l'équivalent de la commande Python ``del o[key]``. C'est un alias pour :c:func:`PyObject_DelItem`.

source: Remove the mapping for the string *key* from the object *o*. Return ``-1`` on failure. This is equivalent to the Python statement ``del o[key]``.
fr: Supprime la correspondance associée à la chaîne *key* dans l'objet *o*. Renvoie ``-1`` en cas d'échec. C'est l'équivalent de la commande Python ``del o[key]``.

source: Return ``1`` if the mapping object has the key *key* and ``0`` otherwise. This is equivalent to the Python expression ``key in o``. This function always succeeds.
fr: Renvoie ``1`` si l'objet de correspondance possède une clef *key*, ``0`` sinon. C'est l'équivalent de l'expression Python ``key in o``. Cette fonction ne provoque jamais d'erreur.

source: Note that exceptions which occur while calling the :meth:`__getitem__` method will get suppressed. To get error reporting use :c:func:`PyObject_GetItem()` instead.
fr: Notez que les exceptions qui surviennent pendant l'appel de la méthode :meth:`__getitem__` seront supprimées. Pour obtenir le rapport d'erreur, utilisez plutôt :c:func:`PyObject_GetItem()`.

source: Note that exceptions which occur while calling the :meth:`__getitem__` method and creating a temporary string object will get suppressed. To get error reporting use :c:func:`PyMapping_GetItemString()` instead.
fr: Notez que les exceptions qui surviennent en créant une chaîne de caractères temporaire pendant l'appel de la méthode :meth:`__getitem__`seront supprimées. Pour obtenir le rapport d'erreur, utilisez plutôt :c:func:`PyMapping_GetItemString()`.

source: On success, return a list of the keys in object *o*. On failure, return *NULL*.
fr: Renvoie la liste des clefs dans l'objet *o*. En cas d'échec, renvoie *NULL*.

source: Previously, the function returned a list or a tuple.
fr: Auparavant, la fonction renvoyait une liste ou un n-uplet.

source: On success, return a list of the values in object *o*. On failure, return *NULL*.
fr: Renvoie la liste des valeurs dans l'objet *o*. En cas d'échec, renvoie *NULL*.

source: On success, return a list of the items in object *o*, where each item is a tuple containing a key-value pair. On failure, return *NULL*.
fr: Renvoie la liste des éléments dans l'objet *o*, où chaque élément est un n-uplet contenant une paire clef-valeur. En cas d'échec, renvoie *NULL*.
