Repository: python/python-docs-fr
Catalog: c-api/refcounting.po
Languages: fr

source: The macros in this section are used for managing reference counts of Python objects.
fr: Les macros dans cette section permettent de gérer le compteur de références des objets Python.

source: Increment the reference count for object *o*.
fr: Incrémente le compteur de références de l'object *o*.

source: This function is usually used to convert a :term:`borrowed reference` to a :term:`strong reference` in-place. The :c:func:`Py_NewRef` function can be used to create a new :term:`strong reference`.
fr: Cette fonction est souvent utilisée pour convertir une :term:`référence empruntée` en une :term:`référence forte` *sur place*. La fonction :c:func:`Py_NewRef` peut être utilisée pour créer une nouvelle :term:`référence forte`.

source: The object must not be ``NULL``; if you aren't sure that it isn't ``NULL``, use :c:func:`Py_XINCREF`.
fr: L'object ne doit pas être ``NULL``, la fonction :c:func:`Py_XINCREF` doit être utilisée s'il est possible qu'il soit ``NULL``.

source: Increment the reference count for object *o*. The object may be ``NULL``, in which case the macro has no effect.
fr: Incrémente le compteur de références de l'objet *o*. La macro n'a pas d'effet si l'objet est ``NULL``.

source: See also :c:func:`Py_XNewRef`.
fr: Voir aussi :c:func:`Py_XNewRef`.

source: Create a new :term:`strong reference` to an object: increment the reference count of the object *o* and return the object *o*.
fr: Créer une nouvelle :term:`référence forte` d'un objet : incrémente le compteur de référence de l'objet *o* and renvoie l'objet *o*.

source: When the :term:`strong reference` is no longer needed, :c:func:`Py_DECREF` should be called on it to decrement the object reference count.
fr: :c:func:`Py_DECREF` doit être appelée quand la :term:`référence forte` n'est plus utilisée pour décrémenter le compteur de références de l'objet.

source: The object *o* must not be ``NULL``; use :c:func:`Py_XNewRef` if *o* can be ``NULL``.
fr: L'objet *o* ne doit pas être ``NULL`` et la fonction :c:func:`Py_XNewRef` doit être utilisée si *o* peut être ``NULL``.

source: For example::
fr: Par exemple ::

source: can be written as::
fr: peut être écrit ::

source: See also :c:func:`Py_INCREF`.
fr: Voir aussi :c:func:`Py_INCREF`.

source: Similar to :c:func:`Py_NewRef`, but the object *o* can be NULL.
fr: Semblable à :c:func:`Py_NewRef` mais l'objet *o* peut être ``NULL``.

source: If the object *o* is ``NULL``, the function just returns ``NULL``.
fr: Cette fonction renvoie ``NULL`` si l'objet *o* est ``NULL``.

source: Decrement the reference count for object *o*.
fr: Décrémente le compteur de références de l'objet *o*.

source: If the reference count reaches zero, the object's type's deallocation function (which must not be ``NULL``) is invoked.
fr: Si le compteur de références atteint zéro, la fonction de dés-allocation du type de l'objet (qui ne doit pas être ``NULL``) est invoquée.

source: This function is usually used to delete a :term:`strong reference` before exiting its scope.
fr: Cette fonction est généralement utilisée pour supprimer une :term:`référence forte` avant qu'elle ne soit plus accessible.

source: The object must not be ``NULL``; if you aren't sure that it isn't ``NULL``, use :c:func:`Py_XDECREF`.
fr: L'objet en argument ne doit pas être ``NULL``. :c:func:`Py_XDECREF` doit être utilisée si l'objet peut être ``NULL``.

source: The deallocation function can cause arbitrary Python code to be invoked (e.g. when a class instance with a :meth:`__del__` method is deallocated). While exceptions in such code are not propagated, the executed code has free access to all Python global variables. This means that any object that is reachable from a global variable should be in a consistent state before :c:func:`Py_DECREF` is invoked. For example, code to delete an object from a list should copy a reference to the deleted object in a temporary variable, update the list data structure, and then call :c:func:`Py_DECREF` for the temporary variable.
fr: La fonction de dés-allocation peut invoquer du code Python arbitraire (par exemple quand une instance d'une classe avec une méthode :meth:`__del__` est supprimée). Le code exécuté a accès à toutes les variables Python globales mais les exceptions lors de l'exécution de ce code ne sont pas propagées. Tous les objets qui peuvent être atteints à partir d'une variable globale doivent être dans un état cohérent avant d'appeler :c:func:`Py_DECREF`. Par exemple le code pour supprimer un élément d'une liste doit copier une référence à l'objet dans une variable temporaire, mettre à jour la liste, et enfin appeler :c:func:`Py_DECREF` avec la variable temporaire.

source: Decrement the reference count for object *o*. The object may be ``NULL``, in which case the macro has no effect; otherwise the effect is the same as for :c:func:`Py_DECREF`, and the same warning applies.
fr: Décrémente le compteur de références de l'objet *o*. L'objet peut être ``NULL``, dans ce cas la macro n'a pas d'effet. Dans le cas contraire le comportement est identique à :c:func:`Py_DECREF` et les mêmes avertissements sont de rigueur.

source: Decrement the reference count for object *o*. The object may be ``NULL``, in which case the macro has no effect; otherwise the effect is the same as for :c:func:`Py_DECREF`, except that the argument is also set to ``NULL``. The warning for :c:func:`Py_DECREF` does not apply with respect to the object passed because the macro carefully uses a temporary variable and sets the argument to ``NULL`` before decrementing its reference count.
fr: Décrémente le competeur de références de l'objet *o*. L'objet peut être ``NULL``, dans ce cas la macro n'a pas d'effet. Dans le cas contraire le comportement est identique à :c:func:`Py_DECREF`, puis l'argument est mis à ``NULL``. L'avertissement au sujet de l'objet passé en argument à :c:func:`Py_DECREF` ne s'applique pas car la macro utilise une variable temporaire et met l'objet à ``NULL`` avant de décrémenter le compteur de références.

source: It is a good idea to use this macro whenever decrementing the reference count of an object that might be traversed during garbage collection.
fr: Il est recommandé d'utiliser cette macro lorsqu'on décrémente le compteur de référence d'un objet qui peut être parcouru par le ramasse-miette.

source: Increment the reference count for object *o*. A function version of :c:func:`Py_XINCREF`. It can be used for runtime dynamic embedding of Python.
fr: Incrémente le compteur de références de l'objet *o*. C'est la version fonctionnelle de :c:func:`Py_XINCREF`. Elle peut être utilisé lorsque Python est embarqué dynamiquement dans une application.

source: Decrement the reference count for object *o*. A function version of :c:func:`Py_XDECREF`. It can be used for runtime dynamic embedding of Python.
fr: Décrémente le compteur de références de l'objet *o*. C'est la version fonctionnelle de :c:func:`Py_XDECREF`. Elle peut être utilisée lorsque Python est embarqué dynamiquement dans une application.

source: The following functions or macros are only for use within the interpreter core: :c:func:`_Py_Dealloc`, :c:func:`_Py_ForgetReference`, :c:func:`_Py_NewReference`, as well as the global variable :c:data:`_Py_RefTotal`.
fr: Les fonctions ou macros suivantes doivent être uniquement utilisées au sein de l'interpréteur et ne font pas partie de l'API publique : :c:func:`_Py_Dealloc`, :c:func:`_Py_ForgetReference`, :c:func:`_Py_NewReference`, ainsi que la variable globale :c:data:`_Py_RefTotal`.
