Repository: python/python-docs-fr
Catalog: c-api/weakref.po
Languages: fr

source: Weak Reference Objects
fr: Objets à références faibles

source: Python supports *weak references* as first-class objects. There are two specific object types which directly implement weak references. The first is a simple reference object, and the second acts as a proxy for the original object as much as it can.
fr: Python gère les *références faibles* comme des objets de première classe. Il existe deux types d'objets spécifiques qui implémentent directement les références faibles. Le premier est un objet de référence simple, et le second agit autant que possible comme un mandataire vers l'objet original.

source: Return true if *ob* is either a reference or proxy object.
fr: Renvoie vrai si *ob* est soit une référence, soit un objet proxy.

source: Return true if *ob* is a reference object.
fr: Retourne vrai si *ob* est un objet référence.

source: Return true if *ob* is a proxy object.
fr: Retourne vrai si *ob* est un objet proxy

source: Return a weak reference object for the object *ob*. This will always return a new reference, but is not guaranteed to create a new object; an existing reference object may be returned. The second parameter, *callback*, can be a callable object that receives notification when *ob* is garbage collected; it should accept a single parameter, which will be the weak reference object itself. *callback* may also be ``None`` or *NULL*. If *ob* is not a weakly-referencable object, or if *callback* is not callable, ``None``, or *NULL*, this will return *NULL* and raise :exc:`TypeError`.
fr: Retourne un objet de référence faible pour l'objet *ob*. Elle renvoie toujours une nouvelle référence, mais cela ne signifie pas qu'un nouvel objet est créé ; un objet référence existant peut être renvoyé. Le second paramètre, *callback*, peut être un objet appelable qui reçoit une notification lorsque *ob* est collecté par le ramasse-miette (*garbage collected* en anglais) ; il doit accepter un paramètre unique, qui est l'objet référence faible lui-même. *callback* peut aussi être positionné à ``None`` ou à *NULL*. Si *ob* n'est pas un objet faiblement référençable, ou si *callback* n'est pas appelable, ``None``` ou *NULL*, ceci retourne *NULL* et lève une :exc:`TypeError`.

source: Return a weak reference proxy object for the object *ob*. This will always return a new reference, but is not guaranteed to create a new object; an existing proxy object may be returned. The second parameter, *callback*, can be a callable object that receives notification when *ob* is garbage collected; it should accept a single parameter, which will be the weak reference object itself. *callback* may also be ``None`` or *NULL*. If *ob* is not a weakly-referencable object, or if *callback* is not callable, ``None``, or *NULL*, this will return *NULL* and raise :exc:`TypeError`.
fr: Retourne un objet mandataire à référence faible pour l'objet *ob*. Ceci renvoie toujours une nouvelle référence, mais ne garantit pas la création d'un nouvel objet ; un objet proxy existant peut être retourné. Le second paramètre, *callback*, peut être un objet appelable qui reçoit une notification lorsque *ob* est collecté ; il doit accepter un seul paramètre, qui sera l'objet de référence faible lui-même. *callback* peut aussi être ``None`` ou *NULLL*. Si *ob* n'est pas un objet faiblement référençable, ou si *callback* n'est pas appelable, ``None``` ou *NULL*, ceci renvoie *NULL* et lève une :exc:`TypeError`.

source: Return the referenced object from a weak reference, *ref*. If the referent is no longer live, returns :const:`Py_None`.
fr: Retourne l'objet référencé à partir d'une référence faible, *ref*. Si le référence n'existe plus, alors l'objet renvoie :const:`Py_None`.

source: This function returns a **borrowed reference** to the referenced object. This means that you should always call :c:func:`Py_INCREF` on the object except if you know that it cannot be destroyed while you are still using it.
fr: Cette fonction renvoie une **référence empruntée** à l'objet référencé. Cela signifie que vous devez toujours appeler :c:func:`Py_INCREF` sur l'objet sauf si vous savez qu'il ne peut pas être détruit tant que vous l'utilisez encore.

source: Similar to :c:func:`PyWeakref_GetObject`, but implemented as a macro that does no error checking.
fr: Similaire à :c:func:`PyWeakref_GetObject`, mais implémenté comme une macro qui ne vérifie pas les erreurs.
