Repository: python/python-docs-fr
Catalog: installing/index.po
Languages: fr

source: Installing Python Modules
fr: L'installation de modules Python

source: As a popular open source development project, Python has an active supporting community of contributors and users that also make their software available for other Python developers to use under open source license terms.
fr: En temps que logiciel libre populaire, Python bénéficie d'une communauté active de contributeurs et d'utilisateurs qui rendent à leur tour leurs logiciels disponibles, sous licence libre, pour les autres développeurs Python.

source: This allows Python users to share and collaborate effectively, benefiting from the solutions others have already created to common (and sometimes even rare!) problems, as well as potentially contributing their own solutions to the common pool.
fr: Cela permet aux utilisateurs de Python de partager et de collaborer efficacement, bénéficiant des solutions que les autres ont déjà crées pour résoudre les problèmes communs (ou même, parfois, rares !), aussi que de partager leurs propres solutions à tous.

source: This guide covers the installation part of the process. For a guide to creating and sharing your own Python projects, refer to the :ref:`distribution guide <distributing-index>`.
fr: Ce guide couvre la partie installation. Pour un guide sur la création et le partage de vos propres projets Python, voyez :ref:`le guide de distribution <distributing-index>`.

source: For corporate and other institutional users, be aware that many organisations have their own policies around using and contributing to open source software. Please take such policies into account when making use of the distribution and installation tools provided with Python.
fr: Pour les entreprises et autres institutions, gardez en tête que certaines organisations ont leur propres règles sur l'utilisation et la contribution au logiciel libre. Prennez ces règles en compte lorsque vous utilisez les outils de distribution et d'installation fournis par Python.

source: Key terms
fr: Vocabulaire

source: ``pip`` is the preferred installer program. Starting with Python 3.4, it is included by default with the Python binary installers.
fr: ``pip`` est l'outil d'installation de prédilection. À partir de Python 3.4, il est inclus par défaut avec l'installateur de Python.

source: A *virtual environment* is a semi-isolated Python environment that allows packages to be installed for use by a particular application, rather than being installed system wide.
fr: Un *environnement virtuel* est un environnement Python semi-isolé qui autorise les paquets à être installés pour une application particulière, plutôt que d'être installés au niveau du système.

source: ``venv`` is the standard tool for creating virtual environments, and has been part of Python since Python 3.3. Starting with Python 3.4, it defaults to installing ``pip`` into all created virtual environments.
fr: ``venv`` est l'outil standard pour créer des environnements virtuels, et est intégré à Python depuis la version 3.3. Depuis Python 3.4, il installe aussi ``pip`` dans tous les environnements virtuels créés.

source: ``virtualenv`` is a third party alternative (and predecessor) to ``venv``. It allows virtual environments to be used on versions of Python prior to 3.4, which either don't provide ``venv`` at all, or aren't able to automatically install ``pip`` into created environments.
fr: ``virtualenv`` est une alternative tierce à ``venv`` (et son prédécesseur). Elle permet la création d'environnements virtuels pour les versions de Python antérieures à 3.4, qui ne fournissent pas de ``venv``, ou ne sont pas capables d'installer automatiquement ``pip`` dans les environnements créés.

source: The `Python Packaging Index <https://pypi.python.org/pypi>`__ is a public repository of open source licensed packages made available for use by other Python users.
fr: L'`Index des Paquets Python <https://pypi.python.org/pypi>`__ est un dépôt public des paquets sous licence ouverte disponibles pour tous les utilisateurs Python.

source: the `Python Packaging Authority <https://www.pypa.io/en/latest/>`__ are the group of developers and documentation authors responsible for the maintenance and evolution of the standard packaging tools and the associated metadata and file format standards. They maintain a variety of tools, documentation, and issue trackers on both `GitHub <https://github.com/pypa>`__ and `BitBucket <https://bitbucket.org/pypa/>`__.
fr: l'`Autorité des Paquets Python <https://www.pypa.io/en/latest/>`__ est le groupe de développeurs et d'auteurs de documentation responsable de la maintenance et l'évolution des outils d'empaquetage standards et des métadonnées associées, ainsi que des standards sur les formats de fichiers. Ils maintiennent une multitude d'outils, documentations, et des systèmes de tickets sur `GitHub <https://github.com/pypa>`__ et `BitBucket <https://bitbucket.org/pypa/>`__.

source: ``distutils`` is the original build and distribution system first added to the Python standard library in 1998. While direct use of ``distutils`` is being phased out, it still laid the foundation for the current packaging and distribution infrastructure, and it not only remains part of the standard library, but its name lives on in other ways (such as the name of the mailing list used to coordinate Python packaging standards development).
fr: ``distutils`` est le premier système de construction et de distribution ajouté à la bibliothèque standard en 1998. Bien que l'utilisation directe de ``distutils`` soit progressivement supprimée, elle reste le fondement de l'infrastructure actuelle de construction de paquet et de distribution. Au delà de rester dans la bibliothèque standard, son nom vit aussi sous d'autres formes, tel que la liste de diffusion utilisée pour coordonner le développement et les standards de la création de paquet.

source: ``pyvenv`` was the recommended tool for creating virtual environments for Python 3.3 and 3.4, and is `deprecated in Python 3.6 <https://docs.python.org/dev/whatsnew/3.6.html#deprecated-features>`_.
fr: ``pyvenv`` était l'outil recommandé pour créer des environnements sous Python 3.3 et 3.4, et est `déprécié depuis Python 3.6 <https://docs.python.org/dev/whatsnew/3.6.html#deprecated-features>`_.

source: The use of ``venv`` is now recommended for creating virtual environments.
fr: L'utilisation de ``venv`` est maintenant recommandée pour créer vos environnements virtuels.

source: `Python Packaging User Guide: Creating and using virtual environments <https://packaging.python.org/installing/#creating-virtual-environments>`__
fr: `Guide Utilisateur de l'Empaquetage Python : Créer et utiliser des environnements virtuels <https://packaging.python.org/installing/#creating-virtual-environments>`__

source: Basic usage
fr: Utilisation de base

source: The standard packaging tools are all designed to be used from the command line.
fr: Les outils standards de création de paquets sont tous conçus pour être utilisés à partir de la ligne de commande.

source: The following command will install the latest version of a module and its dependencies from the Python Packaging Index::
fr: La commande suivante va installer la dernière version d'un module et ses dépendances depuis le *Python Package Index* ::

source: For POSIX users (including Mac OS X and Linux users), the examples in this guide assume the use of a :term:`virtual environment`.
fr: Pour les utilisateurs POSIX (y compris Mac OS X et Linux), les exemples de ce guide supposent l'utilisation d'un :term:`environnement virtuel`.

source: For Windows users, the examples in this guide assume that the option to adjust the system PATH environment variable was selected when installing Python.
fr: Pour les utilisateurs de Windows, les exemples de ce quide supposent que l'option proposant de modifier la variable d'environnement PATH à été cochée lors de l'installation de Python.

source: It's also possible to specify an exact or minimum version directly on the command line. When using comparator operators such as ``>``, ``<`` or some other special character which get interpreted by shell, the package name and the version should be enclosed within double quotes::
fr: Il est aussi possible de préciser une version minimum exacte directement depuis la ligne de commande. Utiliser des caractères de comparaison tel que ``>``, ``<`` ou d'autres caractères spéciaux qui sont interprétés par le shell, le nom du paquet et la version doivent être mis entre guillemets ::

source: Normally, if a suitable module is already installed, attempting to install it again will have no effect. Upgrading existing modules must be requested explicitly::
fr: Normalement, si un module approprié est déjà installé, l'installer à nouveau n'aura aucun effet. La mise à jour de modules existants doit être demandée explicitement : ::

source: More information and resources regarding ``pip`` and its capabilities can be found in the `Python Packaging User Guide <https://packaging.python.org>`__.
fr: Plus d'informations et de ressources concernant ``pip`` et ses capacités peuvent être trouvées dans le `Python Packaging User Guide <https://packaging.python.org>`__.

source: Creation of virtual environments is done through the :mod:`venv` module. Installing packages into an active virtual environment uses the commands shown above.
fr: La création d'environnements virtuels est réalisée grâce au module :mod:`venv`. Installer des paquets au sein de l'environnement virtuel courant utilise les commandes montrées précédemment.

source: `Python Packaging User Guide: Installing Python Distribution Packages <https://packaging.python.org/installing/>`__
fr: `Guide Utilisateur de l'Empaquetage Python : Installer les paquets de la distribution Python <https://packaging.python.org/installing/>`__

source: How do I ...?
fr: Comment puis-je ...?

source: These are quick answers or links for some common tasks.
fr: Ce sont des réponses rapides ou des liens pour certaines tâches courantes.

source: ... install ``pip`` in versions of Python prior to Python 3.4?
fr: ... Installer ``pip`` avec une version de Python antérieures à la 3.4 ?

source: Python only started bundling ``pip`` with Python 3.4. For earlier versions, ``pip`` needs to be "bootstrapped" as described in the Python Packaging User Guide.
fr: Python n'a commencé à fournir ``pip`` depuis Python 3.4. Pour les versions précédentes, ``pip`` a besoin d'être "amorcé" tel que décrit dans le *Python Packaging User Guide*.

source: `Python Packaging User Guide: Requirements for Installing Packages <https://packaging.python.org/installing/#requirements-for-installing-packages>`__
fr: `Guide Utilisateur de l'Empaquetage Python : Pré-requis pour installer des paquets <https://packaging.python.org/installing/#requirements-for-installing-packages>`__

source: ... install packages just for the current user?
fr: ... Installer des paquets juste pour l'utilisateur actuel ?

source: Passing the ``--user`` option to ``python -m pip install`` will install a package just for the current user, rather than for all users of the system.
fr: Donner l'option ``--user`` à ``python -m pip install`` lui fera installer un paquet juste pour l'utilisateur en cours, plutôt que pour tous les utilisateurs du système.

source: ... install scientific Python packages?
fr: ... Installer des paquets Python scientifiques ?

source: A number of scientific Python packages have complex binary dependencies, and aren't currently easy to install using ``pip`` directly. At this point in time, it will often be easier for users to install these packages by `other means <https://packaging.python.org/science/>`__ rather than attempting to install them with ``pip``.
fr: Un certain nombre de paquets scientifiques Python ont des dépendances binaires complexes, et ne sont pas actuellement faciles à installer directement avec ``pip``. Pour le moment, il est souvent plus simple pour les utilisateurs d'installer ces paquets par `d'autres moyens <https://packaging.python.org/science/>`__ plutôt que d'essayer de les installer avec ``pip``.

source: `Python Packaging User Guide: Installing Scientific Packages <https://packaging.python.org/science/>`__
fr: `Guide Utilisateur de l'Empaquetage Python : Installer des paquets scientifiques <https://packaging.python.org/science/>`__

source: ... work with multiple versions of Python installed in parallel?
fr: ... Travailler avec plusieurs versions de Python installés en parallèle ?

source: On Linux, Mac OS X, and other POSIX systems, use the versioned Python commands in combination with the ``-m`` switch to run the appropriate copy of ``pip``::
fr: Sous Linux, Max OS X et autres systèmes POSIX, utiliser les commandes Python de la version souhaitée en combinaison avec l'option ``-m`` permet de lancer la version appropriée de ``pip`` : ::

source: Appropriately versioned ``pip`` commands may also be available.
fr: Les versions appropriées des commandes ``pip`` peuvent aussi être disponibles.

source: On Windows, use the ``py`` Python launcher in combination with the ``-m`` switch::
fr: Sous Windows, utilisez le lanceur Python ``py`` en combinaison avec l'option ``-m`` ::

source: Common installation issues
fr: Les problèmes d'installation typiques

source: Installing into the system Python on Linux
fr: Installer dans le Python du système sur Linux

source: On Linux systems, a Python installation will typically be included as part of the distribution. Installing into this Python installation requires root access to the system, and may interfere with the operation of the system package manager and other components of the system if a component is unexpectedly upgraded using ``pip``.
fr: Sur les systèmes Linux, une installation de Python sera généralement inclue dans le cadre de la distribution. Installer dans cette installation de Python nécessite un accès *root* sur le système, et peut interférer avec le fonctionnement du gestionnaire de paquets du système et d'autres composants du système si un composant est mis à jour de façon inattendue en utilisant ``pip``.

source: On such systems, it is often better to use a virtual environment or a per-user installation when installing packages with ``pip``.
fr: Sur de tels systèmes, il est souvent préférable d'utiliser un environnement virtuel ou une installation par l'utilisateur lors de l'installation des paquets avec ``pip``.

source: Pip not installed
fr: Pip n'est pas installé

source: It is possible that ``pip`` does not get installed by default. One potential fix is::
fr: Il est possible que ``pip`` ne soit pas installé par défaut. Une solution est : ::

source: There are also additional resources for `installing pip. <https://packaging.python.org/tutorials/installing-packages/#install-pip-setuptools-and-wheel>`__
fr: Voir aussi `installing pip. <https://packaging.python.org/tutorials/installing-packages/#install-pip-setuptools-and-wheel>`__

source: Installing binary extensions
fr: Installation d'extensions binaires

source: Python has typically relied heavily on source based distribution, with end users being expected to compile extension modules from source as part of the installation process.
fr: Python a généralement beaucoup misé sur une distribution basée sur les sources, avec laquelle les utilisateurs finaux devaient compiler, lors de l'installation, les modules d'extension à partir des sources.

source: With the introduction of support for the binary ``wheel`` format, and the ability to publish wheels for at least Windows and Mac OS X through the Python Packaging Index, this problem is expected to diminish over time, as users are more regularly able to install pre-built extensions rather than needing to build them themselves.
fr: Avec l'introduction du format binaire ``wheel``, et la possibilité de publier des *wheels*, pour, au moins Windows et Mac OS X, via le *Python Package Index*, ce problème devrait diminuer au fil du temps, car les utilisateurs sont plus régulièrement en mesure d'installer des extensions précompilées plutôt que de devoir les compiler eux-mêmes.

source: Some of the solutions for installing `scientific software <https://packaging.python.org/science/>`__ that are not yet available as pre-built ``wheel`` files may also help with obtaining other binary extensions without needing to build them locally.
fr: Certaines solutions pour installer des `paquets scientifiques <https://packaging.python.org/science/>`__ qui ne sont pas encore disponibles comme ``wheel`` pré-construites peuvent aussi aider à obtenir d'autres extensions binaires sans devoir les construire localement.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/extensions/>`__
fr: `Guide Utilisateur de l'Empaquetage Python : Extensions binaires <https://packaging.python.org/extensions/>`__
